[{"name": "Titan Quest", "details_link": "https://www.metacritic.com/game/pc/titan-quest", "publisher": "THQ", "release_date": "Jun 26 2006", "developers": ["Iron Lore Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/1a861946c880292ffbbb01dbd3e040b2-98.jpg", "descriptions": "From the co-creator of Age of Empires, Brian Sullivan, comes an all-new action role-playing game set in the mythical worlds of ancient Greece and Egypt. The Titans, gods before the gods, have escaped from their eternal prison to wreak havoc on the world. In this titanic struggle between oldFrom the co-creator of Age of Empires, Brian Sullivan, comes an all-new action role-playing game set in the mythical worlds of ancient Greece and Egypt. The Titans, gods before the gods, have escaped from their eternal prison to wreak havoc on the world. In this titanic struggle between old and new gods it is the heroes of humankind who will ultimately determine the fate of all existence. The player quests throughout the ancient world in a race to uncover the secrets needed to once again imprison these ancient gods. Journeying to fabled locations such as the Parthenon, the maze at Knossos, the Great Pyramids, and the Hanging Gardens of Babylon, the player will have to overcome terrifying monsters and mythical beasts. A flexible class system allows almost limitless ways for the player to develop their character. Skills can be customized in many ways, and never become obsolete. [THQ]… Expand"}, {"name": "Call of Duty 2: Big Red One", "details_link": "https://www.metacritic.com/game/playstation-2/call-of-duty-2-big-red-one", "publisher": "Activision", "release_date": "Nov  1 2005", "developers": ["Treyarch"], "platforms": "PlayStation 2", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/f6928c37713dd61cd0fc78abf7522f78-98.jpg", "descriptions": "Experience a wide variety of missions on land, sea, and in the air, with the aid of over three dozen authentic American, Italian, French, and German weapons. Charge into battle together as Allied and Axis planes duel overhead, artillery explosions shake the ground and choke the air, andExperience a wide variety of missions on land, sea, and in the air, with the aid of over three dozen authentic American, Italian, French, and German weapons. Charge into battle together as Allied and Axis planes duel overhead, artillery explosions shake the ground and choke the air, and bullets and shrapnel streak past you and your squadmates. Experience war-torn Europe and Africa, from the blistering desert expanses of Tunisia and Libya to the beautiful yet deadly countrysides of Italy, France, Belgium, and Germany. You are thrust into the role and story of a member of The Big Red One, America’s most heroic and decorated infantry division. Experience the camaraderie of a single tight-knit army squad, bound together through the chaos of battle over the course of the entire game. Yes, you will suffer casualties; you must not suffer defeat. Through all-new AI and animation, your allies (and your enemies) just got a lot smarter. Your squad will now make better use of environmental cover and tactical Maneuvers, such as flanking, envelopment, and fire-and-maneuver behaviors. Hear your allies reacting to the events on the battlefield with contextually accurate battle chatter. [Activision]… Expand"}, {"name": "Tom Clancy's Ghost Recon: Shadow Wars", "details_link": "https://www.metacritic.com/game/3ds/tom-clancys-ghost-recon-shadow-wars", "publisher": "Ubisoft", "release_date": "Mar 22 2011", "developers": ["Ubisoft"], "platforms": "3DS", "genres": ["Action", "Strategy", "Shooter", "Turn-Based", "First-Person", "Modern", "General", "Modern", "Tactical", "Modern"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/12cc2d3436b3ceb3c94b965476af558a-98.jpg", "descriptions": "Lead the Ghosts, the most elite special forces unit in the US Army, across multiple tactical missions to prevent a war from breaking out."}, {"name": "Plants vs. Zombies: Battle for Neighborville", "details_link": "https://www.metacritic.com/game/playstation-4/plants-vs-zombies-battle-for-neighborville", "publisher": "Electronic Arts", "release_date": "Oct 18 2019", "developers": ["PopCap"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 24 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 77, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/bfc71b1c31a75f88e4d1516c9841d3c8-98.jpg", "descriptions": "Welcome to Neighborville, where all is well. Except that a crazy new coniferous conflict between brain-less and botanicals is brewing! What are you gonna do – call the crops? Soil your plants? It’s time to kick some grass in the wackiest shooter experience between plants and zombies yet:Welcome to Neighborville, where all is well. Except that a crazy new coniferous conflict between brain-less and botanicals is brewing! What are you gonna do – call the crops? Soil your plants? It’s time to kick some grass in the wackiest shooter experience between plants and zombies yet: Plants vs. Zombies: Battle for Neighborville™.… Expand"}, {"name": "Deathtrap", "details_link": "https://www.metacritic.com/game/pc/deathtrap", "publisher": "NeocoreGames", "release_date": "Feb  4 2015", "developers": ["NeocoreGames"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Strategy", "General"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/61dc9ed3952f9643610c61ec2b97e1c1-98.jpg", "descriptions": "Deathrap is a unique mixture of action-RPGs and Tower Defense games, a game of vicious tricks, killing machines, rotating blades and splattering blood."}, {"name": "Yomawari: Midnight Shadows", "details_link": "https://www.metacritic.com/game/playstation-4/yomawari-midnight-shadows", "publisher": "NIS America", "release_date": "Oct 24 2017", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "genres": ["Action Adventure", "Adventure", "General", "Survival"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/861ceadc7452b4f63c5f8b4c4fd57fbd-98.jpg", "descriptions": "The follow-up to 2016’s cult horror hit Yomawari: Night Alone, Yomawari: Midnight Shadows introduces two brand-new girls, Yui and Haru, to the night and the spirits who haunt it."}, {"name": "Excitebots: Trick Racing", "details_link": "https://www.metacritic.com/game/wii/excitebots-trick-racing", "publisher": "Nintendo", "release_date": "Apr 20 2009", "developers": ["Monster Games Inc."], "platforms": ["Wii U", "Wii"], "genres": ["Driving", "Racing", "General", "Arcade", "Arcade", "Automobile"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/4eb6980aa102767a3ac10c134b9c8ee0-98.jpg", "descriptions": "High-speed action. Robotic insect and animal racers. Wii Wheel controls. Bowling, poker, clowns - and sandwiches! Add them all together and you get the wild, nonstop fun of Excitebots: Trick Racing. This game takes the big-air thrills and simple pick-up-and-play controls of Excite Truck andHigh-speed action. Robotic insect and animal racers. Wii Wheel controls. Bowling, poker, clowns - and sandwiches! Add them all together and you get the wild, nonstop fun of Excitebots: Trick Racing. This game takes the big-air thrills and simple pick-up-and-play controls of Excite Truck and ramps up the fun with a constant barrage of funky challenges and mini-games performed at blinding speed. Players shoot goals, throw pies and even play poker in the middle of rowdy races around off-road tracks. Having your vehicles drive, walk or fly around the track quickly is one thing, but it's more important to go around in style. Players earn stars for huge jumps, cool tricks and daring feats at high speed. Six players can race online via Nintendo Wi-Fi Connection in both Excite Race and Poker Race modes. If friends can't join online, players can exchange ghost data via WiiConnect24 and challenge their friends to outdo their most daring tricks. [Nintendo]… Expand"}, {"name": "Kokuga", "details_link": "https://www.metacritic.com/game/3ds/kokuga", "publisher": "G.Rev", "release_date": "Jun 27 2013", "developers": ["G.Rev"], "platforms": "3DS", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Top-Down"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/ea7efc9b1b3dfd0e0c1cbba87859d1cc-98.jpg", "descriptions": "After months of bitter conflict with its neighbor, country A is preparing to unleash its latest machine of war, code-named Kokuga. With access to 9 destructive weapons and an array of power-ups, the compact mobile tank is an elite military machine.\r Highly-reputed boutique game studioAfter months of bitter conflict with its neighbor, country A is preparing to unleash its latest machine of war, code-named Kokuga. With access to 9 destructive weapons and an array of power-ups, the compact mobile tank is an elite military machine.\r Highly-reputed boutique game studio G.rev is pleased to offer this old-school strategic shooter for the Nintendo 3DS.\r Players are tasked with piloting Kokuga, and must destroy tanks, drones, gun towers and other mecha in 12 different training missions. Each stage culminates with a boss fight, pitting the player against massive heavily-armed bosses. Upon receiving orders for active duty, the player is thrust into action against enemy forces.\r Structured so gamers have maximum freedom in their game experience, Kokuga is great for both casual game sessions or long challenges.\r Local and Download Play is supported, so assemble your squad of up to four players! Develop new strategies and help out your teammates by coordinating card use.… Expand"}, {"name": "Spider-Man: Web of Shadows", "details_link": "https://www.metacritic.com/game/ds/spider-man-web-of-shadows", "publisher": "Activision", "release_date": "Oct 21 2008", "developers": ["Griptonite Games"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Platformer", "General", "Beat-'Em-Up", "Open-World", "2D", "2D"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/9ada41c4ca0c3363633748444fb3928b-98.jpg", "descriptions": "New York City has been invaded and only Spider-Man can save it. The fate of New York is in your hands...Take Control. Spider-Man: Web of Shadows gives you an unprecedented level of gameplay choice, including, for the first time, control over the game's direction and outcome. Choose howNew York City has been invaded and only Spider-Man can save it. The fate of New York is in your hands...Take Control. Spider-Man: Web of Shadows gives you an unprecedented level of gameplay choice, including, for the first time, control over the game's direction and outcome. Choose how Spider-Man fights, which powers to upgrade, who in the Marvel universe to fight with or against, and the fate of New York City itself. Choose wisely. [Activision]… Expand"}, {"name": "The Missing: JJ Macfield and the Island of Memories", "details_link": "https://www.metacritic.com/game/playstation-4/the-missing-jj-macfield-and-the-island-of-memories", "publisher": "Arc System Works", "release_date": "Oct 15 2018", "developers": ["White Owls"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/15b8beb2c6440e5fc324a228867aae2c-98.jpg", "descriptions": "The blunt disappearance of a close friend encourages J.J. to go look for her on the strange Island of Memories. You can’t die on this nightmare island, even if you’re seriously injured. No matter how many times J.J.’s brought back from the grips of death, she drags her mangled body deeperThe blunt disappearance of a close friend encourages J.J. to go look for her on the strange Island of Memories. You can’t die on this nightmare island, even if you’re seriously injured. No matter how many times J.J.’s brought back from the grips of death, she drags her mangled body deeper into the woods to find her friend.… Expand"}, {"name": "Galactic Civilizations: Altarian Prophecy", "details_link": "https://www.metacritic.com/game/pc/galactic-civilizations-altarian-prophecy", "publisher": "Strategy First", "release_date": "Nov 12 2004", "developers": ["Stardock"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Real-Time", "Sci-Fi", "4X"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/2a1b89e3cdd423d2e79a5e1867f79d43-98.jpg", "descriptions": "Galactic Civilizations: Altarian Prophecy is an expansion pack to Stardock's award winning space strategy game, Galactic Civilizations. The expansion pack adds a host of new features, content, and other enhancements to the game to add depth and much greater replayability. In the late 22ndGalactic Civilizations: Altarian Prophecy is an expansion pack to Stardock's award winning space strategy game, Galactic Civilizations. The expansion pack adds a host of new features, content, and other enhancements to the game to add depth and much greater replayability. In the late 22nd century, humanity came into contact with 5 major alien civilizations. These civilizations were called, the Drengin Empire, the Torian Confederation, the Arcean Empire, the Yor Collective and the Altarian Republic. Of these 5, the Altarians were the most curious to us. Not for their cultural traits or their technology but because they happened to look human. How was this possible? The \"Altarian Prophecy\" is a campaign that takes the player on a multi-game journey to solve the mystery alluded to in Galactic Civilizations. In doing so, it introduces two new civilizations: The Dominion of the Korx and the Drath. These two civilizations hold the secret to Altaria's past, but worse, they know the Altarian Prophecy that for tells the destruction of the galaxy that is connected to Altaria's past. [Strategy First]… Expand"}, {"name": "One Piece Odyssey", "details_link": "https://www.metacritic.com/game/xbox-series-x/one-piece-odyssey", "publisher": "Bandai Namco Games", "release_date": "Jan 13 2023", "developers": ["ILCA", "Inc."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 77, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/8f055e0bf5722c1c5437452e584a69f7-98.jpg", "descriptions": "Join this brand-new RPG featuring new character and monster designs produced by Eiichiro Oda, the author of ONE PIECE. The game is also complemented by the beautiful music of Motoi Sakuraba, a composer well known for his various contributions to video games such as the Dark Souls and TalesJoin this brand-new RPG featuring new character and monster designs produced by Eiichiro Oda, the author of ONE PIECE. The game is also complemented by the beautiful music of Motoi Sakuraba, a composer well known for his various contributions to video games such as the Dark Souls and Tales of series.During their voyage, the Straw Hats, led by Monkey D. Luffy are swallowed by a huge storm at sea. They end up on a mysterious island full of nature amidst the storm and become separated from each other. The crew sets out on a new adventurous journey filled with wonders of a raging nature, powerful enemies, and strange encounters with island locals.Work together with Luffy and his crew to set sail once again!… Expand"}, {"name": "Graceful Explosion Machine", "details_link": "https://www.metacritic.com/game/switch/graceful-explosion-machine", "publisher": "Vertex Pop", "release_date": "Apr  6 2017", "developers": ["Vertex Pop"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/0bf7270a14c5bc9b96e0eecd34e8c954-98.jpg", "descriptions": "Skillfully pilot the Graceful Explosion Machine, a fighter ship armed with a ludicrously overpowered quad-weapon array! Lost in deep space, you'll shoot, dash and combo your way through jewel-hued alien worlds, fighting crystalline enemies to find a way home. The GEM fighter is the mostSkillfully pilot the Graceful Explosion Machine, a fighter ship armed with a ludicrously overpowered quad-weapon array! Lost in deep space, you'll shoot, dash and combo your way through jewel-hued alien worlds, fighting crystalline enemies to find a way home. The GEM fighter is the most advanced single pilot fighter in the galaxy, offering precise controls, nimble movement, and devastating firepower. [Nintendo.com]… Expand"}, {"name": "UEFA EURO 2008", "details_link": "https://www.metacritic.com/game/playstation-2/uefa-euro-2008", "publisher": "Electronic Arts", "release_date": "May 19 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 77, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/0/0d27e1dd62cf83014d599df22c08d366-98.jpg", "descriptions": "UEFA EURO 2008 captures the look and feel of the journey from qualification to the finals with rain and mud dynamics that impact playing conditions, real-time player ratings that change based on player performance, and a penalty kick mode that re-creates the elation and agony of a penaltyUEFA EURO 2008 captures the look and feel of the journey from qualification to the finals with rain and mud dynamics that impact playing conditions, real-time player ratings that change based on player performance, and a penalty kick mode that re-creates the elation and agony of a penalty shoot-out as if you were on the pitch. Experience the thrill of scoring the goal that sends your country through to the next round and then choose how to celebrate it with all-new interactive user-controlled celebrations. Captain your country, play alongside your heroes, and inspire them to championship glory in the official videogame of UEFA EURO 2008. A new game mode called Captain Your Country enables gamers to customize them on the pitch and wear the shirt of their national team. Work through eight status levels to earn the captaincy of your team and then lead your country into battle for championship glory against your rivals. Go online in Battle of the Nations to earn status points for yourself and your country in a competition for global supremacy. Go for the biggest upsets to earn the most points and then watch you and your country move up the leader boards. Face the challenge and pressure of competing in the championship rounds in the EURO Online Knockout Draw to test your skills against the world's best. [Electronic Arts]… Expand"}, {"name": "Pop Island", "details_link": "https://www.metacritic.com/game/ds/pop-island", "publisher": "odenis studio", "release_date": "Dec  7 2009", "developers": ["odenis studio"], "platforms": "DS", "num_players": "1-8 ", "genres": ["Action", "General", "General"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/f0a9cf1e81ab530c01287dd50d2d8823-98.jpg", "descriptions": "[DSiWare]  Discover a joyful universe where playing is always a pleasure with Pop Island. Colorful and fun, Pop Island is an action-packed capture-the-flag game. Pick a team to join, then run, jump and spin your way around the island in an attempt to collect the priceless flags hidden[DSiWare]  Discover a joyful universe where playing is always a pleasure with Pop Island. Colorful and fun, Pop Island is an action-packed capture-the-flag game. Pick a team to join, then run, jump and spin your way around the island in an attempt to collect the priceless flags hidden throughout it. Become a surfing penguin, a flying fish or a waterskiing crocodile as you go all out for victory, unlocking 12 more joyful animals as you rack up points across eight different planets. You might even end up competing as a skateboarding mammoth. Playing alone is plenty of fun, but the madcap action reaches a new level when your friends get involved. By sharing the demo of the game via DS Download Play, up to seven more people with their own Nintendo DSi systems can use a local wireless connection to join you for some head-to-head or cooperative action. With plenty of power-ups, you'll need to concentrate on capturing more than just the rival team's flag to claim victory. [Nintendo]… Expand"}, {"name": "NBA Live 06", "details_link": "https://www.metacritic.com/game/playstation-2/nba-live-06", "publisher": "EA Sports", "release_date": "Sep 26 2005", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/ffdc29c350feb2b886ccb9b38e91d76f-98.jpg", "descriptions": "Freestyle Superstars: You are in control of the top NBA stars, performing like their real-life counterparts based on distinct character types, including Power, Playmaker, Stopper and more. Authentic 5-on-5 Gameplay: The all-new animation system helps to visually present the up-tempo,Freestyle Superstars: You are in control of the top NBA stars, performing like their real-life counterparts based on distinct character types, including Power, Playmaker, Stopper and more. Authentic 5-on-5 Gameplay: The all-new animation system helps to visually present the up-tempo, fast-break brand of basketball that makes the NBA thrive. Also featured, is an improved transition game and a more physical brand of play with collisions and dunked-on scenarios. New Player Visuals: A new graphics engine now has player models not only playing and acting like their real life counterparts, but looking the part with striking detail and realism. [Electronic Arts]… Expand"}, {"name": "Republique: Episode 1 - Exordium", "details_link": "https://www.metacritic.com/game/pc/republique-episode-1---exordium", "publisher": "GungHo", "release_date": "Feb 25 2015", "developers": ["Camouflaj", "LLC"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/76f1a5c343174efc76464937b7f46cc3-98.jpg", "descriptions": "Republique Remastered is a topical stealth-action game that explores the perils of government surveillance in the Internet Age."}, {"name": "Prince of Persia: The Forgotten Sands", "details_link": "https://www.metacritic.com/game/wii/prince-of-persia-the-forgotten-sands", "publisher": "Ubisoft", "release_date": "May 18 2010", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/ad8f0d68eb055affe9179ae27d015cc0-98.jpg", "descriptions": "Prince of Persia: The Forgotten Sands for Wii is a new installment in the popular Prince of Persia series and presents a new adventure within the Sands of Time universe. After leaving his father’s kingdom to prove his worth, the Prince is drawn toward a mysterious realm. He quickly discoversPrince of Persia: The Forgotten Sands for Wii is a new installment in the popular Prince of Persia series and presents a new adventure within the Sands of Time universe. After leaving his father’s kingdom to prove his worth, the Prince is drawn toward a mysterious realm. He quickly discovers that he must harness his acrobatic abilities and powers over the environment to not only survive, but to save a mystic palace from unfathomable evil. By utilizing the Prince’s acrobatic prowess, players perform unparalleled feats from maneuvering through treacherous traps and combating massive enemies, to solving elaborate puzzles in an effort to survive. The Prince will possess supreme mastery over his environment and enemies. By manipulating his power over sand, The Prince will uncover new areas to explore that will only be accessible by wielding his new powers, skills and abilities. [Ubisoft]… Expand"}, {"name": "Mega Man Legacy Collection", "details_link": "https://www.metacritic.com/game/3ds/mega-man-legacy-collection", "publisher": "Capcom", "release_date": "Feb 23 2016", "developers": ["Digital Eclipse"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/c3e95fd5198056f4776c2f8f65c4f598-98.jpg", "descriptions": "Mega Man Legacy Collection is a celebration of the 8-bit history of Capcoms iconic Blue Bomber. Featuring faithful reproductions of the series origins with the original six Mega Man games, the Legacy Collection will remind long-time fans and introduce newcomers to what made Mega Man such aMega Man Legacy Collection is a celebration of the 8-bit history of Capcoms iconic Blue Bomber. Featuring faithful reproductions of the series origins with the original six Mega Man games, the Legacy Collection will remind long-time fans and introduce newcomers to what made Mega Man such a popular and iconic character. Mega Man Legacy Collection will feature all six games and more!\r In addition to the six Mega Man games, Mega Man Legacy Collection features new ways to experience the classic games with the Museum Mode and new Challenge Mode. Challenge Mode remixes gameplay segments from all six games, with plenty of scaling difficulty objectives for experienced players to conquer yet serving as a good starting point for new players, too. Museum Mode contains a comprehensive collection of history, high-res art and original concept pieces  a mega treat for any fan of Mega Man and video game history.\r FEATURES\r * Six classic games in one  Play a piece of video game history with the original six Mega Man games and experience the origins of the classic series.\r* 8-bit style with HD flair  The games retain their retro 8-bit style with an added HD finish, giving a crisp, clean look to the charming, classic sprites.\r* Challenge remix mode for new and veteran players  The robust new Challenge Mode remixes gameplay from all six games for a new type of challenge. It provides both increasingly difficult trials for experienced players and also teaches newcomers to become familiar with the style of the games and tackle some of the trickier areas.\r* Museum of the era  The Museum Mode features a massive repository of history and art collected from the era of the games in this collection. Take a look back at the history of Mega Man with loads of information, high-res art, concept pieces, sketches and more in the Museum.\r* Developed with an all-new engine  Using the newly developed Eclipse Engine, Capcom and Digital Eclipse are able to archive these six pieces of video game history with faithful reproductions of the originals for a new generation of gamers.\r* Leaderboards and video replays  Fans will be able to watch video replays of the top players on the leaderboards, showcasing a whole new generation of Mega Man talent!… Expand"}, {"name": "Mutant Storm Reloaded", "details_link": "https://www.metacritic.com/game/xbox-360/mutant-storm-reloaded", "publisher": "PomPom Games", "release_date": "Nov 22 2005", "developers": ["PomPom Games"], "platforms": ["PC", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/06e166814dae9979400dd7ccc6d6395e-98.jpg", "descriptions": "[Xbox Live Arcade]  Mutant Storm Reloaded features the official training grounds for those who wish to master Blastikkidoo - the Art of Blasting. Just as in martial arts, you begin with a white belt and earn higher belts as you progress. As you move to higher belts, the difficulty increases,[Xbox Live Arcade]  Mutant Storm Reloaded features the official training grounds for those who wish to master Blastikkidoo - the Art of Blasting. Just as in martial arts, you begin with a white belt and earn higher belts as you progress. As you move to higher belts, the difficulty increases, which in turn hones your skill. Your goal is simple: Blast through 89 levels inhabited by an array of nasty beasties and live to brag about it. Survive, and you could earn the elusive black belt. Play single player, or two-player cooperative on the same console in either Adventure Mode or Tally Mode. Post your scores to the Xbox Live leaderboards. Experience all-new graphics and sound effects. [Xbox.com]… Expand"}, {"name": "Mortal Kombat: Armageddon", "details_link": "https://www.metacritic.com/game/xbox/mortal-kombat-armageddon", "publisher": "Midway", "release_date": "Oct 11 2006", "developers": ["Midway"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/e422efccba1eca2572c2bef7b849ae17-98.jpg", "descriptions": "The fury of Mortal Kombat has brought the realms to the brink of total destruction. Every warrior has been summoned to this last epic battle, where survival depends on their ability to... FIGHT!"}, {"name": "NFL Street 2", "details_link": "https://www.metacritic.com/game/gamecube/nfl-street-2", "publisher": "EA Sports Big", "release_date": "Dec 22 2004", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/a03d3ec8e32543afaac91aef1247d70e-98.jpg", "descriptions": "Get ready for more fancy moves, new modes, and online play in the sequel to NFL Street. Now you can jump 15 feet high to make catches off the wall, dive into the end zone, or pull off wild jukes. You can master these new abilities in seven new game modes, including \"crush theGet ready for more fancy moves, new modes, and online play in the sequel to NFL Street. Now you can jump 15 feet high to make catches off the wall, dive into the end zone, or pull off wild jukes. You can master these new abilities in seven new game modes, including \"crush the carrier\" and \"own the city.\" Create your own player, master new skills, and hit the streets both offline and online.… Expand"}, {"name": "MLB The Show 22", "details_link": "https://www.metacritic.com/game/playstation-5/mlb-the-show-22", "publisher": "Sony Interactive Entertainment", "release_date": "Apr  1 2022", "developers": ["Sony Interactive Entertainment San Diego Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 8 ", "genres": ["Sports", "Team", "Baseball", "Sim"], "meta_score": 77, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/66a50976b2538b8feefca2da4e5066cd-98.jpg", "descriptions": "Diamond Dynasty is back. Play, collect, and build on your fantasy card collection and bring to life on the diamond*. Try the new Mini Seasons mode, where each season brings new challenges as you face off against a new set of competition. Create and use multiple Ballplayers, beyond your RoadDiamond Dynasty is back. Play, collect, and build on your fantasy card collection and bring to life on the diamond*. Try the new Mini Seasons mode, where each season brings new challenges as you face off against a new set of competition. Create and use multiple Ballplayers, beyond your Road to the Show personalized Baseball RPG experience, and customize your Ballplayers exactly how you want to aid in your progression. Face your friends with cross-platform play**. With cross progression, continue your progress and earn and use content on other console platforms. Stepping up to the plate for the first time? Tailor your experience with gameplay styles and two new difficulty settings to help you get the hang of the basics. Play March to October in your style, with updated mode tools to utilize custom uniforms, logos, and created stadiums. Live out your dream Baseball matchups with new Legends joining the diamond.\r… Expand"}, {"name": "Story of Seasons: Friends of Mineral Town", "details_link": "https://www.metacritic.com/game/switch/story-of-seasons-friends-of-mineral-town", "publisher": "XSEED Games", "release_date": "Jul 14 2020", "developers": ["Marvelous Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/95c02f86ecfaa3d2dc44e3c48428c0f9-98.jpg", "descriptions": "Originally released for the Nintendo Game Boy Advance in 2003, STORY OF SEASONS: Friends of Mineral Town is a complete remake that will let series fans revisit the charming world of Mineral Town, while also introducing it to a new generation of farmers. In this peaceful setting, players willOriginally released for the Nintendo Game Boy Advance in 2003, STORY OF SEASONS: Friends of Mineral Town is a complete remake that will let series fans revisit the charming world of Mineral Town, while also introducing it to a new generation of farmers. In this peaceful setting, players will grow crops, take care of animals, and build relationships with villagers.  * Rediscover one of STORY OF SEASONS' most beloved entries: This Nintendo Switch remake of the classic game preserves the compelling gameplay, colourful characters and rustic charm of the original 2003 Game Boy Advance release. With buttery-smooth HD visuals and a heartwarming reimagining of the iconic locale, series veterans and newcomers will soon find themselves welcomed by the gentle rhythms of Mineral Town.\r * Live the simple life in Mineral Town: Tap into the power of nature as you breathe life back into your grandfather's farm, tending crops and raising livestock to earn your keep. With more than 20 varieties of crops to grow, and animals ranging from alpacas to angora bunnies, no day is the same as seasons cycle and new skills await.\r * Forge friendships with the townsfolk and win their hearts: Mineral Town is full of friendly faces willing to help you find your feet in your new hometown. Get to know the locals and learn their stories as you go about your daily life, and you might even find love along the way!\r * Activities galore for days off from the farm: Whether it's high-tailing in horseraces, catching a champion trout or showcasing your culinary creativity, the busy calendar full of festivals means that there's never a dull day in Mineral Town. If you're looking for a quieter time, take yourself away to the local hot spring, delve deep into the mines, or seek out the seasonal secrets of the town.… Expand"}, {"name": "Vacation Simulator", "details_link": "https://www.metacritic.com/game/pc/vacation-simulator", "publisher": "Owlchemy Labs", "release_date": "Apr  9 2019", "developers": ["Owlchemy Labs"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "General", "Virtual", "Virtual Life", "Career"], "meta_score": 77, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/6cb5b03dbec201ed787e71ea5993b293-98.jpg", "descriptions": "Welcome to the Vacation Simulator: a rough approximation of VACATION inspired by real human NOT JOBBING, brought to you by the same robots behind the Job Simulator. Reallocate your bandwidth and get ready to splash, s’more, snowball, and selfie your way to optimal relaxation."}, {"name": "Nintendo Land", "details_link": "https://www.metacritic.com/game/wii-u/nintendo-land", "publisher": "Nintendo", "release_date": "Nov 18 2012", "developers": ["Nintendo"], "platforms": "Wii U", "num_players": "1-5 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/3084152de7db7b4c4d6051293536bb5c-98.jpg", "descriptions": "Nintendo Land is a theme park featuring 12 different attractions, each with its own play on a Nintendo franchise. Each attraction features it's own special gameplay experiences made possible by the Wii U controller. Depending on the particular attraction, players can compete individually orNintendo Land is a theme park featuring 12 different attractions, each with its own play on a Nintendo franchise. Each attraction features it's own special gameplay experiences made possible by the Wii U controller. Depending on the particular attraction, players can compete individually or against other players, or even team up to play cooperatively. Up to 5 players can participate in dynamic multiplayer modes in select attractions. The experiences change each time, depending on whether players are using the GamePad, holding a Wii Remote or just watching others play on the TV screen.… Expand"}, {"name": "Sonic Generations", "details_link": "https://www.metacritic.com/game/pc/sonic-generations", "publisher": "Sega", "release_date": "Nov  3 2011", "developers": ["Sega", "Sonic Team"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/10643a5ed9cb60339efbb15514c80054-98.jpg", "descriptions": "Set across three defining eras from 20 years of Sonic the Hedgehog video game history, the instantly recognisable environments of Sonic Generations have been re-built in stunning HD and are now playable in both classic side scrolling 2D from 1991, as well as modern 3D style found in Sonic'sSet across three defining eras from 20 years of Sonic the Hedgehog video game history, the instantly recognisable environments of Sonic Generations have been re-built in stunning HD and are now playable in both classic side scrolling 2D from 1991, as well as modern 3D style found in Sonic's most recent adventures.  Each incarnation of Sonic in Sonic Generations comes complete with his trademark special move, Spin Dash and Spin Attack for Classic Sonic, and Homing Attack and Sonic Boost for Modern Sonic.  An innovative new interactive menu system allows for complete immersion in Sonic's universe with favourite characters and hidden treasures gradually being revealed throughout the game.  … Expand"}, {"name": "Elite: Dangerous", "details_link": "https://www.metacritic.com/game/playstation-4/elite-dangerous", "publisher": "Frontier Developments", "release_date": "Jun 27 2017", "developers": ["Frontier Developments"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "Massively Multiplayer", "genres": ["Simulation", "Space", "Civilian"], "meta_score": 77, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/14ce9d64a65d00a3d06b8045a3c5b2f2-98.jpg", "descriptions": "Starting with only a small starship and a few credits, do whatever it takes to earn the skill, knowledge, wealth and power to survive in a cutthroat galaxy and stand among the ranks of the iconic Elite. \r\rIn an age of galactic superpowers and interstellar war, every player's storyStarting with only a small starship and a few credits, do whatever it takes to earn the skill, knowledge, wealth and power to survive in a cutthroat galaxy and stand among the ranks of the iconic Elite. \r\rIn an age of galactic superpowers and interstellar war, every player's story influences the connected galaxy and evolving narrative. Governments fall, battles are lost and won, and humanity's frontier is reshaped, all by players' actions. Explore, trade, fight and survive in Elite: Dangerous' massively multiplayer galaxy, and challenge the world in CQC: Close Quarter Combat. Become Elite in the interstellar PVP arenas of the ultimate 34th century gladiatorial contest. \r\r400 Billion Star Systems. Infinite Freedom. Blaze Your Own Trail.… Expand"}, {"name": "Kingdom Hearts HD 1.5 ReMIX", "details_link": "https://www.metacritic.com/game/playstation-3/kingdom-hearts-hd-15-remix", "publisher": "Square Enix", "release_date": "Sep 10 2013", "developers": ["Square Enix"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/f0178d058f7e7f65f00f90a2147e823e-98.jpg", "descriptions": "In KINGDOM HEARTS HD 1.5 ReMIX, players can indulge in the KINGDOM HEARTS universe once again with Sora, Riku and the timeless cast of Disney characters, including Mickey, Donald and Goofy. The game marks the first time a KINGDOM HEARTS title has made its way onto the PlayStation 3 system.In KINGDOM HEARTS HD 1.5 ReMIX, players can indulge in the KINGDOM HEARTS universe once again with Sora, Riku and the timeless cast of Disney characters, including Mickey, Donald and Goofy. The game marks the first time a KINGDOM HEARTS title has made its way onto the PlayStation 3 system. The fully remastered HD compilation includes KINGDOM HEARTS FINAL MIX, previously exclusive to the Japanese market, and KINGDOM HEARTS Re:Chain of Memories. The compilation also features HD cinematic story videos from  KINGDOM HEARTS 358/2 Days, enhanced gameplay mechanics and PlayStation 3 system trophies.… Expand"}, {"name": "WRC 8 FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/pc/wrc-8-fia-world-rally-championship", "publisher": "Bigben Interactive", "release_date": "Sep  5 2019", "developers": ["Kylotonn"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 77, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/4a0861ebf6ba706ab0fd49a95b1cd9cc-98.jpg", "descriptions": "The most complete and authentic official WRC simulation yet. New physics for all surfaces, a completely redesigned career mode, dynamic weather conditions, 50 teams, 14 countries, 100 tracks, weekly challenges and an eSports mode."}, {"name": "Starhawk", "details_link": "https://www.metacritic.com/game/playstation-3/starhawk", "publisher": "SCEA", "release_date": "May  8 2012", "developers": ["LightBox Interactive"], "platforms": "PlayStation 3", "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/4a7248712036d652f670a24fe8284947-98.jpg", "descriptions": "Starhawk is a 3rd Person shooter adventure in which you can instantly change the battlefield in the heat of combat. In the future, humanity’s final hope lies in the lawless frontier of space where factions battle over the universe’s most valuable resource - Rift Energy. Caught in the middleStarhawk is a 3rd Person shooter adventure in which you can instantly change the battlefield in the heat of combat. In the future, humanity’s final hope lies in the lawless frontier of space where factions battle over the universe’s most valuable resource - Rift Energy. Caught in the middle is Emmett Graves, an outcast gunslinger who is drawn back to the planet that abandoned him, to face a fierce outlaw and his warband of followers. Experience frenzied combat on foot, in vehicles, or in the air and discover a new type of shooter gameplay with the new \"Build & Battle\" system. Gain the tactical advantage by calling upon an arsenal of weapons, vehicles, and fortifications, violently delivered from an orbiting drop ship to help turn the tide of battle. Engage in epic 32-player online battles and see maps dynamically change depending solely on each player's strategy or team up with friends and protect your claim against waves of AI opponents in online and offline Co-op modes.… Expand"}, {"name": "Skylanders Giants", "details_link": "https://www.metacritic.com/game/playstation-3/skylanders-giants", "publisher": "Activision", "release_date": "Oct 21 2012", "developers": ["Toys for Bob"], "platforms": ["3DS", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/badd1b4bade4a9a8cbefd4c60a21efb1-98.jpg", "descriptions": "Skylanders Giants is a new adventure for existing Skylanders toys that adds twenty new characters--including 8 giant ones--to the roster."}, {"name": "Yakuza 2", "details_link": "https://www.metacritic.com/game/playstation-2/yakuza-2", "publisher": "Sega", "release_date": "Sep  9 2008", "developers": ["Amusement Vision"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/71ce47b128fec1b32860e5bdd85fa638-98.jpg", "descriptions": "Yakuza 2 plunges you once more into the violent Japanese underworld where respect and honor holds great importance. In intense brutal clashes with rival gangs, the police, and the Korean mafia, you will have opportunities to dole out more brutal punishment. Play as Kazuma Kiryu, the heroYakuza 2 plunges you once more into the violent Japanese underworld where respect and honor holds great importance. In intense brutal clashes with rival gangs, the police, and the Korean mafia, you will have opportunities to dole out more brutal punishment. Play as Kazuma Kiryu, the hero from the original Yakuza and explore Tokyo and now Osaka. Wander through the back alleys of Japan's underworld while trying to prevent an all-out gang war. Endless conflicts and surprise plot twists will immerse you in a dark shadowy world where only the strongest will survive. Yakuza 2 is created by noted producer Toshihiro Nagoshi with novelist Seishu Hase, the same creative forces behind Yakuza. Yakuza 2 authentically re-creates the city streets and illicit haunts of Japan's nightlife district, with memorable characters, cinematic style, free-roaming adventure, a gripping story, beautiful but deadly fighting, and deep gameplay. [Sega]… Expand"}, {"name": "Brain Age 2: More Training in Minutes a Day", "details_link": "https://www.metacritic.com/game/ds/brain-age-2-more-training-in-minutes-a-day", "publisher": "Nintendo", "release_date": "Aug 20 2007", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1-16 ", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/442d95644b066c9755a18f4668abadec-98.jpg", "descriptions": "(Also known as \"More Brain Training from Dr Kawashima: How Old Is Your Brain?\")  Brain Age 2: More Training in Minutes a Day contains all-new activities to challenge a player's gray matter. The title is a series of trainings designed to give the brain a workout. The 17 new, engaging(Also known as \"More Brain Training from Dr Kawashima: How Old Is Your Brain?\")  Brain Age 2: More Training in Minutes a Day contains all-new activities to challenge a player's gray matter. The title is a series of trainings designed to give the brain a workout. The 17 new, engaging activities are all designed to help work the brain. Whether players are playing simple songs on a piano keyboard or monitoring the photo finish of a footrace, they'll love this new mental workout. When starting a new game, players take a series of tests and get a score that shows how old their brain is. This number is called the \"DS Brain Age.\" With daily training over weeks and months, players strive to improve their mental acuity and lower their \"DS Brain Age.\" Progress is charted in graph form. Players can keep up to four save files on one game card. Sharing a game allows players to engage in a picture-drawing quiz or other challenges with family and friends. Players also can use DS Download Play to send a demo to friends or compete with up to 16 players in one of four fun modes. [Nintendo]… Expand"}, {"name": "Tiny Tina's Wonderlands", "details_link": "https://www.metacritic.com/game/xbox-series-x/tiny-tinas-wonderlands", "publisher": "2K Games", "release_date": "Mar 25 2022", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 77, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/77b56e935e41f777544a7f9ce2f15847-98.jpg", "descriptions": "Embark on an epic adventure full of whimsy, wonder, and high-powered weaponry! Bullets, magic, and broadswords collide across this chaotic fantasy world brought to life by the unpredictable Tiny Tina, who makes the rules, changes the world on the fly, and guides players on their journey.Embark on an epic adventure full of whimsy, wonder, and high-powered weaponry! Bullets, magic, and broadswords collide across this chaotic fantasy world brought to life by the unpredictable Tiny Tina, who makes the rules, changes the world on the fly, and guides players on their journey. Customize your own multiclass hero and loot, shoot, slash, and cast your way through outlandish monsters and treasure-filled dungeons on a quest to stop the tyrannical Dragon Lord. Everyone's welcome, so join the party, throw on your adventuring boots, and be Chaotic Great!… Expand"}, {"name": "Regalia: Of Men and Monarchs - Royal Edition", "details_link": "https://www.metacritic.com/game/xbox-one/regalia-of-men-and-monarchs---royal-edition", "publisher": "Crunching Koalas", "release_date": "Apr 13 2018", "developers": ["Pixelated Milk"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/df27b4ad398d81cd864cf89e75299090-98.jpg", "descriptions": "Regalia: Of Men And Monarchs is a tactical RPG set in a cheerful fantasy world full of weirdness and wonder. Assemble your party, go adventuring, manage your kingdom, make new friends, and defeat your opponents in challenging turn-based combat."}, {"name": "Railway Empire", "details_link": "https://www.metacritic.com/game/xbox-one/railway-empire", "publisher": "Kalypso", "release_date": "Jan 30 2018", "developers": ["Gaming Minds Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Management", "Vehicle", "Train", "Business / Tycoon"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/0d212fce0f14f39cd484c12da150c39a-98.jpg", "descriptions": "In Railway Empire, you will create an elaborate and wide-ranging rail network, purchase over 40 different trains modelled in extraordinary detail, and buy or build railway stations, maintenance buildings, factories and tourist attractions to keep your travel network ahead of the competition.In Railway Empire, you will create an elaborate and wide-ranging rail network, purchase over 40 different trains modelled in extraordinary detail, and buy or build railway stations, maintenance buildings, factories and tourist attractions to keep your travel network ahead of the competition. You'll also need to hire and manage your workforce if you want to ensure an efficient train service, whilst also develop over 300 technologies ranging from mechanical improvements to the trains themselves to workplace infrastructures and advanced amenities as you progress through five eras of technological innovations.… Expand"}, {"name": "Puddle", "details_link": "https://www.metacritic.com/game/playstation-vita/puddle", "publisher": "Neko Entertainment", "release_date": "Jul 24 2012", "developers": ["Neko Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "PlayStation Vita"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Logic", "Logic"], "meta_score": 77, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/64444a6ee70fc6aeab1778f38f8365ce-98.jpg", "descriptions": "Experience a brilliantly designed physics-based puzzle/platform game where you must guide a puddle of fluid to its target destination, not by moving the fluid, but by tilting the game world. The player must work with friction, momentum, and the unique properties of each type of fluid andExperience a brilliantly designed physics-based puzzle/platform game where you must guide a puddle of fluid to its target destination, not by moving the fluid, but by tilting the game world. The player must work with friction, momentum, and the unique properties of each type of fluid and environment to send as much of each puddle past fires, rifts, potential spills and more. But watch out: the fluid motion is realistic!  Tilt too quickly and some droplets are left behind; tilt too slowly you may not be able to make certain jumpsÃƒÂ¯Ã‚Â¿Ã‚Â½ or may simply evaporate away.… Expand"}, {"name": "Devil May Cry HD Collection", "details_link": "https://www.metacritic.com/game/xbox-360/devil-may-cry-hd-collection", "publisher": "Capcom", "release_date": "Mar 29 2012", "developers": ["Capcom", "Pipeworks Software", "Inc."], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Fantasy", "Compilation"], "meta_score": 77, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/ccdff1bbf214beeb81584931c170fdd9-98.jpg", "descriptions": "Devil May Cry HD Collection brings the first three original Devil May Cry titles; Devil May Cry, Devil May Cry 2, and Devil May Cry 3: Dante's Awakening Special Edition together in one high definition package for the first time."}, {"name": "Game of Thrones: Episode One - Iron From Ice", "details_link": "https://www.metacritic.com/game/playstation-4/game-of-thrones-episode-one---iron-from-ice", "publisher": "Telltale Games", "release_date": "Dec  2 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/bdc6e085dfdb21ab24b7475d89e3fc70-98.jpg", "descriptions": "Episode 1 - Iron From Ice. The series is based on the world, characters and events seen in HBO’s television show, which in turn is based on George R. R. Martin’s books (A Song of Ice and Fire). The events in the game series begin towards the end of Season 3 of the television show and endEpisode 1 - Iron From Ice. The series is based on the world, characters and events seen in HBO’s television show, which in turn is based on George R. R. Martin’s books (A Song of Ice and Fire). The events in the game series begin towards the end of Season 3 of the television show and end just before the beginning of Season 5. You'll traverse familiar locations such as King’s Landing and The Wall, as well as unfamiliar locations such as Ironrath, the home of House Forrester.… Expand"}, {"name": "Tchia", "details_link": "https://www.metacritic.com/game/playstation-5/tchia", "publisher": "Awaceb", "release_date": "Mar 21 2023", "developers": ["Awaceb"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["General", "Action Adventure", "Open-World"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/0506dd33ac23becfdef62b0e1e1d7ece-98.jpg", "descriptions": "A Tropical Open-World adventure. Climb, glide, swim, and sail your boat around a beautiful archipelago in this physics-driven sandbox. Use Tchia's special ability to take control of any animal or object you can find, and Jam on your fully playable Ukulele. A game inspired by New Caledonia."}, {"name": "Tiny Barbarian DX", "details_link": "https://www.metacritic.com/game/switch/tiny-barbarian-dx", "publisher": "Nicalis", "release_date": "Oct 10 2017", "developers": ["Nicalis", "StarQuail"], "platforms": ["PC", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/eae9a50c1aa40ee59b140ab72d7b6c6c-98.jpg", "descriptions": "Steel yourself for a relentless display of might and muscle…of brawn and bravery…of magic and mayhem! Can you cleave your enemies' skulls, plunder all the booty and flex to impress the barbarienne of your dreams? Inspired by heroic fantasy fiction, Tiny Barbarian DX combines engaging 2DSteel yourself for a relentless display of might and muscle…of brawn and bravery…of magic and mayhem! Can you cleave your enemies' skulls, plunder all the booty and flex to impress the barbarienne of your dreams? Inspired by heroic fantasy fiction, Tiny Barbarian DX combines engaging 2D platform action and combo-based hack-and-slash combat with retro-style pixel art and a loincloth-stirring chiptune soundtrack. [Nintendo]\r… Expand"}, {"name": "Reigns", "details_link": "https://www.metacritic.com/game/pc/reigns", "publisher": "Devolver Digital", "release_date": "Aug 11 2016", "developers": ["Nerial"], "platforms": ["iPhone/iPad", "Stadia", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/a15e76936f9161b9088558403775a4fc-98.jpg", "descriptions": "Sit on the throne as a benevolent (or malevolent) medieval monarch of the modern age and swipe your royal fingers either left or right to impose your will upon the kingdom. Survive the seemingly never-ending gauntlet of requests from your advisors, peasants, allies, and enemies whileSit on the throne as a benevolent (or malevolent) medieval monarch of the modern age and swipe your royal fingers either left or right to impose your will upon the kingdom. Survive the seemingly never-ending gauntlet of requests from your advisors, peasants, allies, and enemies while maintaining balance between the influential factions of your kingdom. But beware; each decision you make might have implications and unfortunate consequences down the road that could put your reign and family’s dynasty at risk!… Expand"}, {"name": "Mega Man 9", "details_link": "https://www.metacritic.com/game/playstation-3/mega-man-9", "publisher": "Capcom", "release_date": "Sep 25 2008", "developers": ["Inti Creates"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/3c56ab37ea5a636ce93eb55db17286c6-98.jpg", "descriptions": "[Playstation Network]  In the year 200X, as the advanced science of the era has created industrial robots that co-exist with humans. However, an evil genius, Dr. Wily, plots for world domination and creates his own robot army to take over mankind. Luckily for humanity, Dr. Light outfits one[Playstation Network]  In the year 200X, as the advanced science of the era has created industrial robots that co-exist with humans. However, an evil genius, Dr. Wily, plots for world domination and creates his own robot army to take over mankind. Luckily for humanity, Dr. Light outfits one of his domestic robots \"Rock\" to fight Dr. Wily’s creations and Mega Man is born.Set after the events of Mega Man 8, multiple riots have sprung up all over the world. Whilst many people suspect that this is another plot from Dr. Wily, Dr. Light is stunned to recognize that some of the robots rioting on the TV screen are his own creations. Even more stunning, Dr. Wily appears on television to proclaim that Dr. Light is the evil mastermind behind these latest catastrophic incidents and it’s up to Mega Man to clear his creator’s name. The original 2D classic Mega Man returns, bringing the series back to its roots with retroaction-platform gameplay and NES-inspired old school graphics. Relive the Mega Man experience with maniacally themed environments, a host of power-ups, and classically-inspired bosses, each with their own unique weapons and weaknesses. [Capcom]… Expand"}, {"name": "Sonic & Sega All-Stars Racing", "details_link": "https://www.metacritic.com/game/playstation-3/sonic-sega-all-stars-racing", "publisher": "Sega", "release_date": "Feb 23 2010", "developers": ["Sumo Digital"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Kart", "Automobile"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/480cdefe709a7289b8c4a473df6b251c-98.jpg", "descriptions": "In a frantic battle to the checkered flag, Sonic and friends speed around tracks set in medieval castle ramparts, lush rainforests and bustling cities, all taken from the visually rich and varied universes of Sonic and SEGA. Fan favorites such as Dr. Eggman, Tails, AiAi, Amigo and many moreIn a frantic battle to the checkered flag, Sonic and friends speed around tracks set in medieval castle ramparts, lush rainforests and bustling cities, all taken from the visually rich and varied universes of Sonic and SEGA. Fan favorites such as Dr. Eggman, Tails, AiAi, Amigo and many more will join Sonic in their custom built vehicles, revving their engines and jostling to stay ahead of the pack. Each character will speed around the track in cars, planes, motorbikes, and in Aiai’s case – a banana mobile! Secret short cuts, swift handling and avoiding strategically placed obstacles are certainly the best way to get to the top of the podium. But winning is only part of the fun in Sonic & SEGA All-Stars Racing! Each character has a specific All Star move – such as Super Sonic, Banana Blitz and Tails Tornado – that allows a quick way for competitors to get back into the race! Power ups and weapons can also be collected around the tracks and used against the opposition to ensure they don’t become a threat to that number one position. [Sega]… Expand"}, {"name": "Mafia II", "details_link": "https://www.metacritic.com/game/pc/mafia-ii", "publisher": "2K Games", "release_date": "Aug 23 2010", "developers": ["2K Czech"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/12d7abb32cf48670cb041b5d956d05bf-98.jpg", "descriptions": "Featuring a deep mobster-driven narrative packed with both behind-the-wheel and on-foot action, Mafia 2 is the sequel fans have been clamoring for. Like the original Mafia title, Mafia 2 immerses players in the mob underworld of a fictitious late 1940's-early 1950's scenario. Players easilyFeaturing a deep mobster-driven narrative packed with both behind-the-wheel and on-foot action, Mafia 2 is the sequel fans have been clamoring for. Like the original Mafia title, Mafia 2 immerses players in the mob underworld of a fictitious late 1940's-early 1950's scenario. Players easily become engaged in the game's cinematic Hollywood movie experience with strong, believable characters in a living, breathing city. [2K Games]… Expand"}, {"name": "EA Sports MMA", "details_link": "https://www.metacritic.com/game/playstation-3/ea-sports-mma", "publisher": "EA Sports", "release_date": "Oct 19 2010", "developers": ["EA Tiburon"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Wrestling", "Combat", "Boxing / Martial Arts"], "meta_score": 77, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/52a62dc71d27b3f4931a7f952bb12bd8-98.jpg", "descriptions": "EA SPORTS MMA promises to feature the most authentic, intense and broad mixed martial arts experience to date - complete with a vast array of top fighters and fighting styles from around the world. [Electronic Arts]"}, {"name": "Etrian Mystery Dungeon", "details_link": "https://www.metacritic.com/game/3ds/etrian-mystery-dungeon", "publisher": "Atlus", "release_date": "Apr  7 2015", "developers": ["Spike Chunsoft"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Roguelike"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/f7debdfa56b5a425ae8e622444f3ddb4-98.jpg", "descriptions": "Far off in the mountains, the small village Aslarga becomes a hub for adventurers looking for fame and fortune from the Mystery Dungeons. But dire challenges await even the most stalwart adventurers in Etrian Mystery Dungeon, a turn-based action RPG rogue like developed by ATLUS and SpikeFar off in the mountains, the small village Aslarga becomes a hub for adventurers looking for fame and fortune from the Mystery Dungeons. But dire challenges await even the most stalwart adventurers in Etrian Mystery Dungeon, a turn-based action RPG rogue like developed by ATLUS and Spike Chunsoft. The Nintendo 3DS exclusive mixes Etrian Odyssey's vast RPG party and skill customization aspects, and Mystery Dungeon's infinitely random dungeon adventures. There's no hand-holding in Etrian Mystery Dungeon. The action/turn based combat means that battling monsters is not just about using the right skills, but becomes an elegant Pas de Quatre of strategic positioning. Players form their parties with familiar Etrian Odyssey classes, such as Landsknecht and Runemaster, customize individuals using Etrian-style skill trees, and then take up to four members into the dungeons. Always randomized with various levels and paths, the dungeons require plenty of exploration, not to mention the incredible loot rewards -- just be wary of what waits among the deepest depths.… Expand"}, {"name": "Sega Rally Revo", "details_link": "https://www.metacritic.com/game/xbox-360/sega-rally-revo", "publisher": "Sega", "release_date": "Oct  9 2007", "developers": ["SEGA Racing Studio"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Driving", "Racing", "Arcade", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/f57701efe81c0053674d917a399c2b53-98.jpg", "descriptions": "(Known as \"Sega Rally\" in the UK/EU)  With dynamically deformable terrain, proprietary next-generation graphics, realistic physics, and competitive bumper-to-bumper racing, Sega Rally Revo is a high-tempo driving experience that is every racing fan's driving fantasy. Vehicle selection(Known as \"Sega Rally\" in the UK/EU)  With dynamically deformable terrain, proprietary next-generation graphics, realistic physics, and competitive bumper-to-bumper racing, Sega Rally Revo is a high-tempo driving experience that is every racing fan's driving fantasy. Vehicle selection affects driving strategy in Sega Rally Revo, as race course surfaces dynamically deform upon repeated contact with vehicle tires and changing weather effects. Sega Rally Revo features a variety of fully deformable surfaces, from gravel-littered tracks and smooth tarmac roads, to snow-covered mountain passes. This means no two laps will be the same, and drivers can skillfully lower their lap times as they hurtle their chosen world-renowned rally vehicles down photo-realistic courses only made possible on next-generation hardware. Driving skills are also tested by Sega Rally Revo's advanced AI which allows NPC drivers to dynamically adapt their driving style to the varied racing surfaces. Players can enjoy a comprehensive single-player campaign as they travel the globe racing the best drivers in the world. The game also features online capabilities, with multiplayer splitscreen modes offering an extremely competitive rally experience against drivers around the world. [Sega]… Expand"}, {"name": "HARDCORE MECHA", "details_link": "https://www.metacritic.com/game/playstation-4/hardcore-mecha", "publisher": "Arc System Works", "release_date": "Jan 14 2020", "developers": ["RocketPunch Games", "China Hero Project"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/8c1c3193af95175e89649e5d5b0cbf32-98.jpg", "descriptions": "Hardcore Mecha is a 2D platformer action focusing on a better handling. The Campaign mode offers rich gameplay and seamless in-game cut-scenes for an immersive experience. Choose your favorite mecha in Multiplayer, experience the fast-paced hardcore competitive battle of steel."}, {"name": "Pawarumi", "details_link": "https://www.metacritic.com/game/switch/pawarumi", "publisher": "Manufacture 43", "release_date": "Jul 24 2019", "developers": ["Manufacture 43"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/99e5d85baa1cb28e912d1ddca126d8aa-98.jpg", "descriptions": "In a world where the Council rules the nations with an iron fist, you play as Axo, pilot of the legendary ship Chukaru. Experience her fight with the limitless armies of the Council, become the master of Chukaru’s power and find the true meaning behind all your actions. A dark secret is yetIn a world where the Council rules the nations with an iron fist, you play as Axo, pilot of the legendary ship Chukaru. Experience her fight with the limitless armies of the Council, become the master of Chukaru’s power and find the true meaning behind all your actions. A dark secret is yet to be revealed. Pawarumi is a modern shoot’em up set in a retro futuristic sci-fi pre-Columbian universe. You’ll take control of the almighty ship Chukaru and its three unique weapons! Shoot wisely to either do double damage, heal yourself or charge your Super Attack.… Expand"}, {"name": "Battlefleet Gothic: Armada 2", "details_link": "https://www.metacritic.com/game/pc/battlefleet-gothic-armada-2", "publisher": "Focus Home Interactive", "release_date": "Jan 24 2019", "developers": ["Tindalos Interactive"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/932282ad303bbacf9fdbeee060cbf120-98.jpg", "descriptions": "Battlefleet Gothic: Armada 2 is the new real-time strategy game adapted from Games Workshop’s famous tabletop game that portrays the epic space battles of the Warhammer 40,000 universe."}, {"name": "Tower of Time", "details_link": "https://www.metacritic.com/game/pc/tower-of-time", "publisher": "Event Horizon Software", "release_date": "Apr 12 2018", "developers": ["Event Horizon Software"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/5a0ba5c7ceb7f6bccc2c2dbb088cec1c-98.jpg", "descriptions": "Tower of Time is a classic RPG with a unique real-time combat system where tactics are more important than equipment. Explore the Tower, buried underground for millennia, and uncover the history of times long gone and the mystery of why your land is dying."}, {"name": "The Inner World", "details_link": "https://www.metacritic.com/game/xbox-one/the-inner-world", "publisher": "Headup Games", "release_date": "Mar 31 2017", "developers": ["Headup Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 77, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/7/d12d5155e27bdb2fc097a46181c80c3b-98.jpg", "descriptions": "The Inner World is a wonderfully twisted point-and-click adventure game that takes place in Asposia, a land that defies all laws of physics by existing in an enormous hollow space.  Asposia is surrounded by rich soil and ventilated solely through three large wind fountains.  When theThe Inner World is a wonderfully twisted point-and-click adventure game that takes place in Asposia, a land that defies all laws of physics by existing in an enormous hollow space.  Asposia is surrounded by rich soil and ventilated solely through three large wind fountains.  When the fountains start running dry, it is up to cheerful yet naive resident, Robert, to solve the mystery behind the wind's disappearance.… Expand"}, {"name": "Linelight", "details_link": "https://www.metacritic.com/game/playstation-4/linelight", "publisher": "My Dog Zorro", "release_date": "Jan 31 2017", "developers": ["My Dog Zorro"], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation 4"], "genres": ["Puzzle", "Action"], "meta_score": 77, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/e636da863b518a708f86b0a7156da74b-98.jpg", "descriptions": "Linelight is a minimalist puzzle game where everything takes place on lines. Its zen-inducing music and visuals simulate the experience of getting an A+ on a super hard test while receiving a back massage. The controls are irreducibly simple: move."}, {"name": "Letter Quest: Grimm's Journey Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/letter-quest-grimms-journey-remastered", "publisher": "Digerati Distribution", "release_date": "Apr  8 2016", "developers": ["Bacon Bandit Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One"], "genres": ["Puzzle", "Logic"], "meta_score": 77, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/4b79de8b43872c2c44a1bca0bba7896a-98.jpg", "descriptions": "The grim reapers Grimm and Rose need your help to defeat a legion of monsters, ghosts, and evil bunnies using the power of words. Spell words to battle monsters and earn gems that can be used to purchase upgrades, books, special items, potions, and more Letter Quest is a turn-based RPGThe grim reapers Grimm and Rose need your help to defeat a legion of monsters, ghosts, and evil bunnies using the power of words. Spell words to battle monsters and earn gems that can be used to purchase upgrades, books, special items, potions, and more Letter Quest is a turn-based RPG featuring high-res artwork, clever wordplay, and two great soundtracks. Use your linguistic skills to survive. [Xbox.com]… Expand"}, {"name": "Dance Dance Revolution Extreme", "details_link": "https://www.metacritic.com/game/playstation-2/dance-dance-revolution-extreme", "publisher": "Konami", "release_date": "Sep 21 2004", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/881cd622cbf525dc58fdf043ab9e6808-98.jpg", "descriptions": "The greatest dance party returns with smash hit songs, unique modes and more features than ever before. Get ready to shake your groove thang with Dance Dance Revolution EXTREME. Over 100 minutes of energetic dance music and new Eye Toy USB Camera support will have the dance floor pumping allThe greatest dance party returns with smash hit songs, unique modes and more features than ever before. Get ready to shake your groove thang with Dance Dance Revolution EXTREME. Over 100 minutes of energetic dance music and new Eye Toy USB Camera support will have the dance floor pumping all night long. New songs and popular hits by BT, Duran Duran and more! New modes appeal to everyone from beginners to competitive dancers. Special \"Work Out\" mode allows you to track the calories you burn. [Konami]… Expand"}, {"name": "NHL 2005", "details_link": "https://www.metacritic.com/game/xbox/nhl-2005", "publisher": "EA Sports", "release_date": "Sep 20 2004", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 77, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/cce97e2620314a6f06b55ea60417e94b-98.jpg", "descriptions": "Capture all the speed, finesse, and action of professional hockey with NHL 2005. The game's new EA Sports Open Ice Control lets you execute offensive plays, such as a give-and-go and a breakaway pass, and you can also call for defensive double-teams. Dynasty mode has been enhanced with moreCapture all the speed, finesse, and action of professional hockey with NHL 2005. The game's new EA Sports Open Ice Control lets you execute offensive plays, such as a give-and-go and a breakaway pass, and you can also call for defensive double-teams. Dynasty mode has been enhanced with more interactive GM/owner relationships, including a new e-mail system. NHL 2005 also delivers all the action of the World Cup of Hockey with International Teams and venues from North America and Europe. … Expand"}, {"name": "Delta Force: Black Hawk Down", "details_link": "https://www.metacritic.com/game/pc/delta-force-black-hawk-down", "publisher": "NovaLogic", "release_date": "Mar 23 2003", "developers": ["NovaLogic"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/cb69d252ed76abf85159cb11ffcb02f0-98.jpg", "descriptions": "Experience missions similar to those encountered by U.S. Special Operations Forces during 10 months in Somalia. Fight through various compelling missions, each with multiple objectives. Engage in urban Close Quarter Battles and long-range sniper fire. Fire heavy weapons mounted in Black HawkExperience missions similar to those encountered by U.S. Special Operations Forces during 10 months in Somalia. Fight through various compelling missions, each with multiple objectives. Engage in urban Close Quarter Battles and long-range sniper fire. Fire heavy weapons mounted in Black Hawk helicopters and on Humvees. New AI system powers combat-ready enemies as well as valuable friendly teams. [NovaLogic]… Expand"}, {"name": "Rayman 3: Hoodlum Havoc", "details_link": "https://www.metacritic.com/game/gamecube/rayman-3-hoodlum-havoc", "publisher": "Ubisoft", "release_date": "Mar  2 2003", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 77, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/729ef9b081a3dd6da41d65ee36632971-98.jpg", "descriptions": "Rayman's universe has fallen into a chaotic world of wicked powers, bizarre characters, and merciless combat. When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger-happy Hoodlums wreaks total havoc to get their Lord back. Rayman's only chance is to purge theRayman's universe has fallen into a chaotic world of wicked powers, bizarre characters, and merciless combat. When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger-happy Hoodlums wreaks total havoc to get their Lord back. Rayman's only chance is to purge the Dark Lum Lord from the manic Globox, scour the lands for new powers, and battle with hordes of Hoodlum soldiers. Even without arms or legs, Rayman can still unleash an arsenal of special powers and fighting moves.… Expand"}, {"name": "Geoff Crammond's Grand Prix 4", "details_link": "https://www.metacritic.com/game/pc/geoff-crammonds-grand-prix-4", "publisher": "Atari", "release_date": "Sep 10 2002", "developers": ["Atari", "MicroProse", "Atari SA"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/f7da625095f8225b96ae606857fb227c-98.jpg", "descriptions": "New 3-D graphics engine brings a whole new dimension to this legendary series. Updated Artificial Intelligence creates an ultra realistic and competitive Formula One gaming experience. Unparalleled physics creating the true feeling of driving an Formula One car puts you in control. TracksNew 3-D graphics engine brings a whole new dimension to this legendary series. Updated Artificial Intelligence creates an ultra realistic and competitive Formula One gaming experience. Unparalleled physics creating the true feeling of driving an Formula One car puts you in control. Tracks modeled using GPS data to create stunningly accurate layouts. 3-D Audio utilising real Formula One samples, improved use of EAX, 3-D spatial sound and reverb brings the awesome sound of Formula One to your PC. GPaedia reference guide, offering detailed insights into the teams, drivers and circuits and provides advise on car setups and more. Incredibly realistic pit crews, engineers and marshals created with motion capture technology and with the assistance of The OrangeArrows Formula One Team. Features all the teams, drivers, and tracks from the 2001 FIA Formula One World championship. Choice of 11 cars all accurately modeled. [Infogrames]… Expand"}, {"name": "Emperor: Rise of the Middle Kingdom", "details_link": "https://www.metacritic.com/game/pc/emperor-rise-of-the-middle-kingdom", "publisher": "Sierra Entertainment", "release_date": "Sep  9 2002", "developers": ["BreakAway Games"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "City Building", "Management", "Historic", "Historic", "Government"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/d20eefd20beee9cb52e4b5633127f251-98.jpg", "descriptions": "You are transported back in time to when emperors reigned and China was the greatest and most resplendent power on earth. Epic in scope, Emperor spans seven dynasties and more than 3,000 years of Chinese history: from China's pre-imperial Xia dynasty circa 2100 BCE to the Mongol invasion ofYou are transported back in time to when emperors reigned and China was the greatest and most resplendent power on earth. Epic in scope, Emperor spans seven dynasties and more than 3,000 years of Chinese history: from China's pre-imperial Xia dynasty circa 2100 BCE to the Mongol invasion of the Middle Kingdom under Genghis Khan in 1211 CE. As Emperor, you will build housing to attract immigrants to your new city. Then the city's workers and farmers, administrators and soldiers will be yours to command, and you will have the work force you need to build a provincial city into a great metropolis. At your bidding, legions of workers will toil to erect walls strong enough to keep the barbarians at bay. Under your banner, armies will march forth to do battle with the enemy. Trade and commerce will flourish and an army of tax collectors will collect the taxes that are due. Schools and clinics, palaces and gardens will embellish the city you have built and proclaim your benevolence to the world. [Sierra]… Expand"}, {"name": "NFL Blitz 20-02", "details_link": "https://www.metacritic.com/game/gamecube/nfl-blitz-20-02", "publisher": "Midway", "release_date": "Mar 18 2002", "developers": ["Point of View"], "platforms": ["PlayStation 2", "GameCube"], "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/3f3808e246a8e3125ffdea104f6a2d1e-98.jpg", "descriptions": "NFL Blitz 2002 is the best arcade-style football game on the home market."}, {"name": "Kinetica", "details_link": "https://www.metacritic.com/game/playstation-2/kinetica", "publisher": "SCEA", "release_date": "Oct 14 2001", "developers": ["SCE Santa Monica"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/7849c4fe6d52ca160817d6b1eb4d6f70-98.jpg", "descriptions": "The fusion of human exoskeletons with \"kinetic skins\" to create a cycle you wear rather than drive is the concept behind Kinetica, a racer which requires you to perform a variety of tricks, stunts and combos to outpace the competition."}, {"name": "Ground Control: Dark Conspiracy", "details_link": "https://www.metacritic.com/game/pc/ground-control-dark-conspiracy", "publisher": "Sierra Entertainment", "release_date": "Dec 14 2000", "developers": ["High Voltage Software"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/78bad747d07fbc0b5230fd0c3abfe915-98.jpg", "descriptions": "Dark Conspiracy continues the story of Major Sarah Parker. After defeating the Crayven Corp. and Order Of The New Dawn forces on Krig 7b, Parker must enlist a group of mercenaries to help her escape from the deserted planet and discover the terrifying truth about the alien technology theyDark Conspiracy continues the story of Major Sarah Parker. After defeating the Crayven Corp. and Order Of The New Dawn forces on Krig 7b, Parker must enlist a group of mercenaries to help her escape from the deserted planet and discover the terrifying truth about the alien technology they were fighting over.  [Sierra Studios]… Expand"}, {"name": "Birds of Steel", "details_link": "https://www.metacritic.com/game/xbox-360/birds-of-steel", "publisher": "Konami", "release_date": "Mar 13 2012", "developers": ["Gaijin Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/27a9cd5955f0250a22535371052c7f73-98.jpg", "descriptions": "Get ready to strap in, go back in time and take stick in the most pivotal battles in the history of air combat. Birds of Steel puts you right in the crosshairs of WWII’s most intense skirmishes. This original IP blends next gen supremacy and the fine details of aerial combat into aGet ready to strap in, go back in time and take stick in the most pivotal battles in the history of air combat. Birds of Steel puts you right in the crosshairs of WWII’s most intense skirmishes. This original IP blends next gen supremacy and the fine details of aerial combat into a historical recreation fit for flight sim fans and history buffs alike. Use your skills to pilot the top planes from all combatants in WWII to recreate history or to change the outcomes of the most prolific battles in history. Online and offline elements add an entire new element to the game which will ensure Birds of Steel remains a fresh combat experience long after you’ve played for the first time.… Expand"}, {"name": "College Hoops 2K6", "details_link": "https://www.metacritic.com/game/playstation-2/college-hoops-2k6", "publisher": "2K Sports", "release_date": "Nov 30 2005", "developers": ["2K Sports"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "10  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/ba69a5ecdfecaa6b7a7cb2baf5079bd6-98.jpg", "descriptions": "Player Disposition: Each player has an inherent set of attributes: consistency, focus, and confidence. Utilize practice drills, scrimmages, and weekly meetings to raise these attributes to their peaks, so that you can heighten your Player Psyche and optimize your players’ performances.Player Disposition: Each player has an inherent set of attributes: consistency, focus, and confidence. Utilize practice drills, scrimmages, and weekly meetings to raise these attributes to their peaks, so that you can heighten your Player Psyche and optimize your players’ performances. Coach's Clipboard: Whether it's a full court press or a quick shot at the end of the half, coach your team to victory through specific timeout directions with Timeout Focus. Improve your zone defense efficiency and exploit your opponent's weaknesses by having total control over individual zone replacements with Zone Substitutions. Selection Sunday: No day in college basketball is bigger than Selection Sunday. Watch a broadcast of your team’s placement into the NCAA Tournament. Listen to commentary as video clips give you the low down on all the bracket match ups. [2K Sports]… Expand"}, {"name": "Life is Strange 2: Episode 4 - Faith", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-2-episode-4---faith", "publisher": "Square Enix", "release_date": "Aug 22 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 77, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/9/6c4ad4b8e409af11320a24ea46da2bf8-98.jpg", "descriptions": "The saga picks up in a Humboldt County, California hospital room where Sean, gravely wounded, wakes up to find that Daniel is still missing. Under arrest, and facing tough questions from law enforcement, Sean is running out of options. Only quick thinking and unexpected allies can secure hisThe saga picks up in a Humboldt County, California hospital room where Sean, gravely wounded, wakes up to find that Daniel is still missing. Under arrest, and facing tough questions from law enforcement, Sean is running out of options. Only quick thinking and unexpected allies can secure his freedom. “In Episode 4, we re-join Sean at his lowest point. The disaster that separated him from his brother has scarred him for life, and he is lost, alone and in quite a bit of trouble,” said Michel Koch & Raoul Barbet, Co-Creative Directors of Life is Strange 2. “Sean is already at a breaking point, and now faces some of the toughest situations in his life as he desperately searches for Daniel, whose absence hangs heavy over the whole episode. Considering what happened in that California Redwood forest, even if he can locate his brother – he can’t be sure of who, or what he will find.” Searching for Daniel under the scorching Nevada sun and through freezing desert nights, Sean must make his toughest choices yet. Puerto Lobos and the dream of freedom have never felt so far away. Will Sean’s faith in Daniel be rewarded – or is the younger wolf lost forever?… Expand"}, {"name": "The Walking Dead: The Telltale Series - The Final Season Episode 4: Take Us Back", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-the-telltale-series---the-final-season-episode-4-take-us-back", "publisher": "Telltale Games", "release_date": "Mar 26 2019", "developers": ["Telltale Games", "Skybound Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/2e8746525fce3d755e2b7b8650484dfd-98.jpg", "descriptions": null}, {"name": "Apollo Justice: Ace Attorney", "details_link": "https://www.metacritic.com/game/3ds/apollo-justice-ace-attorney", "publisher": "Capcom", "release_date": "Nov 21 2017", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/1f368dcfa14139aab77a34555affa7a9-98.jpg", "descriptions": "This is the fourth game in the series and the first developed specifically for Nintendo DS and sees a change of direction for the story line with the introduction of new defense attorney Apollo Justice and a host of new characters. Players star as rookie defense attorney Apollo Justice as heThis is the fourth game in the series and the first developed specifically for Nintendo DS and sees a change of direction for the story line with the introduction of new defense attorney Apollo Justice and a host of new characters. Players star as rookie defense attorney Apollo Justice as he visits crime scenes, questions key witnesses and collects vital evidence before stepping into the courtroom to prove his clients' innocence. Facing Apollo across the courtroom is the highly talented and flamboyant prosecutor Klavier Gavin who, in addition to being a legal genius, is also lead singer with Gavinners, a highly successful rock band with a string of hits to their name.… Expand"}, {"name": "Call of Cthulhu: Dark Corners of the Earth", "details_link": "https://www.metacritic.com/game/xbox/call-of-cthulhu-dark-corners-of-the-earth", "publisher": "2K Games", "release_date": "Oct 24 2005", "developers": ["Headfirst Productions"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/067e37c73b064b1e9f7d5cd003af5b90-98.jpg", "descriptions": "It's time for you to draw upon your skills in exploration, investigation, and combat as you battle the evil incarnate. Call of Cthulhu: Dark Corners of the Earth combines both action and adventure elements into a first-person horror experience. You'll combat enemies using the environment,It's time for you to draw upon your skills in exploration, investigation, and combat as you battle the evil incarnate. Call of Cthulhu: Dark Corners of the Earth combines both action and adventure elements into a first-person horror experience. You'll combat enemies using the environment, powerful and evil artifacts, Alien technology, and authentic 1920s weaponry. Cthulhu enemies can roam freely around the environment--opening doors and tracking you down single-handedly or in groups. A detailed damage and healing system breaks down the healing process into conditions and treatments. … Expand"}, {"name": "Orcs Must Die! 3", "details_link": "https://www.metacritic.com/game/pc/orcs-must-die!-3", "publisher": "Robot Entertainment", "release_date": "Jul 23 2021", "developers": ["Robot Entertainment"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/bb2ee2e3f08392a18598814a1f836569-98.jpg", "descriptions": "Orcs Must Die! 3 ushers orc-slaying mayhem to a previously unimaginable scale. All new War Scenarios pit players and their friends against the largest orc armies ever assembled. Mountable War Machines give players the essential firepower to heave, stab, carbonize, and disarticulate theOrcs Must Die! 3 ushers orc-slaying mayhem to a previously unimaginable scale. All new War Scenarios pit players and their friends against the largest orc armies ever assembled. Mountable War Machines give players the essential firepower to heave, stab, carbonize, and disarticulate the abominable intruders.… Expand"}, {"name": "Bridge Constructor Portal", "details_link": "https://www.metacritic.com/game/pc/bridge-constructor-portal", "publisher": "Headup Games", "release_date": "Dec 20 2017", "developers": ["ClockStone Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Puzzle", "Action", "Virtual", "Career"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/2d30cafb09f12012931215a6ad188ff7-98.jpg", "descriptions": "Enter the Aperture Science Enrichment Center and experience Bridge Constructor Portal – the unique merging of the classic Portal and Bridge Constructor games. As a new employee in the Aperture Science test lab, it's your job to build bridges, ramps, slides, and other constructions in 60 testEnter the Aperture Science Enrichment Center and experience Bridge Constructor Portal – the unique merging of the classic Portal and Bridge Constructor games. As a new employee in the Aperture Science test lab, it's your job to build bridges, ramps, slides, and other constructions in 60 test chambers and get the Bendies safely across the finish line in their vehicles. Make use of the many Portal gadgets, like portals, propulsion gel, repulsion gel, aerial faith plates, cubes, and more to bypass the sentry turrets, acid pools and laser barriers, solve switch puzzles, and make it through the test chambers unscathed. Let Ellen McLain, the original voice of GLaDOS, guide you through the tutorial, and learn all the tips and tricks that make a true Aperture Science employee. The bridge is a lie!… Expand"}, {"name": "OutRun 2006: Coast 2 Coast", "details_link": "https://www.metacritic.com/game/xbox/outrun-2006-coast-2-coast", "publisher": "Sega", "release_date": "Apr 25 2006", "developers": ["Sumo Digital"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "6  Online", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/9d921f163730e2442334d9cb504e93f1-98.jpg", "descriptions": "OutRun 2006: Coast to Coast features a choice of 15 fully licensed Ferrari models, featuring the all-new F430 and F430 Spider, as well as the dazzling Superamerica and the stunning 550 Barchetta. Power your way across 15 new American themed environments from the \"OutRun2 SP\" arcadeOutRun 2006: Coast to Coast features a choice of 15 fully licensed Ferrari models, featuring the all-new F430 and F430 Spider, as well as the dazzling Superamerica and the stunning 550 Barchetta. Power your way across 15 new American themed environments from the \"OutRun2 SP\" arcade experience. Race from coast to glorious coast with a fresh new mission structure, a license mode and online play, with up to 6 players for a thrilling head-to-head journey.… Expand"}, {"name": "Need for Speed Unbound", "details_link": "https://www.metacritic.com/game/playstation-5/need-for-speed-unbound", "publisher": "Electronic Arts", "release_date": "Nov 29 2022", "developers": ["Criterion Games"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 16 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 77, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/52c959773343bf68e9410ea3afe05f87-98.jpg", "descriptions": "START AT THE BOTTOM, RACE TO THE TOP. The world is your canvas in Need for Speed™ Unbound. Prove you have what it takes to win The Grand, Lakeshore’s ultimate street racing challenge. Across four intense weeks of racing, earn enough cash to enter weekly qualifiers, beat the competition, andSTART AT THE BOTTOM, RACE TO THE TOP. The world is your canvas in Need for Speed™ Unbound. Prove you have what it takes to win The Grand, Lakeshore’s ultimate street racing challenge. Across four intense weeks of racing, earn enough cash to enter weekly qualifiers, beat the competition, and make your mark on the street racing scene while outdriving and outsmarting the cops. Pack your garage with precision-tuned, custom rides and light up the streets with your unique style, exclusive fits, and a vibrant global soundtrack led by A$AP Rocky and AWGE that bumps in every corner of the world. Express yourself to the fullest with the freshest new art styles and signature tags that represent what you're all about. With separate single and multiplayer campaigns, this latest edition in the Need for Speed™ franchise from Criterion Games™ delivers hours of electric, adrenaline-pumping action.\r • Graffiti comes to life in Need for Speed™ Unbound with an all-new, unique visual style that blends elements of the freshest street art with the most realistic looking cars in Need for Speed™ history. Access a brand-new toolkit of high-energy visual and sound effects to express your driving skills, including Burst Nitrous, a new boost tactic that delivers a dizzying rush of speed.\r • To get to the top, you gotta take risks. Choose how and when to put it all on the line, pulling huge drifts on the street, outdriving the cops, or placing side bets with your own earnings against rival racers. Time is money, so find the fastest way to earn enough cash to enter the weekly qualifiers and make it to Lakeshore’s ultimate race, The Grand.\r • The more you race, the more you build heat. While the cops pile on the pressure, you gotta make tactical decisions using new escape mechanics to take control of the chase. Do you outrun the cops, battle them head on, or hide out in Lakeshore's underground? Run these streets and you’ll reap the rewards.\r • Pull up to a Meetup and show off your unique style with hundreds of cosmetic items to choose from, including exclusive gear from some of the world’s most pioneering fashion innovators. Extend that look to your ride, transforming your cars with unique wraps and cutaways for the ultimate legendary custom. And when you take first, don't forget to stunt on the competition with your own personal win poses.… Expand"}, {"name": "NBA Live 09", "details_link": "https://www.metacritic.com/game/xbox-360/nba-live-09", "publisher": "EA Sports", "release_date": "Oct  7 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/1010cf916b366588f1028807d1841add-98.jpg", "descriptions": "NBA Live 09 is back with new features like Pick and Roll Control, Defensive Lockdown Control, Signature Playcalling and Quickstrike Ankle-Breakers. For those in need of some extra coaching, NBA Live 09 takes you to training camp with the NBA Academy that gives you a chance to hone yourNBA Live 09 is back with new features like Pick and Roll Control, Defensive Lockdown Control, Signature Playcalling and Quickstrike Ankle-Breakers. For those in need of some extra coaching, NBA Live 09 takes you to training camp with the NBA Academy that gives you a chance to hone your skills. Now featuring 24 authentic FIBA teams with realistic team play styles and rosters, NBA Live 09 features a FIBA World Championship Mode using FIBA tournament structure, rules and court dimensions. Take your game online with 5 vs.5 team play, where 10 people can play together on 10 different consoles around the world. [Electronic Arts]… Expand"}, {"name": "Sherlock Holmes: Crimes & Punishments", "details_link": "https://www.metacritic.com/game/pc/sherlock-holmes-crimes-punishments", "publisher": "Focus Home Interactive", "release_date": "Sep 29 2014", "developers": ["Frogwares"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Third-Person"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/23bf0aa5e419d32ce00870e0f8d1fbe6-98.jpg", "descriptions": "It is now your turn to truly become Sherlock Holmes and lead your own investigation--actually, your investigations, as 8 captivating cases await you in Crimes & Punishments! Murders, disappearances, spectacular thefts, and other investigations will bring you to the cutting edge of theIt is now your turn to truly become Sherlock Holmes and lead your own investigation--actually, your investigations, as 8 captivating cases await you in Crimes & Punishments! Murders, disappearances, spectacular thefts, and other investigations will bring you to the cutting edge of the detective written in the pure tradition of Conan Doyle's novels. Each case offers real freedom to players, who will have to make important moral choices instead of simply enforcing justice by the book. All decisions have an influence in the game, so bear the weight of your choices!… Expand"}, {"name": "Lover Pretend", "details_link": "https://www.metacritic.com/game/switch/lover-pretend", "publisher": "Aksys Games", "release_date": "Dec  1 2022", "developers": ["Idea Factory"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/d8f61614326715d94c7943bff5b52779-98.jpg", "descriptions": "The main character Chiyuki lives alone and spends all of her time studying for university and doing part-time work.She has two dreams in life. The first is to become a scriptwriter, which was also a dream of her late mother. Another is to find her father who she never met.\n\nChiyuki triesThe main character Chiyuki lives alone and spends all of her time studying for university and doing part-time work.She has two dreams in life. The first is to become a scriptwriter, which was also a dream of her late mother. Another is to find her father who she never met.Chiyuki tries looking for information while working her new job, but in a twist of events ends up cast in the role of their love interest?Can Chiyuki draw up a script about fake lovers, while not knowing anything about falling in love herself?… Expand"}, {"name": "WRC Generations", "details_link": "https://www.metacritic.com/game/pc/wrc-generations", "publisher": "Nacon", "release_date": "Nov  3 2022", "developers": ["KT Racing"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/b2b8b812d5b71bc956ba2dcbfc126b64-98.jpg", "descriptions": "Rise to all the challenges of the most comprehensive, realistic and demanding rally simulation ever developed. Dive into the heart of the action and drive the cars from the 2022 WRC championship, including the new hybrid models."}, {"name": "Blossom Tales 2: The Minotaur Prince", "details_link": "https://www.metacritic.com/game/switch/blossom-tales-2-the-minotaur-prince", "publisher": "Playtonic Friends", "release_date": "Aug 16 2022", "developers": ["Castle Pixel", "LLC."], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/8aba7b94cc115c8953b0c0c7f4e2c73f-98.jpg", "descriptions": "The Minotaur King has returned...and it's all your fault! Lily's back for a new \"classic\" action-adventure set hundreds of years after The Sleeping King! Grandpa's latest tale takes you on a journey through haunted forests, pirate shores, and other mysterious lands across a vast open-world!The Minotaur King has returned...and it's all your fault! Lily's back for a new \"classic\" action-adventure set hundreds of years after The Sleeping King! Grandpa's latest tale takes you on a journey through haunted forests, pirate shores, and other mysterious lands across a vast open-world! Charming towns, terrible enemies, tricky puzzles, and powerful weapons await you. Enjoy a \"story within a story\" as Grandpa narrates exciting moments throughout Lily's incredible adventure.\r Will you help Lily defeat the Minotaur King and save her brother?… Expand"}, {"name": "Distant Worlds 2", "details_link": "https://www.metacritic.com/game/pc/distant-worlds-2", "publisher": "Slitherine", "release_date": "Mar 10 2022", "developers": ["Code Force"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/6a5b3198c5e87ac9f138a24bd7fb3b28-98.jpg", "descriptions": "Distant Worlds, the critically acclaimed 4X space strategy game is back with a brand new 64-bit engine, 3D graphics and a polished interface to begin an epic new Distant Worlds series with Distant Worlds 2.Distant Worlds 2 is a vast, pausable real-time 4X space strategy game. ExperienceDistant Worlds, the critically acclaimed 4X space strategy game is back with a brand new 64-bit engine, 3D graphics and a polished interface to begin an epic new Distant Worlds series with Distant Worlds 2.Distant Worlds 2 is a vast, pausable real-time 4X space strategy game. Experience the full depth and detail of turn-based strategy, but with the simplicity and ease of real-time, and on the scale of a massively-multiplayer online game.Huge Galaxies with up to 2,000 star systems and tens of thousands of planets, moons and asteroids are yours to explore and exploit, whether peacefully through mining and diplomacy or by conquest! The complex process of generating a galaxy ensures that every new game will be different and the many galaxy setup options ensure incredible replayability as well as the ability to have your game be just the way you like it.… Expand"}, {"name": "Steel Assault", "details_link": "https://www.metacritic.com/game/pc/steel-assault", "publisher": "Tribute Games", "release_date": "Sep 28 2021", "developers": ["Zenovia"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Shooter", "First-Person", "2D", "Arcade"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/63851c6a1968f7e676c0e565e8c7e134-98.jpg", "descriptions": "Punch, whip, and zipline your way through a post-apocalyptic America in this 16-bit retro-style action platformer! Play as Taro Takahashi, a resistance soldier on a revenge mission against the dictator who lords over the ashes."}, {"name": "Audica", "details_link": "https://www.metacritic.com/game/pc/audica", "publisher": "Harmonix Music Systems", "release_date": "Nov  5 2019", "developers": ["Harmonix Music Systems"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/697a30587913fc2062b0a3231f982deb-98.jpg", "descriptions": "Audica™ is a VR “rhythm shooter” that combines Harmonix’s award-winning music gameplay with precision shooting mechanics and a killer soundtrack, all set in a mesmerizing cosmic arena."}, {"name": "Just Dance 2019", "details_link": "https://www.metacritic.com/game/xbox-one/just-dance-2019", "publisher": "Ubisoft", "release_date": "Oct 23 2018", "developers": ["Ubisoft Paris"], "platforms": ["PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 77, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/4f3b34967c0bdef47b5fa066baa71b92-98.jpg", "descriptions": "Dance to 40 hits, from \"Finesse (Remix)\" by Bruno Mars Ft. Cardi B. Jump into an even more personalized experience, with a newly curated homepage. 8 exclusive choreographies created with the help of kids' development experts to encourage healthy movement. Join even more multiplayer eventsDance to 40 hits, from \"Finesse (Remix)\" by Bruno Mars Ft. Cardi B. Jump into an even more personalized experience, with a newly curated homepage. 8 exclusive choreographies created with the help of kids' development experts to encourage healthy movement. Join even more multiplayer events and online parties with a revamped World Dance Floor.… Expand"}, {"name": "No Man's Sky", "details_link": "https://www.metacritic.com/game/xbox-one/no-mans-sky", "publisher": "505 Games", "release_date": "Jul 24 2018", "developers": ["Hello Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/c8d23126c0e6196389b2a39f2d3f6276-98.jpg", "descriptions": "Inspired by the adventure and imagination that we love from classic science-fiction, No Man's Sky presents you with a galaxy to explore, filled with unique planets and lifeforms, and constant danger and action. In No Man's Sky, every star is the light of a distant sun, each orbited byInspired by the adventure and imagination that we love from classic science-fiction, No Man's Sky presents you with a galaxy to explore, filled with unique planets and lifeforms, and constant danger and action. In No Man's Sky, every star is the light of a distant sun, each orbited by planets filled with life, and you can go to any of them you choose. Fly smoothly from deep space to planetary surfaces, with no loading screens, and no limits. In this infinite procedurally generated universe, you'll discover places and creatures that no other players have seen before - and perhaps never will again.\r Embark on an epic voyage\rAt the centre of the galaxy lies a irresistible pulse which draws you on a journey towards it to learn the true nature of the cosmos. But, facing hostile creatures and fierce pirates, you'll know that death comes at a cost, and survival will be down to the choices you make over how you upgrade your ship, your weapon and suit.\r Find your own destiny\rYour voyage through No Man's Sky is up to you. Will you be a fighter, preying on the weak and taking their riches, or taking out pirates for their bounties? Power is yours if you upgrade your ship for speed and weaponry.\rOr a trader? Find rich resources on forgotten worlds and exploit them for the highest prices. Invest in more cargo space and you'll reap huge rewards.\rOr perhaps an explorer? Go beyond the known frontier and discover places and things that no one has ever seen before. Upgrade your engines to jump ever farther, and strengthen your suit for survival in toxic environments that would kill the unwary.\r Share your journey\rThe galaxy is a living, breathing place. Trade convoys travel between stars, factions vie for territory, pirates hunt the unwary, and the police are ever watching. Every other player lives in the same galaxy, and you can choose to share your discoveries with them on a map that spans known space. Perhaps you will see the results of their actions as well as your own...… Expand"}, {"name": "Life Goes On: Done to Death", "details_link": "https://www.metacritic.com/game/playstation-4/life-goes-on-done-to-death", "publisher": "Infinite Monkeys", "release_date": "May 17 2016", "developers": ["Infinite Monkeys"], "platforms": ["PC", "PC", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/d9e22eb675bcdbc8acec197e88d81257-98.jpg", "descriptions": "Life Goes On: Done to Death is a comically-morbid platformer where you guide heroic knights to their demise and use the dead bodies to solve puzzles. Wanting to live forever, a mighty king sends his army of knights to find the Cup of Life. On this quest, you will summon knight after knightLife Goes On: Done to Death is a comically-morbid platformer where you guide heroic knights to their demise and use the dead bodies to solve puzzles. Wanting to live forever, a mighty king sends his army of knights to find the Cup of Life. On this quest, you will summon knight after knight to be brutally sacrificed. As you journey through treacherous and trap-ridden worlds, you’ll show no mercy to solve each challenging puzzle.… Expand"}, {"name": "Proteus", "details_link": "https://www.metacritic.com/game/playstation-vita/proteus", "publisher": "Curve Studios", "release_date": "Oct 29 2013", "developers": ["Ed Key and David Kanaga"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita"], "num_players": "1 Player", "genres": ["Adventure", "General", "General", "3D", "First-Person", "Fantasy"], "meta_score": 77, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/fd2357b2c1148ff73087370a76a7822e-98.jpg", "descriptions": "Proteus is a minimalist game of pure exploration and sublime discovery in a musical wilderness environment. There are no challenges and no goals other than those set by the player. A reactive audio mixing system allows the player to explore the environment as music."}, {"name": "Rune Factory 3: A Fantasy Harvest Moon", "details_link": "https://www.metacritic.com/game/ds/rune-factory-3-a-fantasy-harvest-moon", "publisher": "Natsume", "release_date": "Nov  9 2010", "developers": ["Neverland"], "platforms": "DS", "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/236cb40fbbef4b9180f88f41346f9adf-98.jpg", "descriptions": "It's an adventure that will transform you! The people of Sharance and their horned Univir neighbors are embroiled in a bitter conflict. An age-old hatred between humans and monsters divides them. You are an adventurer with an unusual secret: you're half human and half monster.\r Are you theIt's an adventure that will transform you! The people of Sharance and their horned Univir neighbors are embroiled in a bitter conflict. An age-old hatred between humans and monsters divides them. You are an adventurer with an unusual secret: you're half human and half monster.\r Are you the one who can unite the humans and the Univir? And will you be in time to stop the growing evil force that threatens to destroy them both?… Expand"}, {"name": "Shank 2", "details_link": "https://www.metacritic.com/game/xbox-360/shank-2", "publisher": "Electronic Arts", "release_date": "Feb  8 2012", "developers": ["Klei Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 77, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/099cf1d274593b7edb0ede973d1115a1-98.jpg", "descriptions": "Shank 2 returns with a story of redemption as Shank, a former mob hitman with a dark and vengeful past, is thrust back into action when the lives of those close to him are endangered. Expanding on the original gameâ€™s rich and intuitive combat and control system, Shank 2 continuesShank 2 returns with a story of redemption as Shank, a former mob hitman with a dark and vengeful past, is thrust back into action when the lives of those close to him are endangered. Expanding on the original gameâ€™s rich and intuitive combat and control system, Shank 2 continues Klei's tradition of making fluid brawling controls and stunningly beautiful visuals that leapfrogs the competition in the 2D side-scrolling genre. The game also introduces an intense new, arcade-style survival co-op mode that has gamers working together to take down their foes, relying on the environment and weapon pick-ups for survival.… Expand"}, {"name": "Far Cry Primal", "details_link": "https://www.metacritic.com/game/xbox-one/far-cry-primal", "publisher": "Ubisoft", "release_date": "Feb 23 2016", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/b5c2197ac073633f034643c86815551a-98.jpg", "descriptions": "The era is the Stone Age, a time of imminent peril and limitless adventure, when giant mammoths and sabretooth tigers rule the globe, and humanity is at the low end of the food chain. As the last survivor of your hunting group, you will learn to build a deadly arsenal, fight off dangerousThe era is the Stone Age, a time of imminent peril and limitless adventure, when giant mammoths and sabretooth tigers rule the globe, and humanity is at the low end of the food chain. As the last survivor of your hunting group, you will learn to build a deadly arsenal, fight off dangerous predators, and outsmart enemy tribes to conquer the land of Oros and become the Apex Predator. You'll assume the role of Takkar, a seasoned hunter and the last surviving member of your group. You have a single goal: survive in a world where you are the hunted. Grow your tribe and sharpen your skills to lead your people, conquer the land of Oros, and become the apex predator. Encounter a cast of memorable characters who can help push back the dangers of the wild. Face enemy tribes who will do anything to eradicate you and your allies. [Ubisoft]… Expand"}, {"name": "Sanctum 2", "details_link": "https://www.metacritic.com/game/xbox-360/sanctum-2", "publisher": "Reverb", "release_date": "May 15 2013", "developers": ["Coffee Stain Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/4/c1bfaa30b9bfb74609a625adc434a2a8-98.jpg", "descriptions": "In Sanctum 2 players assume the role of one of 4 elite soldiers, each with his own unique abilities and weapons whose mission is to protect the Cores from hordes of mysterious alien creatures on the human colony planet, LOEK III. Melding elements of the tower defense and first-person genres,In Sanctum 2 players assume the role of one of 4 elite soldiers, each with his own unique abilities and weapons whose mission is to protect the Cores from hordes of mysterious alien creatures on the human colony planet, LOEK III. Melding elements of the tower defense and first-person genres, players are challenged to protect the Cores.  In each scenario, players must set up defensive towers to take out waves of attacking enemies and ensure victory. However, Sanctum 2 is not just a game where players sit back and watch the action unfold. Instead they jump into the fray head-on in FPS mode to light up the opposition with a wide array of weapons, some of which you've never seen before in an FPS game.… Expand"}, {"name": "Back 4 Blood", "details_link": "https://www.metacritic.com/game/playstation-5/back-4-blood", "publisher": "Warner Bros. Games", "release_date": "Oct  7 2021", "developers": ["Turtle Rock Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 77, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/6a1a79931cf3340e5392ea4f13190fa7-98.jpg", "descriptions": "From the creators and development team behind the critically acclaimed, co-op phenomenon Left 4 Dead. Back 4 Blood is designed from the ground-up as an original, premium title and marries the best of what made the co-op zombie shooter so successful with new features and state-of-the-art technology."}, {"name": "Sky Force Anniversary", "details_link": "https://www.metacritic.com/game/xbox-one/sky-force-anniversary", "publisher": "Infinite Dreams", "release_date": "Dec  9 2016", "developers": ["Infinite Dreams", "Infinite Dreams Inc."], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/3cc3e65186e98a6734c7501c921b043b-98.jpg", "descriptions": "The legendary shoot-em-up is here to celebrate its 10-year anniversary in super-destructive style.\r Harnessing the intensity of classic arcade games combined with modern visuals, Sky Force Anniversary offers a stunning scrolling shooter experience with an incredible new social gameplayThe legendary shoot-em-up is here to celebrate its 10-year anniversary in super-destructive style.\r Harnessing the intensity of classic arcade games combined with modern visuals, Sky Force Anniversary offers a stunning scrolling shooter experience with an incredible new social gameplay element.\r Over a decade ago, IGN said, \"Put simply, Sky Force is amazing.\" Scoring an incredible 9.5 out of 10. And now i'ts back. Bigger, bolder and more intense than ever.\r This 10th anniversary edition adds incredible depth to the series through stunning 3D graphics, intuitive controls and a powerful upgrade system that'll keep you blasting for hours on end.… Expand"}, {"name": "Livelock", "details_link": "https://www.metacritic.com/game/xbox-one/livelock", "publisher": "Perfect World Entertainment", "release_date": "Aug 30 2016", "developers": ["Tuque Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/3554d273180f1698b53930d53546bf17-98.jpg", "descriptions": "Livelock is a co-operative top-down shooter in which you play solo or with up to two allies to break the cycle of infinite war between machines. As one of the remaining Capital Intellects, your role is to unlock Eden and revive humanity. Assume control of one of three mechanical chassis -Livelock is a co-operative top-down shooter in which you play solo or with up to two allies to break the cycle of infinite war between machines. As one of the remaining Capital Intellects, your role is to unlock Eden and revive humanity. Assume control of one of three mechanical chassis - Hex, Vanguard or Catalyst – to defeat intelligent mechanical enemies. [Xbox.com]… Expand"}, {"name": "Eets: Chowdown", "details_link": "https://www.metacritic.com/game/xbox-360/eets-chowdown", "publisher": "Klei Entertainment", "release_date": "Apr 25 2007", "developers": ["Klei Entertainment"], "platforms": ["PC", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/4a75cb6aa7975d9599c033666d2bfff4-98.jpg", "descriptions": "[Xbox Live Arcade]  Eets: Chowdown is a visual feast for the eyes and a treat for the brain, combining 2D puzzle game elements with a surreal sense of humor. Gamers must use colorful and whacky items like spouting Prankster Whales, vengeful Marshomechs, Radioactive Ginseng and more to[Xbox Live Arcade]  Eets: Chowdown is a visual feast for the eyes and a treat for the brain, combining 2D puzzle game elements with a surreal sense of humor. Gamers must use colorful and whacky items like spouting Prankster Whales, vengeful Marshomechs, Radioactive Ginseng and more to manipulate Eets' emotions and safely guide it through myriad hazards to each level's exit. Eets: Chowdown offers a slew of new items, 120 levels and the exclusive debut of Marsho Madness, a high-adrenaline action game in which players must keep the impending evil marshmallows at bay. Earn up to 12 Achievements and 200 Gamerscore points. [Klei Entertainment]… Expand"}, {"name": "Aven Colony", "details_link": "https://www.metacritic.com/game/xbox-one/aven-colony", "publisher": "Team17", "release_date": "Jul 25 2017", "developers": ["Sold Out", "Mothership Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/84680e69cc37b7c9e96aa5b395288770-98.jpg", "descriptions": "Aven Colony puts you in charge of humanity's first extrasolar settlement on Aven Prime, an alien planet of deserts, tundras, and jungles light years from earth. Build the infrastructure, look after the well-being of your citizens, manage your resources, and guide your colony to prosperity --Aven Colony puts you in charge of humanity's first extrasolar settlement on Aven Prime, an alien planet of deserts, tundras, and jungles light years from earth. Build the infrastructure, look after the well-being of your citizens, manage your resources, and guide your colony to prosperity -- all while dealing with the harsh and often dangerous realities of an alien world.\r Features:\r * Build: Take charge of humanity's first extrasolar settlement on a new alien world. Build and expand your small colonies into massive, sprawling cities.\r * Discover: Deploy your crack team of pioneers to take on alien lifeforms and unlock the secrets of Aven Prime, as you tackle the campaign and sandbox modes.\r * Survive: Prepare for harsh winters, electrical storms and much more in this cruel and often dangerous new environment.… Expand"}, {"name": "Nintendo Labo: Toycon 01 Variety Kit", "details_link": "https://www.metacritic.com/game/switch/nintendo-labo-toycon-01-variety-kit", "publisher": "Nintendo", "release_date": "Apr 20 2018", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/0fc852d14b327a197e534ed9e7fe1ce3-98.jpg", "descriptions": "The Variety Kit includes five different projects to Make, Play, and Discover: two Toy-Con RC Cars, a Toy-Con Fishing Rod, a Toy-Con House, a Toy-Con Motorbike, and a Toy-Con Piano. Bring each Toy-Con creation to life with the power of the Nintendo Switch console and Joy-Con controllers."}, {"name": "RISK: Factions", "details_link": "https://www.metacritic.com/game/xbox-360/risk-factions", "publisher": "Electronic Arts", "release_date": "Jun 23 2010", "developers": ["Stainless Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Wargame", "Board / Card Game", "Turn-Based", "General"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/8c4e1294af885149de829d7ab0caa506-98.jpg", "descriptions": "[Xbox Live Arcade]  Wage war with five factions, each with unique abilities, in the original game of strategy and world domination! In RISK: Factions, play with the classic rules or reign supreme with objective-based and world conquest scenarios as you command your army and take tactical[Xbox Live Arcade]  Wage war with five factions, each with unique abilities, in the original game of strategy and world domination! In RISK: Factions, play with the classic rules or reign supreme with objective-based and world conquest scenarios as you command your army and take tactical gambles to win the day. Then challenge your friends in local or online multiplayer and see how you stack up on the leaderboards. [Xbox.com]… Expand"}, {"name": "ArmA II", "details_link": "https://www.metacritic.com/game/pc/arma-ii", "publisher": "Bohemia Interactive", "release_date": "Jul  7 2009", "developers": ["Bohemia Interactive"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/9288a6466cb95f40ff94bcf11699ee37-98.jpg", "descriptions": "Building on 10 years of constant engine development, ARMA II boasts the most realistic combat environment in the world. It models real world ballistics & round deflection, materials penetration, features a realtime day/night cycle and dynamic wind, weather and environmental effects. TheBuilding on 10 years of constant engine development, ARMA II boasts the most realistic combat environment in the world. It models real world ballistics & round deflection, materials penetration, features a realtime day/night cycle and dynamic wind, weather and environmental effects. The simulation of a combat environment is so effective, the engine forms the basis for training simulators used by real armies the world over. Although ArmA II is set in the fictional ex-soviet state of 'Chernarus' the gameworld is actually a 225 square kilometer chunk of the real world! ARMA II's highly detailed landscape is a meticulous facsimile of real terrain, modeled using extensive geographical data. This recreated region is brought to life with spectacular environmental effects and populated with dynamic civilian settlements and wildlife. Wild animals roam the atmospheric forests while the people of Chernarus try to live out their lives among the war-torn streets. The 27th U.S. Marine Expeditionary Unit have been deployed to the former soviet country of Chernarus in this third installment in the series of award winning PC war simulators from Bohemia Interactive, creators of Operation Flashpoint: Cold War Crisis and ArmA: Combat Operations. Force Reconnaissance Team \"Razor\" are among the first to fight. This elite five-man team are about to fall down the rabbit hole, trapped in a war not only for control of the country, but the hearts and minds of its people. With the might of the USMC offshore and the Russians anxiously watching from the north, the stakes couldn't be higher. The fate of Chernarus is balanced on a razor's edge. [Steam]… Expand"}, {"name": "Vengeful Guardian: Moonrider", "details_link": "https://www.metacritic.com/game/pc/vengeful-guardian-moonrider", "publisher": "The Arcade Crew", "release_date": "Jan 12 2023", "developers": ["JoyMasher"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/062b2fabe4a2d770191f4402e8116310-98.jpg", "descriptions": "Vengeful Guardian: Moonrider is a side-scrolling action platformer that channels the golden age of classic 16-bit action games in a full-throttle quest for revenge. REVENGE OF THE MOONRIDER. In the oppressed world of Vengeful Guardian: Moonrider, humanity finds an unlikely hero. AfterVengeful Guardian: Moonrider is a side-scrolling action platformer that channels the golden age of classic 16-bit action games in a full-throttle quest for revenge. REVENGE OF THE MOONRIDER. In the oppressed world of Vengeful Guardian: Moonrider, humanity finds an unlikely hero. After building an army of super soldiers as weapons of war, the authoritarians unwittingly seal their own fates by bringing online the ninja warrior known as Moonrider. Conceived as a tool to preserve the totalitarian state, the Moonrider instead rejects its intended purpose and wages a relentless battle for vengeance against its creators and fellow super soldiers.\r GEAR UP AND PREPARE TO BATTLE YOUR CREATORS\r The design of Vengeful Guardian: Moonrider puts the best classic action-game elements in the laser-precise sights of its starring ninja, ensuring snappy, responsive combat that’s supremely challenging.\r Powerful modifier chips are hidden and guarded throughout the adventure, allowing you to customize the Moonrider’s fighting style while gaining killer advantages and abilities.… Expand"}]