[{"name": "Small Arms", "details_link": "https://www.metacritic.com/game/xbox-360/small-arms", "publisher": "Gastronaut Studios", "release_date": "Nov 22 2006", "developers": ["Gastronaut Studios"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/4024525a21d12f918fee82d26b01dd4c-98.jpg", "descriptions": "[Xbox Live Arcade]  Small Arms is the frantic multiplayer brawling game with the action and precision of an arcade shooter. Up to 4 players can join in the battles across many dynamic and richly detailed levels. Choose from a cast of awesome fighters like cyborg tabby cats, assassin truffle[Xbox Live Arcade]  Small Arms is the frantic multiplayer brawling game with the action and precision of an arcade shooter. Up to 4 players can join in the battles across many dynamic and richly detailed levels. Choose from a cast of awesome fighters like cyborg tabby cats, assassin truffle pigs and mutant chimney sweeps. Jump from platform to platform shooting each other to pieces with 360° aim. The side-scrolling action is easy for anyone to pickup, and hard to put down. [Gastronaut Studios]… Expand"}, {"name": "Star Wars: The Force Unleashed", "details_link": "https://www.metacritic.com/game/xbox-360/star-wars-the-force-unleashed", "publisher": "LucasArts", "release_date": "Sep 16 2008", "developers": ["LucasArts"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Switch", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Shooter", "Linear", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/967bf2be0fae733368485864be0d69ae-98.jpg", "descriptions": "Star Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode IIIStar Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode III Revenge of the Sith\" and \"Star Wars: Episode IV A New Hope.\" In it, players assist the iconic villain in his quest to rid the universe of Jedi - and face decisions that could change the course of their destiny. Unleash and upgrade the Secret Apprentice's four core Force powers - Force push, grip, repulse and lightning - throughout the course of the game, and combine them for ultra-destructive, never-before-seen combos. The Secret Apprentice doesn't just Force push enemies into walls - he Force pushes enemies through walls. The Secret Apprentice doesn't just Force grip foes to throw them aside - he Force grips them in midair, zapping them with lightning, then dropping them to the ground to explode like a bomb. In addition to new adversaries created just for the game, such as fugitive Jedi and Force-sensitive Felucians, players also confront and associate with familiar faces from the Star Wars films, including Darth Vader. Visit locations such as Episode III's Wookiee homeworld Kashyyyk and the floral Felucia, the junk planet Raxus Prime, plus an Imperial TIE fighter construction facility. Decisions made by players throughout the game determine the path of the story, including multiple endings that will rock Star Wars continuity as they know it. [LucasArts]… Expand"}, {"name": "Test Drive: Eve of Destruction", "details_link": "https://www.metacritic.com/game/playstation-2/test-drive-eve-of-destruction", "publisher": "Atari", "release_date": "Aug 25 2004", "developers": ["Monster Games Inc."], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Demolition Derby"], "meta_score": 73, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/41a777e77318ae1e266d2fc8aaf2baf7-98.jpg", "descriptions": "(Also known as \"Driven To Destruction\") Test Drive: Eve of Destruction blends the best elements of racing and demolition and is packed with 25 different events, including Demo Derby, where the last car standing wins; Gauntlet, where the player climbs behind the wheel of a hearse and tries to(Also known as \"Driven To Destruction\") Test Drive: Eve of Destruction blends the best elements of racing and demolition and is packed with 25 different events, including Demo Derby, where the last car standing wins; Gauntlet, where the player climbs behind the wheel of a hearse and tries to finish a set number of laps while the rest of the field attempts to stop them; Trailer Race, a new brand of racing event, where players compete while towing various types of trailers and must finish the race with something resembling a trailer still attached. Additionally, Test Drive: Eve of Destruction offers players a selection of more than 30 custom vehicles, a dynamic soundtrack and a split-screen multiplayer mode for up to four players. [Atari]… Expand"}, {"name": "Earthlock", "details_link": "https://www.metacritic.com/game/switch/earthlock", "publisher": "Snow Castle Games", "release_date": "Mar  8 2018", "developers": ["Snow Castle Games", "CrossFunction"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/46183e5bfd658994c541e15d81c30975-98.jpg", "descriptions": "Festival of Magic is an adventure RPG with a Nordic take on an Eastern genre.\rGrow spuds, mushrooms and plants and use your harvest as powerful ammunition or spells; craft your weapons and team up your companions for battle. Solve challenging puzzles, collect rare items and explore variousFestival of Magic is an adventure RPG with a Nordic take on an Eastern genre.\rGrow spuds, mushrooms and plants and use your harvest as powerful ammunition or spells; craft your weapons and team up your companions for battle. Solve challenging puzzles, collect rare items and explore various dungeons scattered across the world.… Expand"}, {"name": "Kona", "details_link": "https://www.metacritic.com/game/pc/kona", "publisher": "Parabole", "release_date": "Mar 10 2016", "developers": ["Parabole"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "First-Person"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/4f0cf09d0eceeada2ddfcc9543995a8c-98.jpg", "descriptions": "Northern Canada, 1970. A strange blizzard ravages Atamipek Lake. Step into the shoes of a detective to explore the eerie village, investigate surreal events, and battle the elements to survive. The first installment in a series of four games, Kona is a chilly interactive tale you won't soon forget."}, {"name": "The Sims 3 Seasons", "details_link": "https://www.metacritic.com/game/pc/the-sims-3-seasons", "publisher": "Electronic Arts", "release_date": "Nov 13 2012", "developers": ["The Sims Studio"], "platforms": "PC", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/21ca19be4db89acd607e3ba405862115-98.jpg", "descriptions": "Play with the change of seasons! With The Sims 3 Seasons Expansion Pack, you can let your Sims swim in the ocean on a hot summer day, bob for apples in the autumn leaves, test their snowboarding skill on the half pipe or welcome spring showers with a walk in the rain and a colorful umbrella.Play with the change of seasons! With The Sims 3 Seasons Expansion Pack, you can let your Sims swim in the ocean on a hot summer day, bob for apples in the autumn leaves, test their snowboarding skill on the half pipe or welcome spring showers with a walk in the rain and a colorful umbrella. All-new activities, like soccer, and big seasonal festivals and celebrations bring the spirit of each season to life. Your Sims can pucker up at the kissing booth at the spring festival or see what Halloween surprises await in the haunted house. Dress for the weather with seasonal fashions ranging from raincoats to snow gear. With new foods, decor and weather effects, your Sims can enjoy the bounty and beauty of the ever-changing seasons and play with life like never before!… Expand"}, {"name": "Mario Kart 8 Deluxe: Booster Course Pass - Wave 1", "details_link": "https://www.metacritic.com/game/switch/mario-kart-8-deluxe-booster-course-pass---wave-1", "publisher": "Nintendo", "release_date": "Mar 18 2022", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/19ac4f1618cd7bea05e02c43261caf0b-98.jpg", "descriptions": "A total of 48 remastered courses from across the Mario Kart series have come to Mario Kart 8 Deluxe as paid downloadable content. Eight courses will be released at a time over six waves by the end of 2023, which can all be played locally or online. Courses such as Wii Coconut Mall, N64 ChocoA total of 48 remastered courses from across the Mario Kart series have come to Mario Kart 8 Deluxe as paid downloadable content. Eight courses will be released at a time over six waves by the end of 2023, which can all be played locally or online. Courses such as Wii Coconut Mall, N64 Choco Mountain and Tour Tokyo Blur are included in the first wave.… Expand"}, {"name": "Dread Templar", "details_link": "https://www.metacritic.com/game/pc/dread-templar", "publisher": "T19 Games", "release_date": "Aug 13 2021", "developers": ["T19 Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/100caf7226379195d0060b0844b4d572-98.jpg", "descriptions": "Dread Templar is a fast-paced first-person shooter that combines elements from both modern retro shooters and classics from the 90s. You are a Dread Templar seeking his revenge deep in the evil realm. Explore the levels and solve puzzles to find hidden weapons and upgrades. Face hordes ofDread Templar is a fast-paced first-person shooter that combines elements from both modern retro shooters and classics from the 90s. You are a Dread Templar seeking his revenge deep in the evil realm. Explore the levels and solve puzzles to find hidden weapons and upgrades. Face hordes of demons and bloodthirsty fiends using ninja equipment, firearms, and infernal weapons that will make YOU the scariest thing in hell. Gain Dread Powers and customize your skills according to your playstyle, as they will help you in your battle against the dark forces.… Expand"}, {"name": "The Eternal Castle Remastered", "details_link": "https://www.metacritic.com/game/switch/the-eternal-castle-remastered", "publisher": "TFL Studios", "release_date": "May 15 2020", "developers": ["TFL Studios"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/3372b844b003d8ed0a96fa07a65fc5e0-98.jpg", "descriptions": "The Eternal Castle [REMASTERED] is an ambitious attempt to modernize an old classic in order to keep its memory alive. Through detailed research and hard work, the production team tried to expand the experience while keeping the same 'feel' and emotional flow of the original masterpiece from 1987."}, {"name": "Romancing SaGa 3", "details_link": "https://www.metacritic.com/game/switch/romancing-saga-3", "publisher": "Square Enix", "release_date": "Nov 11 2019", "developers": ["Square Enix", "ArtePiazza"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/5eda1c7549b5428348e8b38979b6cfb6-98.jpg", "descriptions": "The classic 1995 RPG comes west in a remastered version. Your choices matter—from your choice of hero, to branching story paths, to recruiting party members, to which skills you’ll develop. Every game, a new adventure."}, {"name": "Starpoint Gemini Warlords", "details_link": "https://www.metacritic.com/game/pc/starpoint-gemini-warlords", "publisher": "Iceberg Interactive", "release_date": "May 23 2017", "developers": ["Little Green Men"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/e9c41f6edff332c3202badfa8cdf7bb9-98.jpg", "descriptions": "A blend of space sim, RPG and 4X games. Conduct research and construction in your own gigantic space station, command your war fleets and heroic companions to invade enemy territory, build up your stronghold, trade, mine, salvage and remind your enemies why they fear you."}, {"name": "Warriors Orochi 3 Ultimate", "details_link": "https://www.metacritic.com/game/xbox-one/warriors-orochi-3-ultimate", "publisher": "Koei Tecmo Games", "release_date": "Sep  2 2014", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/6a76170494fb5816de765b52b47bc69d-98.jpg", "descriptions": "Fans will experience WARRIORS OROCHI 3 in a brand new light as they enter the fray with the implementation of new generation console features, new storylines and scenarios."}, {"name": "Star Ocean: First Departure R", "details_link": "https://www.metacritic.com/game/playstation-4/star-ocean-first-departure-r", "publisher": "Square Enix", "release_date": "Dec  5 2019", "developers": ["Square Enix", "Tri-Ace"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/4a8101f5e38a0b73e5ff629f6f9a22f5-98.jpg", "descriptions": "Space Date: 346. From a power yet undiscovered, a new generation will be born. Our tale begins on the primitive planet of Roak where Roddick lives in the peaceful and uneventful town of Kratus. As a member of the village’s local “Defence Force” tasked with the protection of Kratus, RoddickSpace Date: 346. From a power yet undiscovered, a new generation will be born. Our tale begins on the primitive planet of Roak where Roddick lives in the peaceful and uneventful town of Kratus. As a member of the village’s local “Defence Force” tasked with the protection of Kratus, Roddick learns of a mysterious disease that has broken out in the neighboring town. Those infected turn to stone, but continue to live on in a petrified state. Roddick, along with his two friends Millie and Dorne, make their way to the neighboring town. Informed of a cure for the sickness, they head to Mt. Metorx where a healing herb is rumored to grow. When they reach the summit, the party encounter Ronyx and Ilia, who appear before them in a pillar of light. Thus, the story of STAR OCEAN begins... … Expand"}, {"name": "Mulaka", "details_link": "https://www.metacritic.com/game/switch/mulaka", "publisher": "Lienzo", "release_date": "Mar  1 2018", "developers": ["Lienzo"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/af0b0b597d9500d61e630c46ac380091-98.jpg", "descriptions": "Explore northern Mexico’s breathtaking landscapes with Mulaka, a 3D action-adventure game based on the rich indigenous culture of the Tarahumara."}, {"name": "Yooka-Laylee", "details_link": "https://www.metacritic.com/game/xbox-one/yooka-laylee", "publisher": "Team17", "release_date": "Apr 11 2017", "developers": ["Playtonic Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/62bc06a86bd25088a3c30017cab98a75-98.jpg", "descriptions": "Yooka-Laylee is an all-new 3D platformer from the creative talent behind the Banjo-Kazooie and Donkey Kong Country games. Our new heroes, Yooka (the green bloke with no pants) and Laylee (the wisecracking lady-bat with the big nose) were conceptualised from the ground up for stellarYooka-Laylee is an all-new 3D platformer from the creative talent behind the Banjo-Kazooie and Donkey Kong Country games. Our new heroes, Yooka (the green bloke with no pants) and Laylee (the wisecracking lady-bat with the big nose) were conceptualised from the ground up for stellar platforming gameplay, created by the same character artist behind the rebooted Donkey Kong family and legendary N64 heroes Banjo and Kazooie. Using an arsenal of special moves like Yookas tongue grapple and Laylees tactical sonar blast, players will explore  and expand  gorgeous 3D worlds drawn up by esteemed environment artist Steven Hurst (Banjo-Kazooie series, Viva Pinata) and through skill discover the plethora of delicious collectibles hidden within.\r FEATURES:\r * Heroes Built for Fun: Our new buddy-duo were dreamed up specifically for entertaining platforming gameplay and exceptional colour coordination. We think we've captured the spirit of our past heroes while introducing our most inventive moves yet.\r * An Arsenal of Abilities: Sonar blasting, tongue whipping, sky soaring a move roster built for platforming fun  and unlocked with added freedom. Additionally, there may or may not be a move involving a giant fart bubble.\r * A Dream Soundtrack: David Wise (Donkey Kong Country) and Grant Kirkhope (Banjo-Kazooie) combine in what's sure to be a melodic masterpiece! Seriously, clean out your ears - they're in for a treat.\r * Collect-em-up 2.0: A roster of shiny collectibles with gameplay progression at their core (as well as other, more valuable materials). Every collectible type in our new game will expand gameplay in a meaningful way. Yes, we employ the man responsible for DK64's myriad of trinkets, but we've had a stern word. Our main collectible, Pagies, are used to unlock and expand new worlds in Yooka-Laylee.\r * Expandable Worlds: Experience more of the playgrounds you love by spending collectibles to expand your favourites into bigger, more challenging worlds.\r * A Cast to Last: A huge cast of memorable characters to meet (or beat) brought to life by the art and audio teams behind Banjo-Kazooie and destined to endure in future games as part of Playtonic Universe. Expect all manner of grunts, squeaks and squawks.\r * Introducing Play Tonics: Discover these unique gameplay modifiers and use them to customise gameplay to suit your style. Will you run faster, hit harder or fly further? Also, are they named after our studio or vice versa? We'll never know.\r * Arcade machines: Each world hides at least one secret arcade game encasing old-school gaming goodness. Complete its retro-tastic challenge to claim your Pagie!… Expand"}, {"name": "SNK Arcade Classics Vol. 1", "details_link": "https://www.metacritic.com/game/wii/snk-arcade-classics-vol-1", "publisher": "SNK Playmore", "release_date": "Jul 29 2008", "developers": ["SNK Playmore"], "platforms": ["PlayStation 2", "Wii"], "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/9d2699eb5aad991b8478f545bf30040a-98.jpg", "descriptions": "ART OF FIGHTING - The first game in SNK's second fighting-game franchise, set in the same universe as FATAL FURY. BASEBALL STARS 2 - The sequel to SNK's popular baseball arcade game. BURNING FIGHT - New York detectives battle organized crime in this fighter. FATAL FURY - First released inART OF FIGHTING - The first game in SNK's second fighting-game franchise, set in the same universe as FATAL FURY. BASEBALL STARS 2 - The sequel to SNK's popular baseball arcade game. BURNING FIGHT - New York detectives battle organized crime in this fighter. FATAL FURY - First released in 1991, FATAL FURY introduced the two-plane fighting system. KING OF FIGHTERS '94 - The first game in the popular KING OF FIGHTERS series. KING OF THE MONSTERS - In KING OF THE MONSTERS, giant monsters fight for power in epic battles. LAST RESORT - A challenging futuristic shooter. MAGICIAN LORD - Players help the wizard Elta save his homeworld in this platformer. METAL SLUG - Known for its humor and fast- moving gameplay, this run-and-gun side-scroller was the first in the popular series. NEO TURF MASTERS - A golf game which debuted on the Neo Geo Pocket Color in 1999. SAMURAI SHODOWN - Set in the 18th century, SAMURAI SHODOWN features bladed-weapon combat and an international cast of characters. SENGOKU - In SENGOKU, players face off against undead feudal Japanese armies. SHOCK TROOPERS - In this run-and-gun adventure, players save a scientist and his granddaughter from the Bloody Scorpions. SUPER SIDEKICKS 3 - A soccer game featuring teams from all over the world. TOP HUNTER - Bounty hunters protect colonists from space pirates in this futuristic action game. WORLD HEROES - This classic fighter pits players against historical figures in a tournament enabled by time travel. [SNK Playmore USA]… Expand"}, {"name": "Marvel's Iron Man VR", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-iron-man-vr", "publisher": "Camouflaj, LLC", "release_date": "Jul  3 2020", "developers": ["Camouflaj", "LLC", "Sony Interactive Entertainment"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "Flight", "General", "Combat"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/0b2fe91cb7451e24a146e939a3f0b3ad-98.jpg", "descriptions": "In Marvel’s Iron Man VR the player, who plays as the genius inventor Tony Stark, confronts ghosts from his past—powerful forces who seek to ruin him and everything he stands for. By fully embracing the magic of PlayStation VR, players will come face-to-face with iconic allies and SuperIn Marvel’s Iron Man VR the player, who plays as the genius inventor Tony Stark, confronts ghosts from his past—powerful forces who seek to ruin him and everything he stands for. By fully embracing the magic of PlayStation VR, players will come face-to-face with iconic allies and Super Villains as they jet around the globe on a heroic mission to save not only Stark Industries, but the world itself. [PlayStation.com]… Expand"}, {"name": "Dragon Ball Z: Kakarot", "details_link": "https://www.metacritic.com/game/playstation-4/dragon-ball-z-kakarot", "publisher": "Bandai Namco Games", "release_date": "Jan 17 2020", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/f88092cd50f054727235b7f071f54556-98.jpg", "descriptions": "Relive the story of Goku in DRAGON BALL Z: KAKAROT! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku. Explore the new areas and adventures as you advance through the story and form powerful bonds with other heroes from theRelive the story of Goku in DRAGON BALL Z: KAKAROT! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku. Explore the new areas and adventures as you advance through the story and form powerful bonds with other heroes from the DRAGON BALL Z universe. \r\rExperience the Story\rExperience the story of DRAGON BALL Z from epic events to light-hearted side quests, including never-before-seen story moments that answer some burning questions of Dragon Ball lore for the first time!\r Iconic DRAGON BALL Z\rPlay through iconic DRAGON BALL Z battles on a scale unlike any other. Fight across vast battlefields with destructible environments and experience epic boss battles that will test the limits of your combat abilities. Increase your power level and rise to the challenge! \r\rDon't Just Fight As Goku\rLive as Goku. Fish, fly, eat, train, and battle your way through the DRAGON BALL Z sagas, making friends and building relationships with a massive cast of DRAGON BALL characters.… Expand"}, {"name": "RAGE 2", "details_link": "https://www.metacritic.com/game/pc/rage-2", "publisher": "Bethesda Softworks", "release_date": "May 13 2019", "developers": ["id Software", "Avalanche Studios"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/074670f8bbacd299d671cbbc0b695356-98.jpg", "descriptions": "Dive headfirst into a dystopian world devoid of society, law, and order. RAGE 2 brings together two studio powerhouses Avalanche Studios, masters of open world insanity, and id Software, the gods of the first-person shooter to deliver a carnival of carnage where you can go anywhere, shootDive headfirst into a dystopian world devoid of society, law, and order. RAGE 2 brings together two studio powerhouses Avalanche Studios, masters of open world insanity, and id Software, the gods of the first-person shooter to deliver a carnival of carnage where you can go anywhere, shoot anything, and explode everything.THE LAST RANGERBring the pain using a collection of upgradable weapons, devastating Nanotrite powers, and Overdrive, the ability to push your guns beyond their mechanical limits.PEDAL TO THE METALFrom monster trucks to gyrocopters, use an assortment of rugged and wasteland-ready vehicles to speed across the badlands. If you see it, you can drive it.FACTIONS & FOESFight against ferocious factions for control of the wasteland, each featuring a rogue's gallery of madmen, mutants, and monsters hungry for blood.THE WASTELAND AWAITSSeamlessly traverse a vast and varied landscape, from lush jungles and treacherous swamps to sun-scorched deserts in your pursuit of The Authority. The wasteland is massive, and you've got the arsenal to fight for every inch.… Expand"}, {"name": "Bartlow's Dread Machine", "details_link": "https://www.metacritic.com/game/xbox-one/bartlows-dread-machine", "publisher": "Beep Games, Inc.", "release_date": "Sep 29 2020", "developers": ["Beep Games", "Inc."], "platforms": ["PC", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/b71bd214f2cb423d7e3a14f484149273-98.jpg", "descriptions": "Teddy Roosevelt has been kidnapped! Your mission: Pursue his abductors from New York, across the Great Plains to San Francisco, the high seas and beyond using trains, ships and even a newfangled automobile. Master an arsenal of futuristic Edwardian weapons as you fight otherworldly creaturesTeddy Roosevelt has been kidnapped! Your mission: Pursue his abductors from New York, across the Great Plains to San Francisco, the high seas and beyond using trains, ships and even a newfangled automobile. Master an arsenal of futuristic Edwardian weapons as you fight otherworldly creatures to free the Commander in Chief.… Expand"}, {"name": "Space Hulk: Tactics", "details_link": "https://www.metacritic.com/game/pc/space-hulk-tactics", "publisher": "Focus Home Interactive", "release_date": "Oct  9 2018", "developers": ["Cyanide", "Cyanide Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/4294bdc5e81f58d3839fdf67d1ea7b75-98.jpg", "descriptions": "Space Hulk: Tactics is a faithful adaptation of the board game Space Hulk, bringing a unique twist to the cult classic formula. Battle as either a squad of Terminator Space Marines or the deadly alien Genestealers."}, {"name": "Thea: The Awakening", "details_link": "https://www.metacritic.com/game/pc/thea-the-awakening", "publisher": "MuHa Games", "release_date": "Nov 20 2015", "developers": ["MuHa Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 73, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/09cd39a92ad114557048f64ac21bf645-98.jpg", "descriptions": "Thea: The Awakening, a turn-based, rogue-like, strategic-survival game, set in a post-apocalyptic dark fantasy world, all inspired by Slavic Myth and Folklore and infused with rich story and a unique, card based minigame."}, {"name": "Hard West", "details_link": "https://www.metacritic.com/game/pc/hard-west", "publisher": "Gambitious", "release_date": "Nov 18 2015", "developers": ["CreativeForge Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/9517a0b87bbf7d8068d4abbfd29c1cbb-98.jpg", "descriptions": "When a tragic turn of events sets one man down a path of supernatural chaos and revenge, he must brutally hunt down all those whom wronged him. Fight and survive through 8 unique story-based scenarios, and try your hand at more than 40 individually designed turn-based combat missions withWhen a tragic turn of events sets one man down a path of supernatural chaos and revenge, he must brutally hunt down all those whom wronged him. Fight and survive through 8 unique story-based scenarios, and try your hand at more than 40 individually designed turn-based combat missions with your squad of 1-4 posse squad members. … Expand"}, {"name": "HAWKEN", "details_link": "https://www.metacritic.com/game/pc/hawken", "publisher": "Adhesive Games", "release_date": "Dec 12 2012", "developers": ["Adhesive Games", "Reloaded Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "General", "General", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/f48bafacf782267aa65465027f76a266-98.jpg", "descriptions": "Hawken is a multiplayer mech combat game. The focus is on creating an intense and enjoyable battle experience that captures the feeling of piloting a heavy war machine while keeping the action fast-paced and strategic."}, {"name": "Worms Revolution", "details_link": "https://www.metacritic.com/game/pc/worms-revolution", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 10 2012", "developers": ["Team17"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Artillery"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/f902d7afa1a689c8242d640a09b0ad41-98.jpg", "descriptions": "The game has been developed from the ground up and features a completely new game-engine. Exciting new features and challenges have been introduced whilst old favourites such as the Super Sheep and Holy Hand Grenade remain to thrill fans worldwide."}, {"name": "Raiden V: Director's Cut", "details_link": "https://www.metacritic.com/game/playstation-4/raiden-v-directors-cut", "publisher": "UFO Interactive", "release_date": "Oct 10 2017", "developers": ["Moss"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/8eb60c168314b2c83c56108e363a0bd9-98.jpg", "descriptions": "Arcade hit Raiden first left its mark on the shooting genre 25 years ago. The easy to learn, hard to master series comes to PS4 in what makers call its most modern and advanced form yet."}, {"name": "FAST - Racing League", "details_link": "https://www.metacritic.com/game/wii/fast---racing-league", "publisher": "Shin'en", "release_date": "May 30 2011", "developers": ["Shin'en"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Futuristic"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/50bd8e0132a81eb6aeae253e3591a057-98.jpg", "descriptions": "In the year 2112, the masses are fascinated by extreme high-speed races. The latest antigravity racing technology introduced phase-shifting. Perfectly phase-matching tracks and racing machines is the key to survival. Prepare yourself for a whole new racing experience at breakneck speeds.In the year 2112, the masses are fascinated by extreme high-speed races. The latest antigravity racing technology introduced phase-shifting. Perfectly phase-matching tracks and racing machines is the key to survival. Prepare yourself for a whole new racing experience at breakneck speeds. Push your skills to the limit to win races and beat records. Challenge your friends to an all-out split-screen competition. Compete against ruthless opponents and race to the top of all leagues. Warm up your engines – the future is now.… Expand"}, {"name": "Madden NFL 25", "details_link": "https://www.metacritic.com/game/xbox-one/madden-nfl-25", "publisher": "Electronic Arts", "release_date": "Nov 19 2013", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade", "Sim"], "meta_score": 73, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/3e4d62f17b05193255895ac21d2d267e-98.jpg", "descriptions": "Offensive and Defensive line play is the foundation of Madden NFL 25. Lineman are more than just physical, they are intelligent. Coupled with the ability to make 4x more decisions per second, 300 new blocking interactions create the most realistic running lanes for the ballcarrier andOffensive and Defensive line play is the foundation of Madden NFL 25. Lineman are more than just physical, they are intelligent. Coupled with the ability to make 4x more decisions per second, 300 new blocking interactions create the most realistic running lanes for the ballcarrier and passing pockets for the QB. Offensive lineman will dynamically sort and shift assignments based on threats and angles, starting with intelligently identifying the center of the defense, the “Mike”, countering the over 3x new defensive line moves and the latest blitz packages. Authentic double teams, blitz pick-ups, and line shifts showcase line units working together as one, highlighting the most physical and intense battles in the NFL.\r In Madden NFL 25, feel the anxiety of the crowd as you step up to the line on 4th and goal. Watch your teammates and coaches erupt with excitement as you blaze down the sideline for a game-changing score. Hear Jim Nantz, Phil Simms and new sideline reporter Danielle Bellini follow everything about your career. From injuries to accolades they’ll bring your career to life.\r… Expand"}, {"name": "Star Wars Episode III: Revenge of the Sith", "details_link": "https://www.metacritic.com/game/ds/star-wars-episode-iii-revenge-of-the-sith", "publisher": "Ubisoft", "release_date": "May  4 2005", "developers": ["Ubisoft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/0f4aa505cbdc35ff067527559720695b-98.jpg", "descriptions": "Star Wars Episode III: Revenge of the Sith delivers the ultimate Jedi action experience as Anakin Skywalker and Obi-Wan Kenobi join forces in fierce battles and heroic lightsaber duels until one’s lust for power and the other’s devotion to duty leads to a final confrontation between good andStar Wars Episode III: Revenge of the Sith delivers the ultimate Jedi action experience as Anakin Skywalker and Obi-Wan Kenobi join forces in fierce battles and heroic lightsaber duels until one’s lust for power and the other’s devotion to duty leads to a final confrontation between good and evil.… Expand"}, {"name": "0RBITALIS", "details_link": "https://www.metacritic.com/game/pc/0rbitalis", "publisher": "Mastertronic", "release_date": "May 28 2015", "developers": ["Alan Zucconi"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/efdd139bc23b8a2761ed323908ca7105-98.jpg", "descriptions": "0RBITALIS (don't call it \"Orbitalis\"!) is a satellite launching simulator with a retro-puzzle style. Launch your satellite into orbit and go head to head with the dominant force that formed the entire universe: Gravity."}, {"name": "Out of the Park Baseball Manager 2006", "details_link": "https://www.metacritic.com/game/pc/out-of-the-park-baseball-manager-2006", "publisher": "Sports Interactive", "release_date": "May 31 2006", "developers": ["Sports Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Sports", "Traditional", "Team", "Baseball", "Management", "Sim"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/3be900b19a8f21b006212a81cac5c991-98.jpg", "descriptions": "Build your own dynasty by signing free agents, wheeling and dealing with other owners or by calling up that hot prospect from the minors. Watch your seasoned veteran’s skills slowly deteriorate and replace him with one of your top picks from the amateur draft. It’s your world and you canBuild your own dynasty by signing free agents, wheeling and dealing with other owners or by calling up that hot prospect from the minors. Watch your seasoned veteran’s skills slowly deteriorate and replace him with one of your top picks from the amateur draft. It’s your world and you can select to simply pit your wits against the computer AI, or for the ultimate experience against friends in a multiplayer online league. There’s even the chance to become commissioner and truly customize almost every aspect of the game. [Sports Interactive]… Expand"}, {"name": "Bandits: Phoenix Rising", "details_link": "https://www.metacritic.com/game/pc/bandits-phoenix-rising", "publisher": "Tri Synergy", "release_date": "Mar 26 2003", "developers": ["GRIN"], "platforms": "PC", "num_players": "Up to 20 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/9e6bb150916d9edb047505b1b3cbdec0-98.jpg", "descriptions": "The game where your cannon mounted combat car takes you on an adventure across green fields, desert canyons and deep snow, bombing and blasting all sorts of enemies and cargo trucks, defending your gang and your glory! [PAN Vision]"}, {"name": "Soldiers of Anarchy", "details_link": "https://www.metacritic.com/game/pc/soldiers-of-anarchy", "publisher": "Simon & Schuster", "release_date": "Oct  8 2002", "developers": ["Silver Style"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Tactics"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/810b3c0757818a5caa40afd5d56680b8-98.jpg", "descriptions": "It's 2013. 10 years ago, a fanatical cult caused a near apocalypse on the Earth. To survive, you and a group of military veterans went underground. Now, you emerge to a world enslaved by the cult. You must free humanity from its new oppressors. Controlling a fully customizable squad of up toIt's 2013. 10 years ago, a fanatical cult caused a near apocalypse on the Earth. To survive, you and a group of military veterans went underground. Now, you emerge to a world enslaved by the cult. You must free humanity from its new oppressors. Controlling a fully customizable squad of up to 12 soldiers, you work your way through a scarred landscape. Starting with only a pistol, your squad must locate and recapture the weapons of modern warcraft and do battle. But be careful because all weapons and vehicles can also be commandeered by the enemy, even in mid-battle-and used against you, too.… Expand"}, {"name": "Saiyuki: Journey West", "details_link": "https://www.metacritic.com/game/playstation/saiyuki-journey-west", "publisher": "Koei", "release_date": "Aug 13 2001", "developers": ["Koei"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/e7ced6619549348bba6a32699d3348e9-98.jpg", "descriptions": "A Journey of Friendship...A Journey fraught with Danger...A Journey to Save the World...A Journey West. Based on one of the most popular legends of China, Saiyuki takes you on an epic journey from China to India and back. Recruit the Monkey King, Son Goku, and others like them to defeatA Journey of Friendship...A Journey fraught with Danger...A Journey to Save the World...A Journey West. Based on one of the most popular legends of China, Saiyuki takes you on an epic journey from China to India and back. Recruit the Monkey King, Son Goku, and others like them to defeat untold monsters along the way.… Expand"}, {"name": "Call of Duty: Finest Hour", "details_link": "https://www.metacritic.com/game/xbox/call-of-duty-finest-hour", "publisher": "Activision", "release_date": "Nov 16 2004", "developers": ["Spark Unlimited"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/1f101d4dbcbd1cc45ecb4d87c7bfa8b4-98.jpg", "descriptions": "You've been called to defend your Allied country against the Axis foes. In Call of Duty: Finest Hour, you must fight as part of a squad through the chaos of battle. Whether you play as American, British, or Russian forces, you'll discover the hardships that every unsung hero had to faceYou've been called to defend your Allied country against the Axis foes. In Call of Duty: Finest Hour, you must fight as part of a squad through the chaos of battle. Whether you play as American, British, or Russian forces, you'll discover the hardships that every unsung hero had to face during World War II. The game also features authentic weapons, vehicles, environments, combat missions, and the real sounds of war. Finally, the cinematic battlefield conflicts come to life on your gaming console.… Expand"}, {"name": "Virtual-On: Oratorio Tangram Ver.5.66", "details_link": "https://www.metacritic.com/game/xbox-360/virtual-on-oratorio-tangram-ver566", "publisher": "Sega", "release_date": "Apr 29 2009", "developers": ["Sega AM3"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 73, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/569ea3eab3ec1299be1c77116d6987b7-98.jpg", "descriptions": "[Xbox Live Arcade; Also known as \"Virtual On\"]   The arcade classic CYBER TROOPERS VIRTUAL-ON ORATORIO TANGRAM comes to Xbox LIVE Arcade! Keeping the classic mech fighting style, Virtual-On returns enhanced with intense HD graphics and a thrilling 1-on-1 online multiplayer battle mode. Giant[Xbox Live Arcade; Also known as \"Virtual On\"]   The arcade classic CYBER TROOPERS VIRTUAL-ON ORATORIO TANGRAM comes to Xbox LIVE Arcade! Keeping the classic mech fighting style, Virtual-On returns enhanced with intense HD graphics and a thrilling 1-on-1 online multiplayer battle mode. Giant mechs: Enjoy all the thrills of the classic arcade mech fighter in the comforts of your home on Xbox LIVE Arcade. Full roster: Choose from 15 playable Virtuaroids, each highly stylized with unique characterstics and moves. Multiplayer: Online multiplayer mode allows players to battle head-to-head with friends from around the world. Fast action: Fast visceral action is heightened by the intense HD graphics. Customization: The unique \"color editing\" feature lets you customize your Virtuaroid in the style of your choice. [Sega]… Expand"}, {"name": "Encased: a sci-fi post-apocalyptic RPG", "details_link": "https://www.metacritic.com/game/pc/encased-a-sci-fi-post-apocalyptic-rpg", "publisher": "Black Tower Entertainment", "release_date": "Sep  7 2021", "developers": ["Dark Crystal Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/a39663bd87fcc8b3387abe8563aac8a3-98.jpg", "descriptions": "Encased is a tribute to “Roadside Picnic” and the original Fallout games. Fight enemies, explore anomalous wasteland, level up your character, join one of the forces in the ruined world in this new apocalyptic turn-based RPG."}, {"name": "Vietcong: Fist Alpha", "details_link": "https://www.metacritic.com/game/pc/vietcong-fist-alpha", "publisher": "Gathering", "release_date": "Feb  4 2004", "developers": ["Pterodon"], "platforms": "PC", "num_players": "1-64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/0780aaecac3e8effa986c14a38b9b246-98.jpg", "descriptions": "First Alpha is the official expansion pack to Vietcong. Introducing an array of new characters, weapons and aircraft along with new single and mulit-play missions. \"First Alpha\" - your US Special Forces team are in the 'Nam facing the deadliest of enemies encountered on any battlefield - theFirst Alpha is the official expansion pack to Vietcong. Introducing an array of new characters, weapons and aircraft along with new single and mulit-play missions. \"First Alpha\" - your US Special Forces team are in the 'Nam facing the deadliest of enemies encountered on any battlefield - the Vietgong. Introducing Warren Douglas SFC and Ngueyn Nham joining First Alpha and appearing alongside five members of the original Special Forces unit. Original Vietcong game required to play. [Gathering of Developers]… Expand"}, {"name": "Dance Dance Revolution Hottest Party", "details_link": "https://www.metacritic.com/game/wii/dance-dance-revolution-hottest-party", "publisher": "Konami", "release_date": "Sep 25 2007", "developers": ["Konami"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/64cc368c33c1c4e6806cf813ee18e939-98.jpg", "descriptions": "Using a traditional DDR dance pad in conjunction with the Wii Remote, DDR Hottest Party requires players to match controller movements with the remote and Nunchuk attachment, as well as dance steps. The game also supports up to four players in multiple game modes and minigames. In additionUsing a traditional DDR dance pad in conjunction with the Wii Remote, DDR Hottest Party requires players to match controller movements with the remote and Nunchuk attachment, as well as dance steps. The game also supports up to four players in multiple game modes and minigames. In addition to the series' free play and workout modes, Hottest Party challenges players to dance in synch with one another, as well as offer a new support mode and an updated battle mode. The game also sports a new soundtrack with songs pulled from the last four decades of popular music.… Expand"}, {"name": "Tandem: A Tale of Shadows", "details_link": "https://www.metacritic.com/game/pc/tandem-a-tale-of-shadows", "publisher": "Hatinh Interactive", "release_date": "Oct 21 2021", "developers": ["Monochrome Paris"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/39fc3bb85bde1d869e1e8eeb4987c76c-98.jpg", "descriptions": "Tandem : A Tale of Shadows redefines the puzzle platformer genre with a unique gameplay and exceptional aesthetics. Help Emma and the teddy bear Fenton solve the mystery of the disappearance of the famous magician Thomas Kane."}, {"name": "Werewolf: The Apocalypse - Heart of the Forest", "details_link": "https://www.metacritic.com/game/switch/werewolf-the-apocalypse---heart-of-the-forest", "publisher": "Walkabout Games", "release_date": "Jan  7 2021", "developers": ["Different Tales"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "Action RPG", "Visual Novel"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/f2d906ec3502e91d09e40ed2aca1f8ff-98.jpg", "descriptions": "Discover your Rage in an adventure game inspired by the legendary tabletop RPG Werewolf: The Apocalypse.\r Explore the myths and monsters of Europe’s last primeval wilderness. Play as Maia, who arrives at the ancient Białowieża Forest looking to explore her family history. Visit real-worldDiscover your Rage in an adventure game inspired by the legendary tabletop RPG Werewolf: The Apocalypse.\r Explore the myths and monsters of Europe’s last primeval wilderness. Play as Maia, who arrives at the ancient Białowieża Forest looking to explore her family history. Visit real-world places of mystery and power. Witness how nature clashes with technology and greed.\r For the first time ever, you will be able to experience Werewolf: The Apocalypse on your Nintendo Switch™. Heart of the Forest adapts the mechanics of the legendary title from the World of Darkness universe, emulating the experience of a classic role-playing session. It’s tailored for World of Darkness veterans and newcomers looking for an accessible entry into this rich, acclaimed universe.\r Discover beautiful, distinctive collage art that combines hand-illustrated characters with pictures of real places to inspire your imagination. Make tough choices that often bring dramatic consequences.… Expand"}, {"name": "Nidhogg 2", "details_link": "https://www.metacritic.com/game/playstation-4/nidhogg-2", "publisher": "Messhof", "release_date": "Sep 15 2017", "developers": ["Messhof"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "General"], "meta_score": 73, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/64c16cb3b95b72c05a3fa4545f5f581b-98.jpg", "descriptions": "The rules are simple. Reach the other side and kill anyone that stands in your way. Deftly parry and rend their throats, riddle their bowels with arrows, or squish their brains between your toes. The wurm cares not for chivalry."}, {"name": "EyeToy: Groove", "details_link": "https://www.metacritic.com/game/playstation-2/eyetoy-groove", "publisher": "SCEA", "release_date": "Apr 20 2004", "developers": ["SCEE"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/059035a919039fe88fd57cc5e9d7f249-98.jpg", "descriptions": "Owners of EyeToy: Play will no doubt already be familiar with the concept of flinging themselves about their living room to a choice selection of disco beats, with party-friendly games Beat Freak and Boogie Down. The premise is a simple one: stand in front of your telly, dance like a loonOwners of EyeToy: Play will no doubt already be familiar with the concept of flinging themselves about their living room to a choice selection of disco beats, with party-friendly games Beat Freak and Boogie Down. The premise is a simple one: stand in front of your telly, dance like a loon and watch your family/friends/pet crack up at your attempts to set the dance floor (read: lounge rug) alight. And now with EyeToy: Groove, Studio London's latest addition to the innovative mini-cam genre, you can wow the crowds once more with more tunes, more challenges, and all-new spangly wavy hand movements. [SCEE]… Expand"}, {"name": "Raiden Fighters Aces", "details_link": "https://www.metacritic.com/game/xbox-360/raiden-fighters-aces", "publisher": "Valcon Games", "release_date": "May  7 2009", "developers": ["Gulti"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/357b4b0158063ea6bca55330c4a0efd1-98.jpg", "descriptions": "The First and last Word in Action. The Raiden Fighters series has finally arrived on the Xbox 360. All three arcade classics have been faithfully recreated in this ultimate collection. A new Training mode lets you modify every aspect your ships and wingmen, skip to any level, or play inThe First and last Word in Action. The Raiden Fighters series has finally arrived on the Xbox 360. All three arcade classics have been faithfully recreated in this ultimate collection. A new Training mode lets you modify every aspect your ships and wingmen, skip to any level, or play in slow-motion. Comprehensive screen and control settings let you play each game full-screen as a side-scroller, or even vertically on a rotated 4:3 display. Play 2-player co-op games offline, or play Arcade Mode as a lone-wolf, posting high-scores and gameclips to Xbox Live. [Valcon Games]… Expand"}, {"name": "Massive Chalice", "details_link": "https://www.metacritic.com/game/pc/massive-chalice", "publisher": "Double Fine Productions", "release_date": "Jun  1 2015", "developers": ["Double Fine Productions"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy", "Tactics"], "meta_score": 73, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/6d805a792f0a2af9e9fb9a4953b2c0a9-98.jpg", "descriptions": "Massive Chalice is a single player turn-based tactics game within a multi-generational strategy campaign where you must unite your kingdom under a powerful dynasty as an immortal King or Queen to eliminate the demonic threat, and reforge the Massive Chalice."}, {"name": "Pokemon Shining Pearl", "details_link": "https://www.metacritic.com/game/switch/pokemon-shining-pearl", "publisher": "Nintendo", "release_date": "Nov 19 2021", "developers": ["ILCA", "Inc."], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 73, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/ee3f255b4149f71e7f3e1dda67edf0b3-98.jpg", "descriptions": "The adventure through the Sinnoh region has been reborn. Experience the nostalgic story from the Pokémon Diamond and Pokémon Pearl games in an adventure reborn on the Nintendo Switch system. Adventures in the Pokémon Brilliant Diamond and Pokémon Shining Pearl games will take place in theThe adventure through the Sinnoh region has been reborn. Experience the nostalgic story from the Pokémon Diamond and Pokémon Pearl games in an adventure reborn on the Nintendo Switch system. Adventures in the Pokémon Brilliant Diamond and Pokémon Shining Pearl games will take place in the Sinnoh region. Rich in nature and with Mount Coronet towering at its heart, Sinnoh is a land of many myths passed down through the ages. You'll visit many different locations in the Sinnoh region, while striving to become the Champion of the Pokémon League. The original story has been faithfully reproduced, and the sense of scale in the originals' towns and routes has been carefully preserved. People who played Pokémon Diamond and Pokémon Pearl can revisit familiar places and relive familiar scenes once more. For those setting out through Sinnoh for the first time, plenty of new encounters and surprises await.\r These remakes include easy-to-understand, player-friendly conveniences of the modern Pokémon series, plus up-close-and-personal Pokémon battle scenes.\r Whether you played Pokémon Diamond or Pokémon Pearl back in the day or you're encountering these games for the first time, there's something for everyone to enjoy.\r You'll choose Turtwig, Chimchar, or Piplup to be your first partner Pokémon and then set off on your journey.\r Turtwig\rCategory: Tiny Leaf Pokémon\rType: Grass\rHeight: 1'4\"\rWeight: 22.5 lbs.\rAbility: Overgrow\r Made from soil, the shell on its back hardens when it drinks water. It lives along lakes. It undertakes photosynthesis within its body, making oxygen. The leaf on its head wilts if the Pokémon is thirsty. \r\rChimchar\rCategory: Chimp Pokémon\rType: Fire\rHeight: 1'8\"\rWeight: 13.7 lbs.\rAbility: Blaze\r It agilely scales sheer cliffs to live atop craggy mountains. Its fire is put out when it sleeps. Its fiery rear end is fueled by gas made in its belly. Even rain can't extinguish the fire. \r\rPiplup\rCategory: Penguin Pokémon\rType: Water\rHeight: 1'4\"\rWeight: 11.5 lbs.\rAbility: Torrent\r Because it is very proud, it hates accepting food from people. Its thick down guards it from cold. It lives along the shore in northern countries. A skilled swimmer, it dives for over 10 minutes while hunting. \r\rAlong the way, you'll be able to encounter the Legendary Pokémon Dialga in Pokémon Brilliant Diamond or Palkia in Pokémon Shining Pearl. \r\rDialga\rCategory: Temporal Pokémon\rType: Steel/Dragon\rHeight: 17'9\"\rWeight: 1505.8 lbs.\rAbility: Pressure\r It has the power to control time. It appears in Sinnoh-region myths as an ancient deity. This Pokémon is spoken of in legend. It is said that time began moving when Dialga was born. \r\rPalkia\rCategory: Spatial Pokémon\rType: Water/Dragon\rHeight: 13'9\"\rWeight: 740.8 lbs.\rAbility: Pressure\r It has the ability to distort space. It is described as a deity in Sinnoh-region mythology. It is said to live in a gap in the spatial dimension parallel to ours. Palkia appears in mythology.… Expand"}, {"name": "Glory Days 2", "details_link": "https://www.metacritic.com/game/ds/glory-days-2", "publisher": "Eidos Interactive", "release_date": "Aug  6 2007", "developers": ["odenis studio"], "platforms": "DS", "num_players": "1-8 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/70a46ba43c62e8a35789c6e7d3ac198a-98.jpg", "descriptions": "(Also known as \"Glory Days 2: Brotherhood of Men\")  The sequel to the GBA's award-winning Glory Days promises even more intense action than the first, as well as up to eight-way wireless multiplayer options."}, {"name": "Warhammer 40,000: Dawn of War - Soulstorm", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-dawn-of-war---soulstorm", "publisher": "THQ", "release_date": "Mar  4 2008", "developers": ["Iron Lore Entertainment"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/30d086d1d9bb5bbbe384f612639d345f-98.jpg", "descriptions": "Warhammer 40,000: Dawn of War – Soulstorm is set in Games Workshop’s Warhammer 40,000 universe – a dark, futuristic, fantasy setting where armies of technologically advanced warriors, fighting machines and hordes of implacable aliens wage constant war – and is played by millions worldwide.Warhammer 40,000: Dawn of War – Soulstorm is set in Games Workshop’s Warhammer 40,000 universe – a dark, futuristic, fantasy setting where armies of technologically advanced warriors, fighting machines and hordes of implacable aliens wage constant war – and is played by millions worldwide. Soulstorm is a complete standalone title and features two all-new armies, including the malicious Dark Eldar, for an unprecedented total of nine playable races. In addition to new units across each of the seven existing races, Warhammer 40,000: Dawn of War – Soulstorm incorporates air units for the first time and introduce multiplayer medals, adding a whole new level of depth to online battles. The revolutionary meta-game introduced in Warhammer 40,000: Dawn of War – Dark Crusade is further expanded to an interplanetary scale in Warhammer 40,000: Dawn of War – Soulstorm, allowing players to battle across an entire star system. [THQ]… Expand"}, {"name": "Draugen", "details_link": "https://www.metacritic.com/game/pc/draugen", "publisher": "Red Thread Games", "release_date": "May 29 2019", "developers": ["Red Thread Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "Adventure", "3D", "Survival", "First-Person"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/0346721d3c68db314389a14ea858c706-98.jpg", "descriptions": "Draugen is a single-player, first-person Fjord Noir mystery set in 1920s Norway. Explore a picturesque coastal community in your search for your missing sister, accompanied by your gregarious and enigmatic young ward."}, {"name": "Spartan: Total Warrior", "details_link": "https://www.metacritic.com/game/gamecube/spartan-total-warrior", "publisher": "Sega", "release_date": "Oct 27 2005", "developers": ["Creative Assembly"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/d5d7baa54067de6d011a53df0c8b6590-98.jpg", "descriptions": "You can battle hundreds of ancient warriors, both historical and mythical, in Spartan: Total Warrior. As \"The Spartan\" you can upgrade your weapons and armor and gain the favor of the gods as you fight through epic battles against units ranging from Roman soldiers to skeletonYou can battle hundreds of ancient warriors, both historical and mythical, in Spartan: Total Warrior. As \"The Spartan\" you can upgrade your weapons and armor and gain the favor of the gods as you fight through epic battles against units ranging from Roman soldiers to skeleton warriors. Levels feature a variety of objectives, such as escorting, capturing, destruction, discovery, and survival. … Expand"}, {"name": "Rad Rodgers", "details_link": "https://www.metacritic.com/game/pc/rad-rodgers", "publisher": "3D Realms", "release_date": "Feb 21 2018", "developers": ["Interceptor Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/6db133da583f3da4b1458aca064163b0-98.jpg", "descriptions": "Bringing back the 90's-era PC platformer with a game inspired by classics like Commander Keen, Conker, Ruff'n'Tumble & Jazz Jackrabbit."}, {"name": "ClaDun Returns: This is Sengoku!", "details_link": "https://www.metacritic.com/game/playstation-4/cladun-returns-this-is-sengoku!", "publisher": "NIS America", "release_date": "Jun  6 2017", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/e2eda53b70c3736f4e355fb914c96546-98.jpg", "descriptions": "Set in Japan's Sengoku Era, you wake up in the mysterious land of Arcanus Cella where the souls of the dead gather as they await reincarnation. However, some souls have unfinished business that needs to be settled before they can reincarnate. As the player, you will assist these souls bySet in Japan's Sengoku Era, you wake up in the mysterious land of Arcanus Cella where the souls of the dead gather as they await reincarnation. However, some souls have unfinished business that needs to be settled before they can reincarnate. As the player, you will assist these souls by traveling to real-world locations in feudal Japan and fighting your way through dangerous dungeons filled with monsters and traps.… Expand"}, {"name": "Poly Bridge", "details_link": "https://www.metacritic.com/game/pc/poly-bridge", "publisher": "Dry Cactus", "release_date": "Jul 12 2016", "developers": ["Dry Cactus"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/cd03e253523a67d65d4126a034299a3e-98.jpg", "descriptions": "Unleash your engineering creativity with an engaging and fresh bridge-building simulator with all the bells and whistles."}, {"name": "Zumba Fitness Rush", "details_link": "https://www.metacritic.com/game/xbox-360/zumba-fitness-rush", "publisher": "Majesco Games", "release_date": "Feb 13 2012", "developers": ["Majesco Games", "Zoe Mode", "Majesco"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Rhythm", "Exercise / Fitness", "Dancing"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/90d6efe69c78625f78da8ac0ebe9a6d0-98.jpg", "descriptions": "Featuring 42 hot new music tracks, sizzling choreography and a huge variety of new dance styles and arenas, Zumba Fitness Rush invites players to dance their way into shape with a fun and proven program.   Six Zumba instructors get you moving to the beat, including celebrity instructors BetoFeaturing 42 hot new music tracks, sizzling choreography and a huge variety of new dance styles and arenas, Zumba Fitness Rush invites players to dance their way into shape with a fun and proven program.   Six Zumba instructors get you moving to the beat, including celebrity instructors Beto Perez, Tanya Beardsley and Gina Grant, plus new stars exclusive to the Kinect game: Kass Martin, Jason Thompson and Erica Pierce.  Each star instructor personally guides players through choreography that ranges in style from Merengue and Samba to Bollywood and Latin Pop.  Dance hands-free as Kinect for Xbox 360 accurately tracks your every move.  Monitor improvements with the Progress Tracker, which adds up calories burned, grades dance styles, and displays trophies, stats and overall rank. Whether playing in Single Song, Full Class or Zumba Party mode, players will have a blast with this unique dance-fitness experience that shapes, tones and transforms their bodies as they party themselves into shape.… Expand"}, {"name": "Blood Bowl: Legendary Edition", "details_link": "https://www.metacritic.com/game/pc/blood-bowl-legendary-edition", "publisher": "Focus Home Interactive", "release_date": "Oct 28 2010", "developers": ["Cyanide"], "platforms": "PC", "genres": ["Sports", "Alternative", "Team", "Individual", "Football", "Other", "Other", "Arcade"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/1069dd4383e6898864a8f13cfeddb169-98.jpg", "descriptions": "Blood Bowl: Legendary Edition is the ultimate Blood Bowl edition! 12 new playable races join the 8 races already available in the 2009 edition. Thus, Blood Bowl fans will find all their favorite races from the original board game. Undeads, Amazons, Ogres and 9 other races enter Blood Bowl'sBlood Bowl: Legendary Edition is the ultimate Blood Bowl edition! 12 new playable races join the 8 races already available in the 2009 edition. Thus, Blood Bowl fans will find all their favorite races from the original board game. Undeads, Amazons, Ogres and 9 other races enter Blood Bowl's tournaments. All 20 races have their personal style, tactics and unique skills which give each game a diversity rarely seen in a strategy game.… Expand"}, {"name": "Banjo-Tooie", "details_link": "https://www.metacritic.com/game/xbox-360/banjo-tooie", "publisher": "Microsoft Game Studios", "release_date": "Apr 29 2009", "developers": ["4J Studios"], "platforms": "Xbox 360", "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 73, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/59a15e265f310bcece17971c65acda47-98.jpg", "descriptions": "The bear and bird’s second outing available in full. Loads of rollicking fun to be had here and with the legendary Stop 'N' Swop feature reinstated. The best use of a backpack in a game ever! [Microsoft]"}, {"name": "The Flame in the Flood", "details_link": "https://www.metacritic.com/game/pc/the-flame-in-the-flood", "publisher": "The Molasses Flood", "release_date": "Feb 24 2016", "developers": ["The Molasses Flood"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Action Adventure", "General", "Survival"], "meta_score": 73, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/10416aa598b0912b64c7186058a674a2-98.jpg", "descriptions": "A rogue-lite river journey through the backwaters of a forgotten post-societal America. Forage, craft, evade predators."}, {"name": "Evil West", "details_link": "https://www.metacritic.com/game/pc/evil-west", "publisher": "Focus Home Interactive", "release_date": "Nov 22 2022", "developers": ["Flying Wild Hog"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["General", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/592d6e61b526d919da226cc91c122a25-98.jpg", "descriptions": "A dark menace consumes the Old West. In solo or coop, fight with style in visceral, explosive combat against bloodthirsty monstrosities. Eradicate the vampiric hordes with your lightning-fueled gauntlet and become a Wild West Superhero."}, {"name": "Pathfinder: Kingmaker", "details_link": "https://www.metacritic.com/game/pc/pathfinder-kingmaker", "publisher": "Deep Silver", "release_date": "Sep 25 2018", "developers": ["Owlcat Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Western-Style"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/e9f9c7d4a8dfbdf4d710659ced2c34ca-98.jpg", "descriptions": "Pathfinder: Kingmaker is the first isometric party-based computer RPG set in the Pathfinder fantasy universe. Enjoy a classic RPG experience inspired by games like Baldur's Gate, Fallout 1 and 2 and Arcanum. Explore and conquer the Stolen Lands and make them your kingdom!"}, {"name": "God Hand", "details_link": "https://www.metacritic.com/game/playstation-2/god-hand", "publisher": "Capcom", "release_date": "Oct 10 2006", "developers": ["Clover Studio"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 73, "users_score": 9.2, "image": "https://static.metacritic.com/images/products/games/0/93d08a11536eeab8c61118a6d4aa347d-98.jpg", "descriptions": "With great power comes great responsibility.  Play as a drifter bestowed with supernatural-like abilities who must confront the fate and responsibilities inherent with this new found power. Hand-to-hand combat is at its best when gamers unleash the power of the God Hand to deliver righteousWith great power comes great responsibility.  Play as a drifter bestowed with supernatural-like abilities who must confront the fate and responsibilities inherent with this new found power. Hand-to-hand combat is at its best when gamers unleash the power of the God Hand to deliver righteous punishment onto worthy enemies. Centuries ago, the world was in imminent doom until a man defeated Angra and sealed away his godly powers into his own arms.  People feared and revered this person who would become known as \"God Hand\".  Legend has it that anyone who acquired such hands would possess immense power that could turn them into a deity or demon.  Fast forward to a small town overrun with thugs wielding super-human strength. A gruff drifter named Jean finds his way to this troubled region and defends a woman surrounded by a brutal mob. Despite his valiant efforts, Gene is overpowered by these thugs and his right arm is severed before falling into unconsciousness. He later awakens to find his limb whole again and that he is now the possessor of the legendary God Hand. The burden of being hunted by demonic legions seeking the right hand of God soon begins. [Capcom]… Expand"}, {"name": "Disney Infinity 2.0 Edition", "details_link": "https://www.metacritic.com/game/xbox-one/disney-infinity-20-edition", "publisher": "Disney Interactive Studios", "release_date": "Sep 23 2014", "developers": ["Avalanche Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General", "Fantasy"], "meta_score": 73, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "The starter pack includes: one Disney Infinity: Marvel Super Heroes 2.0 Edition Game, 3 Marvel Super Heroes Figures: Iron Man, Thor and Black Widow, one Disney Infinity Base (2.0 Edition), two Toy Box Game Discs, one Marvel's The Avengers Play Set piece, and one Web Code Card."}, {"name": "Blues and Bullets - Episode 1: The End of Peace", "details_link": "https://www.metacritic.com/game/pc/blues-and-bullets---episode-1-the-end-of-peace", "publisher": "A Crowd of Monsters", "release_date": "Jul 23 2015", "developers": ["A Crowd of Monsters"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/633a8168c9278ba6ea38650564829487-98.jpg", "descriptions": "Eliot Ness, the former leader of the legendary Untouchables, wished only to spend the rest of his days working in his diner, not dwelling too much on the cesspit of corruption his city, Santa Esperanza, had degenerated into. But things rarely go as planned."}, {"name": "Soul Nomad & the World Eaters", "details_link": "https://www.metacritic.com/game/playstation-2/soul-nomad-the-world-eaters", "publisher": "NIS America", "release_date": "Sep 25 2007", "developers": ["Nippon Ichi Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/12b798526a20ec31b8852ff75526f8b0-98.jpg", "descriptions": "Gig, the fearsome Master of Death, is back...and he's pissed off! Taking over your body is just the first step on his quest for global domination. It's up to you to rein him in and use his power, along with your band of fellow warriors, to stop the horrific World Eaters from annihilatingGig, the fearsome Master of Death, is back...and he's pissed off! Taking over your body is just the first step on his quest for global domination. It's up to you to rein him in and use his power, along with your band of fellow warriors, to stop the horrific World Eaters from annihilating everything. But be careful...power always comes with a price. [NIS America]… Expand"}, {"name": "Yooka-Laylee", "details_link": "https://www.metacritic.com/game/pc/yooka-laylee", "publisher": "Team17", "release_date": "Apr  5 2017", "developers": ["Playtonic Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/53dca7db042652e3aa0fe11df27bf1e1-98.jpg", "descriptions": "Yooka-Laylee is an all-new 3D platformer from the creative talent behind the Banjo-Kazooie and Donkey Kong Country games. Our new heroes, Yooka (the green bloke with no pants) and Laylee (the wisecracking lady-bat with the big nose) were conceptualised from the ground up for stellarYooka-Laylee is an all-new 3D platformer from the creative talent behind the Banjo-Kazooie and Donkey Kong Country games. Our new heroes, Yooka (the green bloke with no pants) and Laylee (the wisecracking lady-bat with the big nose) were conceptualised from the ground up for stellar platforming gameplay, created by the same character artist behind the rebooted Donkey Kong family and legendary N64 heroes Banjo and Kazooie. Using an arsenal of special moves like Yookas tongue grapple and Laylees tactical sonar blast, players will explore  and expand  gorgeous 3D worlds drawn up by esteemed environment artist Steven Hurst (Banjo-Kazooie series, Viva Pinata) and through skill discover the plethora of delicious collectibles hidden within.\r FEATURES:\r * Heroes Built for Fun: Our new buddy-duo were dreamed up specifically for entertaining platforming gameplay and exceptional colour coordination. We think we've captured the spirit of our past heroes while introducing our most inventive moves yet.\r * An Arsenal of Abilities: Sonar blasting, tongue whipping, sky soaring a move roster built for platforming fun  and unlocked with added freedom. Additionally, there may or may not be a move involving a giant fart bubble.\r * A Dream Soundtrack: David Wise (Donkey Kong Country) and Grant Kirkhope (Banjo-Kazooie) combine in what's sure to be a melodic masterpiece! Seriously, clean out your ears - they're in for a treat.\r * Collect-em-up 2.0: A roster of shiny collectibles with gameplay progression at their core (as well as other, more valuable materials). Every collectible type in our new game will expand gameplay in a meaningful way. Yes, we employ the man responsible for DK64's myriad of trinkets, but we've had a stern word. Our main collectible, Pagies, are used to unlock and expand new worlds in Yooka-Laylee.\r * Expandable Worlds: Experience more of the playgrounds you love by spending collectibles to expand your favourites into bigger, more challenging worlds.\r * A Cast to Last: A huge cast of memorable characters to meet (or beat) brought to life by the art and audio teams behind Banjo-Kazooie and destined to endure in future games as part of Playtonic Universe. Expect all manner of grunts, squeaks and squawks.\r * Introducing Play Tonics: Discover these unique gameplay modifiers and use them to customise gameplay to suit your style. Will you run faster, hit harder or fly further? Also, are they named after our studio or vice versa? We'll never know.\r * Arcade machines: Each world hides at least one secret arcade game encasing old-school gaming goodness. Complete its retro-tastic challenge to claim your Pagie!… Expand"}, {"name": "Coromon", "details_link": "https://www.metacritic.com/game/pc/coromon", "publisher": "TRAGsoft", "release_date": "Mar 31 2022", "developers": ["TRAGsoft"], "platforms": ["Switch", "PC"], "genres": ["Role-Playing", "Trainer"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/e2c9febd196dc7426e13f1e70c00eab2-98.jpg", "descriptions": "Coromon is a modern monster taming game with retro pixelart. Coromon brings an immersive storyline, strategic turn-based combat and challenging puzzles to a classic genre.Use powerful moves to take down your opponent's Squad. Use your skills to poison, stun or damage your opponent with anCoromon is a modern monster taming game with retro pixelart. Coromon brings an immersive storyline, strategic turn-based combat and challenging puzzles to a classic genre.Use powerful moves to take down your opponent's Squad. Use your skills to poison, stun or damage your opponent with an arsenal of available skills.In the region of Velua where Humans and Coromon live in harmony, a shady organization is on the verge of releasing a dark power upon the world. Will they succeed in their evil plans, or can they still be stopped?Step into the role of a young hero joining the technologically advanced organisation of Lux Solis. Gather your favorite Coromon to create a powerful squad. Together with your Coromon, you'll have to train, fight and puzzle your way through an adventure-filled world!… Expand"}, {"name": "Muse Dash", "details_link": "https://www.metacritic.com/game/switch/muse-dash", "publisher": "X.D. Network Inc.", "release_date": "Jun 20 2019", "developers": ["PeroPeroGames"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Shooter", "Music", "Shoot-'Em-Up", "Horizontal"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/3a0a39bebb37a9476559b75a355ddb0c-98.jpg", "descriptions": "Come and fix the world movement tampered with by a mirror image code with three beauties. This is a world of the perfect combination of a cool parkour game and a traditional music game——Muse Dash."}, {"name": "Last Year: The Nightmare", "details_link": "https://www.metacritic.com/game/pc/last-year-the-nightmare", "publisher": "Elastic Games", "release_date": "Dec 18 2018", "developers": ["Elastic Games"], "platforms": "PC", "num_players": "Up to 6 ", "genres": ["Action Adventure", "Survival"], "meta_score": 73, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/d7c52d183ee4563bec78f0316e380868-98.jpg", "descriptions": "Halloween night. 1996. A group of teenagers awake to find themselves trapped in a dark, twisted reflection of their sleepy hometown of Forest Hills. As they make their way across the East Side High School campus, they realize they are being hunted by a supernatural force taking the forms ofHalloween night. 1996. A group of teenagers awake to find themselves trapped in a dark, twisted reflection of their sleepy hometown of Forest Hills. As they make their way across the East Side High School campus, they realize they are being hunted by a supernatural force taking the forms of fearsome killers. Relentlessly pursued, the teens must band together to fight back, survive, and escape the terrifying anomaly they have come to know as The Nightmare.… Expand"}, {"name": "Fist Puncher", "details_link": "https://www.metacritic.com/game/pc/fist-puncher", "publisher": "Team2Bit", "release_date": "Jun 21 2013", "developers": ["Team2Bit"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "General", "Beat-'Em-Up", "2D"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/8e433624dd61a73af5d353c4971eea1c-98.jpg", "descriptions": "Fist Puncher is a retro-styled, side scrolling beat em up with RPG elements and plenty of button mashing goodness. It follows a group of vigilantes as they fight their way through the streets of a lawless city. You can think of it as Double Dragon meets Castle Crashers."}, {"name": "Kinect: Disneyland Adventures", "details_link": "https://www.metacritic.com/game/xbox-360/kinect-disneyland-adventures", "publisher": "Microsoft Game Studios", "release_date": "Nov 15 2011", "developers": ["Frontier Developments"], "platforms": ["PC", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 73, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/1/10ce81ace08eb073884dbf4662452ef8-98.jpg", "descriptions": "Experience a place where two magical worlds unite: Kinect for Xbox 360 invites you to take a journey where stories come to life and dreams come true, right in your living room! Explore Disneyland park — from Main Street U.S.A. to Critter Country — join Peter Pan to battle Captain Hook,Experience a place where two magical worlds unite: Kinect for Xbox 360 invites you to take a journey where stories come to life and dreams come true, right in your living room! Explore Disneyland park — from Main Street U.S.A. to Critter Country — join Peter Pan to battle Captain Hook, high-five Mickey Mouse or hug Snow White.\r Harnessing the controller-free magic of Kinect for Xbox 360, \"Kinect: Disneyland Adventures\" allows children, families and Disney fans of all ages to explore Disneyland park, step into adventures based on attractions, engage in challenging quests and interact with beloved Disney characters using their full bodies and voices,* no controller required. \"Kinect: Disneyland Adventures\" is your portal to a magical world of Disneyland park adventures through Kinect.… Expand"}, {"name": "inFamous: First Light", "details_link": "https://www.metacritic.com/game/playstation-4/infamous-first-light", "publisher": "SCEA", "release_date": "Aug 26 2014", "developers": ["Sucker Punch"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Open-World"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/957aa626067428bf9a06e23f6680b9f4-98.jpg", "descriptions": "Locked away in a prison for super powered humans, Fetch is forced to relive tragedies from her past. Unravel her dark secret in Seattle while battling to escape snowy Curdun Cay and pursue vengeance against those who did her wrong."}, {"name": "Pumpkin Jack", "details_link": "https://www.metacritic.com/game/switch/pumpkin-jack", "publisher": "Headup Games", "release_date": "Oct 23 2020", "developers": ["Nicolas Meyssonnier"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/4653fce5d34a6be527e9bbb00bd16af1-98.jpg", "descriptions": "Pumpkin Jack is a spooky scary 3D platformer in which you embody Jack, the Mythical Pumpkin Lord. Dive into an epic adventure through otherworldly landscapes and help the Evil annihilate the Good. Follow the will of the Devil himself and slay your nemesis in an epic quest that will take youPumpkin Jack is a spooky scary 3D platformer in which you embody Jack, the Mythical Pumpkin Lord. Dive into an epic adventure through otherworldly landscapes and help the Evil annihilate the Good. Follow the will of the Devil himself and slay your nemesis in an epic quest that will take you on a journey in the Boredom Kingdom, a mythical realm shattered by the curse. You will meet friends along the way, from a haughty owl to a snarky crow. Discover stunning atmospheres in a colorful yet spooky scary Kingdom. Travel through epic and dramatic settings, with each level having its own eerie atmosphere. Using a vibrant palette and high-quality lighting effects, Pumpkin Jack invents its own unique cartoon universe inspired by the classic PS2 graphic style, made with Unreal Engine 4.\r Pumpkin Jack is a classic 3D Platformer before anything else! Every level will challenge you through several themed platforms, all giving you new trials to complete. You will have to master the arts of dodging, timing, and movement to vanquish Jack’s foes. During the dynamic real time battles, choose which weapon you want to use and strike at the critical moment!\r Solve puzzles that focus on physics, gravity and reflection. Inhabit a pumpkin head and burn books, hammer some moles, create a path for magic spheres… And there is more: In each level, you will be faced with an action sequence using a new exclusive gameplay!… Expand"}, {"name": "ModNation Racers", "details_link": "https://www.metacritic.com/game/psp/modnation-racers", "publisher": "SCEA", "release_date": "May 24 2010", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 3", "PSP"], "num_players": "Up to 6 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/97f61f2f8806025961c53bc71b38b2c2-98.jpg", "descriptions": "Exclusive to the PlayStation 3 and PSP systems, ModNation Racers empowers the player to customize their entire kart racing experience. Enjoy karting fun, where you can shoot, boost & drift your way to the finish line. Create your unique racing experience with the same tools used by theExclusive to the PlayStation 3 and PSP systems, ModNation Racers empowers the player to customize their entire kart racing experience. Enjoy karting fun, where you can shoot, boost & drift your way to the finish line. Create your unique racing experience with the same tools used by the development team. Express yourself by creating your own Mod character, quirky kart and imaginative track, and share your unique racing experience with the rest of the world. [SCEA]… Expand"}, {"name": "Nancy Drew: The White Wolf of Icicle Creek", "details_link": "https://www.metacritic.com/game/pc/nancy-drew-the-white-wolf-of-icicle-creek", "publisher": "Her Interactive", "release_date": "Jun  7 2007", "developers": ["Her Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/727ebfcc8235fc6bca2b04695683c119-98.jpg", "descriptions": "Nancy Drew travels to the Canadian Rockies to investigate the Icicle Creek Lodge. Chantal, the owner of the lodge has asked her to uncover the culprit behind a recent string of suspicious accidents. To make matters worse, an eerie howling wolf keeps everyone up at night and terrorizes theNancy Drew travels to the Canadian Rockies to investigate the Icicle Creek Lodge. Chantal, the owner of the lodge has asked her to uncover the culprit behind a recent string of suspicious accidents. To make matters worse, an eerie howling wolf keeps everyone up at night and terrorizes the guests. The wolf also appears at the site of accidents and then mysteriously disappears when the police arrive. As Nancy makes her way to the cozy lodge, an explosion rocks the quiet night, destroying a bunkhouse. A wolf howls mournfully in the distance. Nancy has barely set foot on the premises and already trouble is afoot! Can Nancy solve this mystery before all the guests leave and Chantal is left out in the cold? [Her Interactive]… Expand"}, {"name": "Battle Engine Aquila", "details_link": "https://www.metacritic.com/game/playstation-2/battle-engine-aquila", "publisher": "Atari", "release_date": "Jan 19 2003", "developers": ["Lost Toys"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/576e6da56f32eea0b9097f0bcf56ce48-98.jpg", "descriptions": "An epic battle rages between the Forseti and the Muspell as the oceans rise and land disappears. The Forseti compel you to help protect their remaining land by taking charge of the ultimate war machine - the Battle Engine. Whether in walking or in flying mode, you have access to an array ofAn epic battle rages between the Forseti and the Muspell as the oceans rise and land disappears. The Forseti compel you to help protect their remaining land by taking charge of the ultimate war machine - the Battle Engine. Whether in walking or in flying mode, you have access to an array of destructive weapons and you receive constant direction from base command. By commanding a device so powerful and advanced, your battlefield decisions will shape the direction of each engagement and, ultimately, the entire war. [Infogrames]… Expand"}, {"name": "Scene It? Lights, Camera, Action", "details_link": "https://www.metacritic.com/game/xbox-360/scene-it-lights-camera-action", "publisher": "Microsoft Game Studios", "release_date": "Nov  6 2007", "developers": ["Screenlife Games", "WXP"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/e6763e17117a772431364ccc89218459-98.jpg", "descriptions": "Scene It? Lights, Camera, Action brings friends and family together for a casual movie trivia game that everyone can play and enjoy. Using the simple and intuitive Big Button Pad, challenge your friends to see whose movie knowledge reigns supreme, with real content from your favorite moviesScene It? Lights, Camera, Action brings friends and family together for a casual movie trivia game that everyone can play and enjoy. Using the simple and intuitive Big Button Pad, challenge your friends to see whose movie knowledge reigns supreme, with real content from your favorite movies and actors. New puzzle challenges: The Xbox 360 game includes more than 1,800 questions not seen before in any otherScene It? game. It features five new types of puzzle challenge that are sure to keep you guessing all night long. Enjoy \"Credit Roll,\" where you guess the film based on the list of characters and actors, \"Child’s Play,\" where you guess the name of the film based on a child's drawing of a film scene, and \"Quotables,\" where you are challenged to finish a famous line from a featured film. In addition, all 21 puzzle types have been designed to provide the ultimate multiplayer experience on Xbox 360. Big Button Pad: Scene It? Lights, Camera, Action is shipped with four new wireless Big Button Pads, so each player has his or her own buzzer. Making games such as Scene It? more approachable for all types of players, the Big Button Pad takes its inspiration from the game show buzzers of yesteryear but uses the latest infrared technology to minimize the chances of an argument over who answered first. Hi-def visuals: The game offers a wide assortment of movie clips in HD format, as well as hundreds of stills and audio clips from your favorite films. Minimal repeats: The Xbox 360 version keeps track of questions that have already been asked and minimizes repeats so you rarely get the same question twice. [Microsoft]… Expand"}, {"name": "Hitman: Codename 47", "details_link": "https://www.metacritic.com/game/pc/hitman-codename-47", "publisher": "Eidos Interactive", "release_date": "Nov 19 2000", "developers": ["Io Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Linear"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/89a3e5ebf40281acf07096fc586157f0-98.jpg", "descriptions": "Take control of this old-fashioned, modern-time assassin, and stay alive long enough to revile your past. Think to survive and learn to plan your hits. Exploit your enemy's hideout in three continents, and go forward to get back to where you started. Enter the world and face your self amongTake control of this old-fashioned, modern-time assassin, and stay alive long enough to revile your past. Think to survive and learn to plan your hits. Exploit your enemy's hideout in three continents, and go forward to get back to where you started. Enter the world and face your self among madmen. [Eidos Interactive]… Expand"}, {"name": "Monster Lab", "details_link": "https://www.metacritic.com/game/wii/monster-lab", "publisher": "Eidos Interactive", "release_date": "Nov  4 2008", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 2", "Wii"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "General", "Action RPG"], "meta_score": 73, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/0d9e2591cf63da526a0012f3cbe7022e-98.jpg", "descriptions": "Monster Lab is set in an eerie, supernatural world where the evil Baron Mharti rules the region with a cruel hand. Gamers take on the role of an apprentice scientist who must perform a vast array of intricate experiments to create creepy monsters from over 150 monster parts. From mechanicalMonster Lab is set in an eerie, supernatural world where the evil Baron Mharti rules the region with a cruel hand. Gamers take on the role of an apprentice scientist who must perform a vast array of intricate experiments to create creepy monsters from over 150 monster parts. From mechanical to biological to alchemical laboratories, players take control of their monstrous creations and explore the land, searching for ingredients to make stronger monster parts, hunting out and defeating enemy monsters, discovering quests to embark upon or simply competing in the numerous mini-games available. Monster Lab gives players the ability to challenge and compete with friends in ferocious multiplayer combat and collect monster parts and recipes in an obsessive pursuit of knowledge and power. The ultimate goal is to vanquish the evil Baron Mharti and liberate the villagers through mastering experiments, creating a powerful army of monsters and conquering all of the vast environments. Only then will the player rise through the ranks and become a Mad Scientist worthy of defeating the Baron! [Eidos Interactive]… Expand"}, {"name": "Pro Evolution Soccer 2011 3D", "details_link": "https://www.metacritic.com/game/3ds/pro-evolution-soccer-2011-3d", "publisher": "Konami", "release_date": "Mar 25 2011", "developers": ["Konami"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "3DS"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/3d4c119ba82fa95f1b4414554b19982a-98.jpg", "descriptions": "Pro Evolution Soccer 2011 3D brings soccer to the 3DS."}, {"name": "Earth 2160", "details_link": "https://www.metacritic.com/game/pc/earth-2160", "publisher": "Midway", "release_date": "Nov 16 2005", "developers": ["Reality Pump"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/f023c847be296d322ff197593a738a37-98.jpg", "descriptions": "EARTH 2160 is the official sequel of the award winning, very popular and top selling EARTH series and continues the brand of \"Earth 2140\" and \"Earth 2150.\" Only a few thousand humans managed to escape from the Earth before its collapse in 2150 A.D. They spent the next few years on the terraEARTH 2160 is the official sequel of the award winning, very popular and top selling EARTH series and continues the brand of \"Earth 2140\" and \"Earth 2150.\" Only a few thousand humans managed to escape from the Earth before its collapse in 2150 A.D. They spent the next few years on the terra forming of the red planet, developing new technologies and building up new civilisations. Somehow each of the three fractions \"Eurasian Dynasty\", \"United Civilised States\" and \"Lunar Corporation\" did this independently and separately from each other - but in the year 2160 something strange happens in this new world. If ED, UCS and LC join forces or continue their old war against each other - is possibly now, up to the player. Beside the usual venues in the solar system, there are some strange looking locations: planets with moving and reflecting liquid surfaces. And beside the standard RTS - resource acquisition, base building and destruction of enemy bases, the year 2160 will have some adventure inspired tasks for the players. [Zuxxez]… Expand"}, {"name": "They Always Run", "details_link": "https://www.metacritic.com/game/pc/they-always-run", "publisher": "Alawar Entertainment", "release_date": "Oct 20 2021", "developers": ["Alawar Premium"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/81979c8e9df29d71c537fd7178d0c6d0-98.jpg", "descriptions": "The galaxy's inhabitants have been swamped by crime since the fall of the empire. Being able to find anyone, anywhere has become a highly prized skill.Aidan is a three-armed bounty hunter who must hunt down the most dangerous and elusive cutthroats in the galaxy.\n\nSome bounties areThe galaxy's inhabitants have been swamped by crime since the fall of the empire. Being able to find anyone, anywhere has become a highly prized skill.Aidan is a three-armed bounty hunter who must hunt down the most dangerous and elusive cutthroats in the galaxy.Some bounties are rewarded with money, others with valuable information that Aidan can use to find the people who set him on this path all while getting embroiled in a galaxy-wide conspiracy.Hunt criminals across the fringes of the galaxy, the core worlds, and the ruins of long-gone civilizations. Upgrade your equipment, gain new abilities, grow stronger and destroy anything that stands in your way.Enjoy a complex story interwoven with high-octane gameplay and full of twists and turns that hit as hard as a bounty hunter's third arm!… Expand"}, {"name": "Arcade Spirits", "details_link": "https://www.metacritic.com/game/playstation-4/arcade-spirits", "publisher": "PQube", "release_date": "May  1 2020", "developers": ["Fiction Factory Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/4b2e3a38b28ec73b6f686e4ed366376f-98.jpg", "descriptions": "In the year 20XX, arcades still reign supreme. Take part in a romantic comedy visual novel and get to know the eccentric residents of the local Funplex. The future is filled with love and friendship."}, {"name": "Final Fantasy Crystal Chronicles: My Life as a Darklord", "details_link": "https://www.metacritic.com/game/wii/final-fantasy-crystal-chronicles-my-life-as-a-darklord", "publisher": "Square Enix", "release_date": "Jul 20 2009", "developers": ["Square Enix"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/79ef700f09628fec8de21705eefb4de8-98.jpg", "descriptions": "[WiiWare]  Step into the deadly-yet-fashionable shoes of the Darklord, a malevolent miss charged with dispatching intruding do-gooders by strategically placing traps and monsters within the tower she calls home. Players will need to get their hands on increasingly diabolical traps and[WiiWare]  Step into the deadly-yet-fashionable shoes of the Darklord, a malevolent miss charged with dispatching intruding do-gooders by strategically placing traps and monsters within the tower she calls home. Players will need to get their hands on increasingly diabolical traps and abominable monsters to stop those pesky adventurers from making it to the Dark Crystal at the top of the tower. Be warned, though - with heroes of all the tribes and jobs from the FINAL FANTASY CRYSTAL CHRONICLES series storming the Darklordâ??s lair in real time, traps and minions will count for nothing unless deployed with true evil genius. Anything less and the Darklordâ??s beloved home will be reduced to rubble. [Square Enix]… Expand"}, {"name": "Mercury Meltdown Remix", "details_link": "https://www.metacritic.com/game/playstation-2/mercury-meltdown-remix", "publisher": "Ignition Entertainment", "release_date": "Dec  4 2006", "developers": ["Ignition Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/f6bd4c0a32003f848275a76a064c23ad-98.jpg", "descriptions": "Mercury Meltdown is a brain-teasing puzzle game that challenges players to immerse themselves in a colorful world of sci-fi machines, crazy characters and bubbling test tubes. Players take control of a liquid mercury 'blob', guiding it around traps, door switches, spikes, moving floors andMercury Meltdown is a brain-teasing puzzle game that challenges players to immerse themselves in a colorful world of sci-fi machines, crazy characters and bubbling test tubes. Players take control of a liquid mercury 'blob', guiding it around traps, door switches, spikes, moving floors and other hazardous elements in order to complete the level. Over 200 thought provoking levels – more than any previous Mercury title. Two never-before seen Labs. Dual analog control with Rumble feedback. State-of-the-art blob physics including normal mercury, solid, cold and hot forms. Freeform game progression. Hidden features to unlock. [Ignition Entertainment]… Expand"}, {"name": "Unstoppable Gorg", "details_link": "https://www.metacritic.com/game/pc/unstoppable-gorg", "publisher": "Futuremark Games Studio", "release_date": "Jan 19 2012", "developers": ["Futuremark Games Studio"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Defense"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/21f1c3c8a9b6769be568c8bff44c80b0-98.jpg", "descriptions": "Unstoppable Gorg is a thrilling space defense game inspired by vintage sci-fi from the 1940s and 50s. Expect wholesome heroes, rubbery aliens and dodgy special effects as we pay homage to a great era of film. In Unstoppable Gorg you defend our solar system from the relentless march of aUnstoppable Gorg is a thrilling space defense game inspired by vintage sci-fi from the 1940s and 50s. Expect wholesome heroes, rubbery aliens and dodgy special effects as we pay homage to a great era of film. In Unstoppable Gorg you defend our solar system from the relentless march of a fearsome alien race by sending satellites into orbit around planets, moons and space stations. Unlike other tower defense style games, in Unstoppable Gorg you can move your satellites around their orbits to best defend against each wave, a convention defying mechanic that brings new vitality and interaction to the tower defense genre.… Expand"}, {"name": "Temtem", "details_link": "https://www.metacritic.com/game/playstation-5/temtem", "publisher": "Crema Games", "release_date": "Sep  6 2022", "developers": ["Crema Games"], "platforms": ["PC", "Switch", "Xbox Series X", "PlayStation 5"], "num_players": "Up to more than 64 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 73, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/8560c9da27f195e71a03255912aa521e-98.jpg", "descriptions": "Temtem is a massively multiplayer creature-collection journey where you seek adventure in the lovely Airborne Archipelago alongside your Temtem squad. Players can catch every Temtem, challenge other tamers, customize their house, or join a friend’s adventure in a fully co-op experience."}, {"name": "My Time At Portia", "details_link": "https://www.metacritic.com/game/xbox-one/my-time-at-portia", "publisher": "Team17", "release_date": "Apr 16 2019", "developers": ["Pathea Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/28893f01deaa744d3ddd8fa6fb70dfbd-98.jpg", "descriptions": "Embark on a new life in the enchanting town of Portia! Restore your Pa’s neglected workshop to its former glory by fulfilling commissions, growing crops, raising animals, and befriending the quirky inhabitants of this charming post-apocalyptic land."}, {"name": "Dante's Inferno", "details_link": "https://www.metacritic.com/game/xbox-360/dantes-inferno", "publisher": "Electronic Arts", "release_date": "Feb  9 2010", "developers": ["Visceral Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "Beat-'Em-Up", "Linear", "2D", "3D"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/256b9f6c2cdd1b750dd817b62a5959be-98.jpg", "descriptions": "Dante's Inferno tells an adapted story that focuses on delivering a blockbuster 3rd person action game experience while bringing Alighieri's depiction of Hell to the medium. Players assume the role of Dante, who descends into Hell after returning home to find his beloved Beatrice murdered,Dante's Inferno tells an adapted story that focuses on delivering a blockbuster 3rd person action game experience while bringing Alighieri's depiction of Hell to the medium. Players assume the role of Dante, who descends into Hell after returning home to find his beloved Beatrice murdered, with Lucifer seducing her soul into the underworld. Dante sets out on a rescue mission to save Beatrice, but he soon realizes he is also in Hell to face his own demons and ultimately to redeem himself. Players take Dante through nine unique circles of Hell as mapped out and described by Alighieri: limbo, lust, gluttony, greed, anger, heresy, violence, fraud and treachery. Each circle showcases its own distinct look, with demons, monsters, damned and geography that are crafted straight from the poem's vivid descriptions. To take down the demons of Hell, Dante is outfitted with two primary weapons: the Scythe he takes from Death and the Holy Cross given to him by Beatrice, which has spiritual powers that will help Dante collect souls and spells from the creatures he defeats on his journey. The game also features a deep upgrade system so gamers can customize their abilities to their specific gameplay style, something they'll need as Dante comes face to face with Hell's fiercest beasts and bosses. If successful, Dante will be able to tame certain beasts, exacting their will and turning Hell’s punishments back on itself. [Electronic Arts]… Expand"}, {"name": "FIFA 07 Soccer", "details_link": "https://www.metacritic.com/game/xbox-360/fifa-07-soccer", "publisher": "EA Sports", "release_date": "Oct 31 2006", "developers": ["EA Sports"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/4c27c0e9f4787ff63e1fbd77eadc962a-98.jpg", "descriptions": "FIFA Soccer 07 on the Xbox 360 moves away from the traditional animation-based game engine and now enables raw physics and data to drive the action, creating true-to-life movement and the most advanced visuals seen in a soccer game. Player characteristics are based on brand-new traits andFIFA Soccer 07 on the Xbox 360 moves away from the traditional animation-based game engine and now enables raw physics and data to drive the action, creating true-to-life movement and the most advanced visuals seen in a soccer game. Player characteristics are based on brand-new traits and twice the number of attributes, so you won't see two players moving in exactly the same way. Instead they look and behave like the athletes we see gracing the pitch week-in, week-out. Improved fundamental controls that are easy to pick-up-and play but difficult to master and enhanced AI enable you to truly enjoy the virtual recreation of the beautiful game. The ball and players react to your slightest touch with an unprecedented level of responsiveness, giving you complete control. For the first time ever the ball is alive with its own independent physics, resulting in truly unpredictable gameplay. Now any type of pass or shot is possible and goals will feel natural and unique. Using the physics-based and data-driven technology, the FIFA Soccer 07 engine creates a wealth of data that gives you the power to make real tactical decisions when managing your players. FIFA Soccer 07 offers never-before-experienced real-time player analysis. Monitor each player’s performance in the game by viewing complete passing, shooting and defending stats. Detailed feedback pinpoints where the player was located on the pitch and his contribution to the match. Now you can make informed decisions during halftime with the aid of this in-depth match analysis, enabling you to locate problem areas in both attack and defense. Check the areas of possession to make subtle adjustments to your play and spot defensive weaknesses in the opposition. All the shots, assists and goals are marked out so you can see who did the most damage. [Electronic Arts]… Expand"}, {"name": "Kinect Sports", "details_link": "https://www.metacritic.com/game/xbox-360/kinect-sports", "publisher": "Microsoft Game Studios", "release_date": "Nov  4 2010", "developers": ["Rare Ltd."], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Sports", "General", "General"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/09e9eef5b8c9da600bfbb79a6935022f-98.jpg", "descriptions": "This action sports compilation for the Xbox 360's motion-sensing accessory Kinect features boxing, bowling, beach volleyball, soccer, ping-pong, and traditional athletic events."}, {"name": "West of Dead", "details_link": "https://www.metacritic.com/game/xbox-one/west-of-dead", "publisher": "Raw Fury", "release_date": "Jun 18 2020", "developers": ["Upstream Arcade"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/12128c942456d54f111b1ae8f96026da-98.jpg", "descriptions": "Descend into the grim and gritty world of Purgatory in this fast-paced cover shooter which combines the fluidity of twin-stick controls and tactical cover usage. Dodge behind cover as you try to outgun your enemies in the unknown procedurally generated hunting grounds."}, {"name": "LEGO Harry Potter Collection", "details_link": "https://www.metacritic.com/game/playstation-4/lego-harry-potter-collection", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 18 2016", "developers": ["Warner Bros. Interactive Entertainment"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/d0a5e3351551ee35397466016c28568a-98.jpg", "descriptions": "The Lego Harry Potter Collection brings Years 1-4 and Years 5-7 to PS4 for the first time with both games remastered on one disc. This compilation unites the creative skills of Lego and the expansive world of Harry Potter, with a journey full of spell-casting, potion-making, puzzle-solving,The Lego Harry Potter Collection brings Years 1-4 and Years 5-7 to PS4 for the first time with both games remastered on one disc. This compilation unites the creative skills of Lego and the expansive world of Harry Potter, with a journey full of spell-casting, potion-making, puzzle-solving, lessons, dueling, and much more for players of all ages to enjoy. [Playstation.com]… Expand"}, {"name": "SpongeBob SquarePants: The Cosmic Shake", "details_link": "https://www.metacritic.com/game/switch/spongebob-squarepants-the-cosmic-shake", "publisher": "THQ Nordic", "release_date": "Jan 31 2023", "developers": ["Purple Lamp Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/e1462e0e1ecfd49abace71a21dfa3dd6-98.jpg", "descriptions": "Wish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that'sWish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that's nothing everyone's favorite sponge can't handle - with the right cosmic costume! Everybody do the Cosmic Shake!Features* Unlock classic and new platforming skills like the Fishhook Swing and Karate Kick* Don more than 30 F.U.N.tastic costumes like SnailBob and SpongeGar* Travel to 7 distinct Wishworlds like Wild West Jellyfish Fields and Halloween Rock Bottom* Experience all the buddy movie banter with SpongeBob's permanent companion Balloon-Patrick* Meet all your favorite Bikini Bottomites from the series, voiced by their original actors* Enjoy the in-game soundtrack featuring 101 songs from the series, including Sweet Victory… Expand"}, {"name": "Haven", "details_link": "https://www.metacritic.com/game/pc/haven", "publisher": "The Game Bakers", "release_date": "Dec  3 2020", "developers": ["The Game Bakers"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/a42a29de91220f256682a56ff5bdb107-98.jpg", "descriptions": "Does love truly conquer all? Two lovers gave up everything, left their entire lives behind, and escaped to a lost planet to be together. Play these lovers, Yu and Kay, at the same time as they settle into an unknown and eerie world. Explore the planet searching for parts and material to fixDoes love truly conquer all? Two lovers gave up everything, left their entire lives behind, and escaped to a lost planet to be together. Play these lovers, Yu and Kay, at the same time as they settle into an unknown and eerie world. Explore the planet searching for parts and material to fix their ship and make it a cosy home. Enjoy life together as a relatable couple cooking meals, crafting, collecting resources and engaging in meaningful conversations. Fight against those trying to tear them apart by synchroniSing their actions in combat, finding the perfect timing and rhythm, while controlling both characters simultaneously. Glide through the mysterious landscape, explore a fragmented world and fight against what’s trying to tear them apart in this RPG adventure about love, rebellion, and freedom.… Expand"}, {"name": "The Dark Pictures Anthology: Little Hope", "details_link": "https://www.metacritic.com/game/pc/the-dark-pictures-anthology-little-hope", "publisher": "Bandai Namco Games", "release_date": "Oct 30 2020", "developers": ["Supermassive Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Survival"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/1a406caa1256b9ca862b98ecd6ffde1f-98.jpg", "descriptions": "Abandoned and all alone, 4 college students and their teacher become stranded in an isolated town miles from anywhere after their bus crashes in bad weather. Trapped by a mysterious fog in the town of Little Hope, they search desperately for a means of escape whilst visions from the pastAbandoned and all alone, 4 college students and their teacher become stranded in an isolated town miles from anywhere after their bus crashes in bad weather. Trapped by a mysterious fog in the town of Little Hope, they search desperately for a means of escape whilst visions from the past haunt them from the shadows. \r\rKey features:\r WELCOME TO LITTLE HOPE\rWitness terrifying visions of the past, haunted by the events of the XVIIth century Andover Witch Trials.\r SAVE YOUR SOULS...\rEscape the nightmarish apparitions that relentlessly pursue your cast\r DON'T PLAY ALONE\rPlay online with a friend or up to 5 friends offline, share your story and cooperate wisely to save your cast.\r Abandon Hope All who enter here… Expand"}, {"name": "Neverwinter Nights 2: Storm of Zehir", "details_link": "https://www.metacritic.com/game/pc/neverwinter-nights-2-storm-of-zehir", "publisher": "Atari", "release_date": "Nov 18 2008", "developers": ["Obsidian Entertainment"], "platforms": "PC", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/c36b0a1352c23380abb8d16ac83d0875-98.jpg", "descriptions": "Travel the Sword Coast and Samarach using the open-ended exploration of the new Overland Map. Use skills like Spot and Survival while on the Overland Map to avoid ambushes and even find hidden locales and lost artifacts. Create your own full party of adventurers. Devastate your foes with aTravel the Sword Coast and Samarach using the open-ended exploration of the new Overland Map. Use skills like Spot and Survival while on the Overland Map to avoid ambushes and even find hidden locales and lost artifacts. Create your own full party of adventurers. Devastate your foes with a squad of fireball-flinging Sorcerers, form a solid wall of steel with a party of Fighters, or strike the perfect balance in your party by spreading out the classes you choose for your characters. Improved party gameplay including streamlined party conversations, a new Teamwork Benefit System, and powerful party feats. The world's economy reacts to your adventures and choices. And, through trading and quests, you can expand your merchant company into a massive trading empire. [Atari]… Expand"}, {"name": "Asterigos: Curse of the Stars", "details_link": "https://www.metacritic.com/game/pc/asterigos-curse-of-the-stars", "publisher": "tinyBuild", "release_date": "Oct 11 2022", "developers": ["Acme Gamestudio"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/65ba25c8b72697246f6c176cfc13edfc-98.jpg", "descriptions": "Embark on a journey full of danger in this action RPG, inspired by Greek and Roman mythologies. Explore the breathtaking city of Aphes and forge your way through legions of unique foes and mythical bosses to discover the truth behind the city’s curse."}, {"name": "Minoria", "details_link": "https://www.metacritic.com/game/pc/minoria", "publisher": "DANGEN Entertainment", "release_date": "Aug 27 2019", "developers": ["Bombservice"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Open-World"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/66aa3716134a3f79fe10f097fd63424d-98.jpg", "descriptions": "Ink and blood stain the streets of Ramezia. Witches must burn and sins must be judged. Venture forth as Sister Semilla to burn down the pillars of heresy in Minoria, an action-platformer by Bombservice, creators of Momodora."}, {"name": "Creed: Rise to Glory", "details_link": "https://www.metacritic.com/game/playstation-4/creed-rise-to-glory", "publisher": "Survios", "release_date": "Sep 25 2018", "developers": ["Survios"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Individual", "Combat", "Boxing / Martial Arts"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/5826d19e5b5fc616d91a835637183c75-98.jpg", "descriptions": "Follow the ascent of boxer Adonis Creed as you go toe-to-toe with the world’s top opponents in an intense boxing experience that lets you train, fight, and win like a Creed."}, {"name": "Immortal Redneck", "details_link": "https://www.metacritic.com/game/playstation-4/immortal-redneck", "publisher": "CremaGames", "release_date": "Feb 27 2018", "developers": ["CremaGames", "Crema Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/adfea3f73321c13cb00ed5e78cfb6679-98.jpg", "descriptions": "Immortal Redneck mixes old-school first-person shooter action with rogue-lite mechanics. Frantic gameplay, twitch controls and an arcade-style feel meet randomly generated dungeons, a complete skill tree, permanent death and nine classes with different traits."}, {"name": "Project Highrise", "details_link": "https://www.metacritic.com/game/pc/project-highrise", "publisher": "Kasedo Games", "release_date": "Sep  8 2016", "developers": ["SomaSim"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/416e08d4f5becbaef99d3d721431533d-98.jpg", "descriptions": "Project Highrise is a skyscraper construction and management sim."}]