[{"name": "Full Spectrum Warrior: Ten Hammers", "details_link": "https://www.metacritic.com/game/pc/full-spectrum-warrior-ten-hammers", "publisher": "THQ", "release_date": "Mar 28 2006", "developers": ["Pandemic Studios"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/9822d744875fb4423b23f71c75817106-98.jpg", "descriptions": "As squad leader, players coordinate the actions of multiple infantry fire teams, leading them through a variety of hostile environments. An intuitive control scheme allows direction of squads in real-time as players outthink, outmaneuver and outgun enemies through more than 12 levels ofAs squad leader, players coordinate the actions of multiple infantry fire teams, leading them through a variety of hostile environments. An intuitive control scheme allows direction of squads in real-time as players outthink, outmaneuver and outgun enemies through more than 12 levels of intense warfare. Players will utilize authentic battlefield tactics as they confront the enemy with a deadly arsenal of weapons, the latest military equipment, and new Player-controlled mechanized units. With an enhanced multiplayer mode, players can go online and battle friends through a variety of new head-to-head and co-op objective-based missions. [THQ]… Expand"}, {"name": "Beat Hazard", "details_link": "https://www.metacritic.com/game/pc/beat-hazard", "publisher": "ValuSoft", "release_date": "Apr 15 2010", "developers": ["ShadowRage"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/cc7f26b3b5315ac57f97dba32822188a-98.jpg", "descriptions": "Experience your music collection like never before with this intense music driven arcade shooter. Each of your songs will have its own unique ebb and flow based on the music. Power up your spaceship and watch as the music boosts your firepower. Unleash hell on the enemy ships when you maxExperience your music collection like never before with this intense music driven arcade shooter. Each of your songs will have its own unique ebb and flow based on the music. Power up your spaceship and watch as the music boosts your firepower. Unleash hell on the enemy ships when you max out with weapon pickups! Beat Hazard seamlessly mixes the love of gaming and music. Together they become greater than the sum of their parts.… Expand"}, {"name": "Mother Russia Bleeds", "details_link": "https://www.metacritic.com/game/pc/mother-russia-bleeds", "publisher": "Devolver Digital", "release_date": "Sep  5 2016", "developers": ["Le Cartel Studio"], "platforms": ["PlayStation 4", "Switch", "PC"], "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/ad547586efc1b1deda5fe6ae802dda54-98.jpg", "descriptions": "Mother Russia Bleeds is an ultra-violent co-op brawler overflowing with an unmistakable style and unforgettably brutal action for up to four players at once. Set in an alternate U.S.S.R, the story centers on a desperate crew of imprisoned street fighters that must overcome an oppressiveMother Russia Bleeds is an ultra-violent co-op brawler overflowing with an unmistakable style and unforgettably brutal action for up to four players at once. Set in an alternate U.S.S.R, the story centers on a desperate crew of imprisoned street fighters that must overcome an oppressive criminal authority and crippling drug addictions through any means necessary. Battle solo or alongside friends locally and online in an exceptional story mode campaign or harden your resolve in a multitude of formidable challenge and versus modes.… Expand"}, {"name": "Beat Cop", "details_link": "https://www.metacritic.com/game/switch/beat-cop", "publisher": "11 bit studios", "release_date": "Mar  5 2019", "developers": ["11 bit studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 70, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/a1258130af9c29ec7a2845f22dc204c7-98.jpg", "descriptions": "New York, more like a beast than a city. Explore it’s darkest corners and uncover its secrets as Jack Kelly, a former detective who has been framed for a murder. Degraded and forgotten by old pals, it’s your last chance to find the truth behind this whole terrible mess. The thing is, yourNew York, more like a beast than a city. Explore it’s darkest corners and uncover its secrets as Jack Kelly, a former detective who has been framed for a murder. Degraded and forgotten by old pals, it’s your last chance to find the truth behind this whole terrible mess. The thing is, your new boss treats you horribly, your wife is a money sucking spawn from hell and the local mafia wants your head on a plate. I guess you could say, that things are complicated down here, in the middle of Brooklyn. Oh, and don't forget about writing tickets, reprimanding pedestrians & such. … Expand"}, {"name": "EA Sports UFC", "details_link": "https://www.metacritic.com/game/xbox-one/ea-sports-ufc", "publisher": "Electronic Arts", "release_date": "Jun 17 2014", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["General", "Sports", "General", "Individual", "Combat", "Boxing / Martial Arts"], "meta_score": 70, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/58dd66974395c983c20f8e42da0e50b3-98.jpg", "descriptions": "UFC Ultimate Fighting Championship is a mixed martial arts fighting game that uses the new EA Sports Ignite engine. When players beat career mode on pro difficulty or higher, they will unlock Bruce Lee and can test his legacy against the best of the best in the UFC across four differentUFC Ultimate Fighting Championship is a mixed martial arts fighting game that uses the new EA Sports Ignite engine. When players beat career mode on pro difficulty or higher, they will unlock Bruce Lee and can test his legacy against the best of the best in the UFC across four different weight classes. … Expand"}, {"name": "Democracy 3", "details_link": "https://www.metacritic.com/game/pc/democracy-3", "publisher": "Positech Games", "release_date": "Oct 14 2013", "developers": ["Positech Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/437977f4cda8efa384ca0b10fd8e5d7d-98.jpg", "descriptions": "Have you ever wanted to be president? or prime-minister? Convinced you could do a better job of running the country? Let's face it, you could hardly do a worse job than our current political leaders. \r\rCrime, Unemployment, National Debt, Terrorism, Climate Change...Have you got the answersHave you ever wanted to be president? or prime-minister? Convinced you could do a better job of running the country? Let's face it, you could hardly do a worse job than our current political leaders. \r\rCrime, Unemployment, National Debt, Terrorism, Climate Change...Have you got the answers to the problems that face western industrialized nations? Here is your chance to find out...… Expand"}, {"name": "SingStar ABBA", "details_link": "https://www.metacritic.com/game/playstation-3/singstar-abba", "publisher": "SCEA", "release_date": "Dec  2 2008", "developers": ["SCEE London Studio"], "platforms": ["PlayStation 2", "PlayStation 3"], "num_players": "1-8 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 70, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/d33e185f6231458c044b437c0d8832a3-98.jpg", "descriptions": "SingStar ABBA features 25 fabulous pop tracks so you can shine on stage and sing along to authentic ABBA music videos. Experience SingStar’s online features and personalize your content by purchasing songs, uploading videos/photos and rating the performances of others. Get ready to singSingStar ABBA features 25 fabulous pop tracks so you can shine on stage and sing along to authentic ABBA music videos. Experience SingStar’s online features and personalize your content by purchasing songs, uploading videos/photos and rating the performances of others. Get ready to sing along to some of the most unforgettable songs of all time with SingStar ABBA. 25 famous tracks with the original ABBA videos, including ‘Mamma Mia’, ‘Gimme Gimme Gimme’, ‘Waterloo’ and ‘Dancing Queen’. Connect to my SingStar Online and share your favorite SingStar moments by uploading photos and performances. Up to 8 players can perform and compete in a variety of multiplayer game modes. [Sony]… Expand"}, {"name": "Darkestville Castle", "details_link": "https://www.metacritic.com/game/switch/darkestville-castle", "publisher": "Buka Entertainment", "release_date": "Aug 13 2020", "developers": ["Epic llama warchief"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/4dbe9aac8ece80920d3ce462c5187f71-98.jpg", "descriptions": "Dear Potential servant of chaos, Being evil isn’t always easy… But boy it is so much more fun than being a good guy. Having someone witty like you on my team could be useful during these not so dark times. Everything in Darkestville was fine and dandy: I was tormenting the town people, theDear Potential servant of chaos, Being evil isn’t always easy… But boy it is so much more fun than being a good guy. Having someone witty like you on my team could be useful during these not so dark times. Everything in Darkestville was fine and dandy: I was tormenting the town people, the town people were being tormented… It was a fair deal! Who could complain? Not me, that’s for sure! …until that moron, Dan Teapot, hired a group of professional demon hunters to banish me! I don’t even know why he has a grudge against me. Maybe I burnt his house a couple of times, but I only did it because it was hilarious!\r Anyway.\r Help me in this adventure to best my foes and let’s make evil reign Darkestville once more!… Expand"}, {"name": "Anomaly Defenders", "details_link": "https://www.metacritic.com/game/pc/anomaly-defenders", "publisher": "11 bit studios", "release_date": "May 29 2014", "developers": ["11 bit studios"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "Sci-Fi", "Defense"], "meta_score": 70, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/32a7158d534da2432dced811643d28e7-98.jpg", "descriptions": "Anomaly Defenders is the closing installment of the Anomaly series. The original incarnation of the Tower Offense sub-genre had players controlling humans fighting alien invaders. Now, the tables have turned. The human counterattack is underway and the alien homeworld is under threat."}, {"name": "Fatal Fury: Battle Archives Volume 2", "details_link": "https://www.metacritic.com/game/playstation-2/fatal-fury-battle-archives-volume-2", "publisher": "SNK Playmore", "release_date": "Apr  8 2008", "developers": ["SNK Playmore"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/75b0ee015e31e4b0d1be136c3d16c2c4-98.jpg", "descriptions": "Fatal Fury Battle Archives Vol. 2 is a collection of 3 games (on one disc) from one of SNK’s most popular fighting game series FATAL FURY. The titles included are:  REAL BOUT FATAL FURY, REAL BOUT FATAL FURY SPECIAL and REAL BOUT FATAL FURY 2; The Newcomers.  The games are known for theirFatal Fury Battle Archives Vol. 2 is a collection of 3 games (on one disc) from one of SNK’s most popular fighting game series FATAL FURY. The titles included are:  REAL BOUT FATAL FURY, REAL BOUT FATAL FURY SPECIAL and REAL BOUT FATAL FURY 2; The Newcomers.  The games are known for their hand-drawn animation and character designs containing visual flair and personality with 2D gameplay that is fast, furious and addictive. [SNK Playmore]… Expand"}, {"name": "DreamWorks Shrek the Third", "details_link": "https://www.metacritic.com/game/ds/dreamworks-shrek-the-third", "publisher": "Activision", "release_date": "May 15 2007", "developers": ["Vicarious Visions"], "platforms": ["PC", "Xbox 360", "DS"], "num_players": "14  Online", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 70, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/2/bccb83b634de132d53079058364a987d-98.jpg", "descriptions": "Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies,Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies, and visit never before seen lands from the movie and beyond. [Activision]… Expand"}, {"name": "Tom Clancy's Rainbow Six 3", "details_link": "https://www.metacritic.com/game/playstation-2/tom-clancys-rainbow-six-3", "publisher": "Ubisoft", "release_date": "Mar 24 2004", "developers": ["Ubisoft Shanghai"], "platforms": "PlayStation 2", "num_players": "1-6 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/130ef29bb7b3abd6a5afae94050af912-98.jpg", "descriptions": "The year is 2007 and the world stands on the brink of a terrifying global conflict. As the United States is caught in an embargo-induced oil crisis, terrorist attacks against American interests - and citizens - escalate. Venezuela, which still supplies the United States with oil, alsoThe year is 2007 and the world stands on the brink of a terrifying global conflict. As the United States is caught in an embargo-induced oil crisis, terrorist attacks against American interests - and citizens - escalate. Venezuela, which still supplies the United States with oil, also becomes a target. As unrest grows in America, protests rock the streets of Caracas. And while the shadow of terror looms, madmen plot even greater acts of murder and destruction. No place is safe, no border secure in this hour of fear. Only one bulwark stands between the world and the threats that now face it: RAINBOW, an international task force dedicated to combating terrorism in all its forms. A top-secret organization consisting of the best field operatives the United Nations has to offer, RAINBOW is the most potent weapon in the world's arsenal. Backed by the most sophisticated technology available and trained to the limits of human capability, they are our best hope in the war against terror. [Ubisoft]… Expand"}, {"name": "Silent Hill HD Collection", "details_link": "https://www.metacritic.com/game/playstation-3/silent-hill-hd-collection", "publisher": "Konami", "release_date": "Mar 20 2012", "developers": ["Hijinx Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Horror", "Compilation", "Compilation"], "meta_score": 70, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/4/68a946fbbf803009e7953a9da628cbc4-98.jpg", "descriptions": "Silent Hill HD Collection bundles Silent Hill 2 and 3 together enhanced with HD upgrades."}, {"name": "Remember Me", "details_link": "https://www.metacritic.com/game/xbox-360/remember-me", "publisher": "Capcom", "release_date": "Jun  4 2013", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/b49d7e4d01b72265fd3e0d86fe75734a-98.jpg", "descriptions": "The place is Neo-Paris. The year is 2084. Personal memories are now digitised, bought, sold and traded. The last vestiges of privacy and intimacy have been swept away in what appears to be a logical progression of the explosive growth of social networks at the start of the 21st century. TheThe place is Neo-Paris. The year is 2084. Personal memories are now digitised, bought, sold and traded. The last vestiges of privacy and intimacy have been swept away in what appears to be a logical progression of the explosive growth of social networks at the start of the 21st century. The citizens themselves have acquiesced to this surveillance society in exchange for the comfort only smart technology can provide. This memory economy transfers immense power over society to just a handful of people. Remember Me is a third-person action adventure in which players assume the role of Nilin, a former elite memory hunter with the ability to penetrate people’s minds and steal or even alter their memories. The authorities, fearful of her knowledge and powers arrested Nilin and wiped her memory clean. After her escape from prison, Nilin embarks on a mission to recover her identity, helped by her last and only friend. This search for her past leads to her being hunted by the very people that created this surveillance society.… Expand"}, {"name": "Banner of the Maid", "details_link": "https://www.metacritic.com/game/switch/banner-of-the-maid", "publisher": "CE-Asia", "release_date": "Aug 12 2020", "developers": ["CE-Asia", "Azure Flame Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/d0ef773497722e6d8823b675bc67912b-98.jpg", "descriptions": "Banner of the Maid is a Turn-Based Strategy Game set in the late 18th century to early 19th century, based on the alternative history of the French Revolution. At the end of 18th century, as the House of Bourbon was on the verge of clasping, Louis XVI of France planned to secretly escapeBanner of the Maid is a Turn-Based Strategy Game set in the late 18th century to early 19th century, based on the alternative history of the French Revolution. At the end of 18th century, as the House of Bourbon was on the verge of clasping, Louis XVI of France planned to secretly escape from his country. Starting from the French Revolution, the wave of chaos swiped across Europe. Follow the steps of our protagonist, the young female officer Pauline Bonaparte, to start her journey as a regular officer and win battles both on the battlefront and in the political vortex of Paris, and finally write her own heroic story.… Expand"}, {"name": "Graveyard Keeper", "details_link": "https://www.metacritic.com/game/xbox-one/graveyard-keeper", "publisher": "tinyBuild", "release_date": "Aug 15 2018", "developers": ["Lazy Bear Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "Virtual", "Open-World", "Career"], "meta_score": 70, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/8/edb3a232dac726a0c09a7c52722f295f-98.jpg", "descriptions": "Graveyard Keeper is the most inaccurate medieval cemetery management sim of the year. Build & manage your own graveyard while finding shortcuts to cut costs, expand into entertainment with witch-burning festivals, and scare nearby villagers into attending church. This is a game of capitalismGraveyard Keeper is the most inaccurate medieval cemetery management sim of the year. Build & manage your own graveyard while finding shortcuts to cut costs, expand into entertainment with witch-burning festivals, and scare nearby villagers into attending church. This is a game of capitalism and doing whatever it takes to build a thriving business. Face ethical dilemmas. Do you really want to spend money on that proper hotdog meat for the festival when you have so many resources lying around? Gather valuable resources & craft new items. Expand your Graveyard into a thriving business, go ahead and gather valuable resources scattered in the surrounding areas, and explore what this land has to offer. Make business alliances. These dead bodies don't need all that blood, do they? Why not sell it to someone who can put it to good use. Same for body parts. Hey, it's being efficient with recycling! Explore mysterious dungeons. No medieval game would be complete without these. Take a trip into the unknown and find useful new ingredients which may or may not poison a whole bunch of nearby villagers. Capitalism. [Microsoft]… Expand"}, {"name": "Beyond: Two Souls", "details_link": "https://www.metacritic.com/game/playstation-3/beyond-two-souls", "publisher": "SCEA", "release_date": "Oct  8 2013", "developers": ["Quantic Dream"], "platforms": ["PC", "PlayStation 4", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 70, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/a29a7f78896bfee845c52299c25a5c84-98.jpg", "descriptions": "Live the life of Jodie Holmes, a young woman who possesses supernatural powers through her psychic link to a mysterious invisible entity. Experience the most striking moments of Jodie's life as your actions and decisions determine her fate. As she traverses the globe, Jodie will faceLive the life of Jodie Holmes, a young woman who possesses supernatural powers through her psychic link to a mysterious invisible entity. Experience the most striking moments of Jodie's life as your actions and decisions determine her fate. As she traverses the globe, Jodie will face incredible challenges against a backdrop of emotionally-charged events never before seen in a video game.… Expand"}, {"name": "WWE Legends of WrestleMania", "details_link": "https://www.metacritic.com/game/playstation-3/wwe-legends-of-wrestlemania", "publisher": "THQ", "release_date": "Mar 24 2009", "developers": ["Yuke's"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 70, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/ed2c716a85e192a16d93334d62e5f685-98.jpg", "descriptions": "WWE Legends of WrestleMania embraces the leading sports entertainment organization's rich history to relive, rewrite or recreate the definitive elements of WWE from the Eighties and Nineties. Players relive the entertaining lives of more than 40 larger-than-life Legends and have control overWWE Legends of WrestleMania embraces the leading sports entertainment organization's rich history to relive, rewrite or recreate the definitive elements of WWE from the Eighties and Nineties. Players relive the entertaining lives of more than 40 larger-than-life Legends and have control over Legendary Managers, each of whom play crucial roles in match outcomes. The game's new grapple-based fighting system captures the high-energy action and drama seen in vintage WWE matches, while a historically accurate representation of past WWE telecasts sets the stage, including dynamic visual treatments, signature ring entrances, renowned commentators and notable venues. WWE Legends of WrestleMania also includes a WrestleMania Tour Mode that allows players to participate in key matches from multiple WrestleMania events, a Create-A-Legend system to develop the Legends of tomorrow, as well as online functionality for players to compete on the biggest stages in WWE history. [THQ]… Expand"}, {"name": "Crash of the Titans", "details_link": "https://www.metacritic.com/game/playstation-2/crash-of-the-titans", "publisher": "Sierra Entertainment", "release_date": "Oct  4 2007", "developers": ["Radical Entertainment"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/2bb71f6f3297e46014120f7cce4e789c-98.jpg", "descriptions": "In Crash of the Titans, players fight a nefarious plot hatched by Crash's arch nemeses Neo and Nina Cortex to mutate the local creatures into titanic abominations. Using Crash's legendary mix of outrageous antics and daredevil bravado, players \"hijack\" enemies to take control of their actionIn Crash of the Titans, players fight a nefarious plot hatched by Crash's arch nemeses Neo and Nina Cortex to mutate the local creatures into titanic abominations. Using Crash's legendary mix of outrageous antics and daredevil bravado, players \"hijack\" enemies to take control of their action and use their fearsome powers against all manner of enemies. \"Jack to Attack!\" – Control, play and battle as 15 enemies, including titanic creatures such as Scorporilla, Ratcicle, Magamadon and Shellephant. While in control of a monster players can throw toxic stink bombs, call lightning down from the sky, fire lasers beams from their eyes or even impale enemies with a massive scorpion tail - use all of the creatures' special abilities to defeat Neo and Nina Cortex. Crash now has a powerful acrobatic fighting system that includes punches and flying kicks, multiple attacks and special counter moves. Players can power-up skills to unlock new attacks and blazing combos. Crash can now interact with his world in totally new ways. Players can wall-run, swing from ropes and flip off springboards – Crash can even toss Aku Aku on the ground to surf, skate, grind and shred. At any point in the game, a second player can join in the fun and play as Carbon-Crash to help unleash total chaos. In a totally innovative twist to co-op action gaming, Crash can even jack Carbon-Crash (or vice versa) for some hysterical Crash \"jacked\"-Crash mayhem. [Sierra Entertainment]… Expand"}, {"name": "Mercenary Kings", "details_link": "https://www.metacritic.com/game/playstation-4/mercenary-kings", "publisher": "Tribute Games", "release_date": "Apr  1 2014", "developers": ["Tribute Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General", "Shooter", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 70, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/417c700da4003d21b0b6e3bccbd4e875-98.jpg", "descriptions": "Craft your arsenal to avenge your fallen comrades and save the world from the fearsome forces of CLAW.\r Save the world\r\n\r\nIn this frantic 2D action game, you are part of the Mercenary Kings, the most skilled team of warriors-for-hire on Earth. When your comrades have fallen and theCraft your arsenal to avenge your fallen comrades and save the world from the fearsome forces of CLAW.\r Save the world\r In this frantic 2D action game, you are part of the Mercenary Kings, the most skilled team of warriors-for-hire on Earth. When your comrades have fallen and the fearsome forces of CLAW have seized an island-wide top secret Laboratory Base, you must do what it takes to stop them.\r But you're not going in unprepared - as backup you've got a crew of rogue geniuses and experts in their field. Able to craft and customize guns'n'blades or upgrade your body armour, you've never been this ready to join the fight.… Expand"}, {"name": "Worms Battlegrounds", "details_link": "https://www.metacritic.com/game/xbox-one/worms-battlegrounds", "publisher": "Team17", "release_date": "May 30 2014", "developers": ["Team17"], "platforms": ["PlayStation 4", "Xbox One"], "genres": ["Strategy", "Turn-Based", "Wargame", "Artillery"], "meta_score": 70, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/c1055e39d34a5d3e74dc0a00d7af03da-98.jpg", "descriptions": "Worms Battlegrounds features an extensive single player campaign covering 25 story missions and 10 “Worm-Ops” time-attack missions, which are set across five stunning environments (Inca, Viking, Feudal Japan and Industrial Revolution) with new day-to-night lighting transitions."}, {"name": "Ticket to Ride", "details_link": "https://www.metacritic.com/game/xbox-360/ticket-to-ride", "publisher": "Microsoft Game Studios", "release_date": "Jun 25 2008", "developers": ["Next Level Games"], "platforms": "Xbox 360", "num_players": "5  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 70, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/ab7015b636cabca9d49a10ff79eb2675-98.jpg", "descriptions": "[Xbox Live Arcade]  Travel from coast to coast and visit all the stops on the exciting train adventure Ticket to Ride. Plan your routes and connect your cities across the country to become the ultimate traveler. Earn points as you claim your tracks and complete your tickets for your chance[Xbox Live Arcade]  Travel from coast to coast and visit all the stops on the exciting train adventure Ticket to Ride. Plan your routes and connect your cities across the country to become the ultimate traveler. Earn points as you claim your tracks and complete your tickets for your chance at the big score. From sea to sea, crisscross the nation as you build the longest route and take home the prize. It's hours of fun for your family and friends. Variable difficulty levels: Either locally or in Xbox Live matches, choose Easy, Medium, or Hard A.I. opponents to challenge your gaming skills. Play with up to three of your friends on a single console, or take on Ranked or Player matches over Xbox LIVE with up to five players. Post your Xbox LIVE match results to the leaderboards. Follow game stats for each player such as Highest Score, Total Trains Played and their Time Spent Playing. And track your progress with twelve new achievements. See yourself and your friends during gameplay with Xbox LIVE Vision Camera support. [Microsoft]… Expand"}, {"name": "Cars", "details_link": "https://www.metacritic.com/game/xbox/cars", "publisher": "THQ", "release_date": "Jun  6 2006", "developers": ["Rainbow Studios"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/d295087a3876e6cf7acd83bde378703a-98.jpg", "descriptions": "Race to the finish line in Cars as you live all the fun and excitement of the next Walt Disney Pictures presentation of the Pixar Animation Studios film. Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship."}, {"name": "Watch Dogs: Legion", "details_link": "https://www.metacritic.com/game/playstation-4/watch-dogs-legion", "publisher": "Ubisoft", "release_date": "Oct 29 2020", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 70, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/58c39411b1d8dc57013d95d10f414503-98.jpg", "descriptions": "In the near future, London is facing its downfall: the people are being oppressed by an all-seeing surveillance state, a corrupt private military corporation controls the streets, and a powerful crime syndicate is preying on the vulnerable. The fate of London lies with you, and your abilityIn the near future, London is facing its downfall: the people are being oppressed by an all-seeing surveillance state, a corrupt private military corporation controls the streets, and a powerful crime syndicate is preying on the vulnerable. The fate of London lies with you, and your ability to recruit a resistance and fight back.\r Watch Dogs: Legion delivers a never-before-seen gameplay innovation that allows you to recruit and play as anyone you see in the iconic city of London. Every single character in the open world is playable, and everyone has a backstory, personality, and skillset that will help you personalize your own unique team. Bring your characters online and join forces with friends to take back London in four-player co-op missions, end-game challenges, and daily events. Welcome to the Resistance.… Expand"}, {"name": "Project CARS 3", "details_link": "https://www.metacritic.com/game/playstation-4/project-cars-3", "publisher": "Bandai Namco Games", "release_date": "Aug 25 2020", "developers": ["Slightly Mad Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 70, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/2/f88de10dcd8398b9056ee8e715bfe091-98.jpg", "descriptions": "Project CARS 3 is the third instalment in the best-seller racing franchise that brings all the intense thrills, emotions and fun from the vibrant world of motor racing to vivid life as players undertake a whole new exciting career journey that sees them rise from weekend warrior to racingProject CARS 3 is the third instalment in the best-seller racing franchise that brings all the intense thrills, emotions and fun from the vibrant world of motor racing to vivid life as players undertake a whole new exciting career journey that sees them rise from weekend warrior to racing legend.\r Also new to the franchise is a deeply engaging metagame that challenges players to race hard and earn in-game Credits with which to buy and own hundreds of cars from the world's most elite brands and race them all on dynamic and spectacular circuits around the globe featuring stunning all-weather, all-seasons conditions.\r Race-won Credits and XP will also entice players to buy authentic performance upgrades and customisation options for their stable of exclusive cars, including wheels, tyres, body kits, rims, as well as personalisation options to create their own racing hero personas.\r With a completely redesigned and unrivalled controller experience, an even more accurate and fun handling model, adjustable skill settings for every level of driver and every element of weather-affected races, Project CARS 3 is the biggest, most exciting and authentic evolution to the definitive racing franchise.… Expand"}, {"name": "Destroy All Humans!", "details_link": "https://www.metacritic.com/game/playstation-4/destroy-all-humans!", "publisher": "THQ Nordic", "release_date": "Jul 28 2020", "developers": ["Black Forest Games"], "platforms": ["PC", "PlayStation 2", "Stadia", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/be9798f55aec94c4557cd157b1c31b1c-98.jpg", "descriptions": "This is your chance to experience the other side of an alien invasion. Take on the role of alien Cryptosporidium 137 and terrorize the people of Earth to harvest their DNA in the most brazen action-adventure you've ever played. Take over all of humanity using a variety of alien weaponry onThis is your chance to experience the other side of an alien invasion. Take on the role of alien Cryptosporidium 137 and terrorize the people of Earth to harvest their DNA in the most brazen action-adventure you've ever played. Take over all of humanity using a variety of alien weaponry on land or in the air. … Expand"}, {"name": "Life is Strange Remastered Collection", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-remastered-collection", "publisher": "Square Enix", "release_date": "Feb  1 2022", "developers": ["DONTNOD Entertainment"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 70, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/8c95863e11d5104e8e123f482ea8142d-98.jpg", "descriptions": "Experience the BAFTA award-winning story of Life is Strange now beautifully remastered with enhanced visuals and vastly improved animation using mocap technology.Play as Max Caulfield, a photography senior who discovers she can rewind time while saving her best friend Chloe Price from aExperience the BAFTA award-winning story of Life is Strange now beautifully remastered with enhanced visuals and vastly improved animation using mocap technology.Play as Max Caulfield, a photography senior who discovers she can rewind time while saving her best friend Chloe Price from a violent altercation.The pair soon find themselves investigating the mysterious disappearance of fellow student Rachel Amber, uncovering a dark side to life in Arcadia Bay. Meanwhile, Max must quickly learn that changing the past can sometimes lead to a devastating future. The Life is Strange Remastered Collection includes 'Life is Strange Remastered' and 'Life is Strange: Before the Storm Remastered'.… Expand"}, {"name": "Wailing Heights", "details_link": "https://www.metacritic.com/game/pc/wailing-heights", "publisher": "Outsider Games", "release_date": "Apr 27 2016", "developers": ["Outsider Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 70, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/cc34e81924284138faa4b49d7310fc33-98.jpg", "descriptions": "A body-hopping, musical adventure game, set in a horrific hamlet of monsters, with a story by Kevin Beimers (Hector: Badge of Carnage) and glorious 2D artwork from a host of illustrious comic book talent."}, {"name": "Pearl Harbor Trilogy - 1941: Red Sun Rising", "details_link": "https://www.metacritic.com/game/wii/pearl-harbor-trilogy---1941-red-sun-rising", "publisher": "Legendo Entertainment", "release_date": "Jul  5 2010", "developers": ["Arcade Moon"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "Simulation", "General", "Flight", "WWII", "WWII", "Combat"], "meta_score": 70, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/7616ef711d1f7bc2776cb1231a58e0bf-98.jpg", "descriptions": "[WiiWare]  Pearl Harbor Trilogy - 1941: Red Sun Rising is the first title in a trilogy of air-combat action games for the WiiWare service. Take off from aircraft carrier decks and historic military bases as you conduct covert strikes, engage in furious dogfights and fly search-and-destroy[WiiWare]  Pearl Harbor Trilogy - 1941: Red Sun Rising is the first title in a trilogy of air-combat action games for the WiiWare service. Take off from aircraft carrier decks and historic military bases as you conduct covert strikes, engage in furious dogfights and fly search-and-destroy missions. Pilot the most prolific fighter, bomber and torpedo-bearing aircraft of the World War II Pacific Theatre. Featuring two campaigns spanning the early years of the Pacific War, you can play as the United States Naval Air Force or the Imperial Japanese Navy Air Force. You can also choose to practice your combat skills in the Avenging Ace or Survival dogfight modes.… Expand"}, {"name": "SimAnimals", "details_link": "https://www.metacritic.com/game/ds/simanimals", "publisher": "Electronic Arts", "release_date": "Jan 27 2009", "developers": ["Electronic Arts"], "platforms": "DS", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/b3470f792ef04e61e2c72d285c173348-98.jpg", "descriptions": "Now, for the first time players can engage with the wild world of animals in their natural surroundings in an immersive and tactile way. In this game you are challenged to engage, touch, move and try to control a wide range of animals as you journey deeper and deeper into the forest. YouNow, for the first time players can engage with the wild world of animals in their natural surroundings in an immersive and tactile way. In this game you are challenged to engage, touch, move and try to control a wide range of animals as you journey deeper and deeper into the forest. You control an on-screen animated hand that allows you to reach out and touch, pick up and move everything in the game from foxes and bears to trees and flowers. Cohabitate with these animals in their natural surroundings, and based on how you treat them, the animals will come to know and love – or dislike you. Have fun developing relationships with wild animals and their families, and experience the humor and drama of surviving in the wilderness. Wild animals abound. You will meet a host of friendly wild animals including deer, squirrels, rabbits, hedgehogs and owls. And also some mischievous characters like foxes, raccoons, badgers, crows and bears who love to stir up trouble. Get in the middle of the action as they all come together in your very own forest setting for a wild time. Solve challenges and achieve goals throughout the game, because the animals need you to help them thrive. Discover secrets, unlock forest areas and uncover one-of-a-kind objects and wild animals, some with special abilities, by successfully completing tasks. It's survival of the fittest, as you find out who the troublemakers are and who the good guys are to make sure everyone gets along – or not! [Electronic Arts]… Expand"}, {"name": "Blazing Angels 2: Secret Missions of WWII", "details_link": "https://www.metacritic.com/game/playstation-3/blazing-angels-2-secret-missions-of-wwii", "publisher": "Ubisoft", "release_date": "Nov  6 2007", "developers": ["Ubisoft Romania"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/4e84a33d8d52587c7027b0588e1a8fe1-98.jpg", "descriptions": "Blazing Angels 2: Secret Missions shows World War II from a different perspective – that of an elite pilot who is part of a secret team. In the game, the player undertakes some of the most dangerous missions in exotic locations all over the globe. As an elite pilot, the player goes from oneBlazing Angels 2: Secret Missions shows World War II from a different perspective – that of an elite pilot who is part of a secret team. In the game, the player undertakes some of the most dangerous missions in exotic locations all over the globe. As an elite pilot, the player goes from one great adventure to another, while battling the most lethal experimental weapons of the Third Reich. The squad's mission is to prevent the ultimate weapon from being built. To help players in this quest, they have at their disposal an assortment of highly experimental aircraft and weaponry. Secret Missions comes straight out of the history books of World War II's most top secret projects. Fly above hills and mountains, navigate through treacherous mountain passes and dogfight in the clouds with enemies. Take part in large-scale battles through various conditions: darkness, rain, snow, and air turbulence. Secret Missions takes players around the world, from Paris, Rome and Moscow to exotic locations like Rangoon and Cairo and the highest mountain ranges of the Himalayas. Each mission brings its own surprises, twists and unique challenges. Players have access to some of the most advanced and unusual aircraft and weapons of WWII, as well as access to a huge assortment of weapons, including high-velocity cannons and early guided missiles. Multiplayer features free-for-all, co-op and squad-based play, including the brand new Capture the Flag and Epic Battle modes, the latter pitting two teams of players against each other in a large-scale battle with conquerable bases and objectives that can be destroyed in order to gain the upper hand on the opponent. [Ubisoft]… Expand"}, {"name": "NFL Street 3", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-street-3", "publisher": "EA Sports", "release_date": "Nov 14 2006", "developers": ["EA Tiburon"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 70, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/6fa6a3f400325870010d2eccd78b10b3-98.jpg", "descriptions": "With NFL Street 3 you can play your style of football both on the ground and in the air in this newest iteration of the popular NFL Street franchise. Show off your style and boost your score by performing stunning aerial moves, jumping into the air and collecting special items and gameWith NFL Street 3 you can play your style of football both on the ground and in the air in this newest iteration of the popular NFL Street franchise. Show off your style and boost your score by performing stunning aerial moves, jumping into the air and collecting special items and game modifiers that hover above the playing field. You will also have the ability to control your Gamebreaker and pull off new Power moves that are available to both the offense and the defense. [Electronic Arts]… Expand"}, {"name": "Legacy of Kain: Defiance", "details_link": "https://www.metacritic.com/game/pc/legacy-of-kain-defiance", "publisher": "Eidos Interactive", "release_date": "Dec 17 2003", "developers": ["Crystal Dynamics", "Nixxes Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 70, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/bda8259618dd5caefc35310be3959347-98.jpg", "descriptions": "The next chapter in the epic Legacy of Kain series is a cutting-edge action/adventure game featuring more action then ever before. Take control of two powerful and highly evolved vampires: Kain, an all-powerful demigod, and Raziel, a demonic angel of death. Each equipped with a legendaryThe next chapter in the epic Legacy of Kain series is a cutting-edge action/adventure game featuring more action then ever before. Take control of two powerful and highly evolved vampires: Kain, an all-powerful demigod, and Raziel, a demonic angel of death. Each equipped with a legendary sword, Kain & Raziel must battle through a world loaded with conflict and intrigue as they attempt to unravel their destinies and defeat the dark forces that seek to condemn their world to eternal damnation. [Eidos Interactive]… Expand"}, {"name": "Demon Slayer: Kimetsu no Yaiba - The Hinokami Chronicles", "details_link": "https://www.metacritic.com/game/playstation-5/demon-slayer-kimetsu-no-yaiba---the-hinokami-chronicles", "publisher": "Sega", "release_date": "Oct 13 2021", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 70, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/4ac39e8a531c6e66e2a3be77b51800e7-98.jpg", "descriptions": "Players can relive the story of Tanjiro Kamado as depicted in the TV anime Demon Slayer: Kimetsu no Yaiba. Its episodes start from the “Kamado Tanjirou Risshi Arc” of the TV anime, in which Tanjiro joins the Demon Slayer Corps and faces off against various demons, and end at the “Mugen TrainPlayers can relive the story of Tanjiro Kamado as depicted in the TV anime Demon Slayer: Kimetsu no Yaiba. Its episodes start from the “Kamado Tanjirou Risshi Arc” of the TV anime, in which Tanjiro joins the Demon Slayer Corps and faces off against various demons, and end at the “Mugen Train Arc” of the feature film, in which Tanjiro joins the Flame Hashira Kyojuro Rengoku on a mission. Enjoy the battles against the demons from the anime with beautiful graphics and expression.\r Versus Mode\r Form a tag team of two characters from the characters who fought in intense battles in the TV anime Demon Slayer: Kimetsu no Yaiba, including Tanjiro Kamado and Nezuko Kamado, as well as from six characters who appeared in the official anime spin-off Chuukou Ikkan!! Kimetsu Gakuen Monogatari, for a total of 18 characters. Enjoy battles with your ideal tag team, be it a combination of characters who fought alongside each other in the anime, or a dream team that did not.\r Two-player online play is also supported.… Expand"}, {"name": "Dance Dance Revolution SuperNOVA 2", "details_link": "https://www.metacritic.com/game/playstation-2/dance-dance-revolution-supernova-2", "publisher": "Konami", "release_date": "Sep 25 2007", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 70, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/ba75389e05a944bc0ed519744e157bb2-98.jpg", "descriptions": "Dance Dance Revolution SuperNOVA2 is the follow-up to 2006's biggest and best DDR game to date. Dance Dance Revolution SuperNOVA2 delivers a dance party extravaganza with its fun interactive gameplay, incredible song selection and innovative new game modes. Featuers brand new game modes andDance Dance Revolution SuperNOVA2 is the follow-up to 2006's biggest and best DDR game to date. Dance Dance Revolution SuperNOVA2 delivers a dance party extravaganza with its fun interactive gameplay, incredible song selection and innovative new game modes. Featuers brand new game modes and fully adaptable to newbies and pros. Enhanced online support offers 4-player multiplayer. EyeToy supports for PlayStation 2 – use your hands and feet and see yourself on TV! [Konami]… Expand"}, {"name": "No Place for Bravery", "details_link": "https://www.metacritic.com/game/switch/no-place-for-bravery", "publisher": "Ysbryd Games", "release_date": "Sep 22 2022", "developers": ["Glitch", "Glitch Factory"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b04c267b0a5cac4a5e828cc384ec4e65-98.jpg", "descriptions": "Thorn, an old and ambitious warrior, roams a vicious war-torn world in search of his lost daughter. Survive rampant and violent battles in this 2D top-down action RPG, and discover the bone-chilling tale behind Thorn’s odyssey."}, {"name": "Greak: Memories of Azur", "details_link": "https://www.metacritic.com/game/switch/greak-memories-of-azur", "publisher": "Team17", "release_date": "Aug 17 2021", "developers": ["Bromio", "Navegante Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 70, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/cd2699318fdd91cfb3b539bf3d20cb75-98.jpg", "descriptions": "Greak: Memories of Azur is a side scrolling single-player game with hand-drawn animations. You will take the role of three siblings: Greak, Adara and Raydel to guide them through the lands of Azur. Alternate control between them and use their unique abilities to escape from the Urlag invasion."}, {"name": "The Council - Episode 2: Hide and Seek", "details_link": "https://www.metacritic.com/game/pc/the-council---episode-2-hide-and-seek", "publisher": "Focus Home Interactive", "release_date": "May 15 2018", "developers": ["Big Bad Wolf"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/b989387a54d626e34e9c81bd689f55c0-98.jpg", "descriptions": "Louis de Richet is on Lord Mortimer’s island where he is still in search of his mother. Here he has met a collection of the most influential people alive, invited to help reshape the world. His investigation is interrupted by tragic events on the second night in the mansion, meaning LouisLouis de Richet is on Lord Mortimer’s island where he is still in search of his mother. Here he has met a collection of the most influential people alive, invited to help reshape the world. His investigation is interrupted by tragic events on the second night in the mansion, meaning Louis must answer to the enigmatic Lord Mortimer. Meanwhile the Spanish head of state joins the guests and brings news that threatens the stability of all of Europe - Louis must pick a side as factions begin to form.… Expand"}, {"name": "Nitroplus Blasterz: Heroines Infinite Duel", "details_link": "https://www.metacritic.com/game/playstation-4/nitroplus-blasterz-heroines-infinite-duel", "publisher": "XSEED Games", "release_date": "Feb  2 2016", "developers": ["Examu", "Marvelous Inc."], "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/5a65449e1a5002a41ec71c32d645bf47-98.jpg", "descriptions": "Fast-Paced Fighting Action with Easy-to-Learn Gameplay - From the makers of Arcana Heart comes a new fighting game that's as simple as it is chaotic; easy-to-execute combo chains and assist mechanics can get up to six characters onscreen."}, {"name": "Call of Duty: Black Ops II - Apocalypse", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops-ii---apocalypse", "publisher": "Activision", "release_date": "Aug 27 2013", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Arcade"], "meta_score": 70, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/a66ea165adf7825669a0f857da92feb2-98.jpg", "descriptions": "Apocalypse is Treyarch's grand finale to Call of Duty: Black Ops II, with two all-new multiplayer maps, two fully reimagined fan-favorite multiplayer maps from past games, and Origins, an epic Zombie experience."}, {"name": "Fossil Fighters", "details_link": "https://www.metacritic.com/game/ds/fossil-fighters", "publisher": "Nintendo", "release_date": "Aug 10 2009", "developers": ["RED Entertainment"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Trainer"], "meta_score": 70, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/278d9e1f9eeee03e2ded28ffb44f6382-98.jpg", "descriptions": "Fossil Fighters invites players to enter a world in which fearsome creatures are hidden as fossils for players to collect, using the unique touch-screen controls of Nintendo DS. Players can clean, collect and battle their discoveries. The game features more than 100 dinosaur-like creaturesFossil Fighters invites players to enter a world in which fearsome creatures are hidden as fossils for players to collect, using the unique touch-screen controls of Nintendo DS. Players can clean, collect and battle their discoveries. The game features more than 100 dinosaur-like creatures called Vivosaurs, each of which can be revived and deployed in strategic turn-based battles. With fun tactical elements, vast environments to explore and a lighthearted storyline and characters, Fossil Fighters allows players to control and customize a team of Vivosaurs as they battle their way through the mysterious Vivosaur Island. Players can also connect over local wireless with friends to battle customized teams of Vivosaurs or trade their fossils. Using the Nintendo DS stylus and touch screen, players can chip and drill away at each fossil they find. They can even blow into the Nintendo DS microphone to clear away dust. Once a fossil head is cleaned, the Vivosaur can be revived and used in battle. Other fossilized body parts can also be found and cleaned to imbue each Vivosaur with special powers. Players can create custom teams of three Vivosaurs, strategically selecting the best trio for each encounter. [Nintendo]… Expand"}, {"name": "Atomic Heart", "details_link": "https://www.metacritic.com/game/playstation-5/atomic-heart", "publisher": "Mundfish", "release_date": "Feb 21 2023", "developers": ["Mundfish"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/5624c4b4a4035f175192e343420a7759-98.jpg", "descriptions": "In the Soviet Union of the future, in 1955, science reigns supreme. The world is on the verge of the greatest event. You are Agent Major P-3 and you will have to find out what is really lying behind the utopian dream."}, {"name": "LEGO Bricktales", "details_link": "https://www.metacritic.com/game/switch/lego-bricktales", "publisher": "Thunderful", "release_date": "Oct 12 2022", "developers": ["ClockStone Studio"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/4548e613e22226d7c5f494f5c8a8f70a-98.jpg", "descriptions": "Your grandfather, a genius inventor, has called you for help! His beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren't made to bring it up to code. With the help of your powerful little robot buddy,Your grandfather, a genius inventor, has called you for help! His beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren't made to bring it up to code. With the help of your powerful little robot buddy, you can restore it using a mysterious device based on alien technology.\r As a source of power, the device needs happiness crystals, which you can harvest by making people happy and solving their problems. With the aid of a portal, travel to different locations all around the world to help people and collect their happiness crystals. \r\rStrap in for the ultimate building adventure and save your grandfather's amusement park!\r In this puzzle-adventure, use an intuitive brick-by-brick building mechanic to solve puzzles and bring your creations to life! Experience a charming story as you explore beautiful LEGO dioramas and help the people inhabiting them.… Expand"}, {"name": "Sine Mora EX", "details_link": "https://www.metacritic.com/game/switch/sine-mora-ex", "publisher": "Nintendo", "release_date": "Aug  8 2017", "developers": ["Grasshopper Manufacture"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/a734016a3eb17a4d1cbd313a7622479a-98.jpg", "descriptions": "Co-developed by Grasshopper Manufacture and Digital Reality, and published by Microsoft Studios, Sine Mora is a dieselpunk shoot 'em up that provides a unique take on the genre, where time is the ultimate factor. Mixing classic shooter sensibilities with next-gen presentation, Sine Mora is aCo-developed by Grasshopper Manufacture and Digital Reality, and published by Microsoft Studios, Sine Mora is a dieselpunk shoot 'em up that provides a unique take on the genre, where time is the ultimate factor. Mixing classic shooter sensibilities with next-gen presentation, Sine Mora is a gorgeous shmup that appeals to both hardcore and casual gamers alike. Coming exclusively to Xbox LIVE Arcade, Sine Mora features over 60 combinations of planes, characters and time manipulation devices to complete every beautifully-crafted stage with scaling difficulty. All of this is set to an epic score of soaring heights, composed by Akira Yamaoka, acclaimed for his works on Shadows of the Damned and the Silent Hill series.… Expand"}, {"name": "Citizens of Earth", "details_link": "https://www.metacritic.com/game/playstation-4/citizens-of-earth", "publisher": "Atlus", "release_date": "Jan 20 2015", "developers": ["Eden Industries"], "platforms": ["3DS", "PC", "PlayStation Vita", "Wii U", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/d588c2f03f9c98d61eeb2f02efffa520-98.jpg", "descriptions": "In Citizens of Earth, you head home after a too-long election, hoping for a respite. On the contrary, you are accosted with a myriad of oddities. You immediately (following your cup 'o joe) embark on a mission to travel the land, battle mutants, gain allies, overthrow a puppet government,In Citizens of Earth, you head home after a too-long election, hoping for a respite. On the contrary, you are accosted with a myriad of oddities. You immediately (following your cup 'o joe) embark on a mission to travel the land, battle mutants, gain allies, overthrow a puppet government, snorkel for buried treasure, and, with the luxury of time, grab a well-deserved refill on your coffee.… Expand"}, {"name": "Call of Duty: Black Ops - Rezurrection", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops---rezurrection", "publisher": "Activision", "release_date": "Aug 23 2011", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Tactical", "Historic", "Arcade"], "meta_score": 70, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/b5f1b9d2df027ca88dd375879f800ee7-98.jpg", "descriptions": "Rezurrection hurls players into orbit with Moon, the climax of the Call of Duty Zombies saga and the first in the series to drop zombie-slaying into low-G lunar battlegrounds. With new outrageous weapons, high-tech gear, and a bloodthirsty undead menace, Moon is the most challenging andRezurrection hurls players into orbit with Moon, the climax of the Call of Duty Zombies saga and the first in the series to drop zombie-slaying into low-G lunar battlegrounds. With new outrageous weapons, high-tech gear, and a bloodthirsty undead menace, Moon is the most challenging and thrilling Zombies adventure yet.… Expand"}, {"name": "Alice: Madness Returns", "details_link": "https://www.metacritic.com/game/xbox-360/alice-madness-returns", "publisher": "Electronic Arts", "release_date": "Jun 14 2011", "developers": ["Spicy Horse"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Horror", "Horror", "Survival"], "meta_score": 70, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/106efa0f7a63156acb2e35ad9e18823b-98.jpg", "descriptions": "American McGee's Alice returns, with his own brand of creepy supernatural Victoriana."}, {"name": "Batman: The Telltale Series - Episode 1: Realm of Shadows", "details_link": "https://www.metacritic.com/game/playstation-4/batman-the-telltale-series---episode-1-realm-of-shadows", "publisher": "Telltale Games", "release_date": "Aug  2 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/c7254943a747d759e9b97ba393b4374d-98.jpg", "descriptions": "Rendered to look like a living, breathing comic book, Telltale's vision of Batman featureS a cast of talent including Troy Baker in the role of Bruce Wayne, Travis Willingham as Harvey Dent, Erin Yvette as Vicki Vale, Enn Reitel as Alfred Pennyworth, Murphy Guyer as Lieutenant James Gordon,Rendered to look like a living, breathing comic book, Telltale's vision of Batman featureS a cast of talent including Troy Baker in the role of Bruce Wayne, Travis Willingham as Harvey Dent, Erin Yvette as Vicki Vale, Enn Reitel as Alfred Pennyworth, Murphy Guyer as Lieutenant James Gordon, Richard McGonagle as Carmine Falcone, and Laura Bailey as Selina Kyle. [Telltale]… Expand"}, {"name": "Front Mission 1st Remake", "details_link": "https://www.metacritic.com/game/switch/front-mission-1st-remake", "publisher": "Square Enix", "release_date": "Nov 30 2022", "developers": ["Forever Entertainment"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 70, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/3ca776c0aabaa661b9b1a3716eaab1ed-98.jpg", "descriptions": "In the year 2090, the world's conflicts are fought using giant war machines called Wanzers. Huffman Island, the only place where the Oceania Cooperative Union (O.C.U.) and the Unified Continental States (U.C.S.) share a land border is a hotbed of conflict.\r An O.C.U. reconnaissance platoonIn the year 2090, the world's conflicts are fought using giant war machines called Wanzers. Huffman Island, the only place where the Oceania Cooperative Union (O.C.U.) and the Unified Continental States (U.C.S.) share a land border is a hotbed of conflict.\r An O.C.U. reconnaissance platoon led by Captain Royd Clive is assigned to investigate a U.C.S. munitions plant. They are ambushed by U.C.S. Wanzers, triggering a series of events that plunges the whole island into war. Royd's fiancée, Lieutenant Karen Meure, goes missing in action.\r Discharged from the military, Royd sets out to investigate what happened to Karen. His quest leads him closer and closer to the conspiracy behind the incident and the powers that orchestrated it.\r With dozens of characters to meet, its mature story, and non-Manichean protagonists, Front Mission is the classic of a tactical Japanese RPG genre, finally available worldwide.… Expand"}, {"name": "Naruto Shippuden: Ultimate Ninja Storm 3", "details_link": "https://www.metacritic.com/game/xbox-360/naruto-shippuden-ultimate-ninja-storm-3", "publisher": "Namco Bandai Games", "release_date": "Mar  5 2013", "developers": ["CyberConnect2"], "platforms": ["PlayStation 3", "Switch", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/ca7947e4c3384a0e21705fd837ee83de-98.jpg", "descriptions": "NARUTO SHIPPUDEN: Ultimate Ninja STORM 3 promises to feature the most extensive character roster of any game so far in the series, allowing fans to engage with a vast array of their favorite personalities from the NARUTO SHIPPUDEN universe, be they friend or foe.  In story mode, players areNARUTO SHIPPUDEN: Ultimate Ninja STORM 3 promises to feature the most extensive character roster of any game so far in the series, allowing fans to engage with a vast array of their favorite personalities from the NARUTO SHIPPUDEN universe, be they friend or foe.  In story mode, players are thrown into a series of adventures set in the village of Konoha, while the game's fights are punctuated with large scale boss battles, including a confrontation with the gargantuan Nine-Tails.… Expand"}, {"name": "Glyph", "details_link": "https://www.metacritic.com/game/switch/glyph", "publisher": "Bolverk Games", "release_date": "Feb  1 2021", "developers": ["Bolverk Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 70, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/28e0075d6891ae84fc810d702d4d331e-98.jpg", "descriptions": "This 3D Open-World Platformer lets you chill-out or speedrun stunning scenery on your quest to restore the ancient temple city by solving puzzles and beating enemies.\r Be aware: Glyph is easy to learn, but hard to master!\r\n\r\n* 80+ levels\r\n* Many hours of game time\r\n* 100s of rewards\r\n*This 3D Open-World Platformer lets you chill-out or speedrun stunning scenery on your quest to restore the ancient temple city by solving puzzles and beating enemies.\r Be aware: Glyph is easy to learn, but hard to master!\r * 80+ levels\r* Many hours of game time\r* 100s of rewards\r* Perfect your skills and earn cosmetics\r* Explore expansive non-linear levels\r* Avoid traps and defeat enemies… Expand"}, {"name": "1979 Revolution: Black Friday", "details_link": "https://www.metacritic.com/game/playstation-4/1979-revolution-black-friday", "publisher": "Digerati Distribution", "release_date": "Jul 31 2018", "developers": ["iNK Stories"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 70, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/3792aac5378776cdf98c782f8dd4517b-98.jpg", "descriptions": "Based on true stories and historical events, 1979 Revolution: Black Friday is an interactive drama about choice and consequence, chaos and order."}, {"name": "Warriors All-Stars", "details_link": "https://www.metacritic.com/game/playstation-4/warriors-all-stars", "publisher": "Koei Tecmo Games", "release_date": "Aug 29 2017", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/7e642e83588ba70e7560cf57d912d48b-98.jpg", "descriptions": "Warriors All-Stars features a wide selection of characters from various KOEI TECMO Games franchises. Ryu Hayabusa from Ninja Gaiden, Kasumi from DEAD OR ALIVE, William from Nioh, Yukimura Sanada from SAMURAI WARRIORS, Zhao Yun from DYNASTY WARRIORS, Horo and Oka from Toukiden, and SophieWarriors All-Stars features a wide selection of characters from various KOEI TECMO Games franchises. Ryu Hayabusa from Ninja Gaiden, Kasumi from DEAD OR ALIVE, William from Nioh, Yukimura Sanada from SAMURAI WARRIORS, Zhao Yun from DYNASTY WARRIORS, Horo and Oka from Toukiden, and Sophie Neuenmuller from Atelier Sophie: The Alchemist of the Mysterious Book are among the many rivals who will contend for royalty in Warriors All-Stars. Warriors All-Stars begins in a mysterious land brought to the brink of destruction when a magical spring, the source of its power, dries up after its king's passing. Following a legend that calls for the summoning of champions from other realms in times of dire need, the young princess Tamaki performs a ritual that goes horribly wrong when her powers spiral out of control, scattering the heroes across the domain. Emboldened to restore peace to the world, Tamaki must recruit the best and strongest among these visitors to revitalize the spring - and crown the land's savior as its new ruler. … Expand"}, {"name": "The Final Station", "details_link": "https://www.metacritic.com/game/xbox-one/the-final-station", "publisher": "tinyBuild", "release_date": "Sep  2 2016", "developers": ["tinyBuild", "Do My Best Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action Adventure", "General", "Linear"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/e7ed0efafa269237bba8fcb8a6bfaff9-98.jpg", "descriptions": "Travel by train through a dying world. Look after your passengers, keep your train operational, and make sure you can always reach the next station. Make your way through swarms of infected at each station. Explore mysterious and abandoned stations looking for supplies and survivors."}, {"name": "Hydrophobia: Prophecy", "details_link": "https://www.metacritic.com/game/playstation-3/hydrophobia-prophecy", "publisher": "Dark Energy Digital", "release_date": "Nov  1 2011", "developers": ["Dark Energy Digital"], "platforms": ["PC", "PlayStation 3"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 70, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/4f453c5570d3e3ea106dad266d19968d-98.jpg", "descriptions": "This comprehensive reinvention of the title includes upgraded graphics, brand new gameplay mechanics, exclusive new levels, a reworked back story, a dramatic new ending, recast voice acting and much, much more."}, {"name": "Star Wars Galaxies: Episode III Rage of the Wookiees", "details_link": "https://www.metacritic.com/game/pc/star-wars-galaxies-episode-iii-rage-of-the-wookiees", "publisher": "LucasArts", "release_date": "May  5 2005", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 70, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/9/883545cacee0fdd8ee42efa88f0e305f-98.jpg", "descriptions": "Be the first to experience Episode III related content in Star Wars Galaxies, a digital download. Explore Kashyyyk - the home planet of the Wookiees is being added as an entirely new adventure planet and space zone. Adventure through over 100 story-driven quests - Join the Wookiees in theirBe the first to experience Episode III related content in Star Wars Galaxies, a digital download. Explore Kashyyyk - the home planet of the Wookiees is being added as an entirely new adventure planet and space zone. Adventure through over 100 story-driven quests - Join the Wookiees in their fight for freedom against their Imperial-supported Trandoshan slavers or support the Empire in their mission of quelling the spread of the Rebellion! Visit and discover several points of interest and adventure zones including the Wookiee-run tree cities, Trandoshan-controlled slave camps and the safari lands of the affluent Rodians. Pilot new starcraft inspired by Star Wars Episode III: Revenge of the Sith including Anakin’s Jedi Starfighter model. Enhance your character with radical new cybernetic parts that add special abilities and improve your performance in combat. Embark on daring new space mining missions to recover precious raw materials for sale to ground-based crafters. Surviving slews of pirates will provide unprecedented economic opportunities. And experience the all new combat system featuring new weapons, new armor, new effects and an all new user-interface to make combat even more engaging and fun. [LucasArts]… Expand"}, {"name": "Puzzle Agent", "details_link": "https://www.metacritic.com/game/pc/puzzle-agent", "publisher": "Telltale Games", "release_date": "Jun 30 2010", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 70, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/6eb9dc892d671c699c3b46363997fb50-98.jpg", "descriptions": "Take the Professor Layton games, throw in a dash of that Telltale humor, and layer on top the sharp artwork of renowned artist and animator Graham Annable, and you get Puzzle Agent, an episodic puzzle adventure. [GameSpot]"}, {"name": "Marvel's Guardians of the Galaxy - Episode 1: Tangled Up in Blue", "details_link": "https://www.metacritic.com/game/pc/marvels-guardians-of-the-galaxy---episode-1-tangled-up-in-blue", "publisher": "Telltale Games", "release_date": "Apr 18 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 70, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/fc6f68f0f3b117abe5f1a4713f31718a-98.jpg", "descriptions": "Marvel’s Guardians of the Galaxy: The Telltale Series delivers a wholly new story of the universe’s unlikeliest heroes, the rag-tag band of outlaws who go by the names Star-Lord, Gamora, Drax, Rocket, and Groot. In the wake of an epic battle, the Guardians discover an artifact of unspeakableMarvel’s Guardians of the Galaxy: The Telltale Series delivers a wholly new story of the universe’s unlikeliest heroes, the rag-tag band of outlaws who go by the names Star-Lord, Gamora, Drax, Rocket, and Groot. In the wake of an epic battle, the Guardians discover an artifact of unspeakable power.… Expand"}, {"name": "Digimon Survive", "details_link": "https://www.metacritic.com/game/xbox-one/digimon-survive", "publisher": "Bandai Namco Games", "release_date": "Jul 29 2022", "developers": ["Bandai Namco Games", "Hyde", "WitchCraft"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Trainer", "Strategy", "Turn-Based", "Tactics"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/3f8f570f0deec77b223168918902ad2f-98.jpg", "descriptions": "Digimon Survive presents a hybrid visual novel and tactical RPG set in a mysterious world filled with dangerous monsters and deadly battles that will test your ability to survive. After getting lost on a school trip, Takuma Momozuka finds himself transported to a world inhabited by ferociousDigimon Survive presents a hybrid visual novel and tactical RPG set in a mysterious world filled with dangerous monsters and deadly battles that will test your ability to survive. After getting lost on a school trip, Takuma Momozuka finds himself transported to a world inhabited by ferocious foes and new allies. Join Takuma and his friends as they fight their way back home. Craft your story in this thrilling visual novel with turn-based combat.\r Key Features:\r Rich Visual Novel Experience – Unfold a dark tale about friendship and survival that is jam-packed with exciting drama, a unique cast of characters, and potentially grim choices.\r  A Mysterious World – Explore otherworldly areas filled with hidden secrets and Digimon to recruit.\r  The Power Is Yours – Your choices affect gameplay: your bond with other NPCs, your Digimon’s evolution, and the outcome of your adventure.\r  Thrilling & Strategic Gameplay – Persuade your opponents to join your team and evolve them to fight alongside you in battles thrilling turn-based battles.… Expand"}, {"name": "Rocket Knight", "details_link": "https://www.metacritic.com/game/playstation-3/rocket-knight", "publisher": "Konami", "release_date": "May 18 2010", "developers": ["Climax Group", "Climax Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/8d43223fa583f5f739d2a1fc60d502a6-98.jpg", "descriptions": "[Playstation Network]  Sparkster makes his triumphant arrival on next-gen consoles with Rocket Knight, the newest entry in the beloved 2-D side-scrolling rocket action series. Our favorite opossum hero returns home after 15 years to find the kingdom of Zephyrus in shambles. Use your wits and[Playstation Network]  Sparkster makes his triumphant arrival on next-gen consoles with Rocket Knight, the newest entry in the beloved 2-D side-scrolling rocket action series. Our favorite opossum hero returns home after 15 years to find the kingdom of Zephyrus in shambles. Use your wits and Sparkster's trusty rocket pack to dodge and defeat a menacing wolf army threatening the lives of the people.… Expand"}, {"name": "Atelier Annie: Alchemists of Sera Island", "details_link": "https://www.metacritic.com/game/ds/atelier-annie-alchemists-of-sera-island", "publisher": "NIS America", "release_date": "Oct 27 2009", "developers": ["Gust"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/4b72ada4f521c76af8623fbba0b5ca88-98.jpg", "descriptions": "Once upon a time, there was a lazy girl named Annie. To straighten her up, her Grandfather sent her over to an island where a development project was beginning. Annie must participate by using alchemy, which she's never tried before. What kind of life will she face on Sera Island!? [NIS America]"}, {"name": "Greg Hastings' Tournament Paintball Max'd", "details_link": "https://www.metacritic.com/game/playstation-2/greg-hastings-tournament-paintball-maxd", "publisher": "Activision Value", "release_date": "Sep 26 2006", "developers": ["Activision Value"], "platforms": "PlayStation 2", "num_players": "10  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/58975cea551df12d239d2ae73d192068-98.jpg", "descriptions": "Build Your Field – Design and play your own custom fields with the Field Editor. Selecting from three field sizes, thirty-seven different object/bunker types, and ten object textures/skins just gets you started. Now feature yourself in your own MAX’D world by placing your bunkers in anBuild Your Field – Design and play your own custom fields with the Field Editor. Selecting from three field sizes, thirty-seven different object/bunker types, and ten object textures/skins just gets you started. Now feature yourself in your own MAX’D world by placing your bunkers in an almost infinite number of positions and layouts on the field. You’re the MAX’D designer, and the field is your gaming universe. Take the opportunity to angle your bunkers using the Rotate feature, tap the Mirror feature for the quick ability to add bunker symmetry to both sides of the field, and use the Size Editor to bring each bunker to your desired scale. Control Your Team – Mastermind your teammates’ movements at the start of the game with the ground-breaking FPS feature – Breakout Manager. You can direct your AI teammates to break for specific bunkers, select teammates to ether run or shoot, and identify the critical Sweet Spot for your Break Shooters to target the other team and take them out early. Split Screen and Co-Op – Play up to four players on the same PS2. Career Mode Co-Op lets you join with friends to bust up the pros. Or make them bow to your skills first-hand by taking them on head-to-head. [Activision]… Expand"}, {"name": "Tenchu: Shadow Assassins", "details_link": "https://www.metacritic.com/game/wii/tenchu-shadow-assassins", "publisher": "Ubisoft", "release_date": "Feb  5 2009", "developers": ["Acquire"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/d21fe867220c507985cc463d30453376-98.jpg", "descriptions": "Tenchu: Shadow Assassins uses the Wii Remote to fight, dash, jump and kill like a true ninja. Players continue the saga of Rikimaru and Ayame, elite ninjas who must use their lethal skills to keep the peace in feudal Japan. Playing as both stealthy Rikimaru and aggressive and acrobaticTenchu: Shadow Assassins uses the Wii Remote to fight, dash, jump and kill like a true ninja. Players continue the saga of Rikimaru and Ayame, elite ninjas who must use their lethal skills to keep the peace in feudal Japan. Playing as both stealthy Rikimaru and aggressive and acrobatic Ayame, players fight their way through more than 10 missions and 50 side quests and experience the thrilling adventure of being the ultimate ninja. [Ubisoft]… Expand"}, {"name": "Metal Slug 7", "details_link": "https://www.metacritic.com/game/ds/metal-slug-7", "publisher": "Ignition Entertainment", "release_date": "Nov 18 2008", "developers": ["SNK Playmore"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 70, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/14c3fa2194880b8f14fdde7dd585e1d9-98.jpg", "descriptions": "Players will join Marco, Tarma, Eri, Fiolina, Clark and Ralph as they prepare to take on Modern's Forces across 7 new missions that will bring them from Garbage Island to the Fortress of Ruins and beyond. Aside from featuring 7 brand new and fully detailed missions and six playablePlayers will join Marco, Tarma, Eri, Fiolina, Clark and Ralph as they prepare to take on Modern's Forces across 7 new missions that will bring them from Garbage Island to the Fortress of Ruins and beyond. Aside from featuring 7 brand new and fully detailed missions and six playable characters, Metal Slug 7 will also feature a host of new weapons, colossal new bosses, new Slugs to pilot and new gameplay modes for added replay value. [SNK Playmore]… Expand"}, {"name": "Inazuma Eleven 3: Lightning Bolt", "details_link": "https://www.metacritic.com/game/3ds/inazuma-eleven-3-lightning-bolt", "publisher": "Nintendo", "release_date": "Sep 27 2013", "developers": ["Level 5"], "platforms": "3DS", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 70, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/8e3dcf9bf5843fdbca1a22a0418016b6-98.jpg", "descriptions": "Mark Evans, footballing hero, has risen to the top in Japan by winning the Football Frontier Tournament and then saving his country from crisis, but now… he’s about to take on the world.  All of them, though, have only one thing on their mind – getting onto the national side: InazumaMark Evans, footballing hero, has risen to the top in Japan by winning the Football Frontier Tournament and then saving his country from crisis, but now… he’s about to take on the world.  All of them, though, have only one thing on their mind – getting onto the national side: Inazuma National. The Football Frontier International championship is coming up, pitting the best young players from around the world against each other, and Mark and his friends are about to face the challenge of a lifetime. [Nintendo UK]… Expand"}, {"name": "Disney/Pixar Cars", "details_link": "https://www.metacritic.com/game/psp/disneypixar-cars", "publisher": "THQ", "release_date": "Jun  6 2006", "developers": ["Locomotive Games"], "platforms": ["PC", "Xbox 360", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/7c9f49d1ec745e23d552c872ea3e4880-98.jpg", "descriptions": "Race to the finish line as you live all the fun and excitement of the Walt Disney Pictures presentation of a Pixar Animation Studios film, \"Cars.\" Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship. The game is a story-based racingRace to the finish line as you live all the fun and excitement of the Walt Disney Pictures presentation of a Pixar Animation Studios film, \"Cars.\" Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship. The game is a story-based racing adventure game that relives all of the key moments of the movie. It features more than 10 playable characters from the film and an open world environment with more than 50 races. [THQ]… Expand"}, {"name": "Turrican Flashback", "details_link": "https://www.metacritic.com/game/switch/turrican-flashback", "publisher": "ININ Games", "release_date": "Jan 19 2021", "developers": ["Factor 5"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/462f68e65e7cf1e8c4443c6a4019f8fd-98.jpg", "descriptions": "The  carefully selected Turrican Flashback Collection contains 4 of the greatest titles in the history of Turrican in one package: \r\r• Turrican\r• Turrican II: The Final Fight\r\n• Mega Turrican\r\n• Super Turrican\r\n\r\nThe remasters bring brand new elements to the tried and true formularThe  carefully selected Turrican Flashback Collection contains 4 of the greatest titles in the history of Turrican in one package: \r\r• Turrican\r• Turrican II: The Final Fight\r• Mega Turrican\r• Super Turrican\r The remasters bring brand new elements to the tried and true formular offering both old and new fans something unique for this edition:\r A new control scheme\rMaking each Turrican game intuitive and easily accessible for all players. Each button and command correspond to action and allows for even more precise shots and jumps than ever before.\r The new “Rewind” feature\rAllowing for an optional easier challenge as the pitfalls for older game designs can be overcome by trial and error instantly. You wish to come back to the adventure at a later time? The save states are there to let you pick up where you left off.\r Customizable display\rMissing the scanlines and curvatures of retro monitors? With one of the best CRT shaders in the industry you can customize your display like you remember it looking on your nostalgic monitor. You can also opt for the new dynamic pixel perfect display – allowing you to minimize the on-screen icons and focus entirely on the gorgeous in-game graphics!\r And – of course – the music!\rChris Huelsbeck’s legendary scores are on full display. The games have been painstakingly programmed to ensure the highest quality playback of the original audio across the various sound chips Mr. Huelsbeck perfected. Enjoy the 7 minute epica that is “The Final Fight” in Turrican 2 in pristine original quality, or thump your feet to the beat of “Air Combat” in Mega Turrican, each and every track across every game is a bonafide classic!… Expand"}, {"name": "Raji: An Ancient Epic", "details_link": "https://www.metacritic.com/game/pc/raji-an-ancient-epic", "publisher": "Nodding Heads Games", "release_date": "Oct 15 2020", "developers": ["Nodding Heads Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/9e24b367efbcc78c8425be70bf8e9e12-98.jpg", "descriptions": "Raji: An Ancient Epic is an action-adventure game set in ancient India. A young girl named Raji has been chosen by the gods to stand against the demonic invasion of the human realm. Her destiny? To rescue her younger brother and face the demon lord Mahabalasura."}, {"name": "Warriors Orochi 4 Ultimate", "details_link": "https://www.metacritic.com/game/playstation-4/warriors-orochi-4-ultimate", "publisher": "Koei Tecmo Games", "release_date": "Feb 14 2020", "developers": ["Omega Force"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 70, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/b06dc15c1ea0532f158b7788c7817c21-98.jpg", "descriptions": "Transcend the Power of the Gods, Take on Thousands in Battle!New Characters\nStarting with Gaia, new heroes gather from multiple universes to join the fight.\n\nNew Storyline and Sub-scenarios\nThe battle has not ended... A new story and ending pursuing the truth of the world has been added.Transcend the Power of the Gods, Take on Thousands in Battle!New CharactersStarting with Gaia, new heroes gather from multiple universes to join the fight.New Storyline and Sub-scenariosThe battle has not ended... A new story and ending pursuing the truth of the world has been added. In addition, unique sub-scenarios will be available to reinforce the main story.New Mode and Gameplay ExperienceNew features such as Infinity Mode and the Promotion system have been added. The enhanced gameplay allows players to grow their heroes to their ultimate potential!The Ultimate in Musou Exhilaration!Sacred Treasures can now be used by other characters allowing players to create unique and powerful teams, and with the new Musou Switch Combo feature the game will reach ultimate heights in exhilaration.Improved PlayabilityPart of the UI and control settings have been improved along with additional features to make gameplay easier.… Expand"}, {"name": "Killer7", "details_link": "https://www.metacritic.com/game/playstation-2/killer7", "publisher": "Capcom", "release_date": "Jul  7 2005", "developers": ["Grasshopper Manufacture"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 70, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/a0ffcbe75e5e1b2eaeaa62da13bdd79e-98.jpg", "descriptions": "Featuring visual artistry and dark imagery with striking cel-shaded graphics, Killer 7 chronicles the connection between two men whose intertwined paths develop into a compelling tale of revenge and altering personas. Killer 7 propels players into the consciousness of one man and his sevenFeaturing visual artistry and dark imagery with striking cel-shaded graphics, Killer 7 chronicles the connection between two men whose intertwined paths develop into a compelling tale of revenge and altering personas. Killer 7 propels players into the consciousness of one man and his seven different personalities. The player’s challenge is to stop a wave of indiscriminate violence that is plaguing the world. In Killer 7, players take on the role of Harman Smith an unlikely assassin who leads a life as the intermediary link between seven alter egos. Switching between his seven different personalities, Harman employs each character’s abilities to terminate targets he deems \"deserving to die.\" Now a powerful underworld kingpin has unleashed violent creatures called \"Heaven’s Smile.\" These crazed soldiers, affixed with horrific smiles, have started to wreak havoc on city streets destroying anything unlucky enough to cross its path and overtaking the minds of the populace. It is up to the player to interchange Harman’s seven ‘partners’ and utilize the special powers that dwell within them in order to assassinate Kun Lan, the notorious criminal overlord behind all the madness. [Capcom]… Expand"}, {"name": "Vexx", "details_link": "https://www.metacritic.com/game/xbox/vexx", "publisher": "Acclaim", "release_date": "Feb 10 2003", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 70, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/3915413d0ad4fa2235c885cf08cdf803-98.jpg", "descriptions": "Step into the role of Vexx as he seeks vengeance on those who murdered his grandfather and enslaved his people. Equipped with a set of razor-sharp war talons, you'll travel through volcanic islands, desert temples, frozen citadels, and giants' castles to confront the evil Dark Yabu,Step into the role of Vexx as he seeks vengeance on those who murdered his grandfather and enslaved his people. Equipped with a set of razor-sharp war talons, you'll travel through volcanic islands, desert temples, frozen citadels, and giants' castles to confront the evil Dark Yabu, Shadowraith, and their minions. As darkness falls, enemies become more aggressive and the environments become more hostile. It will take all your combat skills and climbing moves to bring peace back to the villagers of Rockhaven.… Expand"}, {"name": "Dr. Muto", "details_link": "https://www.metacritic.com/game/xbox/dr-muto", "publisher": "Midway", "release_date": "Nov 19 2002", "developers": ["Midway"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/de480ab0f6dfe3a72f9de83fa6dd8375-98.jpg", "descriptions": "Dr. Muto is a fully 3D, free-roaming, third-person action adventure game set in a stylized universe full of fiendish puzzles, mind-bending devices, freakish monstrosities, and twisted comedy.  You are Dr. Muto, a maniacal and genius mad scientist whose latest experiment has accidentallyDr. Muto is a fully 3D, free-roaming, third-person action adventure game set in a stylized universe full of fiendish puzzles, mind-bending devices, freakish monstrosities, and twisted comedy.  You are Dr. Muto, a maniacal and genius mad scientist whose latest experiment has accidentally destroyed his own home planet--all except for his laboratory.  The game features a cast of unusual characters including Dr. Muto's sidekick, Janky, and his nemesis, Professor Burnital.  By simply sampling some DNA, the doctor can morph into a spider, mouse, gorilla, or whatever creature he sees fit to become.  Now he must use his fiendish gadgets and morphing ability to steal organic matter from the neighboring planets in order to rebuild his world.… Expand"}, {"name": "NCAA College Football 2K3", "details_link": "https://www.metacritic.com/game/xbox/ncaa-college-football-2k3", "publisher": "Sega", "release_date": "Aug 13 2002", "developers": ["Avalanche Software"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/fea8ad0d4c449f4f29884500f64bb4cc-98.jpg", "descriptions": "Both veteran and rookie players alike will enjoy the dramatic feature improvements of NCAA College Football 2K3. There are new player models, completely redesigned stadiums, and all 25 official BCS bowls are represented. A revamped Legacy Mode allows gamers to recruit key high-school starsBoth veteran and rookie players alike will enjoy the dramatic feature improvements of NCAA College Football 2K3. There are new player models, completely redesigned stadiums, and all 25 official BCS bowls are represented. A revamped Legacy Mode allows gamers to recruit key high-school stars and compare lifetime records against other collegiate programs in the historical rankings system. Go out for the team!… Expand"}, {"name": "Strategic Command: European Theater", "details_link": "https://www.metacritic.com/game/pc/strategic-command-european-theater", "publisher": "Battlefront.com", "release_date": "Jul 16 2002", "developers": ["Fury Software"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "General"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/a91d11a7cf1da46b653a3f1473bd3c24-98.jpg", "descriptions": "As the supreme commander of the Axis or Allied forces, the player shapes the fates of the nations at war during the Second World War in Europe. Political options, research and upgrade of equipment, management of supply and resources and the strategic employment of one's armed forces are someAs the supreme commander of the Axis or Allied forces, the player shapes the fates of the nations at war during the Second World War in Europe. Political options, research and upgrade of equipment, management of supply and resources and the strategic employment of one's armed forces are some of the keys to success. With limited phase restrictions and wide open turns you are in complete control to try many different approaches and entertain just as many possible outcomes. The future of Europe and perhaps ultimate glory is in your hands. [Battlefront.com]… Expand"}, {"name": "Grandia II", "details_link": "https://www.metacritic.com/game/pc/grandia-ii", "publisher": "Ubisoft", "release_date": "Mar 10 2002", "developers": ["Game Arts"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 70, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/0f8e146fd13fb3b92707f5e25a569e6e-98.jpg", "descriptions": "Each shall rise to face their destiny. Beautiful 3D landscapes and environments and over 1000 characters to interact with. Easy-to-use interface catering to newcomers and hardcore RPG fans alike. [Ubi Soft]"}, {"name": "Columns Crown", "details_link": "https://www.metacritic.com/game/game-boy-advance/columns-crown", "publisher": "THQ", "release_date": "Feb  4 2002", "developers": ["Wow Entertainment"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 70, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/5e39fe810258e57c343d8a9611315ed3-98.jpg", "descriptions": "Princess Dazzle has searched all over for the missing Magic Gems that fill in the Columns Crown. You must help her recover them from a band of Forest Thieves by beating every puzzle to unlock the hidden Gems! Can you collect them all and complete the crown? Frantic multi-player action fullPrincess Dazzle has searched all over for the missing Magic Gems that fill in the Columns Crown. You must help her recover them from a band of Forest Thieves by beating every puzzle to unlock the hidden Gems! Can you collect them all and complete the crown? Frantic multi-player action full of devastating special moves. Collect Magic Gems to unleash spectacular elemental attacks. New Survival, Versus, and Flash Columns modes.… Expand"}, {"name": "Project IGI: I'm Going In", "details_link": "https://www.metacritic.com/game/pc/project-igi-im-going-in", "publisher": "Eidos Interactive", "release_date": "Dec 15 2000", "developers": ["Innerloop"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 70, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/20f9e9beae4ceeffddc24d1f636b808c-98.jpg", "descriptions": "Pursue and defeat a homicidal ex-Russian Colonel before he turns Europe into a nuclear wasteland in Project IGI. This first-person shooter emphasizes stealth and guile instead of massive firepower."}, {"name": "F1 Championship Season 2000", "details_link": "https://www.metacritic.com/game/pc/f1-championship-season-2000", "publisher": "EA Sports", "release_date": "Nov 30 2000", "developers": ["Image Space Incorporated"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-8 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 70, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/42f6e85565f8e1a219f922f47355b42a-98.jpg", "descriptions": "It enhances a number of the original game's features, adds a handful of new ones, and, ultimately, it will undoubtedly please racing enthusiasts and interested beginners alike."}, {"name": "Mario Golf: Super Rush", "details_link": "https://www.metacritic.com/game/switch/mario-golf-super-rush", "publisher": "Nintendo", "release_date": "Jun 25 2021", "developers": ["Nintendo", "Camelot Software Planning"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 70, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/f4a8be4b3e14d69a5b6a0e0694f6996c-98.jpg", "descriptions": "Tee off with family and friends in the biggest Mario Golf game yet. Hit the green with up to four players locally* or online** and golf with familiar Mushroom Kingdom characters. Modes range from Standard Golf to the energetic Speed Golf and an RPG-like golf adventure in story mode.Tee off with family and friends in the biggest Mario Golf game yet. Hit the green with up to four players locally* or online** and golf with familiar Mushroom Kingdom characters. Modes range from Standard Golf to the energetic Speed Golf and an RPG-like golf adventure in story mode. Intuitive motion or button controls, a shot gauge that adapts to the curve of the course, and other new features make it easy for both new players and seasoned pros to drive and putt with power.\r Swing simultaneously and make a break for the ball in Speed Golf\rTee off at the same time with up to three other players* and race through the course to get your ball in first. Outpace and interrupt your opponents with dashes and special shots. Luigi, for example, can freeze the green and King Bob-omb can pelt the course with bombs.\r Rise through the ranks of golf training in story mode\rEnroll your Mii™ character in golf training in a prestigious country club and go from rookie to pro! You’ll face off against your Mushroom Kingdom classmates and earn experience points. Level up to improve your character’s stats like power, movement, and spin. You can bring your character (and their customized stats) into other modes, too!\r… Expand"}, {"name": "Dragon Ball: Origins 2", "details_link": "https://www.metacritic.com/game/ds/dragon-ball-origins-2", "publisher": "Namco Bandai Games", "release_date": "Jun 22 2010", "developers": ["Game Republic"], "platforms": "DS", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/079dd0b21b5ce90f01ad4c2c0be9842a-98.jpg", "descriptions": "In Dragon Ball: Origins 2, players battle through the Red Ribbon Army saga covering Goku’s first encounters with the nefarious Red Ribbon Army up to the resurrection of Upa’s father, a member of the native tribe who serve as the guardians of the mystical Korin Tower. The new action-adventureIn Dragon Ball: Origins 2, players battle through the Red Ribbon Army saga covering Goku’s first encounters with the nefarious Red Ribbon Army up to the resurrection of Upa’s father, a member of the native tribe who serve as the guardians of the mystical Korin Tower. The new action-adventure game includes an array of features including the ability to play as different characters along the way and the option to team up with a friend for co-op multiplayer challenges. [Namco Bandai Games]… Expand"}, {"name": "Taiko no Tatsujin: Rhythmic Adventure Pack", "details_link": "https://www.metacritic.com/game/switch/taiko-no-tatsujin-rhythmic-adventure-pack", "publisher": "Bandai Namco Games", "release_date": "Dec  3 2020", "developers": ["Bandai Namco Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 70, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/55ae675f77ac140268452d1391417552-98.jpg", "descriptions": "Taiko no Tatsujin RPG?! Join Don-chan in two exciting RPG adventures!\r From the past to the future, Don-chan sets out on a great adventure that will transcend time and space and save the world from mysterious occurrences around the world in \"Taiko no Tatsujin: Rhythmic Adventure Pack\".Taiko no Tatsujin RPG?! Join Don-chan in two exciting RPG adventures!\r From the past to the future, Don-chan sets out on a great adventure that will transcend time and space and save the world from mysterious occurrences around the world in \"Taiko no Tatsujin: Rhythmic Adventure Pack\".\r ■Enjoy a relaxing adventure through the world where you control Don freely in Story Mode!\r Take care of foes you encounter in Taiko Battles!\r Drum on the Taiko well to attack! Mess it up and you'll be attacked!\r Compose a team of your favorite characters to take on even stronger enemies!\r ■In \"Rhythmic Adventure 1\" you'll serendipitously meet Tocky who has the important job of protecting all of history.\r He tells you his friend Ticky has been abducted by someone named Professor Timedyne.\r This wily professor is trying to use Ticky to dismantle history!\r Travel to all sorts of ages throughout history and do away with the bad guys!… Expand"}, {"name": "Soul Hackers 2", "details_link": "https://www.metacritic.com/game/pc/soul-hackers-2", "publisher": "Sega", "release_date": "Aug 26 2022", "developers": ["Artdink", "Atlus"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 70, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/ef49b9e26e69e1b9c47dd7f78d3fc25d-98.jpg", "descriptions": "The story takes place in the mid-21st century, a near future not too far from the present.Submissive to the \"Demon\" with super powers, a survivor living under society, the Devil Summoner. He secretly guards society without anyone knowing.\n\nProduced with high technology, the \"Aion\" thatThe story takes place in the mid-21st century, a near future not too far from the present.Submissive to the \"Demon\" with super powers, a survivor living under society, the Devil Summoner. He secretly guards society without anyone knowing.Produced with high technology, the \"Aion\" that surpassed the human brain one day found a sign of the world's demise.Aion's Ringo and Figg came to the human world to stop the world from perishing. Their purpose is to protect the key figures who can reverse the fate of their demise, but the key figures have all been killed.Ringo then implemented the special ability \"Soul Hack\" possessed by Aion to revive them. They were given a \"second chance\", and the demon summoners joined Ringo and Figg to stop the world's demise.As a result, will they be able to reverse their fate...?… Expand"}, {"name": "Dynasty Warriors: Godseekers", "details_link": "https://www.metacritic.com/game/playstation-4/dynasty-warriors-godseekers", "publisher": "Koei Tecmo Games", "release_date": "Jan 31 2017", "developers": ["Omega Force"], "platforms": ["PlayStation Vita", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/037e1ca2dd65367fcacfef0c3822044b-98.jpg", "descriptions": "The final days of the Later Han Period in China...\rPolitical strife has led to unrest and the rise of rebelling peasants, known as the \"Yellow Turbans\", has brought ceaseless conflict to the land. Among this chaos, in the country of Changshan lives a young warrior known as Zhao Yun, who hasThe final days of the Later Han Period in China...\rPolitical strife has led to unrest and the rise of rebelling peasants, known as the \"Yellow Turbans\", has brought ceaseless conflict to the land. Among this chaos, in the country of Changshan lives a young warrior known as Zhao Yun, who has a lore-master friend named Lei Bin.\rOne day, Lei Bin hears a rumor about a \"buried person\" discovered in a \"mysterious shrine\" by the remnants of the Yellow Turbans, and he convinces Zhao Yun to investigate it. While Zhao Yun is more interested in the danger the rebels could pose, Lei Bin can only think of the \"great historical discovery\" they might make. However, what they discover inside the cave is a young woman who appears to be frozen inside a column of ice.… Expand"}, {"name": "Game of Thrones: Episode Six - The Ice Dragon", "details_link": "https://www.metacritic.com/game/pc/game-of-thrones-episode-six---the-ice-dragon", "publisher": "Telltale Games", "release_date": "Nov 17 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Adventure", "Point-and-Click"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/be58380f4a41bbfb6dc65370ab0509eb-98.jpg", "descriptions": "Your chronicle is about to come to a conclusion. With House Whitehill tightening its grip on Ironrath at the behest of Ramsay Bolton, the remaining Forresters need to give their all to save the family, whether through diplomacy, subterfuge, or violent force. In the frozen wilds beyond TheYour chronicle is about to come to a conclusion. With House Whitehill tightening its grip on Ironrath at the behest of Ramsay Bolton, the remaining Forresters need to give their all to save the family, whether through diplomacy, subterfuge, or violent force. In the frozen wilds beyond The Wall, Gared learns the secrets of the mysterious North Grove, and Mira discovers that political games in a King's Landing controlled by Cersei Lannister often involve the highest stakes of all. What is the fate of House Forrester? When you play the Game of Thrones, you win or you die. Your choices, your story: you decide. [Telltale Games]… Expand"}, {"name": "The Gunk", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-gunk", "publisher": "Thunderful", "release_date": "Dec 16 2021", "developers": ["Image & Form"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "", "genres": ["Action", "Platformer", "3D"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/9649513feae4fbcfade151166023c902-98.jpg", "descriptions": "The Gunk is a game about two friends who run a small scavenging outfit together, and who travel from one space rock to another in search for resources they can harvest and sell. One day they land on a planet that looks dead from a distance, turns out to be unlike any other they’ve set footThe Gunk is a game about two friends who run a small scavenging outfit together, and who travel from one space rock to another in search for resources they can harvest and sell. One day they land on a planet that looks dead from a distance, turns out to be unlike any other they’ve set foot on. A slimy parasite­ — or gunk — covers vast areas and seems to corrupt the otherwise vibrant nature and wildlife. It’s clear that they must fight this gunk to understand what’s happened and to save the dying planet. But this also creates a rift between them; on one hand, the planet will die if we don’t rid the planet of the gunk. On the other, we’ve got problems of our own and surely this isn’t our fight to begin with. So, who cares… right? Do we have to? [Thunderful Group]… Expand"}, {"name": "Starpoint Gemini 2", "details_link": "https://www.metacritic.com/game/pc/starpoint-gemini-2", "publisher": "Iceberg Interactive", "release_date": "Sep  6 2013", "developers": ["Little Green Men"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 70, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/9cf694f1ff5c9b4974e5b65f96fa75aa-98.jpg", "descriptions": "Starpoint Gemini 2, like its predecessor Starpoint Gemini (2011), is an open-world 3D space simulation that combines powerful RPG mechanics with the frenzy of space combat, creating a particular blend that sets itself apart from all other games in the genre."}, {"name": "SingStar Pop Vol. 2", "details_link": "https://www.metacritic.com/game/playstation-2/singstar-pop-vol-2", "publisher": "SCEA", "release_date": "Sep 23 2008", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/23afadc8fd70b7ea180710a7ec0a0db9-98.jpg", "descriptions": "SingStar Pop Vol.2 for the PS2 represents a wide variety of songs and videos from some of the hottest pop artists on the planet. Featuring hits from artists such as Fall Out Boy, Fergie, Rihanna, and more, Pop Vol.2 really brings the experience of being a pop star straight to your TV. SoSingStar Pop Vol.2 for the PS2 represents a wide variety of songs and videos from some of the hottest pop artists on the planet. Featuring hits from artists such as Fall Out Boy, Fergie, Rihanna, and more, Pop Vol.2 really brings the experience of being a pop star straight to your TV. So sing, compete, and keep the party going. [SCEA]… Expand"}, {"name": "Outbuddies DX", "details_link": "https://www.metacritic.com/game/switch/outbuddies-dx", "publisher": "Headup Games", "release_date": "Jun  5 2020", "developers": ["Julian Laufer"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/1a4f078064d73312d8bd0b663ba9c9e8-98.jpg", "descriptions": "Enter Bahlam, a sunken city of the Old Gods, located deep in the South Atlantic Ocean. Following a shipwreck, adventurer and maritime archaeologist Nikolay Bernstein regains consciousness 36.000 feet under the sea. He's severely wounded and unwillingly connected to a supernatural Buddy-unit.Enter Bahlam, a sunken city of the Old Gods, located deep in the South Atlantic Ocean. Following a shipwreck, adventurer and maritime archaeologist Nikolay Bernstein regains consciousness 36.000 feet under the sea. He's severely wounded and unwillingly connected to a supernatural Buddy-unit. Searching for answers about his displacement our main protagonist digs deep into the lost undercity, gradually realizing an ominous presence hollowing in its shadowed caverns.… Expand"}, {"name": "140", "details_link": "https://www.metacritic.com/game/switch/140", "publisher": "Jeppe Carlsen", "release_date": "Jan  9 2020", "developers": ["Jeppe Carlsen"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/2c3636ca5ca2db50a5e31a0ffcd3d158-98.jpg", "descriptions": "At its heart 140 is an old-school platformer set in a world of abstract colorful graphics, but it has a musical twist. You’ll need to overcome obstacles that are controlled by an energetic, yet melancholic electronic soundtrack - meaning you’ll need a heightened sense of rhythm to sync upAt its heart 140 is an old-school platformer set in a world of abstract colorful graphics, but it has a musical twist. You’ll need to overcome obstacles that are controlled by an energetic, yet melancholic electronic soundtrack - meaning you’ll need a heightened sense of rhythm to sync up your every move and jump to the music.… Expand"}, {"name": "Vandal Hearts: Flames of Judgment", "details_link": "https://www.metacritic.com/game/playstation-3/vandal-hearts-flames-of-judgment", "publisher": "Konami", "release_date": "Jan 21 2010", "developers": ["Hijinx Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "Strategy", "Turn-Based", "Console-style RPG", "Console-style RPG", "Tactics"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/3b35386438b545e64b1e1f1466be4fbf-98.jpg", "descriptions": "[Playstation Network]  On the continent of Sostegaria, two rival kingdoms stand on the brink of war. Caught in the tide of battle is young orphan Tobias Martin. Driven to defend his homeland, and to avenge those already fallen, Tobias enlists with his comrades to fight for peace. But all is[Playstation Network]  On the continent of Sostegaria, two rival kingdoms stand on the brink of war. Caught in the tide of battle is young orphan Tobias Martin. Driven to defend his homeland, and to avenge those already fallen, Tobias enlists with his comrades to fight for peace. But all is not what it seems, and they face a threat far deadlier—and closer—than they know. [Konami]… Expand"}, {"name": "Vampyr", "details_link": "https://www.metacritic.com/game/playstation-4/vampyr", "publisher": "Focus Home Interactive", "release_date": "Jun  5 2018", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/cae5836a3e279f25851a1d419dc24ac8-98.jpg", "descriptions": "Vampyr is set in early 20th century Britain as the country is gripped by the lethal Spanish flu and the streets of London are crippled by disease, violence and fear. In a disorganized and ghostly city, those foolish, desperate, or unlucky enough to walk the streets lay prey to Britain’s mostVampyr is set in early 20th century Britain as the country is gripped by the lethal Spanish flu and the streets of London are crippled by disease, violence and fear. In a disorganized and ghostly city, those foolish, desperate, or unlucky enough to walk the streets lay prey to Britain’s most elusive predators: the vampires. Emerging from the chaos, a tormented figure awakens. You are Jonathan E. Reid, a high-ranking military surgeon transformed into a vampire upon his return home from the frontline.  Explore the darkly atmospheric streets of early 20th century London, and interact with a multitude of characters with their own identities and importance. Accept and fulfill the missions they give you, but don’t forget: sooner or later, you will have to feed, and make a difficult choice... who will be your prey? Absolutely all characters in the game are potential victims of your vampiric lust. Carefully study the habits of your next victim, his or her relationships with other characters, and set up your strategy to feed, unnoticed: seduce them, change their daily habits, or make sure they end up alone in a dark street…  Be careful who you choose to hunt, as they will be gone forever, and their death will impact in a meaningful way the world that surrounds you. Feeding on human blood will not just keep you 'alive;' it will also unlock new vampiric powers to use. [Focus Home]… Expand"}, {"name": "Tom Clancy's HAWX 2", "details_link": "https://www.metacritic.com/game/playstation-3/tom-clancys-hawx-2", "publisher": "Ubisoft", "release_date": "Sep  7 2010", "developers": ["Ubisoft"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 70, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/c47c2882bbff58c61e1f5c6bd5458076-98.jpg", "descriptions": "Tom Clancy’s H.A.W.X. 2 plunges fans into an explosive environment where they can become elite aerial soldiers in control of the world's most technologically advanced aircraft. The game will appeal to a wide array of gamers as players will have the chance to control exceptional pilotsTom Clancy’s H.A.W.X. 2 plunges fans into an explosive environment where they can become elite aerial soldiers in control of the world's most technologically advanced aircraft. The game will appeal to a wide array of gamers as players will have the chance to control exceptional pilots trained to use cutting edge technology in amazing aerial warfare missions. … Expand"}, {"name": "Falcon Age", "details_link": "https://www.metacritic.com/game/playstation-4/falcon-age", "publisher": "Outerloop Games", "release_date": "Apr  9 2019", "developers": ["Outerloop Games"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/ebd0018a416ce79cd9b36c7efaf1d13e-98.jpg", "descriptions": "Falcon Age is a first-person, single-player action adventure. As Ara, learn to hunt, gather, and fight to reclaim her cultural legacy in the lost art of falcon hunting against a force of automated colonizers. Bond with a baby falcon and go on an adventure."}, {"name": "Storyteller", "details_link": "https://www.metacritic.com/game/pc/storyteller", "publisher": "Annapurna Interactive", "release_date": "Mar 23 2023", "developers": ["Daniel Benmergui"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "Puzzle", "Puzzle", "General"], "meta_score": 70, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/d138bdc07daa8c7b076c421fe2c7b950-98.jpg", "descriptions": "Storyteller is a game about building stories. Start with a title, settings and characters and create a story that fits the story’s description. Play with stories of love, intrigue, crime, monsters, betrayal, and more."}, {"name": "SpellForce III Reforced", "details_link": "https://www.metacritic.com/game/playstation-5/spellforce-iii-reforced", "publisher": "THQ Nordic", "release_date": "Jun  7 2022", "developers": ["Grimlore Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 6 ", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/9b76b8e8b4abe9ac2a46faabfe07a909-98.jpg", "descriptions": "SpellForce III Reforced is a unique mix of an epic RPG storyline blended with accessible real-time strategy elements, designed to offer a riveting console experience to fans and newcomers alike. It is the year 518. The rebellion of the renegade mages, known as the Mage Wars, has been quashedSpellForce III Reforced is a unique mix of an epic RPG storyline blended with accessible real-time strategy elements, designed to offer a riveting console experience to fans and newcomers alike. It is the year 518. The rebellion of the renegade mages, known as the Mage Wars, has been quashed by the Crown. However, it was a Pyrrhic victory: Whole regions have fallen into anarchy, refugees roam the lands in search of shelter, and a mysterious, deadly plague called the “Bloodburn” has arisen and is spreading rapidly. In times like these people cling to any sign of hope they can find. The Purity of Light, led by a charismatic man called Rondar Lacaine, claims that mages are the source of all misfortune – and that only the second coming of Aonir, the father of all gods, will return Eo to its former splendor. The story takes place before the acclaimed SpellForce: The Order of Dawn.… Expand"}, {"name": "Garfield's Nightmare", "details_link": "https://www.metacritic.com/game/ds/garfields-nightmare", "publisher": "The Game Factory", "release_date": "Sep  4 2007", "developers": ["Shin'en"], "platforms": "DS", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 70, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/76988aaf29461cf28f83ed9b557f1554-98.jpg", "descriptions": "Garfield came up with the crazy idea to combine breakfast, lunch and dinner to have more time for his other activities. He crammed a couple of pizzas, some lasagnes and two bags of jelly donuts into one big sandwich. It seems this may have been a little too much… As he slowly falling asleepGarfield came up with the crazy idea to combine breakfast, lunch and dinner to have more time for his other activities. He crammed a couple of pizzas, some lasagnes and two bags of jelly donuts into one big sandwich. It seems this may have been a little too much… As he slowly falling asleep and his nightmare begins...Garfield suddenly wakes up in a haunted castle – this is not the real world but a strange dream world populated by the monsters of Garfield's sub-conscious. Although Garfield loves sleeping, this horrible dream has to end as soon as possible! Unfortunately Garfield smashed his little alarm clock in the real world and now his only chance at waking up soon depends on his ability to find the shattered pieces and put them back together. Help him to wake him up from this frightful nightmare! Garfield's nightmare is a traditional 3D platform-puzzle game and utilizes the DS hardware graphic capacity. Players will get a chance to live one of the lives of their favorite feline in an astonishing, mind-blowing environment filled with ghosts, spiders, glaciers and fireballs. Each level will lead Garfield to engage in a final battle that will transform his nightmare into a dream. Bosses will need to be terminated during these timeless fights, gradually enhancing the difficulty level. [The Game Factory]… Expand"}, {"name": "Lips: Number One Hits", "details_link": "https://www.metacritic.com/game/xbox-360/lips-number-one-hits", "publisher": "Microsoft Game Studios", "release_date": "Oct 20 2009", "developers": ["iNiS"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 70, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/9135684473b6f64e27627861b9375518-98.jpg", "descriptions": "Wait no longer to rock out to your favorite number one songs. The latest themed installment in the Lips franchise, \"Lips: Number One Hits\" lets you sing along to hits that have reached the top spot on the world’s music charts. The title contains 40 top songs from artists like Rihanna, KanyeWait no longer to rock out to your favorite number one songs. The latest themed installment in the Lips franchise, \"Lips: Number One Hits\" lets you sing along to hits that have reached the top spot on the world’s music charts. The title contains 40 top songs from artists like Rihanna, Kanye West, Coldplay, Black Eyed Peas, MC Hammer, The Beach Boys and many more. [Microsoft]… Expand"}, {"name": "MotoGP 09/10", "details_link": "https://www.metacritic.com/game/playstation-3/motogp-0910", "publisher": "Capcom", "release_date": "Mar 23 2010", "developers": ["Monumental Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "12  Online", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 70, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/3678b2591944e7e31c3edcec44ad8f62-98.jpg", "descriptions": "Team Career Mode – Create and manage your team in an in-depth career mode. Hire staff to help research technology and promote your team. Decisions off the track affect performance on track and vice-versa. Reward system is heavily integrated keeping the user entertained, involved, andTeam Career Mode – Create and manage your team in an in-depth career mode. Hire staff to help research technology and promote your team. Decisions off the track affect performance on track and vice-versa. Reward system is heavily integrated keeping the user entertained, involved, and addicted. Rider Reputation – is the new mechanic which will determine the events, teams and manufacturers that will be available to your team. Rack up your reputation utilizing skill and style. Race your way. Classes – Compete and level-up as you work your way through 125cc, 250cc and 800cc true GP classes. Arcade Mode – This is an all new race mode introduced to MotoGP that drops you on the tarmac and pushes you to complete different race challenges before time runs out. Extensive free content – For the first time ever, Race the Season as it unfolds with free extensive downloadable content for the 2010 season, including all new bike classes, new tracks and all the teams and stats from 2010. 20 Person Online Gameplay – Race online with in a fully fleshed out lobby system or compete locally in split-screen. Accessible Handling – Handling mechanics heavily tuned for players of all levels to create an enjoyable racing experience. [Capcom]… Expand"}, {"name": "Ultimate Mortal Kombat 3", "details_link": "https://www.metacritic.com/game/xbox-360/ultimate-mortal-kombat-3", "publisher": "Midway", "release_date": "Oct 22 2006", "developers": ["Digital Eclipse"], "platforms": ["iPhone/iPad", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/d5b09011775755a02f3b8a41a00f83e0-98.jpg", "descriptions": "[Xbox Live Arcade]  Ultimate Mortal Kombat 3 on Xbox Live Arcade stays faithful to the arcade version by allowing players to choose from 22 fighters (including additional secret fighters), each of which has their own good or evil motives and a common goal – the destruction of Shao Kahn.[Xbox Live Arcade]  Ultimate Mortal Kombat 3 on Xbox Live Arcade stays faithful to the arcade version by allowing players to choose from 22 fighters (including additional secret fighters), each of which has their own good or evil motives and a common goal – the destruction of Shao Kahn. Included in the XLA version of Ultimate Mortal Kombat 3 is the classic \"2 on 2 kombat mode,\" as well as a variety of multiplayer modes including a new Challenger Versus Mode which allows up to 4 players to play in a \"winner-stays-on\" style tournament. The game is available worldwide for 800 Microsoft Points. A large variety of environments to fight in including Scorpion's Lair, Jade's Desert, Kahn's Kave, River Kombat, Noob's Dorfen and more. Detailed Leaderboards: Captures the player's win and losses both for all time and for the current week. Challenger Versus Mode: A new multiplayer mode which allows up to 4 players to play in a \"winner-stays-on\" style tournament. Statistics are recorded to allow for maximum bragging rights. 12 achievements: Ultimate Mortal Kombat 3 achievements offer rewards for both the novice and expert players. [Midway]… Expand"}, {"name": "The Whispered World", "details_link": "https://www.metacritic.com/game/pc/the-whispered-world", "publisher": "Viva Media", "release_date": "Apr 26 2010", "developers": ["Daedalic Entertainment"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 70, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/0d09418b04d782c56a39b8c78d631640-98.jpg", "descriptions": "This point & click adventure follows a modern fairy tale set in a fantasy world with hand-painted backgrounds."}]