[
  {
    "name": "Space Interceptor: Project Freedom",
    "details_link": "https://www.metacritic.com/game/pc/space-interceptor-project-freedom",
    "publisher": "Merscom LLC",
    "release_date": "Nov  9 2004",
    "developers": [
      "City Interactive"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Sci-Fi",
      "Space",
      "Large Spaceship",
      "Large Spaceship",
      "Combat",
      "Civilian"
    ],
    "meta_score": 71,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/8/a191c4c3a1764fb421bd7b7a482525d1-98.jpg",
    "descriptions": "Challenging ? but not too complex ? gameplay and high caliber effects are accessible to all gamers yet engaging enough for even the most experienced players. Blaze through enemy fleets and turrets around massive spaceships, tumbling asteroid fields and snaking planetside canyons. Shadows andChallenging ? but not too complex ? gameplay and high caliber effects are accessible to all gamers yet engaging enough for even the most experienced players. Blaze through enemy fleets and turrets around massive spaceships, tumbling asteroid fields and snaking planetside canyons. Shadows and lights dance through the galaxy in real-time as your ship darts between guns, missiles and explosions, all of which create their own light source. Your wingmen take care of themselves and will actually assist you in missions, requiring no input. The weapons system -- with Ship-to-Ship missiles, Ship-to-Ground missiles, photon torpedoes, and a plasma glob launcher in addition to the primary lasers, all on the ship simultaneously ? is enough to satisfy any gun nut. Particularly entertaining is how every explosion in the game blows up magnificently, with columns of light racing into the sky as energy pierces through spectrums. [Merscom]… Expand"
  },
  {
    "name": "Max & the Magic Marker",
    "details_link": "https://www.metacritic.com/game/pc/max-the-magic-marker",
    "publisher": "The Games Company",
    "release_date": "Feb  8 2010",
    "developers": [
      "Press Play"
    ],
    "platforms": [
      "iPhone/iPad",
      "iPhone/iPad",
      "PlayStation 3",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/2/76a114cc002a428c671810263f7c5e70-98.jpg",
    "descriptions": "In the game Max has a magic marker, that makes it possible for him to draw anything he wants – and it becomes real! Unfortunately the monster he drew also became real – so he's got to find and catch it before it causes too much trouble. [Press Play]"
  },
  {
    "name": "Nintendogs + Cats: Golden Retriever & New Friends",
    "details_link": "https://www.metacritic.com/game/3ds/nintendogs-+-cats-golden-retriever-new-friends",
    "publisher": "Nintendo",
    "release_date": "Mar 27 2011",
    "developers": [
      "Nintendo"
    ],
    "platforms": "3DS",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "Virtual Life",
      "Virtual Life",
      "Virtual",
      "Pet"
    ],
    "meta_score": 71,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/4/916cc2a31cac2e8c00dda09f0156a6eb-98.jpg",
    "descriptions": "Interact with your virtual puppies and cats in 3D."
  },
  {
    "name": "Blackwood Crossing",
    "details_link": "https://www.metacritic.com/game/playstation-4/blackwood-crossing",
    "publisher": "PaperSeven",
    "release_date": "Apr  4 2017",
    "developers": [
      "PaperSeven"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/2/7874d8be18b41778da1d0e881d870afe-98.jpg",
    "descriptions": "Blackwood Crossing is a single-player, first person narrative game. An intriguing tale exploring the relationship of Scarlett and Finn, two siblings who are growing apart. When their paths cross with a ghostly figure, an ordinary train ride evolves into a haunting adventure of love, death and magic."
  },
  {
    "name": "The Chronicles of Narnia: The Lion, The Witch and The Wardrobe",
    "details_link": "https://www.metacritic.com/game/pc/the-chronicles-of-narnia-the-lion-the-witch-and-the-wardrobe",
    "publisher": "Buena Vista Games",
    "release_date": "Nov 14 2005",
    "developers": [
      "Traveller's Tales"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 71,
    "users_score": 5.9,
    "image": "https://static.metacritic.com/images/products/games/6/2e3d6769b8b3c9e21d40d5e425414ef9-98.jpg",
    "descriptions": "The Chronicles of Narnia: The Lion, The Witch and The Wardrobe is an action adventure based on the Disney and Walden Media film capturing the book series from author C.S. Lewis. Players enter the world of Narnia, a land frozen in eternal winter by the evil powers of the malevolent and evilThe Chronicles of Narnia: The Lion, The Witch and The Wardrobe is an action adventure based on the Disney and Walden Media film capturing the book series from author C.S. Lewis. Players enter the world of Narnia, a land frozen in eternal winter by the evil powers of the malevolent and evil White Witch. In order to end this frigid captivity and free his people, the mighty lion Aslan, true ruler of Narnia, invokes an ancient prophecy. It will become the destiny of four young siblings from our world: Peter, Susan, Edmund and Lucy Pevensie to work together and use their unique combat skills, weaponry and abilities to defeat the Witch and her armies and save Narnia. These four unlikely heroes must battle the evil forces of the White Witch by waging war against a vast variety of creatures, including Centaurs, Minotaurs, Minoboars, Cyclops, Werewolves, Wraiths, Ankleslicers, Wolves, Satyrs, Boggles and more. Battle the evil forces of the White Witch by waging war against a huge variety of creatures, including Centaurs, Minotaurs, Minoboars, Cyclops, Werewolves, Wraiths, Ankleslicers, Wolves, Satyrs, Boggles and more. Utilize the unique combat skills, weaponry and special moves of each character to fight and fend off hordes of dark mythical beasts, or solve intricate puzzles and progress through the adventure. Two-player action featuring all four characters. [Disney Interactive]… Expand"
  },
  {
    "name": "Total Overdose: A Gunslinger's Tale in Mexico",
    "details_link": "https://www.metacritic.com/game/playstation-2/total-overdose-a-gunslingers-tale-in-mexico",
    "publisher": "Eidos Interactive",
    "release_date": "Sep 27 2005",
    "developers": [
      "Deadline Games"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Modern"
    ],
    "meta_score": 71,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/0/9f1f65e59eb2156993e3fda402239232-98.jpg",
    "descriptions": "1989: Deep in the heart of the Mexican jungle, undercover agent Ernesto Cruz blasts his way through an armed militia to board a DEA plane bound for home. He never made it, the victim of an alleged 'overdose'. Present Day: After uncovering new evidence, Ernesto's son, Ramiro is set free from1989: Deep in the heart of the Mexican jungle, undercover agent Ernesto Cruz blasts his way through an armed militia to board a DEA plane bound for home. He never made it, the victim of an alleged 'overdose'. Present Day: After uncovering new evidence, Ernesto's son, Ramiro is set free from jail to join his twin brother Tommy, on the trail of their father’s killer as they go on a super-cool, tequila fuelled rampage through Mexico’s gun-toting, drug-pushing underworld. Features: A Rich storyline taking the player through 18 different environments, from the seedy red light district of Los Toros, to the depths of the Mexican desert. A free-style combat and stunt system to take down your enemy with more outrageous moves than you can shake a hot chilli at. Cutting edge soundtrack featuring Molotov, Delinquent Habits, Control Machete. [SCi Games]… Expand"
  },
  {
    "name": "Operation: Tango",
    "details_link": "https://www.metacritic.com/game/pc/operation-tango",
    "publisher": "Clever Plays",
    "release_date": "Jun  1 2021",
    "developers": [
      "Clever Plays"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 71,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/d1fd6d07f5c094a0436029d888f4f013-98.jpg",
    "descriptions": "It takes two to save the world in this Asymmetrical Spy Thriller. Pair up with a friend as a special agent or elite hacker, and work together to bring a high-tech global menace to its knees."
  },
  {
    "name": "Attack of the Earthlings",
    "details_link": "https://www.metacritic.com/game/pc/attack-of-the-earthlings",
    "publisher": "Junkfish Limited",
    "release_date": "Feb  8 2018",
    "developers": [
      "Team Junkfish"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Tactics"
    ],
    "meta_score": 71,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/5/cc28acaf03d69b43c55516f815a992d5-98.jpg",
    "descriptions": "Take on Galactoil, a comically dysfunctional intergalactic energy corporation, and its larger-than-life employees in a tactical-stealth game that fuses satisfying strategic gameplay and dark comedy in a quirky single-player story."
  },
  {
    "name": "Double Dragon: Neon",
    "details_link": "https://www.metacritic.com/game/playstation-3/double-dragon-neon",
    "publisher": "Majesco Games",
    "release_date": "Sep 11 2012",
    "developers": [
      "WayForward"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox 360",
      "PlayStation 3"
    ],
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "Beat-'Em-Up",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/0/d7ec1336714b5ac86fa7b066c0336a55-98.jpg",
    "descriptions": "Double Dragon: Neon is WayForward's love letter to the decade that spawned the franchise."
  },
  {
    "name": "CMT Presents: Karaoke Revolution Country",
    "details_link": "https://www.metacritic.com/game/playstation-2/cmt-presents-karaoke-revolution-country",
    "publisher": "Konami",
    "release_date": "Mar 21 2006",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Miscellaneous",
      "Rhythm",
      "Music"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/2/984090462792304dbc45292d0cc9801f-98.jpg",
    "descriptions": "Karaoke Revolution goes country for the first time as Konami partners with Country Music Television to deliver the first-ever karaoke game dedicated to a specific music genre. Featuring 35 songs -- including classics like The Gambler and Stand By Your Man, and recent hits like Redneck Woman,Karaoke Revolution goes country for the first time as Konami partners with Country Music Television to deliver the first-ever karaoke game dedicated to a specific music genre. Featuring 35 songs -- including classics like The Gambler and Stand By Your Man, and recent hits like Redneck Woman, Save A Horse (Ride A Cowboy), and When The Sun Goes Down, CMT Presents: Karaoke Revolution Country is the hottest new addition to the Karaoke Revolution series. The game will let country music fans sing with – and compete against – friends with the two microphone mode to perform duets, and expanded multiplayer and party modes that are sure to enhance any party. Additionally, Karaoke Revolution Country provides support for the EyeToyUSB Camera so players can create a 3D model of their own head and watch as they perform on stage. [Konami]… Expand"
  },
  {
    "name": "Tomodachi Life",
    "details_link": "https://www.metacritic.com/game/3ds/tomodachi-life",
    "publisher": "Nintendo",
    "release_date": "Jun  6 2014",
    "developers": [
      "Nintendo"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "General",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 71,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/0/71e9583092fb46a15e258d35265857da-98.jpg",
    "descriptions": "What happens when friends, family, and celebrities become Mii™ characters and live together on an island? Tomodachi Life happens! Start by creating Mii characters and customizing everything about them. Have fun recreating your best friend, your favorite actor, mom and dad,What happens when friends, family, and celebrities become Mii™ characters and live together on an island? Tomodachi Life happens! Start by creating Mii characters and customizing everything about them. Have fun recreating your best friend, your favorite actor, mom and dad, co-workers...whoever! Then watch as they rap, rock, eat donuts, fall in love, break up, go shopping, play games, and live their crazy Mii lives.… Expand"
  },
  {
    "name": "9 Monkeys of Shaolin",
    "details_link": "https://www.metacritic.com/game/playstation-4/9-monkeys-of-shaolin",
    "publisher": "Buka Entertainment",
    "release_date": "Oct 16 2020",
    "developers": [
      "Sobaka"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/7/5ea1482f1e4868519da11315de74d561-98.jpg",
    "descriptions": "9 Monkeys of Shaolin  marks a rebirth of the iconic beat 'em up genre in vein of old-school video games. If, as a kid you had hours of fun playing SNES or SEGA beat 'em up videogames crushing foes left and right then this new title from the creators of hardcore brawler REDEEMER is definitely9 Monkeys of Shaolin  marks a rebirth of the iconic beat 'em up genre in vein of old-school video games. If, as a kid you had hours of fun playing SNES or SEGA beat 'em up videogames crushing foes left and right then this new title from the creators of hardcore brawler REDEEMER is definitely for you. As a mere Chinese fisherman Wei Cheng you have to avenge the death of your friends and family slaughtered in a pirate raid at your peaceful village. Game protagonist is quite a tough nut to crack as he knows the basics of ancient martial arts only mastered by legendary Shaolin monks. Get your trusty battle staff ready for a challenging adventure in Medieval China and for merciless fights with hordes of various enemies. Action-packed battles, user friendly controls and incredible atmosphere of great kung-fu movies of 70s – all this makes 9 Monkeys of Shaolin a choice for every true fan of really hardcore brawlers.… Expand"
  },
  {
    "name": "Gray Dawn",
    "details_link": "https://www.metacritic.com/game/pc/gray-dawn",
    "publisher": "Interactive Stone",
    "release_date": "Jun  7 2018",
    "developers": [
      "Interactive Stone"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 71,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/9/77d8ab15fb1f2b6f365b7b04c7cac558-98.jpg",
    "descriptions": "Gray Dawn is a psychological thriller infused with religious elements seen through beautiful and terrifying worlds. You play as Father Abraham, a priest trying to find the missing altar boy."
  },
  {
    "name": "Klang",
    "details_link": "https://www.metacritic.com/game/pc/klang",
    "publisher": "Snow Cannon Games",
    "release_date": "Sep 22 2016",
    "developers": [
      "Tinimations"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Rhythm",
      "Music"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/7/b7de7dffe4e440314e276aad8fab7859-98.jpg",
    "descriptions": null
  },
  {
    "name": "Woah Dave!",
    "details_link": "https://www.metacritic.com/game/playstation-vita/woah-dave!",
    "publisher": "Choice Provisions",
    "release_date": "Jan  6 2015",
    "developers": [
      "Choice Provisions"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Wii U",
      "PlayStation Vita"
    ],
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/6/45f552f3f613a7ba3cc9e8116f7d27bf-98.jpg",
    "descriptions": "Woah Dave! is a frantic, score-chasing arcade game where players gun for digital glory by destroying monsters, stealing their loose change, and triggering more than enough explosions to deplete the O-Zone entirely. Have we mentioned it's also incredibly difficult?\r Everything on theWoah Dave! is a frantic, score-chasing arcade game where players gun for digital glory by destroying monsters, stealing their loose change, and triggering more than enough explosions to deplete the O-Zone entirely. Have we mentioned it's also incredibly difficult?\r Everything on the map--including your ammunition--is trying to kill you. And don't even get me started on the game's hard mode. It's borderline impossible, because apparently people who play games are masochists.… Expand"
  },
  {
    "name": "Sid Meier's Ace Patrol",
    "details_link": "https://www.metacritic.com/game/pc/sid-meiers-ace-patrol",
    "publisher": "2K Games",
    "release_date": "Aug 27 2013",
    "developers": [
      "Firaxis Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "genres": [
      "Strategy",
      "General",
      "General"
    ],
    "meta_score": 71,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/0/99d70b6274796adf271a06f7373ab3ff-98.jpg",
    "descriptions": "The skies over Europe are a dangerous place, where ace pilots lead their squadrons to glorious victory or crushing defeat. Take control of dozens of the most famous fighter planes of WWI and head into the dogfight. Roll, slip, and loop to get the drop on enemy aces."
  },
  {
    "name": "Hitman HD Trilogy",
    "details_link": "https://www.metacritic.com/game/playstation-3/hitman-hd-trilogy",
    "publisher": "Square Enix",
    "release_date": "Jan 29 2013",
    "developers": [
      "Io Interactive"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "Miscellaneous",
      "Compilation",
      "Compilation"
    ],
    "meta_score": 71,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/8/2f087c3c540c1bc2f43b53f250b925b8-98.jpg",
    "descriptions": "Engage in more than 40 missions from three Hitman games, each re-mastered in high definition. Whether you're a veteran or new to the franchise, this is your chance to take on the contracts that defined the series and helped establish Agent 47 as the world's deadliest assassin."
  },
  {
    "name": "RoadKill",
    "details_link": "https://www.metacritic.com/game/playstation-2/roadkill",
    "publisher": "Midway",
    "release_date": "Oct 13 2003",
    "developers": [
      "Terminal Reality"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Car Combat"
    ],
    "meta_score": 71,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/4/9c1b586d4814bd37c95fc47a57b3a3a7-98.jpg",
    "descriptions": "Select from more than 30 unique post-apocalyptic style vehicles to experience the ultimate ride in vehicular combat. Destroy your opponents throughout three enormous living and destructible cities. Engage in more than 30 core missions and numerous side missions as you roam the streets andSelect from more than 30 unique post-apocalyptic style vehicles to experience the ultimate ride in vehicular combat. Destroy your opponents throughout three enormous living and destructible cities. Engage in more than 30 core missions and numerous side missions as you roam the streets and instigate anarchy. Run over, impale, shoot and splatter both innocent and armed pedestrians in multiple ways, inciting riots. Gain the necessary reputation to work your way up from a vagrant to an overlord and develop a gang following that will provide additional protection. Face-off against seven rival gangs, killing the members of some while gaining the respect of others. Collect salvaged parts from destroyed vehicles to unlock hidden items such as nitrous thrust, armor plating and death match arenas. Participate in scavenger hunts and find the blueprints necessary to build the ultimate weapons and vehicles. Use the dynamic radio system to be forewarned of bounties on your head, to receive mission tips, in addition to using the multiple stations to tune into a variety of rock, rap and heavy metal hits. [Midway]… Expand"
  },
  {
    "name": "Billy Hatcher and the Giant Egg",
    "details_link": "https://www.metacritic.com/game/gamecube/billy-hatcher-and-the-giant-egg",
    "publisher": "Sega",
    "release_date": "Sep 23 2003",
    "developers": [
      "Sonic Team"
    ],
    "platforms": "GameCube",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/2/3d69fa1b3814cbbc0dae95d921ea887d-98.jpg",
    "descriptions": "A wicked plot by a sinister raven and his massive flock of monstrous crows has cast Morning Land into darkness.  Only Billy Hatcher and his friends from the human world can bring the dawn again to the lands of the Chicken Elders.  Get ready to discover a wild and unpredictable world whereA wicked plot by a sinister raven and his massive flock of monstrous crows has cast Morning Land into darkness.  Only Billy Hatcher and his friends from the human world can bring the dawn again to the lands of the Chicken Elders.  Get ready to discover a wild and unpredictable world where you'll use the surprising power of the giant eggs and the creatures they contain to make your way through puzzling realms and challenging missions.  You'll be surprised by what you can do with these eggs but it will take quick moves and a Rooster Suit to foil the fowl forces of Dark Raven.  … Expand"
  },
  {
    "name": "Vexx",
    "details_link": "https://www.metacritic.com/game/gamecube/vexx",
    "publisher": "Acclaim",
    "release_date": "Feb 10 2003",
    "developers": [
      "Acclaim"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/3/5050ea03c2a153578edda4a8f0738490-98.jpg",
    "descriptions": "Step into the role of Vexx as he seeks vengeance on those who murdered his grandfather and enslaved his people. Equipped with a set of razor-sharp war talons, you'll travel through volcanic islands, desert temples, frozen citadels, and giants' castles to confront the evil Dark Yabu,Step into the role of Vexx as he seeks vengeance on those who murdered his grandfather and enslaved his people. Equipped with a set of razor-sharp war talons, you'll travel through volcanic islands, desert temples, frozen citadels, and giants' castles to confront the evil Dark Yabu, Shadowraith, and their minions. As darkness falls, enemies become more aggressive and the environments become more hostile. It will take all your combat skills and climbing moves to bring peace back to the villagers of Rockhaven.… Expand"
  },
  {
    "name": "Kessen II",
    "details_link": "https://www.metacritic.com/game/playstation-2/kessen-ii",
    "publisher": "Koei",
    "release_date": "Sep 26 2001",
    "developers": [
      "Koei"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic"
    ],
    "meta_score": 71,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/3/e84f926cd65de8749bfb5e8ab6083c72-98.jpg",
    "descriptions": "Assume the role of historical Chinese general Liu Bei of the Shu kingdom whose ultimate goal is the destruction of the Cao Cao, the leader of the Wei kindgom in order to rescue his lost love and claim his opponenet's land.  New \"Agen Technology\" allows for 500 soldiers on-screen at a given time."
  },
  {
    "name": "Time Crisis: Project Titan",
    "details_link": "https://www.metacritic.com/game/playstation/time-crisis-project-titan",
    "publisher": "Namco",
    "release_date": "Jun 20 2001",
    "developers": [
      "Flying Tiger Development"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Light Gun"
    ],
    "meta_score": 71,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/5/9cfdbcd87695ffd8bc368086d930f48e-98.jpg",
    "descriptions": "Hard-core Time Crisis fans and those just looking for a good gun game would do well to pick up this game, but the antiquated presentation, lack of options, and brutal continue system will make this at best a rental for most."
  },
  {
    "name": "Dead Island",
    "details_link": "https://www.metacritic.com/game/xbox-360/dead-island",
    "publisher": "Deep Silver",
    "release_date": "Sep  6 2011",
    "developers": [
      "Techland"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Survival"
    ],
    "meta_score": 71,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/0/6292be4689ca0f858ed9c2eedc10c14e-98.jpg",
    "descriptions": "A couple flying to the vacation of their dreams is torn apart by a violent plane crash. Take on a harrowing quest to find your lost wife. Enter into the dark world of a devastated tropical paradise now plunged into chaos. It's a place where the word \"dead\" has an entirely new meaning. FaceA couple flying to the vacation of their dreams is torn apart by a violent plane crash. Take on a harrowing quest to find your lost wife. Enter into the dark world of a devastated tropical paradise now plunged into chaos. It's a place where the word \"dead\" has an entirely new meaning. Face the nightmare and fight for survival. Explore the secrets hidden in the darkest regions of the island and fight your way through. Survival is your main goal! Dead Island is a non-linear FPP (First Person Perspective) survival horror title. The ultra-realistic combat system will ensure that every confrontation is a thrilling experience. Use anything you find in your surroundings as a weapon. Make decisions that influence the entire world around you. Take advantage of opponent behavior and game physics. Dead Island is a mix of intense action and chilling horror environments in an engaging, strikingly realistic story. [Techland]… Expand"
  },
  {
    "name": "Boulder Dash-XL",
    "details_link": "https://www.metacritic.com/game/xbox-360/boulder-dash-xl",
    "publisher": "Kalypso",
    "release_date": "Jul 13 2011",
    "developers": [
      "Catnip Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "Xbox 360"
    ],
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Puzzle",
      "Action"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/7/c384294af33de49da2a482a336a56494-98.jpg",
    "descriptions": "This tricky, action-puzzle and dexterity game made its debut in the early 80s and has continued to fascinate its enormous fan base and new players for decades. Today the game is recognized as one of the best loved retro games in the history of computer and video gaming. Now Boulder Dash isThis tricky, action-puzzle and dexterity game made its debut in the early 80s and has continued to fascinate its enormous fan base and new players for decades. Today the game is recognized as one of the best loved retro games in the history of computer and video gaming. Now Boulder Dash is back with a hot new look to take the Xbox Live Arcade platform by storm. The multimillion units selling hit game's core remains unchanged: in a race against time players must collect sparkling diamonds while besting hordes of enemies; and, avoiding numerous traps, and of course, falling boulders!… Expand"
  },
  {
    "name": "Far Cry New Dawn",
    "details_link": "https://www.metacritic.com/game/playstation-4/far-cry-new-dawn",
    "publisher": "Ubisoft",
    "release_date": "Feb 15 2019",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 5.1,
    "image": "https://static.metacritic.com/images/products/games/2/cc3ad1c85516c2657f397352879873bc-98.jpg",
    "descriptions": "Seventeen years after a nuclear doomsday, Hope County, Montana, has changed in unexpected ways. Nuclear winter has given way to a \"superbloom,\" creating a lush, colourful landscape that survivors have begun to re-populate with makeshift buildings. It's a lawless frontier where people areSeventeen years after a nuclear doomsday, Hope County, Montana, has changed in unexpected ways. Nuclear winter has given way to a \"superbloom,\" creating a lush, colourful landscape that survivors have begun to re-populate with makeshift buildings. It's a lawless frontier where people are struggling to get by - and you'll be able to experience it all with a friend in co-op, or on your own as a lone gunslinger. After living through the apocalypse, the survivors in Hope County now face a new threat: the nihilistic Highwaymen, vicious scavengers intent on bleeding the county dry. When the survivors put out a call for help to combat this deadly threat, you are quickly thrust into the middle of a new battle for the future of Hope County. Since the nuclear apocalypse, survivors have been piecing their shelter, tools, and weapons together from the broken remnants of the old world. The results may look ramshackle, but they'll keep you alive in a fight. Your Homebase will let you construct powerful weapons and vehicles, giving you more options than ever for explosive, over-the-top action. When anything and everything can happen, it is never too much to have someone watching your back. Whether it's Hurk, a boar, or whoever you want, you can recruit an eclectic cast of Guns and Fangs for Hire to fight by your side. You can even play with a friend in co-op.… Expand"
  },
  {
    "name": "Days Gone",
    "details_link": "https://www.metacritic.com/game/playstation-4/days-gone",
    "publisher": "Sony Interactive Entertainment",
    "release_date": "Apr 26 2019",
    "developers": [
      "Sony Bend"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 71,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/9/cb89640f742976353c40ee4d35be0bfd-98.jpg",
    "descriptions": "Set in the beautiful, volcanic scarred high-desert of the Pacific Northwest, Days Gone is an open-world action-adventure game in which you assume the role of Deacon St. John, a Drifter and bounty hunter who would rather risk the dangers of the broken road than live in one of the “safe”Set in the beautiful, volcanic scarred high-desert of the Pacific Northwest, Days Gone is an open-world action-adventure game in which you assume the role of Deacon St. John, a Drifter and bounty hunter who would rather risk the dangers of the broken road than live in one of the “safe” wilderness encampments. The game takes place two years following a global pandemic which has wiped out just about everyone, but transformed millions of others into what survivors call Freakers – mindless, feral creatures, more animal than human but very much alive and rapidly evolving. Made up of hundreds of individual Freakers, Hordes eat, move and attack together, seemingly as one. Some Hordes roam the highways at night, while others, like the one in the demo, have found a food source that keeps it in a single location. Skills learned in his prior life as an outlaw biker have given Deacon a slight edge in the seemingly never-ending fight to stay alive. But will it be enough? [Bend Studios]… Expand"
  },
  {
    "name": "The Escapists",
    "details_link": "https://www.metacritic.com/game/pc/the-escapists",
    "publisher": "Team17",
    "release_date": "Feb 13 2015",
    "developers": [
      "Mouldy Toof Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 71,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/6/a13d877b783bb3e4464883bc0109e2fb-98.jpg",
    "descriptions": "The Escapists gives players the chance to experience a light-hearted insight into everyday prison life with the main objective being that of escaping."
  },
  {
    "name": "Madagascar",
    "details_link": "https://www.metacritic.com/game/xbox/madagascar",
    "publisher": "Activision",
    "release_date": "May 24 2005",
    "developers": [
      "Toys for Bob"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/5/17f3eca7bb1341c8b94c16ff2347b201-98.jpg",
    "descriptions": "Based on the animated film from DreamWorks, Madagascar tells the tale of four animals in New York's Central Park Zoo. You must use the skills of your animal crew (consisting of a lion, zebra, giraffe, and hippo) to overcome a variety of dangerous obstacles. As you meet new characters andBased on the animated film from DreamWorks, Madagascar tells the tale of four animals in New York's Central Park Zoo. You must use the skills of your animal crew (consisting of a lion, zebra, giraffe, and hippo) to overcome a variety of dangerous obstacles. As you meet new characters and battle enemies, you'll develop new skills, such as the stealth crawl, the helicopter spin, and the running barrel. Replay levels to unlock character-specific bonuses and cheats. … Expand"
  },
  {
    "name": "Nioh 2: The First Samurai",
    "details_link": "https://www.metacritic.com/game/playstation-4/nioh-2-the-first-samurai",
    "publisher": "Koei Tecmo Games",
    "release_date": "Dec 17 2020",
    "developers": [
      "Team Ninja"
    ],
    "platforms": "PlayStation 4",
    "num_players": "Up to 3 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 71,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/3/349d929fa9a308e24afab52013c58f6d-98.jpg",
    "descriptions": "The thrilling conclusion to the Nioh 2 story and the third and final DLC expansionThe First Samurai. Brace yourselves to take on some of the most challenging missions and formidable foes in the entire series, along with an added difficulty level that will give even the most seasonedThe thrilling conclusion to the Nioh 2 story and the third and final DLC expansionThe First Samurai. Brace yourselves to take on some of the most challenging missions and formidable foes in the entire series, along with an added difficulty level that will give even the most seasoned veterans a run for their money. A flash of light from Sohayamaru whisks the protagonist back to the past as a Visitor for the third and final time. They are brought back to the place their mother spoke of when they were very young, the land of the fabled youth that defeated an oni. Otakemaru's past, the secret of Sohayamaru, and the truth behind the first samurai. All of these mysteries will be revealed, and the protagonist's long journey will finally come to a climactic end.… Expand"
  },
  {
    "name": "Hitman - Episode 4: Bangkok",
    "details_link": "https://www.metacritic.com/game/playstation-4/hitman---episode-4-bangkok",
    "publisher": "Square Enix",
    "release_date": "Aug 16 2016",
    "developers": [
      "Io Interactive"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/6/507e7f975cf0f968ad7e77d4445a83ed-98.jpg",
    "descriptions": "While Agent 47 is quite the jet-setter, he rarely chooses to travel for pleasure. 47 is most certainly all work and no play. And so it is that he finds himself traveling to Thailand to bask in the natural beauty of exotic gardens, explore the Himmapan luxury hotel and resort’s exquisiteWhile Agent 47 is quite the jet-setter, he rarely chooses to travel for pleasure. 47 is most certainly all work and no play. And so it is that he finds himself traveling to Thailand to bask in the natural beauty of exotic gardens, explore the Himmapan luxury hotel and resort’s exquisite interiors; and most importantly, take care of business. [Square Enix]… Expand"
  },
  {
    "name": "Star Wars Galaxies: An Empire Divided",
    "details_link": "https://www.metacritic.com/game/pc/star-wars-galaxies-an-empire-divided",
    "publisher": "LucasArts",
    "release_date": "Jul  9 2003",
    "developers": [
      "Sony Online Entertainment"
    ],
    "platforms": "PC",
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Sci-Fi",
      "Sci-Fi"
    ],
    "meta_score": 71,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/9/764219f63fa29bf92a7e93584f7a28d2-98.jpg",
    "descriptions": "Star Wars Galaxies: An Empire Divided for Windows PC simultaneously immerses thousands of players into a persistent online recreation of the Star Wars universe, as portrayed in the classic Star Wars film trilogy. The series features dynamic adventures throughout the galaxy during the classicStar Wars Galaxies: An Empire Divided for Windows PC simultaneously immerses thousands of players into a persistent online recreation of the Star Wars universe, as portrayed in the classic Star Wars film trilogy. The series features dynamic adventures throughout the galaxy during the classic Star Wars timeframe. Game play offers a unique combination of combat, exploration, social interaction, specialized missions, and daring quests. [LucasArts]… Expand"
  },
  {
    "name": "NHL 23",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/nhl-23",
    "publisher": "Electronic Arts",
    "release_date": "Oct 11 2022",
    "developers": [
      "Electronic Arts",
      "EA Vancouver"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Sports",
      "Team",
      "Ice Hockey",
      "Sim"
    ],
    "meta_score": 71,
    "users_score": 1.8,
    "image": "https://static.metacritic.com/images/products/games/7/fb6511f6302ba928eff42b5bf290bb13-98.jpg",
    "descriptions": "EA SPORTS NHL 23 is greater together with the introduction of mixed women's and men's teams in HUT, and planned for November 2022, the arrival of cross-play for players on the same platform generation in WOC. So grab your friends and gear up for the most connected version of Chel yet."
  },
  {
    "name": "Corpse Party",
    "details_link": "https://www.metacritic.com/game/pc/corpse-party",
    "publisher": "XSEED Games",
    "release_date": "Apr 25 2016",
    "developers": [
      "Mages."
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 71,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/4/b6f7d0402009cd8233b0b718f7776e45-98.jpg",
    "descriptions": "Corpse Party is an adventure game that uses hand-drawn 2D sprite and tile art to tell the story of a group of Kisaragi Academy High School students who are trapped in a haunted elementary school filled with the decaying corpses and tormented souls of countless children whod mysteriouslyCorpse Party is an adventure game that uses hand-drawn 2D sprite and tile art to tell the story of a group of Kisaragi Academy High School students who are trapped in a haunted elementary school filled with the decaying corpses and tormented souls of countless children whod mysteriously vanished from the Japanese countryside years, months or sometimes only days prior. Desperately trying to escape and survive, players will experience unnatural, unnerving and decidedly uncensored horrors through the eyes  and ears -- of these frightened teenaged victims. Detailed 2D sprite animations and art stills show the bloody and unsettling fates that await those who enter, and full Japanese-language voice-acting combines with 3D audio support to create a simulated surround sound experience when playing with headphones, offering players a delightfully uncomfortable level of immersion.… Expand"
  },
  {
    "name": "PAIN",
    "details_link": "https://www.metacritic.com/game/playstation-3/pain",
    "publisher": "SCEA",
    "release_date": "Nov 29 2007",
    "developers": [
      "Idol Minds"
    ],
    "platforms": "PlayStation 3",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "General",
      "General"
    ],
    "meta_score": 71,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/7/7244d1e96d8904c071585d9a8fb7e073-98.jpg",
    "descriptions": "[Downloadable Game]  PAIN boldly tackles a rarely explored area of video-gaming... comedy. The unique mechanic of the game allows the player to load a character into a human-sized, ultra-powerful slingshot, and fire the character into an active, physics-controlled environment, filled with[Downloadable Game]  PAIN boldly tackles a rarely explored area of video-gaming... comedy. The unique mechanic of the game allows the player to load a character into a human-sized, ultra-powerful slingshot, and fire the character into an active, physics-controlled environment, filled with precarious and humorous situations. Players receive points by stringing together painful collisions and inducing chaos in the environment. Multiple playable characters each with a very unique personality and attributes as well as character specific in-flight poses. Plenty of ways to play in both Single and Multiplayer, including modes like Spank the Monkey, Mime Toss, PAIN Bowling, Fun With Explosives, and even more to come in future releases. Relive every cringe-worthy smash and crash with the replay system in PAIN. Use the free camera to get the best angle on your best ouchies. Unique physics model created on Havok powered events, allow for amazing ragdoll animations, while ensuring that duplicating incidents is almost impossible. Keeping gameplay fresh over and over no matter how many times a player is launched into the same environment. Robust online community feature set lets you compete with other players around the world on Global Leaderboards, track your friend's scores, and connect to the PAIN website, where you can participate in polls, get developer updates, and provide feedback to make for a more PAINful experience in future expansions. [SCEA]… Expand"
  },
  {
    "name": "Rugby 2005",
    "details_link": "https://www.metacritic.com/game/playstation-2/rugby-2005",
    "publisher": "EA Sports",
    "release_date": "Mar  8 2005",
    "developers": [
      "HB Studios Multimedia"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Alternative",
      "Rugby"
    ],
    "meta_score": 71,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/9/abf5d2ebc5307a2f0d89c4787395a6ec-98.jpg",
    "descriptions": "EA Sports Rugby 2005 incorporates all the major Rugby teams, players, and tournaments, including the Tri-Nations, Super 12 and many more authentic and prestigious events from the world of Rugby. The game incorporates a completely upgraded graphical engine with individually differentiatedEA Sports Rugby 2005 incorporates all the major Rugby teams, players, and tournaments, including the Tri-Nations, Super 12 and many more authentic and prestigious events from the world of Rugby. The game incorporates a completely upgraded graphical engine with individually differentiated players, realistic motion-captured player animations, dramatic lighting and cameras, and stadiums that are accurate with details such as crowd reactions, songs, and chants. EA SPORTS Rugby 2005 plays realistically with on-the-fly play-calling, right analog stick controls for fakes and crushing hits and improved kicking control. The game also features a \"Rugby 101\" training mode outlining the rules, controls, and tactics of the sport through videos and interactive challenges. [Electronic Arts]… Expand"
  },
  {
    "name": "A Memoir Blue",
    "details_link": "https://www.metacritic.com/game/playstation-5/a-memoir-blue",
    "publisher": "Annapurna Interactive",
    "release_date": "Mar 24 2022",
    "developers": [
      "Cloisters"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "3D",
      "Third-Person"
    ],
    "meta_score": 71,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/8/664f1a009ef7fe371825de92ec5188de-98.jpg",
    "descriptions": "A song from years ago triggers a flood of memories for champion swimmer Miriam. Embark on an evocative journey through her turbulent childhood and the complicated relationship she shared with her devoted mother."
  },
  {
    "name": "Tribes of Midgard",
    "details_link": "https://www.metacritic.com/game/playstation-5/tribes-of-midgard",
    "publisher": "Gearbox Software",
    "release_date": "Jul 27 2021",
    "developers": [
      "Norsfell"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 71,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/2/b88b7b4fb6e50fd300e9f4c9a9c9eb07-98.jpg",
    "descriptions": "In Tribes of Midgard players can play solo or co-op with a team of up to 10 players to resist the oncoming invasion of giants during Ragnarök. Set in worlds full of dark creatures, hidden gods, and abundant materials to be uncovered, players begin the game as a Viking living in a villageIn Tribes of Midgard players can play solo or co-op with a team of up to 10 players to resist the oncoming invasion of giants during Ragnarök. Set in worlds full of dark creatures, hidden gods, and abundant materials to be uncovered, players begin the game as a Viking living in a village that houses the Seed of Yggdrasil, which is the last bastion that protects the gods from the other realms.  Fans will need to explore the wilderness to craft new weapons and be prepared to defend the sacred center of your village from the grim shadows from Helheim that prey upon its power. All the while, giants stalk ever closer to the village, seeking to destroy Midgard and fulfill the prophecy of the end of the world.… Expand"
  },
  {
    "name": "Mad Riders",
    "details_link": "https://www.metacritic.com/game/playstation-3/mad-riders",
    "publisher": "Ubisoft",
    "release_date": "May 29 2012",
    "developers": [
      "Techland"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Rally / Offroad",
      "Rally / Offroad",
      "Automobile"
    ],
    "meta_score": 71,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/9/45f2c1172be7ef623b0fd36a3be3d099-98.jpg",
    "descriptions": "Mad Riders, developed by Techland, sees players performing amazing aerial stunts and racing at breathtaking speeds on over 45 stunning tracks from all over the world. To gain the edge on the competition, players will need to use their Boost skill wisely and take advantage of shortcuts hiddenMad Riders, developed by Techland, sees players performing amazing aerial stunts and racing at breathtaking speeds on over 45 stunning tracks from all over the world. To gain the edge on the competition, players will need to use their Boost skill wisely and take advantage of shortcuts hidden in the tracks… Expand"
  },
  {
    "name": "My Time At Portia",
    "details_link": "https://www.metacritic.com/game/switch/my-time-at-portia",
    "publisher": "Team17",
    "release_date": "Apr 16 2019",
    "developers": [
      "Pathea Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 71,
    "users_score": 5.3,
    "image": "https://static.metacritic.com/images/products/games/8/d620e6fb4a2866beb947fd7bdf3ce7a6-98.jpg",
    "descriptions": "Restore your Pa's neglected workshop to its former glory by fulfilling commissions, growing crops, raising animals, and befriending the quirky inhabitants of this charming post-apocalyptic land. Armed with your Pa's old handbook and workbench, you must gather, mine and craft your way toRestore your Pa's neglected workshop to its former glory by fulfilling commissions, growing crops, raising animals, and befriending the quirky inhabitants of this charming post-apocalyptic land. Armed with your Pa's old handbook and workbench, you must gather, mine and craft your way to being crowned the number one workshop in Portia. Help the locals rebuild the town and uncover the secrets locked deep away beneath it. Be prepared though…it won't be easy. The town of Portia is full of friendly new faces for you to meet. Make friends, complete requests, exchange gifts, go on dates and let romance blossom! … Expand"
  },
  {
    "name": "Kona",
    "details_link": "https://www.metacritic.com/game/playstation-4/kona",
    "publisher": "Deep Silver",
    "release_date": "Mar 23 2017",
    "developers": [
      "Parabole"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Stadia",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Adventure",
      "General",
      "3D",
      "First-Person"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/5/95f28074ee3498096906395452113098-98.jpg",
    "descriptions": "Northern Canada, 1970. A strange blizzard ravages Atamipek Lake. Step into the shoes of a detective to explore the eerie village, investigate surreal events, and battle the elements to survive. The first installment in a series of four games, Kona is a chilly interactive tale you won’t soonNorthern Canada, 1970. A strange blizzard ravages Atamipek Lake. Step into the shoes of a detective to explore the eerie village, investigate surreal events, and battle the elements to survive. The first installment in a series of four games, Kona is a chilly interactive tale you won’t soon forget. [Playstation.com]… Expand"
  },
  {
    "name": "Aces of the Galaxy",
    "details_link": "https://www.metacritic.com/game/xbox-360/aces-of-the-galaxy",
    "publisher": "Sierra Online",
    "release_date": "Jun  4 2008",
    "developers": [
      "Artech Studios"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "2  Online",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/3/19bda4518ae3cf4f584de7e719e76f3b-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Launch yourself into the intense space-shooter Aces of the Galaxy, a non-stop, old-school arcade thrill-ride for the twenty-first century and beyond. Utilize an impressive arsenal of upgradeable weapons including high powered missile launchers, devastating torpedoes, and[Xbox Live Arcade]  Launch yourself into the intense space-shooter Aces of the Galaxy, a non-stop, old-school arcade thrill-ride for the twenty-first century and beyond. Utilize an impressive arsenal of upgradeable weapons including high powered missile launchers, devastating torpedoes, and the ever-reliant chain gun to annihilate the ships of the wretched Skurgian Empire. Save planet Earth cooperatively at home with a friend or join up on Xbox Live. Use the temporal shift to slow down the hordes of enemies and prepare yourself for the battle. Classic retro-arcade shooter action mixes with stunning next-generation visuals to bring the action up close and personal. [Sierra Online]… Expand"
  },
  {
    "name": "WWE Legends of WrestleMania",
    "details_link": "https://www.metacritic.com/game/xbox-360/wwe-legends-of-wrestlemania",
    "publisher": "THQ",
    "release_date": "Mar 24 2009",
    "developers": [
      "Yuke's"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "4  Online",
    "genres": [
      "Action",
      "Sports",
      "Fighting",
      "Fighting",
      "Individual",
      "Wrestling",
      "Combat",
      "Wrestling"
    ],
    "meta_score": 71,
    "users_score": 6.1,
    "image": "https://static.metacritic.com/images/products/games/2/9f7322c7345ac125697f1530c72964c3-98.jpg",
    "descriptions": "WWE Legends of WrestleMania embraces the leading sports entertainment organization's rich history to relive, rewrite or recreate the definitive elements of WWE from the Eighties and Nineties. Players relive the entertaining lives of more than 40 larger-than-life Legends and have control overWWE Legends of WrestleMania embraces the leading sports entertainment organization's rich history to relive, rewrite or recreate the definitive elements of WWE from the Eighties and Nineties. Players relive the entertaining lives of more than 40 larger-than-life Legends and have control over Legendary Managers, each of whom play crucial roles in match outcomes. The game's new grapple-based fighting system captures the high-energy action and drama seen in vintage WWE matches, while a historically accurate representation of past WWE telecasts sets the stage, including dynamic visual treatments, signature ring entrances, renowned commentators and notable venues. WWE Legends of WrestleMania also includes a WrestleMania Tour Mode that allows players to participate in key matches from multiple WrestleMania events, a Create-A-Legend system to develop the Legends of tomorrow, as well as online functionality for players to compete on the biggest stages in WWE history. [THQ]… Expand"
  },
  {
    "name": "Warhammer 40,000: Inquisitor - Martyr",
    "details_link": "https://www.metacritic.com/game/xbox-one/warhammer-40000-inquisitor---martyr",
    "publisher": "Bigben Interactive",
    "release_date": "Jul  5 2018",
    "developers": [
      "Maximum Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "General"
    ],
    "meta_score": 71,
    "users_score": 5.5,
    "image": "https://static.metacritic.com/images/products/games/0/fc65c9c40e0edc540fb280485ac6badd-98.jpg",
    "descriptions": "Enter the Chaos-infested Caligari Sector and purge the unclean with the most powerful agents of the Imperium of Man.Warhammer 40,000: Inquisitor Martyr is a grim Action-RPG featuring multiple classes of the Inquisition who will carry out the will of the Emperor even in the darkest reachesEnter the Chaos-infested Caligari Sector and purge the unclean with the most powerful agents of the Imperium of Man.Warhammer 40,000: Inquisitor Martyr is a grim Action-RPG featuring multiple classes of the Inquisition who will carry out the will of the Emperor even in the darkest reaches of the Imperium!THE NEXT MILESTONE IN THE EVOLUTION OF ARPGSThe first Action-RPG set in the grim future of the 41st Millennium takes the genre to its next level: an open-world sandbox game with a persistent universe with a huge variety of missions, tactical, brutal combat encounters in destructible environments and a storyline influenced by the community of players. Use the cover system for tactical advantage, shoot off limbs and perform executions in epic boss battles and become a Protector of any solar systems with your glorious actions!INQUISITORS: SECRET AGENTS AND SPECIALISTSForge your own playstyle with different character classes and specializations: hold your ground with the Crusader Inquisitor while enemies close in on you, bring in your finesse and cunning with the Death Cult Assassin background, or use the unspeakable powers of the Warp with the Primaris Psyker background. Choose from three specializations for each classes that fit your playstyle.TRAVERSE A WHOLE GALACTIC SECTORExplore the Star Map of the vast Caligari Sector, travel in different subsectors and explore an immense amount of solar systems, visit a growing number of unique points of interests: investigate on different planets with distinctive terrain conditions, fight your way through corridors of infested Void Stations, abandoned Star Forts and other diverse environments!FIGHT THE CORRUPTION TOGETHERYou can go solo as a lonely Inquisitor, but you can also assemble a team of your friends! Play missions in co-operative mode with up to 4 team members, blast away your foes together claiming great rewards, and form Cabals to gather your close allies! Inquisitorial Cabals are groups of Inquisitors working together. Cabals can progress just like characters do, and being a member can often grant special missions. The Inquisition has a lot of different factions with different agendas, and Cabals sometimes clash with each other in the shadows.IMPROVE YOUR WEAPONS, CRAFT MISSIONS AND TWEAK YOUR SKILLSLooking for a specific loot or reward? Use Uther's Tarot to set the conditions of your next mission, collect Blueprints and use Crafting to improve your equipment, and use the Inoculator to fine-tune your different skills. Choose your loadout to your advantage for each mission!A LIVING, EXPANDING WORLDWarhammer 40,000: Inquisitor Martyr is an ever-growing, long-lasting experience. Expansions and regular free updates will introduce new enemy factions, new terrain settings, new missions and mission types, new story-driven investigations and new gameplay features. Seasons are big, free updates that will introduce longer story arcs in which players can shape the persistent world of the Caligari sector with their actions. Daily Quests, Tiers and Power Levels ensure new challenges there's always something new to explore or to collect!… Expand"
  },
  {
    "name": "Dreamfall Chapters Book Two: Rebels",
    "details_link": "https://www.metacritic.com/game/pc/dreamfall-chapters-book-two-rebels",
    "publisher": "Red Thread Games",
    "release_date": "Mar 12 2015",
    "developers": [
      "Red Thread Games"
    ],
    "platforms": "PC",
    "genres": [
      "Adventure",
      "3D",
      "Third-Person"
    ],
    "meta_score": 71,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/6/09eb43a27d84212cc054a84a7659e9f2-98.jpg",
    "descriptions": "The world of Arcadia exists in parallel and in balance with own own. It is a world of magic and chaos, a counterweight to Stark, the world of science and order. The Balance between the twin worlds is watched over by the Guardian, who channels the energies of Chaos and Order between ArcadiaThe world of Arcadia exists in parallel and in balance with own own. It is a world of magic and chaos, a counterweight to Stark, the world of science and order. The Balance between the twin worlds is watched over by the Guardian, who channels the energies of Chaos and Order between Arcadia and Stark.… Expand"
  },
  {
    "name": "Harry Potter and the Goblet of Fire",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/harry-potter-and-the-goblet-of-fire",
    "publisher": "Electronic Arts",
    "release_date": "Nov  8 2005",
    "developers": [
      "Magic Pockets"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Game Boy Advance"
    ],
    "num_players": "1-3 ",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 71,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/7/04239d708851b395a13861d16c3b742f-98.jpg",
    "descriptions": "Harry, Ron, and Hermione are back in Harry Potter and the Goblet of Fire--a game based on J.K. Rowling's fourth book. The game follows Harry, the wizard-in-training, as he confronts a fire-breathing dragon, rescues friends from the icy depths of the Black Lake, and navigates the twistingHarry, Ron, and Hermione are back in Harry Potter and the Goblet of Fire--a game based on J.K. Rowling's fourth book. The game follows Harry, the wizard-in-training, as he confronts a fire-breathing dragon, rescues friends from the icy depths of the Black Lake, and navigates the twisting corridors of a maze. As Harry, Ron, or Hermione, you can cast a variety of spells in both single-player and cooperative modes.… Expand"
  },
  {
    "name": "Total Overdose: A Gunslinger's Tale in Mexico",
    "details_link": "https://www.metacritic.com/game/xbox/total-overdose-a-gunslingers-tale-in-mexico",
    "publisher": "Eidos Interactive",
    "release_date": "Sep 27 2005",
    "developers": [
      "Deadline Games"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Modern"
    ],
    "meta_score": 71,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/1/3e4b58159a0b7a8f996de7cbff1f3365-98.jpg",
    "descriptions": "In Total Overdose: A Gunslinger's Tale in Mexico, you can play as two brothers who are searching for their father's killer. Plumb the depths of Mexican drug trade, fighting lowlifes from the coast of California to jungle hideouts in Mexico. You can use a large arsenal of weapons and vehiclesIn Total Overdose: A Gunslinger's Tale in Mexico, you can play as two brothers who are searching for their father's killer. Plumb the depths of Mexican drug trade, fighting lowlifes from the coast of California to jungle hideouts in Mexico. You can use a large arsenal of weapons and vehicles to get your revenge. Total Overdose: A Gunslinger's Tale in Mexico also includes a combat and stunt system that offers you more points for killing with style.… Expand"
  },
  {
    "name": "Forgotten Realms: Demon Stone",
    "details_link": "https://www.metacritic.com/game/playstation-2/forgotten-realms-demon-stone",
    "publisher": "Atari",
    "release_date": "Sep 14 2004",
    "developers": [
      "Stormfront Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 71,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/7/726757f14a2d43a8a5e7a97d2435fa1a-98.jpg",
    "descriptions": "In Forgotten Realms: Demon Stone, the player directs a party of three characters ? Fighter, Sorcerer and Rogue.  The player controls one party member at a time -- switching between them on the fly -- while the other party members are controlled by the engine?s sophisticated artificialIn Forgotten Realms: Demon Stone, the player directs a party of three characters ? Fighter, Sorcerer and Rogue.  The player controls one party member at a time -- switching between them on the fly -- while the other party members are controlled by the engine?s sophisticated artificial intelligence.  For example, when the player controls the Fighter, the Sorcerer and Rogue will continue to engage in combat, cast spells and assist the player in defeating all challengers.  In many situations, the characters will be able to divide and conquer difficult objectives ? while the Fighter holds back a horde of Yuan-Ti snakemen with brute force, the Sorcerer supports him with devastating ranged magic while the rogue sneaks above and behind them for a coup de grace.  The player participates seamlessly in each critical moment as they are cinematically switched from one perspective to another. This real-time, on-the-fly character switching design allows Forgotten Realms: Demon Stone to challenge players with innovative and compelling encounters.  In true D&D fashion, each of the characters excels at a certain type of gameplay.  The Fighter thrives in melee combat, the Sorcerer is excellent at ranged and magical combat and the Rogue excels at jumping, sneaking and disarming traps.  Players will be continually tasked with choosing the best character for each challenge as well as using each character?s gameplay specialty to maximum effect. [Atari]… Expand"
  },
  {
    "name": "Bionic Commando",
    "details_link": "https://www.metacritic.com/game/playstation-3/bionic-commando",
    "publisher": "Capcom",
    "release_date": "May 18 2009",
    "developers": [
      "GRIN"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Action Adventure",
      "Adventure",
      "Third-Person",
      "General",
      "Platformer",
      "Sci-Fi",
      "Sci-Fi",
      ""
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/7/054eeecddbd1643d4486ed779ea5cd9f-98.jpg",
    "descriptions": "The first true sequel to the classic 1988 Nintendo Entertainment System original, Bionic Commando sees the return of the bionically-enhanced Nathan \"Rad\" Spencer, voiced by Mike Patton, the former lead singer of Faith No More. Time has not been kind to Spencer: 10 years after his heroicThe first true sequel to the classic 1988 Nintendo Entertainment System original, Bionic Commando sees the return of the bionically-enhanced Nathan \"Rad\" Spencer, voiced by Mike Patton, the former lead singer of Faith No More. Time has not been kind to Spencer: 10 years after his heroic defeat of the Imperials in the original game, he has been betrayed by the government he swore to serve, imprisoned for crimes he didn't commit, and sentenced to death. On the very day of Spencer's execution, terrorists detonate a massive experimental weapon in Ascension City, unleashing an intense earthquake that has turned the city into rubble and wiped out its population. With the terrain in ruins and the city's air defense grid now in the control of a massive terrorist force whose goal remains unclear, the FSA have only one option left - a behind-the-lines assault. The perfect job for a Bionic Commando. Bionic Commando transposes the swing-and-shoot gameplay of the 8-bit original to a stunning 3D environment of towering buildings, suspended roadways and monorails, deep canyons and sheer rock faces, where every environment is scalable using swinging, scaling, climbing and wall-walking techniques. [Capcom]… Expand"
  },
  {
    "name": "Heretic Kingdoms: The Inquisition",
    "details_link": "https://www.metacritic.com/game/pc/heretic-kingdoms-the-inquisition",
    "publisher": "Got Game Entertainment",
    "release_date": "Apr 14 2005",
    "developers": [
      "3D People"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "PC-style RPG",
      "PC-style RPG",
      "Western-Style"
    ],
    "meta_score": 71,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/3/af99fa3b21ed2e7b724314635c275cb2-98.jpg",
    "descriptions": "(Also known as \"Kult: Heretic Kingdoms\")  Heretic Kingdoms is a 3D isometric RPG, that combines 3D technologies and the traditional ways of isometric RPG's. Enter the fantasy kingdom of ancient Rywennia and enjoy this action adventure at its fullest. Kult will take you ;from heroic fights(Also known as \"Kult: Heretic Kingdoms\")  Heretic Kingdoms is a 3D isometric RPG, that combines 3D technologies and the traditional ways of isometric RPG's. Enter the fantasy kingdom of ancient Rywennia and enjoy this action adventure at its fullest. Kult will take you ;from heroic fights against hidious monsters - using weapons and spells - to seeking wisdom and clues for your quests, while interacting with the many NPC's such as spirits and astral enemies. With 7 worlds, over 50 maps and over 40 quests, Kult will enchant you with its stunning beauty, its variation and colorful high detail, as well as its surprising and epic fantasy storyline. [Project Three]… Expand"
  },
  {
    "name": "Marc Ecko's Getting Up: Contents Under Pressure",
    "details_link": "https://www.metacritic.com/game/xbox/marc-eckos-getting-up-contents-under-pressure",
    "publisher": "Atari",
    "release_date": "Feb 14 2006",
    "developers": [
      "Double Helix Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 71,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/7/5560e96acfc4d351681ead8dc89a3098-98.jpg",
    "descriptions": "Marc Ecko's Getting Up: Contents Under Pressure is a game that explores the world of a graffiti artist. In a city where freedom of expression is being choked by a tyrannical mayor, you play as Trane, a youth trying to build his reputation from a rookie to the most reputable graffiti artistMarc Ecko's Getting Up: Contents Under Pressure is a game that explores the world of a graffiti artist. In a city where freedom of expression is being choked by a tyrannical mayor, you play as Trane, a youth trying to build his reputation from a rookie to the most reputable graffiti artist of all. Marc Ecko's Getting Up: Contents Under Pressure lets you experience the life of a tagger, having to fight in the street and scale obstacles to tag the most desirable locations.… Expand"
  },
  {
    "name": "LEGO Worlds",
    "details_link": "https://www.metacritic.com/game/pc/lego-worlds",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Mar  7 2017",
    "developers": [
      "TT Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Sandbox"
    ],
    "meta_score": 71,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/8/16a0a724f4f4dcb25b0cf5230cbc6a1b-98.jpg",
    "descriptions": "In a galaxy of procedural worlds made entirely from LEGO bricks, will you... EXPLORE environments filled with adventure, then alter them? DISCOVER secrets and treasures, then play with them? CREATE your own models, then make a world your own? In LEGO® Worlds, it’s up to you."
  },
  {
    "name": "Lilly Looking Through",
    "details_link": "https://www.metacritic.com/game/pc/lilly-looking-through",
    "publisher": "Geeta Games",
    "release_date": "Nov  1 2013",
    "developers": [
      "Geeta Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "General",
      "Point-and-Click"
    ],
    "meta_score": 71,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/3/8ddb46cd84af3b0cdaa3376b7ba761ac-98.jpg",
    "descriptions": null
  },
  {
    "name": "Red Faction: Armageddon",
    "details_link": "https://www.metacritic.com/game/playstation-3/red-faction-armageddon",
    "publisher": "THQ",
    "release_date": "Jun  7 2011",
    "developers": [
      "Volition Inc."
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/9/3e43e8666ade4c07b366d25fc3747134-98.jpg",
    "descriptions": "Volition and THQ's martian insurgency will continue in a fourth chapter in the franchise with expanded online play and enhanced destruction."
  },
  {
    "name": "Shrek SuperSlam",
    "details_link": "https://www.metacritic.com/game/xbox/shrek-superslam",
    "publisher": "Activision",
    "release_date": "Oct 25 2005",
    "developers": [
      "Shaba Games"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 71,
    "users_score": 4.5,
    "image": "https://static.metacritic.com/images/products/games/0/5e06066cd5a24dfdaadd6c6af0f08657-98.jpg",
    "descriptions": "You can battle characters from the Shrek movies in Shrek SuperSlam. The game lets you play as one of 20 characters, such as the heroic Shrek or villainous Prince Charming. Use weapons, potions, or a character's signature special move to fight through 16 fully-destructible arenas. Then,You can battle characters from the Shrek movies in Shrek SuperSlam. The game lets you play as one of 20 characters, such as the heroic Shrek or villainous Prince Charming. Use weapons, potions, or a character's signature special move to fight through 16 fully-destructible arenas. Then, battle with up to four of your friends or play through more than 30 minigames.… Expand"
  },
  {
    "name": "Song of Iron",
    "details_link": "https://www.metacritic.com/game/pc/song-of-iron",
    "publisher": "Escape",
    "release_date": "Aug 31 2021",
    "developers": [
      "Escape"
    ],
    "platforms": [
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 4.1,
    "image": "https://static.metacritic.com/images/products/games/0/afd2aaf984b56841ec0a999db7a014fc-98.jpg",
    "descriptions": "Behind you lies a trail of broken helms, shattered shields. You hold the axe of a fallen foe. Worn and dented, it will suit it's purpose. What lies ahead is still a mystery, your goal is not. To save your people you must find the Great Temple of the Gods, but do not expect a warm welcome.Behind you lies a trail of broken helms, shattered shields. You hold the axe of a fallen foe. Worn and dented, it will suit it's purpose. What lies ahead is still a mystery, your goal is not. To save your people you must find the Great Temple of the Gods, but do not expect a warm welcome.Prepare to be met by a world set against you. In Song of Iron, man, monster and nature itself will try to stop you. Fight through it all in this gritty adventure where combat is intense, visceral and dangerous. Use bow, axe and shield to fight back but take care, weapons can be lost, arrows will run out and shields will be broken. With the blood of your ancestors and valor regained along the way you can fight on!Explore your ancient, and mysterious homeland as you journey through forests, into caves and climb mountains as you seek vengeance. Keep your eyes peeled, danger is all around you and when a fight is too big you may need to find a subtler way to pass foes.… Expand"
  },
  {
    "name": "Where the Heart Leads",
    "details_link": "https://www.metacritic.com/game/playstation-5/where-the-heart-leads",
    "publisher": "Armature Studio",
    "release_date": "Jul 13 2021",
    "developers": [
      "Armature Studio"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/7/1a0deea3675b93ba5807471d9f4aa582-98.jpg",
    "descriptions": "On the kind of stormy night that can change a person’s destiny, an enormous sinkhole opens in the middle of Whit Anderson’s farm. Braving the rumbling thunder and the driving rain, Casey—their curious Golden Retriever—ventures too close to the gaping maw and tumbles in. Desperate to saveOn the kind of stormy night that can change a person’s destiny, an enormous sinkhole opens in the middle of Whit Anderson’s farm. Braving the rumbling thunder and the driving rain, Casey—their curious Golden Retriever—ventures too close to the gaping maw and tumbles in. Desperate to save her, Whit descends into the darkness, and emerges in a realm beyond his imagining. In this strange world, constantly shifting like the stops and starts of a dream, Whit bears witness to the story of his life and gains the power to change it.\r… Expand"
  },
  {
    "name": "Beyond Blue",
    "details_link": "https://www.metacritic.com/game/xbox-one/beyond-blue",
    "publisher": "E-Line Media",
    "release_date": "Jun 11 2020",
    "developers": [
      "E-Line Media"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Adventure",
      "General",
      "3D",
      "Third-Person"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/3/8be2e8a8a64b742f2e6344ffafeec4e4-98.jpg",
    "descriptions": "Beyond Blue takes players into the near future, where they will have the opportunity to explore the mysteries of our ocean through the eyes of Mirai, a deep-sea explorer and scientist. She and her newly-formed research team will use groundbreaking technologies to see, hear, and interact withBeyond Blue takes players into the near future, where they will have the opportunity to explore the mysteries of our ocean through the eyes of Mirai, a deep-sea explorer and scientist. She and her newly-formed research team will use groundbreaking technologies to see, hear, and interact with the ocean in a more meaningful way than has ever been attempted. The game features an evocative narrative and exploration of an untouched world. Embracing the same inclusive development process that was used to create Never Alone (Kisima Ingitchuna), E-Line’s BAFTA award-winning game about Alaska Native culture, the company partnered with BBC Studios (developers of the acclaimed Blue Planet II), OceanX Media, world-class game makers, and some of science’s leading ocean experts to craft an experience that reflects the awesome wonder and unbounded mystery that infuses our planet’s beating blue heart.… Expand"
  },
  {
    "name": "Leisure Suit Larry: Wet Dreams Don't Dry",
    "details_link": "https://www.metacritic.com/game/playstation-4/leisure-suit-larry-wet-dreams-dont-dry",
    "publisher": "Assemble Entertainment",
    "release_date": "Jun 19 2019",
    "developers": [
      "CrazyBunch"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 71,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/8/d10b6a482b56ac3e79d4af36d8b3e4b9-98.jpg",
    "descriptions": "Larry’s new adventure takes him — whatever the route or twist of fate — from the end of the ’80s directly into the 21st century and wow, how the world has changed!"
  },
  {
    "name": "Earth Atlantis",
    "details_link": "https://www.metacritic.com/game/switch/earth-atlantis",
    "publisher": "Headup Games",
    "release_date": "Oct  5 2017",
    "developers": [
      "Pixel Perfex"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shoot-'Em-Up",
      "Horizontal"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/7/4e9e1cb8f4f4b5dd49b453a15d80312d-98.jpg",
    "descriptions": "Earth Atlantis is a side-scrolling shooter with an original \"Monster-Hunting\" gameplay. Search and hunt down dreadful sea monsters and explore the post-apocalyptic underwater world. Unlock multiple ships with special weapons and abilities for your journey and become a legendary hunter. [Nintendo]"
  },
  {
    "name": "Zeit Squared",
    "details_link": "https://www.metacritic.com/game/xbox-360/zeit-squared",
    "publisher": "Ubisoft",
    "release_date": "Jan 12 2011",
    "developers": [
      "Brightside Games"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "1-6 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Scrolling",
      "Scrolling",
      "Shoot-'Em-Up",
      "Vertical"
    ],
    "meta_score": 71,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/4/f1b1011f8da6bceae7060281fc817538-98.jpg",
    "descriptions": "Zeit 2 brings real innovation to the genre of shoot-'em-ups. Its time-travel feature has yet to be seen in this genre after decades of brilliant games. Get the side-scrolling arcade action and discover how you can assist yourself in many exciting ways by traveling back in time! Blast awayZeit 2 brings real innovation to the genre of shoot-'em-ups. Its time-travel feature has yet to be seen in this genre after decades of brilliant games. Get the side-scrolling arcade action and discover how you can assist yourself in many exciting ways by traveling back in time! Blast away the enemies like you never could before! … Expand"
  },
  {
    "name": "Legend of Mana Remastered",
    "details_link": "https://www.metacritic.com/game/switch/legend-of-mana-remastered",
    "publisher": "Square Enix",
    "release_date": "Jun 24 2021",
    "developers": [
      "Square Enix",
      "M2"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 71,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/8/3cbcc761059ed204f4a839827c7a3699-98.jpg",
    "descriptions": "Create your World. In ancient times, the world was saved from destruction by sealing locations and events within magical artifacts.\rNow, you have the chance to recreate this world as you desire by discovering artifacts, placing them, and exploring the mysteries inside. \r\r> Construct aCreate your World. In ancient times, the world was saved from destruction by sealing locations and events within magical artifacts.\rNow, you have the chance to recreate this world as you desire by discovering artifacts, placing them, and exploring the mysteries inside. \r\r> Construct a unique world map and story by carefully placing artifacts \r> Explore areas in any order, encountering nearly 70 different gameplay scenarios \r> Battle enemies in real-time with special attacks and customizable controls \r> Control every aspect of your new world: raise faithful pet monsters, create powerful golems, forge mighty weapons, and refine magical instruments\r> Adventure with a friend by having tyem importing their Legend of Mana character from a MEMORY CARD, or take control of an NPC… Expand"
  },
  {
    "name": "Retro City Rampage",
    "details_link": "https://www.metacritic.com/game/pc/retro-city-rampage",
    "publisher": "Vblank Entertainment Inc.",
    "release_date": "Oct  9 2012",
    "developers": [
      "Vblank Entertainment Inc."
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation Vita",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Action Adventure",
      "Adventure",
      "3D",
      "Open-World",
      "Modern",
      "Third-Person",
      "Modern"
    ],
    "meta_score": 71,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/1/b7ba034577b6b1eb37b46cdd6450ecbc-98.jpg",
    "descriptions": "A parody of the open-world action genre, Retro City Rampage takes modern game mechanics and mashes them into an authentic 8-bit experience. It's one half fast paced arcade game, the other half a hilarious story mode! It's all the driving and shooting you'd expect and a whole lot more! WithA parody of the open-world action genre, Retro City Rampage takes modern game mechanics and mashes them into an authentic 8-bit experience. It's one half fast paced arcade game, the other half a hilarious story mode! It's all the driving and shooting you'd expect and a whole lot more! With missions that twist pages straight from classic game experiences, you get to re-live and rewrite history in a way only a modern anti-hero could! When it comes to enemies, weapons are only the beginning! Put on your boots and jump on their heads! Toss 'em around to knock the rest down! Become truly unstoppable with awesome power-ups! Through its world, characters and missions, Retro City Rampage lampoons the entire 8-bit era from its games to the TV, movies and pop culture!… Expand"
  },
  {
    "name": "Cozy Grove",
    "details_link": "https://www.metacritic.com/game/switch/cozy-grove",
    "publisher": "The Quantum Astrophysicists Guild",
    "release_date": "Apr  8 2021",
    "developers": [
      "Spry Fox"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Adventure",
      "General",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 71,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/9/074c42b4493ea82d417817cd44d2de7c-98.jpg",
    "descriptions": "Welcome to Cozy Grove, a life-sim game about camping on a haunted, ever-changing island. As a Spirit Scout, you'll wander the island's forest each day, finding new hidden secrets and helping soothe the local ghosts. With a little time and a lot of crafting, you'll bring color and joy back toWelcome to Cozy Grove, a life-sim game about camping on a haunted, ever-changing island. As a Spirit Scout, you'll wander the island's forest each day, finding new hidden secrets and helping soothe the local ghosts. With a little time and a lot of crafting, you'll bring color and joy back to Cozy Grove!Features:* Beautiful, dynamic, hand-drawn landscapes that come alive when you help a spirit in need.* Dozens of memorable characters and spirits for you to find and befriend. Each spirit has a unique, extensive story for you to unravel over time.* Collect spirit animals, craft decorations, go fishing and more!* 40+ hour campaign filled with side quests, designed to span months of playtime.… Expand"
  },
  {
    "name": "Lake",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/lake",
    "publisher": "Whitethorn Digital",
    "release_date": "Sep  1 2021",
    "developers": [
      "Gamious"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/7/24230e28d258f88a9096ba93074a009b-98.jpg",
    "descriptions": "It's 1986 - Meredith Weiss takes a break from her career in the big city to deliver mail in her hometown. How will she experience two weeks in beautiful Providence Oaks, with its iconic lake and quirky community? And what will she do next? It's up to you."
  },
  {
    "name": "Runbow",
    "details_link": "https://www.metacritic.com/game/playstation-4/runbow",
    "publisher": "Headup Games",
    "release_date": "Jul  3 2018",
    "developers": [
      "13AM Games"
    ],
    "platforms": [
      "3DS",
      "PC",
      "Switch",
      "Wii U",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 9 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 5.1,
    "image": "https://static.metacritic.com/images/products/games/7/2e5dcfa51d31af9bba8ce6ef2dabc79d-98.jpg",
    "descriptions": "Runbow Pocket takes all the fun colorful chaos of Runbow on Wii U and brings it to New Nintendo 3DS. Master Adventure, Bowhemoth, and Satura's Space Adventure on your own, or play head to head with friends over local ad hoc networking. Players can also create StreetPass cards to share funRunbow Pocket takes all the fun colorful chaos of Runbow on Wii U and brings it to New Nintendo 3DS. Master Adventure, Bowhemoth, and Satura's Space Adventure on your own, or play head to head with friends over local ad hoc networking. Players can also create StreetPass cards to share fun stats with friends.\r Key Gameplay Features:\r -The world changes with each swipe of color so players have to think fast to beat hundreds of platforming challenges.\r-Tons of unlockable costumes and content, as well as 19 guest characters from other developers.\r-Brand new Guest Character, Shantae, from WayForward's Shantae series. Shantae will also be available in the Wii U version of Runbow.\r-All the content of Runbow, hundreds of levels, right in the palm of your hand.\r-Create a StreetPass card to share stats, titles, and your personal best times with anyone else playing Runbow Pocket.… Expand"
  },
  {
    "name": "The Fall of the Dungeon Guardians",
    "details_link": "https://www.metacritic.com/game/pc/the-fall-of-the-dungeon-guardians",
    "publisher": "Mana Games",
    "release_date": "Nov  6 2015",
    "developers": [
      "Mana Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Western-Style"
    ],
    "meta_score": 71,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/2/713f08f0accb2a6da2ea89682ac85f2f-98.jpg",
    "descriptions": "Enter a massive dungeon, full of danger, mystery and secrets. Fight your way through hordes of enemies and powerful creatures. Solve puzzles, avoid deadly traps, uncover hidden passages, and keep your bearing through mazes & hallways."
  },
  {
    "name": "Asura's Wrath",
    "details_link": "https://www.metacritic.com/game/playstation-3/asuras-wrath",
    "publisher": "Capcom",
    "release_date": "Feb 21 2012",
    "developers": [
      "CyberConnect2"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 71,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/7/a1bec02dc16f5283e741a8c44fc6289a-98.jpg",
    "descriptions": "Once a revered deity, Asura was betrayed by his fellow gods and stripped of all his powers. Consumed by anger at the injustice he has suffered and swearing vengeance, Asura discovers he can use this fury to his advantage and turn it against his enemies. By channelling his inner rage, AsuraOnce a revered deity, Asura was betrayed by his fellow gods and stripped of all his powers. Consumed by anger at the injustice he has suffered and swearing vengeance, Asura discovers he can use this fury to his advantage and turn it against his enemies. By channelling his inner rage, Asura is now able to unleash devastating attacks and wreak havoc as he battles against the deities who have wronged him and their earthly forces. Inspired by episodic dramas, Asura's Wrath will be split into distinct sections with gameplay and narrative unfolding as one and building to a final climatic conclusion.… Expand"
  },
  {
    "name": "SBK-09 Superbike World Championship",
    "details_link": "https://www.metacritic.com/game/playstation-3/sbk-09-superbike-world-championship",
    "publisher": "Valcon Games",
    "release_date": "Jun 18 2010",
    "developers": [
      "Milestone S.r.l"
    ],
    "platforms": "PlayStation 3",
    "num_players": "Up to 8 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Motorcycle",
      "Automobile",
      "Street",
      "Street"
    ],
    "meta_score": 71,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/9/db57e3a1825c98d9cc62bde9877e5002-98.jpg",
    "descriptions": "SBK 09 is the official game of the Superbike World Championship, featuring all the teams and all the motorbikes competing for the title. Experience the ultimate motorbike challenge in videogames - this is not just another racing game, but a realistic simulation of the championship and allSBK 09 is the official game of the Superbike World Championship, featuring all the teams and all the motorbikes competing for the title. Experience the ultimate motorbike challenge in videogames - this is not just another racing game, but a realistic simulation of the championship and all its aspects - from the Paddock to the garage to the track. [Codemasters]… Expand"
  },
  {
    "name": "Song of the Deep",
    "details_link": "https://www.metacritic.com/game/pc/song-of-the-deep",
    "publisher": "Insomniac Games",
    "release_date": "Jul 12 2016",
    "developers": [
      "Insomniac Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/6/43a73d7651d0bfcc309c120578933452-98.jpg",
    "descriptions": "In this game you’ll explore a huge undersea world, both free-diving and in a submarine. It’s a metroidvania style of progression where you are constantly getting new abilities and figuring out ways to upgrade them as you take on the seemingly impossible obstacles that stand in your way. It’sIn this game you’ll explore a huge undersea world, both free-diving and in a submarine. It’s a metroidvania style of progression where you are constantly getting new abilities and figuring out ways to upgrade them as you take on the seemingly impossible obstacles that stand in your way. It’s a challenging journey, designed to test your mind and your reflexes in equal amounts. [Insomniac]… Expand"
  },
  {
    "name": "Call of Duty: Advanced Warfare - Supremacy",
    "details_link": "https://www.metacritic.com/game/xbox-one/call-of-duty-advanced-warfare---supremacy",
    "publisher": "Activision",
    "release_date": "Jun  2 2015",
    "platforms": [
      "Xbox 360",
      "Xbox One"
    ],
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 5.9,
    "image": "https://static.metacritic.com/images/products/games/5/9a565b1769f6d0c6721fdba22218b6e4-98.jpg",
    "descriptions": "Battle your way to Supremacy, the third downloadable content pack for Call of Duty: Advanced Warfare: - Four iconic locations take the fierce MP competition around the world from the Atlas training grounds to Russia, England and Greece. - The Exo Grapple Playlist returns with its strategicBattle your way to Supremacy, the third downloadable content pack for Call of Duty: Advanced Warfare: - Four iconic locations take the fierce MP competition around the world from the Atlas training grounds to Russia, England and Greece. - The Exo Grapple Playlist returns with its strategic movement capability and deadly grapple secondary weapon. - Part Three of the Exo Zombies saga: Carrier introduces a new celebrity playable character, devastating advanced weaponry, Atlas strike teams, Sentinel support squads and a host of new zombie enemies.… Expand"
  },
  {
    "name": "Lords of the Fallen",
    "details_link": "https://www.metacritic.com/game/xbox-one/lords-of-the-fallen",
    "publisher": "City Interactive",
    "release_date": "Oct 28 2014",
    "developers": [
      "City Interactive",
      "Deck 13"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 71,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/1/84a55f560e8cbff06585a8c8103593c8-98.jpg",
    "descriptions": "Lords of the Fallen is a hardcore action-RPG featuring an advanced combat systems and robust class skill trees. Set in a richly created fantasy world where the Gods have failed mankind, players will take on the role of a human named Harkyn who sets out on a quest to stand against anLords of the Fallen is a hardcore action-RPG featuring an advanced combat systems and robust class skill trees. Set in a richly created fantasy world where the Gods have failed mankind, players will take on the role of a human named Harkyn who sets out on a quest to stand against an apparently unstoppable supernatural force. Players travel across a world that is deeply dived by those that follow and others that resist, the Fallen God. Along their journey they will be faced with a series of decisions that will alter both the world and their character thus dramatically impacting the storyline.… Expand"
  },
  {
    "name": "Toukiden: The Age of Demons",
    "details_link": "https://www.metacritic.com/game/playstation-vita/toukiden-the-age-of-demons",
    "publisher": "Tecmo Koei America Corp.",
    "release_date": "Feb 11 2014",
    "developers": [
      "Omega Force"
    ],
    "platforms": "PlayStation Vita",
    "num_players": "Up to 4 ",
    "genres": [
      "General",
      "Action",
      "General"
    ],
    "meta_score": 71,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/9/95c048f04547398dac429a0619f835db-98.jpg",
    "descriptions": "TOUKIDEN takes Tecmo Koei's expertise in historically themed games to an expansive fantasy world influenced by historical and traditional Japanese elements. Developed by the same studio that created the famed Dynasty Warriors series, this all-new franchise casts players in the role of aTOUKIDEN takes Tecmo Koei's expertise in historically themed games to an expansive fantasy world influenced by historical and traditional Japanese elements. Developed by the same studio that created the famed Dynasty Warriors series, this all-new franchise casts players in the role of a demon-fighting Slayer. Starting from the Utakata Village headquarters where they will accept quests, players will venture out to battle monstrous and deadly Oni (demons) before they destroy all of humanity.… Expand"
  },
  {
    "name": "The Escapists",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-escapists",
    "publisher": "Team17",
    "release_date": "Jun  2 2015",
    "developers": [
      "Mouldy Toof Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 71,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/5/8277cb052a10d61e09f41d9d945da3ba-98.jpg",
    "descriptions": "The Escapists is an award winning prison break simulation that provides players the opportunity of experiencing a light-hearted insight into everyday prison life. Whilst the aim of the game is simply to escape, the detail is in the execution. (Dont say the word execution too loud in aThe Escapists is an award winning prison break simulation that provides players the opportunity of experiencing a light-hearted insight into everyday prison life. Whilst the aim of the game is simply to escape, the detail is in the execution. (Dont say the word execution too loud in a prison). You may not be in an open prison, but you are in an open world where in between attending rollcalls, mealtimes and doing your chores you should grab every chance to plan your escape. Do you do favours for other inmates earning money and boosting their opinion of you along the way? Or workout and become stronger? Read to increase your skills or spend your time crafting items into homemade weapons and tools. What about working diligently in your prison job, to gain promotions to new jobs with better benefits? Keep a low profile or go out all guns blazing, as long as you escape in the end, thats all that matters The downloadable version of this game supports English, French, German, Spanish, Polish, Russian.… Expand"
  },
  {
    "name": "Circus Electrique",
    "details_link": "https://www.metacritic.com/game/pc/circus-electrique",
    "publisher": "Saber Interactive",
    "release_date": "Sep  6 2022",
    "developers": [
      "Zen Studios"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General",
      "Tactics"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/6/c3f7a55fd225732c573a2c83ce1d4d21-98.jpg",
    "descriptions": "When everyday Londoners mysteriously turn into vicious killers, only the circus' lineup of Strongmen, Fire Blowers, Clowns and other performers possess the unique talents necessary to save the city. Circus Electrique is part story-driven RPG, part tactics, part circus management, andWhen everyday Londoners mysteriously turn into vicious killers, only the circus' lineup of Strongmen, Fire Blowers, Clowns and other performers possess the unique talents necessary to save the city. Circus Electrique is part story-driven RPG, part tactics, part circus management, and completely enthralling - all with a steampunk twist. Through tactical turn-based battles, these unlikely heroes face Bobbies, British Sailors gone bad, aggressive Posh Girls, and other Victorian-era archetypes stand in their way - not to mention the occasional menacing Mime or Robobear. The game's innovative Devotion morale system affects characters' performance not only in battles, but also for actual circus shows, dutifully managed between heroic jaunts through six sprawling districts.… Expand"
  },
  {
    "name": "Pac-Man World: Re-PAC",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/pac-man-world-re-pac",
    "publisher": "Bandai Namco Games",
    "release_date": "Aug 26 2022",
    "developers": [
      "Bandai Namco Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/7/a4a2b781cd796bdfbb6cd4cbb8e6e065-98.jpg",
    "descriptions": "Feed Your Appetite for Adventure. In Pac-Man World Re-Pac, Pac-Man arrives home on his birthday to find the Ghosts have kidnapped Pac-Man’s family & friends and ruined his party. Pac-Man must set out to adventure through the six areas of Ghost Island to rescue his family and friends, andFeed Your Appetite for Adventure. In Pac-Man World Re-Pac, Pac-Man arrives home on his birthday to find the Ghosts have kidnapped Pac-Man’s family & friends and ruined his party. Pac-Man must set out to adventure through the six areas of Ghost Island to rescue his family and friends, and face-off against the Ghosts’ boss, Toc-Man. With polished graphics, enhanced gameplay, and updated features – Pac-Man World Re-Pac is action/platforming fun for both experienced Pac-fans and new Pac-thusiasts the world over.… Expand"
  },
  {
    "name": "Button City",
    "details_link": "https://www.metacritic.com/game/switch/button-city",
    "publisher": "Subliminal",
    "release_date": "Aug 10 2021",
    "developers": [
      "Subliminal"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/6/098de9c1f9f21682a0ffcf132004da12-98.jpg",
    "descriptions": "Button City is a colorful low poly narrative adventure game about a fox and his friends banding together to save their local arcade! Explore a diorama world, play exciting arcade games, complete quirky quests and meet cute animal friends."
  },
  {
    "name": "Mantis Burn Racing",
    "details_link": "https://www.metacritic.com/game/playstation-4/mantis-burn-racing",
    "publisher": "VooFoo Studios",
    "release_date": "Oct 12 2016",
    "developers": [
      "VooFoo Studios"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 71,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/2/da83c4430823fa43ce99c2612b2e27c2-98.jpg",
    "descriptions": "Mantis Burn Racing is an arcade style top-down racer with stunning visuals, a comprehensive single-player career mode, and a deep, RPG-style upgrade system. [VooFoo Studios]"
  },
  {
    "name": "Fenix Furia",
    "details_link": "https://www.metacritic.com/game/playstation-4/fenix-furia",
    "publisher": "Green Lava Studios",
    "release_date": "Jun  7 2016",
    "developers": [
      "Green Lava Studios"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/7/69b8f67aef362f46bb6eeb1ac848e8a8-98.jpg",
    "descriptions": "Fenix Rage is a stylish, aggravatingly addictive 2D platformer that will have gamers exclaim in frustration and exult in victory as they navigate through hundreds of palm-sweating levels to reachâ€¦ a cookie?! Best played with patience and a glass of milk."
  },
  {
    "name": "The Walking Dead: The Telltale Series - A New Frontier Episode 4: Thicker than Water",
    "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-the-telltale-series---a-new-frontier-episode-4-thicker-than-water",
    "publisher": "Telltale Games",
    "release_date": "Apr 25 2017",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 71,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/0/c14b191437a6c4042d80028539bb7033-98.jpg",
    "descriptions": "The latest chapter continues to follow Javier and Clementine’s journeys through the zombie apocalypse."
  },
  {
    "name": "Shadow Warrior 3",
    "details_link": "https://www.metacritic.com/game/pc/shadow-warrior-3",
    "publisher": "Devolver Digital",
    "release_date": "Mar  1 2022",
    "developers": [
      "Flying Wild Hog"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/8/1e2b34f3ccf17b53d42ffd94c01815f3-98.jpg",
    "descriptions": "Shadow Warrior 3 launches the offbeat first-person shooter series to the next level with a seamless blend of fast-paced gunplay, razor-sharp melee combat, and a spectacular free-running movement system. Fallen corporate shogun Lo Wang and his former employer turned nemesis turned sidekickShadow Warrior 3 launches the offbeat first-person shooter series to the next level with a seamless blend of fast-paced gunplay, razor-sharp melee combat, and a spectacular free-running movement system. Fallen corporate shogun Lo Wang and his former employer turned nemesis turned sidekick Orochi Zilla embark on an improbable mission to recapture an ancient dragon they unwillingly unleashed from its eternal prison. Armed with a punishing mix of blades and bullets, Lo Wang must traverse uncharted parts of the world to track down the dark beast and push the apocalypse back yet again. All it will take is the mask of a dead god, a dragon's egg, a touch of magic, and enough firepower to hold off the impending cataclysm. Bring a Katana to a Gunfight. Conduct a symphony of death with each encounter by mixing overwhelming firepower with devastatingly precise katana strikes as you dash in and around the demonic hordes.\r Fancy Footwork\rFlow between nimble movement techniques including air dashes, wall running, double jumps, and the fancy new grappling hook busts your combat and movement options wide open in every battle.\r Execute Then Annihilate\rExecute spectacular finishing moves to claim a piece of your conquered foe and unleash its powers back on the horde in a burst of unstoppable fury and powerful magic.\r Dynamic Combat Arenas\rEach environment is lined with hazardous structures and devices that can be activated to add another layer of creative choice to the offensive strategy.\r Neo Feudal Japan\rTrek across a mythic Asian land infused with the magic and technology of ancient samurai, now overrun by the demonic yokai from Japanese folklore.\r Funny Business\rBrace for expertly delivered one-liners from Lo Wang, pointed banter with Zilla, and an intense thrill ride of absurd predicaments on the way to turning doomsday into a new day.… Expand"
  },
  {
    "name": "Worms 4: Mayhem",
    "details_link": "https://www.metacritic.com/game/pc/worms-4-mayhem",
    "publisher": "Majesco Games",
    "release_date": "Oct  4 2005",
    "developers": [
      "Team17"
    ],
    "platforms": "PC",
    "num_players": "4  Online",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy",
      "Fantasy",
      "Artillery"
    ],
    "meta_score": 71,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/f2ea2e2ccde09a3ee38614e302cadbb7-98.jpg",
    "descriptions": "The multiplayer mayhem and single-player shenanigans are spread over five themed zones - Jurassic, Camelot, Arabian, Construction and Wild West – and, throughout the enlarged landscapes, the entirely destructible scenery works with even greater effect, along with the much-loved worms'The multiplayer mayhem and single-player shenanigans are spread over five themed zones - Jurassic, Camelot, Arabian, Construction and Wild West – and, throughout the enlarged landscapes, the entirely destructible scenery works with even greater effect, along with the much-loved worms' armoury - now with an even bigger choices of weapons and fun along the way. In single-player modes there’s even more beyond the day-to-day business of destroying worms. Through the 25 missions, you’re also charged with objectives such as recovering items or smashing scenery. All the single-player maps are available to play in multiplayer mode, along with a further set of 20 multiplayer-specific maps. With bold levels, an improved 3D camera and animation system, a stunning arsenal delivering comedy kabooms, the loveable, customisable, yet entirely destructible, worms are back in force with Worms 4: Mayhem. [Codemasters]… Expand"
  },
  {
    "name": "Elven Legacy",
    "details_link": "https://www.metacritic.com/game/pc/elven-legacy",
    "publisher": "Paradox Interactive",
    "release_date": "Apr  7 2009",
    "developers": [
      "1C:Ino-Co"
    ],
    "platforms": "PC",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 71,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/7/589476e3c032154a8a8bd2bcd1fa4150-98.jpg",
    "descriptions": "Elven Legacy, the sequel to Fantasy Wars, delivers a world filled with magic and thrilling nonlinear storyline, gauged to provide many hours of gameplay for strategy fans. Through an epic quest aimed to restore the former glory of the Elven race the game offers both depth and scope, all inElven Legacy, the sequel to Fantasy Wars, delivers a world filled with magic and thrilling nonlinear storyline, gauged to provide many hours of gameplay for strategy fans. Through an epic quest aimed to restore the former glory of the Elven race the game offers both depth and scope, all in colorful and inspirational settings. Play for elves or humans in two primary campaigns or for orcs in a wide variety of bonus missions. Using the accompanying tools players may create their own missions and campaigns and share them in multiplayer mode. [1C Company]… Expand"
  },
  {
    "name": "LEGO Marvel's Avengers",
    "details_link": "https://www.metacritic.com/game/playstation-4/lego-marvels-avengers",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Jan 26 2016",
    "developers": [
      "TT Games"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Wii U",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/8/0205375de3bb67746bd77931d042ef6c-98.jpg",
    "descriptions": "Avengers Assemble!  Experience the first console videogame featuring characters and storylines from the blockbuster film Marvel’s The Avengers and the much anticipated sequel Marvel’s Avengers: Age of Ultron, and more. Play as the most powerful Super Heroes in their quest to save humanity."
  },
  {
    "name": "Mutant Year Zero: Road to Eden - Seed of Evil",
    "details_link": "https://www.metacritic.com/game/pc/mutant-year-zero-road-to-eden---seed-of-evil",
    "publisher": "Funcom",
    "release_date": "Jul 30 2019",
    "developers": [
      "The Bearded Ladies Consulting"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Strategy",
      "Turn-Based",
      "Tactics"
    ],
    "meta_score": 71,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/98w-game.jpg",
    "descriptions": "See what happens after the ending of Mutant Year Zero: Road to Eden. Continue into a new future for Bormin, Dux, Pripp and all the others at the Ark. How will they deal with what they have learned?"
  },
  {
    "name": "Brian Lara International Cricket 2007",
    "details_link": "https://www.metacritic.com/game/pc/brian-lara-international-cricket-2007",
    "publisher": "Codemasters",
    "release_date": "Mar 23 2007",
    "developers": [
      "Codemasters"
    ],
    "platforms": "PC",
    "genres": [
      "Sports",
      "Alternative",
      "Team",
      "Cricket",
      "Cricket"
    ],
    "meta_score": 71,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/b3288e46a96ebc9c310aab1e4cddde37-98.jpg",
    "descriptions": "(Also known as \"Ricky Ponting International Cricket 2007\")  Brian Lara International Cricket 2007 expands the series' trademark fluid, dynamic gameplay mechanics to deliver a thoroughly entertaining and competitive game that captures all the tension, skill and intensity of world-class(Also known as \"Ricky Ponting International Cricket 2007\")  Brian Lara International Cricket 2007 expands the series' trademark fluid, dynamic gameplay mechanics to deliver a thoroughly entertaining and competitive game that captures all the tension, skill and intensity of world-class international cricket. Thanks to the official ICC Cricket World Cup 2007 content, Brian Lara International Cricket 2007 features licensed players, including world cricket stars Andrew Flintoff, Ricky Ponting, Mahendra Dhoni, Muttiah Muralitharan and of course, Brian Lara himself. In addition to players, the game leads with a dedicated ICC Cricket World Cup 2007 mode featuring all the official teams, stadia, kits and equipment of the tournament. Further modes include a fully licensed ICC Champions' Trophy competition and exhibition matches including One Day Games, Test Matches and exciting 20-over run fests. When you want to get competitive for real, Brian Lara International Cricket 2007 will deliver with online competitive play on PC (LAN and online) and Xbox Live. BLIC 2007 adds extra depth to the series' complete batting, bowling and fielding experience whilst retaining its trademark accessible playability. The batting play sees the introduction of subtle edges, sweepshots and the ability to use your feet to dance down wicket and smash the ball over the boundary for six. Bowling sees an improved set of delivery types, thanks to changes in the way the ball swings in the air and reacts off the pitch, showcasing Shane Warne's huge variation of spinning deliveries and Steve Harmison's raw pace and even reverse swing as the ball degrades. In Fielding, there's a new reflex-testing slip catch system and players can now be run out at both ends and be stumped by alert wicket keepers. [Codemasters]… Expand"
  },
  {
    "name": "Conflict: Desert Storm II - Back to Baghdad",
    "details_link": "https://www.metacritic.com/game/xbox/conflict-desert-storm-ii---back-to-baghdad",
    "publisher": "Gotham Games",
    "release_date": "Oct  4 2003",
    "developers": [
      "Pivotal Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Tactical",
      "Modern"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/7/992f27cdac73f94e328b3aeb35f3e4fb-98.jpg",
    "descriptions": "At the height of the 1991 Gulf War, 300 klicks into the heart of Iraq, you must command your squad of Special Forces operatives to strike at Iraq's evil dictator and his fascist regime.  Armed with an authentic arsenal of high-tech weapons and vehicles, your squad will face impossible oddsAt the height of the 1991 Gulf War, 300 klicks into the heart of Iraq, you must command your squad of Special Forces operatives to strike at Iraq's evil dictator and his fascist regime.  Armed with an authentic arsenal of high-tech weapons and vehicles, your squad will face impossible odds in this battle against tyranny.  Only strategy and skill will ensure your survival through frantic firefights, gut-wrenching vehicular combat, and gripping stealth operations.  \"The Mother of All Battles\" is coming to your console in Conflict: Desert Storm II--Back to Baghdad.… Expand"
  },
  {
    "name": "Industry Giant II",
    "details_link": "https://www.metacritic.com/game/pc/industry-giant-ii",
    "publisher": "JoWooD Entertainment AG",
    "release_date": "Sep  2 2002",
    "developers": [
      "JoWooD Entertainment AG"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Tycoon",
      "Management",
      "Business / Tycoon"
    ],
    "meta_score": 71,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/5/c0e3f902dc39ac06436175ed17d8a4c3-98.jpg",
    "descriptions": "This brand-new business simulation starts in America at the dawn of the 20th century. Trade and economy range from the rise of industrial mass production to the age of information technologies. [JoWood]"
  },
  {
    "name": "RedCard 20-03",
    "details_link": "https://www.metacritic.com/game/gamecube/redcard-20-03",
    "publisher": "Midway",
    "release_date": "Jun 24 2002",
    "developers": [
      "Point of View"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Soccer",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/2/8acbc7c6cdae35f440d7fe2daf7bc7a5-98.jpg",
    "descriptions": "Redcard 20-03 shows why soccer really is a contact sport with over-the-top kicks, scores, celebrations, and tackles. In this combination of fast-paced soccer and authentic gameplay, 50 international teams compete for the Cup Championship. You can play as fantasy teams, such as Martians,Redcard 20-03 shows why soccer really is a contact sport with over-the-top kicks, scores, celebrations, and tackles. In this combination of fast-paced soccer and authentic gameplay, 50 international teams compete for the Cup Championship. You can play as fantasy teams, such as Martians, Ninjas, Matadors, and Apes, or you can create your own superteam. Take your team through various modes--including Friendly, Party, World Conquest, and Finals--and increase your players' turbo power by collecting boost points. … Expand"
  },
  {
    "name": "ZooCube",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/zoocube",
    "publisher": "Acclaim",
    "release_date": "May 14 2002",
    "developers": [
      "PuzzleKings"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "General"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/1/1eda8bd34f09b142dc9c9745e55ac1a5-98.jpg",
    "descriptions": "ZooCube tests your reflexes with fast-paced puzzle action. Simple to learn, but tough to master, ZooCube features a variety of 3D puzzles that you can solve by yourself or cooperatively with a friend. You can even challenge your friend in head-to-head multiplayer mode or try out 11 otherZooCube tests your reflexes with fast-paced puzzle action. Simple to learn, but tough to master, ZooCube features a variety of 3D puzzles that you can solve by yourself or cooperatively with a friend. You can even challenge your friend in head-to-head multiplayer mode or try out 11 other different modes. In this intense puzzle experience, you must rotate the puzzles and collect special power-ups and bonuses to keep the action going.… Expand"
  },
  {
    "name": "NCAA March Madness 2001",
    "details_link": "https://www.metacritic.com/game/playstation/ncaa-march-madness-2001",
    "publisher": "EA Sports",
    "release_date": "Dec  6 2000",
    "developers": [
      "Black Ops Entertainment"
    ],
    "platforms": "PlayStation",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Sim"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/8/40210f654b2f0a186f4af61be5721421-98.jpg",
    "descriptions": "EA added the new coach mode and polished an already stellar game into the best college hoops simulation for the PlayStation."
  },
  {
    "name": "Mickey's Speedway USA",
    "details_link": "https://www.metacritic.com/game/nintendo-64/mickeys-speedway-usa",
    "publisher": "Nintendo",
    "release_date": "Nov 13 2000",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Nintendo 64",
    "genres": [
      "Driving",
      "Racing",
      "Kart"
    ],
    "meta_score": 71,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/9/03cd498695f51c58e3ddc53853cbd604-98.jpg",
    "descriptions": "Buckle up and get ready to race! Rally across America with Mickey and friends! Race around 20 All-American courses - from Alaska to the Everglades - as you try to track down the Weasels and rescue poor dognapped Pluto. Use Ludwig Von Drake's wacky weapons - such as the \"Antigrav-o-KitBuckle up and get ready to race! Rally across America with Mickey and friends! Race around 20 All-American courses - from Alaska to the Everglades - as you try to track down the Weasels and rescue poor dognapped Pluto. Use Ludwig Von Drake's wacky weapons - such as the \"Antigrav-o-Kit Magno Flyer\" or the \"Stormy Weather Whenever Engager\" - to give you the edge. Then blast past your friends and listen as the drivers taunt each other using Disney's original character voices!… Expand"
  },
  {
    "name": "Shinobi",
    "details_link": "https://www.metacritic.com/game/playstation-2/shinobi",
    "publisher": "Sega",
    "release_date": "Nov 10 2002",
    "developers": [
      "Overworks"
    ],
    "platforms": [
      "Switch",
      "Xbox 360",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 71,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/4/e576971e1051d9ca6e2b2dcf2068adf8-98.jpg",
    "descriptions": "Left to avenge his Clan after a sinister force is awakened in Tokyo, Hotsuma must confront demons from his past and defend his role as Leader of the Oboro Clan. Drawing off the ancient traditions of Ninja magic, Hotsuma uses wall running, shuriken attacks, and the coveted Akujiki Sword toLeft to avenge his Clan after a sinister force is awakened in Tokyo, Hotsuma must confront demons from his past and defend his role as Leader of the Oboro Clan. Drawing off the ancient traditions of Ninja magic, Hotsuma uses wall running, shuriken attacks, and the coveted Akujiki Sword to fight the deadly masked foes that stalk him. With the special Stealth Dash technique, he creates ghost-like apparitions that confuse his enemies. He can then strike with a lightning-quick \"Tate\" in which his blade moves so fast the victims don't even realize they've been struck until they fall to their death. [Sega]… Expand"
  },
  {
    "name": "Battlefield 2: Euro Force",
    "details_link": "https://www.metacritic.com/game/pc/battlefield-2-euro-force",
    "publisher": "EA Games",
    "release_date": "Mar 15 2006",
    "developers": [
      "Digital Illusions"
    ],
    "platforms": "PC",
    "num_players": "64  Online",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Tactical",
      "Modern",
      "Modern"
    ],
    "meta_score": 71,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/3/a9564d0c85a1467cd8eb5cfea36d7a0b-98.jpg",
    "descriptions": "The battle expands in the first booster pack to 2005’s hit game Battlefield 2. Take the powerful new Euro Force into action against MEC and Chinese armies as you battle for control of all-new Asian locations. The action escalates to a fever pitch with the latest high-tech vehicles andThe battle expands in the first booster pack to 2005’s hit game Battlefield 2. Take the powerful new Euro Force into action against MEC and Chinese armies as you battle for control of all-new Asian locations. The action escalates to a fever pitch with the latest high-tech vehicles and weapons including attack helicopters, battle tanks, assault rifles, and much more. [Electronic Arts]… Expand"
  },
  {
    "name": "Death end re;Quest",
    "details_link": "https://www.metacritic.com/game/playstation-4/death-end-request",
    "publisher": "Idea Factory",
    "release_date": "Feb 19 2019",
    "developers": [
      "Compile Heart"
    ],
    "platforms": [
      "PC",
      "Switch",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 71,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/2/e247f469aad7eee9e8254c2dc3c1a154-98.jpg",
    "descriptions": "Jump between reality & in-game modes, as players will need to investigate in the real world to solve the mysterious inner-workings of the World Odyssey. Your decision can change the game's ending. In this turn-based command battle system, you can roam freely & duke it out with fearsomeJump between reality & in-game modes, as players will need to investigate in the real world to solve the mysterious inner-workings of the World Odyssey. Your decision can change the game's ending. In this turn-based command battle system, you can roam freely & duke it out with fearsome monsters. During battle, players can change the game's genre from a first-person shooter to a fighter game. … Expand"
  },
  {
    "name": "The Lost Crown: A Ghost-hunting Adventure",
    "details_link": "https://www.metacritic.com/game/pc/the-lost-crown-a-ghost-hunting-adventure",
    "publisher": "Got Game Entertainment",
    "release_date": "Mar  3 2008",
    "developers": [
      "Darkling Room"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Adventure",
      "Horror",
      "General",
      "Horror",
      "Survival"
    ],
    "meta_score": 71,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/8/20cc832198d8601a051bc3cdbdb76f96-98.jpg",
    "descriptions": "Nigel Danvers is on the run! Two shadowy agents are on his tail, pursuing him across London to the grand train station at Liverpool Street. Nigel suspects that afternoon’s activities may be to blame...Travel with Nigel Danvers to an eerie seaside town on England's east coast. Learn to useNigel Danvers is on the run! Two shadowy agents are on his tail, pursuing him across London to the grand train station at Liverpool Street. Nigel suspects that afternoon’s activities may be to blame...Travel with Nigel Danvers to an eerie seaside town on England's east coast. Learn to use advanced techniques used by real paranormal investigators, and uncover an ancient mystery and treasure. But, beware, not all of the towns residents will help in your mission, whether they are alive or dead. Inspiration from the haunting works of Charles Dickens, M.R. James, Arthur Conan Doyle, and E.F. Benson combines with real ghost-hunting gadgets to bring this frightening story to bone-chilling life. Success or failure in locating wandering spirits depends on your skill as an investigator. Placing motion detectors, night vision cameras, and temperature gauges correctly will reveal a location’s haunted past, and expose terrifying apparitions. With nerves of steel, and wits to match, you will soon discover long lost secrets, previously known only to the dead. [Got Game Entertainment]… Expand"
  },
  {
    "name": "This Is the Police",
    "details_link": "https://www.metacritic.com/game/xbox-one/this-is-the-police",
    "publisher": "THQ Nordic",
    "release_date": "Mar 22 2017",
    "developers": [
      "Weappy Studio",
      "THQ Nordic"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "genres": [
      "Simulation",
      "Virtual",
      "Virtual Life",
      "Career"
    ],
    "meta_score": 71,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/6/4e66ee19f46e108286c170a7c492d9a7-98.jpg",
    "descriptions": "This Is the Police is a strategy/adventure game set in a city spiraling the drain. Taking the role of gritty Police Chief Jack Boyd, you'll dive into a deep story of crime and intrigue. Will Jack reach his retirement with a nice stack of bills, or will he end up broken ... or worse?"
  },
  {
    "name": "Ultra Street Fighter IV",
    "details_link": "https://www.metacritic.com/game/playstation-4/ultra-street-fighter-iv",
    "publisher": "SCEA",
    "release_date": "May 26 2015",
    "developers": [
      "Other Ocean Interactive"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "PlayStation 4"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Fighting",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/5/7839e25c0ebc9b44df1892b64248cdb1-98.jpg",
    "descriptions": "All the characters, all the levels, and all of the DLC that have been launched thus far are be included in the PS4 version of the game."
  },
  {
    "name": "Puddle",
    "details_link": "https://www.metacritic.com/game/playstation-3/puddle",
    "publisher": "Konami",
    "release_date": "Jan 25 2012",
    "developers": [
      "Neko Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Wii U",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Logic",
      "Logic"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/1/eb551a835f35bc5c53518c5b0aba8933-98.jpg",
    "descriptions": "Experience a brilliantly designed physics-based puzzle/platform game where you must guide a puddle of fluid to its target destination, not by moving the fluid, but by tilting the game world. The player must work with friction, momentum, and the unique properties of each type of fluid andExperience a brilliantly designed physics-based puzzle/platform game where you must guide a puddle of fluid to its target destination, not by moving the fluid, but by tilting the game world. The player must work with friction, momentum, and the unique properties of each type of fluid and environment to send as much of each puddle past fires, rifts, potential spills and more. But watch out: the fluid motion is realistic!  Tilt too quickly and some droplets are left behind; tilt too slowly you may not be able to make certain jumps… or may simply evaporate away.… Expand"
  },
  {
    "name": "Phantasy Star Zero",
    "details_link": "https://www.metacritic.com/game/ds/phantasy-star-zero",
    "publisher": "Sega",
    "release_date": "Nov 10 2009",
    "developers": [
      "Sonic Team"
    ],
    "platforms": "DS",
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 71,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/8/8d341fa0f503bf2f86a6c96047f5e058-98.jpg",
    "descriptions": "Phantasy Star Ø takes place on an alternate Earth 200 years after the Great Blank, a massive war that has reduced the once-prosperous civilization to almost nothing.  The sole surviving Humans have worked hard to exist peacefully and have built thriving Cities. The Humans that adventure pastPhantasy Star Ø takes place on an alternate Earth 200 years after the Great Blank, a massive war that has reduced the once-prosperous civilization to almost nothing.  The sole surviving Humans have worked hard to exist peacefully and have built thriving Cities. The Humans that adventure past the outskirts of these Cities, called Hunters, explore the vast wilderness and hunt dangerous monsters to keep Cities safe.  Players will take up the role of Hunters and select from three types of races and different classes, as well as gender for a total of 14 customizable character types.  Each character type will play very differently and give players access to a great range of items, armor and weapons.  Featuring over 350 unique weapons, gamers will venture out on Earth, combat dangerous monsters to gain experience and meet new major characters. As players explore further, they will unravel the mystery of the Great Blank and discover a dangerous new force that must be stopped. Featuring both wireless and full Wi-Fi multiplayer options, Phantasy Star Ø takes advantage of the touch screen capabilities of Nintendo DS with the new Visual Chat feature. Gamers can now design their own Visual Chat commands that can be used in multiplayer modes. These Visual Chat commands will be displayed as text bubbles above the user’s character, enabling easy and fun communication when adventuring with friends. [Sega]… Expand"
  },
  {
    "name": "Might & Magic X: Legacy",
    "details_link": "https://www.metacritic.com/game/pc/might-magic-x-legacy",
    "publisher": "Ubisoft",
    "release_date": "Jan 23 2014",
    "developers": [
      "Limbic Entertainment"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Fantasy",
      "Strategy",
      "Turn-Based",
      "General",
      "Fantasy"
    ],
    "meta_score": 71,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/0/85dc01352ad7b772a07bed669794593d-98.jpg",
    "descriptions": "In the wake of the spectacular events in Might & Magic Heroes VI, you will play in a party of four adventurers entangled in intrigue and political machinations unfolding in and around Karthal.  The city, on the verge of secession, is prey to competing factions vying for its control.  YourIn the wake of the spectacular events in Might & Magic Heroes VI, you will play in a party of four adventurers entangled in intrigue and political machinations unfolding in and around Karthal.  The city, on the verge of secession, is prey to competing factions vying for its control.  Your actions will determine the fate of the city.  Might & Magic X Legacy is an authentic solo experience in the classic first-person RPG genre.  Create and lead your group into an exciting world and battle powerful mythical creatures while collecting ancient magical treasures.  Through a turn-based gameplay system, defeat creatures and bosses to accomplish unique quests and make your way through dangerous dungeons, cities and labyrinths full of traps.  Dive into vintage Might & Magic and play old school, new rules.… Expand"
  }
]