[{"name": "JetFighter IV: Fortress America", "details_link": "https://www.metacritic.com/game/pc/jetfighter-iv-fortress-america", "publisher": "TalonSoft", "release_date": "Nov  8 2000", "developers": ["Mission Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Flight", "Modern Jet", "Combat"], "meta_score": 60, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/d2951ad9c4e28a914be8043dccb44bab-98.jpg", "descriptions": "A combat flight simulation that harnesses \rsuper-sleek hardware-accelerated graphics, the easiest flight control system available, and the thrill of piloting billion-dollar jet fighters, delivering a heart-pounding, fevered defense of American soil.  [TalonSoft]"}, {"name": "A Fistful of Gun", "details_link": "https://www.metacritic.com/game/pc/a-fistful-of-gun", "publisher": "Devolver Digital", "release_date": "Sep 24 2015", "developers": ["FarmerGnome"], "platforms": "PC", "num_players": "Up to 9 ", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/9486f1a82c3c6a26357741461ad0396e-98.jpg", "descriptions": "Select one of eleven unique playable gunslingers and seek revenge in Nine player Online Co-Op or Local couch Co-Op. Master the specialized controls of each character, collect gold from fallen foes to purchase upgrades, get totally drunk and unleash a tornado of lead across the dusty plains."}, {"name": "Batman: Arkham Origins Blackgate - Deluxe Edition", "details_link": "https://www.metacritic.com/game/playstation-3/batman-arkham-origins-blackgate---deluxe-edition", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  1 2014", "developers": ["Armature Studio"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Fantasy", "", "Metroidvania"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/ecdc1e3ee76a1a95d27efd83e303a685-98.jpg", "descriptions": "Blackgate Prison Is Under New Management\r Batman: Arkham Origins Blackgate - Deluxe Edition amplifies the 2.5-D game with new maps, enemy encounters, difficulty levels, batsuits, and enhanced visuals. A companion game to Batman: Arkham Origins, players can continue the storyline of theBlackgate Prison Is Under New Management\r Batman: Arkham Origins Blackgate - Deluxe Edition amplifies the 2.5-D game with new maps, enemy encounters, difficulty levels, batsuits, and enhanced visuals. A companion game to Batman: Arkham Origins, players can continue the storyline of the console version and discover more details of the Dark Knights past. Featuring stealth gameplay, free-flow combat, and Batmans famed arsenal of gadgets, the genuine Arkham experience is reproduced in a deep, action packed side-scrolling adventure.… Expand"}, {"name": "Firefall", "details_link": "https://www.metacritic.com/game/pc/firefall", "publisher": "Red 5 Studios", "release_date": "Jul 29 2014", "developers": ["Red 5 Studios"], "platforms": "PC", "genres": ["Shooter", "Sci-Fi", "Sci-Fi", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 60, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/95559a796edb8bed754ffbbaee226daa-98.jpg", "descriptions": "Earth will never be the same. After the Crystite Wars, humanity inadvertently invited the worst enemy ever conceived: THE MELDING. It surrounds us. It forces us to live in pockets of land protected only by the accidental discovery of repulsor technology. We continue to fight for land. ForEarth will never be the same. After the Crystite Wars, humanity inadvertently invited the worst enemy ever conceived: THE MELDING. It surrounds us. It forces us to live in pockets of land protected only by the accidental discovery of repulsor technology. We continue to fight for land. For technology. For power. For our very survival. JOIN THE FIGHT.Red5 Studios Red 5 Studios presents, FIREFALL, an online team-based action shooter. Join your friends in an epic online campaign across a vast open world to stop the Melding and fight for the survival of humanity against the army of the Chosen. Advance your army and character through technological upgrades. Level up different character classes. Compete for supremacy in various multiplayer game types. Push back the Melding. SAVE EARTH… Expand"}, {"name": "Sonic Unleashed", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-unleashed", "publisher": "Sega", "release_date": "Nov 20 2008", "developers": ["Sonic Team"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 60, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/953e5143dc0237f304c9e86c561704e7-98.jpg", "descriptions": "Having been broken apart by the evil Dr. Eggman, it's up to Sonic to put the pieces of the world back together again by retrieving the power of the chaos emeralds! In doing so, Sonic finds himself in a race against time and faced with an unusual situation that challenge hims in ways neverHaving been broken apart by the evil Dr. Eggman, it's up to Sonic to put the pieces of the world back together again by retrieving the power of the chaos emeralds! In doing so, Sonic finds himself in a race against time and faced with an unusual situation that challenge hims in ways never before seen. Both day and night play different, yet important, roles in Sonic's newest quest... as the sun sets, a new adventure awakens. By completing a wide variety of action-packed stages, spanning the seven broken continents of the world, gamers unleash Sonic’s amazing abilities to save the world, and himself! In addition to running at high speeds, which is highlighted in four new speed mechanics, combat fighting now becomes possible. New combat, movement, functional abilities and platforming are introduced to offer increased depth and variety. Sonic Unleashed offers a re-defined experience for fans and newcomers of the franchise alike by combing picturesque & detailed scenery, an expansive world with multiple paths to choose from and dynamic viewpoints for an immersive and renewed gaming atmosphere. Along with seamless 3D to classic 2D camera transitions, the game is built on a powerful, new proprietary \"Hedgehog Engine,\" which introduces impressive lighting abilities and new technology tailor made for Sonic’s new speed capabilities. [Sega]… Expand"}, {"name": "Alex Kidd in Miracle World DX", "details_link": "https://www.metacritic.com/game/playstation-4/alex-kidd-in-miracle-world-dx", "publisher": "Merge Games", "release_date": "Jun 22 2021", "developers": ["Jankenteam"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 60, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/91dfa63abe41a4e01865181dd505026b-98.jpg", "descriptions": "Since his first appearance in 1986 with Alex Kidd in Miracle World, the iconic Alex Kidd makes his return to smash rocks, collect coins and tackle bosses once again in Alex Kidd in Miracle World DX!Return The Kingdom of Radaxian to its former glory and destroy the evil Janken the Great!Since his first appearance in 1986 with Alex Kidd in Miracle World, the iconic Alex Kidd makes his return to smash rocks, collect coins and tackle bosses once again in Alex Kidd in Miracle World DX!Return The Kingdom of Radaxian to its former glory and destroy the evil Janken the Great!Comprising of all levels from the original title as well as brand new levels which expand the lore of Alex Kidd, experience Miracle World like you've never seen it before with new animations, graphical detail and gameplay improvements.… Expand"}, {"name": "Jurassic Park: The Game", "details_link": "https://www.metacritic.com/game/xbox-360/jurassic-park-the-game", "publisher": "Telltale Games", "release_date": "Nov 15 2011", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Adventure", "General", "General", "Visual Novel", "Point-and-Click"], "meta_score": 60, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/3/015076e8cb23c0ce71a83183275f10cb-98.jpg", "descriptions": "Telltale Games, the studio behind Tales of Monkey Island and the Sam & Max episodes, turns Spielberg's classic dinosaur movie Jurassic Park into an episodic adventure."}, {"name": "My Pet Shop", "details_link": "https://www.metacritic.com/game/ds/my-pet-shop", "publisher": "Square Enix", "release_date": "Mar  9 2009", "developers": ["Taito Corporation"], "platforms": "DS", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/438899e4cf48fdc1a1463ca05b093783-98.jpg", "descriptions": "In My Pet Shop, players explore fields looking for animals to catch by using an assortment of items. Animals that you catch will turn into pets that people can take home from Mom’s pet shop, or your own personal companions. Care for them, train them, dress them up, and even enter petIn My Pet Shop, players explore fields looking for animals to catch by using an assortment of items. Animals that you catch will turn into pets that people can take home from Mom’s pet shop, or your own personal companions. Care for them, train them, dress them up, and even enter pet contests! Featuring over 40 animals and 126 color and pattern variations in all, players have the chance to raise rare animals like pandas, penguins, and bears.… Expand"}, {"name": "Cyanide & Happiness - Freakpocalypse", "details_link": "https://www.metacritic.com/game/pc/cyanide-happiness---freakpocalypse", "publisher": "Serenity Forge", "release_date": "Mar 11 2021", "developers": ["Explosm"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/50ed4c022af96c6c295c63da5b1d4b8e-98.jpg", "descriptions": "Taking place in the Cyanide & Happiness universe, you play as a weird, unpopular ginger-headed orphan, and it's time to save the world. Or, maybe make things even worse.As Coop \"Go Away, Weirdo\" McCarthy, all you want to do is make the world a better place. The trouble is: Nobody likesTaking place in the Cyanide & Happiness universe, you play as a weird, unpopular ginger-headed orphan, and it's time to save the world. Or, maybe make things even worse.As Coop \"Go Away, Weirdo\" McCarthy, all you want to do is make the world a better place. The trouble is: Nobody likes you, school sucks, you can't find a prom date, everybody bullies you (including your teachers), and your attempts to help only makes things worse. Will you escape high school alive? Who will love you? Why is this game called Freakpocalypse? Find the answers to these questions and more by looking at, talking to, and touching everything within the Cyanide & Happiness universe.… Expand"}, {"name": "Storm: Frontline Nation", "details_link": "https://www.metacritic.com/game/pc/storm-frontline-nation", "publisher": "Viva Media", "release_date": "Jun 10 2011", "developers": ["SimBin"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Modern", "General"], "meta_score": 60, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/ec4198e83b7c36dd377474a68e884f3e-98.jpg", "descriptions": "Storm: Frontline Nation is a turn-based military strategy game that pits military juggernauts from the United States, Russia, United Kingdom, Germany, and France against each other as they fight over dwindling natural resources amidst an international economic collapse."}, {"name": "Star Wars: The New Droid Army", "details_link": "https://www.metacritic.com/game/game-boy-advance/star-wars-the-new-droid-army", "publisher": "THQ", "release_date": "Nov 14 2002", "developers": ["Helixe"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 60, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/3c386277c161a5887bd6f92bffb89f1d-98.jpg", "descriptions": "When you're playing an action game, the last thing you want to do is to stand around regaining stamina while there are still aliens left to fight."}, {"name": "Steal Princess", "details_link": "https://www.metacritic.com/game/ds/steal-princess", "publisher": "Atlus", "release_date": "May 19 2009", "developers": ["Climax Entertainment"], "platforms": "DS", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/c2b96253cfabc3835238dad32390ad8b-98.jpg", "descriptions": "While exploring the thought-to-be-long-abandoned palace of the Ancient Demon King, the young thief Anise stumbles upon a startling discovery: the palace isn't abandoned at all, and it's crawling with demons, no less!  Equally startling is the deadly booby trap she triggers in the process ofWhile exploring the thought-to-be-long-abandoned palace of the Ancient Demon King, the young thief Anise stumbles upon a startling discovery: the palace isn't abandoned at all, and it's crawling with demons, no less!  Equally startling is the deadly booby trap she triggers in the process of opening a locked door.  She barely outruns the giant boulder bearing down on her, escaping the palace only to fall into a surging river, unconscious. The fairy Kukri, imprisoned for centuries in the chamber Anise inadvertently unlocked, rescues her and takes her to the Castle of Albyon.  Anise awakens in the presence of the King, whose son is being held by demons in the very palace Anise narrowly escaped from.  Recent events have unshakably convinced the King that this thief is descended from the Legendary Hero of Albyon, he who slew the Ancient Demon King centuries ago, and so he commands her thusly: free the Prince from the vile demons... or be tried and convicted as a thief and locked away for life.  Not much of a choice, one way or the other. 3-D puzzle platformer - Dive into a playing field of simple design, but deceptively complex challenge, that combines action elements with puzzle-solving skills on a  3-D, isometric plane.  Jump, swing, climb, and attack as you search for the key to complete each level. Over 150 levels to beat - Levels spanning different geographies and requiring different strategies deliver on the promise of true breadth.  Play them again to beat your best times, earn higher rankings, earn better endings, and collect more gems to unlock items. Create and trade custom levels - A robust custom map maker lets you construct levels with any enemies, items, and victory conditions you want.  Trade maps with other players over Nintendo Wi-Fi Connection and local wireless for a never ending challenge. [Atlus USA]… Expand"}, {"name": "Constantine", "details_link": "https://www.metacritic.com/game/xbox/constantine", "publisher": "THQ", "release_date": "Feb 14 2005", "developers": ["Bits Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 60, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/72a9ef13e42173e9bd16fe716d4900ce-98.jpg", "descriptions": "Inspired by the film by Warner Bros., and based on the graphic novels by DC Comics and Vertigo Hellblazer, Constantine is an intense horror game that literally takes you to Hell and back. You play as John Constantine, an irreverent mystic detective who must embark on an investigation in aInspired by the film by Warner Bros., and based on the graphic novels by DC Comics and Vertigo Hellblazer, Constantine is an intense horror game that literally takes you to Hell and back. You play as John Constantine, an irreverent mystic detective who must embark on an investigation in a supernatural world that exists just beneath Los Angeles. To survive, you must use an array of powerful incantations and holy artifacts, including the crucifier, holy shotgun, and flamethrower. Your \"true sight\" ability helps you identify demons and other secrets.… Expand"}, {"name": "All Zombies Must Die!", "details_link": "https://www.metacritic.com/game/xbox-360/all-zombies-must-die!", "publisher": "Square Enix", "release_date": "Dec 28 2011", "developers": ["Doublesix"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 60, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/78489778b3b2a8ac578b5045911a93b8-98.jpg", "descriptions": "A Gamer, a Girl, a Mad Scientist and an Alien are all that stands between 6 billion zombies and the worldï¿½s supply of delicious, supple brains. All Zombies Must Die! drops up to four players into the town of Deadhill, where they must blast their way through ranks ofA Gamer, a Girl, a Mad Scientist and an Alien are all that stands between 6 billion zombies and the worldï¿½s supply of delicious, supple brains. All Zombies Must Die! drops up to four players into the town of Deadhill, where they must blast their way through ranks of brain hungry monsters with a variety of weaponry while completing quests served up by the gameï¿½s insane storyline. doublesix is combining elements of action and role-playing, including character levelling, weapons crafting and numerous quests. The graphics reflect the silly yet sinister nature of the gameplay with a bright, comic style.… Expand"}, {"name": "Beijing 2008 - The Official Video Game of the Olympic Games", "details_link": "https://www.metacritic.com/game/xbox-360/beijing-2008---the-official-video-game-of-the-olympic-games", "publisher": "Sega", "release_date": "Jul  8 2008", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 60, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/99c33e4c47b6f54c66e1ac91668560e4-98.jpg", "descriptions": "The online functionality of all three platforms ensures that for the very first time, fans of the Olympic Games can experience the thrill of competing against other gamers across the globe in the world’s greatest sporting event. Beijing 2008 is a simulation of over 35 events from the BeijingThe online functionality of all three platforms ensures that for the very first time, fans of the Olympic Games can experience the thrill of competing against other gamers across the globe in the world’s greatest sporting event. Beijing 2008 is a simulation of over 35 events from the Beijing 2008 Olympic Games and allows gamers to experience the thrill of competing in many of the official venues ranging from the famous Beijing National Stadium (the \"Bird Nest\") to the National Aquatics Center (the \"Water Cube\"). In addition, Beijing 2008 incorporates innovative control schemes that allow novice gamers to learn how to play the game, while providing experienced gamers the chance to set new records. Through the addition of online gameplay and a variety of game modes never seen in an official video game of the Olympic Games before, Beijing 2008 truly allows gamers to experience the \"Olympic Spirit. [Sega]… Expand"}, {"name": "SNK Heroines: Tag Team Frenzy", "details_link": "https://www.metacritic.com/game/switch/snk-heroines-tag-team-frenzy", "publisher": "NIS America", "release_date": "Sep  7 2018", "developers": ["SNK Corporation"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 60, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/98d41c1818602ed3ecc6c949be3e1632-98.jpg", "descriptions": "Play online or with friends as SNK's iconic heroines in the brand-new 2 vs 2 fighting game, SNK HEROINES Tag Team Frenzy. Activate Special Moves with a single button, and make use of special items to change the tide of battle! However, the fight isn't over the moment you've chipped enoughPlay online or with friends as SNK's iconic heroines in the brand-new 2 vs 2 fighting game, SNK HEROINES Tag Team Frenzy. Activate Special Moves with a single button, and make use of special items to change the tide of battle! However, the fight isn't over the moment you've chipped enough health away. Once your opponent is on the ropes, utilize your Dream Finish technique to win the match. Spectate on other battles online, and wage on who you think will win using in-game points. Use your winnings to buy voice clips and accessories in an all-new costume system, and customize your favorite heroine to your heart's content.… Expand"}, {"name": "Zack Zero", "details_link": "https://www.metacritic.com/game/playstation-3/zack-zero", "publisher": "Crocodile Entertainment", "release_date": "Jan 17 2012", "developers": ["Crocodile Entertainment"], "platforms": ["PC", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 60, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/95200141b8c5d5205e6938e1ac81228d-98.jpg", "descriptions": "Zack Zero takes you on an action-packed platform adventure with incredible 3D graphics and the playability and entertainment of classic 2D games. Help Zack Zero save his beloved Marlene, kidnapped by the evil Zulrog in an effort to obtain the powerful substance that will allow him to travelZack Zero takes you on an action-packed platform adventure with incredible 3D graphics and the playability and entertainment of classic 2D games. Help Zack Zero save his beloved Marlene, kidnapped by the evil Zulrog in an effort to obtain the powerful substance that will allow him to travel back in time. [Sony]… Expand"}, {"name": "ProStroke Golf - World Tour 2007", "details_link": "https://www.metacritic.com/game/psp/prostroke-golf---world-tour-2007", "publisher": "Oxygen Interactive", "release_date": "Mar  8 2007", "developers": ["Gusto Games"], "platforms": ["PC", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/4c4ddfb888e1d102734a2071127c13be-98.jpg", "descriptions": "Step up to the tee and take on the pros in this year's only real-world golf simulation. Craft your technique, groove your swing, feel the pressure, compete and become a champion. ProStroke Golf is a faithful adaptation of the world's most challenging sport; including licensed players andStep up to the tee and take on the pros in this year's only real-world golf simulation. Craft your technique, groove your swing, feel the pressure, compete and become a champion. ProStroke Golf is a faithful adaptation of the world's most challenging sport; including licensed players and commentary from the international voices of golf. Put yourself to the ultimate test - challenge your skill, stamina and mental agility as you take on the best in the world. Control your nerves, feel the power of your drive, stare victory in the face and hear the crowd adore you. Licensed players: Sergio Garcia, Justin Rose, Colin Montgomerie, Ben Curtis, Zhang Lian Wei, and more...TV commentators : Sam Torrance, Ian Baker Finch and Alan Green. Courses include The Brabazon at The Belfry and Lake Nona. Innovative 'ProStroke' controls allow you to groove your own swing – just like the Pros do. Game Modes; From Match Play to Multiplayer through to training exercises and a comprehensive career mode, as well as short scorecard challenges. Caddy Feature offering Golf Pro Training exercises. Course and Tournament creator, allowing you to design and develop your own courses. [Oxygen Interactive]… Expand"}, {"name": "True Crime: New York City", "details_link": "https://www.metacritic.com/game/playstation-2/true-crime-new-york-city", "publisher": "Activision", "release_date": "Nov 15 2005", "developers": ["Luxoflux", "Inc."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 60, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/830520c02a2bea70fd20c9d440f28bf1-98.jpg", "descriptions": "Players assume the role of former gang member turned cop Marcus Reed as they fight crime on the GPS-accurate streets of Manhattan, complete with subways, hundreds of interiors, internationally recognized landmarks and real neighborhoods from Harlem to Chinatown to Times Square.  PlayersPlayers assume the role of former gang member turned cop Marcus Reed as they fight crime on the GPS-accurate streets of Manhattan, complete with subways, hundreds of interiors, internationally recognized landmarks and real neighborhoods from Harlem to Chinatown to Times Square.  Players navigate the city the way New Yorkers do, by taking cabs, riding subways, walking and driving cars and motorcycles. Gamers experience all the sights and sounds of New York, complete with the energy and architecture authentic to the city’s diverse neighborhoods, the voices and likenesses of real New Yorkers, and the cacophony of ambient traffic and bustling noises unique to the city.  The game also includes character concentrations specific to each neighborhood. For example, the player will find a plethora of tourists amidst the lights and large buildings of Times Square, but predominantly locals near the brownstones of Harlem. [Activision]… Expand"}, {"name": "Monster Jam Steel Titans 2", "details_link": "https://www.metacritic.com/game/xbox-one/monster-jam-steel-titans-2", "publisher": "THQ Nordic", "release_date": "Mar  2 2021", "developers": ["Rainbow Studios", "THQ Nordic", "Feld Entertainment"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Simulation", "Vehicle", "Civilian", "Racing", "Arcade", "Automobile"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/b8879fe581823ad0e02e10d38c6ac25f-98.jpg", "descriptions": "Monster Jam Steel Titans 2 features more fan-favorite trucks in brand new Monster Jam worlds. Brand new online multiplayer modes, 38 trucks to choose from and five new outdoor worlds! Drivers train at Camp Crushmore and compete in authentic stadiums to become the ultimate champion. TruckMonster Jam Steel Titans 2 features more fan-favorite trucks in brand new Monster Jam worlds. Brand new online multiplayer modes, 38 trucks to choose from and five new outdoor worlds! Drivers train at Camp Crushmore and compete in authentic stadiums to become the ultimate champion. Truck roster features 38 of the greatest trucks in Monster Jam history, including Higher Education, Sparkle Smash and Grave Digger. Five all-new Monster Jam Worlds that expand the Monster Jam universe! Explore and uncover Monster Jam secrets. Compete just like the pros in 12 authentic stadiums and game modes inspired by the real-world shows.… Expand"}, {"name": "Windbound", "details_link": "https://www.metacritic.com/game/pc/windbound", "publisher": "Deep Silver", "release_date": "Aug 28 2020", "developers": ["5 Lives Studios"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 60, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/dea3ea383eb1b4cb93d76f11c818cccf-98.jpg", "descriptions": "Embark on a personal journey and discover the history of the idyllic forbidden islands; each holding the key to a mystery and unexpected revelations. Head towards the horizon, advancing across the islands, each with their own wildlife, landscapes and challenges to face. Scavenge the island'sEmbark on a personal journey and discover the history of the idyllic forbidden islands; each holding the key to a mystery and unexpected revelations. Head towards the horizon, advancing across the islands, each with their own wildlife, landscapes and challenges to face. Scavenge the island's untamed terrain for resources that you can use to craft a full range of tools and weapons to hunt wildlife and upgrade your boat. You must set sail when resources become scarce. Your boat is your key companion on this journey, carefully craft your own custom sailing vessel to take on the treacherous waters, traversing from one island to the next.… Expand"}, {"name": "Dead or School", "details_link": "https://www.metacritic.com/game/playstation-4/dead-or-school", "publisher": "Marvelous Inc.", "release_date": "Mar 13 2020", "developers": ["Studio Nanafushi"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Action RPG"], "meta_score": 60, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/af13fd956dd032c0419fba6576f387f9-98.jpg", "descriptions": "Join Hisako's fight for survival against the zombie infestation overrunning Tokyo and defend her right to a normal school life in this fast-paced 2.5D adventure.Forced into isolation underground by the zombie apocalypse, Hisako has little understanding of the world above. After hearingJoin Hisako's fight for survival against the zombie infestation overrunning Tokyo and defend her right to a normal school life in this fast-paced 2.5D adventure.Forced into isolation underground by the zombie apocalypse, Hisako has little understanding of the world above. After hearing stories about schools aboveground, Hisako dons her grandmother's school uniform and takes up arms against the undead horde with one goal in mind: to become a school girl!Travel across Tokyo visiting iconic locations such as Shinjuku, Asakusa and Roppongi using the subway system and take on gruesome bosses in both close and ranged combat. Upgrade Hisako's weapons and abilities for even more destructive force and find collectables that reveal the truth behind the zombie apocalypse. Will Hisako be able to find salvation at SCHOOL, or is the world just DEAD? Find out in DEAD OR SCHOOL!… Expand"}, {"name": "Truck Racing Championship", "details_link": "https://www.metacritic.com/game/playstation-4/truck-racing-championship", "publisher": "Bigben Interactive", "release_date": "Aug 20 2019", "developers": ["N-RACING"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 60, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/1/67515400dfdd32df8769782b8c5b9d94-98.jpg", "descriptions": "The European Truck Racing Championship is one of the most spectacular and challenging motor racing competitions. The driving difficulty and many unique race features have been faithfully reproduced with the KT Engine (WRC). In ETRC, like on real-life race tracks, you need to control theThe European Truck Racing Championship is one of the most spectacular and challenging motor racing competitions. The driving difficulty and many unique race features have been faithfully reproduced with the KT Engine (WRC). In ETRC, like on real-life race tracks, you need to control the temperature of your brakes so they don't overheat. You must also consider the weight of the truck when cornering, monitor tyre wear and find the best tactics for overtaking.… Expand"}, {"name": "Turok 2: Seeds of Evil Remaster", "details_link": "https://www.metacritic.com/game/switch/turok-2-seeds-of-evil-remaster", "publisher": "Night Dive Studios", "release_date": "Aug  9 2019", "developers": ["Night Dive Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/1147c9b1fa5d488eeb7e4daafe6567b9-98.jpg", "descriptions": "The Dinosaur Hunter ReturnsHaving defeated the Campaigner, Turok throws the Chronocepter into a waiting volcano to destroy it. Unfortunately the blast awakens an even deadlier force - The Primagen. Once again Turok is tasked with restoring peace to the land and stopping the Primagen fromThe Dinosaur Hunter ReturnsHaving defeated the Campaigner, Turok throws the Chronocepter into a waiting volcano to destroy it. Unfortunately the blast awakens an even deadlier force - The Primagen. Once again Turok is tasked with restoring peace to the land and stopping the Primagen from merging Earth with the nether world.Fight your way through 35 different types of enemies with bouncing bellies, blinking eyes, stretching tentacles and snapping jaws. From Prehistoric Raptors, to evolved Flesh Eaters, to your final battle with the Mother of all beasts you'll want to defeat all of them!… Expand"}, {"name": "Desert Child", "details_link": "https://www.metacritic.com/game/pc/desert-child", "publisher": "Akupara Games", "release_date": "Dec 11 2018", "developers": ["Oscar Brittain"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/901348090ea65238e0856951f5868cea-98.jpg", "descriptions": "Assume the role of a young hoverbike racer who needs to figure out how to scrape enough cash together through racing and odd jobs to punch your one-way ticket to the Red Planet to enter the biggest race in the universe, the Grand Prix."}, {"name": "Shelter Generations", "details_link": "https://www.metacritic.com/game/switch/shelter-generations", "publisher": "CIRCLE Entertainment", "release_date": "Apr 12 2018", "developers": ["Might and Delight"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 60, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/a1547cc9f8432fb3968d9fb86ab23b9f-98.jpg", "descriptions": "There are two games included in this special digital collection. Shelter 2 (with the Mountains DLC included) follows the life of a mother Lynx; it's a journey of parenthood in which nurturing your cubs is paramount for survival. You need to hunt for food and utilise maternal instincts suchThere are two games included in this special digital collection. Shelter 2 (with the Mountains DLC included) follows the life of a mother Lynx; it's a journey of parenthood in which nurturing your cubs is paramount for survival. You need to hunt for food and utilise maternal instincts such as calling the cubs closer, making sure they drink water from rivers, and lifting and carrying them from harm's way. You need to raise them safely until they reach adulthood, with a different experience and circumstances each time you play.Paws: A Shelter 2 Game is a standalone experience based within the same world. In this poetic adventure you need to explore and survive the wilds as a cub, interacting with the environment and forging a surprising alliance. It features puzzles, a special soundtrack and plenty of memorable moments.… Expand"}, {"name": "Rogue Trooper Redux", "details_link": "https://www.metacritic.com/game/switch/rogue-trooper-redux", "publisher": "Rebellion", "release_date": "Oct 17 2017", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/5d7de90c51374cea019aaff0c148027f-98.jpg", "descriptions": "A tactical shooter and comic book adaptation, Rogue Trooper is back, remastered in high definition. Experience combat and third person action in this tale of betrayal and revenge at the far reaches of the galaxy. You are the last Genetic Infantryman (GI). Bred for war and betrayed by yourA tactical shooter and comic book adaptation, Rogue Trooper is back, remastered in high definition. Experience combat and third person action in this tale of betrayal and revenge at the far reaches of the galaxy. You are the last Genetic Infantryman (GI). Bred for war and betrayed by your superiors at the Quartz Zone Massacre, you stalk the battlefield as a one-man squad, carrying the sentient biochips of three fallen soldiers in your rifle, pack and helmet. Your mission? Fight your way across the chemical-blasted wastes of Nu-Earth -- a planet ravaged by an endless apocalyptic war  in search of the Traitor General and payback.… Expand"}, {"name": "Skylar & Plux: Adventure on Clover Island", "details_link": "https://www.metacritic.com/game/xbox-one/skylar-plux-adventure-on-clover-island", "publisher": "Grip Games", "release_date": "May 19 2017", "developers": ["Right Nice Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "3D"], "meta_score": 60, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/e561a7bd455536bb8be3bc6f62d07952-98.jpg", "descriptions": "Skylar & Plux: Adventure on Clover Island sets two unlikely heroes on an adventure to prevent the villainous CRT from conquering their home and turning it into a wasteland."}, {"name": "Beyond Eyes", "details_link": "https://www.metacritic.com/game/xbox-one/beyond-eyes", "publisher": "Team17", "release_date": "Aug  4 2015", "developers": ["tiger & squid"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 60, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/9d9ce902e317941c09dbe654ab8f899c-98.jpg", "descriptions": "Beyond eyes shows you the imaginative world of Rae,  a  10 year-old girl, as she ventures outside her familiar surroundings in search of a fat cat named Nani. Rae isn't like most other girls. She lost her eyesight in an accident with fireworks when she was just a toddler and the experienceBeyond eyes shows you the imaginative world of Rae,  a  10 year-old girl, as she ventures outside her familiar surroundings in search of a fat cat named Nani. Rae isn't like most other girls. She lost her eyesight in an accident with fireworks when she was just a toddler and the experience left her traumatized. Fearing loud noises and public places, she hardly ever leaves her house, preferring to spend her free time in her special garden where everything smells pleasant and all is nice. Some people might feel sorry for Rae, being as isolated as she is, but Rae herself is perfectly content with her life especially after befriending a gorgeous full-figured stray feline she names Nani. When Nani goes missing Rae finally gains the courage to go outside for the first time on an wonderful and life changing journey to find her missing friend. The world outside is frightening and unfamiliar but, with the guidance of the player, Rae learns to overcome her fears and finds beauty and possible new friends outside of her golden cage. … Expand"}, {"name": "Slender: The Arrival", "details_link": "https://www.metacritic.com/game/playstation-4/slender-the-arrival", "publisher": "Majesco Games", "release_date": "Mar 24 2015", "developers": ["Blue Isle Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/e9a7261f966b9daac9d3da7f41fc0abc-98.jpg", "descriptions": "Slender: The Arrival is the official continuation of Slender: The Eight Pages. A combined effort from the writers behind the Marble Hornets series and the development team at Blue Isle Studios, Slender: The Arrival features a brand new storyline and improved visuals."}, {"name": "Metro: Last Light - Faction Pack", "details_link": "https://www.metacritic.com/game/pc/metro-last-light---faction-pack", "publisher": "Deep Silver", "release_date": "Jul 16 2013", "developers": ["4A Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 60, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/db53281f58156325975ac2d8a66a6747-98.jpg", "descriptions": "The Faction Pack for Metro: Last Light includes three new single-player missions that assign players as different characters from each warring faction of the game."}, {"name": "Sonic Adventure 2", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-adventure-2", "publisher": "Sega", "release_date": "Oct  5 2012", "developers": ["Sega", "Sonic Team"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 60, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/f706d3e90924f6412ee3dc3b9f1e256c-98.jpg", "descriptions": "In the fight between heroes and villains, will you choose to save the world or conquer it? The hunt for the Chaos Emeralds is on and battle lines have been drawn between Hero and Dark. Experience two unique adventures featuring both long-time heroes and new and returning villains as theyIn the fight between heroes and villains, will you choose to save the world or conquer it? The hunt for the Chaos Emeralds is on and battle lines have been drawn between Hero and Dark. Experience two unique adventures featuring both long-time heroes and new and returning villains as they battle for the fate of the world! Sonic Adventure 2 makes its return on Xbox LIVE Arcade with a full cast of playable heroes and villains, exciting two-player competitive modes, Chao Gardens, and more than 30 action-packed stages, all remastered in HD!… Expand"}, {"name": "Leedmees", "details_link": "https://www.metacritic.com/game/xbox-360/leedmees", "publisher": "Konami", "release_date": "Sep  7 2011", "developers": ["Konami"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Action", "General", "General"], "meta_score": 60, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/aaa3a427e7f88ccf57a2ec08e4171dff-98.jpg", "descriptions": "Your body is the controller is in this whimsical and dreamlike game. Guide the Leedmees, a mysterious population of small and creatures, home, using your limbs and head as bridges and walkways. Lift them up, toss them about, and slip them past treacherous obstacles, but be careful and don’tYour body is the controller is in this whimsical and dreamlike game. Guide the Leedmees, a mysterious population of small and creatures, home, using your limbs and head as bridges and walkways. Lift them up, toss them about, and slip them past treacherous obstacles, but be careful and don’t let them get hurt! \rLose too many of them and the game will be over.… Expand"}, {"name": "Crazy Taxi", "details_link": "https://www.metacritic.com/game/playstation-3/crazy-taxi", "publisher": "Sega", "release_date": "Nov 16 2010", "developers": ["Hitmaker"], "platforms": ["iPhone/iPad", "PC", "PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 60, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/7123d9772697d56fe47cd97492d4c7f4-98.jpg", "descriptions": "The Dreamcast classic finally makes its way to the PlayStation Network."}, {"name": "Guitar Rock Tour", "details_link": "https://www.metacritic.com/game/ds/guitar-rock-tour", "publisher": "Ubisoft", "release_date": "Nov  4 2008", "developers": ["Ubisoft"], "platforms": ["iPhone/iPad", "DS"], "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/7b5420401942f080fe5c14948752c671-98.jpg", "descriptions": "With Guitar Rock Tour you can perform the guitar and drum tracks of the most popular worldwide hits on your NintendoDS and live the most explosive musical experience on the DS! Targeted for all audiences, Guitar Rock Tour features solo and multiplayer modes where beginners can have loads ofWith Guitar Rock Tour you can perform the guitar and drum tracks of the most popular worldwide hits on your NintendoDS and live the most explosive musical experience on the DS! Targeted for all audiences, Guitar Rock Tour features solo and multiplayer modes where beginners can have loads of fun right from the start and fans of music games can discover plenty of nuances. Without any musical knowledge, learn how to quickly master the basic controls of each instrument by using the Nintendo DS’s Touch Screen or buttons and kick off your career as a rock star. Keep your cool in front of a hyped-up crowd and follow the beat so the guitar (or the drums, depending on your choice of instruments) is synchronized with the other instruments in the band and you’ll get the rush of playing like a rock god. [Ubisoft]… Expand"}, {"name": "Konductra", "details_link": "https://www.metacritic.com/game/ds/konductra", "publisher": "O3 Entertainment", "release_date": "Oct 31 2006", "developers": ["oeFun"], "platforms": "DS", "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "General", "Matching"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/25d58881a39b0192160f83e1007c9652-98.jpg", "descriptions": "Konductra challenges players to create and destroy lines with colored tiles to either earn points or attack an opponent. This unique, but elegant puzzle title offers four game modes, including Task, Score, VS. CPU, and VS. Human. In both versus modes, the objective is to beat the opponent byKonductra challenges players to create and destroy lines with colored tiles to either earn points or attack an opponent. This unique, but elegant puzzle title offers four game modes, including Task, Score, VS. CPU, and VS. Human. In both versus modes, the objective is to beat the opponent by filling up the rival’s board as quickly as possible by destroying lines on the player’s own board and sending them to the opponent’s board. Gamers destroy lines by matching tiles and using the stylus to trace from like colored conductors running along the four edges of the screen. [O3 Entertainment]… Expand"}, {"name": "Namco Museum 50th Anniversary", "details_link": "https://www.metacritic.com/game/game-boy-advance/namco-museum-50th-anniversary", "publisher": "Namco", "release_date": "Aug 30 2005", "developers": ["Backbone Vancouver"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/fc11fdd24cc6c2a0fc4e77bd711026d5-98.jpg", "descriptions": "IT'S PARTY TIME! Namco celebrates 50 years of bringing you the greatest games on the planet with the ultimate portable collection of all-star arcade classics. Namco Museum 50th Anniversary features five of the most treasured games in arcade history. Put the arcade experience in the palm ofIT'S PARTY TIME! Namco celebrates 50 years of bringing you the greatest games on the planet with the ultimate portable collection of all-star arcade classics. Namco Museum 50th Anniversary features five of the most treasured games in arcade history. Put the arcade experience in the palm of your hand and this time... leave your quarters at home.… Expand"}, {"name": "BMX XXX", "details_link": "https://www.metacritic.com/game/gamecube/bmx-xxx", "publisher": "Acclaim", "release_date": "Nov 24 2002", "developers": ["Z-Axis", "Ltd."], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 60, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/7/36d5f0a9c4f878e75154c263b48a9206-98.jpg", "descriptions": "BMX XXX combines outrageous Hollywood humor and characters, beautiful women from New York's famous Scores club, incredible arcade action, and a dynamic soundtrack from current recording artists into one interactive entertainment experience. Laced with mature content, the game featuresBMX XXX combines outrageous Hollywood humor and characters, beautiful women from New York's famous Scores club, incredible arcade action, and a dynamic soundtrack from current recording artists into one interactive entertainment experience. Laced with mature content, the game features Create-a-Rider mode, over 2,000 different tricks, eight massive levels, and a split-screen multiplayer mode for up to four players. The version for the PlayStation 2 has been edited to eliminate the topless nudity, while versions for the Xbox and the Nintendo GameCube do contain nudity. … Expand"}, {"name": "Ninja Assault", "details_link": "https://www.metacritic.com/game/playstation-2/ninja-assault", "publisher": "Namco", "release_date": "Nov 18 2002", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Rail"], "meta_score": 60, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/04647c9d908d9162ddbc6cb2fd3264fb-98.jpg", "descriptions": "The newest addition to the GunCon2 compatible list of shooters. Set to the backdrop of Feudal Japan, three heroic ninjas must fight off hundreds of powerful demons in order to save the Princess Koto from being sacrificed in a ritual to resurrect the evil Shogun Kigai. Featuring new levels,The newest addition to the GunCon2 compatible list of shooters. Set to the backdrop of Feudal Japan, three heroic ninjas must fight off hundreds of powerful demons in order to save the Princess Koto from being sacrificed in a ritual to resurrect the evil Shogun Kigai. Featuring new levels, modes, and rendered cut-scenes, plus improved graphics over the Arcade version, this new shooter is ready to put trigger fingers back in action. [Namco]… Expand"}, {"name": "Wreckless: The Yakuza Missions", "details_link": "https://www.metacritic.com/game/playstation-2/wreckless-the-yakuza-missions", "publisher": "Activision", "release_date": "Nov 13 2002", "developers": ["Stealth Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/5ce0adce18f19faf09cc3096cf113913-98.jpg", "descriptions": "Drive your way through a total of 40 white-knuckle missions, featuring a variety of tough objectives in solo or 2-player mode. Unlock game-enhancing cheats as you go. Experience realistic driving physics as you maneuver 30 different cars through up-close-and-personal crashes with real-timeDrive your way through a total of 40 white-knuckle missions, featuring a variety of tough objectives in solo or 2-player mode. Unlock game-enhancing cheats as you go. Experience realistic driving physics as you maneuver 30 different cars through up-close-and-personal crashes with real-time deformation. [Activision]… Expand"}, {"name": "Chase: Hollywood Stunt Driver", "details_link": "https://www.metacritic.com/game/xbox/chase-hollywood-stunt-driver", "publisher": "Bam Entertainment", "release_date": "Sep 25 2002", "developers": ["I-Imagine"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Driving", "Mission-based"], "meta_score": 60, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/9ce8517c940138b675d3ee03b895db3a-98.jpg", "descriptions": "Chase places you in the exciting world of Hollywood-movie stunt-car action. In the game, you take the role of Chase Corrada, a young stuntwoman who is starting her promising career as a movie stunt driver. In four unique sets--including a gangster set, a postapocalyptic set, and more--it'sChase places you in the exciting world of Hollywood-movie stunt-car action. In the game, you take the role of Chase Corrada, a young stuntwoman who is starting her promising career as a movie stunt driver. In four unique sets--including a gangster set, a postapocalyptic set, and more--it's up to you to perfect the film's action sequences. You'll drive not only traditional 4-wheeled vehicles but also motorcycles and a 3-wheeled Ramen delivery Tuk-Tuk. You'll have to hit your marks as you attempt jumps, smash through props, and race through the set to please the director. … Expand"}, {"name": "Star Wars Episode III: Revenge of the Sith", "details_link": "https://www.metacritic.com/game/playstation-2/star-wars-episode-iii-revenge-of-the-sith", "publisher": "LucasArts", "release_date": "May  4 2005", "developers": ["Double Helix Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 60, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/ccc6b3921cab2c4c18c6c7b4bcfec727-98.jpg", "descriptions": "This third-person action/adventure game delivers the ultimate Jedi action experience as Anakin Skywalker and Obi-Wan Kenobi join forces in fierce battles and heroic lightsaber duels until one's lust for power and the other's devotion to duty leads to a final confrontation between good andThis third-person action/adventure game delivers the ultimate Jedi action experience as Anakin Skywalker and Obi-Wan Kenobi join forces in fierce battles and heroic lightsaber duels until one's lust for power and the other's devotion to duty leads to a final confrontation between good and evil. In the Star Wars: Episode III video game, players control all the Jedi abilities of both Anakin Skywalker and Obi-Wan Kenobi, including devastating Force powers and advanced lightsaber techniques involving robust combo attacks and defensive maneuvers. As Anakin, players unleash the power of the dark side in ruthless lightsaber and Force attacks. As Obi-Wan, players struggle to save the galaxy from darkness by focusing the power of the light side into swift and precise lightsaber attacks and using the Force to control enemy actions. [LucasArts]… Expand"}, {"name": "NHL 15", "details_link": "https://www.metacritic.com/game/playstation-4/nhl-15", "publisher": "Electronic Arts", "release_date": "Sep  9 2014", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim"], "meta_score": 60, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/4/4bdd8d8d64c87ccc241a7e90fb62f76b-98.jpg", "descriptions": "The Skill Stick purports to give more control to the player. Protect the puck, receive passes without breaking stride, and discover an arsenal of sweet new dekes, all with an intuitive right stick control scheme. The game features Doc Emrick, Eddie Olczyk and analyst Ray Ferraro providingThe Skill Stick purports to give more control to the player. Protect the puck, receive passes without breaking stride, and discover an arsenal of sweet new dekes, all with an intuitive right stick control scheme. The game features Doc Emrick, Eddie Olczyk and analyst Ray Ferraro providing play-by-play and commentary throughout the proceedings.… Expand"}, {"name": "James Cameron's Avatar: The Game", "details_link": "https://www.metacritic.com/game/wii/james-camerons-avatar-the-game", "publisher": "Ubisoft", "release_date": "Dec  1 2009", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 60, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/8/a36b5d2d868f8ee617729ad44f67b368-98.jpg", "descriptions": "Based on James Cameron's film, the game takes you deep into the heart of Pandora, an alien planet that is beyond imagination. Gamers encounter the Na'vi, Pandora's indigenous people and discover creatures and other wildlife the likes of which have never been seen in the world of video gamesBased on James Cameron's film, the game takes you deep into the heart of Pandora, an alien planet that is beyond imagination. Gamers encounter the Na'vi, Pandora's indigenous people and discover creatures and other wildlife the likes of which have never been seen in the world of video games before. When conflict erupts between the RDA Corporation, a space-faring consortium in search of valuable resources, and the Na'vi, players find themselves thrust into a fight for the heart of a planet and the fate of a civilization. [Ubisoft]… Expand"}, {"name": "World Poker Tour", "details_link": "https://www.metacritic.com/game/playstation-2/world-poker-tour", "publisher": "2K Sports", "release_date": "Oct 18 2005", "developers": ["Coresoft"], "platforms": "PlayStation 2", "num_players": "6  Online", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 60, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/dabccdb438fb8e96ab25f547b3d03a09-98.jpg", "descriptions": "Exclusive World Poker Tour Presentation - Including real WPT venues such as Commerce Casino and the Aviation Club, broadcast style overlays and commentary featuring Mike Sexton and Vince Van Patten. Compete against the virtual equivalents of Antonio \"the Magician\" Esfandiari, Erick Lindgren,Exclusive World Poker Tour Presentation - Including real WPT venues such as Commerce Casino and the Aviation Club, broadcast style overlays and commentary featuring Mike Sexton and Vince Van Patten. Compete against the virtual equivalents of Antonio \"the Magician\" Esfandiari, Erick Lindgren, Evelyn Ng, Lyle Berman, Michael \"the Grinder\" Mizrachi, and Phil \"Unabomber\" Laak, that play each situation just like their real-life counterparts. Go \"all in\" against players across the country with WPT's robust online functionality. Compete in tournaments, set up poker nights with your friends, manage buddy lists, and chat. Improve your poker playing skills by utilizing in-game tutorials and an in-depth stat tracking system that outlines your playing tendencies in numerous situations. Create a player, launch a career, and strive to become a WPT World Champion as you build your character's experience and boost your career earnings by competing in multiple game modes including Quick Play, Satellite Tour Play and WPT Season Play. Flaunt your success by using your earnings to deck out your player with hundreds of accessories. Create custom poker games by setting rules and limits with the poker game editor, or choose from 14 different community poker games including Texas Hold'em, Omaha, Pineapple, Double Flop Hold'em, Super Hold'em, Billabong, Tahoe and Shanghai. [2K Games]… Expand"}, {"name": "Rio", "details_link": "https://www.metacritic.com/game/xbox-360/rio", "publisher": "THQ", "release_date": "Apr 12 2011", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "General", "Party / Minigame"], "meta_score": 60, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/e3c31d5919d52517dbfd5a6ec74a6c99-98.jpg", "descriptions": "Rio is a multiplayer party game where players can play as their favorite characters from the movie."}, {"name": "The Legend of Spyro: The Eternal Night", "details_link": "https://www.metacritic.com/game/wii/the-legend-of-spyro-the-eternal-night", "publisher": "Sierra Entertainment", "release_date": "Oct 18 2007", "developers": ["Krome Studios"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 60, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/321036c2009b5b0fec2c80006b0bc43d-98.jpg", "descriptions": "The Legend of Spyro: The Eternal Night continues the strong action-infused gameplay focus established in The Legend of Spyro: A New Beginning and takes it even further with new powers, including: Four new, upgradeable Breath Attacks (one for each element type), such as Ice Bomb, ElectricThe Legend of Spyro: The Eternal Night continues the strong action-infused gameplay focus established in The Legend of Spyro: A New Beginning and takes it even further with new powers, including: Four new, upgradeable Breath Attacks (one for each element type), such as Ice Bomb, Electric Orb, Earth Vine, Enhanced Fire; Four new elemental melee moves, including Comet Dash, Artic Blast, Earth Pound, Electric Spin; Four new Fury attacks – Earth, Electricity, Ice, Fire; Monstrous new and explosive boss battles against the likes of Skabb the Pirate, Gaul the Ape King and more. The Legend of Spyro: The Eternal Night also expands Spyro's combat arsenal by adding \"Dragon Time,\" a new advanced move that allows Spyro to bend time to his will.  Players can engage Dragon Time to dodge attacks, out-maneuver enemies or solve tricky time-based environmental puzzles. [Sierra Entertainment]… Expand"}, {"name": "Flipper Critters", "details_link": "https://www.metacritic.com/game/ds/flipper-critters", "publisher": "Ignition Entertainment", "release_date": "Oct  9 2007", "developers": ["Zen Studios"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/f7c655870fd81fba087314d047b6793f-98.jpg", "descriptions": "Flipper Critters is set in an imaginary world filled with a huge range of settings, from town squares and mountain valleys to towering castles and even the surface of the moon. All of the traditional pinball features are still there, including ramps, sinkholes, bumpers, jackpots, gates andFlipper Critters is set in an imaginary world filled with a huge range of settings, from town squares and mountain valleys to towering castles and even the surface of the moon. All of the traditional pinball features are still there, including ramps, sinkholes, bumpers, jackpots, gates and goals – just in a different form than you've ever seen them. Both display screens in full 3D – a first! A feast of missions and objectives that help to advance the story. A high degree of freedom in deciding what missions to do next and where to travel, making each game a different experience from the last. A mesmeric three-dimensional, cartoon-like world. Villages, mountain tops and even the surface of the moon become pinball tables. Fast paced arcade action. Fabulous sound and music. State-of-the-art ball physics, giving fast and responsive control. Wi Fi features include: 2 player multiplay for each mini game, called duel. Three kinds of mini games linking the pinball tables in Story Mode - as you proceed unlock them. Each mini game has 4 very different visuals. Magic Bridge: You race against the other player and first past the line wins. Gravity: your goal is to make your enemy submarine sink by picking up driller icons. [Conspiracy Entertainment]… Expand"}, {"name": "Encleverment Experiment", "details_link": "https://www.metacritic.com/game/xbox-360/encleverment-experiment", "publisher": "Blitz Arcade", "release_date": "Nov 11 2009", "developers": ["Blitz Arcade"], "platforms": "Xbox 360", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 60, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/14fa0b011be0cad2f639c5f2578b0d7f-98.jpg", "descriptions": "[Xbox Live Arcade]  A myriad of mini-games to make your mind more magnificent await in the Encleverment Experiment! Join Professor Ivor Question in his lab and test your mental faculties to the limit. One to four players compete in 16 mind-bending games, collecting Noodles (the currency of[Xbox Live Arcade]  A myriad of mini-games to make your mind more magnificent await in the Encleverment Experiment! Join Professor Ivor Question in his lab and test your mental faculties to the limit. One to four players compete in 16 mind-bending games, collecting Noodles (the currency of geniuses!) to spend on over 50 collectable Mascots. Or Take-A-Test and track your ongoing Encleverment over time! Train the four quadrants of your brain or use the Home-Made game feature to create your own quiz shows. With 15 in-game opponents to beat, many multiplayer modes, full Avatar support and the Professor as your guide, the Encleverment never ends. [Blitz]… Expand"}, {"name": "DreamWorks Shrek the Third", "details_link": "https://www.metacritic.com/game/pc/dreamworks-shrek-the-third", "publisher": "Activision", "release_date": "May 15 2007", "developers": ["7 Studios"], "platforms": ["Xbox 360", "PC"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 60, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/0a541b722c11b1f9ceb81f3048104949-98.jpg", "descriptions": "Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies,Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies, and visit never before seen lands from the movie and beyond. [Activision]… Expand"}, {"name": "EA Playground", "details_link": "https://www.metacritic.com/game/ds/ea-playground", "publisher": "Electronic Arts", "release_date": "Oct 23 2007", "developers": ["Piranha Games"], "platforms": "DS", "num_players": "4  Online", "genres": ["Action", "General", "General"], "meta_score": 60, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/36d6260e772e2e8bb7058ae78032fbeb-98.jpg", "descriptions": "EA Playground features games that are easy to pick-up-and-play by fully capitalizing on the unique control mechanics of both the Wii and the Nintendo DS. Swing the Wii remote to excel in tetherball, blow into the Nintendo DS mic to fire spitballs or battle your friends and family inEA Playground features games that are easy to pick-up-and-play by fully capitalizing on the unique control mechanics of both the Wii and the Nintendo DS. Swing the Wii remote to excel in tetherball, blow into the Nintendo DS mic to fire spitballs or battle your friends and family in dodgeball. Every game brings its own twist to the controls for the ultimate, all-ages, party game. In EA Playground, you don't always have to be playing with your friends and family in order to have fun. Explore the world on your own as you enter different locations, unlocking new activities, making wacky in-game friends and collecting rewards and stickers to upgrade your abilities along the way. [Electronic Arts]… Expand"}, {"name": "EVE: Gunjack", "details_link": "https://www.metacritic.com/game/playstation-4/eve-gunjack", "publisher": "CCP", "release_date": "Oct 13 2016", "developers": ["CCP"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "Flight", "Shooter", "Light Gun", "Combat"], "meta_score": 60, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/6d68277078d748f752c560e4fd17c230-98.jpg", "descriptions": "A first-person arcade shooter, built from the ground up for virtual reality."}, {"name": "KickBeat: Special Edition", "details_link": "https://www.metacritic.com/game/playstation-4/kickbeat-special-edition", "publisher": "Zen Studios", "release_date": "Sep 16 2014", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music"], "meta_score": 60, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/0/eeec67aa2d3176188c3de90f3f890cb5-98.jpg", "descriptions": "KickBeat offers players several innovative ways to interact with music. The game combines beat-matching mechanics with an acrobatic style of martial arts, turning every song into a raucous battle. The game also features a music analyzer that allows players to create new tracks from their ownKickBeat offers players several innovative ways to interact with music. The game combines beat-matching mechanics with an acrobatic style of martial arts, turning every song into a raucous battle. The game also features a music analyzer that allows players to create new tracks from their own music libraries.… Expand"}, {"name": "Off-Road Drive", "details_link": "https://www.metacritic.com/game/pc/off-road-drive", "publisher": "1C", "release_date": "Sep 29 2011", "developers": ["Avalon Style"], "platforms": "PC", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Automobile"], "meta_score": 60, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/ddec2e9fa8227447c836a00fdcfb7a49-98.jpg", "descriptions": "Off-Road Driveis the first game ever to deliver a true-to-life, off-road, extreme racing experience.  Players will take part in The Russian trophy, Off-Road Trial, Thai Trophy and many other events through the worst driving conditions with a variety of natural obstacles like swamps, rocks,Off-Road Driveis the first game ever to deliver a true-to-life, off-road, extreme racing experience.  Players will take part in The Russian trophy, Off-Road Trial, Thai Trophy and many other events through the worst driving conditions with a variety of natural obstacles like swamps, rocks, snow and sand. … Expand"}, {"name": "Special Forces: Nemesis Strike", "details_link": "https://www.metacritic.com/game/xbox/special-forces-nemesis-strike", "publisher": "Hip Games", "release_date": "Mar 22 2005", "developers": ["Asobo Studio"], "platforms": ["PC", "Xbox"], "num_players": "1-10 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/ecb46baf267907f6065b50f5f433eeff-98.jpg", "descriptions": "Join the fight against global counterterrorism. In Nemesis Strike, you'll guide a team of two agents--Stealth Owl and Raptor--as they cross into enemy territory. Stealth Owl is an infiltration expert with skills in accuracy and skydiving, while Raptor favors powerful weapons and closeJoin the fight against global counterterrorism. In Nemesis Strike, you'll guide a team of two agents--Stealth Owl and Raptor--as they cross into enemy territory. Stealth Owl is an infiltration expert with skills in accuracy and skydiving, while Raptor favors powerful weapons and close combat. Among your arsenal are electromagnetic bombs, holographic gadgets, heat-seeking rocket launchers, and sonar vision. Use jeeps, boats, hovercrafts, and aircraft to travel around the fully destructible environments. … Expand"}, {"name": "I and Me", "details_link": "https://www.metacritic.com/game/switch/i-and-me", "publisher": "Ratalaika Games S.L.", "release_date": "Jul 13 2017", "developers": ["Wish Fang"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 60, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/bb2eff0b86b0f221b0cdc9d35984768a-98.jpg", "descriptions": "If there were another me,\rObserving myself from the perspective of a spectator,\rHow would I regard another me?\rHow would I get along with the other me I and Me is a puzzle platformer. To play the game, you control two cats simultaneously."}, {"name": "Ancient Amuletor", "details_link": "https://www.metacritic.com/game/playstation-4/ancient-amuletor", "publisher": "TIGAMES", "release_date": "Jun 27 2017", "developers": ["TIGAMES"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 3 ", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/4d4f7ca93b0f1807d3aea6df663387fb-98.jpg", "descriptions": "Ancient Amuletor is an action tower defense game that throws you into an ancient world to battle magical creatures, monsters, and other legendary foes."}, {"name": "Exerbeat", "details_link": "https://www.metacritic.com/game/wii/exerbeat", "publisher": "Namco Bandai Games", "release_date": "May 17 2011", "developers": ["Namco Bandai Games"], "platforms": "Wii", "genres": ["Sports", "General", "General"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/ce0efb4ef8271e9aa89b288328bd8313-98.jpg", "descriptions": "ExerBeat offers an interactive fitness experience where players workout to the beat by utilizing the Wii Remoteâ„¢ to perform more than 150 simple yet challenging exercises. With a wealth of activities, in-game personal trainers, customizable programs and data for calories burned,ExerBeat offers an interactive fitness experience where players workout to the beat by utilizing the Wii Remoteâ„¢ to perform more than 150 simple yet challenging exercises. With a wealth of activities, in-game personal trainers, customizable programs and data for calories burned, ExerBeat offers a robust virtual workout studio for the home.… Expand"}, {"name": "Leisure Suit Larry: Magna Cum Laude", "details_link": "https://www.metacritic.com/game/playstation-2/leisure-suit-larry-magna-cum-laude", "publisher": "VU Games", "release_date": "Oct  5 2004", "developers": ["High Voltage Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Modern"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/6ed42879e154b158b65f02f67c038ddb-98.jpg", "descriptions": "Larry Cum Laude! College is tough for Larry - between classes, fraternities, and odd jobs there's hardly time for parties and chasing girls. So when a dating show comes to campus, Larry knows that getting on TV is his best chance ever to lay more than groundwork. Can Larry get on TV, get theLarry Cum Laude! College is tough for Larry - between classes, fraternities, and odd jobs there's hardly time for parties and chasing girls. So when a dating show comes to campus, Larry knows that getting on TV is his best chance ever to lay more than groundwork. Can Larry get on TV, get the girl, and not flunk out of college? It's all up to you in Leisure Suit Larry: Magna Cum Laude! Magna Cum Laude brings back humor from the most respected funny brand on PC - Leisure Suit Larry. Updated for the 21st century with 3D graphics, engaging conversations, and a fully realized college campus, Larry is back to give gamers some loving. Coming to PC and consoles. [Vivendi Universal]… Expand"}, {"name": "Madden NFL Arcade", "details_link": "https://www.metacritic.com/game/playstation-3/madden-nfl-arcade", "publisher": "EA Sports", "release_date": "Nov 24 2009", "developers": ["EA Tiburon"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 60, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/ba9a0fb8206febbcbd3c5dd0435dd56b-98.jpg", "descriptions": "[Playstation Network]  Feel the excitement of the NFL with a fun, fast-paced, 5-on-5 football experience. Madden NFL Arcade for brings the 10 best players from each of the 32 NFL teams on offense and defense together to battle it out on the gridiron. No penalties, no clock, just pure[Playstation Network]  Feel the excitement of the NFL with a fun, fast-paced, 5-on-5 football experience. Madden NFL Arcade for brings the 10 best players from each of the 32 NFL teams on offense and defense together to battle it out on the gridiron. No penalties, no clock, just pure adrenaline, as each team has four downs to march 60 yards downfield for the score. Madden NFL Arcade takes everything you love about your favorite NFL stars and stadiums and brings them to life in a fun, high-scoring gridiron battle! [Electronic Arts]… Expand"}, {"name": "Crackdown 3", "details_link": "https://www.metacritic.com/game/xbox-one/crackdown-3", "publisher": "Microsoft Game Studios", "release_date": "Feb 15 2019", "developers": ["Sumo Digital", "Elbow Rocket"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Action", "Sci-Fi", "Third-Person", "Shooter", "Action Adventure", "Open-World"], "meta_score": 60, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/9/9ff41abab319a1aca0dd03b03fd447eb-98.jpg", "descriptions": "Stop crime as a super-powered Agent of justice in Crackdown 3's sandbox of mayhem and destruction. Explore the heights of a futuristic city, race through the streets in a transforming vehicle, and use your powerful abilities to stop a ruthless criminal empire. Developed by original creatorStop crime as a super-powered Agent of justice in Crackdown 3's sandbox of mayhem and destruction. Explore the heights of a futuristic city, race through the streets in a transforming vehicle, and use your powerful abilities to stop a ruthless criminal empire. Developed by original creator Dave Jones, Crackdown 3 delivers cooperative mayhem and an all-new multiplayer mode where destruction is your ultimate weapon powered by Microsoft Cloud.… Expand"}, {"name": "Touch Detective", "details_link": "https://www.metacritic.com/game/ds/touch-detective", "publisher": "Atlus", "release_date": "Oct 24 2006", "developers": ["BeeWorks"], "platforms": ["iPhone/iPad", "DS"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/94fc48a3cec03a26ccbb291134afcc19-98.jpg", "descriptions": "(Known in the UK/EU as \"Mystery Detective\")  After her father unexpectedly passes away, Mackenzie inherits the family business: a renowned \rdetective agency in a fantastic world of mystery and intrigue. With the aid of her investigative \rassistant Funghi and her faithful servant Cromwell,(Known in the UK/EU as \"Mystery Detective\")  After her father unexpectedly passes away, Mackenzie inherits the family business: a renowned \rdetective agency in a fantastic world of mystery and intrigue. With the aid of her investigative \rassistant Funghi and her faithful servant Cromwell, Mackenzie sets off to prove herself worthy of \rbeing called... the Touch Detective. With the DS stylus, players can guide Mackenzie through crime scenes, talk to witnesses, and discover new evidence. Touching mysterious objects, people, or places allows essential case cracking clues to develop. The dual screens also enable players to simultaneously view clues, inventory, and maps throughout investigations. Features four thrilling full-length episodes with an additional 20 mini-quests. Gather evidence, question witnesses, and wrack your brain to crack the case! [Atlus Software]… Expand"}, {"name": "Spyro Orange: The Cortex Conspiracy", "details_link": "https://www.metacritic.com/game/game-boy-advance/spyro-orange-the-cortex-conspiracy", "publisher": "VU Games", "release_date": "Jun  3 2004", "developers": ["Vicarious Visions"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 60, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/ed71570a9a1348a129334f7deb75d441-98.jpg", "descriptions": "In Crash Bandicoot Purple: Ripto's Rampage and Spyro Orange: The Cortex Conspiracy, Dr. Neo Cortex--Crash's nemesis--and Ripto--Spyro's nemesis--have accidentally met up through underground portals and are set on taking over the entire universe. Crash and Spyro must team up with each otherIn Crash Bandicoot Purple: Ripto's Rampage and Spyro Orange: The Cortex Conspiracy, Dr. Neo Cortex--Crash's nemesis--and Ripto--Spyro's nemesis--have accidentally met up through underground portals and are set on taking over the entire universe. Crash and Spyro must team up with each other to discover the identity of the new menace and save the universe from this evil plot. In these side-scrolling adventures, you can link up with three friends for a variety of multiplayer modes, including Party Games, Wager Games, and Card Trading. Connecting both Crash Bandicoot Purple and Spyro Orange gives you the option of unlocking special content and allows you to trade and wager the cards with friends.… Expand"}, {"name": "Crouching Tiger, Hidden Dragon", "details_link": "https://www.metacritic.com/game/game-boy-advance/crouching-tiger-hidden-dragon", "publisher": "Ubisoft", "release_date": "Oct  9 2003", "developers": ["Ubisoft Shanghai"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/68f38ebf6c3612267af0a34ea0efbd4a-98.jpg", "descriptions": "Relive the epic story from the film in the game of Crouching Tiger, Hidden Dragon.  By stepping into the roles of each of the main characters--Li Mu Bai, Yu Shu Lien, Jen, and \"Dark Cloud\" Lo--you can unleash a variety of fighting techniques, weapons, stunts, and moves againstRelive the epic story from the film in the game of Crouching Tiger, Hidden Dragon.  By stepping into the roles of each of the main characters--Li Mu Bai, Yu Shu Lien, Jen, and \"Dark Cloud\" Lo--you can unleash a variety of fighting techniques, weapons, stunts, and moves against brutally gifted enemies.  Characters improve in skill throughout the game, learn new moves, and earn bonuses and rewards as they master the art of Wudan-style fighting.… Expand"}, {"name": "Starsky & Hutch", "details_link": "https://www.metacritic.com/game/playstation-2/starsky-hutch", "publisher": "Gotham Games", "release_date": "Sep  9 2003", "developers": ["Minds-Eye Productions"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/8add424a501c272caf5f25f831376e24-98.jpg", "descriptions": "Driving games are about to get a lot funkier. Based on the 70's television show, Starsky & Hutch will be careening to a home console near you this fall. Race through Bay City in Starsky's bright red Ford Torino, while Hutch takes aim at criminals with his .357 Magnum - but don't go thinkingDriving games are about to get a lot funkier. Based on the 70's television show, Starsky & Hutch will be careening to a home console near you this fall. Race through Bay City in Starsky's bright red Ford Torino, while Hutch takes aim at criminals with his .357 Magnum - but don't go thinking this will be a joy ride! If your driving and shooting skills can't keep the TV audience on the edge of their sofas, your ratings will plummet, the show will be cancelled, and it's game over! Don't think you can handle all the high-speed thrills by yourself? Find a partner and let them shoot while you drive. It's time to clean up the streets... in style! [Gotham Games]… Expand"}, {"name": "WarTech: Senko no Ronde", "details_link": "https://www.metacritic.com/game/xbox-360/wartech-senko-no-ronde", "publisher": "Ubisoft", "release_date": "May 29 2007", "developers": ["G.Rev"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 60, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/f656fc05454167deba93c1dce72b5c88-98.jpg", "descriptions": "WarTech: Senko no Ronde thrusts the player into a distant future where humanity has colonized countless new galaxies and Earth has become a planet mined for its natural resources. A violent war has erupted as nations struggle for world domination. Rounder Mechs fill the skies as the fate ofWarTech: Senko no Ronde thrusts the player into a distant future where humanity has colonized countless new galaxies and Earth has become a planet mined for its natural resources. A violent war has erupted as nations struggle for world domination. Rounder Mechs fill the skies as the fate of the world is determined through aerial combat. Fast Paced Arcade Fighting - Combine an almost limitless arsenal of special moves, power ups, and attack drones to unleash the most lethal combos. Challenge friends in head-to-head two-player or battle against the world's best players online and test your skills to improve your Xbox LIVE ranking. Choice of Rounder Mech Suits – Each of the eight Rounder Mechs feature two distinct variations, as well as an unlockable in-game B.O.S.S. mode, for 24 variations in all. Go blow-for-blow against the other Rounder Mechs, but be prepared, because at any moment you could find yourself battling an even deadlier enemy. [Ubisoft]… Expand"}, {"name": "Brawlout", "details_link": "https://www.metacritic.com/game/switch/brawlout", "publisher": "Angry Mob Games", "release_date": "Dec 19 2017", "developers": ["Angry Mob Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 60, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/cbbf2e689d14a1885245a3d947a679a9-98.jpg", "descriptions": "Brawlout packs a punch with couch and online play modes, blending platform fighter mechanics and traditional fighting game play into a stylish and fluid battle royale. Rather than slow-paced defensive battles, Brawlout goes all-out with the lightning-fast aerobatics which platform fightersBrawlout packs a punch with couch and online play modes, blending platform fighter mechanics and traditional fighting game play into a stylish and fluid battle royale. Rather than slow-paced defensive battles, Brawlout goes all-out with the lightning-fast aerobatics which platform fighters are famous for. Striking the balance between the growing competitive scene and the genre’s party game roots, Brawlout hopes to cater to the veteran platform fighter, the casual fan and the newcomer looking to make their mark. … Expand"}, {"name": "Enemy Territory: Quake Wars", "details_link": "https://www.metacritic.com/game/playstation-3/enemy-territory-quake-wars", "publisher": "Activision", "release_date": "May 27 2008", "developers": ["Z-Axis", "Ltd."], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/55077955d33e082508e5b418b724b9d7-98.jpg", "descriptions": "In this epic multiplayer-focused game, players can choose to defend humanity as a part of the Global Defense Force (GDF) or destroy it as a merciless Strogg alien invader. Players battle as one of five unique classes in either the conventionally armed GDF army or the futuristic StroggIn this epic multiplayer-focused game, players can choose to defend humanity as a part of the Global Defense Force (GDF) or destroy it as a merciless Strogg alien invader. Players battle as one of five unique classes in either the conventionally armed GDF army or the futuristic Strogg invasion force, each outfitted with specialist weapons and combat hardware. In this adrenaline pumping fight for survival, warring forces utilize a variety of different vehicles, deployable structures, and defense systems including quad-bikes, tanks, and alien walkers for epic ground assaults; or helicopters and anti-gravity ships to unleash airborne attacks. Throughout each battle, teams establish bases, deploy defense structures, artillery, radar, and advanced forward-command systems into enemy territory while constructing and demolishing obstacles to speed progress and gain a tactical advantage over the opponent. Enemy Territory: Quake Wars features 16-player battles on the console systems, delivering the ultimate team-and objective-based multiplayer experience. [Activision/id Software]… Expand"}, {"name": "Space Siege", "details_link": "https://www.metacritic.com/game/pc/space-siege", "publisher": "Sega", "release_date": "Aug 12 2008", "developers": ["Gas Powered Games"], "platforms": "PC", "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 60, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/2fde683727b292bb7d9c40bc1abed00a-98.jpg", "descriptions": "Space Siege takes place in the confines of the Armstrong, one of the few remaining colonization ships carrying the last bastions of human civilization after a devastating attack on Earth from an unknown alien race. Players take the role of Seth Walker, a cybernetics engineer suddenly thrustSpace Siege takes place in the confines of the Armstrong, one of the few remaining colonization ships carrying the last bastions of human civilization after a devastating attack on Earth from an unknown alien race. Players take the role of Seth Walker, a cybernetics engineer suddenly thrust into a struggle to save humanity from extermination. As the adventure progresses Seth is offered opportunities to sacrifice pieces of his humanity for cybernetic upgrades that will assist him in his mission to preserve the human race. But what price will he pay to save his own humanity? Only the player can decide Seth’s ultimate fate. Incorporating innovative cybernetic augmentations into its storyline, Space Siege explores the dilemmas faced while keeping one's humanity in the face of adversity. Cybernetic augmentations can be performed on every part of Seth’s body. On the extreme end, players are able to outfit Seth with cybernetic upgrades that leave little or none of his original humanity intact. But this choice comes with the risk of alienating Seth from the people he's trying to save. Players can also insist on preserving Seth’s humanity by not using upgrades, instead forging ahead clearing the Armstrong of its alien invaders with natural human ingenuity and strength. Such a decision increases the difficulty of completing his mission of uncovering and eliminating the alien menace that’s bent on destroying the human race. [Sega]… Expand"}, {"name": "Disney's Chicken Little", "details_link": "https://www.metacritic.com/game/playstation-2/disneys-chicken-little", "publisher": "Buena Vista Games", "release_date": "Oct 20 2005", "developers": ["Avalanche Software"], "platforms": ["PC", "PlayStation 2"], "genres": ["Action", "Platformer", "3D"], "meta_score": 60, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/8fe6b0244c2b9be33bff9797d67be220-98.jpg", "descriptions": "Disney's Chicken Little brings the excitement of the film to life and allows you to master unique gadgets and play as the key characters from the film in an endless variety of action-packed game play. Live the adventures of Chicken Little and his gang of misfit friends – Fish-Out-of-Water,Disney's Chicken Little brings the excitement of the film to life and allows you to master unique gadgets and play as the key characters from the film in an endless variety of action-packed game play. Live the adventures of Chicken Little and his gang of misfit friends – Fish-Out-of-Water, Runt of the Litter and Abby -- as the game catapults you into the hair-raising adventures of the movie and beyond. But it will take more than cool moves to complete each mission. Rocket jet packs, slingshots and hover boards get you out of sticky situations like alien invasions, spiraling asteroids, and corn field mazes. Saving the day takes an arsenal of gadgets, friends and hero power!  Features 17 action-packed levels that capture the key movie moments and environments, extending the experience into space. 6 multiplayer mini games for two-player fun. [Buena Vista Games]… Expand"}, {"name": "Fist of the North Star: Ken's Rage", "details_link": "https://www.metacritic.com/game/playstation-3/fist-of-the-north-star-kens-rage", "publisher": "Tecmo", "release_date": "Nov  2 2010", "developers": ["Koei", "Omega Force"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/50d8a1eb583ad18ab73742934fd38487-98.jpg", "descriptions": "A ravaged Earth struggles to survive after a nuclear holocaust has left the world in ruins. Survivors band together in communities and villages, living off what little resources remain. In the wastelands beyond, vicious gangs prey on the survivors for their resources, or sometimes merely forA ravaged Earth struggles to survive after a nuclear holocaust has left the world in ruins. Survivors band together in communities and villages, living off what little resources remain. In the wastelands beyond, vicious gangs prey on the survivors for their resources, or sometimes merely for sport.\r A mysterious martial artist named Ken, a man with seven scars on his chest and the chosen successor of the legendary assassin's art Hokuto Shinken (The Divine Fist of the North Star) has sworn to protect the weak and innocent from the malicious gangs roaming the scorched planet.… Expand"}, {"name": "Disintegration", "details_link": "https://www.metacritic.com/game/playstation-4/disintegration", "publisher": "Private Division", "release_date": "Jun 16 2020", "developers": ["V1 Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 60, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/e6ace2da612b1cea33531d2f1be28f76-98.jpg", "descriptions": "Dive into an action-drived first-person shooter, set in near-future sci-fi universe created by V1 Interactive, a newly-assembled studio of industry veterans. Journey into a vision of tomorrow where humankind is on the brink of extinction and has turned to technology in the hope of survival.Dive into an action-drived first-person shooter, set in near-future sci-fi universe created by V1 Interactive, a newly-assembled studio of industry veterans. Journey into a vision of tomorrow where humankind is on the brink of extinction and has turned to technology in the hope of survival. Using a process known as Integration, human minds are surgically implanted into robotic armatures creating a new form of sentient life. As a domineering enemy superpower known as the Rayonne emerges, take on the role of Romer Shoal, an expert Gravcycle pilot. Astride your heavily-modified craft (fitted with an armoured chassis and a powerful array of weapons), lead a small resistance force in the fight to save what remains of humanity.\r… Expand"}, {"name": "Natural Doctrine", "details_link": "https://www.metacritic.com/game/playstation-vita/natural-doctrine", "publisher": "NIS America", "release_date": "Sep 30 2014", "developers": ["Kadokawa"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General", "Fantasy", "Tactics"], "meta_score": 60, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/ffdc2f7fc17b7f05038d7002ac1a6c82-98.jpg", "descriptions": "Overcome the evils that inhabit the vast networks of mines and ruins in the areas surrounding the fortress city of Feste."}, {"name": "Online Chess Kingdoms", "details_link": "https://www.metacritic.com/game/psp/online-chess-kingdoms", "publisher": "Konami", "release_date": "Nov 28 2006", "developers": ["Konami", "Leviathan Games"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 60, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/2439f83042fd3ab8ec9c8c51548e141b-98.jpg", "descriptions": "Taking full advantage of the PSP system's wireless connectivity, Online Chess Kingdoms features extensive multiplayer modes including gameplay over the Internet. In addition, the game will offer comprehensive single player modes that will challenge the skills of even the most experiencedTaking full advantage of the PSP system's wireless connectivity, Online Chess Kingdoms features extensive multiplayer modes including gameplay over the Internet. In addition, the game will offer comprehensive single player modes that will challenge the skills of even the most experienced players. Combining powerful 3D graphics, animated battle sequences and storytelling as well as an intense Speed Chess mode, Online Chess Kingdoms delivers the ultimate interactive chess experience. 3D or 2D Interactive chess for the PSP using an advanced chess A.I. 5 different animated chess sets to choose from, including magicians, servants of chaos, and an aquatic civilization. Infrastructure online play - play chess against other players in an online environment to see who the best players are with a player ranking system. Speed chess mode gives players a quick dose of the classic board game. [Konami]… Expand"}, {"name": "Riverbond", "details_link": "https://www.metacritic.com/game/switch/riverbond", "publisher": "Cococucumber", "release_date": "Dec 10 2019", "developers": ["Cococucumber"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/20ee8c5032a40526d9c1008e398fcd89-98.jpg", "descriptions": "The Knight has imprisoned the leaders of the Eight Worlds, causing chaos, droughts and disarray! Adventure together to defeat evil and help the charming citizens of Riverbond in this action-packed journey through beautiful, hand-crafted worlds."}, {"name": "Terminator: Resistance", "details_link": "https://www.metacritic.com/game/pc/terminator-resistance", "publisher": "Reef Entertainment", "release_date": "Nov 14 2019", "developers": ["Teyon"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 60, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/f937f07f3c583d2aa91e5c00c9838377-98.jpg", "descriptions": "This story takes place in a post-apocalyptic Los Angeles, nearly 30 years after Judgement Day, and stars a brand new hero in the Terminator universe, Jacob Rivers, a soldier in the Resistance led by John Connor. Despite the fact that Jacob is just a lowly private, he'll soon discover thatThis story takes place in a post-apocalyptic Los Angeles, nearly 30 years after Judgement Day, and stars a brand new hero in the Terminator universe, Jacob Rivers, a soldier in the Resistance led by John Connor. Despite the fact that Jacob is just a lowly private, he'll soon discover that he's been specifically targeted by the latest threat from Skynet and marked for termination! Skynet may be destined to lose the war, but at what cost to Jacob? Experience the events leading up to the decisive final battle for the fate of mankind in the war against the machines!Features:* Choose what kind of action hero you want to be! Equip an epic arsenal of weaponry to run and gun or sneak and snipe through sprawling environments! The world isn't as forgiving as it used to be, so you'll need to find resources to help you out. If you can't find what you're looking for, then you better make it yourself.* Change the fate of mankind! Protect a motley crew of survivors, each with their own motivations and backstories. The actions you take throughout the game will impact their survival and change the ending you get.* Resist against the machines! Fight against a selection of iconic enemies from the films, including the T-800, as well as a host of enemies that are brand new to the Terminator universe!… Expand"}, {"name": "7 Wonders of the Ancient World", "details_link": "https://www.metacritic.com/game/ds/7-wonders-of-the-ancient-world", "publisher": "MumboJumbo", "release_date": "Sep 17 2007", "developers": ["Hot Lava Games"], "platforms": ["iPhone/iPad", "PC", "DS"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Matching", "General"], "meta_score": 60, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/ccd927ef5f9c711ad2ad5501b5b14051-98.jpg", "descriptions": "This action-adventure puzzler from developer Hot Lava lets gamers re-create history as they match magical runes to help workers build legendary landmarks of the ancient world such as the Great Pyramid of Giza and the Hanging Gardens of Babylon. 7 Wonders of the Ancient World lets gamersThis action-adventure puzzler from developer Hot Lava lets gamers re-create history as they match magical runes to help workers build legendary landmarks of the ancient world such as the Great Pyramid of Giza and the Hanging Gardens of Babylon. 7 Wonders of the Ancient World lets gamers explore ancient lands through three modes of play - Story, Free Play, and Rune Quest - that cover more than 140 levels and three modes of difficulty. Collect eye-popping powerups like the Lightning Bolt or Fire Bomb to help you in your race against the clock, and learn about history while having fun. [MumboJumbo]… Expand"}, {"name": "Art of Fighting Anthology", "details_link": "https://www.metacritic.com/game/playstation-2/art-of-fighting-anthology", "publisher": "SNK Playmore", "release_date": "May 17 2007", "developers": ["SNK Playmore"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/c4ac036aabe55d6aa9c5860308a6a574-98.jpg", "descriptions": "Art of Fighting Anthology is a comprehensive collection featuring the entire Art of Fighting trilogy and features 33 classic SNK characters, each with their own fighting styles and unique moves."}, {"name": "Spider-Man: Friend or Foe", "details_link": "https://www.metacritic.com/game/xbox-360/spider-man-friend-or-foe", "publisher": "Activision", "release_date": "Oct  2 2007", "developers": ["Next Level Games"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 60, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/1ce836db4ae1ba4728e2d46dccd7d891-98.jpg", "descriptions": "Spider-Man: Friend or Foe challenges players to defeat and then join forces with notorious movie nemeses including Doc Ock, Green Goblin, Venom and Sandman, and other classic Spider-Man characters. Players embark on a global quest to overcome an evil threat, by controlling Spider-Man and oneSpider-Man: Friend or Foe challenges players to defeat and then join forces with notorious movie nemeses including Doc Ock, Green Goblin, Venom and Sandman, and other classic Spider-Man characters. Players embark on a global quest to overcome an evil threat, by controlling Spider-Man and one of numerous Super Hero or Super Villain sidekicks, as they master unique fighting moves and styles while switching between characters to execute team combos and defeat foes. Spider-Man: Friend or Foe features a unique co-op mode in which a friend can join the game at any time and take control of Spidey’s sidekick as they battle through the game side-by-side and replay favorite levels. [Activision]… Expand"}, {"name": "Populous DS", "details_link": "https://www.metacritic.com/game/ds/populous-ds", "publisher": "XSEED Games", "release_date": "Nov 10 2008", "developers": ["Genki"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Strategy", "General", "General"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/3e74c7f3d41b8b7d3594dde24ce0740e-98.jpg", "descriptions": "The PC classic Populous makes its way to the Nintendo DS featuring 50 single player missions and four player mode."}, {"name": "White Knight Chronicles II", "details_link": "https://www.metacritic.com/game/playstation-3/white-knight-chronicles-ii", "publisher": "D3Publisher", "release_date": "Sep 13 2011", "developers": ["Level 5"], "platforms": "PlayStation 3", "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/4f85033d5955f4a9d5f32df77b78eb70-98.jpg", "descriptions": "White Knight Chronicles II is enhanced with stunning graphics, over 400 weapon and armor choices, and new fan-requested features.  For the first time, players can create an Incorruptus (a unique knight) for their own avatar and use it during online multiplayer quests for the first time ever."}, {"name": "Best Friend Forever", "details_link": "https://www.metacritic.com/game/switch/best-friend-forever", "publisher": "Alliance", "release_date": "Aug 27 2020", "developers": ["Starcolt"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 60, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/3396cffc72835136a339920f5cb01d1a-98.jpg", "descriptions": "Best Friend Forever is the world’s first simulation game to combine pet care and dating (just not necessarily at the same time). Train, pat and play with your very own dog to form a bond that will last the ages. With your four-legged companion by your side, meet, woo and cherish the manyBest Friend Forever is the world’s first simulation game to combine pet care and dating (just not necessarily at the same time). Train, pat and play with your very own dog to form a bond that will last the ages. With your four-legged companion by your side, meet, woo and cherish the many cuties of Rainbow Bay’s thriving singles scene.… Expand"}, {"name": "Mario & Sonic at the Rio 2016 Olympic Games", "details_link": "https://www.metacritic.com/game/3ds/mario-sonic-at-the-rio-2016-olympic-games", "publisher": "Nintendo", "release_date": "Mar 18 2016", "developers": ["Nintendo", "Sega Sports R&D"], "platforms": ["Wii U", "3DS"], "genres": ["Sports", "Individual", "Athletics"], "meta_score": 60, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/1b40f6ded051b897baff46c9b16b1848-98.jpg", "descriptions": "Mario, Sonic and their pals go to the ultimate training grounds for the Rio 2016 Olympic Games, the streets of Rio de Janeiro. Train with Mario or Sonic in their own stories, then test your skills in fourteen events. Soar high in BMX, blaze over 110m Hurdles, perfect your swing in Golf andMario, Sonic and their pals go to the ultimate training grounds for the Rio 2016 Olympic Games, the streets of Rio de Janeiro. Train with Mario or Sonic in their own stories, then test your skills in fourteen events. Soar high in BMX, blaze over 110m Hurdles, perfect your swing in Golf and field a team in Brazil's favorite sport: soccer. Get in the Games by training your Mii character in Mario or Sonic gyms led by top-notch trainers, like Donkey Kong or Tails. Inspire the city with your victories while searching for missing medals, or find out why Mario & Sonic's gyms are at odds. In any event, give your Mii an edge with outfits, like a pirate or a knight, or even character costumes like Toad or Knuckles. Compete with friends and family in all 14 events. Or for a new twist, try Plus Events - supercharged with Mario & Sonic elements. Dodge Goomba stacks in BMX, vault over Thwomps in Equestrian, or shoot at moving Boo targets in Archery.… Expand"}, {"name": "Corpse Party: Blood Drive", "details_link": "https://www.metacritic.com/game/playstation-vita/corpse-party-blood-drive", "publisher": "XSEED Games", "release_date": "Oct 13 2015", "developers": ["5pb"], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Survival"], "meta_score": 60, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/dbe65f09f51e9c3bbb4e3456cafa910e-98.jpg", "descriptions": "Corpse Party: Blood Drive is the final installment of the story that began with Corpse Party and continued in Corpse Party: Book of Shadows. Players take direct control of a character or party of characters and explore the ruins of Heavenly Host Elementary and other locations from a top-downCorpse Party: Blood Drive is the final installment of the story that began with Corpse Party and continued in Corpse Party: Book of Shadows. Players take direct control of a character or party of characters and explore the ruins of Heavenly Host Elementary and other locations from a top-down 3D perspective.… Expand"}, {"name": "SNK Heroines: Tag Team Frenzy", "details_link": "https://www.metacritic.com/game/playstation-4/snk-heroines-tag-team-frenzy", "publisher": "NIS America", "release_date": "Sep  7 2018", "developers": ["SNK Corporation"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/4bda2536c8b6fa0521131e48a55dc2a4-98.jpg", "descriptions": "Play online or with friends as SNK's iconic heroines in the brand-new 2 vs 2 fighting game, SNK Heroines: Tag Team Frenzy! Activate Special Moves with a single button, and make use of special items to change the tide of battle! However, the fight isn't over the moment you've chipped enoughPlay online or with friends as SNK's iconic heroines in the brand-new 2 vs 2 fighting game, SNK Heroines: Tag Team Frenzy! Activate Special Moves with a single button, and make use of special items to change the tide of battle! However, the fight isn't over the moment you've chipped enough health away. Once your opponent is on the ropes, utilize your Dream Finish technique to win the match! Spectate on other battles online, and wage on who you think will win using in-game points. Use your winnings to buy voice clips and accessories in an all-new costume system, and customize your favorite heroine to your heart's content!FEATURES:* Assemble Your Heroines and Battle Head-to-Head -- A brand new tag battle action fighting game is here! Players can participate in a four-multiplayer frenzy online or with friends!* An Iconic Cast of SNK's Female Characters! -- Choose from a generous roster of female heroines from the SNK universe!* Defeat Foes With Style and Elegance -- Coordination is key, as players can choose from up to 100 different accessories for their characters. Accessories including cat ears, glasses, face paint, and new sound effects.… Expand"}, {"name": "Teenage Mutant Ninja Turtles: Turtles in Time Re-Shelled", "details_link": "https://www.metacritic.com/game/xbox-360/teenage-mutant-ninja-turtles-turtles-in-time-re-shelled", "publisher": "Ubisoft", "release_date": "Aug  5 2009", "developers": ["Ubisoft Singapore"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/a0a25bd948f1030e87627309f3693200-98.jpg", "descriptions": "[Xbox Live Arcade]  The arcade classic has been revamped with all new 3-D graphics, but with the same classic beat-'em-up gameplay. Take on the Foot and bosses alone or in a team of four. Cowabunga, dudes! New graphics, classic gameplay: The game has upgraded 3-D graphics, but still features[Xbox Live Arcade]  The arcade classic has been revamped with all new 3-D graphics, but with the same classic beat-'em-up gameplay. Take on the Foot and bosses alone or in a team of four. Cowabunga, dudes! New graphics, classic gameplay: The game has upgraded 3-D graphics, but still features the same side-scrolling beat-'em-up gameplay we all love. Multiplayer: Play the four-player co-op and survival modes available online and locally. Cowabunga, dudes!: It's the Turtles back in one of their all-time classic arcade games, now playable on Xbox 360. [Ubosift]… Expand"}, {"name": "Assassin's Creed Chronicles: Russia", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-chronicles-russia", "publisher": "Ubisoft", "release_date": "Feb  9 2016", "developers": ["Ubisoft", "Climax Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["General", "Action Adventure", "Linear"], "meta_score": 60, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/2/f0c558945d09cc4f9c8931616e80fe13-98.jpg", "descriptions": "Assassin's Creed Chronicles: Russia occurs in Russia, 1918. Nikolai Orelov wants to leave with his family, but he is required to perform one last mission for the Assassin Order: infiltration of the house where the tsar's family is being held by the Bolsheviks and theft of an artifact thatAssassin's Creed Chronicles: Russia occurs in Russia, 1918. Nikolai Orelov wants to leave with his family, but he is required to perform one last mission for the Assassin Order: infiltration of the house where the tsar's family is being held by the Bolsheviks and theft of an artifact that has been fought over by Assassins and Templars for centuries. Along the way, he witnesses the massacre of the tsar's children, but manages to save the princess, Anastasia. He must escape the Templars while protecting the artifact and Anastasia. [Ubisoft]… Expand"}, {"name": "Dynasty Warriors 6", "details_link": "https://www.metacritic.com/game/xbox-360/dynasty-warriors-6", "publisher": "Koei", "release_date": "Feb 19 2008", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 60, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/4c93ac7661dfb44ce7769d8e18de39d8-98.jpg", "descriptions": "Set in Ancient China during the 3rd century, Dynasty Warriors 6 immerses gamers in a truly cinematic kung-fu action experience. Celebrated characters have been completely re-imagined with new weapons and fighting techniques motion-captured from some of today’s leading stuntmen and women inSet in Ancient China during the 3rd century, Dynasty Warriors 6 immerses gamers in a truly cinematic kung-fu action experience. Celebrated characters have been completely re-imagined with new weapons and fighting techniques motion-captured from some of today’s leading stuntmen and women in Asia. With the game’s new “Renbu” attack system and game controls, players can execute lightning-fast combos and the most dazzling fighting moves with ease. Developed from the ground up exclusively for next-generation platforms, the game's proprietary engine delivers the most chaotic and challenging Tactical Action experience to date. Players can use the landscape to elude the thousands of soldiers swarming the battlefield. But as players move and attack, adaptable enemy A.I. devises offensive and defensive combat tactics, and can retaliate with packs of fierce hunting dogs and patrol boats. All of the explosive action comes to life in high definition, 60 frames per second graphics. [KOEI]… Expand"}, {"name": "How to Survive", "details_link": "https://www.metacritic.com/game/pc/how-to-survive", "publisher": "505 Games", "release_date": "Oct 23 2013", "developers": ["EKO Software"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/de7587ea06107f06cbee2a91e64b2e6e-98.jpg", "descriptions": "Featuring a robust crafting system, unique survival guide and a host of playable characters, How to Survive strands players on a remote archipelago off the coast of Colombia in the aftermath of an unexplained accident...but you're not alone. In order to survive, you must fulfill the mostFeaturing a robust crafting system, unique survival guide and a host of playable characters, How to Survive strands players on a remote archipelago off the coast of Colombia in the aftermath of an unexplained accident...but you're not alone. In order to survive, you must fulfill the most basic of needs - seeking out food, water and shelter, as well as crafting dozens of tools and weapons from fishing rods to Molotov cocktails. Players can also team up with other survivors in local and online multiplayer story and challenge modes to take on a growing array of the infected.… Expand"}, {"name": "Pyramids", "details_link": "https://www.metacritic.com/game/3ds/pyramids", "publisher": "Enjoy Gaming", "release_date": "Oct 27 2011", "developers": ["Visual Impact"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 60, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/abb5c2d8a7e3a82c3da51432dd6b26e7-98.jpg", "descriptions": "Pyramids is  a puzzle/platform game where an explorer tries to get out the pyramids with his loots. The task will not be easy. Many traps, monsters and dangers will put your dexterity and ingenuity to the test.  The player will have to use TNT and a gun but his best friend remains his shovelPyramids is  a puzzle/platform game where an explorer tries to get out the pyramids with his loots. The task will not be easy. Many traps, monsters and dangers will put your dexterity and ingenuity to the test.  The player will have to use TNT and a gun but his best friend remains his shovel which allows him to create and destruct bricks. These bricks will be used as stairs, bridges, protections â€¦ The explorer will venture through 54 challenging 3D levels divided in 6 worlds.… Expand"}, {"name": "Wild Earth: African Safari", "details_link": "https://www.metacritic.com/game/wii/wild-earth-african-safari", "publisher": "Majesco Games", "release_date": "Apr 22 2008", "developers": ["Super X Studios"], "platforms": "Wii", "num_players": "1-3 ", "genres": ["Simulation", "Miscellaneous", "General", "General", "Edutainment"], "meta_score": 60, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/172d8daf8f25af7caf72f372e5aa5031-98.jpg", "descriptions": "Explore the wild and capture its natural beauty on film in Wild Earth: African Safari, a unique simulation for the Wii based on the PC game from Super X Studios.  Take award-winning pictures of exotic animals in their natural habitats without disturbing them. From running with herds of zebraExplore the wild and capture its natural beauty on film in Wild Earth: African Safari, a unique simulation for the Wii based on the PC game from Super X Studios.  Take award-winning pictures of exotic animals in their natural habitats without disturbing them. From running with herds of zebra to following hunting lions and scavenging vultures, Wild Earth: African Safari lets you risk it all to capture and create magazine-quality pictorials. [Majesco]… Expand"}, {"name": "Rooms: The Main Building", "details_link": "https://www.metacritic.com/game/wii/rooms-the-main-building", "publisher": "Hudson Entertainment", "release_date": "Mar 23 2010", "developers": ["Hudson Entertainment"], "platforms": ["iPhone/iPad", "PC", "Wii"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/db93960529f547b5ddfc80afba3f457b-98.jpg", "descriptions": "Your adventure begins when an invitation abruptly arrives at your doorstep and diverts you to an entrance of a world filled with mystic beauty. Getting there is the easy part, coming home will be the adventure. In this new world, you’ll need to reach the exit of each of the 100+ rooms byYour adventure begins when an invitation abruptly arrives at your doorstep and diverts you to an entrance of a world filled with mystic beauty. Getting there is the easy part, coming home will be the adventure. In this new world, you’ll need to reach the exit of each of the 100+ rooms by sliding pieces of the rooms along a 2-D plane, forcing you to use all of your ingenuity to escape. Your character can move from room to room as long as there’s a path that isn’t blocked by a wall or obstacle. As you continue the adventure, you’ll encounter several tools that will introduce new elements. Use teleporters, wardrobes, hydrants, and other objects to navigate your way through. Blending the simple gameplay elements of classic brain-teasers with a mystical adventure and an art style all its own, Rooms: The Main Building delivers a mystery filled adventure that will leave you stunned. [Hudson Entertainment]… Expand"}, {"name": "Adventure Island: The Beginning", "details_link": "https://www.metacritic.com/game/wii/adventure-island-the-beginning", "publisher": "Hudson Entertainment", "release_date": "May 25 2009", "developers": ["Hudson"], "platforms": "Wii", "num_players": "2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/2bdb17e831e1c5184a1f381fb894f28b-98.jpg", "descriptions": "[WiiWare]  Adventure Island: The Beginning comes to the Wii with exciting new skills and elements! Learn how to use new skills while exploring Adventure Island from coast to coast. Search for Golden Melons hidden throughout the stages and Mini Games. When obtaining Golden Melons, you'll be[WiiWare]  Adventure Island: The Beginning comes to the Wii with exciting new skills and elements! Learn how to use new skills while exploring Adventure Island from coast to coast. Search for Golden Melons hidden throughout the stages and Mini Games. When obtaining Golden Melons, you'll be able to purchase various items to help you on your adventure. Items purchased will increase your attack power or enable you to reach places you couldn't get to before. Fulfill certain requirements while playing in any of the modes to achieve a \"Master Higgins Feat\". You will be awarded a Master Higgins costume for doing so. [Nintendo]… Expand"}, {"name": "Urban Reign", "details_link": "https://www.metacritic.com/game/playstation-2/urban-reign", "publisher": "Namco", "release_date": "Sep 13 2005", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 60, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/78652cddeba770e00bfe87886e070681-98.jpg", "descriptions": "In Urban Reign, players assume the role of a gritty street brawler who has been hired by one of the city’s dominant gangs to protect its leader.  Players are thrown into a full-blown turf war, involving gang corruption and street justice that spans from the neighborhood block all the way toIn Urban Reign, players assume the role of a gritty street brawler who has been hired by one of the city’s dominant gangs to protect its leader.  Players are thrown into a full-blown turf war, involving gang corruption and street justice that spans from the neighborhood block all the way to the upper levels of city government. Urban Reign offers players non-stop, inner-city brawling action with no time restrictions or referees.  Back alleys, junkyards and bars serve as battlegrounds for more than 60 different fighters, all of which boast their own unique set of fighting styles including boxing, wrestling and street fighting. Players can select from over 30 weapons – including bottles, bats and 2x4's – to be used in the destructible arenas to add to the mayhem. Focusing on the urban-brawler style of street fighting, players can team up with an AI-controlled character to pull off a host of devastating and destructive combo maneuvers against multiple enemies throughout the game’s 100 missions. Urban Reign also supports multi-tap play for up to four players to determine who really rules the hood. [Namco]… Expand"}, {"name": "Last Days of Lazarus", "details_link": "https://www.metacritic.com/game/xbox-series-x/last-days-of-lazarus", "publisher": "GrimTalin", "release_date": "Jun 22 2022", "developers": ["Darkania Works"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/5a6acd708d6d96a19a3590d2fe48f448-98.jpg", "descriptions": "After their mother's suicide, Lazarus returns home to his sister Lyudmila. But unexplained events make the world and even reality collapse around him. Looming death, a spreading malediction and the supernatural threaten his sanity, yet Lazarus pushes forward to find the truth about hisAfter their mother's suicide, Lazarus returns home to his sister Lyudmila. But unexplained events make the world and even reality collapse around him. Looming death, a spreading malediction and the supernatural threaten his sanity, yet Lazarus pushes forward to find the truth about his family.Last Days of Lazarus is a first-person adventure game with a strong narrative and rich visuals drawing its inspiration from the post soviet era with a Gothic vibe and supernatural elements. As the story unravels, you'll meet questionable characters whose corrupted version of the truth you'll need to navigate. With a troubled past yourself, you'll struggle not only with solving the mysteries laid upon you but also with keeping alive any sliver of hope for salvation.… Expand"}, {"name": "Winter Ember", "details_link": "https://www.metacritic.com/game/pc/winter-ember", "publisher": "Blowfish Studios", "release_date": "Apr 19 2022", "developers": ["Sky Machine Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 60, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/9b1f786aaeaff3b591d87f47332f9913-98.jpg", "descriptions": "You are Arthur Artorias – the sole survivor of a massacre that devastated your family’s legacy and tore them out of the history books. Thought to be dead, you emerge from exile 8 years later, the faceless man kindled by the flame and seeking vengeance.  Embark on an adventure unravelling aYou are Arthur Artorias – the sole survivor of a massacre that devastated your family’s legacy and tore them out of the history books. Thought to be dead, you emerge from exile 8 years later, the faceless man kindled by the flame and seeking vengeance.  Embark on an adventure unravelling a dark tale filled with twisted characters, centered around a militant religion hell bent on keeping control.  \rKey Features:\rA True Stealth Experience\rAs Arthur, you must stick to the shadows, infiltrate homes and explore hidden passageways; but, be careful not to be spotted! Choose your playstyle: knocking out enemies may keep them quiet for some time, but they will eventually wake up; a quick slice to the throat may be a more permanent solution, but the bloodstain you leave on the carpet might be a dead giveaway! Keep your wits about you, dispose of bodies, peek through keyholes and pickpocket unsuspecting victims. \rDeep Arrow Crafting System\rPrepare for your mission by planning your loadout. With over 30 arrows to craft, experimentation is key to your success! Do you craft a smoke arrow to blind your opponent, or do you add on a poison element to create poisonious gas? Use your arrows offensively or defensively: break down weak walls with a blunt arrow to surprise your enemy, or use a rope arrow to reach a higher place and take out your enemies from a distance.\rSkill Tree\rCustomize your playstyle from 3 distinct skill trees – stealth, combat, and utility. Unlock over 70 unique passive and active skills to choose from and seek vengeance your way. \rExplore A Dark World\rReturn home to the cold Victorian town of Anargal, on the verge of technological breakthrough. Infiltrate and explore vast environments brimming with treasure and mystery. From rival gangs to unique characters, approach each scenario in a myriad of ways. Take advantage of the environment, find solutions to every problem, and move past any challenge standing in your way.  … Expand"}, {"name": "WRITHE", "details_link": "https://www.metacritic.com/game/switch/writhe", "publisher": "MissionCtrlStudios", "release_date": "Jan 15 2021", "developers": ["MissionCtrlStudios"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 60, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/a50d09ffd6b9dc63c3a787eed6b315b9-98.jpg", "descriptions": "Grab your guns and paint the floor with GRUBJUICE! WRITHE transports you to an alternate ‘70s Thailand, where an endless horde of mutant sago worms terrorize the good people of Bangkok. Suit up and lock ‘n’ load- it’s your duty as an exterminator to hold back this wriggling tide to the lastGrab your guns and paint the floor with GRUBJUICE! WRITHE transports you to an alternate ‘70s Thailand, where an endless horde of mutant sago worms terrorize the good people of Bangkok. Suit up and lock ‘n’ load- it’s your duty as an exterminator to hold back this wriggling tide to the last breath.\r Blast your way through ceaseless swarms of grubs to a thumping industrial soundtrack, and throw yourself into an original arcade FPS that will test your mettle at every turn. Fight to survive for as long as you can and earn your place among top exterminators on the global leaderboards. WRITHE is about knowing when to run and when to gun in a desperate struggle for precious seconds.\r - Retro style graphics with a modern twist\r- Endless waves of grubs both big and small to exterminate\r- Dual-wield a deadly shotgun and plasma rifle combo\r- Three unique arenas to take on\r- Defend your rank on the online leaderboards\r- Slay smoothly in both 30 and 60 FPS modes\r… Expand"}, {"name": "Wolcen: Lords of Mayhem", "details_link": "https://www.metacritic.com/game/pc/wolcen-lords-of-mayhem", "publisher": "Wolcen Studio", "release_date": "Feb 13 2020", "developers": ["Wolcen Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 60, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/403f1ee40b7dafc803d2a36f239367a3-98.jpg", "descriptions": "A dynamic hack’n’slash with no class restrictions. Choose your path as you level-up and play your character the way you want. Explore this shattered and corrupted world to uncover its ancient secrets and hidden truths."}, {"name": "Naruto to Boruto: Shinobi Striker", "details_link": "https://www.metacritic.com/game/xbox-one/naruto-to-boruto-shinobi-striker", "publisher": "Bandai Namco Games", "release_date": "Aug 31 2018", "developers": ["CyberConnect2", "Soleil", "Soleil Ltd."], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 60, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/42fbb02ae0facbcd22c9a0534d45fad8-98.jpg", "descriptions": "The Naruto franchise is back with a brand new experience in Naruto to Boruto: Shinobi Striker! This new game lets gamers battle as a team of 4 to compete against other teams online! Graphically, Shinobi Striker is also built from the ground up in a completely new graphic style. Lead yourThe Naruto franchise is back with a brand new experience in Naruto to Boruto: Shinobi Striker! This new game lets gamers battle as a team of 4 to compete against other teams online! Graphically, Shinobi Striker is also built from the ground up in a completely new graphic style. Lead your team and fight online to see who the best ninjas are!FEATURES:* 4 vs. 4 team based gameplay with 8 ninjas fighting simultaneously; play co-op with your friends to become the best ninjas online.* Enjoy a new graphic style with more vivid colors for characters, maps and ninjutsu.* Dynamic 3rd person ninja gameplay lets players take advantage of an arena environment with vertical running and jumping.* Features favorite Naruto characters and teams from the series including Naruto, Sasuke, and Team 7.… Expand"}, {"name": "Cube", "details_link": "https://www.metacritic.com/game/psp/cube", "publisher": "D3Publisher", "release_date": "Apr 30 2007", "developers": ["Metia Interactive"], "platforms": "PSP", "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/7aea91750c1ea983fd949f2760da9e66-98.jpg", "descriptions": "Cube is a strategy/puzzle game that challenges players to make their way through suspended 3D worlds of platforms and mazes. Cube offers single and multiplayer modes and allows players to create and share custom levels with friends. Each level is packed with obstacles and collectible itemsCube is a strategy/puzzle game that challenges players to make their way through suspended 3D worlds of platforms and mazes. Cube offers single and multiplayer modes and allows players to create and share custom levels with friends. Each level is packed with obstacles and collectible items for players of all ages to enjoy. Players can explore Cube on impulse or take down total environments in one sitting. More than 13 different entities/triggers/hazards from \"rolling bombs\" to \"sinker cubes\" either helps or hinders your progress or use them to create and share custom puzzles. [D3 Publisher of America]… Expand"}]