[{"name": "NBA Live 09 All-Play", "details_link": "https://www.metacritic.com/game/wii/nba-live-09-all-play", "publisher": "EA Sports", "release_date": "Oct  7 2008", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 51, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/c0f0c6cbecce548737ab40a1501af187-98.jpg", "descriptions": "Step onto the court and into the fun with a unique basketball experience designed exclusively for the Wii. NBA Live 09 All-Play offers more action, more often, with an over-the-top basketball experience designed with everyone in mind. Improved responsiveness and more control options makeStep onto the court and into the fun with a unique basketball experience designed exclusively for the Wii. NBA Live 09 All-Play offers more action, more often, with an over-the-top basketball experience designed with everyone in mind. Improved responsiveness and more control options make this game easier and more fun to play than ever before. [Electronic Arts]… Expand"}, {"name": "Brooktown High", "details_link": "https://www.metacritic.com/game/psp/brooktown-high", "publisher": "Konami", "release_date": "May 22 2007", "developers": ["Backbone Entertainment"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General", "Virtual", "Virtual Life"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/c78df120137124dbbbcae43ddc5154ad-98.jpg", "descriptions": "If you only knew then what you know now. Here is your chance to re-live your high school days by entering Brooktown High. Choose to play as male or female and create your own unique character. Interact with other students, each with their own distinct personalities and cliques. Find yourIf you only knew then what you know now. Here is your chance to re-live your high school days by entering Brooktown High. Choose to play as male or female and create your own unique character. Interact with other students, each with their own distinct personalities and cliques. Find your niche and hang out with jocks, nerds, preppies, and more. This is your senior year and your chance to find the guy or girl of your dreams. Create your own male or female character. Interact with other students with their own unique personalities. Go on dates in locations such as the movies, the beach, the mall, etc. Interactive mini-games. [Konami]… Expand"}, {"name": "Murdered: Soul Suspect", "details_link": "https://www.metacritic.com/game/xbox-one/murdered-soul-suspect", "publisher": "Square Enix", "release_date": "Jun  3 2014", "developers": ["Airtight Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Horror", "Survival"], "meta_score": 51, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/5c34d563b75bd740718e9046c00cf497-98.jpg", "descriptions": "Detective Ronan O'Connor's life is brought to an end when a brutal killer confronts him during a burglary. This detective with a checked past now finds himself trapped in the afterlife, his only escape from this nether world of \"Dusk\" is to bring the truth of his death and his killer toDetective Ronan O'Connor's life is brought to an end when a brutal killer confronts him during a burglary. This detective with a checked past now finds himself trapped in the afterlife, his only escape from this nether world of \"Dusk\" is to bring the truth of his death and his killer to light using his newly developed supernatural abilities. As Ronan, you can explore the town of Salem for clues, battle demon spirits to save your soul, and unearth revelations about who is responsible for your untimely death.… Expand"}, {"name": "Wing Commander Arena", "details_link": "https://www.metacritic.com/game/xbox-360/wing-commander-arena", "publisher": "EA Games", "release_date": "Jul 25 2007", "developers": ["Gaia Industries"], "platforms": "Xbox 360", "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 51, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/83c3270f2e6f9ce6b3195b77a274161a-98.jpg", "descriptions": "[Xbox Live Arcade]  Wing Commander Arena is a fast-paced space combat game where players can team up to attack other teams of ships. The game introduces the classic franchise to an arcade-style experience that allows up to 16 players online in battle at once. Players can propel their[Xbox Live Arcade]  Wing Commander Arena is a fast-paced space combat game where players can team up to attack other teams of ships. The game introduces the classic franchise to an arcade-style experience that allows up to 16 players online in battle at once. Players can propel their customized ship through space, fire torpedoes and unleash deadly gravity bombs as they try to climb the leader board. Online players will compete for Frag count, high score and dueling stats. Wing Commander Arena features four styles of play: single player, multi-team, multi-player free for all and multi-player duel. Within the game there are eight game maps that include team maps, free for all maps and dueling maps, so Wing Commander Arena offers a gameplay experience for every Arcade gamer, whether they want a quick ten minutes of action or a longer more immersive game. [Electronic Arts]… Expand"}, {"name": "Disney Planes", "details_link": "https://www.metacritic.com/game/wii-u/disney-planes", "publisher": "Disney Interactive Studios", "release_date": "Aug  6 2013", "developers": ["Behaviour Interactive"], "platforms": ["3DS", "PC", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "Flight", "General", "General", "Civilian"], "meta_score": 51, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/8fe950a4e85bf741da0299fdebf341e7-98.jpg", "descriptions": "Disney's Planes takes players on a high-flying, action-packed, fun-filled adventure with Dusty, a big-hearted, speed-loving crop duster."}, {"name": "Knights Contract", "details_link": "https://www.metacritic.com/game/playstation-3/knights-contract", "publisher": "Namco Bandai Games", "release_date": "Feb 22 2011", "developers": ["Game Republic"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Fantasy", "Third-Person", "General", "Fantasy", "Fantasy"], "meta_score": 51, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/8d7c9554b4da1aa776f2abce7f9471d1-98.jpg", "descriptions": "Set in the days when a healthy paranoia about witches was considered normal, Knights Contract follows the twisted tale of Heinrich, an immortal executioner, and Gretchen, a resurrected witch.  Once the victim of Heinrich's blade by the order of the game's antagonist, Dr. Faust, Gretchen nowSet in the days when a healthy paranoia about witches was considered normal, Knights Contract follows the twisted tale of Heinrich, an immortal executioner, and Gretchen, a resurrected witch.  Once the victim of Heinrich's blade by the order of the game's antagonist, Dr. Faust, Gretchen now has him under her control as the two must work together to rid the land of the supernatural foes who are cursing its people with the black spell of death.\r Armed with a razor sharp scythe and explosive witchcraft, players will use these tools with spectacular effects in order to return civility to the land.  As players succeed in their journey, they can deal tremendous damage to their on-comers or unleash a gruesome finisher by coordinating the efforts of Heinrich and Gretchen. However, players must also keep a close eye on Gretchen as her mortality is the key to the duo's survival as Heinrich can never be vanquished. It's time to let the combos fly and lay waste to the hordes of darkness with a liberal dose of medieval panache.… Expand"}, {"name": "Shadow the Hedgehog", "details_link": "https://www.metacritic.com/game/gamecube/shadow-the-hedgehog", "publisher": "Sega", "release_date": "Nov 15 2005", "developers": ["Sonic Team"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 51, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/f8391917273da1afdd6b90a3b566e341-98.jpg", "descriptions": "The world is in peril as forces, both good and evil, make a play for the powerful Chaos Emeralds. In Shadow the Hedgehog, you can control Shadow and choose which side to fight for. This 3D platformer lets you use weapons, vehicles, environmental objects, and time and space manipulation toThe world is in peril as forces, both good and evil, make a play for the powerful Chaos Emeralds. In Shadow the Hedgehog, you can control Shadow and choose which side to fight for. This 3D platformer lets you use weapons, vehicles, environmental objects, and time and space manipulation to combat your foes.… Expand"}, {"name": "Dance of Death: Du Lac & Fey", "details_link": "https://www.metacritic.com/game/pc/dance-of-death-du-lac-fey", "publisher": "Salix Games", "release_date": "Apr  5 2019", "developers": ["Salix Games", "Salix Games Ltd"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "3D", "Third-Person"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/bdc8a978d51a1c319b2a01ed76ba2832-98.jpg", "descriptions": "Victorian London is in peril. Jack the Ripper stalks the streets, tempting immortal Arthurian heroes, Sir Lancelot Du Lac and Morgana Le Fey, back to English shores. Will they arrive in time to end his reign of terror?"}, {"name": "Captain America: Super Soldier", "details_link": "https://www.metacritic.com/game/3ds/captain-america-super-soldier", "publisher": "Sega", "release_date": "Oct 25 2011", "developers": ["High Voltage Software"], "platforms": ["PlayStation 3", "Xbox 360", "3DS"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 51, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/131afd750f8cffd4bc7204652fa546d4-98.jpg", "descriptions": "Captain America: Super Soldier combines a highly athletic combat system with fluid platforming and a highly tuned suite of shield attacks, as Cap explores a massive castle turned military installation. His shield can be employed in numerous ways: taking out multiple enemies at once,Captain America: Super Soldier combines a highly athletic combat system with fluid platforming and a highly tuned suite of shield attacks, as Cap explores a massive castle turned military installation. His shield can be employed in numerous ways: taking out multiple enemies at once, deflecting incoming fire back at enemies, solving puzzles, and scaling walls. Players will be able to launch shield-first into the fray with the superior force of the world's first Super-Soldier at their fingertips and they'll need every bit of that strength to overcome a castle that's both an acrobatic playground for the Captain's physical prowess and a house of mystery with enemies and danger at every turn.… Expand"}, {"name": "The Revenge of Shinobi", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-revenge-of-shinobi", "publisher": "THQ", "release_date": "Nov 19 2002", "developers": ["3d6 Games"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/39f58cae39da848622d7767003cb19e3-98.jpg", "descriptions": "Set in the mythical world of ancient Japan, players take on the role of ninja warrior Shinobi. To free the world from the curse of Goaku, Shinobi must recover 5 elemental swords and defeat the Shoguns who wield them. It will take stealth, strength, and the mastery of the mystic arts forSet in the mythical world of ancient Japan, players take on the role of ninja warrior Shinobi. To free the world from the curse of Goaku, Shinobi must recover 5 elemental swords and defeat the Shoguns who wield them. It will take stealth, strength, and the mastery of the mystic arts for Shinobi to battle his way through the 5 lands.… Expand"}, {"name": "Destroyer Command", "details_link": "https://www.metacritic.com/game/pc/destroyer-command", "publisher": "Ubisoft", "release_date": "Feb 17 2002", "developers": ["Ultimation Inc."], "platforms": "PC", "num_players": "1-6 ", "genres": ["Simulation", "Ship", "Ship", "Marine", "Civilian"], "meta_score": 51, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/5cca22d6e694df26a8ae640352d222a2-98.jpg", "descriptions": "A 3D naval combat simulation which gives you command of a WWII era destroyer in the US Navy in either the Atlantic or Pacific Theaters. You can advance to command a division of destroyers and will participate in a variety of naval actions against Axis forces. You will stalk U-boats, swatA 3D naval combat simulation which gives you command of a WWII era destroyer in the US Navy in either the Atlantic or Pacific Theaters. You can advance to command a division of destroyers and will participate in a variety of naval actions against Axis forces. You will stalk U-boats, swat Kamikaze planes, escort convoys, blast enemy ships in surface actions or pound the beaches in support of infantry landings. [Ubi Soft]… Expand"}, {"name": "Blade", "details_link": "https://www.metacritic.com/game/playstation/blade", "publisher": "Activision", "release_date": "Nov 23 2000", "developers": ["Hammerhead"], "platforms": ["PC", "PlayStation"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 51, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/4ac4b818a08e5fd700f6b9e4e8d78b23-98.jpg", "descriptions": "Activision has enjoyed a pretty strong track record when it comes to translating comic books and movies into game form, but it's failed on both accounts here."}, {"name": "Bodycount", "details_link": "https://www.metacritic.com/game/playstation-3/bodycount", "publisher": "Codemasters", "release_date": "Aug 30 2011", "developers": ["Guildford Studio"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 50, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/4/899ee928d9e9c1ada58f9029a54f63b5-98.jpg", "descriptions": "Bodycount rips apart the first person shooter as genre-defining gunplay comes alive in a balletic orgy of bullets and destruction.\r Experience the intense thrill of close-quarters combat in a shreddable world as Bodycount blasts outrageous fire-fights and ferocious action from bothBodycount rips apart the first person shooter as genre-defining gunplay comes alive in a balletic orgy of bullets and destruction.\r Experience the intense thrill of close-quarters combat in a shreddable world as Bodycount blasts outrageous fire-fights and ferocious action from both barrels.  Become a powerful combat asset green-lighted to eliminate enemies known only as 'Targets' on behalf of the 'Network', ensnared in a clandestine global power struggle that rages away from the headlines and under the cover of conventional war zones. \r\rThis exhilarating shooter drops players into chaotic areas of operations equipped with a mouth-watering selection of contemporary weapons to tear through environments and enemies, chaining kills, earning power ups and building up a bullet meter to unleash devastating air strikes on enemies.    Complimented by co-operative online play and multiplayer modes, Bodycount will set new standards for spectacular, visceral gun play and put the fun back into the FPS.… Expand"}, {"name": "Gomo", "details_link": "https://www.metacritic.com/game/pc/gomo", "publisher": "Daedalic Entertainment", "release_date": "Dec  6 2013", "developers": ["Fishcow Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 50, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/5/4348d7d01cc8eb9ec86a9fabb0fafb29-98.jpg", "descriptions": "Gomo is point'n'click exploration game created by Fishcow Studio. Help Gomo to save his best friend - dog Dingo on his journey."}, {"name": "Flashback", "details_link": "https://www.metacritic.com/game/xbox-360/flashback", "publisher": "Ubisoft", "release_date": "Aug 21 2013", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["General", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 50, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/d94994f48ce37c6b3027141d0b6bf3c1-98.jpg", "descriptions": "Assume the role of Conrad B. Hart of the G.B.I. and unveil an intricate and deadly alien conspiracy that threatens everything that is human. However, before you can save the human race you have to rediscover who you are, as you look for the missing data files containing your memory to weaveAssume the role of Conrad B. Hart of the G.B.I. and unveil an intricate and deadly alien conspiracy that threatens everything that is human. However, before you can save the human race you have to rediscover who you are, as you look for the missing data files containing your memory to weave the puzzle together. Twenty years after the original game’s launch, Conrad is re-enlisted to active service for the triumphant return of one of the beloved adventure-action game.… Expand"}, {"name": "X-Men: The Official Game", "details_link": "https://www.metacritic.com/game/ds/x-men-the-official-game", "publisher": "Activision", "release_date": "May 16 2006", "developers": ["Amaze Entertainment"], "platforms": ["PC", "Xbox 360", "DS"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 50, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/a1be49fb912f77c830c82d8f6370cc24-98.jpg", "descriptions": "Master the power of the X-Men—Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms asMaster the power of the X-Men—Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms as lightning-fast Iceman. For even more power, utilize fury and adrenaline modes. Become a part of the X-Men movie universe—Embark on a globe-spanning conflict featuring every element of the X-Men universe—from favorite villains to famous locations such as Alkali Lake, plus the voices and likenesses of key actors from the films. Battle fierce enemies, join forces with comrades—Face off against movie villains such as Pyro, Magneto and Sabretooth, plus added foes like legions of Sentinels. Storm, Colossus and Cyclops join forces with you in gameplay that includes melee fighting, stealth-style action and time-based missions. [Activision]… Expand"}, {"name": "Generation Zero", "details_link": "https://www.metacritic.com/game/xbox-one/generation-zero", "publisher": "Avalanche Studios", "release_date": "Mar 26 2019", "developers": ["Avalanche Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 50, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/a827a6cd54879fcd5adc791399bdeef0-98.jpg", "descriptions": "Experience an explosive game of cat and mouse set in a vast open world - rendered with the award-winning Apex game engine. Experience an explosive game of cat and mouse set in a vast open world. In this reimagining of 1980’s Sweden, hostile machines have invaded the serene countryside, andExperience an explosive game of cat and mouse set in a vast open world - rendered with the award-winning Apex game engine. Experience an explosive game of cat and mouse set in a vast open world. In this reimagining of 1980’s Sweden, hostile machines have invaded the serene countryside, and you need to fight back while unraveling the mystery of what is really going on. By utilizing battle-tested guerilla tactics, you’ll be able to lure, cripple, or destroy enemies in intense, creative sandbox skirmishes.… Expand"}, {"name": "KumaWar", "details_link": "https://www.metacritic.com/game/pc/kumawar", "publisher": "Kuma Reality Games", "release_date": "Jul 16 2004", "developers": ["Kuma Reality Games"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 50, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/a2b9380323b8696959ed81c829fe7488-98.jpg", "descriptions": "Kuma Reality Games builds re-creations of real-world events using advanced gaming tools. KumaWar, the first Kuma Reality Game, is a first and third-person tactical squad-based game that provides multiple updates monthly to the consumer's computer to reflect unfolding events in the real worldKuma Reality Games builds re-creations of real-world events using advanced gaming tools. KumaWar, the first Kuma Reality Game, is a first and third-person tactical squad-based game that provides multiple updates monthly to the consumer's computer to reflect unfolding events in the real world including Operation Anaconda in Afghanistan and one based on the hunt for Saddam Hussein's sons Uday and Qusay. Each month KumaWar subscribers will receive playable missions, video news shows, extensive intelligence gathered from news sources around the world, and insight from a decorated team of military veterans. Kuma Reality Games, headquartered in New York, New York is a privately held company. [Kuma Reality Games]… Expand"}, {"name": "Terminator 3: Rise of the Machines", "details_link": "https://www.metacritic.com/game/game-boy-advance/terminator-3-rise-of-the-machines", "publisher": "Atari", "release_date": "Nov 18 2003", "developers": ["Taniko"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/3045b8a722aa2b3217a450f8fcb139d6-98.jpg", "descriptions": "You are the ultimate weapon in Terminator 3: Rise of the Machines.  Ten years after John Connor helped save mankind from annihilation, the inevitable has occurred: The mechanized Tech-Com forces have risen, and war between man and machine has begun.  As the Terminator, you must useYou are the ultimate weapon in Terminator 3: Rise of the Machines.  Ten years after John Connor helped save mankind from annihilation, the inevitable has occurred: The mechanized Tech-Com forces have risen, and war between man and machine has begun.  As the Terminator, you must use hand-to-hand combat or your massive weaponry to protect Connor, the would-be hero of the future.  Rise of the Machines immerses you in the Terminator 3 world, weaving in and out of the movie's storyline.… Expand"}, {"name": "Spirits & Spells", "details_link": "https://www.metacritic.com/game/gamecube/spirits-spells", "publisher": "DreamCatcher Interactive", "release_date": "Sep 24 2003", "developers": ["DreamCatcher Interactive"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 50, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/852cd9f6849ab841aa4e3cf617bb4858-98.jpg", "descriptions": "In Spirits & Spells, you can choose to play the role of Alicia, a girl disguised as a witch, or Greg, a boy disguised as a devil, as they attempt to rescue their friends from a mad scientist. You can alternate between the two characters at any time during the game and discover their varyingIn Spirits & Spells, you can choose to play the role of Alicia, a girl disguised as a witch, or Greg, a boy disguised as a devil, as they attempt to rescue their friends from a mad scientist. You can alternate between the two characters at any time during the game and discover their varying abilities. Explore creepy environments such as a haunted house, a dark cemetery, eerie forests, and an abandoned laboratory. To survive this Halloween world, you must solve puzzles and fight a variety of evil creatures.… Expand"}, {"name": "Postal 2", "details_link": "https://www.metacritic.com/game/pc/postal-2", "publisher": "Whiptail Interactive", "release_date": "Apr 14 2003", "developers": ["Running With Scissors"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 50, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/28a9e354f99a58ee154458a1d84c2878-98.jpg", "descriptions": "Forget what you know about first person shooters. Walk a week in the Postal Dude?s shoes. Freely explore full 3-D open ended environments. Interact with over 100 unique NPC's including Gary Coleman, marching bands, dogs, cats and elephants, protesters, policemen and civilians, with orForget what you know about first person shooters. Walk a week in the Postal Dude?s shoes. Freely explore full 3-D open ended environments. Interact with over 100 unique NPC's including Gary Coleman, marching bands, dogs, cats and elephants, protesters, policemen and civilians, with or without weapons. POSTAL 2 is all about choice; experiment with everyone and everything. And remember... it's only as violent as you are! [Running With Scissors]… Expand"}, {"name": "He-Man: Power of Grayskull", "details_link": "https://www.metacritic.com/game/game-boy-advance/he-man-power-of-grayskull", "publisher": "TDK Mediactive", "release_date": "Oct 29 2002", "developers": ["Taniko"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/79f9144c7beb9769c717136518c4383e-98.jpg", "descriptions": "The game's collision programming is quite frustrating, so much so that many players may just up and quit after they experience any number of truly unfair situations."}, {"name": "Men in Black II: Alien Escape", "details_link": "https://www.metacritic.com/game/playstation-2/men-in-black-ii-alien-escape", "publisher": "Infogrames", "release_date": "Jun 27 2002", "developers": ["Melbourne House"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 50, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/8a79cf5535dd37d5b7df7f6ad338c20b-98.jpg", "descriptions": "Equipped with an arsenal of unearthly ammo, it's up to Agents Jay and Kay to save the Earth from the scum of the universe. Wield stylish and extreme weapons such as the Carbonizer while fighting off perps like Shark Guy and Jarra. Enlist the aid of Zed while you're cleaning up the planet inEquipped with an arsenal of unearthly ammo, it's up to Agents Jay and Kay to save the Earth from the scum of the universe. Wield stylish and extreme weapons such as the Carbonizer while fighting off perps like Shark Guy and Jarra. Enlist the aid of Zed while you're cleaning up the planet in multiple NYC locations including a nuclear station and the alien space hulk. [Infogrames]… Expand"}, {"name": "Clive 'N' Wrench", "details_link": "https://www.metacritic.com/game/switch/clive-n-wrench", "publisher": "Numskull Games", "release_date": "Feb 24 2023", "developers": ["Clive Games", "Dinosaur Bytes Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/bbc60beec3b1755186846982d4a5a3da-98.jpg", "descriptions": "One fateful morning Professor Nancy Merricarp wakes to find that her proudly displayed time travel blueprints have been nabbed by the downright evil Dr Daucus! Luckily Nancy's cousin, Clive and her apprentice Wrench are there to help pursue the wicked doctor and put an end to his horridOne fateful morning Professor Nancy Merricarp wakes to find that her proudly displayed time travel blueprints have been nabbed by the downright evil Dr Daucus! Luckily Nancy's cousin, Clive and her apprentice Wrench are there to help pursue the wicked doctor and put an end to his horrid plans! But to do this they must travel through time themselves!Clive 'N' Wrench is a 3D platformer starring Clive, a rabbit, and Wrench, the literal monkey on his back. Your adventure takes you hurtling through time and space in a 1950's refrigerator on a heroic quest to thwart the tyrannical Dr Daucus and stop his evil plans.… Expand"}, {"name": "Stolen", "details_link": "https://www.metacritic.com/game/xbox/stolen", "publisher": "Hip Games", "release_date": "Apr 22 2005", "developers": ["Blue 52"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 50, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/e238391eed47454ca39c3d0a6acbbfa6-98.jpg", "descriptions": "Stolen is a third-person stealth action game in which you play as a sexy female thief. After your everyday job turns sour, you enter a web of conspiracy that threatens to destroy the entire city. With your stealth and agility, you'll break into and out of various locations (includingStolen is a third-person stealth action game in which you play as a sexy female thief. After your everyday job turns sour, you enter a web of conspiracy that threatens to destroy the entire city. With your stealth and agility, you'll break into and out of various locations (including museums, prisons, and satellite arrays) in an effort to steal priceless items. You'll have access to different high-tech gadgets and tools that will help you achieve your objectives.… Expand"}, {"name": "X-Blades", "details_link": "https://www.metacritic.com/game/playstation-3/x-blades", "publisher": "SouthPeak Games", "release_date": "Feb  6 2009", "developers": ["Gaijin Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 50, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/df369ebc36afffebded46d5116e9ed5a-98.jpg", "descriptions": "In the game, players control an anime-style heroine that destroys anything in her path using guns, blades, magic, and a healthy dose of cinematic flair. X-Blades features a special combination of cinematic style, beautiful animation, and relentless, high speed gameplay. Players assume theIn the game, players control an anime-style heroine that destroys anything in her path using guns, blades, magic, and a healthy dose of cinematic flair. X-Blades features a special combination of cinematic style, beautiful animation, and relentless, high speed gameplay. Players assume the role of Ayumi, a stunningly seductive yet tenacious heroine who battles enemies with her pistol blades, acrobatic ability, and magic spells. With full anime cut scenes, the story unfolds revealing demonic powers and spectacular landscapes, all ripe for exploration and battles. [SouthPeak Interactive]… Expand"}, {"name": "Dynasty Warriors 9 Empires", "details_link": "https://www.metacritic.com/game/pc/dynasty-warriors-9-empires", "publisher": "Koei Tecmo Games", "release_date": "Dec 22 2021", "developers": ["Koei Tecmo Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 50, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/310521f49521af7e41fcd330b954c5d3-98.jpg", "descriptions": "Empires, a unique \"Romance of the Three Kingdoms\" experience. Dramatic stories of officers on different sides. All 94 officers who have appeared in DYNASTY WARRIORS 9 are  playable. In addition, players can control all 700 common officers. A major change from previous series titles, areasEmpires, a unique \"Romance of the Three Kingdoms\" experience. Dramatic stories of officers on different sides. All 94 officers who have appeared in DYNASTY WARRIORS 9 are  playable. In addition, players can control all 700 common officers. A major change from previous series titles, areas around castles become battlefields, evolving into “Storming the Castle” instances. Employ strategic Secret Plans and balance Army Affinity to break through the enemy's gate. Defeat the enemy commander in Decisive Battle mode to claim victory of the castle. The Empires series' signature domestic system is back. With a high degree of flexibility, set long and mid term kingdom goals, recruit new officers, procure logistics, and execute a variety of military, economic and diplomatic commands to strive to unify China.… Expand"}, {"name": "Invizimals: The Lost Kingdom", "details_link": "https://www.metacritic.com/game/playstation-3/invizimals-the-lost-kingdom", "publisher": "SCEA", "release_date": "Sep 30 2014", "developers": ["Magenta Software"], "platforms": "PlayStation 3", "genres": ["Card Battle", "Action", "Strategy", "Miscellaneous", "Turn-Based", "Platformer", "3D", "Card Battle"], "meta_score": 50, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/5a2b3ac872f89048bc82124c19f8000b-98.jpg", "descriptions": "Explore the world of the Invizimals as the series comes to PS3 in a third-person adventure. You play Hiro, a young explorer who discovers a magical portal that teleports you to the Lost Kingdom – a land under attack from a cruel, rampaging robot army. Transform into 16 of the most popularExplore the world of the Invizimals as the series comes to PS3 in a third-person adventure. You play Hiro, a young explorer who discovers a magical portal that teleports you to the Lost Kingdom – a land under attack from a cruel, rampaging robot army. Transform into 16 of the most popular Invizimals, using their unique powers and abilities to solve puzzles and battle against your enemies. Link up with players of Invizimals: The Alliance on PlayStation Vita to swap bonus game items and stage electrifying four-player battles via Cross-Platform play. [Playstation Europe]… Expand"}, {"name": "Mark McMorris Infinite Air", "details_link": "https://www.metacritic.com/game/playstation-4/mark-mcmorris-infinite-air", "publisher": "Maximum Games", "release_date": "Oct 25 2016", "developers": ["HB Studios Multimedia"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Individual", "Ski / Snowboard"], "meta_score": 50, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/4dad73b700239080fb4bbf47510fcef7-98.jpg", "descriptions": "Mark McMorris Infinite Air is a fresh welcome into snowboarding for newcomers and a challenging step into ungroomed territory for seasoned boarders. Get ready to shred custom-built runs and show off gnarly tricks across vast, personalized terrain parks and 100+ square miles of back country."}, {"name": "Reservoir Dogs", "details_link": "https://www.metacritic.com/game/playstation-2/reservoir-dogs", "publisher": "Eidos Interactive", "release_date": "Oct 24 2006", "developers": ["SCi", "Volatile Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 50, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/843c67956db3ef42f0b62cd46a897286-98.jpg", "descriptions": "Reservoir Dogs is based on the 1992 Quentin Tarantino-directed classic movie about five total strangers who are brought together to carry out a diamond heist. The robbery goes wrong when the alarm is tripped and the cops show up. In the ensuing confusion, four of the robbers make it back toReservoir Dogs is based on the 1992 Quentin Tarantino-directed classic movie about five total strangers who are brought together to carry out a diamond heist. The robbery goes wrong when the alarm is tripped and the cops show up. In the ensuing confusion, four of the robbers make it back to their warehouse rendezvous but it is quickly apparent that one of them is an undercover police officer – but which one? Staying true to the original plot, this intense, third person shooter follows the progress and planning of the famed diamond heist while filling in some of the cliffhanger questions from the film: What happened to Mr. Blue and Mr. Brown? Where did Mr. Pink hide the diamonds? What actually happened at the heist? These questions and more will be answered as the game unfolds and according to the player's tactics. Players get to fill the shoes of each iconic character in the film as they relive the Reservoir Dogs experience complete with the movie’s trademark style and wit. The game will also feature the full and original soundtrack from the movie – the super sounds of the seventies brought alive with the thematic \"Little Green Bag\", \"Stuck in the Middle with You\" and more. [Eidos Interactive]… Expand"}, {"name": "Big Mutha Truckers 2", "details_link": "https://www.metacritic.com/game/xbox/big-mutha-truckers-2", "publisher": "THQ", "release_date": "Aug 23 2005", "developers": ["Eutechnyx"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 50, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/3/23d0379416171b80e8f3d04b93766fbf-98.jpg", "descriptions": "Dear sweet ol' Ma got busted! She's locked up tighter'n a big rig's brakes on a 40° grade. Ma's kids gotta git her some justice by bribin' six members of her jury - if they kin find 'em. And so Bobbie-Sue, Cletus, Earl and Rawkus set off once agin to buy an' sell goods all over HickDear sweet ol' Ma got busted! She's locked up tighter'n a big rig's brakes on a 40° grade. Ma's kids gotta git her some justice by bribin' six members of her jury - if they kin find 'em. And so Bobbie-Sue, Cletus, Earl and Rawkus set off once agin to buy an' sell goods all over Hick State County. They's all sorts of trouble a-waitin' fer 'em, like alien abducters, hobos and bikers, cops and rival truckers. Plus more special missions and different vehicles than you can shake a stickshift at.… Expand"}, {"name": "Devil May Cry 2", "details_link": "https://www.metacritic.com/game/switch/devil-may-cry-2", "publisher": "Capcom", "release_date": "Sep 19 2019", "developers": ["Capcom"], "platforms": ["PlayStation 2", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 50, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/bb0bd46fcc0be948cd46ede6287552fb-98.jpg", "descriptions": "Dante, the world's most stylish demon slayer is back to shake the legions of the underworld to their knees in Devil May Cry 2. This time, Dante has a new devilish partner: Lucia, a mysterious and acrobatic heroine. Don't let Dante's handsome face lull you, as he has some moves of his own,Dante, the world's most stylish demon slayer is back to shake the legions of the underworld to their knees in Devil May Cry 2. This time, Dante has a new devilish partner: Lucia, a mysterious and acrobatic heroine. Don't let Dante's handsome face lull you, as he has some moves of his own, including running and jumping on walls, aerial kicking, and the ability to simultaneously shoot in two directions. Unleash your inner demon as you battle hoards of monsters in massive, hellish environments.… Expand"}, {"name": "Spider-Man: Edge of Time", "details_link": "https://www.metacritic.com/game/3ds/spider-man-edge-of-time", "publisher": "Activision", "release_date": "Oct  4 2011", "developers": ["Beenox"], "platforms": ["PlayStation 3", "Xbox 360", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "Beat-'Em-Up", "Fantasy", "Third-Person", "Fantasy", "3D"], "meta_score": 50, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/e8d1aa91cb91dedaef0ebb3e6bd67d39-98.jpg", "descriptions": "Developed by Activision-owned studio Beenox, Spider-Man: Edge of Time challenges the player to take on the roles of both classic Amazing Spider-Man and Spider-Man 2099 to correct a timestream gone awry and prevent a catastrophic future brought on by the early and untimely death of Peter Parker."}, {"name": "Narco Terror", "details_link": "https://www.metacritic.com/game/xbox-360/narco-terror", "publisher": "Deep Silver", "release_date": "Jul 31 2013", "developers": ["Koch Media"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Modern", "Arcade"], "meta_score": 50, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/b7bef9f9ee58a6214da0718fed487e54-98.jpg", "descriptions": "Narco Terror is a wild, collateral-justice twin-stick shooter that combines the magnetism and atmosphere of 80's movies and games, with high-def visuals and overwhelming, destructive chaos. The campaign supports co-op play with up to two players on a single machine, or online co-op withNarco Terror is a wild, collateral-justice twin-stick shooter that combines the magnetism and atmosphere of 80's movies and games, with high-def visuals and overwhelming, destructive chaos. The campaign supports co-op play with up to two players on a single machine, or online co-op with players able to drop in or drop out at any point.… Expand"}, {"name": "Battlezone", "details_link": "https://www.metacritic.com/game/xbox-360/battlezone", "publisher": "Atari", "release_date": "Apr 16 2008", "developers": ["Stainless Games"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "Simulation", "Tank", "General"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/524e598d50649c7407a76d0abdce4c65-98.jpg", "descriptions": "[Xbox Live Arcade]  The original tank vs. tank action classic Battlezone has received an Xbox LIVE overhaul, adding new multiplayer modes including Deathmatch, Team Deathmatch, and Capture the Flag. This updated version also includes the original game. Additionally, players can use the Xbox[Xbox Live Arcade]  The original tank vs. tank action classic Battlezone has received an Xbox LIVE overhaul, adding new multiplayer modes including Deathmatch, Team Deathmatch, and Capture the Flag. This updated version also includes the original game. Additionally, players can use the Xbox LIVE Vision camera to watch live video of their opponents. Combine these features with new special effects for weapon firing, impacts and explosions, and you have the killer arcade classic as you've never experienced it before. [Atari]… Expand"}, {"name": "Death by Game Show", "details_link": "https://www.metacritic.com/game/pc/death-by-game-show", "publisher": "Oointah", "release_date": "Jan 22 2016", "developers": ["Oointah"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/d4cf65e362d18284b03d1a7cdf5f19b7-98.jpg", "descriptions": "A twitch-action and strategy game, a hybrid in which reaction and resources are equally important. Inspired by the movie Idiocracy, pop culture, and our skewed sense of humor, this is a twist on frenetic-off-the-wall-strategy."}, {"name": "Bugs vs. Tanks!", "details_link": "https://www.metacritic.com/game/3ds/bugs-vs-tanks!", "publisher": "Level 5", "release_date": "Jun 20 2013", "developers": ["Level 5", "NATSUME ATARI Inc."], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "General", "General", "Vehicle", "Combat"], "meta_score": 50, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/de73f56de231dee3741cafd345a12e6d-98.jpg", "descriptions": "Comcept's Keiji Inafune, whose work on MEGA MAN, Onimusha, and DEAD RISING have brought him international fame and acclaim, introduces BUGS vs. TANKS!, an action shooter set in World War II.  Players will take on the role of a WWII panzer squad that has been shrunk to the size of a bug andComcept's Keiji Inafune, whose work on MEGA MAN, Onimusha, and DEAD RISING have brought him international fame and acclaim, introduces BUGS vs. TANKS!, an action shooter set in World War II.  Players will take on the role of a WWII panzer squad that has been shrunk to the size of a bug and find themselves engaged in heated battles against swarms of giant insects as they cling to the hope of returning to normal size.… Expand"}, {"name": "Bubble Bobble Double Shot", "details_link": "https://www.metacritic.com/game/ds/bubble-bobble-double-shot", "publisher": "Ignition Entertainment", "release_date": "Mar  3 2008", "developers": ["Marvelous Entertainment"], "platforms": "DS", "num_players": "3  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 50, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/1/8e19a9dff4f98d62ef1c170cf782e46d-98.jpg", "descriptions": "The second Bubble Bobble action game for NDS brings back the core of the original series, and a third playable character Bubu is added to the mix. There are also mini games which require the use of stylus as well as the addition of color-coded enemies."}, {"name": "Minority Report: Everybody Runs", "details_link": "https://www.metacritic.com/game/playstation-2/minority-report-everybody-runs", "publisher": "Activision", "release_date": "Nov 18 2002", "developers": ["Treyarch"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 50, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/4e82a02bfd180eb12330098b6cce920b-98.jpg", "descriptions": "Based on Spielberg's futuristic thriller, Minority Report is the only game that lets you relive the movie experience, immersing you in a sci-fi action/adventure with weapons and devices straight out of the movie. Set in the near-future 2054, you are pre-crime officer John Anderton - head ofBased on Spielberg's futuristic thriller, Minority Report is the only game that lets you relive the movie experience, immersing you in a sci-fi action/adventure with weapons and devices straight out of the movie. Set in the near-future 2054, you are pre-crime officer John Anderton - head of an elite police squad able to predict and apprehend murderers before their crimes can be committed. [Activision]… Expand"}, {"name": "Disney's Magical Mirror Starring Mickey Mouse", "details_link": "https://www.metacritic.com/game/gamecube/disneys-magical-mirror-starring-mickey-mouse", "publisher": "Nintendo", "release_date": "Aug 13 2002", "developers": ["Capcom"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Fantasy"], "meta_score": 50, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/218aba4561858ce0cf9524e817514792-98.jpg", "descriptions": "One night, a mischievous ghost traps a sleepwalking Mickey Mouse in a magical mirror. Returning to his bed won't be easy, though, because Mickey must first recover the broken mirror pieces that have been strewn about the house by the prankish poltergeist. Just as in a Mickey cartoon, youOne night, a mischievous ghost traps a sleepwalking Mickey Mouse in a magical mirror. Returning to his bed won't be easy, though, because Mickey must first recover the broken mirror pieces that have been strewn about the house by the prankish poltergeist. Just as in a Mickey cartoon, you will have to outwit enemies and pull gags. You will also be able to uncover special souvenirs, such as Pluto's collar or Minnie's bow, which are all displayed in Mickey's room at the end of the game.… Expand"}, {"name": "Alfred Hitchcock presents The Final Cut", "details_link": "https://www.metacritic.com/game/pc/alfred-hitchcock-presents-the-final-cut", "publisher": "Ubisoft", "release_date": "Mar 31 2002", "developers": ["Arxel Tribe"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 50, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/0f7e1d24328da84e8e4c7bc9eaf43a19-98.jpg", "descriptions": "They say money can buy everything... even murder. Millionaire Robert Marvin-Jones, obsessed with the films of Hitchcock, is making a mystery movie of his very own - until his entire film crew vanishes from his estate. As Joseph Shamley, a private eye hired by Jones' fetching niece, you mustThey say money can buy everything... even murder. Millionaire Robert Marvin-Jones, obsessed with the films of Hitchcock, is making a mystery movie of his very own - until his entire film crew vanishes from his estate. As Joseph Shamley, a private eye hired by Jones' fetching niece, you must lead the search for the missing crew. But are you ready to stomach the sordid truth behind the secrets? [Ubi Soft]… Expand"}, {"name": "Spyro: Shadow Legacy", "details_link": "https://www.metacritic.com/game/ds/spyro-shadow-legacy", "publisher": "VU Games", "release_date": "Oct 18 2005", "developers": ["Amaze Entertainment"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 50, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/f4c328bc29a9022fae7a1492ff4cfb5b-98.jpg", "descriptions": "Developed by Amaze Entertainment, Spyro Shadow Legacy – for the first time – introduces magical powers, role playing game elements, and martial arts fighting to the beloved Spyro gameplay. Spyro Shadow Legacy introduces role playing elements to the Dragon Realms, offering Spyro fans an \"RPGDeveloped by Amaze Entertainment, Spyro Shadow Legacy – for the first time – introduces magical powers, role playing game elements, and martial arts fighting to the beloved Spyro gameplay. Spyro Shadow Legacy introduces role playing elements to the Dragon Realms, offering Spyro fans an \"RPG light\" experience with all new gameplay features. By fighting and defeating creatures in the game, players earn experience points that improve Spyro’s strength and abilities. This RPG element allows players to use their experience to build Spyro’s new magical powers and martial arts combat abilities as the game progresses. The game leverages all of the technical innovations of the Nintendo DS, including dual screen, touch screen, wireless capabilities and 3D graphics. With touch screen controls, players can draw symbols to cast spells or use the second screen as an overhead map. Players can utilize the Nintendo DS wireless capabilities to trade collectible creatures with other players nearby. [Vivendi Universal]… Expand"}, {"name": "Divide", "details_link": "https://www.metacritic.com/game/playstation-4/divide", "publisher": "Exploding Tuba Studios", "release_date": "Jan 31 2017", "developers": ["Exploding Tuba Studios"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/5302d011d3d0941da6fed5607c5937db-98.jpg", "descriptions": "Divide is a character-driven, science fiction action/adventure game with a modern take on isometric adventures of the past. Search for clues that reveal new insight into the story, interact with fully realized characters, and combat enemies by hacking out of sight, or launching a direct assault."}, {"name": "A Witch's Tale", "details_link": "https://www.metacritic.com/game/ds/a-witchs-tale", "publisher": "NIS America", "release_date": "Oct 13 2009", "developers": ["Nippon Ichi Software", "Hit Maker"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 50, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/b609b219990dcb8444ef5753b2a942a7-98.jpg", "descriptions": "When young witch-in-training Lidell accidentally unleashes an ancient evil upon the world, she must revisit the lands of classic fairy tales to free them from the clutches of the Eld Witch. Intuitive touch screen controls put the magic at your fingertips. [NIS America]"}, {"name": "AO International Tennis", "details_link": "https://www.metacritic.com/game/playstation-4/ao-international-tennis", "publisher": "Big Ant Studios", "release_date": "May  8 2018", "developers": ["Big Ant Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 50, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/b04b8e41a025cc2d748a4cc5590cc807-98.jpg", "descriptions": "Supported by a community, download and play with thousands of players created by other AO International Tennis fans, including photo-realistic players created through Big Ant Studios’ proprietary PlayFace application."}, {"name": "AereA", "details_link": "https://www.metacritic.com/game/xbox-one/aerea", "publisher": "Soedesco", "release_date": "Jun 30 2017", "developers": ["Triangle Studios", "Soedesco"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 50, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/37904ecb815e53ad886a0d7b1b6b6335-98.jpg", "descriptions": "AereA is a music themed Action RPG in which you play as one of Great Maestro Guido's disciples and explore Aezir; a floating island that was broken into pieces. Your mission is to find and return the nine primordial instruments to restore balance and peace to the world.\r You have to findAereA is a music themed Action RPG in which you play as one of Great Maestro Guido's disciples and explore Aezir; a floating island that was broken into pieces. Your mission is to find and return the nine primordial instruments to restore balance and peace to the world.\r You have to find your way through all parts of the scattered islands; complete quests, solve puzzles, defeat bosses and discover the truth behind the islands. Will you be able to return the nine primordial instruments?\r Play as Wolff the Harp-Archer, Jacques the Cello-Knight, Jules the Lute-Mage, Claude the Trumpet-Gunner, or team up with your friends in local co-op. Collect Music Sheets to learn new skills and customize your weapons to your play style.… Expand"}, {"name": "Double Dragon IV", "details_link": "https://www.metacritic.com/game/pc/double-dragon-iv", "publisher": "Arc System Works", "release_date": "Jan 30 2017", "developers": ["Arc System Works"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 50, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/eeb29c4e4e01cb41efdbb95d26436958-98.jpg", "descriptions": "The next entry in the side-scrolling action game series Double Dragon is finally here!\rThe story picks up after the elimination of the Shadow Warriors in Double Dragon II!"}, {"name": "X-Blades", "details_link": "https://www.metacritic.com/game/xbox-360/x-blades", "publisher": "SouthPeak Games", "release_date": "Feb  6 2009", "developers": ["Gaijin Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 50, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/4696c8fbeddc6f097f1392b1ba5bb655-98.jpg", "descriptions": "In the game, players control an anime-style heroine that destroys anything in her path using guns, blades, magic, and a healthy dose of cinematic flair. X-Blades features a special combination of cinematic style, beautiful animation, and relentless, high speed gameplay. Players assume theIn the game, players control an anime-style heroine that destroys anything in her path using guns, blades, magic, and a healthy dose of cinematic flair. X-Blades features a special combination of cinematic style, beautiful animation, and relentless, high speed gameplay. Players assume the role of Ayumi, a stunningly seductive yet tenacious heroine who battles enemies with her pistol blades, acrobatic ability, and magic spells. With full anime cut scenes, the story unfolds revealing demonic powers and spectacular landscapes, all ripe for exploration and battles. [SouthPeak Interactive]… Expand"}, {"name": "Tao's Adventure: Curse of the Demon Seal", "details_link": "https://www.metacritic.com/game/ds/taos-adventure-curse-of-the-demon-seal", "publisher": "Konami", "release_date": "Mar 21 2006", "developers": ["Konami", "Konami Software Shanghai"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Role-Playing", "General", "General"], "meta_score": 50, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/c40d35b259eb9daa4345d8786982f169-98.jpg", "descriptions": "Take on the role of Tao, a young magical student trying to master the Magical Arts. One day, the Demon Seal from a faraway Monster Tower cracked and let loose hoards of ferocious ancient monsters. In Tao's village, the village of the Bente Island, an extremely powerful monster curses theTake on the role of Tao, a young magical student trying to master the Magical Arts. One day, the Demon Seal from a faraway Monster Tower cracked and let loose hoards of ferocious ancient monsters. In Tao's village, the village of the Bente Island, an extremely powerful monster curses the townspeople, including Tao's family, turning them all into stone. Tao must find a way to master the art of magic, repair the Demon Seal, destroy the curse and save his family. In order to break the curse, Tao must find the monster egg of the ancient monster that cursed his family, Straitser. With that egg, he can return to the village and the last remaining elders can break the evil curse, although if Tao does not return by the next full moon, the curse will never be broken. [Konami]… Expand"}, {"name": "Afterfall: InSanity", "details_link": "https://www.metacritic.com/game/pc/afterfall-insanity", "publisher": "Nicolas Intoxicate", "release_date": "Nov 25 2011", "developers": ["Nicolas Intoxicate"], "platforms": "PC", "genres": ["Role-Playing", "PC-style RPG", "Action Adventure", "Horror", "Survival"], "meta_score": 50, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/8740847837e527ef03b1ad44940ea40e-98.jpg", "descriptions": "Year 2035\r \rAlmost 20 years ago the citizens of The Republic were forced to hide from the turmoil of the Third World War. The lucky ones secured their places in shelters  the fruit of proper forethought and planning. Now, when the fear of death is but a bitter memory, their safe hideoutYear 2035\r \rAlmost 20 years ago the citizens of The Republic were forced to hide from the turmoil of the Third World War. The lucky ones secured their places in shelters  the fruit of proper forethought and planning. Now, when the fear of death is but a bitter memory, their safe hideout turns into a cursed prison. It should come as no surprise that some find this claustrophobia unbearable and the tiresome dream suddenly becomes a nightmare...\r In Afterfall: InSanity our character, Albert, is a member of a team of medics, whose job is to monitor mental stability of shelter inhabitants. He specializes in the confinement syndrome, even though he is not entirely free from its symptoms himself. When all the hell unleashes, Albert will have to find answers to a crucial question: Who is behind all this and why?\", and try to filter his friends from the enemies. Not only will he face dangers lurking in the dark, but also overcome his own fears and weaknesses.\r \rInSanity is a hardcore survival psycho horror that will cause fear and boost adrenaline in the minds and veins of all genre aficionados. In the claustrophobia of confined underground space, from which there is no escape, shadows veil mysteries much darker than simply the madness of shelter  inhabitants.\r Albert will have to deal with numerous riddles, monsters, and difficult decisions to make. He has a difficult task at hand as he has to rely on his reflexes, but also prove that he can think logically and show extraordinary deduction skills\rPlay, overcome your fears, save the inhabitants of the shelter, and find a safe haven...… Expand"}, {"name": "The Good Life", "details_link": "https://www.metacritic.com/game/switch/the-good-life", "publisher": "Playism", "release_date": "Oct 15 2021", "developers": ["White Owls"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Role-Playing", "General"], "meta_score": 50, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/5b6008216e66bcaf996d81ab2df7c023-98.jpg", "descriptions": "Play as Naomi, a journalist from New York who moves to a backwoods British town called Rainy Woods in order to pay off her massive debt.The only way for her to escape from debt hell is to take pictures of happenings in the town and report on them. Of course, 'the happiest town in thePlay as Naomi, a journalist from New York who moves to a backwoods British town called Rainy Woods in order to pay off her massive debt.The only way for her to escape from debt hell is to take pictures of happenings in the town and report on them. Of course, 'the happiest town in the world' is not your average town... The inhabitants of the happiest town in the world are some of the most bizarre people you'll ever come across. You'll live alongside them as you solve mysteries and experience a hearty helping of craziness. We're sure that you'll eventually come to love all the mystery, horror, and good old charm that this town has to offer.… Expand"}, {"name": "Hurry Up Hedgehog!", "details_link": "https://www.metacritic.com/game/ds/hurry-up-hedgehog!", "publisher": "Oxygen Interactive", "release_date": "Jun 16 2009", "developers": ["Ivolgamus"], "platforms": "DS", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/cb31b5f5f9b248e6b28d2b88b6a41840-98.jpg", "descriptions": "(Currently available in the UK/EU only)  An intriguing brainteaser challenging the whole family to shrewdly manoeuvre their way to victory. Jostling against the canniest critters in the garden players must dodge hazards, out-smart their friends and use cunning to race their hedgehog’s home.(Currently available in the UK/EU only)  An intriguing brainteaser challenging the whole family to shrewdly manoeuvre their way to victory. Jostling against the canniest critters in the garden players must dodge hazards, out-smart their friends and use cunning to race their hedgehog’s home. Race, creep, jostle and out-manoeuvre in this intriguing multi-player brainteaser for all ages. Hurry Up Hedgehog! game play dynamic is based on the popular board game Igel Ärgern (also known as Egelrace) loosely translated \"Hedgehogs in a Hurry” and designed by Doris Matthäus and Frank Nestel. Single DS Multiplayer and Multi-Card Multiplayer for up to 6 players. 6 graphic sets, and 5 rule customisation options, allowing for 32 unique ways to play. Stylus control througout. [Oxygen Games]… Expand"}, {"name": "Funky Barn", "details_link": "https://www.metacritic.com/game/wii-u/funky-barn", "publisher": "505 Games", "release_date": "Nov 18 2012", "developers": ["Tantalus"], "platforms": ["3DS", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General", "Virtual", "Virtual Life"], "meta_score": 50, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/b50709a5a632a09d1eb152109de06532-98.jpg", "descriptions": "Its farming! but not as you know it...\r Slap on your straw hat and grubbiest coveralls and take hold of your Wii U GamePad - it's time to get your hands dirty! Devote yourself to your own slice of lush countryside and take up the challenge of creating a beautiful farmland full of animals,Its farming! but not as you know it...\r Slap on your straw hat and grubbiest coveralls and take hold of your Wii U GamePad - it's time to get your hands dirty! Devote yourself to your own slice of lush countryside and take up the challenge of creating a beautiful farmland full of animals, crops, trees and more then develop it into the craziest, most offbeat farm imaginable, overflowing with the whackiest contraptions and goofiest gizmos you and your animals have ever seen! This is not your ordinary farm...\r It's your farm - and it's like no farm you've seen before!… Expand"}, {"name": "Wolfenstein: Cyberpilot", "details_link": "https://www.metacritic.com/game/playstation-4/wolfenstein-cyberpilot", "publisher": "Bethesda Softworks", "release_date": "Jul 26 2019", "developers": ["MachineGames"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 50, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/3/9a23a2e25d6f1e6431266e90f03ea6bd-98.jpg", "descriptions": "Wolfenstein: Cyberpilot brings virtual reality to the revolution against the Nazis. Paris. 1980. You’re the best hacker in town. Your mission: aid the French resistance by taking control of powerful Nazi war machines. Saddle up, Cyberpilot, you’re one of us now."}, {"name": "Lust for Darkness", "details_link": "https://www.metacritic.com/game/pc/lust-for-darkness", "publisher": "Movie Games", "release_date": "Jun 12 2018", "developers": ["Movie Games"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 50, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/0362c89fffaa2870ccf2068d3b5b22ab-98.jpg", "descriptions": "A psychological horror of seeking satisfaction on the border of two intertwining worlds. An intriguing plot with erotic and occult themes guides the player's character through the Yelvertons' Victorian mansion and a perverse land inspired with Lovecraft's works and paintings of ZdzisławA psychological horror of seeking satisfaction on the border of two intertwining worlds. An intriguing plot with erotic and occult themes guides the player's character through the Yelvertons' Victorian mansion and a perverse land inspired with Lovecraft's works and paintings of Zdzisław Beksiński.\r… Expand"}, {"name": "Dead Space 3: Awakened", "details_link": "https://www.metacritic.com/game/xbox-360/dead-space-3-awakened", "publisher": "Electronic Arts", "release_date": "Mar 12 2013", "developers": ["Visceral Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Action Adventure", "Shooter", "Shooter", "Linear", "Third-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 50, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/fba433cd23f763dcebd7ca63d9d2a3aa-98.jpg", "descriptions": "Left for dead on Tau Volantis, Isaac Clarke and John Carver face a daunting journey. As madness takes hold, they find they can't trust their eyes or each other. The trek leads to the ship Terra Nova, now home to a sadistic cult of Unitologists.  The horror continues as the Dead Space sagaLeft for dead on Tau Volantis, Isaac Clarke and John Carver face a daunting journey. As madness takes hold, they find they can't trust their eyes or each other. The trek leads to the ship Terra Nova, now home to a sadistic cult of Unitologists.  The horror continues as the Dead Space saga enters its darkest chapter.… Expand"}, {"name": "Gods & Heroes: Rome Rising", "details_link": "https://www.metacritic.com/game/pc/gods-heroes-rome-rising", "publisher": "SouthPeak Games", "release_date": "Jun 21 2011", "developers": ["Heatwave Interactive"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 50, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/904bc695bb8c99bd793ce5f85b2729d2-98.jpg", "descriptions": "Gods and Heroes: Rome Rising is a massively multi-player game designed by Stieg Hedlund, the lead designer of \"Diablo II.\"  Players become classic heroes of the ancient world, born of immortal blood. As a scion of the gods, each player will have the opportunity to pursue his destiny throughGods and Heroes: Rome Rising is a massively multi-player game designed by Stieg Hedlund, the lead designer of \"Diablo II.\"  Players become classic heroes of the ancient world, born of immortal blood. As a scion of the gods, each player will have the opportunity to pursue his destiny through a series of Epic Quests that will span all levels of gameplay, over time commanding amazing God Powers and acquiring famous weapons and treasure of myth. The game is set in Rome around 300 BC, a time when the Republic is powerful, but Roman enemies including the Carthaginians, Gauls, and Samnites threaten the fledgling imperial holdings. Worse, the land is beset by terrible creatures, such as Gorgons, Cyclopes, and Furies. As heroes of Rome, players will take on missions to expand and protect the Republic, her interests, and her citizens, and will serve one of the twelve great Roman gods. Gods and Heroes: Rome Rising will implement the most interactive, dynamic, strategic and engaging combat system of any MMG -- challenging players before battle as well as during battle. Players will strategically select and train their NPC Soldiers in a variety of skills and abilities to form individual squads that meet specific challenges, and devise strategies and create formations for these squads to execute on command -- maximizing the unique skills and abilities of each individual squad. [Perpetual Entertainment]… Expand"}, {"name": "The Incredible Hulk", "details_link": "https://www.metacritic.com/game/ds/the-incredible-hulk", "publisher": "Sega", "release_date": "Jun  5 2008", "developers": ["Amaze Entertainment"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1-2 ", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/703f5d4fe42d325decada6f1ad09dc15-98.jpg", "descriptions": "Fast-paced and action-packed, the blockbuster franchise and comic book saga unfolds for the first time on next-generation platforms, as Banner scours the planet trying to find anything to help him fight his involuntary rage. Take the role of one of Marvel's most powerful Super Heroes in TheFast-paced and action-packed, the blockbuster franchise and comic book saga unfolds for the first time on next-generation platforms, as Banner scours the planet trying to find anything to help him fight his involuntary rage. Take the role of one of Marvel's most powerful Super Heroes in The Incredible Hulk, a third-person action video game. Gamers can demolish anything in their path, including lampposts, passing cars and even buildings. The fury-fueled game also features key moments from the film, as well as additional plotlines and characters from The Incredible Hulk universe. Players crash through New York City, battling gigantic enemies amidst soaring skyscrapers in a massive open world. [Sega]… Expand"}, {"name": "Galerians: Ash", "details_link": "https://www.metacritic.com/game/playstation-2/galerians-ash", "publisher": "Sammy Studios", "release_date": "Feb  3 2003", "developers": ["Polygon Magic"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 50, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/5fd4c77a1aad4ffe1128bd4fb7e7cc9c-98.jpg", "descriptions": "The sequel to the classic \"survival horror\" game, Galerians:ASH brings a new 3D action thriller to the PS2 that masterfully blends horror and science-fiction. Six years have passed since the megalomaniacal mother computer Dorothy launched her plan to create an artificial race of GaleriansThe sequel to the classic \"survival horror\" game, Galerians:ASH brings a new 3D action thriller to the PS2 that masterfully blends horror and science-fiction. Six years have passed since the megalomaniacal mother computer Dorothy launched her plan to create an artificial race of Galerians over whom she would rule... six years since Rion discovered his own identity as a Galerian, yet still confronted his genocidal creator... six years since Rion sacrificed himself to save the humans. Six years have passed, and a catastrophic program released by a dying Dorothy has been launched.  [Sammy]… Expand"}, {"name": "Dino Stalker", "details_link": "https://www.metacritic.com/game/playstation-2/dino-stalker", "publisher": "Capcom", "release_date": "Sep  9 2002", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 50, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/23f261533ef6d1cf1d8f2dac013ff1a2-98.jpg", "descriptions": "Time Gone Haywire. World War II. Fighter down. Pilot Lt. Mike Wired's plane takes heavy damage during a dogfight over the Atlantic. Forced to eject, he's suddenly enveloped in a blinding flash of white light and being guided towards an ominous jungle below. Everything around him has changed.Time Gone Haywire. World War II. Fighter down. Pilot Lt. Mike Wired's plane takes heavy damage during a dogfight over the Atlantic. Forced to eject, he's suddenly enveloped in a blinding flash of white light and being guided towards an ominous jungle below. Everything around him has changed. The distant moan of strange beasts. An unfamiliar weapon appears in his hand. A thundering roar and crashing trees give way to an impossible sight...beasts from another time. What's happening? .... this can't be good. Now you determine the fate of this hero, lost in time. Face off against an onslaught of prehistoric beasts in first person perspective! And move quickly! You now battle the most ferocious creatures to ever walk the earth for your own survival! (Guncon2 light gun-compatible) [Capcom]… Expand"}, {"name": "Left Brain Right Brain", "details_link": "https://www.metacritic.com/game/ds/left-brain-right-brain", "publisher": "Majesco Games", "release_date": "Dec  4 2007", "developers": ["Japan Art Media (JAM)"], "platforms": ["iPhone/iPad", "DS"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Edutainment", "General", "Edutainment"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/3722d446a8a0d82ea447e57cc9f0ba96-98.jpg", "descriptions": "(Known as \"Left or Right Ambidextrous Challenge\" in the UK/EU)  Use the Touch Screen in 15 different mini-games based on speed, accuracy, association, recognition, memory and strategy. Games include: Connect the Dots, Pop the Balloons, Feel the Music, Hit the Monsters, Touch the Green(Known as \"Left or Right Ambidextrous Challenge\" in the UK/EU)  Use the Touch Screen in 15 different mini-games based on speed, accuracy, association, recognition, memory and strategy. Games include: Connect the Dots, Pop the Balloons, Feel the Music, Hit the Monsters, Touch the Green Square, Save the World, Open the Safe, Trace the Shape, Navigate the Maze and many more. Book-style play has you flipping the DS over and around to develop your hand-eye coordination with both left and right hand. Master 4 single player game modes: Hand Exercises, Balance Check, Left Hand vs. Right Hand and Ambidexterity Check. Challenge a friend to 2-player mini-game tests via DS download play. Practice any activity, over 5 difficulty levels, to prepare for ambidexterity tests. Monitor personal progress and assess improvement with development percentages for each hand that appear after play. [Majesco]… Expand"}, {"name": "Novadrome", "details_link": "https://www.metacritic.com/game/xbox-360/novadrome", "publisher": "Buena Vista Games", "release_date": "Dec 20 2006", "developers": ["Stainless Games"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 50, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/a43858f467741515ca02510d59060bc4-98.jpg", "descriptions": "Novadrome puts gamers behind the wheel of an armed, buggy-style vehicle to face off in gladiatorial combat on a distant planet. Offline, players can battle enemies or explore sprawling arenas filled with obstacles and power-ups. After learning the basics, they can then vie for ultimateNovadrome puts gamers behind the wheel of an armed, buggy-style vehicle to face off in gladiatorial combat on a distant planet. Offline, players can battle enemies or explore sprawling arenas filled with obstacles and power-ups. After learning the basics, they can then vie for ultimate bragging rights by engaging friends and other Xbox Live Arcade combatants through the highly customizable online multiplayer mode. 24 unique vehicles from which to choose \r15 arenas of continuous, furious action. Includes car-mounted beam, particle and physics weapons. Play for bragging rights – Top the leaderboards to become the ultimate champion. Multiple gameplay modes and event types to choose from -- featuring Career, Arcade, Free Play and Multiplayer Modes. Challenge your captors – Obliterate the your alien abductors in action-packed boss encounters. [Buena Vista Games]… Expand"}, {"name": "Start the Party! Save the World", "details_link": "https://www.metacritic.com/game/playstation-3/start-the-party!-save-the-world", "publisher": "SCEA", "release_date": "Mar  6 2012", "developers": ["Supermassive Games"], "platforms": "PlayStation 3", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 50, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/9fc1dfe798ef5e4d24938ae1d39ed446-98.jpg", "descriptions": "Your PlayStationMove motion controller is about to turn into some of the craziest gadgets imaginable in Start the Party! Save the World on the PlayStation3 system. From the depths of the ocean to skyscraper rooftops, Dr. Terrible is wreaking havoc - pick up your motion controller and battleYour PlayStationMove motion controller is about to turn into some of the craziest gadgets imaginable in Start the Party! Save the World on the PlayStation3 system. From the depths of the ocean to skyscraper rooftops, Dr. Terrible is wreaking havoc - pick up your motion controller and battle with this devious enemy. \r\r- Grab your PlayStationMove motion controller and prepare to battle Dr. Terrible in a series of hilarious mini-games. \r- See yourself on-screen as you use your motion controller to scoop up fish, swat flies and rescue lost divers. \r- Challenge up to three friends on PS3, take down an evil villain and save the world in four different game modes.… Expand"}, {"name": "Fear Effect Sedna", "details_link": "https://www.metacritic.com/game/playstation-4/fear-effect-sedna", "publisher": "Square Enix", "release_date": "Mar  6 2018", "developers": ["Sushee"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 50, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/e17b44e4c6dae9395a9094b1a28d6825-98.jpg", "descriptions": "Be part of a new Fear Effect adventure with Fear Effect Sedna, a new game in the classic series made popular on the original PlayStation console. With a whole new story, and shifting to a pausable real-time tactical action style, players will be able to control the team strategically andBe part of a new Fear Effect adventure with Fear Effect Sedna, a new game in the classic series made popular on the original PlayStation console. With a whole new story, and shifting to a pausable real-time tactical action style, players will be able to control the team strategically and tackle enemies and puzzles alike.\r Fear Effect Sedna is set four years after the events of the original Fear Effect game, and things have changed for the team. Hana, freed from the Triad, lives with Rain in Hong Kong and works as an occasional mercenary, while Deke has grown apart from them since Glas returned to the US.\r Hana accepts a small mission for a shadowy organization asking for her services. Her target: a mysterious ancient statuette held by the Chinese ambassador in France. She sees it as a good opportunity to visit her birthplace... But this 'easy' mission is about to lead Hana to something way bigger than she expected.\r Meanwhile Glas is approached by a client who catches his attention enough that he soon sets out for Greenland.\r How will these events bring the old team back together?\r Fear Effect Sedna is dedicated to recreating the atmosphere and characters from the original Fear Effect. However, while there are familiar aspects of the game to previous incarnations of the franchise, you'll find yourself immersed in a completely unique and new world with Fear Effect Sedna - one that will appeal to fans both old and new. \r\rFeatures:\r *    New environments in isometric view: Explore the deep caves of Greenland, abandoned scientific complexes, underwater stations and ethereal realms based on Inuit mythology.\r*    A real-time tactical action game: Exploit your heroes' special abilities and combine them to maximize your team's effectiveness in attacks.\r*    A deep and mature story: Learn more about Fear Effect's iconic characters' past as they delve into this new mystery.\r*    Explore a whole new culture: Myths from the Inuit people are imbued with power of the elements and the cold sea. Meet and fight unexpected creatures from the spirit realm!… Expand"}, {"name": "Pirates: Duels on the High Seas", "details_link": "https://www.metacritic.com/game/ds/pirates-duels-on-the-high-seas", "publisher": "Oxygen Interactive", "release_date": "May 14 2009", "developers": ["Oxygen Interactive"], "platforms": "DS", "genres": ["Action", "General", "General"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/abf908f6be072b11bcef3ad68bcd75dd-98.jpg", "descriptions": "A chance encounter with an old sea-dog; the legend of a fantastic treasure - Thus begins an epic adventure for the 7 keys of the 7 seas – a daring battle against Royal Navy, sea monsters, a Witch Queen and Blackbeard himself. Steel yourself to face foes that no captain has ever bestedA chance encounter with an old sea-dog; the legend of a fantastic treasure - Thus begins an epic adventure for the 7 keys of the 7 seas – a daring battle against Royal Navy, sea monsters, a Witch Queen and Blackbeard himself. Steel yourself to face foes that no captain has ever bested before, in this perilous adventure of the enchanted worlds. Collect weapons, pick up crewmen, amass great riches and breach un-chartered seas. Learn the secrets of dozens of enemies as you cast off and set sail on a daring voyage of adventure and battle. Your crew await you, Captain. Choose a pirates life – For gold and glory. [Oxygen Interactive]… Expand"}, {"name": "Empire Earth III", "details_link": "https://www.metacritic.com/game/pc/empire-earth-iii", "publisher": "Sierra Entertainment", "release_date": "Nov  6 2007", "developers": ["Mad Doc Software"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 50, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/7/16590cce5f1cd64aac61aa64d87dfe84-98.jpg", "descriptions": "Empire Earth III puts the EARTH into Empire Earth by introducing a spectacular global perspective to conquering the world. The globe serves as the battleground between the 3 unique factions (Western, Middle-Eastern, and Eastern) that have been created with a stunning new artistic vision. AllEmpire Earth III puts the EARTH into Empire Earth by introducing a spectacular global perspective to conquering the world. The globe serves as the battleground between the 3 unique factions (Western, Middle-Eastern, and Eastern) that have been created with a stunning new artistic vision. All of human history and beyond - Across the entire globe - Empire Earth III commands all. Empire Earth III lets players battle across the entire globe as they make their bid for world domination. Gameplay unfolds in a richly detailed Earth made up of 60 skirmish maps (provinces) representing real locations on the globe or create a randomly generated globe to conquer. Players can choose both the starting location and starting era. Unique Customizable Civilizations - Civilizations are divided into three factions Western, Middle-Eastern, and Eastern. Each faction has its own unique tech tree, units, structures, and game play style. Each faction's tech tree allows players to create completely custom civilizations of their own choosing. Fully Persistent World - Unlike any other RTS, Empire Earth III will let players keep their spoils of war. As the player builds their empire across the globe their cities and outposts will grow and improve. Their units and structures will evolve over time. You keep what you create, so long as someone else doesn't take it from you. [Sierra Entertainment]… Expand"}, {"name": "Agatha Christie: And Then There Were None", "details_link": "https://www.metacritic.com/game/wii/agatha-christie-and-then-there-were-none", "publisher": "The Adventure Company", "release_date": "Feb 25 2008", "developers": ["AWE Games"], "platforms": ["PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "Modern", "Third-Person", "Modern"], "meta_score": 50, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/627a1792a15f5547d3b21a80ba39c36c-98.jpg", "descriptions": "In the classic story And Then There Were None, 10 people, each with something to hide and something to fear, are invited to a lonely mansion on Shipwreck Island by a host who, surprisingly, fails to appear. On the island, they are cut off from everything but each other and the inescapableIn the classic story And Then There Were None, 10 people, each with something to hide and something to fear, are invited to a lonely mansion on Shipwreck Island by a host who, surprisingly, fails to appear. On the island, they are cut off from everything but each other and the inescapable shadows of their own past lives. One by one, the guests share the darkest secrets of their wicked pasts. And one by one, they die... Agatha Christie fans, and newcomers to the genre, can look forward to a series of unexpected turns; although the storyline stays true to the original concept, players will encounter new plot twists. The first comes in the form of an 11th character, the player, a boatman who brings the others to the island and then is trapped there himself. To save the lives of the intended victims, the player must unravel the motives behind the murders and uncover the identity of the killer. If successful, he will spare not only the lives of the remaining guests, but also his own. Using the Wiimote controller, gameplay in this traditional PC adventure game can be taken to a new level of interactivity. For instance, players will have the freedom to control their character's actions, such as using a digging motion to unearth clues, or spinning the handle of a safe using the Wiimote; and the introduction of timed puzzles where, for example, players must race up a set of stairs from a boat docked below. [The Adventure Company]… Expand"}, {"name": "RYL: Path of the Emperor", "details_link": "https://www.metacritic.com/game/pc/ryl-path-of-the-emperor", "publisher": "Planetwide Games", "release_date": "Jun 20 2005", "developers": ["Youxiland", "Gamasoft"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Fantasy", "Fantasy"], "meta_score": 50, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/b45a6f803c6a2835ef72492f475d15df-98.jpg", "descriptions": "RYL: Path of the Emperor is a persistent universe or role-playing game (RPG). RYL players start off at Level 1, with minimal skills and abilities, but over time they gain experience points, through achievement, which allows them to advance to Level 2, and beyond. As RYL players advance toRYL: Path of the Emperor is a persistent universe or role-playing game (RPG). RYL players start off at Level 1, with minimal skills and abilities, but over time they gain experience points, through achievement, which allows them to advance to Level 2, and beyond. As RYL players advance to each level they discover new and stronger skills, which assist them in their ability to try and survive during all encompassing battles against powerful monsters. In the game, players can choose from 20 character classes and assume the role of a Warrior, Cleric, Mage, and Assassin and then explore the many exotic locations within boundless miles of terrain and virtual real estate. In RYL: Path of the Emperor players meet other players in a diverse real time environment where thousands of players simultaneously compete and take part in specific quests and missions, fight monsters and other players, battle in Guild vs. Guild duels, buy, sell and trade virtual merchandise, build fortresses and even raise their own virtual Dragon. Lastly, RYL players have the chance to receive the ultimate gaming reward; to become the actual Emperor of RYL, Rule over the Land and win $1,000,000. [Planetwide Games]… Expand"}, {"name": "Shade: Wrath of Angels", "details_link": "https://www.metacritic.com/game/pc/shade-wrath-of-angels", "publisher": "Cenega Publishing", "release_date": "Oct  1 2004", "developers": ["Black Element"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 50, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/29e506f65be5ebc4d3f2026ba7074259-98.jpg", "descriptions": "Shade: Wrath of Angels is a 3rd person perspective action, horror, adventure game where intrigue grips the player as our hero begins to unravel the mystery surrounding his brothers? disappearance. Our hero receives a strange and ominous letter from his brother asking him to travel to a smallShade: Wrath of Angels is a 3rd person perspective action, horror, adventure game where intrigue grips the player as our hero begins to unravel the mystery surrounding his brothers? disappearance. Our hero receives a strange and ominous letter from his brother asking him to travel to a small mountain town. Together with the letter the envelope contains a strange item, roughly resembling some type of key. Puzzled, our hero surmises that his brother is in serious trouble and without hesitation hurries to rescue him. As the story unfolds, our Hero embarks an intrepid adventure across 4 alternative words; the Present Day, Middle Ages, Ancient Egypt and The Shadow Land where nothing is what it seems as you solve puzzles and battle Demons, Angels, Zombies, Mummies, Rats, Shadows and much, much worse. The aim is like no other: Find an Angel and collect their Torn Souls at the end of each world experience. Failure is not an option, if you want to see your brother alive. [Cenega Publishing]… Expand"}, {"name": "Star Trek: D-A-C", "details_link": "https://www.metacritic.com/game/pc/star-trek-d-a-c", "publisher": "Paramount Digital Entertainment", "release_date": "Nov 12 2009", "developers": ["Naked Sky Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 12 ", "genres": ["Action", "Simulation", "General", "General", "Space", "Combat"], "meta_score": 50, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/2/b07294eb9c203a99afe97f61407c8f47-98.jpg", "descriptions": "Star Trek: D-A-C allows fans to pitch battles between Starfleet and the Romulan Empire. Up to 12 players can compete in thrilling team combat. There are three game play modes  - single player, online multiplayer and online co-op.  For each mode, there are three different game types - TeamStar Trek: D-A-C allows fans to pitch battles between Starfleet and the Romulan Empire. Up to 12 players can compete in thrilling team combat. There are three game play modes  - single player, online multiplayer and online co-op.  For each mode, there are three different game types - Team Deathmatch, Assault and Conquest. Players can now choose from four ship types for each faction, including the new U.S.S. Enterprise featured in the \"Star Trek\" film. Each ship - the powerful Flagship, the aggressive Fighter, the nimble Bomber and the all-new Support Frigate - offers its own unique capabilities for players to master and manipulate as they fight for victory.  The Support Frigate allows players to heal friendly ships and easily target enemy escape pods. New gameplay updates in Star Trek: D-A-C for PlayStation Network include variable AI difficultly settings, customizable goals that allow players to set game time limits and number of kills needed to win, improved mechanics for capturing control points in Conquest games, and host migration, which will allow games to continue even if the host player disconnects. [Paramount Digital Entertainment]… Expand"}, {"name": "Yaiba: Ninja Gaiden Z", "details_link": "https://www.metacritic.com/game/xbox-360/yaiba-ninja-gaiden-z", "publisher": "Team Ninja", "release_date": "Mar 18 2014", "developers": ["Spark Unlimited", "comcept"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "General", "Horror", "Survival", "Linear"], "meta_score": 50, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/2ddddd626ad880ec9679ff72204bbba6-98.jpg", "descriptions": "The ninja are the most elite of warriors, exercising unparalleled skill, precision, and lethality for centuries. Only the most deadly candidates are given the rare and coveted opportunity to join the clan. The final test of a ninja"}, {"name": "Dead Rising 3: Chaos Rising", "details_link": "https://www.metacritic.com/game/xbox-one/dead-rising-3-chaos-rising", "publisher": "Microsoft Game Studios", "release_date": "Feb 21 2014", "developers": ["Capcom Vancouver"], "platforms": "Xbox One", "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 50, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/8/e7c0ba384c41036da0f46551d4bdcc98-98.jpg", "descriptions": "This new Dead Rising 3 downloadable episode puts you in control of renegade biker, Hunter Thibodeux, who must escape from prison, seek revenge and fight for control of his gang. This new side story features a new mission, zombie-slaying weapons, over-the-top vehicles and more – all of whichThis new Dead Rising 3 downloadable episode puts you in control of renegade biker, Hunter Thibodeux, who must escape from prison, seek revenge and fight for control of his gang. This new side story features a new mission, zombie-slaying weapons, over-the-top vehicles and more – all of which carry back to the main game. [Xbox.com]… Expand"}, {"name": "Ford Racing 3", "details_link": "https://www.metacritic.com/game/playstation-2/ford-racing-3", "publisher": "2K Games", "release_date": "Mar 22 2005", "developers": ["Razorworks Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 50, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/b0c4101af5eacac75b6024bbd3948149-98.jpg", "descriptions": "Ford is without doubt one of the biggest brands in the world, with one of the most famous product ranges ever. Ford Racing 3 takes this amazing range of vehicles, from the Model T Ford through to the latest concepts, and pits them against a huge variety of courses, cars and challenges.Ford is without doubt one of the biggest brands in the world, with one of the most famous product ranges ever. Ford Racing 3 takes this amazing range of vehicles, from the Model T Ford through to the latest concepts, and pits them against a huge variety of courses, cars and challenges. Features 55 beautifully detailed Ford automobiles: Ford GTs, Thunderbirds, concepts, SVT vehicles, Mustangs and trucks. 26 sumptuously detailed tracks with interactive scenery: road, off-road, oval tracks and more! Unlock a huge range of game modes, tracks and vehicles as you face each challenge. Innovative Ford Competition mode, containing 14 unique championships! 6 Player racing on Xbox Live, via LAN for PC or race head-to-head in split screen on PS2 for the ultimate race experience. [Empire Interactive]… Expand"}, {"name": "Manic Monkey Mayhem", "details_link": "https://www.metacritic.com/game/wii/manic-monkey-mayhem", "publisher": "The Code Monkeys", "release_date": "May 24 2010", "developers": ["The Code Monkeys"], "platforms": ["iPhone/iPad", "Wii"], "num_players": "1-4 ", "genres": ["Action", "General", "General"], "meta_score": 50, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/556270d873651b1da3f42ea048393c44-98.jpg", "descriptions": "[WiiWare] Controlling one of eight monkeys, you will do battle with up to seven others across eight differently themed landscapes. In single player, battle through three increasingly difficult campaigns of missions ranging from survival to coconut fights, or have a one-off battle against the[WiiWare] Controlling one of eight monkeys, you will do battle with up to seven others across eight differently themed landscapes. In single player, battle through three increasingly difficult campaigns of missions ranging from survival to coconut fights, or have a one-off battle against the clock as a team or in a standard deathmatch. Connect additional Wii Remote controllers (each sold separately) to battle against up to three additional players or compete against anyone or your friends using Nintendo Wi-Fi Connection. Connect an optional Wii Balance Board accessory to add more mayhem to the fun.… Expand"}, {"name": "Ford Bold Moves Street Racing", "details_link": "https://www.metacritic.com/game/playstation-2/ford-bold-moves-street-racing", "publisher": "Eidos Interactive", "release_date": "Sep 26 2006", "developers": ["Razorworks Studios"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 50, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/3/aa4fc8951f4bf5db11ed1bf3af6f04db-98.jpg", "descriptions": "(Known as \"Ford Street Racing\" in the UK/EU)  Ford Bold Moves Street Racing delivers players a chance to race 18 officially licensed high performance Ford vehicles from the classic 1968 Mustang GT to the new scorching hot 2007 Shelby GT500. With plans to make the title affordable enough for(Known as \"Ford Street Racing\" in the UK/EU)  Ford Bold Moves Street Racing delivers players a chance to race 18 officially licensed high performance Ford vehicles from the classic 1968 Mustang GT to the new scorching hot 2007 Shelby GT500. With plans to make the title affordable enough for every gamer to own, Ford Street Racing is still pushing boundaries by delivering unique features such as the trademarked Maximum Team Control that allows players to switch on-the-fly between a team of three vehicles to dominate a race.  A progressive damage system also adds a new element of realism to the game, allowing every hit your vehicle takes to affect the appearance, performance and drivability of the vehicle. [Eidos Interactive]… Expand"}, {"name": "Sonic Adventure", "details_link": "https://www.metacritic.com/game/playstation-3/sonic-adventure", "publisher": "Sega", "release_date": "Sep 21 2010", "developers": ["Sonic Team"], "platforms": ["PC", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 50, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/68fbf51a49da6a3c48af5870d01ac3ae-98.jpg", "descriptions": "The Dreamcast classic now makes its way onto the PlayStation Network."}, {"name": "Night at the Museum: Battle of the Smithsonian", "details_link": "https://www.metacritic.com/game/xbox-360/night-at-the-museum-battle-of-the-smithsonian", "publisher": "Majesco Games", "release_date": "May  5 2009", "developers": ["Majesco Games", "Majesco"], "platforms": "Xbox 360", "genres": ["Action", "Action Adventure", "Adventure", "General", "General", "3D", "Linear", "First-Person"], "meta_score": 50, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/1c546e2d110a8b3c62fe15594ce05570-98.jpg", "descriptions": "Get ready for a story so epic it could only unfold in the corridors of the world's largest museum--the Smithsonian Institution. Museum guard-turned entrepreneur Larry Daley discovers that his favorite exhibits, and some of his best friends, from New York's Natural History Museum are beingGet ready for a story so epic it could only unfold in the corridors of the world's largest museum--the Smithsonian Institution. Museum guard-turned entrepreneur Larry Daley discovers that his favorite exhibits, and some of his best friends, from New York's Natural History Museum are being shipped off to the archives at the Smithsonian.  Larry gets a distress call from the miniature cowboy, Jedediah, reporting that Egyptian ruler Kahmunrah and a trio of heinous henchmen--namely Ivan the Terrible, Napoleon and Al Capone--are plotting to take over the museum, then the world.  Speeding to the nation's capitol, Larry is clearly in over his head.  But with some impressive new pals, including the irrepressible Amelia Earhart, along with familiar friends Teddy Roosevelt and Octavius, Larry will stop at nothing to restore the Smithsonian before dawn. [Majesco]… Expand"}, {"name": "NARC", "details_link": "https://www.metacritic.com/game/playstation-2/narc", "publisher": "Midway", "release_date": "Mar 22 2005", "developers": ["Point of View"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 50, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/fb61cfcc0bd21fc7f589cb186325b322-98.jpg", "descriptions": "NARC is an in-depth, 3rd-person action/shooter video game set against a stylized modern-day backdrop of the War on Drugs. Playing as dual characters, Jack Forzenski and Marcus Hill, in the elite NARC squad, players must rid the world of the powerful international K.R.A.K. drug cartel. UsingNARC is an in-depth, 3rd-person action/shooter video game set against a stylized modern-day backdrop of the War on Drugs. Playing as dual characters, Jack Forzenski and Marcus Hill, in the elite NARC squad, players must rid the world of the powerful international K.R.A.K. drug cartel. Using deadly firepower and police authority players will make the choice to play it straight or use and abuse narcotics to get that extra edge and quick cash. Players decide whether to play as a good or bad cop as they face the mean streets and criminal underworld that rules it. [Midway]… Expand"}, {"name": "Empire of Sin", "details_link": "https://www.metacritic.com/game/switch/empire-of-sin", "publisher": "Paradox Interactive", "release_date": "Dec  1 2020", "developers": ["Romero Games Ltd."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 50, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/e458d740f989b2f67a909356f7218f93-98.jpg", "descriptions": "Empire of sin, the strategy game from romero games and Paradox interactive, puts you at the heart of the ruthless criminal underworld of 1920S prohibition-era Chicago. It's up to you to Hustle, charm and intimidate your way to the top of the pile and do whatever it takes to stay there. ThisEmpire of sin, the strategy game from romero games and Paradox interactive, puts you at the heart of the ruthless criminal underworld of 1920S prohibition-era Chicago. It's up to you to Hustle, charm and intimidate your way to the top of the pile and do whatever it takes to stay there. This character-driven, noir-inspired game puts players smack dab in the glitz and glamor of the roaring 20S, all while working behind the scenes in the gritty underbelly of organized crime. … Expand"}, {"name": "Picklock", "details_link": "https://www.metacritic.com/game/switch/picklock", "publisher": "No Gravity Games", "release_date": "Nov 26 2020", "developers": ["No Gravity Games"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/fa60c59a249e65b3380835e4873e1d9e-98.jpg", "descriptions": "You are a thief. Alias Picklock. Examine the robbery scene. Break in. Sneak and steal. Escape. Become a pro! Enjoy Picklock, a strategic adventure with isometric view and voxel graphics!\r FEATURES:\r\n• isometric mix of strategy, adventure and stealth;\r\n• 13 challenging missions;\r\n• realYou are a thief. Alias Picklock. Examine the robbery scene. Break in. Sneak and steal. Escape. Become a pro! Enjoy Picklock, a strategic adventure with isometric view and voxel graphics!\r FEATURES:\r• isometric mix of strategy, adventure and stealth;\r• 13 challenging missions;\r• real estate agency to buy your dream house;\r• car dealership to pimp your ride;\r• jazzy tunes to listen and chill out to;\r• travel agency so you can go on a well-deserved vacation;\r• voxel graphics.\r Are you bored with an average, honest life?\rPicklock gives you an opportunity to break in, steal and deceive your way to a luxury, yet an illegal lifestyle.\rIn each level, you will face a new challenge. Your targets will range from a roll of toilet paper at your neighbours' house to exclusive art, electronics and cold, hard cash. And even though you know your stuff, you'll have to deal with security, alarms and sealed, secret compartments.\rIf any of those things will stress you out, you can always go on a shopping spree, chill out at a pub or let off some steam at a gentlemen's club.\rExcited yet?\rThen grab your gloves and crowbar and get ready for a tricky, robbery adventure!\r… Expand"}, {"name": "Toby: The Secret Mine", "details_link": "https://www.metacritic.com/game/playstation-4/toby-the-secret-mine", "publisher": "Headup Games", "release_date": "Jul  6 2017", "developers": ["Lukas Navratil"], "platforms": ["iPhone/iPad", "PC", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/e2fef57222dbe85f4dd254b8d18f3889-98.jpg", "descriptions": "Get lost in the shadows and pray you find your way out... A peaceful way of life in a small village in the mountains was thrown into disorder. Someone has kidnapped most of its residents. A couple of brave hearts tried to rescue their friends but none of them has returned. Little Toby didn'tGet lost in the shadows and pray you find your way out... A peaceful way of life in a small village in the mountains was thrown into disorder. Someone has kidnapped most of its residents. A couple of brave hearts tried to rescue their friends but none of them has returned. Little Toby didn't want to just sit and wait so he decided to find them by himself. He went to the near deep forest but he soon realized this is just a beginning. Go with Toby on an eerie adventure in a dark and creepy world full of dangerous situations, enemies and challenging puzzles.… Expand"}, {"name": "Armikrog", "details_link": "https://www.metacritic.com/game/playstation-4/armikrog", "publisher": "Versus Evil", "release_date": "Aug 23 2016", "developers": ["Pencil Test Studios"], "platforms": ["PC", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 50, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/c737d26de923ca991883e3dfa5ec9c71-98.jpg", "descriptions": "A stop-motion clay animated point and click adventure game from the creators of Earthworm Jim and the Neverhood. Unravel the mysteries of the fortress that holds Tommynaut and his blind alien talking dog Beak-Beak captive through exploration and puzzle solving. [Playstation.com]"}, {"name": "Syberia", "details_link": "https://www.metacritic.com/game/playstation-3/syberia", "publisher": "Nordic Games Publishing", "release_date": "Dec  2 2014", "developers": ["Anuman Interactive"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox 360", "PlayStation 3"], "genres": ["Adventure", "3D", "Third-Person", "Fantasy"], "meta_score": 50, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/f53945ddb8e96c491cfbe599ba281fa1-98.jpg", "descriptions": "For the young Kate Walker, an ambitious lawyer, the Voralberg toy company acquisition seemed like a textbook case--a quick stopover to a small alpine village in France to buy-out an old automaton factory, then straight back home to New York.  But her journey across land and time throws allFor the young Kate Walker, an ambitious lawyer, the Voralberg toy company acquisition seemed like a textbook case--a quick stopover to a small alpine village in France to buy-out an old automaton factory, then straight back home to New York.  But her journey across land and time throws all she values into question, and the deal she set out to sign turns into a pact with destiny.  Follow Kate through a magical world of automatons, amazing characters, and mysterious environments.  This puzzle-driven adventure blends logical problem-solving with a complex and involving storyline.… Expand"}, {"name": "Carnivores HD: Dinosaur Hunter", "details_link": "https://www.metacritic.com/game/playstation-3/carnivores-hd-dinosaur-hunter", "publisher": "Vogster Entertainment, LLC", "release_date": "Sep 10 2013", "developers": ["Vogster Entertainment", "LLC"], "platforms": ["iPhone/iPad", "PlayStation 3"], "genres": ["Action", "Sports", "Shooter", "General", "Shooter", "Individual", "First-Person", "Nature", "Fantasy", "Fantasy", "Arcade", "Hunting"], "meta_score": 50, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/4170098ed4755b608569dc17d3493e12-98.jpg", "descriptions": "In the future, advances in engineering made interstellar travel possible, ushering forth the era of space exploration. Along many planets the mankind has discovered was a world very similar to Earth circa Jurassic period. The planet had a lot of islands populated with huge and wild animals,In the future, advances in engineering made interstellar travel possible, ushering forth the era of space exploration. Along many planets the mankind has discovered was a world very similar to Earth circa Jurassic period. The planet had a lot of islands populated with huge and wild animals, which supposedly looked just like Earth's long extinct dinosaurs. Soon enough exploration of the planet has begun. «DinoHunt, Inc» was established and the company started to provide hunting trips for everyone wealthy and bold enough to take on mighty creatures inhabiting the planet. You are one of those hunters. The game brings you to an ancient environment and lets you hunt for the most dangerous and the strongest creatures in the universe.… Expand"}, {"name": "Samurai Sword Destiny", "details_link": "https://www.metacritic.com/game/3ds/samurai-sword-destiny", "publisher": "UFO Interactive", "release_date": "Jan  5 2012", "developers": ["UFO Interactive"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 50, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/d05959eec949f452573b24d8a5de80bc-98.jpg", "descriptions": "Samurai Sword Destiny is a character action game that will challenge players of all levels. You control a deadly female samurai, Akane, with a single goal in mind: to find her missing elder bother.\r On Akane's quest, she will encounter deadly ambushes, invade enemy castle rooftops, andSamurai Sword Destiny is a character action game that will challenge players of all levels. You control a deadly female samurai, Akane, with a single goal in mind: to find her missing elder bother.\r On Akane's quest, she will encounter deadly ambushes, invade enemy castle rooftops, and square off against seemingly indomitable opponents. With the help of the dozens of upgrades available to enhance her fighting abilities, Akane just might have a fighting chance against the forces that stand in her path.… Expand"}, {"name": "Yoostar 2: In The Movies", "details_link": "https://www.metacritic.com/game/xbox-360/yoostar-2-in-the-movies", "publisher": "Yoostar Entertainment Group", "release_date": "Mar  8 2011", "developers": ["Blitz Games Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 50, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/7/de2a4c9d44d40f030702044175bd06d3-98.jpg", "descriptions": "Yoostar2 Combines The Power Of New Console Platforms, Top Hollywood Movies And The Burgeoning Social Media Phenomenon Monday 14th June/... Everyone now has the opportunity to become a global movie star with Yoostar2. In an instant you can step into the shoes of famous characters fromYoostar2 Combines The Power Of New Console Platforms, Top Hollywood Movies And The Burgeoning Social Media Phenomenon Monday 14th June/... Everyone now has the opportunity to become a global movie star with Yoostar2. In an instant you can step into the shoes of famous characters from hundreds of movies, play out the part and then share your performance with the world.… Expand"}, {"name": "Trapped Dead", "details_link": "https://www.metacritic.com/game/pc/trapped-dead", "publisher": "Meridian4", "release_date": "Feb 25 2011", "developers": ["Headup Games", "Crenetic Studios"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 50, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/5/0ea43edbc525d0298efc13dcd5b7eafe-98.jpg", "descriptions": "Devise tactics to rid a small community of the living dead."}, {"name": "Need for Speed: Hot Pursuit", "details_link": "https://www.metacritic.com/game/wii/need-for-speed-hot-pursuit", "publisher": "Electronic Arts", "release_date": "Nov 16 2010", "developers": ["Exient Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 50, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/0/450664d1109ab59a804a0b63a23db1af-98.jpg", "descriptions": "Need for Speed Hot Pursuit players will experience the thrill of the chase and the rush of the escape as they play through full careers as both a cop and a racer – solo or connected. The blistering speeds, brutal busts and heart-stopping getaways are all connected via Need for Speed Autolog.Need for Speed Hot Pursuit players will experience the thrill of the chase and the rush of the escape as they play through full careers as both a cop and a racer – solo or connected. The blistering speeds, brutal busts and heart-stopping getaways are all connected via Need for Speed Autolog. This network not only connects friends for epic head-to head pursuits and races, but also enables players to compare performances and stats, thereby setting the stage for the ultimate in friendly competition.… Expand"}, {"name": "Bakugan: Defenders of the Core", "details_link": "https://www.metacritic.com/game/playstation-3/bakugan-defenders-of-the-core", "publisher": "Activision", "release_date": "Oct 26 2010", "developers": ["Now Production"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "General", "General"], "meta_score": 50, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/6526c5bcd6ae25ff370f5a2870043b65-98.jpg", "descriptions": "In Bakugan Battle Brawlers: Defenders of the Core, players will create a new hero and lead the brawlers on an epic adventure to save Earth's cities from Spectra and his Vexos minions. Players will discover a whole new aspect of Bakugan by being given complete control over their creaturesIn Bakugan Battle Brawlers: Defenders of the Core, players will create a new hero and lead the brawlers on an epic adventure to save Earth's cities from Spectra and his Vexos minions. Players will discover a whole new aspect of Bakugan by being given complete control over their creatures when taking on their opponents as Bakugan transform from small balls into towering creatures. In the midst of intense battles, players will find themselves bravely exploring dangerous and dark areas to stop the evil spirits that are sucking the life force from the world. Players will unlock all-new levels and characters as they unearth hidden clues and defeat opponents in the quest to save the world from ultimate destruction. Bakugan Battle Brawlers: Defenders of the Core also features split-screen multiplayer action in three different game modes in the console versions, and linked multiplayer on Nintendo DS and PSP system. Coupled with real-time battle gameplay, this will be the first time that players can duke it out with their Bakugan in head-to-head duels, free for all, and strategic destruction battles.… Expand"}, {"name": "Guitar Hero: Van Halen", "details_link": "https://www.metacritic.com/game/wii/guitar-hero-van-halen", "publisher": "Activision", "release_date": "Dec 22 2009", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 50, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/951c5c38d3b9d79be35eb9b1f4537bae-98.jpg", "descriptions": "Guitar Hero returns with another band-focused title, Guitar Hero: Van Halen. The game features 25 classic Van Halen tracks, three signature Eddie Van Halen guitar solos, and 19 hand-picked guest acts. Play in eight original venues specifically designed for Guitar Hero: Van Halen. Rock aroundGuitar Hero returns with another band-focused title, Guitar Hero: Van Halen. The game features 25 classic Van Halen tracks, three signature Eddie Van Halen guitar solos, and 19 hand-picked guest acts. Play in eight original venues specifically designed for Guitar Hero: Van Halen. Rock around the globe, from a small club in Los Angeles to arenas around the world, including the iconic \"S-stage\" from the Rock and Roll Hall of Famer’s 2007 world tour. Play as one of the four members of Van Halen or create your own personalized superstar with Rock Star Creator and watch your superstar party on stage. Rock out with up to four players locally or battle other bands with up to 8 players. With tracks ranging from the high-energy \"Jump\" to the legendary guitar solo \"Eruption,\" the easy to play, difficult to master game play that Guitar Hero fans have grown to love is back in Guitar Hero: Van Halen. [Activision]… Expand"}, {"name": "Twin Strike: Operation Thunder", "details_link": "https://www.metacritic.com/game/wii/twin-strike-operation-thunder", "publisher": "Zoo Digital Publishing", "release_date": "Oct 28 2008", "developers": ["Naps Team"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 50, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/0e957237fd767a18cdc24ec49b516a0a-98.jpg", "descriptions": "You are the newest recruit of the United Nations Air Force-a top secret agency set up to protect citizens against the threat of unknown forces without breaking down international agreements or diplomatic acts. You will have to take to the skies in a variety of helicopters to defend theYou are the newest recruit of the United Nations Air Force-a top secret agency set up to protect citizens against the threat of unknown forces without breaking down international agreements or diplomatic acts. You will have to take to the skies in a variety of helicopters to defend the civilized world against wave after wave of enemy aggression. Suit up and choose the best helicopter to engage the enemy in the air while avoiding attacks from the ground. Put yourself in the pilot seat with \"Twin Strike\"! [Zoo Games]… Expand"}, {"name": "B-Boy", "details_link": "https://www.metacritic.com/game/psp/b-boy", "publisher": "Evolved Games", "release_date": "Sep 23 2008", "developers": ["FreeStyleGames"], "platforms": ["PlayStation 2", "PSP"], "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 50, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/eec1960a8a4e03346e281792e22ae7d3-98.jpg", "descriptions": "(Currently available in the UK/EU only)  B-Boy allows you to battle through authentic Hip-Hop break-dancing culture, challenging the world's best B-Boys on the world's greatest B-Boy stages - and hopefully take home an in-game adidas sponsorship along the way. The first and only authentic(Currently available in the UK/EU only)  B-Boy allows you to battle through authentic Hip-Hop break-dancing culture, challenging the world's best B-Boys on the world's greatest B-Boy stages - and hopefully take home an in-game adidas sponsorship along the way. The first and only authentic break-dancing title on PSP stays true to the spirit of B-Boying thanks to the wireless functionality - giving you the freedom to battle on the move – anytime and anywhere – just as B-Boy competitions were meant to be. Featuring real life B-Boy characters, every in-game move is motion-captured from the experts, including moves taken from world famous Redbull athlete, \"Crazy Legs\", who also acts as game MC and end of level boss. Battling around the world, B-Boy features real locations and events, accompanied by the sound of a licensed Hip-Hop and classic Funk soundtrack with each track being selected by the B-Boys featured in-game. Progress through play by taking on 40 of the world's greatest B-Boy personalities, and pull off unique moves and outrageous combo's to become number one. Key game features include: 40 B-Boy characters to do battle with, including world famous B-Boy, Crazy Legs; 12 fully licensed motion-captured competitive B-Boys from Europe, Asia and North America; 21 authentic world wide locations including Redbull BC One, Freestyle Sessions, UK B-Boy Championships and IBE; 40 licensed Hip Hop and classic Funk tracks; Customise your B-Boy with full character personalisation – winning battles allows you to kit yourself out with the latest adidas clothing. [SCEE]… Expand"}, {"name": "Two Worlds", "details_link": "https://www.metacritic.com/game/xbox-360/two-worlds", "publisher": "SouthPeak Games", "release_date": "Aug 23 2007", "developers": ["Reality Pump"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Role-Playing", "Third-Person", "Third-Person", "General"], "meta_score": 50, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/7b968f72ff4b261486681cf6194cb22f-98.jpg", "descriptions": "Two Worlds combines the dynamic combat system the meaning and freedom of exploration. The ultimate goal of the Two Worlds project is to deliver a superior Role Playing Game to the PC and Xbox 360 market where players have a real chance to shape the game world with their actions - to anTwo Worlds combines the dynamic combat system the meaning and freedom of exploration. The ultimate goal of the Two Worlds project is to deliver a superior Role Playing Game to the PC and Xbox 360 market where players have a real chance to shape the game world with their actions - to an extent that has yet to seen in other productions. This premise is supported with a strong, non-linear storyline and stunning combat sequences. The world comes to life as it immediately reacts to the player's actions and changes accordingly - offering new and exciting challenges. Players can shape their own story by choosing the path of conducting the main conflict and resolving meaningful side-quests. The combat system combines intuitive steering, tactical challenges and movie-like visual experiences. Players can experiment with different careers and even reverse their former choices with the help of \"career changers\". Players can travel and fight on various animals from horses to tamed lizards and beasts. Randomly generated pieces of equipment, thematic sets and combined items offer the space to experiment and satisfy the need to collect. [SouthPeak Interactive]… Expand"}, {"name": "Legends of Wrestling", "details_link": "https://www.metacritic.com/game/gamecube/legends-of-wrestling", "publisher": "Acclaim", "release_date": "May 27 2002", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 50, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/b853b9b9189242addb6b84c153061f3b-98.jpg", "descriptions": "Legends of Wrestling throws the greatest wrestlers into one game to find out who is the true king of kings. Wrestling superstars, including Hulk Hogan, Bret \"Hitman\" Hart, and Jerry \"The King\" Lawler, step back into the ring to deliver more body slams, piledrivers, andLegends of Wrestling throws the greatest wrestlers into one game to find out who is the true king of kings. Wrestling superstars, including Hulk Hogan, Bret \"Hitman\" Hart, and Jerry \"The King\" Lawler, step back into the ring to deliver more body slams, piledrivers, and powerbombs to the competition. Play as authentic professional wrestlers or create your own legendary fighter, and then travel around the world to battle for wrestling's top titles. Legends of Wrestling also features customizable ring attire and new wrestler entrances.… Expand"}, {"name": "Dragon Rage", "details_link": "https://www.metacritic.com/game/playstation-2/dragon-rage", "publisher": "3DO", "release_date": "Nov 27 2001", "developers": ["3DO"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 50, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/58111fda16480886c5985fd35af7bcf0-98.jpg", "descriptions": "Take to the skies as Cael Cyndar, the powerful and heroic Dragon, through sixteen single-player and cooperative campaign levels. Features eight unique and fully interactive environments and six unique head-to-head multiplayer levels including Egg Hunt, Feeding Frenzy, and Dragon Duel. [3DO]"}, {"name": "Army Men: World War", "details_link": "https://www.metacritic.com/game/playstation/army-men-world-war", "publisher": "3DO", "release_date": "Feb 29 2000", "developers": ["3DO"], "platforms": ["PC", "PlayStation"], "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 50, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/5a2760399c55f8d631ff8094c1e9c419-98.jpg", "descriptions": "The Green and Tan Nations have broken off peace talks. There is no choice but to prepare for battle. Only after storming the shores of the enemy homeland pushing through thick jungles, and securing war-torn cities, does the ultimate victory await. Dive back into the trenches!"}, {"name": "NeverDead", "details_link": "https://www.metacritic.com/game/playstation-3/neverdead", "publisher": "Konami", "release_date": "Jan 31 2012", "developers": ["Rebellion"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 50, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/e31909190a62e46de1efc19962f13b16-98.jpg", "descriptions": "NEVERDEAD begins in the waking hours of peace and calm, when the world is under threat of being consumed by a demonic plague.  Centuries have passed since the world succumbed to an unforeseen shadow of evil, and a hero was made an immortal by demons. These demons have risen once again in theNEVERDEAD begins in the waking hours of peace and calm, when the world is under threat of being consumed by a demonic plague.  Centuries have passed since the world succumbed to an unforeseen shadow of evil, and a hero was made an immortal by demons. These demons have risen once again in the present day causing unrelenting mayhem reinforced by destructible environments within the game.  Now using his immortalic regenerative powers re-assembling his own body to evade death, the hero carries out the only salvation the world will know, for he is Never Dead.… Expand"}, {"name": "Deca Sports", "details_link": "https://www.metacritic.com/game/wii/deca-sports", "publisher": "Konami", "release_date": "May 13 2008", "developers": ["CAProduction"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 50, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/bcef778fb76d3014db84d198713b209e-98.jpg", "descriptions": "(Also knnown as \"Sports Island\" in the UK)  Deca Sports is a unique ten-sport game exclusively for the Wii. Combining ten sporting events into one addicting and fun-filled game, Deca Sports offers an immersive experience for fans of any age. The sporting events: Beach Volleyball, Snowboard(Also knnown as \"Sports Island\" in the UK)  Deca Sports is a unique ten-sport game exclusively for the Wii. Combining ten sporting events into one addicting and fun-filled game, Deca Sports offers an immersive experience for fans of any age. The sporting events: Beach Volleyball, Snowboard Cross, Badminton, Basketball, Curling, Figure Skating, Archery, Supercross, Soccer and Kart Racing. Each sport in the game uses the Wii Remote in unique yet accessible ways. With a subtle swing of the Wii Remote players can hit and spike the ball in Beach Volleyball, while twists of the wrist produce a wild ride down the slopes in Snowboard Cross. In Figure Skating players need to keep to the music and properly time all of their jumps and spins in order to impress the judges while passing the ball and lining up shots is essential in Soccer. All ten sports support both single player and multiplayer modes, in addition to a training mode to practice essential skills.  The wide range of events and modes make Deca Sports the perfect game for players and sports fans of all ages. [Hudson]… Expand"}, {"name": "Disney*Pixar WALL-E", "details_link": "https://www.metacritic.com/game/xbox-360/disneypixar-wall-e", "publisher": "THQ", "release_date": "Jun 24 2008", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 50, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/9f93af0a8568b6d25b04d6cf6d999b04-98.jpg", "descriptions": "What if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets aWhat if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets a sleek search robot named EVE. EVE comes to realize that WALL-E has inadvertently stumbled upon the key to the planet’s future, and races back to space to report her findings to the humans (who have been eagerly awaiting word that it is safe to return home). Meanwhile, WALL-E chases EVE across the galaxy and sets into motion one of the most exciting and imaginative comedy adventures ever brought to the big screen. Joining WALL-E on his fantastic journey across a universe of never-before-imagined visions of the future, is a hilarious cast of characters including a pet cockroach, and a heroic team of malfunctioning misfit robots. Players of the game take control of WALL-E and EVE through a fast-paced adventure based on the Disney/Pixar film. The game allows fans to relive some of the movie’s most thrilling moments as they explore 10 worlds filled with non-stop action and adventure, along with head-to-head multiplayer challenges. Players will recognize the storyline, characters and key locations from the WALL-E film as they carry out intense missions, dodge dangerous enemies and navigate their way through a futuristic world. In addition, the game contains new storylines and environments that movie-goers will not see in theaters. [THQ]… Expand"}, {"name": "Samurai Warriors 2: Xtreme Legends", "details_link": "https://www.metacritic.com/game/playstation-2/samurai-warriors-2-xtreme-legends", "publisher": "Koei", "release_date": "Mar 18 2008", "developers": ["Koei"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 50, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/0bb05a30877e3c5a18419926ef5f6ec3-98.jpg", "descriptions": "The Samurai Warriors are back with a vengeance and a new lineup including six legendary samurai- each with their own storyline and powerful new weapons. With the debut of Mercenary mode, the new battlefields of “Okehazama” and “Shikoku”, and new Charge attacks, even you have more reasons toThe Samurai Warriors are back with a vengeance and a new lineup including six legendary samurai- each with their own storyline and powerful new weapons. With the debut of Mercenary mode, the new battlefields of “Okehazama” and “Shikoku”, and new Charge attacks, even you have more reasons to come back and join the fight! 6 new samurai with original scenarios featuring: Toshiie Maeda, Katsuie Shibata, Kojiro Sasaki, Gracia, Yoshimoto Imagawa and Chosokabe Motochika. Conquer the new battlefields of “Okehazama” and “Shikoku” 2-player Co-op in Story and Free modes, plus 6 difficulty levels. As a mercenary leader, hire other samurai, complete missions to earn rewards. Use characters from SW2 in SW2XL game modes. Increase growth level maximums. Unleash new Charge attacks and 5th weapon. Play SW2’s Story mode, Survival mode and Sugoroku with SW2XL’s new characters. [KOEI]… Expand"}]