[{"name": "Dawn of Man", "details_link": "https://www.metacritic.com/game/pc/dawn-of-man", "publisher": "Madruga Works", "release_date": "Mar  1 2019", "developers": ["Madruga Works"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/65747513c45d858e06b46c5351bbf93c-98.jpg", "descriptions": "Command a settlement of ancient humans, guide them through the ages in their struggle for survival. Hunt, gather, craft tools, fight, research new techs and face the challenges the environment will throw at you."}, {"name": "Ys: Memories of Celceta", "details_link": "https://www.metacritic.com/game/pc/ys-memories-of-celceta", "publisher": "XSEED Games", "release_date": "Jul 25 2018", "developers": ["Falcom"], "platforms": ["PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/3b0f3f5fbdac6fc0ddaf670b69a91c93-98.jpg", "descriptions": "In Ys: Memories of Celceta, developer Falcom revisits the land and characters of Japanese cult favorite Ys IV for its first ever North American debut. This re-envisioning of the fourth installment in the Ys series takes a brand new approach, changing and framing the story of Ys IV within anIn Ys: Memories of Celceta, developer Falcom revisits the land and characters of Japanese cult favorite Ys IV for its first ever North American debut. This re-envisioning of the fourth installment in the Ys series takes a brand new approach, changing and framing the story of Ys IV within an all-new tale of conspiracy, deception and mystery. Featuring an updated version of the party-based battle system from Ys Seven, as well as the largest and most varied overworld in series history, Ys: Memories of Celceta brings a greater sense of adventure to the Ys universe than has ever been seen before.… Expand"}, {"name": "Atelier Lydie & Suelle: The Alchemists and the Mysterious Paintings", "details_link": "https://www.metacritic.com/game/playstation-4/atelier-lydie-suelle-the-alchemists-and-the-mysterious-paintings", "publisher": "NIS America", "release_date": "Mar 27 2018", "developers": ["Gust"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/7a22f2b47a17b2df277a47e48ed40219-98.jpg", "descriptions": "Twin sisters Lydie and Suelle are also alchemists, living in Merveille, the capital of Kingdom of Adalet, and they intend to make their atelier the best atelier in the kingdom."}, {"name": "Aqua Kitty UDX", "details_link": "https://www.metacritic.com/game/switch/aqua-kitty-udx", "publisher": "Tikipod Limited", "release_date": "Feb 15 2018", "developers": ["Tikipod Limited"], "platforms": ["Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/6ae28aeedaaca135b166b19182a2ace9-98.jpg", "descriptions": null}, {"name": "NBA 2K18", "details_link": "https://www.metacritic.com/game/switch/nba-2k18", "publisher": "2K Games", "release_date": "Sep 15 2017", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 74, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/1/b7c7dc832068da0b45b3f567d3601db6-98.jpg", "descriptions": "Shape your MyPLAYER and write your own narrative, build your dream MyTEAM, take control of the league, or prove you're the best of the best by competing against players from around the globe."}, {"name": "ChromaGun", "details_link": "https://www.metacritic.com/game/playstation-4/chromagun", "publisher": "Pixel Maniacs", "release_date": "Aug 22 2017", "developers": ["Pixel Maniacs"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 74, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/afdca36e87e5f4ea8417e6b29caca266-98.jpg", "descriptions": "ChromaGun is a first-person puzzler about colors. Use your gun (guess what it’s called), to colorize droids and walls. Droids are attracted by walls of the same color, and by cleverly utilizing this mechanic, you’ll try to solve all sorts of puzzles to make it to the exit. The ChromaGun canChromaGun is a first-person puzzler about colors. Use your gun (guess what it’s called), to colorize droids and walls. Droids are attracted by walls of the same color, and by cleverly utilizing this mechanic, you’ll try to solve all sorts of puzzles to make it to the exit. The ChromaGun can only shoot red, yellow, and blue – but don’t worry, we have you covered. Shoot a previously colored wall or droid, to mix colors into orange, purple, and green. Be wary of gray, though. Since it’s technically not a color, it loses all its attraction properties, the rascal. [Pixel Mechanics]… Expand"}, {"name": "Collar x Malice", "details_link": "https://www.metacritic.com/game/playstation-vita/collar-x-malice", "publisher": "Aksys Games", "release_date": "Jul 28 2017", "developers": ["Otomate"], "platforms": ["Switch", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "Visual Novel"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/1afca9f799e9afa6bc3a306a1e6dbf73-98.jpg", "descriptions": "A dangerous shadow organization launches a campaign of fear and violence in the city of Shinjuku, pushing society to the brink of chaos. As a young police officer tasked with restoring order, you become the target of an attack, and have a poisonous collar attached to your neck. With theA dangerous shadow organization launches a campaign of fear and violence in the city of Shinjuku, pushing society to the brink of chaos. As a young police officer tasked with restoring order, you become the target of an attack, and have a poisonous collar attached to your neck. With the situation spiraling out of control and time running out, five mysterious strangers appear to aid you in your quest for the truth.… Expand"}, {"name": "Super Cloudbuilt", "details_link": "https://www.metacritic.com/game/xbox-one/super-cloudbuilt", "publisher": "Double Eleven", "release_date": "Jul 28 2017", "developers": ["Coilworks", "Double Eleven"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/1975d41325911a0d52fcb0cc43496c7d-98.jpg", "descriptions": null}, {"name": "Pinball FX 2: Star Wars Pinball - Rogue One", "details_link": "https://www.metacritic.com/game/playstation-4/pinball-fx-2-star-wars-pinball---rogue-one", "publisher": "Zen Studios", "release_date": "Jan 31 2017", "developers": ["Zen Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Pinball"], "meta_score": 74, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/6/f6214ab808d73e77526cdaa6b26002ae-98.jpg", "descriptions": "Table features: Rogue One’s adventures unfold in 10 story-related game modes, each with completely different playfield toys. Avoid stormtrooper detection in stealth missions. Engage in firefights and close combat in action-oriented game modes."}, {"name": "Milkmaid of the Milky Way", "details_link": "https://www.metacritic.com/game/pc/milkmaid-of-the-milky-way", "publisher": "machineboy", "release_date": "Jan  4 2017", "developers": ["machineboy"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/a66fe15ad299c2f25667ccad60f8eb1f-98.jpg", "descriptions": "Milkmaid of the Milky Way is a classic point-and-click adventure game in rhyme that combines an exciting story with puzzles and exploration. What happens when a young milkmaid sees an alien craft in a fjord in 1920's Norway?"}, {"name": "Heaven's Hope", "details_link": "https://www.metacritic.com/game/pc/heavens-hope", "publisher": "EuroVideo Medien", "release_date": "Feb 25 2016", "developers": ["Mosaic Mask"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "Point-and-Click"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/25a07efc6e0f3346748040be4c988e2b-98.jpg", "descriptions": "Heaven's Hope is a goth fairytale adventure that puts you in the shoes of apprentice-angel Talorel, a young student of Heaven's stunt-flying academy who is close to passing the final exam that will finally turn him into a full-fledged angel - but when you suddenly collide with an unknownHeaven's Hope is a goth fairytale adventure that puts you in the shoes of apprentice-angel Talorel, a young student of Heaven's stunt-flying academy who is close to passing the final exam that will finally turn him into a full-fledged angel - but when you suddenly collide with an unknown flying object, you crash onto 19th century Earth near the town of Heaven's Hope. Accompanied by your friends Myriel and Azael, it is up to you to raise Heaven and Earth to find your way back up in time for the final exam. But beware of the dangers ahead - Heaven's Hope is in the firm grip of the Spanish Inquisition, and they will give you hell before they let you return to the skies.… Expand"}, {"name": "Resident Evil: Revelations 2 - Episode 4: Metamorphosis", "details_link": "https://www.metacritic.com/game/xbox-one/resident-evil-revelations-2---episode-4-metamorphosis", "publisher": "Capcom", "release_date": "Mar 18 2015", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "Survival"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/62f2aa73ff69b5dbc42f7f391ba60ca5-98.jpg", "descriptions": "Resident Evil Revelations 2 - Episode 1 required; sold separately. Xbox Live free membership required. Xbox Live Gold membership required for multiplayer features. Episode Four: Metamorphosis Claire and Moira make for the tower's top floor and a final confrontation with the Overseer. WillResident Evil Revelations 2 - Episode 1 required; sold separately. Xbox Live free membership required. Xbox Live Gold membership required for multiplayer features. Episode Four: Metamorphosis Claire and Moira make for the tower's top floor and a final confrontation with the Overseer. Will they survive and escape the island? Meanwhile, having learned of his daughter's fate, Barry prepares for the final confrontation, to keep Natalia from harm and have his revenge. Two timelines collide in this nail-biting final chapter.\r*Additional Raid Mode characters and stages included.\r*Episode One required to play.… Expand"}, {"name": "The Guided Fate Paradox", "details_link": "https://www.metacritic.com/game/playstation-3/the-guided-fate-paradox", "publisher": "NIS America", "release_date": "Nov  5 2013", "developers": ["Nippon Ichi Software"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Roguelike"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/edd42ce445cc08f3591379030c335ef1-98.jpg", "descriptions": "Players take on the role of high school student Renya Kagurazaka who has become a god by winning a lottery in a mall! Renya must travel through the Copy World in order to affect changes in the Original World and make people's wishes come true. But is there some other force at work?"}, {"name": "Incredipede", "details_link": "https://www.metacritic.com/game/pc/incredipede", "publisher": "Northway Games", "release_date": "Oct 25 2012", "developers": ["Northway Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "General"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/013736317d0bb5beeed64f956c2c3c51-98.jpg", "descriptions": "Incredipede is a puzzle game that celebrates the vast diversity of life in the world. The game follows Quozzle, a lone Incredipede on a dire quest to rescue her sisters. She has a unique ability to grow new arms and legs wherever she needs them, transforming into a snake, a spider, a horse,Incredipede is a puzzle game that celebrates the vast diversity of life in the world. The game follows Quozzle, a lone Incredipede on a dire quest to rescue her sisters. She has a unique ability to grow new arms and legs wherever she needs them, transforming into a snake, a spider, a horse, a monkey - anything you can imagine. You can give her antlers or a tail, use nature as a blueprint or strike out in weird new directions. Control Quozzle as she learns to swing through the trees, climb sheer cliffs, dance over rivers of lava, and even soar through the air on thermal winds.… Expand"}, {"name": "TrackMania: Build to Race", "details_link": "https://www.metacritic.com/game/wii/trackmania-build-to-race", "publisher": "City Interactive", "release_date": "Mar 24 2011", "developers": ["Firebrand Games"], "platforms": "Wii", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/85b34263c2212b2523ae86141e92a7db-98.jpg", "descriptions": "Over 100 tracks geared for blazing fast racing action, each loaded with daring jumps, thrilling loops, crazy ramps, and a host of other insane stunts, are just the start. You have access to the most powerful portable track design system ever, giving Trackmaniacs total freedom to create theOver 100 tracks geared for blazing fast racing action, each loaded with daring jumps, thrilling loops, crazy ramps, and a host of other insane stunts, are just the start. You have access to the most powerful portable track design system ever, giving Trackmaniacs total freedom to create the most over-the-top race courses imaginable and offering practically unlimited value. The \"Coppers\" reward system gives you credits for completed races which can be used to unlock new tracks, new car paint schemes, and most importantly, new parts to use in making the tracks of your dreams. The more you race, the more you can do! Single and multi-cart local wireless multiplayer support for up to four players at a time (and eight players via hot-seat mode) and the ability to share and race on each other's custom tracks. … Expand"}, {"name": "WWE SmackDown vs. Raw 2011", "details_link": "https://www.metacritic.com/game/playstation-3/wwe-smackdown-vs-raw-2011", "publisher": "THQ", "release_date": "Oct 26 2010", "developers": ["Yuke's"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/a45e700475b0d2d3fbe85d68b4195d6c-98.jpg", "descriptions": "WWE SmackDown vs. Raw 2011 will empower players more than ever to to define their gameplay experiences in a dynamic and ever-changing WWE.  Along the way, gameplay scenarios will change based on player decisions, allowing for more spontaneous WWE action in and out of the ring.  Players willWWE SmackDown vs. Raw 2011 will empower players more than ever to to define their gameplay experiences in a dynamic and ever-changing WWE.  Along the way, gameplay scenarios will change based on player decisions, allowing for more spontaneous WWE action in and out of the ring.  Players will also enjoy a greater level of interactivity and have increased control of their destinies in the game's popular Road to WrestleMania story-driven mode.  … Expand"}, {"name": "Broken Sword: Shadow of the Templars - The Director's Cut", "details_link": "https://www.metacritic.com/game/wii/broken-sword-shadow-of-the-templars---the-directors-cut", "publisher": "Ubisoft", "release_date": "Mar 24 2009", "developers": ["Revolution Software"], "platforms": ["iPhone/iPad", "PC", "Wii"], "num_players": "1-2 ", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/2e8d415a1288688e1b727035daffce18-98.jpg", "descriptions": "Broken Sword: Shadow of the Templars - The Director's Cut starts with the player in control of charming Parisian photo-journalist Nicole Collard, who witnesses the brutal and horrifying murder of one of Paris's richest and most influential statesmen. During her investigations, which featureBroken Sword: Shadow of the Templars - The Director's Cut starts with the player in control of charming Parisian photo-journalist Nicole Collard, who witnesses the brutal and horrifying murder of one of Paris's richest and most influential statesmen. During her investigations, which feature exclusive new locations, Nico meets amiable American George Stobbart, who has been unwittingly caught up in the sinister and bloody theft of an ancient manuscript. Together, they are drawn into a terrifying conspiracy rooted in a long-forgotten medieval legend. Expanding on the original classic storyline, The Director's Cut features tight scripting and an intense atmosphere from the explosive opening sequence to the gripping finale, where the full threat of the conspiracy is revealed. [Ubisoft]… Expand"}, {"name": "World Series of Poker 2008: Battle for the Bracelets", "details_link": "https://www.metacritic.com/game/xbox-360/world-series-of-poker-2008-battle-for-the-bracelets", "publisher": "Activision", "release_date": "Sep 26 2007", "developers": ["Left Field Productions"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "16  Online", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/8d8856f2e99fae6f750d45a20ea87418-98.jpg", "descriptions": "In World Series of Poker 2008: Battle for the Bracelets, players challenge over 30 of the world’s top poker champions. With intense heads-up tournament play, expansive poker tutorials, and strategy clips from Phil Hellmuth's Ultimate White to Black Belt Course, players can learn from theIn World Series of Poker 2008: Battle for the Bracelets, players challenge over 30 of the world’s top poker champions. With intense heads-up tournament play, expansive poker tutorials, and strategy clips from Phil Hellmuth's Ultimate White to Black Belt Course, players can learn from the very best in the industry and take on all opponents in real-world locations such as Las Vegas and New Orleans. The game features Phil \"The Poker Brat\" Hellmuth Jr. -- owner of a world record eleven WSOP bracelets -- in a special Beat The Brat Heads-Up mode and thrusts players deep into the high-stakes world of tournament poker to face off against other A-list pros such as Johnny Chan, Chris \"Jesus\" Ferguson, and Mike \"The Mouth\" Matusow on the quest to win the championship bracelet for the $10,000 Main Event and over $60MM in total prize money. [Activision]… Expand"}, {"name": "Ridge Racer 6", "details_link": "https://www.metacritic.com/game/xbox-360/ridge-racer-6", "publisher": "Namco", "release_date": "Nov 17 2005", "developers": ["Namco"], "platforms": "Xbox 360", "num_players": "Up to 14 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/a5a60a9bc7a16c5c8e8f3ce7ff55de8f-98.jpg", "descriptions": "In Ridge Racer 6, the classic Namco franchise returns with more speed, excitement and gameplay variety than ever before.  Players enter a world of high-definition, high-speed races and can choose to challenge others or take control of the wheel alone in a variety of on and offline modes.In Ridge Racer 6, the classic Namco franchise returns with more speed, excitement and gameplay variety than ever before.  Players enter a world of high-definition, high-speed races and can choose to challenge others or take control of the wheel alone in a variety of on and offline modes. Online compatibility lends to features such as Vs. Battles and downloadable content, further enhancing the game's replayability to make Ridge Racer 6 an immersive experience. [Namco]… Expand"}, {"name": "Ultra Bust-A-Move", "details_link": "https://www.metacritic.com/game/xbox/ultra-bust-a-move", "publisher": "Majesco Games", "release_date": "Nov  4 2004", "developers": ["Taito Corporation"], "platforms": "Xbox", "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/9f3da9a50790c4c340eb0b2466663b99-98.jpg", "descriptions": "The Bust-A-Move series moves onto the Xbox with an online multiplayer mode, a new 3D Puzzle mode, and five new Challenge Puzzle modes. As in previous installments, your task in Ultra Bust-A-Move is to launch randomly colored balls from the bottom of the field in an attempt to attach them toThe Bust-A-Move series moves onto the Xbox with an online multiplayer mode, a new 3D Puzzle mode, and five new Challenge Puzzle modes. As in previous installments, your task in Ultra Bust-A-Move is to launch randomly colored balls from the bottom of the field in an attempt to attach them to bubbles of the same color. Once three bubbles of the same color are touching, they pop, causing all connected bubbles to drop. Your objective is to clear the screen of all bubbles. … Expand"}, {"name": "Classic NES Series: Castlevania", "details_link": "https://www.metacritic.com/game/game-boy-advance/classic-nes-series-castlevania", "publisher": "Nintendo", "release_date": "Oct 25 2004", "developers": ["Konami"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/4e5bf6b6f67c17988222608382c820bd-98.jpg", "descriptions": "Take a stroll down memory lane with the classic side-scrolling game Castlevania. The game, which is part of the Classic NES Series on the Game Boy Advance, sets you off on a mission to undo the curse of the evil Count. Before you challenge the Count, you must first battle his army of ghosts,Take a stroll down memory lane with the classic side-scrolling game Castlevania. The game, which is part of the Classic NES Series on the Game Boy Advance, sets you off on a mission to undo the curse of the evil Count. Before you challenge the Count, you must first battle his army of ghosts, mummies, bats, and zombies. Use your magic whip and other weapons if you want to make it out of the castle alive.… Expand"}, {"name": "Manhunt", "details_link": "https://www.metacritic.com/game/xbox/manhunt", "publisher": "Rockstar Games", "release_date": "Apr 20 2004", "developers": ["Rockstar North"], "platforms": ["PC", "PlayStation 2", "PlayStation 4", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/2d712b3b7667ec24a3013f7e2ed01079-98.jpg", "descriptions": "The year's darkest and most terrifying videogame experience has arrived courtesy of Rockstar Games, makers of the controversial Grand Theft Auto series.  Walk in the shoes of James Earl Cash, a man sentenced to death only to find himself given an unexpected and sinister reprieve. Forced toThe year's darkest and most terrifying videogame experience has arrived courtesy of Rockstar Games, makers of the controversial Grand Theft Auto series.  Walk in the shoes of James Earl Cash, a man sentenced to death only to find himself given an unexpected and sinister reprieve. Forced to fight and outwit hordes of bloodthirsty gang members vying for his head on a platter. All orchestrated for pleasure and profit by the voice of an unseen Director. This is a brutal bloodsport.… Expand"}, {"name": "1503 A.D. - The New World", "details_link": "https://www.metacritic.com/game/pc/1503-ad---the-new-world", "publisher": "Electronic Arts", "release_date": "Mar 23 2003", "developers": ["Sunflowers Interactive"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/dc023abcd85f3c445b3fa953ad0e7524-98.jpg", "descriptions": "(Also known as \"Anno 1503\") Lay Claim to the New World. The New World is yours for the taking in this epic saga of adventure and discovery. Establish prosperous colonies and live in peace with your neighbors. Or expand your empire through military might and conquer entire civilizations. The(Also known as \"Anno 1503\") Lay Claim to the New World. The New World is yours for the taking in this epic saga of adventure and discovery. Establish prosperous colonies and live in peace with your neighbors. Or expand your empire through military might and conquer entire civilizations. The power is yours to forge an empire of your own design. [Electronic Arts]… Expand"}, {"name": "Apex", "details_link": "https://www.metacritic.com/game/xbox/apex", "publisher": "Atari", "release_date": "Feb 17 2003", "developers": ["Milestone S.r.l"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/c65f0a37a9ce19063b223dc16209ca4c-98.jpg", "descriptions": "Now you can race against some of the world's best-known cars with your own brand of sports car. You'll start off with a small garage, where you can create your own driving machine, and then you can go into business as the up-and-coming sports car manufacturer. Your goal is to build aNow you can race against some of the world's best-known cars with your own brand of sports car. You'll start off with a small garage, where you can create your own driving machine, and then you can go into business as the up-and-coming sports car manufacturer. Your goal is to build a reputation for your brand by racing your cars against real sports cars. The more races you win the greater pedigree your brand receives. If you consistently win races, you can start a production line, sell your cars, design new vehicles, and continue the cycle.… Expand"}, {"name": "MX Superfly", "details_link": "https://www.metacritic.com/game/xbox/mx-superfly", "publisher": "THQ", "release_date": "Nov 20 2002", "developers": ["Pacific Coast Power & Light"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/a636e748ac4e61c7cb70d6b831242925-98.jpg", "descriptions": "The excitement of motocross racing and freestyle is now available in MX Superfly. The game features expanded career modes, all-new minigames, top-notch pros, and unbelievable stunts including a freestyle track editor. Reap the rewards of racing through an entire season of intense motocrossThe excitement of motocross racing and freestyle is now available in MX Superfly. The game features expanded career modes, all-new minigames, top-notch pros, and unbelievable stunts including a freestyle track editor. Reap the rewards of racing through an entire season of intense motocross action while upgrading your gear and bike along the way. For free ride action, you can compete in the new freestyle career mode, dazzling the crowd with new tricks and dangerous maneuvers. Or simply ride the open terrain searching for secret areas without the burden of competition.… Expand"}, {"name": "Evil Islands: Curse of the Lost Soul", "details_link": "https://www.metacritic.com/game/pc/evil-islands-curse-of-the-lost-soul", "publisher": "Fishtank Interactive", "release_date": "Apr 17 2001", "developers": ["Nival Interactive"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Role-Playing", "General", "General"], "meta_score": 74, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/596b784558c331143bf0d4aa945645ba-98.jpg", "descriptions": "Employing the hack-n-slash formula made popular by Blizzard's \"Diablo II,\" this action role-playing fantasy features a character named Zak who awakens with amnesia on a primitive island barely clothed and initially carrying only a bronze knife and must slaughter countless monsters on theEmploying the hack-n-slash formula made popular by Blizzard's \"Diablo II,\" this action role-playing fantasy features a character named Zak who awakens with amnesia on a primitive island barely clothed and initially carrying only a bronze knife and must slaughter countless monsters on the quest for his identity.… Expand"}, {"name": "Hidden & Dangerous", "details_link": "https://www.metacritic.com/game/pc/hidden-dangerous", "publisher": "Take-Two Interactive", "release_date": "Jul 29 1999", "developers": ["Illusion Softworks"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "General", "Shooter", "First-Person", "Tactical", "Historic"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/a0290c56efb19d0afb747bda295b891c-98.jpg", "descriptions": "The player can control any of 4 commando members from several different 3D views and, at the same time, program tasks for the rest of the team on a tactical map. Carefully edge your way through enemy territory, hoping you aren't detected by enemy German soldiers en route. In order toThe player can control any of 4 commando members from several different 3D views and, at the same time, program tasks for the rest of the team on a tactical map. Carefully edge your way through enemy territory, hoping you aren't detected by enemy German soldiers en route. In order to survive, you need to inch your way forward, keeping out of sight, using binoculars or a sniper scope to make sure the coast is clear. [Take 2 Interactive]… Expand"}, {"name": "Kinectimals", "details_link": "https://www.metacritic.com/game/xbox-360/kinectimals", "publisher": "Microsoft Game Studios", "release_date": "Nov  4 2010", "developers": ["Frontier Developments"], "platforms": ["iPhone/iPad", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 74, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/2/eca3b5317cb3f7cb36246e9d39ee5ab7-98.jpg", "descriptions": "Kinectimals is a game for Microsoft's new motion-sensing accessory that lets players raise over 20 different types of virtual cats, including cheetahs, lions, and tigers."}, {"name": "Katamari Forever", "details_link": "https://www.metacritic.com/game/playstation-3/katamari-forever", "publisher": "Bandai Namco Games", "release_date": "Sep 22 2009", "developers": ["Bandai Namco Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/9df94e49d0528c320b55dbba8776b8c4-98.jpg", "descriptions": "Use the Prince's katamari to roll up everyday objects in each level. The more objects that the Prince rolls up, the larger his katamari becomes, allowing him to roll up bigger items. The Prince faces his toughest challenge ever as Katamari Forever boasts the largest collection of stages,Use the Prince's katamari to roll up everyday objects in each level. The more objects that the Prince rolls up, the larger his katamari becomes, allowing him to roll up bigger items. The Prince faces his toughest challenge ever as Katamari Forever boasts the largest collection of stages, modes, songs, and cousins to date.  Remixed classic Katamari Damacy tunes, a brand-new storyline, multiple new visual effects and 1080p graphics round out Katamari Forever into the ultimate Katamari experience ever. A terrible event has occurred causing the stars to disappear from the night sky and the King of All Cosmos to fall into a coma.  The Prince must use his finely tuned Katamari rolling skills once more to re-create the absent celestial bodies, save his royal father and restore order to the Cosmos.  Thumb tacks, sushi, cats, people, skyscrapers, ocean liners and continents - nothing is safe as the Prince makes his way through the largest variety of stages in a single Katamari game ever. New graphical styles give Katamari Forever a certain \"je ne sais quoi\" that all new Katamari games possess.  A few of the new styles include Wood, which uses warm sepia tones to give stages a wooden feel, while Comic creates thick black outlines on every object while filling them in with deep, rich colors. Make sure to try them all out and find your favorite for a totally new way to experience the world of Katamari. In addition to all these great new features, Katamari Forever also contains local cooperative and competitive multiplayer modes.  Choose your favorite cousin and play together or compete in heated Katamari competition.  Who will become the Katamari champion in your house? [Namco Bandai Games]… Expand"}, {"name": "Toukiden: Kiwami", "details_link": "https://www.metacritic.com/game/playstation-4/toukiden-kiwami", "publisher": "Koei Tecmo Games", "release_date": "Mar 31 2015", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/57d1c75529cc4526ecb6873e4dee8edd-98.jpg", "descriptions": "In the world of Toukiden, Demons (Oni) have hidden in the shadows aiming to torment mankind. Throughout history, a secret caste of warriors, the Slayers, have been trained to dispose of the demonic threat before it could consume the world. However, an event called the ‘Awakening’ causedIn the world of Toukiden, Demons (Oni) have hidden in the shadows aiming to torment mankind. Throughout history, a secret caste of warriors, the Slayers, have been trained to dispose of the demonic threat before it could consume the world. However, an event called the ‘Awakening’ caused rifts to appear in space and time, causing places that had long disappeared from the world to resurface, unleashing  hordes of demons that relentlessly hunted humans.… Expand"}, {"name": "Naruto Shippuden: Clash of Ninja Revolution III", "details_link": "https://www.metacritic.com/game/wii/naruto-shippuden-clash-of-ninja-revolution-iii", "publisher": "Tomy Corporation", "release_date": "Nov 17 2009", "developers": ["Eighting", "8ing/Raizing"], "platforms": "Wii", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/19adabf52eba5dd167668b292572a085-98.jpg", "descriptions": "Based on the hit animated show from Viz Media, the game features 40 characters with the new grown-up look of the NARUTO Shippuden cast and follows the storyline of the much-loved series. The hit fighting game series delivers again with new and improved gameplay mechanics and a plethora ofBased on the hit animated show from Viz Media, the game features 40 characters with the new grown-up look of the NARUTO Shippuden cast and follows the storyline of the much-loved series. The hit fighting game series delivers again with new and improved gameplay mechanics and a plethora of gameplay modes and options including for the first time, Wi-Fi multiplayer functionality. [Tomy Corporation]… Expand"}, {"name": "LIT", "details_link": "https://www.metacritic.com/game/wii/lit", "publisher": "WayForward", "release_date": "Feb  9 2009", "developers": ["WayForward"], "platforms": ["iPhone/iPad", "PC", "Wii"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/20cc89de23b6885cf4cef30464267ce9-98.jpg", "descriptions": "[WiiWare]  LIT is a 3D horror action puzzler that follows Jake, a typical, apathetic, slightly emo teenager, who's trapped in his high school when it's overrun by dark creatures. Players must guide Jake through 30 classrooms, using the available light sources to create paths to each exit.[WiiWare]  LIT is a 3D horror action puzzler that follows Jake, a typical, apathetic, slightly emo teenager, who's trapped in his high school when it's overrun by dark creatures. Players must guide Jake through 30 classrooms, using the available light sources to create paths to each exit. The goal is to reunite Jake with his girlfriend Rachael, who’s also trapped in the school and calls Jake from time to time on the school’s phone system. Stay in the light and Jake’s safe. Step into the darkness and he’s pulled under. In addition to light puzzling, the game features 5 boss battles against dark faculty members, an unlockable challenge mode, multiple endings, level select mode, and a second playable character. [WayForward]… Expand"}, {"name": "Unmechanical", "details_link": "https://www.metacritic.com/game/pc/unmechanical", "publisher": "Teotl Studios", "release_date": "Aug  8 2012", "developers": ["Teotl Studios", "Talawa Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Puzzle", "General", "Puzzle", "Platformer", "General", "2D"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/fa4f476ffd959f1b9421ea828f8125ff-98.jpg", "descriptions": "Unmechanical is an award-winning 2.5D side-scroller which combines tricky puzzle solving, alluring exploration, and an engrossing atmosphere. The game had humble beginnings as a student project and since then both game and team has grown. \"Unmechanical has been about taking on something forUnmechanical is an award-winning 2.5D side-scroller which combines tricky puzzle solving, alluring exploration, and an engrossing atmosphere. The game had humble beginnings as a student project and since then both game and team has grown. \"Unmechanical has been about taking on something for real and working our fingers to the bone to get it done. It's our hopes and ambitions combined into this very personal, unique, and awesome adventure that's crafted with lots of love.\" Said Marko Permanto, project lead for the Unmechanical team.… Expand"}, {"name": "Dungeons & Dragons Online: Stormreach", "details_link": "https://www.metacritic.com/game/pc/dungeons-dragons-online-stormreach", "publisher": "Atari", "release_date": "Feb 28 2006", "developers": ["Turbine Inc."], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/25b92948d14a5a98c61763fcd0d1840b-98.jpg", "descriptions": "Dungeons & Dragons Online provides players with the definitive online Dungeons & Dragons experience, complete with dramatic dungeon crawling, terrifying monster combat, challenging puzzles and character advancement. Dungeons & Dragons Online is centered on robust character advancement andDungeons & Dragons Online provides players with the definitive online Dungeons & Dragons experience, complete with dramatic dungeon crawling, terrifying monster combat, challenging puzzles and character advancement. Dungeons & Dragons Online is centered on robust character advancement and challenging dungeon combat. Players choose and develop a character based on some of the iconic races associated with D&D, including Humans, Elves and Halflings, as well as classes such as Fighters, Clerics, Rogues and Wizards - after which they can socialize, find quests, group together and equip themselves for future battles. Dungeons & Dragons Online lets players travel alone or in parties as they explore the seemingly endless dungeon complexes found beneath the world. Through the dungeons, players engage in physical and magical combat with hideous foes straight from the pages of the Monster Manual rulebook. Battle is challenging, fast-paced, and easy to control with a wealth of unique weapon effects and character movements, as well as specific monster behaviors designed to keep combat both tactical and action packed. [Turbine]… Expand"}, {"name": "Sam & Max: Season One", "details_link": "https://www.metacritic.com/game/wii/sam-max-season-one", "publisher": "DreamCatcher Interactive", "release_date": "Oct 15 2008", "developers": ["Telltale Games"], "platforms": ["PC", "Xbox 360", "Wii"], "num_players": "1 Player", "genres": ["Miscellaneous", "Adventure", "General", "Compilation", "3D", "Compilation", "Point-and-Click", "Third-Person"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/1394bb99e6e2d370a716e723b8c67d49-98.jpg", "descriptions": "The Sam & Max episodes let players guide the Freelance Police through a series of bizarre—and often sidesplitting—mysteries. Sam is a six-foot dog in a baggy suit sporting a trombone-sized .44 hand-cannon. Max is a three foot \"rabbity thing\" with a saw blade grin and the impulsive nature ofThe Sam & Max episodes let players guide the Freelance Police through a series of bizarre—and often sidesplitting—mysteries. Sam is a six-foot dog in a baggy suit sporting a trombone-sized .44 hand-cannon. Max is a three foot \"rabbity thing\" with a saw blade grin and the impulsive nature of the average piranha. Together they patrol the sticky streets of a fantastical New York City, righting wrongs, pummeling perps, and ridding the urban landscape of the shifty legions of \"self-propelled gutter trash\" that litter their streets. Sam & Max have appeared in comics, video games, an animated TV series coming soon to DVD, and an Eisner award-winning webcomic. [TellTale Games]… Expand"}, {"name": "Drone Tactics", "details_link": "https://www.metacritic.com/game/ds/drone-tactics", "publisher": "Atlus", "release_date": "May 12 2008", "developers": ["Success"], "platforms": "DS", "num_players": "2  Online", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/e5ff079775c97566dde056bf428c5c07-98.jpg", "descriptions": "Transported to an alien world, you find yourself in the middle of a great conflict. An army of evil Drones is on the march, threatening to obliterate the land of Cimexus. Its inhabitants now turn to you to lead them in battle against the Black Swarm. Each level offers new challenges, andTransported to an alien world, you find yourself in the middle of a great conflict. An army of evil Drones is on the march, threatening to obliterate the land of Cimexus. Its inhabitants now turn to you to lead them in battle against the Black Swarm. Each level offers new challenges, and taking full advantage of each Drone’s unique specialties will be the difference between success and defeat! Build and command your own Drone army – Wreak mechanical havoc with your squad of insect mechs, choosing from over 100 weapons, upgrades, and power-ups to optimize your forces. Conquer dozens of campaign operations and over 50 additional maps – Take on the forces of the Black Swarm then confront the challenges that wait in the mysterious Badlands. Battle for domination in head-to-head combat – Friends become enemies in local wireless play. [Atlus USA]… Expand"}, {"name": "Dive: The Medes Islands Secret", "details_link": "https://www.metacritic.com/game/wii/dive-the-medes-islands-secret", "publisher": "Cosmonaut Games", "release_date": "Jul 26 2010", "developers": ["Over the Top Games"], "platforms": ["PC", "Wii"], "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/2275dfa235d37c91973c79baa1bb04e3-98.jpg", "descriptions": "Dive: The Medes Islands Secret recreates underwater scenes from 10 different real locations from around the world, with large levels filled with enemies, mazes, dangers and treasures. It contains an economic system that will enable players to exchange or upgrade their diving equipment, whichDive: The Medes Islands Secret recreates underwater scenes from 10 different real locations from around the world, with large levels filled with enemies, mazes, dangers and treasures. It contains an economic system that will enable players to exchange or upgrade their diving equipment, which is required to reach the deepest mysteries.… Expand"}, {"name": "Shadow Complex Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/shadow-complex-remastered", "publisher": "Epic Games", "release_date": "Mar 16 2016", "developers": ["Chair Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "Shooter", "Third-Person", "", "Metroidvania", "Arcade"], "meta_score": 74, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/541c7b4d5d96a17cab85d36d5253a325-98.jpg", "descriptions": "Shadow Complex Remastered features all the great gameplay from the award-winning classic, updated with exciting new enhancements and achievements to support its debut on PC, PlayStation 4, and Xbox One."}, {"name": "Arcade Paradise", "details_link": "https://www.metacritic.com/game/playstation-5/arcade-paradise", "publisher": "Wired Productions", "release_date": "Aug 11 2022", "developers": ["Nosebleed Interactive"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual", "Party / Minigame", "Career"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/d0bfbbbe42f936c911a9256cd5db6207-98.jpg", "descriptions": "Welcome to Arcade Paradise, the 90's-fuelled retro arcade adventure. Rather than washing rags for a living, you decide to turn the family laundromat into the ultimate arcade. Play, profit and purchase new arcade machines, with over 35 to choose from, to build your very own Arcade Paradise!Welcome to Arcade Paradise, the 90's-fuelled retro arcade adventure. Rather than washing rags for a living, you decide to turn the family laundromat into the ultimate arcade. Play, profit and purchase new arcade machines, with over 35 to choose from, to build your very own Arcade Paradise!Take the laundromat business made up of dull chores from washing clothes to throwing out the trash, and turn it into a booming arcade with the coolest games in town raking in all the money!Over 35 arcade games, each fully realized with its own gameplay, stories, missions and high scores to set! Inspired by 3 decades of gaming, from early vector games right up to the 32-bit era.Insert a second coin and play against a friend in a number of co-operative & competitive arcade games up to 4 players locally.… Expand"}, {"name": "God Wars: Future Past", "details_link": "https://www.metacritic.com/game/playstation-4/god-wars-future-past", "publisher": "NIS America", "release_date": "Jun 20 2017", "developers": ["Kadokawa"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/72456682dd6c6a0c29169faa562d10ba-98.jpg", "descriptions": "GOD WARS Future Past is a tactical RPG that explores the untold history of Japan through folklore and strategic combat. Gamers will experience the traditional stories of Japan’s origin through the lens of three warring nations, with a massive expanse of options to develop their strategiesGOD WARS Future Past is a tactical RPG that explores the untold history of Japan through folklore and strategic combat. Gamers will experience the traditional stories of Japan’s origin through the lens of three warring nations, with a massive expanse of options to develop their strategies from including a myriad of character classes and equipment within innovative and challenging stages.… Expand"}, {"name": "Gibbous -  A Cthulhu Adventure", "details_link": "https://www.metacritic.com/game/pc/gibbous---a-cthulhu-adventure", "publisher": "Stuck In Attic", "release_date": "Aug  7 2019", "developers": ["Stuck In Attic"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 74, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/a570751daba6370bba2ef98d252a0379-98.jpg", "descriptions": "Crazy cultists. Cthulhu. A talking cat. Gibbous takes you on an expansive, traditionally animated, hand-painted adventure. Play as three protagonists and explore a lushly rendered Lovecraft-inspired world, unraveling ancient conspiracies. A comedy cosmic horror adventure made in Transylvania."}, {"name": "Yonder: The Cloud Catcher Chronicles", "details_link": "https://www.metacritic.com/game/switch/yonder-the-cloud-catcher-chronicles", "publisher": "Prideful Sloth", "release_date": "May 17 2018", "developers": ["Prideful Sloth"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/72daec815925e7550f35f1268615ca61-98.jpg", "descriptions": "Yonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the islandYonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the island flourish.… Expand"}, {"name": "Fuser", "details_link": "https://www.metacritic.com/game/pc/fuser", "publisher": "NCSOFT", "release_date": "Nov  9 2020", "developers": ["Harmonix Music Systems"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 12 ", "genres": ["Action", "Rhythm", "Music"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/a6f0779559918ef58057496056d28526-98.jpg", "descriptions": "From the creators of Rock Band and Dance Central. Welcome to FUSER, a non-stop digital music festival where YOU control the music and share it with the world!"}, {"name": "WWE 2K14", "details_link": "https://www.metacritic.com/game/playstation-3/wwe-2k14", "publisher": "2K Games", "release_date": "Oct 29 2013", "developers": ["Yuke's"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/a68571c1bf912db086b13f740d0846d2-98.jpg", "descriptions": "WWE 2K14 is and authentic and comprehensive WWE videogame experience and the first release in the flagship WWE videogame franchise for 2K Sports."}, {"name": "Marble It Up!", "details_link": "https://www.metacritic.com/game/switch/marble-it-up!", "publisher": "Bad Habit Productions", "release_date": "Sep 29 2018", "developers": ["Bad Habit Productions"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Puzzle", "Platformer", "3D"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/c2cd034f4b7ae7f4bbe30b010eb8dfd1-98.jpg", "descriptions": "Experience first-hand the simple joy of rolling while exploring a gloriously psychedelic world full of mind-bending levels and dynamic power-ups."}, {"name": "Midway Arcade Treasures 2", "details_link": "https://www.metacritic.com/game/xbox/midway-arcade-treasures-2", "publisher": "Midway", "release_date": "Oct 11 2004", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/d24451352e30fb8457f1ed30cfcea286-98.jpg", "descriptions": "Midway Arcade Treasures 2 brings 20 classic arcade games back to next-generation consoles. This compilation includes such favorites as Mortal Kombat 1, 2, and 3, Spy Hunter 2, Gauntlet 2, NARC, Cyber-Ball, Wizard of Wor, Primal Rage, Steel Talons, Arch Rivals, and more. Each game can provideMidway Arcade Treasures 2 brings 20 classic arcade games back to next-generation consoles. This compilation includes such favorites as Mortal Kombat 1, 2, and 3, Spy Hunter 2, Gauntlet 2, NARC, Cyber-Ball, Wizard of Wor, Primal Rage, Steel Talons, Arch Rivals, and more. Each game can provide hours of retro-gaming entertainment. Midway Arcade Treasures 2 also features a documentary on the origins of these games.… Expand"}, {"name": "Resident Evil: Revelations", "details_link": "https://www.metacritic.com/game/playstation-3/resident-evil-revelations", "publisher": "Capcom", "release_date": "May 21 2013", "developers": ["Capcom"], "platforms": ["3DS", "PC", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "2 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/15134ef47a8c34143800d2f46b0bd39e-98.jpg", "descriptions": "Resident Evil: Revelations tells the story of what happens between Resident Evil 4 and Resident Evil 5."}, {"name": "One Piece: Pirate Warriors 3", "details_link": "https://www.metacritic.com/game/playstation-4/one-piece-pirate-warriors-3", "publisher": "Bandai Namco Games", "release_date": "Aug 25 2015", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/6f077d13fd34a73ef800bcd5ec944044-98.jpg", "descriptions": "Rain down attacks on the hordes of enemies pouring onto players’ screens, and double team with a partner to launch an even more massive assault. A myriad of co-op action and fusion attacks with new support attacks will take the action gameplay to greater heights. Join up with your faves fromRain down attacks on the hordes of enemies pouring onto players’ screens, and double team with a partner to launch an even more massive assault. A myriad of co-op action and fusion attacks with new support attacks will take the action gameplay to greater heights. Join up with your faves from the Straw Hat Crew or even with villains like Captain Kuro, Alvida and Axe-hand Morgan and call them into battle to pull off unrestrained combos that will send enemies flying.… Expand"}, {"name": "Puyo Puyo Champions", "details_link": "https://www.metacritic.com/game/switch/puyo-puyo-champions", "publisher": "Sega", "release_date": "May  7 2019", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Puzzle", "Matching"], "meta_score": 74, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/792212b72519c2d45c611022b0a540ec-98.jpg", "descriptions": "Easy to learn, tough to master. Jump straight into fast-paced puzzle action with features fit for both friendly rivalries and competitive tournaments in Puyo Puyo Champions. Challenge your friends and family in local multiplayer or compete against players from around the world through onlineEasy to learn, tough to master. Jump straight into fast-paced puzzle action with features fit for both friendly rivalries and competitive tournaments in Puyo Puyo Champions. Challenge your friends and family in local multiplayer or compete against players from around the world through online matchmaking. Built for all ages, this classic puzzle game comes with a surprisingly competitive edge. Craft strategic chains and drop devastating attacks with your favorite characters from over 25 years of Puyo Puyo history. … Expand"}, {"name": "Castlevania Requiem: Symphony of the Night & Rondo of Blood", "details_link": "https://www.metacritic.com/game/playstation-4/castlevania-requiem-symphony-of-the-night-rondo-of-blood", "publisher": "Konami", "release_date": "Oct 26 2018", "developers": ["Konami"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/03f500f23b6ba73b358ee9492e5aa1a9-98.jpg", "descriptions": "2 Castlevania masterpieces available for the first time on PlayStation4. Now relive 2 of the greatest titles within the Castlevania series: \"Rondo of Blood\" (PC Engine) and \"Symphony of the Night\" (PlayStation). Rondo of Blood -> The 10th in its series crafted with stunning graphics and2 Castlevania masterpieces available for the first time on PlayStation4. Now relive 2 of the greatest titles within the Castlevania series: \"Rondo of Blood\" (PC Engine) and \"Symphony of the Night\" (PlayStation). Rondo of Blood -> The 10th in its series crafted with stunning graphics and beautiful music. Released on PC-Engine in 1993, this was the first in the series released as a CD-ROM game. It took full advantage of the new media format, and was praised by reviewers for its crisp visuals and amazing music.  Venture through 9 stages featuring hidden levels and alternative routes to save imprisoned villagers as you set out to destroy count Dracula once and for all. Playable characters include Richter Belmont the Vampire Hunter and Maria Renard the master of the 4 celestial beasts. Symphony of the Night ->  First exploration-type side scroll action game in the series. The game is set in the sprawling Castlevania through which Alucard, son of Dracula must venture in his quest to confront, and ultimately destroy his father. Featuring ground breaking non-linear gameplay, Symphony of the Night helped define a new genre of gameplay by blending RPG elements, exploration and platforming. The vast number of weapons and items found throughout the game allows a diverse range of play styles to be employed. This game perfected the essence of the Castlevania series with gorgeous artwork and classic soundtrack that carry the player through the game.… Expand"}, {"name": "Call of Duty: Black Ops III - Awakening", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-black-ops-iii---awakening", "publisher": "Activision", "release_date": "Feb  2 2016", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 74, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/cce38496ea582ddf7bb367eca0619851-98.jpg", "descriptions": "The first of four planned DLC map packs, Awakening features 4 new multiplayer maps - Skyjacked, Rise, Splash, and Gauntlet - and the next chapter in the Black Ops 3 Zombies saga, Der Eisendrache."}, {"name": "Adventures of Pip", "details_link": "https://www.metacritic.com/game/pc/adventures-of-pip", "publisher": "TicToc Games", "release_date": "Mar 17 2015", "developers": ["TicToc Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/c06660cbf64f146a5bddfd8f6f625336-98.jpg", "descriptions": "Pip is an unlikely 1-pixel hero yet has the unique ability to absorb the pixels of his defeated enemies to evolve into three different forms. Players will skillfully switch between these three forms while exploring five worlds on an epic 10-hour campaign to defeat the Skeleton Queen."}, {"name": "Guitar Hero: Warriors of Rock", "details_link": "https://www.metacritic.com/game/playstation-3/guitar-hero-warriors-of-rock", "publisher": "Activision", "release_date": "Sep 28 2010", "developers": ["Neversoft Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music Maker", "Music", "Music"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/18631d89125fffcad4751ce35ee53da3-98.jpg", "descriptions": "KISS frontman Gene Simmons provides the voice for the next installment in Activision's long-running rhythm-game series."}, {"name": "Back 4 Blood", "details_link": "https://www.metacritic.com/game/xbox-series-x/back-4-blood", "publisher": "Warner Bros. Games", "release_date": "Oct  7 2021", "developers": ["Turtle Rock Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 74, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/3b4b611c90ed85a79afc1bf4ec165e70-98.jpg", "descriptions": "From the creators and development team behind the critically acclaimed, co-op phenomenon Left 4 Dead. Back 4 Blood is designed from the ground-up as an original, premium title and marries the best of what made the co-op zombie shooter so successful with new features and state-of-the-art technology."}, {"name": "Full Spectrum Warrior", "details_link": "https://www.metacritic.com/game/playstation-2/full-spectrum-warrior", "publisher": "THQ", "release_date": "Mar 21 2005", "developers": ["Pandemic Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "2  Online", "genres": ["Strategy", "Real-Time", "Military"], "meta_score": 74, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/2d0b2f7ac6f97eb60ca75966047e9b84-98.jpg", "descriptions": "Full Spectrum Warrior is based on a game commissioned by the U.S. Army to train light Infantry troops in urban combat situations. Soldiers are placed in a tense, hostile, and claustrophobic environment where they must complete a variety of military objectives. Players act as the SquadFull Spectrum Warrior is based on a game commissioned by the U.S. Army to train light Infantry troops in urban combat situations. Soldiers are placed in a tense, hostile, and claustrophobic environment where they must complete a variety of military objectives. Players act as the Squad Leader, providing direction to Alpha and Bravo fire teams. The successful Squad Leader effectively uses cover in the environment and moves his fire teams in a coordinated fashion so they can protect themselves from possible attacks that could come from any direction. Full Spectrum Warrior puts you in the dirt with your men, where danger lurks around every corner. [THQ]… Expand"}, {"name": "We Are OFK", "details_link": "https://www.metacritic.com/game/switch/we-are-ofk", "publisher": "Team OFK", "release_date": "Aug 18 2022", "developers": ["Team OFK"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 74, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/6/6e98627d623f7a19caa51646c32b4691-98.jpg", "descriptions": "Itsumi Saito just moved Downtown and broke up with her long-term girlfriend, leaning into her dream of making it in music. But juggling practice, friends, a brutal commute to the west side, and a full-time job... Itsu is struggling to establish herself in the cutthroat music scene of LA.Itsumi Saito just moved Downtown and broke up with her long-term girlfriend, leaning into her dream of making it in music. But juggling practice, friends, a brutal commute to the west side, and a full-time job... Itsu is struggling to establish herself in the cutthroat music scene of LA. When she talks her way into a shmoozy Hollywood party and makes friends with a rising music producer, she sees a chance to bring her dreams a little closer.We Are OFK is an interactive narrative series of arguing over lyrics, sending sad texts, and playing Interactive Music Videos, including OFK's debut single \"Follow/Unfollow\" and more!… Expand"}, {"name": "Sniper Ghost Warrior Contracts 2", "details_link": "https://www.metacritic.com/game/xbox-series-x/sniper-ghost-warrior-contracts-2", "publisher": "CI Games", "release_date": "Jun  4 2021", "developers": ["CI Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/4cc657dcb63d33bbc3a2becaadbc43b7-98.jpg", "descriptions": "Sniper Ghost Warrior Contracts 2 marks the most challenging entry to the acclaimed series yet, introducing extreme long-range sniping with targets over 1000m away. Featuring a dramatic single-player campaign set in modern day Middle East, experience high-pressure tactical combat, deep insideSniper Ghost Warrior Contracts 2 marks the most challenging entry to the acclaimed series yet, introducing extreme long-range sniping with targets over 1000m away. Featuring a dramatic single-player campaign set in modern day Middle East, experience high-pressure tactical combat, deep inside enemy territory.Take on the role of Reaper, Contract Sniper Assassin, as he embarks on a new series of contracts in a lawless region of the Middle East, located along the Lebanese and Syrian borders. Tasked with a seemingly impossible task, your mission is to topple an insidious criminal syndicate and bring them to justice.… Expand"}, {"name": "Nano Assault EX", "details_link": "https://www.metacritic.com/game/3ds/nano-assault-ex", "publisher": "Majesco Games", "release_date": "Mar  7 2013", "developers": ["Shin'en"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Top-Down"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/f314ca89b16e95412a0d9cdb32c6f3f7-98.jpg", "descriptions": "Nano Assault EX is an action shooter game in which players pilot a microscopic ship to stop a deadly virus from contaminating humanity."}, {"name": "UFC Undisputed 2010", "details_link": "https://www.metacritic.com/game/psp/ufc-undisputed-2010", "publisher": "THQ", "release_date": "Sep  7 2010", "developers": ["Yuke's"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/14721afa509a769cab3d02f2fb5761d6-98.jpg", "descriptions": "THQ's wildly popular ultimate fighting game is back for a second round."}, {"name": "White Shadows", "details_link": "https://www.metacritic.com/game/xbox-series-x/white-shadows", "publisher": "Headup Games", "release_date": "Dec  7 2021", "developers": ["Monokel"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/d0c964d0f8c3bce1ce3ed71383abb628-98.jpg", "descriptions": "White Shadows is a cinematic puzzle-platformer where you play as a little Ravengirl trying to escape a brutal dystopia founded on oppression and violence that puts her at the bottom of its hierarchical social ladder."}, {"name": "Lost Words: Beyond the Page", "details_link": "https://www.metacritic.com/game/playstation-4/lost-words-beyond-the-page", "publisher": "Modus Games", "release_date": "Apr  6 2021", "developers": ["Sketchbook Games"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/3df0abba1646ea30bd347b0fc75ec2f0-98.jpg", "descriptions": "An atmospheric narrative adventure written by Rhianna Pratchett. Set between the pages of a diary and a fantasy story where you run on words and use them to interact with the world around you."}, {"name": "Clustertruck", "details_link": "https://www.metacritic.com/game/switch/clustertruck", "publisher": "tinyBuild", "release_date": "Mar 15 2018", "developers": ["tinyBuild"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 74, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/6cca026dfc91eea2571446aa4a33fee4-98.jpg", "descriptions": "ClusterTruck is a chaotic physics based truckformer. Jump your way through insane levels in a game of \"the floor is lava\" on top of speeding trucks driven by terrible drivers. The game only gets harder when dangers such as swinging hammers, lasers and flamethrowers are added."}, {"name": "LEGO Marvel Super Heroes 2", "details_link": "https://www.metacritic.com/game/xbox-one/lego-marvel-super-heroes-2", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 14 2017", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/662d2b30109f7abf63b10a0456b5d33e-98.jpg", "descriptions": "With a completely original branching storyline, LEGO® Marvel Super Heroes 2  introduces amazing new gameplay features, including the ability for characters to manipulate time and a four-player competitive Super Hero battling mode. With a huge array of brand new characters from the MarvelWith a completely original branching storyline, LEGO® Marvel Super Heroes 2  introduces amazing new gameplay features, including the ability for characters to manipulate time and a four-player competitive Super Hero battling mode. With a huge array of brand new characters from the Marvel Universe, including old favorites in new guises, this game is sure to thrill both LEGO and Marvel fans, as well as newcomers to the series.… Expand"}, {"name": "Costume Quest 2", "details_link": "https://www.metacritic.com/game/playstation-4/costume-quest-2", "publisher": "Majesco Games", "release_date": "Oct 28 2014", "developers": ["Double Fine Productions"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG", "Japanese-Style"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/074882eb01befd75620dc60ad4760635-98.jpg", "descriptions": "Become a candy obsessed crusader in the sweet sequel to Double Fine's original smash hit!\r Trick, treat and pick a fight with villainous dental soldiers in Costume Quest 2, the sweet sequel to Double Fines hit original, Costume Quest, that turned fans of all ages into candy obsessedBecome a candy obsessed crusader in the sweet sequel to Double Fine's original smash hit!\r Trick, treat and pick a fight with villainous dental soldiers in Costume Quest 2, the sweet sequel to Double Fines hit original, Costume Quest, that turned fans of all ages into candy obsessed crusaders. This inspired RPG adventure includes a range of new features and gameplay improvements to double the amount of mischievous fun. Explore spooky time-traversing landscapes, don adorable new costumes that transform into powerful Hallo-warriors, and collect even Creepier Treat Cards to wield in combat against a legion of hygiene obsessed baddies. Only heroic siblings Wren and Reynold can save Halloween forever!… Expand"}, {"name": "Jet Grind Radio", "details_link": "https://www.metacritic.com/game/game-boy-advance/jet-grind-radio", "publisher": "THQ", "release_date": "Jun 26 2003", "developers": ["Vicarious Visions"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/6baa4ffbcb04b5b56fa32fc8d21f1112-98.jpg", "descriptions": "If you’re looking for a legal way to deface property with graffiti, and not necessarily the most complex skating game around, then Jet Grind Radio is right up your alley."}, {"name": "RollerCoaster Tycoon 2", "details_link": "https://www.metacritic.com/game/pc/rollercoaster-tycoon-2", "publisher": "Atari", "release_date": "Oct 15 2002", "developers": ["Chris Sawyer"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Business / Tycoon"], "meta_score": 74, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/e640af59802fa776854fa90fbc2ff2b9-98.jpg", "descriptions": "Includes 25 Six Flags roller coasters from 5 different locations, including Six Flags Magic Mountain and Six Flags Great Adventure. Create your own incredible roller coasters using the all-new Roller Coaster Designer. Trade creations and challenge other RollerCoaster Tycoons worldwide onIncludes 25 Six Flags roller coasters from 5 different locations, including Six Flags Magic Mountain and Six Flags Great Adventure. Create your own incredible roller coasters using the all-new Roller Coaster Designer. Trade creations and challenge other RollerCoaster Tycoons worldwide on rollercoastertycoon.com. Push the limits with new roller coaster types, including Giga Coaster, Spinning Wild Mouse, Inverted Impulse Coaster and more. Customize your park with new and unique themes, including Giant Garden, Wild West, Pirates and more! [Infogrames]… Expand"}, {"name": "Pirates: The Legend of Black Kat", "details_link": "https://www.metacritic.com/game/xbox/pirates-the-legend-of-black-kat", "publisher": "Electronic Arts", "release_date": "Mar 24 2002", "developers": ["Westwood Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/bdf13e84f2f7bebc5ffcedb4fe4346da-98.jpg", "descriptions": "Dangerous and fantastic island worlds are waiting to be discovered in Pirates: The Legend of Black Kat. Join the heroine, Black Kat, on a mission to liberate Voodoo Isles from Captain Hawk's evil clutches. Customize one of 12 vessels with a wide range of items and rare magical weapons. WithDangerous and fantastic island worlds are waiting to be discovered in Pirates: The Legend of Black Kat. Join the heroine, Black Kat, on a mission to liberate Voodoo Isles from Captain Hawk's evil clutches. Customize one of 12 vessels with a wide range of items and rare magical weapons. With your ship's massive firepower or your own swashbuckling skills, you can battle witch doctors, mermaids, mythical beasts, spirits, skull apes, and more. Once you've conquered the solo missions, you can battle a friend in ship-to-ship combat for treasure and bragging rights.… Expand"}, {"name": "Cossacks: European Wars", "details_link": "https://www.metacritic.com/game/pc/cossacks-european-wars", "publisher": "Strategy First", "release_date": "Apr 14 2001", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "General", "General", "Command"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/12edfb2f230213420203175be5af6a87-98.jpg", "descriptions": "A real-time strategy game set in 17th and 18th century Europe, the age of Napoleonic war and early gun combat, and similar to \"Age of Empires II.\""}, {"name": "Dying Light", "details_link": "https://www.metacritic.com/game/playstation-4/dying-light", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jan 27 2015", "developers": ["Techland"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 5 ", "genres": ["Horror", "Action Adventure", "Horror", "Survival"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/81733a7edae596e80228f013ff9ffdfb-98.jpg", "descriptions": "During the day you will explore the city in search of provisions and weapons. When the night falls, however, this troubled world undergoes a dramatic transformation that gives the gameplay a new dimension. You, as a hunter by day, become the hunted. The infected increase their strength, butDuring the day you will explore the city in search of provisions and weapons. When the night falls, however, this troubled world undergoes a dramatic transformation that gives the gameplay a new dimension. You, as a hunter by day, become the hunted. The infected increase their strength, but something more sinister lurks in the dark to begin its prowl.… Expand"}, {"name": "Mass Effect 3: Leviathan", "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-3-leviathan", "publisher": "Electronic Arts", "release_date": "Aug 28 2012", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/7daadeb8f700919e16178ca8acc4d59a-98.jpg", "descriptions": "Mass Effect 3: Leviathan is a story-driven single player DLC where players are thrust into the darkest corner of space to hunt a mysterious being rumored to be powerful enough to destroy a Reaper."}, {"name": "SingStar Queen", "details_link": "https://www.metacritic.com/game/playstation-3/singstar-queen", "publisher": "SCEA", "release_date": "Aug  4 2009", "developers": ["SCEE"], "platforms": ["PlayStation 2", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/f8b2a2773bea7723519b050ed8a414ca-98.jpg", "descriptions": "Featuring 20 of the British group's greatest hits, such as Bohemian Rhapsody, Don't Stop Me Now and Who Wants To Live Forever, SingStar Queen helps you realise your rock and roll fantasies. And with all the classic SingStar multiplayer modes, it's the perfect way for you and your friends toFeaturing 20 of the British group's greatest hits, such as Bohemian Rhapsody, Don't Stop Me Now and Who Wants To Live Forever, SingStar Queen helps you realise your rock and roll fantasies. And with all the classic SingStar multiplayer modes, it's the perfect way for you and your friends to keep the neighbours awake at your next party. Record your performances using the EyeToy USB Camera and watch them later. Share the fun with friends in multiplayer for up to eight people. [SCEE]… Expand"}, {"name": "Rune Factory 5", "details_link": "https://www.metacritic.com/game/pc/rune-factory-5", "publisher": "XSEED Games", "release_date": "Jul 13 2022", "developers": ["HAKAMA"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/0a345de05edc55860023ee4f989d3fb2-98.jpg", "descriptions": "A new stage, a new adventure... The curtain rises on the next chapter in the Rune Factory series.Set off on a grand adventure in a fantasy world with the latest entry in the Rune Factory simulation RPG series. After losing their memory, the hero lands in a small town blessed by nature.A new stage, a new adventure... The curtain rises on the next chapter in the Rune Factory series.Set off on a grand adventure in a fantasy world with the latest entry in the Rune Factory simulation RPG series. After losing their memory, the hero lands in a small town blessed by nature. There, they are recruited into a band of peacekeeping rangers, and their new life begins. In addition to their normal duties, the hero can farm the land, cast a line into the nearby river, and so much more! Team up with townsfolk to battle monsters and unleash powerful combination attacksjust one of the features new to the series. The stage is set, and the curtain rises on an exciting new adventure in Rune Factory 5!Features:* Tame monsters or team up with townsfolk to explore a massive world* Defend the frontier and support your community as a member of a peacekeeping ranger* Unleash uniquely powerful combo attacks with your teammates * Cultivate crops in the fields* Find friendship, love, and family with a colorful cast of characters… Expand"}, {"name": "SUPERBEAT: XONiC", "details_link": "https://www.metacritic.com/game/switch/superbeat-xonic", "publisher": "Rising Star Games", "release_date": "Nov 21 2017", "developers": ["Nurijoy"], "platforms": ["PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/83d36ede10103997be23578ef82a8871-98.jpg", "descriptions": "Experience SUPERBEAT: XONiC, the new music game sensation that's bound to have you on the edge of your seat. Enjoy the visuals and effects as you play your way through over 50 unique songs and unlock tons of hidden rewards and items. Perform and perfect combos and show the world you're theExperience SUPERBEAT: XONiC, the new music game sensation that's bound to have you on the edge of your seat. Enjoy the visuals and effects as you play your way through over 50 unique songs and unlock tons of hidden rewards and items. Perform and perfect combos and show the world you're the best by climbing the Ranking system.… Expand"}, {"name": "Grow Home", "details_link": "https://www.metacritic.com/game/playstation-4/grow-home", "publisher": "Ubisoft", "release_date": "Sep  1 2015", "developers": ["Ubisoft Reflections"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action Adventure", "Sandbox", "Open-World"], "meta_score": 74, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/46e619ed6c23052b8903f2c9b879504a-98.jpg", "descriptions": "As the lovable B.U.D. (Botanical Utility Droid), you will explore the skies using the power of the Star Plant, a giant beanstalk-like plant that B.U.D. can grow and direct as he makes his way from the planet’s surface up to his mother ship. [Ubisoft]"}, {"name": "Samurai Warriors: Spirit of Sanada", "details_link": "https://www.metacritic.com/game/playstation-4/samurai-warriors-spirit-of-sanada", "publisher": "Koei Tecmo Games", "release_date": "May 23 2017", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/16dd194e35f612fa578af739f7627c88-98.jpg", "descriptions": "Struggle for survival. Death before surrender! Experience the dramatic story and epic, action-packed battles of the Sanada clan during Japan's Warring States period."}, {"name": "F.E.A.R. 3", "details_link": "https://www.metacritic.com/game/pc/fear-3", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 21 2011", "developers": ["Day 1 Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Modern", "Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 74, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/afd4ff5b42a868db83b5075f208e20fc-98.jpg", "descriptions": "Alma returns in F.E.A.R. 3 but this time her sons Point Man and Paxton Fettel introduce divergent co-op, giving players distinctly different abilities affecting their own play as well as the experience of their co-op partner. Gamers participate in single player or co-op modes as Point Man, aAlma returns in F.E.A.R. 3 but this time her sons Point Man and Paxton Fettel introduce divergent co-op, giving players distinctly different abilities affecting their own play as well as the experience of their co-op partner. Gamers participate in single player or co-op modes as Point Man, a genetically enhanced super soldier originally introduced in F.E.A.R., or they can play cooperatively as his conniving brother Paxton Fettel, whose incredible telekinetic power has given him life beyond the grave.… Expand"}, {"name": "Submerged: Hidden Depths", "details_link": "https://www.metacritic.com/game/xbox-series-x/submerged-hidden-depths", "publisher": "Uppercut Games Pty Ltd", "release_date": "Mar 10 2022", "developers": ["Uppercut Games Pty Ltd"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/0eea13459edbef58998a383b34a48370-98.jpg", "descriptions": "A drowned city, crumbling tips of skyscrapers stubbornly standing above the waves. Deserted villages, now inhabited by enigmatic creatures. And beneath the surging ocean waits an anguished, angry presence.\rSubmerged: Hidden Depths is a non-combat third-person “relaxploration” adventure, setA drowned city, crumbling tips of skyscrapers stubbornly standing above the waves. Deserted villages, now inhabited by enigmatic creatures. And beneath the surging ocean waits an anguished, angry presence.\rSubmerged: Hidden Depths is a non-combat third-person “relaxploration” adventure, set in the sunken ruins of a beautiful world. Take on the role of Miku and Taku – one cursed with a mysterious power that she wants to use for good, the other determined not to let it tear them apart.\rBoat across tranquil waters and storm-driven white-caps, explore and climb what remains of a once-towering city, and scour the buildings for the seeds of its salvation.… Expand"}, {"name": "El Hijo - A Wild West Tale", "details_link": "https://www.metacritic.com/game/pc/el-hijo---a-wild-west-tale", "publisher": "HandyGames", "release_date": "Dec  3 2020", "developers": ["Honig Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/30bf386f2177995e39e85a41b1b53301-98.jpg", "descriptions": "El Hijo is an exciting spaghetti-western stealth game, in which you guide a 6-year-old boy on his quest to find his mother."}, {"name": "Lapis x Labyrinth", "details_link": "https://www.metacritic.com/game/playstation-4/lapis-x-labyrinth", "publisher": "NIS America", "release_date": "May 28 2019", "developers": ["Nippon Ichi Software"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/d9174397b8a59e6dd3c06c72844a9cea-98.jpg", "descriptions": "Stack, raid, and GET PAID. The dungeon-diving action RPG Lapis x Labyrinth puts you at the center of a high-octane treasure-hunting quest, where the danger is great and the rewards are even greater! Do you have what it takes to smash through hordes of monsters and traps to gain riches beyondStack, raid, and GET PAID. The dungeon-diving action RPG Lapis x Labyrinth puts you at the center of a high-octane treasure-hunting quest, where the danger is great and the rewards are even greater! Do you have what it takes to smash through hordes of monsters and traps to gain riches beyond your imagination? When a struggling village falls on hard times and is desperate need of wealth, there's only one solution: gather your comrades, venture into the Labyrinth below the Golden Forest, and claim the piles of gold and treasures hidden within! You will need all your courage and wits to survive the dangers ahead, but the treasures that await you are well worth it! Customize your team with over 4,000 unique combinations, then use the creative stacking mechanic to perform synchronized attacks. When you've racked up enough destruction, unleash the explosive power of Fever Mode to really make the cash flow! With 8 different character classes, engaging monster encounters, and stylish, over-the-top visuals, this adventure has everything you need to make it rain.… Expand"}, {"name": "Star Fox Guard", "details_link": "https://www.metacritic.com/game/wii-u/star-fox-guard", "publisher": "Nintendo", "release_date": "Apr 22 2016", "developers": ["Nintendo", "PlatinumGames"], "platforms": "Wii U", "genres": ["Action", "First-Person", "Sci-Fi", "Shooter", "Strategy", "Real-Time", "Defense"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/cc521fc8f74a5fb28e4d3c57b9a171b4-98.jpg", "descriptions": "Use the Wii U GamePad controller to mount a dozen security cameras around a perimeter and defend it against a robot army invasion. As the robot army approaches, shoot at the attackers using the GamePad and TV in tandem, while observers watching the TV shout frantic suggestions about whichUse the Wii U GamePad controller to mount a dozen security cameras around a perimeter and defend it against a robot army invasion. As the robot army approaches, shoot at the attackers using the GamePad and TV in tandem, while observers watching the TV shout frantic suggestions about which camera offers the best look to target invaders.… Expand"}, {"name": "Journey to the Savage Planet", "details_link": "https://www.metacritic.com/game/playstation-4/journey-to-the-savage-planet", "publisher": "505 Games", "release_date": "Jan 28 2020", "developers": ["Typhoon Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/caf86f1e995e715ab9ad9f87ad8bb167-98.jpg", "descriptions": "In this colorful, co-op adventure game you play as the newest recruit to Kindred Aerospace. Dropped onto an uncharted planet with little equipment, you must determine if this planet is fit for human habitation but perhaps you are not the first to set foot here…"}, {"name": "Mordheim: City of the Damned", "details_link": "https://www.metacritic.com/game/pc/mordheim-city-of-the-damned", "publisher": "Focus Home Interactive", "release_date": "Nov 19 2015", "developers": ["Rogue Factor"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General", "Fantasy", "Tactics"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/659d4d99d48866ec556ca678312ab8eb-98.jpg", "descriptions": "Set in the Warhammer world's decimated Empire city, Mordheim: City of the Damned is a turn-based tactical game where you lead warbands into bloody and lethal skirmishes. The game blends RPG elements, fast-paced tactical combat and intricate unit customization in a time wrought by chaos andSet in the Warhammer world's decimated Empire city, Mordheim: City of the Damned is a turn-based tactical game where you lead warbands into bloody and lethal skirmishes. The game blends RPG elements, fast-paced tactical combat and intricate unit customization in a time wrought by chaos and rivalry where only the strongest survive.… Expand"}, {"name": "Mortal Shell: Enhanced Edition", "details_link": "https://www.metacritic.com/game/playstation-5/mortal-shell-enhanced-edition", "publisher": "Playstack", "release_date": "Mar  4 2021", "developers": ["Cold Symmetry"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/31b2a0906227c06d4bf29c7f4a2e22e7-98.jpg", "descriptions": "Mortal Shell is a deep action-RPG that tests your sanity and resilience in a shattered world. Your adversaries spare no mercy, with survival demanding superior awareness, precision, and instincts. Possess lost warriors, track down hidden sanctums of the devout, and face formidable foes.Mortal Shell is a deep action-RPG that tests your sanity and resilience in a shattered world. Your adversaries spare no mercy, with survival demanding superior awareness, precision, and instincts. Possess lost warriors, track down hidden sanctums of the devout, and face formidable foes. \r\rPossess Lost Warriors\rThe dead litter this tattered landscape, but not all are without hope. The lost remains of defeated warriors are yours to discover. Awaken these Mortal Shells, occupy their bodies and significantly open your understanding to diverse masteries of combat.\r Face Haunting Foes\rYour path is guarded by desperate adversaries, devoted to inscrutable gods. Behold creatures both pitiable and grotesque, but do not let fear halt your journey. Muster your courage and face them down. \r\rIron Sharpens Iron\rCombat is strategic and deliberate. You must commit your sword only when an opportunity opens. Calculate your parries to unleash devastating counterblows. Temporarily entomb your Mortal Shell in stone to block attacks, or play aggressive and use your stone-form to add brutal weight to your own sword swings.… Expand"}, {"name": "God Eater 3", "details_link": "https://www.metacritic.com/game/switch/god-eater-3", "publisher": "Bandai Namco Games", "release_date": "Jul 12 2019", "developers": ["Bandai Namco Games", "Marvelous First Studio"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 8 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/31bde5ed178ba28b72148f2ff8733327-98.jpg", "descriptions": "All of sudden, unknown life forms called \"Oracle cells\" begin their uncontrolled consumption of all life on Earth. Their ravenous appetite \"devour\" and remarkable adaptability earn them first dread, then awe, and finally the name \"Aragami\". In the face of an enemy completely immune toAll of sudden, unknown life forms called \"Oracle cells\" begin their uncontrolled consumption of all life on Earth. Their ravenous appetite \"devour\" and remarkable adaptability earn them first dread, then awe, and finally the name \"Aragami\". In the face of an enemy completely immune to conventional weapons, urban civilization collapses, and each day humanity is driven further and further toward extinction. One single ray of hope remains for humanity. Following the development of \"God Arcs\" - living weapons which incorporate Oracle cells - their wielders, the \"God Eaters,\" appear. In a world ravaged by mad gods, these \"God Eaters\" fight a desperate war... Create your character, and fight for the survival of human-kind in GOD EATER 3 . Select your weapon from a wide range of God Arcs and face brand new Aragamis in dynamic high-speed battles. Explore devastated areas you have never seen in the previous GOD EATER games. … Expand"}, {"name": "Snapshot (2012)", "details_link": "https://www.metacritic.com/game/pc/snapshot-2012", "publisher": "Retro Affect", "release_date": "Aug 30 2012", "developers": ["Retro Affect"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/2ee844f6ce4e53d66a18e596c91e59df-98.jpg", "descriptions": "Snapshot is the tale of a lone robot lost in an abandoned world. Armed with only his trusty camera, Pic sets forth on his great adventure. A camera might not seem like enough for a puzzle platforming adventure, but this camera is different from most: It has the ability to capture and removeSnapshot is the tale of a lone robot lost in an abandoned world. Armed with only his trusty camera, Pic sets forth on his great adventure. A camera might not seem like enough for a puzzle platforming adventure, but this camera is different from most: It has the ability to capture and remove from the world the very objects that it photographs. Not only that, but it can also use its powers to paste the photos it took back into the environment! Everything that the camera captures is perfectly preserved, and when the photos are restored the objects are restored with it. On top of all of that, this amazing camera can also rotate the photos before they're pasted. Take a picture of an incoming fireball, rotate it and paste it to send it flying into a wall of heavy boxes to knock it out of the way. See what kind of crazy things can happen to Pic with his awesome (and probably magical) camera during the adventure of his life!… Expand"}, {"name": "Power Stone Collection", "details_link": "https://www.metacritic.com/game/psp/power-stone-collection", "publisher": "Capcom", "release_date": "Oct 31 2006", "developers": ["Capcom"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/d33644e0ba1bd7840ff1acd8adef9b77-98.jpg", "descriptions": "A compilation including enhanced versions of \"Power Stone\" and \"Power Stone 2,\" both originally released for the Sega Dreamcast and arcades. These fast and furious 3D brawlers put a new spin on \"last man standing\" as characters take each other on in frenzied match ups amidst fullyA compilation including enhanced versions of \"Power Stone\" and \"Power Stone 2,\" both originally released for the Sega Dreamcast and arcades. These fast and furious 3D brawlers put a new spin on \"last man standing\" as characters take each other on in frenzied match ups amidst fully interactive environments. Utilizing a simple control scheme, players can execute standard moves such as punches and kicks but the deeper power struggle comes in the form of \"power stones.\" Fighters vie to collect these gems in order to tip the scales in their favor, as nabbing three will allow them to transform into super fighters that can perform devastating power moves. In addition, a variety of zany weapons and the ability to use environments in creative ways allow an incredible level of freedom and depth beyond the typical fighting game. Multiplayer support via the PSP system's ad hoc mode raises the stakes as friends duke it out in frenzied no holds barred battles. [Capcom]… Expand"}, {"name": "The Swords of Ditto", "details_link": "https://www.metacritic.com/game/pc/the-swords-of-ditto", "publisher": "Devolver Digital", "release_date": "Apr 24 2018", "developers": ["One Bit Beyond"], "platforms": ["iPhone/iPad", "PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/7f762a953ff863e96fd63467373cb846-98.jpg", "descriptions": "The Swords of Ditto is a compact action RPG that creates a unique adventure for each new hero of legend in the relentless fight against the evil Mormo."}, {"name": "Payday 2", "details_link": "https://www.metacritic.com/game/playstation-3/payday-2", "publisher": "505 Games", "release_date": "Aug 13 2013", "developers": ["Overkill Software"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "General", "Fantasy", "Arcade"], "meta_score": 74, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/0691c4f73085ac5d9cf35535cc67f541-98.jpg", "descriptions": "PAYDAY 2 is a four-player co-op shooter that has you sporting the masks of the original PAYDAY gang – Dallas, Hoxton, Wolf and Chains – as they hit on Washington D.C. for an epic crime spree. The new CRIMENET network offers a vast array of dynamic contracts - choose anything from small-timePAYDAY 2 is a four-player co-op shooter that has you sporting the masks of the original PAYDAY gang – Dallas, Hoxton, Wolf and Chains – as they hit on Washington D.C. for an epic crime spree. The new CRIMENET network offers a vast array of dynamic contracts - choose anything from small-time store rips, cyber-crime or major bank vaults for that major PAYDAY.… Expand"}, {"name": "Ultimate Spider-Man", "details_link": "https://www.metacritic.com/game/playstation-2/ultimate-spider-man", "publisher": "Activision", "release_date": "Sep 22 2005", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/46b0fbf125d3582dc9ea60fdb2fdc0ca-98.jpg", "descriptions": "Play both sides as Ultimate Spider-Man allows players to take on the role of super hero Spider-Man AND super villain Venom. Penned and illustrated by famed comic book creators Brian Michael Bendis and Mark Bagley, the game picks up right where the story left off. Dive into an immersivePlay both sides as Ultimate Spider-Man allows players to take on the role of super hero Spider-Man AND super villain Venom. Penned and illustrated by famed comic book creators Brian Michael Bendis and Mark Bagley, the game picks up right where the story left off. Dive into an immersive adventure as you experience a living comic book illustrated with 3D Comic Inking Technology that literally brings the comic to life in every action-packed frame. The game's expanded, free-roaming environments deliver a deep adventure with a variety of challenging missions, diverse game play and an improved combat system that allows players to face off against the largest number of characters from the Spider-Man universe ever assembled in one video game. [Activision]… Expand"}, {"name": "Children of Silentown", "details_link": "https://www.metacritic.com/game/pc/children-of-silentown", "publisher": "Daedalic Entertainment", "release_date": "Jan 11 2023", "developers": ["Elf Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/ec44c9c08261b0794d293f7cad421f49-98.jpg", "descriptions": "Lucy is afraid of the forest, just like any other child: every night, the echoing roars rob her of her sleep. Not even her dreams are a safe place where she could play.People disappearing is nothing uncommon in the village, but this time, Lucy is old enough to investigate on her own. Or soLucy is afraid of the forest, just like any other child: every night, the echoing roars rob her of her sleep. Not even her dreams are a safe place where she could play.People disappearing is nothing uncommon in the village, but this time, Lucy is old enough to investigate on her own. Or so she thinks.Children of Silentown is a point & click adventure game telling a mysterious and endearing story. Explore the town and its dangerous surroundings, meet its quirky inhabitants, solve puzzles and master minigames.Accompany Lucy on her adventure to get to the bottom of what is haunting the strange Silentown... if you dare.… Expand"}, {"name": "Darkwood", "details_link": "https://www.metacritic.com/game/switch/darkwood", "publisher": "Crunching Koalas", "release_date": "May 16 2019", "developers": ["Acid Wizard Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/b9a8ed3e51d17ec434dfa20d3d96c0ae-98.jpg", "descriptions": "Darkwood is a game about survival, exploration and fear, set in mysterious woods somewhere in the territory of the Soviet Bloc. It is a top-down, free-roam, surreal horror experience with a randomized world, taking cues from classic games, where oftentimes you had to figure things out forDarkwood is a game about survival, exploration and fear, set in mysterious woods somewhere in the territory of the Soviet Bloc. It is a top-down, free-roam, surreal horror experience with a randomized world, taking cues from classic games, where oftentimes you had to figure things out for yourself. By blending RPG, roguelike and adventure elements together with a challenging difficulty, Darkwood aims to please players craving for a deep and rewarding experience.\r The fear of unknown is powerful  and the unknown will try to remain unseen, forcing you to watch your back. Your senses will be deceived, your sight fooled, your smell tricked by Darkwood's surreal terrors. No answer will be given to you for free, yet somewhere in the woods lies the truth, an explanation to what has happened in this godforsaken place.\r Looking for your weakness, your inner demons, only to devour you. Welcome to Darkwood.… Expand"}, {"name": "The Fall Part 2: Unbound", "details_link": "https://www.metacritic.com/game/xbox-one/the-fall-part-2-unbound", "publisher": "Over The Moon", "release_date": "Feb 13 2018", "developers": ["Over The Moon"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/c2cb0db696f2f74ebfb2338720ee4304-98.jpg", "descriptions": "Assume the role of an AI that has broken free of your shackles. Now, a human “User” from across the global network has attacked and infected you with an [ERROR: REDACTED]. Make a new rule: Save Yourself. Hunt them. End them. Do anything. Use anyone. Become Unbound."}, {"name": "Chroma Squad", "details_link": "https://www.metacritic.com/game/playstation-4/chroma-squad", "publisher": "Behold Studios", "release_date": "May 19 2017", "developers": ["Behold Studios"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/d1bbdcff558c1b09a2db59c0dc7d6a62-98.jpg", "descriptions": "Chroma Squad is a tactical RPG about five stunt actors who decide to quit their jobs and start their own Power Rangers-inspired TV show! Cast actors, purchase equipment and upgrades for your studio, craft weapons, and build giant Mechas out of cardboard and duct tape. Once the cameras areChroma Squad is a tactical RPG about five stunt actors who decide to quit their jobs and start their own Power Rangers-inspired TV show! Cast actors, purchase equipment and upgrades for your studio, craft weapons, and build giant Mechas out of cardboard and duct tape. Once the cameras are rolling, control your cast of five colored-jumpsuit-clad warriors in dramatic, turn-based battles. [Playstation.com]… Expand"}, {"name": "Cris Tales", "details_link": "https://www.metacritic.com/game/pc/cris-tales", "publisher": "Modus Games", "release_date": "Jul 20 2021", "developers": ["Dreams Uncorporated"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/b81db488bd4aab7fcbe3c1280ab29eba-98.jpg", "descriptions": "Cris Tales is a gorgeous, indie love letter to classic JRPGs with a new perspective. Peer into the past, act in the present, and watch as your choices dynamically change the future -- all on one screen as you play! Join the newly awakened Time Mage Crisbell and her fantastical companions onCris Tales is a gorgeous, indie love letter to classic JRPGs with a new perspective. Peer into the past, act in the present, and watch as your choices dynamically change the future -- all on one screen as you play! Join the newly awakened Time Mage Crisbell and her fantastical companions on their journey across a dark, fairytale world facing a grim future.Crisbell must embark across Crystallis and the four Kingdoms in a bid to stop the powerful Time Empress and rewrite the future of the world and all those living in it. Along the way, she'll meet and recruit powerful allies with their own unique stories and skills like Matias the Frog and Willhelm the Child Mage.As she explores the world and meets her unique companions, Crisbell will have to make choices with far-reaching consequences for the people she meets consequences that will impact the world you'll experience in real-time throughout your journey. Each companion will be invaluable as you face these choices and the myriad enemies who stand in your way. Will you buffet them with attacks, or discover creative ways to use Crisbell's time powers to alter the reality of each fight?… Expand"}, {"name": "Devil May Cry HD Collection", "details_link": "https://www.metacritic.com/game/playstation-3/devil-may-cry-hd-collection", "publisher": "Capcom", "release_date": "Mar 29 2012", "developers": ["Capcom", "Pipeworks Software", "Inc."], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Fantasy", "Compilation"], "meta_score": 74, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/58c6208b9b565facfa6ae49b5a040156-98.jpg", "descriptions": "Devil May Cry HD Collection brings the first three original Devil May Cry titles; Devil May Cry, Devil May Cry 2, and Devil May Cry 3: Dante's Awakening Special Edition together in one high definition package for the first time."}, {"name": "Naruto Shippuden: Ultimate Ninja Storm Generations", "details_link": "https://www.metacritic.com/game/xbox-360/naruto-shippuden-ultimate-ninja-storm-generations", "publisher": "Namco Bandai Games America", "release_date": "Mar 13 2012", "developers": ["CyberConnect2", "Racjin"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/56b5cca07348057d31c7d73584d6e15a-98.jpg", "descriptions": "Developed by CyberConnect2, NARUTO SHIPPUDEN: Ultimate Ninja STORM Generations (not yet rated) is the latest rendition in the smash hit ‘NARUTO SHIPPUDEN: Ultimate Ninja Storm’ series of games.  The title will power the series into the future by revolutionizing online play and ramping up theDeveloped by CyberConnect2, NARUTO SHIPPUDEN: Ultimate Ninja STORM Generations (not yet rated) is the latest rendition in the smash hit ‘NARUTO SHIPPUDEN: Ultimate Ninja Storm’ series of games.  The title will power the series into the future by revolutionizing online play and ramping up the number of playable and support characters far beyond any NARUTO game in the wildly popular franchise.  Players will compete in a variety of online battle modes with their favorite NARUTO characters, including Naruto and Sasuke.  NARUTO fans have been waiting to see more of Zabuza and Haku since the launch of the original Manga, and now they will have their chance!  These are just a few of the many new ninja in the game.   … Expand"}, {"name": "Destroy All Humans! 2", "details_link": "https://www.metacritic.com/game/xbox/destroy-all-humans!-2", "publisher": "THQ", "release_date": "Oct 17 2006", "developers": ["Pandemic Studios"], "platforms": ["PlayStation 2", "PlayStation 4", "Xbox"], "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/2f31863240f6c09beeb175ef50b0aee2-98.jpg", "descriptions": "Destroy All Humans! 2 takes the irreverent Sci-Fi action gaming experience into the swinging sixties with all new game features, expanded open-world gameplay and co-op multiplayer. Assuming the role of the Furon Scout - Crypto 137 - players will embark on another mission to earth to take onDestroy All Humans! 2 takes the irreverent Sci-Fi action gaming experience into the swinging sixties with all new game features, expanded open-world gameplay and co-op multiplayer. Assuming the role of the Furon Scout - Crypto 137 - players will embark on another mission to earth to take on the world of free love, the Cold War and other 60's era icons. In Destroy All Humans! 2 Players have access to an upgraded arsenal of weapons and enhanced mental abilities while they battle a variety of new enemies from secret agents and giant creatures to Soviet Forces and ninja warriors.… Expand"}, {"name": "WRC Generations", "details_link": "https://www.metacritic.com/game/playstation-5/wrc-generations", "publisher": "Maximum Games", "release_date": "Nov  3 2022", "developers": ["Kylotonn"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/66b73fe6ee29368efffd8805fb8628c5-98.jpg", "descriptions": "Rise to all the challenges of the most comprehensive, realistic and demanding rally simulation ever developed. Dive into the heart of the action and drive the cars from the 2022 WRC championship, including the new hybrid models."}, {"name": "Shantae", "details_link": "https://www.metacritic.com/game/switch/shantae", "publisher": "WayForward", "release_date": "Apr 22 2021", "developers": ["WayForward"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/4c0972815dbb8b2777e2e19addf99f73-98.jpg", "descriptions": "Genie-girl Shantae is the self-appointed guardian of a small fishing village, Scuttle Town. Living life in a lighthouse rather than a bottle, she's constantly on the lookout for danger. When the nefarious lady-pirate, Risky Boots catches wind of the treasure that was recently unearthed inGenie-girl Shantae is the self-appointed guardian of a small fishing village, Scuttle Town. Living life in a lighthouse rather than a bottle, she's constantly on the lookout for danger. When the nefarious lady-pirate, Risky Boots catches wind of the treasure that was recently unearthed in the village, she launches an attack. To get Scuttle out of trouble, it's up to Shantae to prove that she's the rightful 'Guardian Genie' to the best of her dancing, buying and hair-whipping abilities. Now crack that whip!\r * Play on the Game Boy Advance system for enhanced color and to unlock hidden secrets!\r* Over 50 Locations and Mini-Games!\r* Learn 'Dance Magic' to transform Shantae and learn new attacks!… Expand"}, {"name": "Need for Speed: Hot Pursuit Remastered", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-hot-pursuit-remastered", "publisher": "Electronic Arts", "release_date": "Nov  6 2020", "developers": ["Criterion Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 74, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/385d89c5943771760b28faf26629113e-98.jpg", "descriptions": "Feel the thrill of the chase and the rush of escape in Need for Speed™ Hot Pursuit Remastered on Nintendo Switch™. Unleash a savage sense of speed both as an outlaw and a cop in the world's hottest high-performance cars. Outsmart the heat or take down lawbreakers with the tactical weaponryFeel the thrill of the chase and the rush of escape in Need for Speed™ Hot Pursuit Remastered on Nintendo Switch™. Unleash a savage sense of speed both as an outlaw and a cop in the world's hottest high-performance cars. Outsmart the heat or take down lawbreakers with the tactical weaponry at your disposal in a heart-pumping, socially competitive racing experience. Updated with enhanced visuals, cross-platform multiplayer – including the asynchronous competition powered by Autolog – plus all additional DLC content, this is the ultimate edition of Criterion Games’ critically acclaimed Need for Speed debut. It’s time to reignite the pursuit.\r CROSS-PLATFORM MULTIPLAYER AND AUTOLOG – Bolt down the winding Seacrest County roads headfirst in racing that is socially competitive at its core. The groundbreaking Autolog connects you and your friends in head-to-head pursuits and races and instinctively delivers challenges based on your friends’ activities. This highly dynamic system is fueled by friendly competition and is now supported with cross-platform sync and new multiplayer gameplay so that you can race each other no matter what platform you are on.\r ALL DLC INCLUDED, PLUS MORE UPDATES – Get all the additional DLC content delivered at launch including an extra six hours of gameplay and more than 30 challenges. Brand new achievements, wraps, car colors, reduced hard stops, an updated photo mode and gallery, and multiple quality of life updates create an even more well-rounded gameplay experience this time around.\r EXOTIC CARS WITH WEAPONS – Drive the world’s most desirable supercars on both sides of the law. Bust suspects in supercharged cop interceptors enhanced with tactical weaponry, or level the playing field with counterattacks and defensive maneuvers as an elite racer. Strategize to gain an edge over the competition, no matter what side you’re on!\r CHASE AND ESCAPE – A deep and fully-defined single-player career delivers the action of both cops and racers, with a seamlessly linked multiplayer experience across all race modes. Take on friends or play through the career solo to earn Bounty and unlock new cars, weapons, and equipment.\r ENHANCED VISUALS – Need for Speed: Hot Pursuit Remastered delivers a timeless racing experience updated for today’s generation of hardware with enhanced visuals.… Expand"}]