[{"name": "Alexander", "details_link": "https://www.metacritic.com/game/pc/alexander", "publisher": "Ubisoft", "release_date": "Nov 23 2004", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 56, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/dc8967a8e432ad9cf54a1f1eee0ebd99-98.jpg", "descriptions": "The RTS gameplay in Alexander is challenging enough to entice the hard core gamer, but also provides a gaming experience accessible to a larger audience of casual gamers. Players experience the epic scope of Alexander's conquests via historic campaigns, each with unique characteristics andThe RTS gameplay in Alexander is challenging enough to entice the hard core gamer, but also provides a gaming experience accessible to a larger audience of casual gamers. Players experience the epic scope of Alexander's conquests via historic campaigns, each with unique characteristics and resource management challenges, and featuring heroes from Alexander the Great's era. Players fight real-time battles using formations, combat and authentic military tactics, while commanding vast armies in foreign lands. Blood will be spilled on the battlefield and honor will be put to the test, as a combination of courage and strategy will determine the victor. [Ubisoft]… Expand"}, {"name": "Miami Law", "details_link": "https://www.metacritic.com/game/ds/miami-law", "publisher": "Hudson Entertainment", "release_date": "Jun  9 2009", "developers": ["Hudson Entertainment"], "platforms": "DS", "genres": ["Adventure", "General", "General"], "meta_score": 56, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/80bb5edaa1082b8da4722bd7ce1fc4f2-98.jpg", "descriptions": "(Also known as \"Miami Crisis\")  Living the life of a detective on the beat is everyone's dream. From using your sharp analytical skills to solve a mystery, to putting your life on the line in an intense shoot-out, or shaking down the bad guy; a detective's life truly seems like life on the(Also known as \"Miami Crisis\")  Living the life of a detective on the beat is everyone's dream. From using your sharp analytical skills to solve a mystery, to putting your life on the line in an intense shoot-out, or shaking down the bad guy; a detective's life truly seems like life on the edge. Now, Hudson is set to give you a taste of that life with Miami Law, an all new adventure on Nintendo DS that has you saving the world with your fingertips! Miami Law is an action-adventure game packed with all of the ingredients of a prime-time TV show: an intricate storyline with a shadowy terrorist conspiracy, furious shoot-outs in abandoned warehouses, challenging crime-scene detective work and more.  Players will have many opportunities to choose their path and change the story - either as the intense Law Martin from the Miami PD or the brainy Sara Starling from the FBI. Players are presented with different challenges depending on which character they pick - playing as Sara features a puzzle-based element, whereas playing with Law thrusts the player into the action, often into car chases or shoot-outs where taking out the bad guys is the only way to get results.  Unlockable extras, including Texas Hold ‘Em Poker and Sudoku, are included to take the pressure off players when the tension gets thick. [Hudson Entertainment]… Expand"}, {"name": "RollerCoaster Tycoon Adventures", "details_link": "https://www.metacritic.com/game/switch/rollercoaster-tycoon-adventures", "publisher": "Nvizzio Creations", "release_date": "Dec 13 2018", "developers": ["Nvizzio Creations"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 56, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/153fb10a2cdf2bed965bdf38c4068b5a-98.jpg", "descriptions": "RollerCoaster Tycoon Adventures brings the legendary RollerCoaster Tycoon series into the next generation -- combining classic RCT gameplay with the modernized user experience of the critically acclaimed mobile title RollerCoaster Tycoon Touch, all customized for the unique features of theRollerCoaster Tycoon Adventures brings the legendary RollerCoaster Tycoon series into the next generation -- combining classic RCT gameplay with the modernized user experience of the critically acclaimed mobile title RollerCoaster Tycoon Touch, all customized for the unique features of the Nintendo Switch. Build your entertainment empire in three distinct game modes -- classic Campaign, tricky Scenarios, and the open Sandbox. Over 200 wonderfully wacky rides, restaurants, shops and decorations ensure parks burst with action, and the intuitive coaster builder lets you create wild, death-defying coasters with ease. Play it on your TV or on-the-go -- it's never been so easy to become a RollerCoaster Tycoon!… Expand"}, {"name": "Tom Clancy's Ghost Recon: Breakpoint", "details_link": "https://www.metacritic.com/game/playstation-4/tom-clancys-ghost-recon-breakpoint", "publisher": "Ubisoft", "release_date": "Oct  1 2019", "developers": ["Ubisoft Paris"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 56, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/6/5a640420ea145494681056957de49d83-98.jpg", "descriptions": "Become an Elite Spec Ops Soldier. Explore the mysterious world, diverse abilities, new factions, and many ways to play Ghost Recon Breakpoint. Welcome to Auroa. Somewhere in the South Pacific lies the remote Auroa Archipelago, a vast land of diverse biomes that range from lush rainforests toBecome an Elite Spec Ops Soldier. Explore the mysterious world, diverse abilities, new factions, and many ways to play Ghost Recon Breakpoint. Welcome to Auroa. Somewhere in the South Pacific lies the remote Auroa Archipelago, a vast land of diverse biomes that range from lush rainforests to snowy peaks. Now, it’s home to Skell Technology, an enigmatic technology giant. Initially interested in a remote testing site for its autonomous drones, the Silicon Valley company eventually turned Auroa into its “World 2.0,” a high-tech, high-security utopia of sustainable eco-cities and robotics research. Explore a diverse and mysterious open world ranging from barren deserts and dramatic fjords to futurist cities and arctic peaks. Featuring 11 unique biomes and home to Skell Technologies this remote Archipelago will challenge the Ghosts like never before. Use the environment to your advantage as you disappear into a jungle canopy to evade your foes or jump into a vehicle and charge into battle by air, land and sea. A seamless co-op experience means your squadmates can jump in and out at any time. Face your deadliest enemy yet, The Wolves, former Ghosts who have betrayed their country. Led by the charismatic Colonel Cole D. Walker they have taken control of Auroa for an unknown purpose. Now in control of Auroa’s powerful drone technology The Wolves and their allies will hunt you mercilessly across Auroa. Experience life as a Ghost, an elite US Special Operations soldier, as you fight back from behind enemy lines on the toughest mission of your career. [Ubisoft]… Expand"}, {"name": "Bob Help Them", "details_link": "https://www.metacritic.com/game/switch/bob-help-them", "publisher": "No Gravity Games", "release_date": "Mar 11 2021", "developers": ["No Gravity Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "General", "Virtual", "Virtual Life"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/2d5477d3ba349774a81fb629171729f1-98.jpg", "descriptions": "A highly relaxing timer-based game where you help NPCs with their daily chores.\r Bob Help Them is a timer-based game, where your goal is to help all NPC's, gathering resources, cooking food, fishing, and chopping wood before the timer ends. Enjoy the calming countryside while supportingA highly relaxing timer-based game where you help NPCs with their daily chores.\r Bob Help Them is a timer-based game, where your goal is to help all NPC's, gathering resources, cooking food, fishing, and chopping wood before the timer ends. Enjoy the calming countryside while supporting craftsmen with their daily chores.\r In Bob Help Them you can:\r▪ Become a completionist. Finish 35 levels, help 6 NPCs, and collect 105 stars!\r▪ Strategize. Learn who to help first, or how to sequence your activities to be as effective as possible.\r▪ Bake. Cook a lovely pie from the freshly harvested fruit.\r▪ Mine. Use a pickaxe to acquire stone, iron, or gold.\r▪ Smelt. A nearby Forger needs your support. Take iron nuggets and turn them into a shiny ingot.\r▪ Chop. Grab an axe and gather wood for Lumberjack.\r▪ Fish. Find the closest pond and cast a fishing rod.\r▪ Fry. Collect eggs from the chicken coop and fry them over the campfire so Chef can prepare a perfect meal.\r▪ Harvest. Does the Farmer need some apples? Pick them from a tree and lighten up his day.\r▪ Pet doggos. Yes, that’s one of your tasks, and it’s highly satisfying too.\r▪ Catch the “One more level syndrome”. The simple and solid game design will draw you in.\r▪ Chill. Operating under time pressure is usually associated with stress, in Bob Help Them it is quite the opposite. Cheerful music and being an important member of a small community sparks a relaxing atmosphere into the game… Expand"}, {"name": "Rafa Nadal Tennis", "details_link": "https://www.metacritic.com/game/ds/rafa-nadal-tennis", "publisher": "Codemasters", "release_date": "Jun 30 2007", "developers": ["Virtual Toys"], "platforms": ["iPhone/iPad", "DS"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/99749e1ad430f57990d6986dd8761a30-98.jpg", "descriptions": "Designed exclusively for the Nintendo DS, Rafa Nadal Tennis serves up an innovative, fun and fast-paced game of tennis with unprecedented shot control via the touch screen. Using the stylus as both a directional pointer and as a racquet, players can move their tennis pro around the court andDesigned exclusively for the Nintendo DS, Rafa Nadal Tennis serves up an innovative, fun and fast-paced game of tennis with unprecedented shot control via the touch screen. Using the stylus as both a directional pointer and as a racquet, players can move their tennis pro around the court and execute stunning serves, lobs, drop shots and power shots by sweeping the stylus across the touch screen. Rafa Nadal Tennis features a trio of single-player game modes, including a full Career Mode, Quick Match and more. Career Mode allows players to create their own personalised pro and travel the world to become the best player on the circuit. The game also features a full tutorial mode appropriately labelled Tennis School, to train players in perfect stylus movements for delivering precise, match winning shots. There is also an option to switch between the stylus and traditional control pad, and the tutorial will adapt the contents of the lessons accordingly. Rafa Nadal Tennis also includes a multiplayer component where up to four players can take the court for doubles or one-on-one single matches over wireless, even if the other players don’t have a copy of the game – the single-card wireless multiplayer mode enables up to four players to join a match from one copy of the game. An even more extensive multi-card multiplayer mode offers additional choice over court types and players. [Codemasters]… Expand"}, {"name": "Edna & Harvey: The Breakout", "details_link": "https://www.metacritic.com/game/pc/edna-harvey-the-breakout", "publisher": "Merscom LLC", "release_date": "Jan  3 2011", "developers": ["Daedalic Entertainment"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1 Player", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 56, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/351e299c572d845be38ae62e4a40dd09-98.jpg", "descriptions": "In Edna & Harvey: The Breakout, Edna wakes up in the padded cell of an insane asylum with no memory of her past or how she ended up there. Only one thing is for certain: She has been wrongfully imprisoned and will have to escape! After all, she feels entirely sane - and her speakingIn Edna & Harvey: The Breakout, Edna wakes up in the padded cell of an insane asylum with no memory of her past or how she ended up there. Only one thing is for certain: She has been wrongfully imprisoned and will have to escape! After all, she feels entirely sane - and her speaking stuffed toy bunny Harvey wholeheartedly agrees. Together they undertake a daring breakout attempt, meeting up with numerous oddball inmates, like the Man in the Bee's Costume or Siamese twins Hoti and Moti. But Dr. Marcel, the sinister head of the institute, will do everything in his power to stop Edna. What evil scheme is afoot? Slowly Edna begins to regain her memories of the past...… Expand"}, {"name": "ProStroke Golf - World Tour 2007", "details_link": "https://www.metacritic.com/game/pc/prostroke-golf---world-tour-2007", "publisher": "Oxygen Interactive", "release_date": "Aug 29 2006", "developers": ["Gusto Games"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/059efecc6befc927ae5516d4d9101375-98.jpg", "descriptions": "Step up to the tee and take on the pros in this year's only real-world golf simulation. Craft your technique, groove your swing, feel the pressure, compete and become a champion. ProStroke Golf is a faithful adaptation of the world's most challenging sport; including licensed players andStep up to the tee and take on the pros in this year's only real-world golf simulation. Craft your technique, groove your swing, feel the pressure, compete and become a champion. ProStroke Golf is a faithful adaptation of the world's most challenging sport; including licensed players and commentary from the international voices of golf. Put yourself to the ultimate test - challenge your skill, stamina and mental agility as you take on the best in the world. Control your nerves, feel the power of your drive, stare victory in the face and hear the crowd adore you. Licensed players: Sergio Garcia, Justin Rose, Colin Montgomerie, Ben Curtis, Zhang Lian Wei, and more...TV commentators : Sam Torrance, Ian Baker Finch and Alan Green. Courses include The Brabazon at The Belfry and Lake Nona. Innovative 'ProStroke' controls allow you to groove your own swing – just like the Pros do. Game Modes; From Match Play to Multiplayer through to training exercises and a comprehensive career mode, as well as short scorecard challenges. Caddy Feature offering Golf Pro Training exercises. Course and Tournament creator, allowing you to design and develop your own courses. [Oxygen Interactive]… Expand"}, {"name": "DreamWorks Shrek the Third", "details_link": "https://www.metacritic.com/game/xbox-360/dreamworks-shrek-the-third", "publisher": "Activision", "release_date": "May 15 2007", "developers": ["7 Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 56, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/7/29bdfa59fba5b82ad3faa95d1bad39cc-98.jpg", "descriptions": "Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies,Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies, and visit never before seen lands from the movie and beyond. [Activision]… Expand"}, {"name": "Leisure Suit Larry: Reloaded", "details_link": "https://www.metacritic.com/game/pc/leisure-suit-larry-reloaded", "publisher": "Replay Games", "release_date": "Jun 27 2013", "developers": ["Replay Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Third-Person", "Text", "Point-and-Click", "Modern", "Modern"], "meta_score": 56, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/56d7e530f531eededc43fd7ffdfccc35-98.jpg", "descriptions": "Larry’s original creator, the infamous game designer Al Lowe, has teamed up with Sierra Veteran Josh Mandel, to bring this game back to life – updated and expanded in a myriad of ways. All they kept from the original game is the plot."}, {"name": "WWE WrestleMania 21", "details_link": "https://www.metacritic.com/game/xbox/wwe-wrestlemania-21", "publisher": "THQ", "release_date": "Apr 20 2005", "developers": ["Studio Gigante"], "platforms": "Xbox", "num_players": "4  Online", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 56, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/93a5dc2948162148a2cbc3a8b78e2908-98.jpg", "descriptions": "Build your own wrestling legacy in WrestleMania XXI. The game provides a realistic WWE experience, complete with superstar voice-overs and commentary. Create your own wrestler, and watch him or her evolve as you earn new moves, costumes, and abilities. Strive for the WWE heavyweight title inBuild your own wrestling legacy in WrestleMania XXI. The game provides a realistic WWE experience, complete with superstar voice-overs and commentary. Create your own wrestler, and watch him or her evolve as you earn new moves, costumes, and abilities. Strive for the WWE heavyweight title in single-player mode, or build your own championship belt, and defend it online. Through Xbox Live, you can take on four of your friends in head-to-head competition, where you'll try to gain prestige with each victory earned.… Expand"}, {"name": "Contra: Rogue Corps", "details_link": "https://www.metacritic.com/game/xbox-one/contra-rogue-corps", "publisher": "Konami", "release_date": "Sep 24 2019", "developers": ["Konami", "Toylogic Inc.", "Toylogic"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 56, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/1/8a0766dc3df9183d8418884f606e1703-98.jpg", "descriptions": "Contra is back! Two years after the alien wars ended, the damned city erupts from the final battleground. From the midst of the chaos, a group of scoundrels emerge. They might not be typical heroes, but they're here to save the world… or get rich trying. Pre-order to get two t-shirt skinsContra is back! Two years after the alien wars ended, the damned city erupts from the final battleground. From the midst of the chaos, a group of scoundrels emerge. They might not be typical heroes, but they're here to save the world… or get rich trying. Pre-order to get two t-shirt skins for Hungry Beast, one featuring the iconic duo Bill and Lance, the other featuring the classic Contra logo.… Expand"}, {"name": "Dynasty Warriors 9", "details_link": "https://www.metacritic.com/game/xbox-one/dynasty-warriors-9", "publisher": "Koei Tecmo Games", "release_date": "Feb 13 2018", "developers": ["Omega Force", "Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World", "Action", "Beat-'Em-Up", "3D"], "meta_score": 56, "users_score": 9.5, "image": "https://static.metacritic.com/images/products/games/0/d5c81e0d6ff894de3f9f0412d679e5a9-98.jpg", "descriptions": "In Dynasty Warriors 9, players will explore China as it existed when feudal warlords vied for dominance over the land -- the waning days of the Han dynasty and emergence of the Three Kingdoms era. Setting out to complete various objectives, players will utilise an unprecedented world map toIn Dynasty Warriors 9, players will explore China as it existed when feudal warlords vied for dominance over the land -- the waning days of the Han dynasty and emergence of the Three Kingdoms era. Setting out to complete various objectives, players will utilise an unprecedented world map to navigate and traverse a variety of different landscapes ranging from vast plains to snow-covered peaks presented with dynamic day/night and weather cycles. Exploring these impressive environments is made more engaging through the ability to adapt to surroundings to gain an upper hand in battle, with players able to use equipment to circumvent obstacles or blend in to avoid conflict.… Expand"}, {"name": "Empyre: Lords of the Sea Gates", "details_link": "https://www.metacritic.com/game/pc/empyre-lords-of-the-sea-gates", "release_date": "Oct  4 2017", "developers": ["Coin Operated Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/79fc19e83cc114f981a217b2669a5e3b-98.jpg", "descriptions": "New York in 1911 is flooded. Avenues are now canals, rooftops are now the streets and slowly the buildings crumble into the sea. Life is precarious here. But Manhattan has endured and transformed into a collection of City-States. Now a new crisis threatens and the city needs your help!"}, {"name": "Dead Effect 2", "details_link": "https://www.metacritic.com/game/xbox-one/dead-effect-2", "publisher": "BadFly Interactive, a.s", "release_date": "Jan 13 2017", "developers": ["BadFly Interactive", "a.s", "BadFly Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 56, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/886d96b7b47e76fc14935ae761a0a1e8-98.jpg", "descriptions": "A sci-fi horror first-person shooter set aboard a derelict colonization spaceship. Stand up to the challenge as an elite soldier and try to seize control of the monster-infested ship."}, {"name": "FIFA Street 3", "details_link": "https://www.metacritic.com/game/ds/fifa-street-3", "publisher": "EA Sports", "release_date": "Feb 18 2008", "developers": ["EA Canada", "Exient Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "DS"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Arcade", "Arcade"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/74ae8819bc4b911c43c0d90c5d44b9cf-98.jpg", "descriptions": "With the all new FIFA Street 3 Touch Screen control scheme you can control all aspects of your team’s performance from passing and shooting to more advanced moves like juggling, headers and bicycle kicks .Use the stylus and simple button controls to seamlessly combine moves together betweenWith the all new FIFA Street 3 Touch Screen control scheme you can control all aspects of your team’s performance from passing and shooting to more advanced moves like juggling, headers and bicycle kicks .Use the stylus and simple button controls to seamlessly combine moves together between players to execute rewarding combos – providing you with tons of different ways to showcase your street skills. Fill up your Gamebreaker bar and trigger Touch Screen controlled team trick moments to increase your chances of scoring a goal. FIFA Street 3 on the Nintendo DS features an exclusive mini-game called Kick Ups that challenges you to keep the ball in the air and test your ball juggling skills. Build your team around your favourite player in Street Challenge Mode, and then take them from Pretender to Legendary status by completing challenges, developing Team Chemistry, improving your Reputation and unlocking balls, kits and a few surprises. Take your team to the urban playgrounds of South America, the rooftops in Asia, the streets of Europe, or a special location in Africa exclusive to the Nintendo DS. [Electronic Arts]… Expand"}, {"name": "Korea: Forgotten Conflict", "details_link": "https://www.metacritic.com/game/pc/korea-forgotten-conflict", "publisher": "Cenega Publishing", "release_date": "Nov 17 2003", "developers": ["Plastic Reality"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/823dd9ac65ebdbcce16b29c3529a4f7a-98.jpg", "descriptions": "It's raining. You're hungry, you?re tired, you're wet and you're scared! Not only are you suffering physically, you also have the burden of being the Commander of a group of five military specialists (a medic, a demolition expert, a sniper, a scout, and you) during the Korean War of 1950 toIt's raining. You're hungry, you?re tired, you're wet and you're scared! Not only are you suffering physically, you also have the burden of being the Commander of a group of five military specialists (a medic, a demolition expert, a sniper, a scout, and you) during the Korean War of 1950 to 1953. Comprising of 12 missions spread over four campaigns, each with its own unique setting, this group of soldiers is there to undertake those missions which prove too dangerous for most. Korea: Forgotten Conflict provides both real and original locations using approved military tactics, facilities and equipment. The environments are played through an original, scalable 'glass eye' view, which is easy to manipulate, as you decide your strategy and tactics whilst on the move. [Cenega]… Expand"}, {"name": "Cool Boarders 2001", "details_link": "https://www.metacritic.com/game/playstation/cool-boarders-2001", "publisher": "SCEA", "release_date": "Oct 31 2000", "developers": ["Idol Minds"], "platforms": ["PlayStation 2", "PlayStation"], "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 56, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/dde9b7ac243b984f615c29738a28e5fd-98.jpg", "descriptions": "Rip it up with 10 World Class professional snowboards, including snowboarding champions Todd Richards, Barrett Christy, Kevin Jones, Michele Taggart, Jeremy Jones and Tara Dakides. Tweak your grabs on more then 20 huge, branching courses in 6 killer events. Carve the slopes against the prosRip it up with 10 World Class professional snowboards, including snowboarding champions Todd Richards, Barrett Christy, Kevin Jones, Michele Taggart, Jeremy Jones and Tara Dakides. Tweak your grabs on more then 20 huge, branching courses in 6 killer events. Carve the slopes against the pros in the intense Pro Challenger mode. Shred powder against the best! Sick tricks, grabs, grinds, board tweaks and special moves. Create your own rider and look like a pro boarder with authentic gear from top snowboarding sponsors.… Expand"}, {"name": "Postal", "details_link": "https://www.metacritic.com/game/pc/postal", "publisher": "Ripcord Games", "release_date": "Sep 30 1997", "developers": ["Running With Scissors"], "platforms": ["iPhone/iPad", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "General", "Shooter", "Third-Person", "Shoot-'Em-Up", "Modern", "Top-Down"], "meta_score": 56, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/e4d2ff1431266e3636a8ca0ed8f86b67-98.jpg", "descriptions": "We'd like to express our sincere thanks and gratitude to the Honorable Senator Liebermann of Connecticut for including POSTAL in his list of the three worst things in America. First place went to POSTAL, second place was Marylin Manson, and third place went to Calvin Klein underwear ads. [Ripcord]"}, {"name": "Kinect Star Wars", "details_link": "https://www.metacritic.com/game/xbox-360/kinect-star-wars", "publisher": "Microsoft Game Studios", "release_date": "Apr  3 2012", "developers": ["Terminal Reality"], "platforms": "Xbox 360", "genres": ["Action", "Adventure", "General", "3D", "First-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 55, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/4/a763e3ea72e8da88234a50e1c8d7d646-98.jpg", "descriptions": "Enter the Galaxy: True to the Star Wars you know and love, visuals transport you into the Star Wars universe, complete with iconic characters, vehicles, ships, Droids and much more. Drawing on iconic moments from the motion pictures, Kinect Star Wars allows you to enter the Star WarsEnter the Galaxy: True to the Star Wars you know and love, visuals transport you into the Star Wars universe, complete with iconic characters, vehicles, ships, Droids and much more. Drawing on iconic moments from the motion pictures, Kinect Star Wars allows you to enter the Star Wars universe and experience a variety of physical play. Swing your arms to wield a Lightsaber, reach out and use the Force, jump, dodge or kick to defeat your enemies. Easy in/out co-op lets a 2nd player jump into the fun at any time in some modes. Lightsaber combat, Force moves, piloting Speederbikes and iconic ships, Podracing and much more. Experience the breadth of the Star Wars universe as you wield a Lightsaber and train to be a Jedi Master, become a champion Podracer, master the Force, pilot iconic ships and Speederbikes, and much more. [Microsoft]… Expand"}, {"name": "Under the Skin", "details_link": "https://www.metacritic.com/game/playstation-2/under-the-skin", "publisher": "Capcom", "release_date": "Oct 12 2004", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 55, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/f88ef42a7dc970f2a62b9a380fb9a31e-98.jpg", "descriptions": "(Known in Japan as \"Meiwaku Seijin: Panic Maker\") Under the Skin allows gamers to take the reigns of a mischievous alien named Cosmi who travels the galaxy on a training mission to pull pranks and initiate panic on the planet Earth. Transform into the personas of the individuals Cosmi meets(Known in Japan as \"Meiwaku Seijin: Panic Maker\") Under the Skin allows gamers to take the reigns of a mischievous alien named Cosmi who travels the galaxy on a training mission to pull pranks and initiate panic on the planet Earth. Transform into the personas of the individuals Cosmi meets in order to complete the tasks for returning home in this unique and interesting twist on the action genre. Use a special ray gun to help Cosmi pull pranks , absorb humanpersonas and pull various type of high jinx including: warping to a different location in order to escape panicked mobs; passing gas behind you; and turning humans into giant bowling pins and send them flying by throwing giant bowling balls after them. [Capcom]… Expand"}, {"name": "Start the Party!", "details_link": "https://www.metacritic.com/game/playstation-3/start-the-party!", "publisher": "SCEA", "release_date": "Sep  7 2010", "developers": ["Supermassive Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Party", "Party", "Party / Minigame"], "meta_score": 55, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/877420dedf1652d92b6dd6f0fe6a1cd6-98.jpg", "descriptions": "Step into an animated augmented virtual reality in Start The Party!, a collection of interactive social party games for the whole family. Start The Party! transforms the PlayStation Move motion controller into an array of virtual props that players hold in their hand to twist, cut, swat,Step into an animated augmented virtual reality in Start The Party!, a collection of interactive social party games for the whole family. Start The Party! transforms the PlayStation Move motion controller into an array of virtual props that players hold in their hand to twist, cut, swat, paint, pop, and jab their way through a series of fast-paced challenges requiring skill, speed and precision. Players are fully immersed into Start The Party! as the PlayStation Eye displays the players and their surroundings within the game's colorful user interface, making them the star of the game.  … Expand"}, {"name": "Bloody Good Time", "details_link": "https://www.metacritic.com/game/xbox-360/bloody-good-time", "publisher": "Ubisoft", "release_date": "Oct 28 2010", "developers": ["Ubisoft"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Rail", "Modern", "Modern", "Arcade"], "meta_score": 55, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/522511a826ab65723c3efa2476b5878d-98.jpg", "descriptions": "Bloody Good Time takes a new and irreverent approach to multiplayer shooters and will run on Valve's Source engine, a well-known specialized 3D game engine for classic multiplayer shooters. Bloody Good Time puts players on a Hollywood set, where they get to choose their thrill. From aBloody Good Time takes a new and irreverent approach to multiplayer shooters and will run on Valve's Source engine, a well-known specialized 3D game engine for classic multiplayer shooters. Bloody Good Time puts players on a Hollywood set, where they get to choose their thrill. From a spring-break beach house, to a horrifying Vegas hotel, players will discover the merciless world of movie studios where anyone can star in a scary Hollywood blockbuster film. There is an option link up to eight players online in this first-person shooter and to have a multiplayer experience like no other.… Expand"}, {"name": "Onechanbara: Bikini Zombie Slayers", "details_link": "https://www.metacritic.com/game/wii/onechanbara-bikini-zombie-slayers", "publisher": "D3Publisher", "release_date": "Feb 10 2009", "developers": ["Tamsoft"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 55, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/a82881ba5d773558a18a81ec71aada7e-98.jpg", "descriptions": "In Onechanbara: Bikini Zombie Slayers, Aya is out to find the meaning of her IMICHI ancestors, even if it leads to the answer she does not wish for. Players can master the sword to take full advantage of the Wii Remote motion controls by slashing, swinging and thrusting into zombie enemyIn Onechanbara: Bikini Zombie Slayers, Aya is out to find the meaning of her IMICHI ancestors, even if it leads to the answer she does not wish for. Players can master the sword to take full advantage of the Wii Remote motion controls by slashing, swinging and thrusting into zombie enemy hordes. Play as either sister Aya or Saki in single player or with a friend in Co-Op Mode and utilize each of their unique fighting styles and set of moves. Get too much blood on either sister and be driven into Rage Mode and gain more power and agility to destroy enemies faster and deadlier. Every person met and enemy battled gets the sisters closer to understanding who or what is behind the zombie outbreak and putting an end to it. [D3Publisher of America]… Expand"}, {"name": "Genji: Days of the Blade", "details_link": "https://www.metacritic.com/game/playstation-3/genji-days-of-the-blade", "publisher": "SCEA", "release_date": "Nov 14 2006", "developers": ["Game Republic"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 55, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/a95a8e00e35f8ac64edfbccb71b7c312-98.jpg", "descriptions": "Based on the PS2 game \"Genji,\" and set three years after the last chapter of Genkuro Yoshitsune's life, this sequel continues to expand on the historical accounts of feudal Japan. By doing so, the game unveils beautiful next generation visuals and sword slashing gameplay as an exclusivelyBased on the PS2 game \"Genji,\" and set three years after the last chapter of Genkuro Yoshitsune's life, this sequel continues to expand on the historical accounts of feudal Japan. By doing so, the game unveils beautiful next generation visuals and sword slashing gameplay as an exclusively developed title for PS3. In gameplay, Genji 2 is presented as a \"traditional\" action/adventure gaming experience and features more than double the amount of gameplay than its predecessor. Gameplay includes more diverse levels of fighting, and more playable characters - all underlying an epic tale of a warrior's honor that promises to deliver a genuine next-generation experience. Features over 15 hours of gameplay continuing the story of Yoshitsune and based on the historical battle between the Genji Clan and the Heishi Clan. Swap between Four Playable Characters, At Any time – Take advantage of each of the four characters' unique fighting style or unleash devastating team-based fighting combos by interchanging characters between attacks. Gracefully articulated swordplay captured by Mitsuhiko Seike, Japan's finest sword fighter, provides the heart and soul of intense authentic action. Lead Yoshitsune and his men against hundreds of warriors, as you strive to reach, and defeat, the enemy warlord in epic battle sequences based on Japanese history. [SCEA]… Expand"}, {"name": "Sniper: Ghost Warrior 3", "details_link": "https://www.metacritic.com/game/playstation-4/sniper-ghost-warrior-3", "publisher": "City Interactive", "release_date": "Apr 25 2017", "developers": ["City Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 55, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/33a934e91feb0a8b45cc3cec8f8653ec-98.jpg", "descriptions": "Go behind enemy lines with the ultimate modern military shooter. Choose your missions across an unforgiven open world.\r Stay low and leave no traces in this third game of the tactical shooter franchise. Set in a modern day conflict based in Eastern Europe, players in Sniper: Ghost WarriorGo behind enemy lines with the ultimate modern military shooter. Choose your missions across an unforgiven open world.\r Stay low and leave no traces in this third game of the tactical shooter franchise. Set in a modern day conflict based in Eastern Europe, players in Sniper: Ghost Warrior 3 will be thrust into the role of a sniper caught between three warring factions, played out in a realistic and immersive environment. Dig deep into the Ghost Warrior DNA as you choose between taking out your targets up close or from a distance, while at the same time focusing on your survival through evasion and stealth. Non-linear, sandbox-style gameplay on large open-ended maps gives players the flexibility to play and replay the missions in a number of different ways. Sniper: Ghost Warrior 3 will offer intriguing challenges for tactically-minded gamers, while still remaining accessible to first-person shooter fans.… Expand"}, {"name": "Dynasty Warriors: Gundam", "details_link": "https://www.metacritic.com/game/xbox-360/dynasty-warriors-gundam", "publisher": "Namco Bandai Games", "release_date": "Aug 28 2007", "developers": ["Koei", "Omega Force"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 55, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/edb6229bb8234d5512f4dd81ade73b87-98.jpg", "descriptions": "In the future, rebel space colonies launch a brutal war for independence with a series of orbital strikes against the Earth. War is reinvented as advanced ECM renders long range sensors and communications virtually useless. In this chaos, a frightening new weapon, the Mobile Suit, is born.In the future, rebel space colonies launch a brutal war for independence with a series of orbital strikes against the Earth. War is reinvented as advanced ECM renders long range sensors and communications virtually useless. In this chaos, a frightening new weapon, the Mobile Suit, is born.  Agile, heavily armed and armored - optimized for short range combat with melee attacks and a wide array of weapons, the Mobile Suit is the ultimate instrument in this new age of warfare.  The time has come to pick a side, choose a weapon and prove your supremacy. Dynasty Warriors:GUNDAM takes gamers through an intergalactic conflict where the only hope for survival is to annihilate the encroaching opposing forces. It's a one-versus-many as gamers fight at lightning speed aboard their favorite Mobile Suit, the ultimate weapon of war. Gamers can explore the rich and detailed setting of the Gundam multi-verse from a myriad of perspectives. Assume the role of legendary heroes and villains while strategically enhancing their power, skills, and abilities. Play out the legendary scenes from the rich storyline and marvel at the subtle twists viewed through the eyes of each character. Furthermore, unlock Mobile Suits and Pilots from different Gundam universe time lines while accomplishing secret missions adding limitless replayability. With a variety of game types including Official, Original and Versus Mode, gamers must overcome impossible odds to bring their Mobile Suits to victory. [Namco Bandai / Koei]… Expand"}, {"name": "Table Top Racing: World Tour", "details_link": "https://www.metacritic.com/game/playstation-4/table-top-racing-world-tour", "publisher": "Ripstone", "release_date": "May  3 2016", "developers": ["Playrise Digital", "Playrise Edge Ltd."], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 55, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/d674122e3606fa536a765acdf88c85e6-98.jpg", "descriptions": "Table Top Racing: World Tour is a high-octane combat racer from Nick Burcombe, the co-creator of the Wipeout series. Get yourself behind the wheel of one of twelve fully-customisable miniature cars and attempt to master 24 race tracks in Championship mode. There is a series of Special EventsTable Top Racing: World Tour is a high-octane combat racer from Nick Burcombe, the co-creator of the Wipeout series. Get yourself behind the wheel of one of twelve fully-customisable miniature cars and attempt to master 24 race tracks in Championship mode. There is a series of Special Events to beat, or you can head online and challenge up to 8 friends to determine the ultimate racer. [Playstation.com]… Expand"}, {"name": "How to Survive", "details_link": "https://www.metacritic.com/game/wii-u/how-to-survive", "publisher": "505 Games", "release_date": "Jun 19 2014", "developers": ["EKO Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 55, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/29cd741efb7b3cae03b91095d50340b0-98.jpg", "descriptions": "Featuring a robust crafting system, unique survival guide and a host of playable characters, How to Survive strands players on a remote archipelago off the coast of Colombia in the aftermath of an unexplained accident...but you're not alone. In order to survive, you must fulfill the mostFeaturing a robust crafting system, unique survival guide and a host of playable characters, How to Survive strands players on a remote archipelago off the coast of Colombia in the aftermath of an unexplained accident...but you're not alone. In order to survive, you must fulfill the most basic of needs - seeking out food, water and shelter, as well as crafting dozens of tools and weapons from fishing rods to Molotov cocktails. Players can also team up with other survivors in local and online multiplayer story and challenge modes to take on a growing array of the infected.… Expand"}, {"name": "Super Monkey Ball 3D", "details_link": "https://www.metacritic.com/game/3ds/super-monkey-ball-3d", "publisher": "Sega", "release_date": "Mar 27 2011", "developers": ["Sega"], "platforms": "3DS", "genres": ["Action", "General", "General"], "meta_score": 55, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/aa80be8006148cd603ba93c2592f31ab-98.jpg", "descriptions": "Taking advantage of the power of the Nintendo 3DS, players can let themselves loose in each new vibrant world as they twist and turn whilst aiming to collect every banana in the fastest time possible. This latest installment contains three brand-new compelling gameplay choices includingTaking advantage of the power of the Nintendo 3DS, players can let themselves loose in each new vibrant world as they twist and turn whilst aiming to collect every banana in the fastest time possible. This latest installment contains three brand-new compelling gameplay choices including single-player puzzle levels, Monkey Race and Monkey Fight. These new game modes give players the chance to compete via wireless connection with up to four players in the best 3D social experience possible in the palm of their hands.  In addition, Super Monkey Ball fans will be able to choose between the Nintendo 3DS motion sensor or the Slide Pad to navigate the puzzle mazes with complete precision.… Expand"}, {"name": "I of the Dragon", "details_link": "https://www.metacritic.com/game/pc/i-of-the-dragon", "publisher": "Strategy First", "release_date": "Nov  2 2004", "developers": ["Primal Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 55, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/118e873da3916145487a4d9329c8fa9d-98.jpg", "descriptions": "I of The Dragon is an Action-RPG where the player takes the role of a hero Dragon. The Dragon is young and must be matured in strength and power through a levelling system that will reward the player with new spells and skill upgrades. Play as one of three possible dragons, each with theirI of The Dragon is an Action-RPG where the player takes the role of a hero Dragon. The Dragon is young and must be matured in strength and power through a levelling system that will reward the player with new spells and skill upgrades. Play as one of three possible dragons, each with their own unique abilities. Use spells and brute force to hunt down and destroy the evil creatures that threaten the peaceful Nimoans. Defend towns, build new ones. Create mountains or bring them crumbling to the ground. Summon creatures to fight for you or rely on your own powers. Use all means available to help in your quest to unmask the source of evil that plagues the land. [Strategy First]… Expand"}, {"name": "Ice Age: Scrat's Nutty Adventure", "details_link": "https://www.metacritic.com/game/playstation-4/ice-age-scrats-nutty-adventure", "publisher": "Outright Games", "release_date": "Oct 18 2019", "developers": ["Blue Sky Studios"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 55, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/a761de9852851acfdeaa6559dd3a9f84-98.jpg", "descriptions": "Everyone’s favorite sabre-tooth squirrel, Scrat, is at it again in an all-new adventure! Guide Scrat through a hilarious 3D action-adventure, where you’ll face fierce prehistoric creatures, survive crazy calamities, and return the missing relics to their rightful home."}, {"name": "Dark Horizon", "details_link": "https://www.metacritic.com/game/pc/dark-horizon", "publisher": "Paradox Interactive", "release_date": "Oct  7 2008", "developers": ["Paradox Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Sci-Fi", "Space", "Futuristic Jet", "Futuristic Jet", "Combat"], "meta_score": 55, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/b14f640766b881ba2805afe4cd5714ac-98.jpg", "descriptions": "Dark Horizon is a stark and atmospheric space combat simulation that aims to hurl its audience through an action-packed adventure, piloting its own ship through the perils that only space could have to offer. It's a plot-rich experience; 22 challenging missions, laced with special featuresDark Horizon is a stark and atmospheric space combat simulation that aims to hurl its audience through an action-packed adventure, piloting its own ship through the perils that only space could have to offer. It's a plot-rich experience; 22 challenging missions, laced with special features such as full ship customization, original weapon creation, joystick support, and several modes of combat. [Paradox Interactive]… Expand"}, {"name": "Monster Madness: Battle for Suburbia", "details_link": "https://www.metacritic.com/game/xbox-360/monster-madness-battle-for-suburbia", "publisher": "SouthPeak Games", "release_date": "Jun 12 2007", "developers": ["Artificial Studios", "Immersion Software & Graphics"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Scrolling", "Shoot-'Em-Up", "Modern", "Vertical"], "meta_score": 55, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/15c95fcf37c57eb4d0141715d195da51-98.jpg", "descriptions": "Our story begins in a typical house on a Friday night, one seemingly like any other within the quiet, safe streets of Suburbia. Zack is at home on a \"study date\" with Carrie, though he is desperately trying to interest her in more than just his math skills. While Zack is preparing toOur story begins in a typical house on a Friday night, one seemingly like any other within the quiet, safe streets of Suburbia. Zack is at home on a \"study date\" with Carrie, though he is desperately trying to interest her in more than just his math skills. While Zack is preparing to proclaim his eternal devotion, his friend Andy busts in, pestering Zack to finish the design for a new rocket-powered skateboard. Before Zack can order him and others to leave, some unexpected guests suddenly arrive and these guys are hungry...FOR BRAINS! Zombies break through the front door, and Zack's house is soon swarming with the Undead. The four intrepid teenagers manage to contain their fright, and using all sorts of household weaponry they actually fend off this zombie assault. However now they must contend with a full-scale suburban invasion, and everything from Werewolves to Witches are on the rampage - Oh My! And where has everyone else gone? Together, Zack, Carrie, Andy, and Jennifer resolve to wage a Battle for Suburbia, rescue their missing neighbors, and discover the ultimate source of this monster onslaught. The secrets they'll uncover throughout this adventure will explain the shocking truth behind their little town. [SouthPeak Interactive]… Expand"}, {"name": "Samurai Warriors 3", "details_link": "https://www.metacritic.com/game/wii/samurai-warriors-3", "publisher": "Nintendo", "release_date": "Sep 28 2010", "developers": ["Omega Force"], "platforms": "Wii", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 55, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/04b3155115f49dc2d0d76c144620c14e-98.jpg", "descriptions": "Making its debut exclusively on Wii, Samurai Warriors 3 takes total advantage of Nintendo's new Classic Controller PRO."}, {"name": "Watchmen: The End Is Nigh", "details_link": "https://www.metacritic.com/game/xbox-360/watchmen-the-end-is-nigh", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar  4 2009", "developers": ["Deadline Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 55, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/0fa6161dbafa098ed1b445de0f42a62a-98.jpg", "descriptions": "[Xbox Live Arcade]  The lines between good and evil have been blurred and crime and terror run rampant in the streets. The alleys, rooftops, and sewers are crawling with criminals and brutal gangs. And now, Underboss - in a daring escape - has broken out of prison and is ruling with vicious[Xbox Live Arcade]  The lines between good and evil have been blurred and crime and terror run rampant in the streets. The alleys, rooftops, and sewers are crawling with criminals and brutal gangs. And now, Underboss - in a daring escape - has broken out of prison and is ruling with vicious darkness. The city is in need of saviors and only masked hero vigilantes answer the call. Answer the call in Watchmen: The End Is Nigh. Two Watchmen characters: Play either as Rorschach, a feral, street-wise fighter who can disarm enemies to use their own weapons against them, or Nite Owl, a refined fighter who uses martial arts expertise and high-tech wizardry. Fierce action: Fight and watch the blood fly through six chapters of gut-wrenching in-your-face action. Intense, visceral battles: Fight up to 20 enemies at the same time with bloody, street-fighting moves. Multiplayer: Clean up the streets with friends in split screen co-op multiplayer competition, or solo. [Deadline Games]… Expand"}, {"name": "Eco-Creatures: Save the Forest", "details_link": "https://www.metacritic.com/game/ds/eco-creatures-save-the-forest", "publisher": "Majesco Games", "release_date": "Mar  4 2008", "developers": ["Headlock"], "platforms": "DS", "num_players": "Up to 4 ", "genres": ["Strategy", "Adventure", "Real-Time", "General", "General", "Command"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b502f358e071b31b53019f0060e708f7-98.jpg", "descriptions": "Deforestation, pollution, global warming and industrialization are just some of the many important themes in Eco Creatures: Save the Forest, a unique real-time strategy game and the only game of its kind that promotes awareness of environmental perils while tasking players with defending theDeforestation, pollution, global warming and industrialization are just some of the many important themes in Eco Creatures: Save the Forest, a unique real-time strategy game and the only game of its kind that promotes awareness of environmental perils while tasking players with defending the Mana Woods against them. Players use the Touch Screen to control units of woodland creatures—named Ecolis, Ecoby and Ecomon—that will protect the naturally beautiful Mana Woods and recover the polluted land. All creature types have unique skills that must be strategically managed. With proper nurturing, they can evolve to learn new abilities that help a player complete the game’s more than 40 environmental missions. As players grow their woodland army, they must also plant new trees to prevent deforestation and revitalize the woodlands. In addition, Eco Creatures includes a creative Land Make feature that lets players build and play their own maps. This eco-friendly RTS also supports two-player play via Nintendo Wi-Fi Connection, and up to four players via single card download play or ad-hoc multi-card play. [Majesco Games]… Expand"}, {"name": "The Amazing Spider-Man", "details_link": "https://www.metacritic.com/game/3ds/the-amazing-spider-man", "publisher": "Activision", "release_date": "Jun 26 2012", "developers": ["Beenox"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "3DS"], "genres": ["General", "Action", "Action Adventure", "General", "Open-World"], "meta_score": 55, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/f684c018d030d70d20a9748b7b8736d3-98.jpg", "descriptions": "Go beyond the movie to experience what it's like to BE Spider-Man like never before. Set shortly after the events of Columbia Pictures' new film, The Amazing Spider-Man throws New York City's brand new hero back into free-roaming, web-slinging action, as he protects the Big Apple from aGo beyond the movie to experience what it's like to BE Spider-Man like never before. Set shortly after the events of Columbia Pictures' new film, The Amazing Spider-Man throws New York City's brand new hero back into free-roaming, web-slinging action, as he protects the Big Apple from a deluge of unimaginable threats. Experience the new Web Rush mechanic as Spidey twists his way through the NYC skyline with unprecedented speed and grace. The game's original story also explores beautiful indoor environments, as you'll encounter everything from skirmishes with everyday street thugs to pulse-pounding confrontations with Spider-Man's most lethal foes.… Expand"}, {"name": "Shifting World", "details_link": "https://www.metacritic.com/game/3ds/shifting-world", "publisher": "Aksys Games", "release_date": "Apr 24 2012", "developers": ["Fishing Cactus"], "platforms": "3DS", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 55, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/18b9ee876ce913d7c85fc0289b5194b9-98.jpg", "descriptions": "Shifting World is first of the SHIFT series to adapt the famous puzzle gameplay to full 3D."}, {"name": "Crazy Machines Elements", "details_link": "https://www.metacritic.com/game/xbox-360/crazy-machines-elements", "publisher": "DTP Entertainment", "release_date": "Aug 24 2011", "developers": ["FAKT Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/f42c1d9244dc4f8493575495d080a40b-98.jpg", "descriptions": "In grand Crazy Machines tradition, players must create wacky chain reactions using different parts and accomplish the tasks set out in their mission, from knocking vases over to blowing out candles."}, {"name": "Casino, Inc.", "details_link": "https://www.metacritic.com/game/pc/casino-inc", "publisher": "Konami", "release_date": "Mar 26 2003", "developers": ["Hothouse Creations"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 55, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/d862d6e11716c306c3557b3cfd8f7729-98.jpg", "descriptions": "Hit the jackpot with Casino Inc., the complete sim that drops you right in the glitzy, and sometimes gritty, world of casino management. Casino Inc features all the detail expected from a simulation. But combined with the appeal of Casino life, and the added spice of the \"adult\" side of theHit the jackpot with Casino Inc., the complete sim that drops you right in the glitzy, and sometimes gritty, world of casino management. Casino Inc features all the detail expected from a simulation. But combined with the appeal of Casino life, and the added spice of the \"adult\" side of the business, Casino Inc. has more to offer than any other casino management game. Hire and utilize the likes of Hookers and Hit Men. Play the game inside your casinos and outside in the surrounding city. Build and run up to 8 casinos within the city limits at the same time. Learn the spending habits and primal urges of over 120 characters. [Konami]… Expand"}, {"name": "Zapper", "details_link": "https://www.metacritic.com/game/xbox/zapper", "publisher": "Infogrames", "release_date": "Nov  3 2002", "developers": ["Blitz Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/0ae42dd56b3e73e8e25e511de80fe942-98.jpg", "descriptions": "In Zapper, you play a small creature that embarks on a great quest. Zapper is a cricket in search of brother Zipper, who was kidnapped by the evil Maggie the Magpie. Through 18 twisted levels, you'll evade bizarre enemies and deadly hazards using your electrified antennae and springyIn Zapper, you play a small creature that embarks on a great quest. Zapper is a cricket in search of brother Zipper, who was kidnapped by the evil Maggie the Magpie. Through 18 twisted levels, you'll evade bizarre enemies and deadly hazards using your electrified antennae and springy reflexes. Zap your foes, explore your surroundings, and find and destroy eggs before they hatch. Zapper's intense action continues as you unlock hidden areas, bonus levels, and play multiplayer games.… Expand"}, {"name": "Aliens Versus Predator 2: Primal Hunt Expansion Pack", "details_link": "https://www.metacritic.com/game/pc/aliens-versus-predator-2-primal-hunt-expansion-pack", "publisher": "Sierra Entertainment", "release_date": "Aug 13 2002", "developers": ["Third Law Interactive"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 55, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/17f89bc9cad64706a3902ec161850a18-98.jpg", "descriptions": "On a routine hunt on Planet LV1201 a lone Predator finds a mysterious Artifact with the power to keep the savage Aliens at bay, and as legend has it, even control their minds. The Predator triggers a stasis field, trapping him for 500 years until Dunya, a human Corporate mercenary,On a routine hunt on Planet LV1201 a lone Predator finds a mysterious Artifact with the power to keep the savage Aliens at bay, and as legend has it, even control their minds. The Predator triggers a stasis field, trapping him for 500 years until Dunya, a human Corporate mercenary, unwittingly frees him and escapes with the Artifact. Meanwhile, a lone PredAlien seeks to destroy the Artifact to preserve the sanctity of the Hive. Now the hunt is on to retrieve the mystical Artifact before Dunya escapes back to safety. [Sierra]… Expand"}, {"name": "Hercules: The Legendary Journeys", "details_link": "https://www.metacritic.com/game/nintendo-64/hercules-the-legendary-journeys", "publisher": "Titus Software", "release_date": "Nov 16 2000", "developers": ["Player 1"], "platforms": "Nintendo 64", "genres": ["Action Adventure", "Fantasy"], "meta_score": 55, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/dc4c9f3ea42714dc47deaa0c9072b583-98.jpg", "descriptions": "Take control of the legendary hero Hercules and his friends Iolaus and Serena as they attempt to stop Ares from completing his diabolical plans. Use each character's unique attributes: Hercules' legendary strength, Iolaus' nimble nature and Serena's accuracy to complete your quest. TravelTake control of the legendary hero Hercules and his friends Iolaus and Serena as they attempt to stop Ares from completing his diabolical plans. Use each character's unique attributes: Hercules' legendary strength, Iolaus' nimble nature and Serena's accuracy to complete your quest. Travel through 12 unique fully 3D worlds, from the sunny seaside town of Porticus to the snowy mountains of Alpsius. Explore the bandit-overrun forrests of Traycus or heavenly Mount Olympus. Fight mythical terrifying monsters such as the Minotaur, Cyclops, and more!… Expand"}, {"name": "Buzz Lightyear of Star Command", "details_link": "https://www.metacritic.com/game/dreamcast/buzz-lightyear-of-star-command", "publisher": "Activision", "release_date": "Sep 26 2000", "developers": ["Traveller's Tales"], "platforms": "Dreamcast", "genres": ["Action", "Platformer", "3D"], "meta_score": 55, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/a3758de59c822b50dcda23f79ede0b75-98.jpg", "descriptions": "Calling All Intergalactic Space Rangers!\r Only you, Buzz Lightyear, and your elite Space Ranger team can defeat the evil Emperor Zurg and his bad guys in their dark quest for universal domination. To infinity and beyond!"}, {"name": "Naruto Shippuden: Ninja Destiny 2", "details_link": "https://www.metacritic.com/game/ds/naruto-shippuden-ninja-destiny-2", "publisher": "Tomy Corporation", "release_date": "Sep 15 2009", "developers": ["DreamFactory", "Takara Tomy"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 55, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/fef0d41023c3dbe54b14c5e7754e4008-98.jpg", "descriptions": "(Also known as \"Naruto: Ninja Destiny II\")  Get ready to guide Naruto towards his destiny as he battles to overcome the demons of his past and avenge defeat in Naruto Ninja Destiny 2. Featuring 25 playable characters, an action-packed story mode and the option of asserting your authority(Also known as \"Naruto: Ninja Destiny II\")  Get ready to guide Naruto towards his destiny as he battles to overcome the demons of his past and avenge defeat in Naruto Ninja Destiny 2. Featuring 25 playable characters, an action-packed story mode and the option of asserting your authority against friends in multiplayer mode, Ninja Destiny 2 takes you straight to the heart of the Naruto universe on Nintendo DS. Story mode introduces a brand new plotline created especially for the game. After suffering a crushing defeat to his one-time friend, Sasuke, Naruto must pick up the pieces and train with the Leaf Village ninja to take his fighting skills to new heights. Guide him around 3D environments, interact with other characters and dispatch of those who stand in his way as you help to turn Naruto into the fighter he was always destined to be. In battle mode you'll have to rise to the challenge of going toe-to-toe with friends in all-action ninja battles. Choose from one of 25 characters before unleashing your own brand of finely-tuned fighting fury. For the first time in a Naruto title you can even step into the arena as any of the popular Hokage characters. Voice acting from the original anime cast adds an extra impact to every blow. Whatever way you play, the larger than life personality of the hit series is brought to life on DS with dazzling style, while the unique features of the handheld ensure there are plenty of novel ways to gain the edge in battle. [Nintendo of Europe]… Expand"}, {"name": "The Incredible Hulk", "details_link": "https://www.metacritic.com/game/playstation-3/the-incredible-hulk", "publisher": "Sega", "release_date": "Jun  5 2008", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 55, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/8a37bcd8c8e0b40226d9d37ac3cdee99-98.jpg", "descriptions": "Fast-paced and action-packed, the blockbuster franchise and comic book saga unfolds for the first time on next-generation platforms, as Banner scours the planet trying to find anything to help him fight his involuntary rage. Take the role of one of Marvel's most powerful Super Heroes in TheFast-paced and action-packed, the blockbuster franchise and comic book saga unfolds for the first time on next-generation platforms, as Banner scours the planet trying to find anything to help him fight his involuntary rage. Take the role of one of Marvel's most powerful Super Heroes in The Incredible Hulk, a third-person action video game. Gamers can demolish anything in their path, including lampposts, passing cars and even buildings. The fury-fueled game also features key moments from the film, as well as additional plotlines and characters from The Incredible Hulk universe. Players crash through New York City, battling gigantic enemies amidst soaring skyscrapers in a massive open world. [Sega]… Expand"}, {"name": "Monster Madness: Grave Danger", "details_link": "https://www.metacritic.com/game/playstation-3/monster-madness-grave-danger", "publisher": "SouthPeak Games", "release_date": "Aug  5 2008", "developers": ["Psyonix"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 55, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/1035b2231354a46b205e5ba49bea5b3a-98.jpg", "descriptions": "Our story begins in a typical house on a Friday night, one seemingly like any other within the quiet, safe streets of Suburbia. Zack is at home on a \"study date\" with Carrie, though he is desperately trying to interest her in more than just his math skills. While Zack is preparing toOur story begins in a typical house on a Friday night, one seemingly like any other within the quiet, safe streets of Suburbia. Zack is at home on a \"study date\" with Carrie, though he is desperately trying to interest her in more than just his math skills. While Zack is preparing to proclaim his eternal devotion, his friend Andy busts in, pestering Zack to finish the design for a new rocket-powered skateboard. Before Zack can order him and others to leave, some unexpected guests suddenly arrive and these guys are hungry...FOR BRAINS! Zombies break through the front door, and Zack's house is soon swarming with the Undead. The four intrepid teenagers manage to contain their fright, and using all sorts of household weaponry they actually fend off this zombie assault. However now they must contend with a full-scale suburban invasion, and everything from Werewolves to Witches are on the rampage - Oh My! And where has everyone else gone? Together, Zack, Carrie, Andy, and Jennifer resolve to wage a Battle for Suburbia, rescue their missing neighbors, and discover the ultimate source of this monster onslaught. The secrets they'll uncover throughout this adventure will explain the shocking truth behind their little town. [SouthPeak Interactive]… Expand"}, {"name": "VR Ping Pong Pro", "details_link": "https://www.metacritic.com/game/playstation-4/vr-ping-pong-pro", "publisher": "Merge Games", "release_date": "Nov 12 2019", "developers": ["Reddoll Srl"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Other"], "meta_score": 55, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/f15a4167347a65e52fd7e72ecca683ba-98.jpg", "descriptions": "Rackets at the ready. VR Ping Pong Pro is the follow up to the hit table tennis simulator of 2016, VR Ping Pong. Test your skills with a variety of challenging game modes, as you rise up the ranks to become the true Ping Pong Pro! Do you have what it takes? Pick up your virtual racket and find out."}, {"name": "Close to the Sun", "details_link": "https://www.metacritic.com/game/switch/close-to-the-sun", "publisher": "Wired Productions", "release_date": "Oct 29 2019", "developers": ["Storm in a Teacup"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 55, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/1f3e3a9d504d25f01c395b464e861d3e-98.jpg", "descriptions": "It’s 1897. Deep in international waters, the Helios stands still. Dark clouds loom overhead as unforgiving waves crash against the hull. Colossal effigies of gold, decorated with magnificent finery, stretch as far as the eye can see. Born of Nikola Tesla’s vision, the Helios serves as aIt’s 1897. Deep in international waters, the Helios stands still. Dark clouds loom overhead as unforgiving waves crash against the hull. Colossal effigies of gold, decorated with magnificent finery, stretch as far as the eye can see. Born of Nikola Tesla’s vision, the Helios serves as a haven for the greatest scientific minds. An unbound utopia for research, independent from state and isolated from the gaze of society. Free to push the boundaries of matter and time. Journalist Rose Archer steps aboard the Helios in search of her sister Ada. She quickly discovers not all is as it seems. Grand halls stand empty. The stench of rotting flesh lingers in the air. Silence. A single word is painted across the entrance… QUARANTINE!… Expand"}, {"name": "Warriors Orochi", "details_link": "https://www.metacritic.com/game/playstation-2/warriors-orochi", "publisher": "Koei", "release_date": "Sep 18 2007", "developers": ["Omega Force"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 55, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/79de1b5198af465cbfed711386a615d0-98.jpg", "descriptions": "Without warning, the Serpent King Orochi descended from the heavens. Using his unworldly powers to shatter time and space, Orochi kidnapped the strongest, wisest and most courageous warriors from Ancient China and Feudal Japan to test his might against the heroes of these ages. Most of theWithout warning, the Serpent King Orochi descended from the heavens. Using his unworldly powers to shatter time and space, Orochi kidnapped the strongest, wisest and most courageous warriors from Ancient China and Feudal Japan to test his might against the heroes of these ages. Most of the great armies of these two periods would succumb to the might of Orochi. Yet powerful warriors remain and are ready to continue the fight. Now, the greatest showdown in history is about to take place. [Koei]… Expand"}, {"name": "TMNT", "details_link": "https://www.metacritic.com/game/pc/tmnt", "publisher": "Ubisoft", "release_date": "Mar 20 2007", "developers": ["Ubisoft Montreal"], "platforms": ["Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 55, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/cd305d7e0d78cbc7a8de4d8b1c308e9d-98.jpg", "descriptions": "Based on the all-new CGI TMNT movie, Ubisoft's TMNT video game takes place in New York City, a city plagued with fast-moving shadows and attacks from strange creatures. Could the wealthy and mysterious Max Winters be involved? New York City needs the Turtles now more than ever but they faceBased on the all-new CGI TMNT movie, Ubisoft's TMNT video game takes place in New York City, a city plagued with fast-moving shadows and attacks from strange creatures. Could the wealthy and mysterious Max Winters be involved? New York City needs the Turtles now more than ever but they face their most trying time both as heroes and as brothers. With the fate of the City and their family at stake, it's up to Leonardo with Zen Master Splinter to restore unity and ninja discipline to the Turtles. In this highly immersive experience, join the Ninja Turtles team and experience intense acrobatic navigation, collaborative combat and powerful fighting moves. Engage in over-the-top Ninja action to reunite the Turtles and save New York City. Leonardo, Raphael, Donatello and Michelangelo are playable, each with unique acrobatic moves, weapons and combat skills, such as Michelangelo’s fast nunchuk face slap and Raphael’s powerful Sai throw. [Ubisoft]… Expand"}, {"name": "Ford Mustang: The Legend Lives", "details_link": "https://www.metacritic.com/game/xbox/ford-mustang-the-legend-lives", "publisher": "2K Games", "release_date": "Apr 20 2005", "developers": ["Eutechnyx"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 55, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/cf41709eb908a4af54c68190985d368e-98.jpg", "descriptions": "Since April of 1964 the Ford Mustang has sold over 8 million vehicles and has generated a strong following of enthusiasts, aftermarket manufacturers, websites, and publications - all dedicated to this iconic vehicle. \"Ford Mustang\" provides incredible graphics and \"pick up andSince April of 1964 the Ford Mustang has sold over 8 million vehicles and has generated a strong following of enthusiasts, aftermarket manufacturers, websites, and publications - all dedicated to this iconic vehicle. \"Ford Mustang\" provides incredible graphics and \"pick up and play\" gameplay - at a value price. Drive the hottest cars from the 40 year history of the Mustang on 22 tracks in 7 U.S. cities. Features 40 incredibly rendered production, concept and racing models from 1964 to 2005. Choose from a diverse set of 22 accurately modeled, lifelike racing environments in 7 cities from across the USA. Arcade-style racing physics and realistic AI, from opponents as well as from obstacle traffic. Compete in \"coin-op\" style Challenges or Career Mode to unlock new cars, tracks and game modes while testing your skills to the limit. Split screen Multiplayer support for Head-to-Head racing.… Expand"}, {"name": "Haze", "details_link": "https://www.metacritic.com/game/playstation-3/haze", "publisher": "Ubisoft", "release_date": "May 20 2008", "developers": ["Free Radical Design"], "platforms": "PlayStation 3", "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 55, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/30726b89a02f12abc34c82c42e792a9d-98.jpg", "descriptions": "Twenty-five years in the future. Governments have outsourced military operations to private multinational corporations. As Jake Carpenter, a newly enlisted soldier in the Mantel army, you are seeking fulfillment and thrills by fighting for a good cause. Thanks to their high-tech arsenal ofTwenty-five years in the future. Governments have outsourced military operations to private multinational corporations. As Jake Carpenter, a newly enlisted soldier in the Mantel army, you are seeking fulfillment and thrills by fighting for a good cause. Thanks to their high-tech arsenal of vehicles, deadly weaponry, and performance enhancing bio-medical support, the Mantel Corporation's ruthlessly efficient soldiers are the most feared by terrorists, dictators, and the corporation's political enemies. Your conflict begins in a war-torn country in South America, where you have been sent to fight a vicious rebel faction, The Promise Hand. At first glance, all is well, but things quickly begin to look a little strange... State of the art multiplayer modes Fire up your console or PC for online battles on one of two carefully balanced sides. Choose from a variety of online modes including furious co-op action with your friends! [Ubisoft]… Expand"}, {"name": "The Amazing Spider-Man", "details_link": "https://www.metacritic.com/game/playstation-vita/the-amazing-spider-man", "publisher": "Activision", "release_date": "Nov 19 2013", "developers": ["Mercenary Technology"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Wii U", "Xbox 360", "PlayStation Vita"], "genres": ["General", "Action", "Action Adventure", "General", "Open-World"], "meta_score": 55, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/4e81be125949fadb1dbbac292d600549-98.jpg", "descriptions": "Set not long after the action of Columbia Pictures' blockbuster film, The Amazing Spider-Man thrusts New York City's brand new hero back into free-roaming, web-slinging action, as he protects the Big Apple from a deluge of unimaginable threats."}, {"name": "Humans Must Answer", "details_link": "https://www.metacritic.com/game/pc/humans-must-answer", "publisher": "SumomGames", "release_date": "Jul 11 2013", "developers": ["SumomGames"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 55, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/45a4e5097028aa491a47b82b34f19f29-98.jpg", "descriptions": "It's an satirical adventure of two young spaceship pilots, searching for knowledge and found themselves in the Solar System. Basically Humans Must Answer is a classical horizontal scrolling shooter with a lot of shooting and evading but with some additional features. Player can placeIt's an satirical adventure of two young spaceship pilots, searching for knowledge and found themselves in the Solar System. Basically Humans Must Answer is a classical horizontal scrolling shooter with a lot of shooting and evading but with some additional features. Player can place temporary towers (dron-towers) on the battlefield, combine weapons and more.… Expand"}, {"name": "Anna", "details_link": "https://www.metacritic.com/game/pc/anna", "publisher": "Kalypso", "release_date": "Jul 11 2012", "developers": ["Dreampainters"], "platforms": "PC", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 55, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/7d4aa601d161c83b0d655b1e199790f6-98.jpg", "descriptions": "Anna is a first person horror adventure game."}, {"name": "C.O.P.: The Recruit", "details_link": "https://www.metacritic.com/game/ds/cop-the-recruit", "publisher": "Ubisoft", "release_date": "Nov  3 2009", "developers": ["Velez & Dubail"], "platforms": "DS", "genres": ["Action", "Action Adventure", "General", "Modern", "Modern", "Open-World"], "meta_score": 55, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/3bc2a113a511947b46abab939441d4cc-98.jpg", "descriptions": "Dan Miles is a former underground street racer and new recruit in the Criminal Overturn Program (C.O.P.). Under the terms of the C.O.P., Dan has become a street detective working to protect New York citizens against large-scale threats. Working with his mentor, Detective Brad Winter, Dan isDan Miles is a former underground street racer and new recruit in the Criminal Overturn Program (C.O.P.). Under the terms of the C.O.P., Dan has become a street detective working to protect New York citizens against large-scale threats. Working with his mentor, Detective Brad Winter, Dan is investigating a series of terrorist attacks in the city when Brad is falsely arrested, putting the investigation on hold. While trying to uncover the truth behind Brad's arrest, Dan goes undercover and returns to his life on the streets. Little by little he gets wrapped up in a deadly, widespread conspiracy and must work to prevent a potentially catastrophic attack on the city. Experience the thrill of cruising the streets of New York City without any loading times! C.O.P. The Recruit is the most visually impressive game on the Nintendo DS, with an open-world 3D experience running at 60 frames per second (FPS). The game's innovative engine also allows for a wealth of detailed imagery, whether driving at 120 MPH or shooting your way through the gorgeous interior environments. C.O.P. The Recruit allows gamers to experience all aspects of being a police officer recruit with 60 missions and over 20 hours of diverse gameplay. Get behind the wheel of some of the fastest cars around, and use the stylus to shoot down enemies and spy on terrorists. Experience a bustling, vibrant New York City, complete with pedestrians on the street, cars rushing to avoid traffic, and boats navigating the surrounding waterways of Manhattan. Explore the 6 square miles of the city and experience a wide variety of environments and climate conditions. As a recruit, you have access to New York City's most powerful tools. Use your PDA to plan and launch a SWAT team assault through your DS system's microphone, set up road blocks, summon an ambulance, access the city's camera system to locate your targets, and much more. [Ubisoft]… Expand"}, {"name": "Sonic Riders", "details_link": "https://www.metacritic.com/game/playstation-2/sonic-riders", "publisher": "Sega", "release_date": "Feb 21 2006", "developers": ["Sonic Team"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 55, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/38b4876b4a534d8e29d763e8c9ee0023-98.jpg", "descriptions": "Developed by Sonic Teaem, Tokyo, Sonic Riders integrates Extreme sports, high-speed racing and head-to-head battles, offering a new racing experience with Sonic unlike any before in other racing games. In Sonic Riders, Dr. Eggman challenges Sonic and his friends to a Worldwide Grand Prix,Developed by Sonic Teaem, Tokyo, Sonic Riders integrates Extreme sports, high-speed racing and head-to-head battles, offering a new racing experience with Sonic unlike any before in other racing games. In Sonic Riders, Dr. Eggman challenges Sonic and his friends to a Worldwide Grand Prix, and the prize for coming out on top is an ultra-rare Chaos Emerald! Gliding on air boards – which are performance-oriented for each playable character – gamers experience a heightened sense of sports-style racing tension as Sonic and his pals perform tricks and stunts over treacherous wide-open terrain. [Sega]… Expand"}, {"name": "Shinobido 2: Revenge of Zen", "details_link": "https://www.metacritic.com/game/playstation-vita/shinobido-2-revenge-of-zen", "publisher": "Namco Bandai Games", "release_date": "Feb 21 2012", "developers": ["Acquire"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 55, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/7610b013fdea20173e2aee60f550e699-98.jpg", "descriptions": "Players will step into the role of Zen, a master ninja, through a thrilling dynamic storyline of betrayal and intrigue in Shinobido 2: Tales of the Ninja (working title)."}, {"name": "Thor: God of Thunder", "details_link": "https://www.metacritic.com/game/3ds/thor-god-of-thunder", "publisher": "Sega", "release_date": "Sep 13 2011", "developers": ["Red Fly Studio"], "platforms": ["PlayStation 3", "Xbox 360", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 55, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/4/130fb0e765324828d91a8a073f49fdd0-98.jpg", "descriptions": "Thor: The Video Game will take players through a spectacular, epic-scale original third-person adventure for which Matt Fraction, the Eisner Award-winning writer and lead Thor comic book author served as story consultant. In the game, Thor battles through the numerous worlds of NorseThor: The Video Game will take players through a spectacular, epic-scale original third-person adventure for which Matt Fraction, the Eisner Award-winning writer and lead Thor comic book author served as story consultant. In the game, Thor battles through the numerous worlds of Norse mythology that span realms ranging from primal worlds of fire and ice to extraordinary planets inhabited by Frost Giants and Trolls to save Asgard, the capital city of the Norse Gods. Thor must overcome monstrous foes lifted from the pages of the comics including Ulik, Ymir, and Surtur, as well as other monstrous denizens. Players will wield the iconic Mjolnir, Thorï¿½s legendary hammer, to fight enemies on an immense scale while controlling the elemental storm powers of lightning, thunder, and wind to vanquish enemies. As Thor earns Valor points through his exploits, players can acquire new abilities, powers, and weapon upgrades.… Expand"}, {"name": "Indiana Jones and the Staff of Kings", "details_link": "https://www.metacritic.com/game/wii/indiana-jones-and-the-staff-of-kings", "publisher": "LucasArts", "release_date": "Jun  9 2009", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "Wii"], "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 55, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/336865c46ae4162f2cb3c7f9afdd768f-98.jpg", "descriptions": "Step into the shoes of the legendary hero, Indiana Jones, in an all new epic adventure! Set in the year 1939, Indiana Jones and the Staff of Kings follows the rogue archaeologist on an all-new globe-trotting quest. From San Francisco's Chinatown to the lush jungles of Panama, Indy must useStep into the shoes of the legendary hero, Indiana Jones, in an all new epic adventure! Set in the year 1939, Indiana Jones and the Staff of Kings follows the rogue archaeologist on an all-new globe-trotting quest. From San Francisco's Chinatown to the lush jungles of Panama, Indy must use his whip, fists and wits to fight through ruthless opposition as he spars with his nemesis, Magnus Völler, in a race for a relic of biblical proportions - the Staff of Moses. Indiana Jones and the Staff of Kings features completely interactive environments, where players need to call upon their wits and daring to make each spring-loaded environment a weapon in order to dispense of foes in clever and unexpected ways. Also, embark upon thrilling action sequences that remain true to the spirit established in scenes such as Indy's pursuit of the motorcade in Raiders of the Lost Ark, the mine-cart scene in Indiana Jones and the Temple of Doom, and the free-for-all aboard the tank in Indiana Jones and the Last Crusade. Wield your Wii Remote like Indy’s signature whip for a variety of uses - from combat to navigation to puzzle-solving. Use your highly interactive Hot Set environments and your wits to defeat your enemies. Explore exotic locations around the globe in an all-new story that puts you on an epic quest for the Staff of Moses. Apply your smarts to navigate Indy through challenging terrains with the many maneuvers Indy can do with his whip. Engage in burst gunplay moments and use careful aim and the environment to take out enemies. Face overwhelming odds and escape signature run-for-your-life moments, like a daring escape from a collapsing temple, by matching fast-paced onscreen gesture prompts. Experience thrilling chases and control vehicles - fly a biplane in a canyon trench, take the reigns of a wild elephant through the streets of Istanbul and navigate a raft down a raging river. Cooperative gameplay mode allows you and a friend to brave the challenges in a variety of game modes in an entirely new quest with a familiar character never playable before in an Indy game. Unlock four-player versus mode where you and your friends go head-to-head in a real biplane combat or take on three of your friends in a free for all tank battle! Whether you are brawling baddies or wielding your whip, use the Wii Remote and Nunchuk as nature intended with the intuitive gesture-based combat system. Discover more than 20 artifacts and rewarding unlockables throughout the game. For those old-school gamers there is nothing better than unlocking the classic Indiana Jones and the Fate of Atlantis game on Wii! [LucasArts]… Expand"}, {"name": "Crimson Dragon", "details_link": "https://www.metacritic.com/game/xbox-one/crimson-dragon", "publisher": "Microsoft Game Studios", "release_date": "Nov 22 2013", "developers": ["Grounding Inc."], "platforms": "Xbox One", "genres": ["Shooter", "Rail", "Action", "Shooter", "Rail"], "meta_score": 55, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/06468eff8dc435cfb2697594b9aa24ed-98.jpg", "descriptions": "Many generations have passed since the human colonists of Planet Draco lost contact with Earth, and they have reached a fragile truce with the native dragons. Now they face the return of an old threat, a colossal destroyer known as the White Phantom. In Crimson Dragon, use Kinect to controlMany generations have passed since the human colonists of Planet Draco lost contact with Earth, and they have reached a fragile truce with the native dragons. Now they face the return of an old threat, a colossal destroyer known as the White Phantom. In Crimson Dragon, use Kinect to control your dragon and repel the violent enemy life forms. Teach your dragon new skills, and train it to become strong enough to face combat in harder missions. Bring your trained dragon online to take on missions in co-op.… Expand"}, {"name": "Dragon Ball Z: Ultimate Tenkaichi", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-ball-z-ultimate-tenkaichi", "publisher": "Namco Bandai Games", "release_date": "Oct 25 2011", "developers": ["Spike"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 55, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/f5b57cbd75123a0677e18924b4729e20-98.jpg", "descriptions": "The upcoming Dragon Ball Game Project is currently in development by Spike Co. Ltd., who are honing their considerable talents to create a new landmark game for the Dragon Ball Z franchise.  The game features upgraded environmental and character graphics, with designs drawn from the originalThe upcoming Dragon Ball Game Project is currently in development by Spike Co. Ltd., who are honing their considerable talents to create a new landmark game for the Dragon Ball Z franchise.  The game features upgraded environmental and character graphics, with designs drawn from the original manga series.  Destructible battle fields, including massive craters and ki energy blasts cutting across the sky deliver a more dynamic experience and immediate sense of urgency to the exhilarating fights.  An enhanced story mode drops players into the rich Dragon Ball Z universe, filled with beloved characters and powerful enemies. An accessible battle system allows gamers of all ages will be able to hold their own in fast-paced battles, while still retaining tactical depth for hardcore fans. … Expand"}, {"name": "Pokemon Channel", "details_link": "https://www.metacritic.com/game/gamecube/pokemon-channel", "publisher": "Nintendo", "release_date": "Dec  1 2003", "developers": ["Ambrella"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Adventure", "First-Person", "Fantasy"], "meta_score": 55, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/1dbe683e3ad643b411173bb1313c27ff-98.jpg", "descriptions": "For those who have always wished for more Pokémon programming on TV, here's a game that gives the Pokémon their own channel.  Pokémon Channel lets you spend some quality time with Pikachu watching loads of Pokémon-style shows, including a never-before-seenFor those who have always wished for more Pokémon programming on TV, here's a game that gives the Pokémon their own channel.  Pokémon Channel lets you spend some quality time with Pikachu watching loads of Pokémon-style shows, including a never-before-seen DVD-quality animated feature starring the popular Pichu Bros.  Identify Pokémon on Quiz Wobbuffet, exercise in Smoochum's Shape-up, and get the latest news from Psyduck and Meowth on Pokémon News Flash. Pokémon Channel also features collectible Nice Cards. … Expand"}, {"name": "X2: Wolverine's Revenge", "details_link": "https://www.metacritic.com/game/pc/x2-wolverines-revenge", "publisher": "Activision", "release_date": "Apr 15 2003", "developers": ["Livesay Technologies"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 55, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/49f022fbbe0aa7a81ed1cc885498dd20-98.jpg", "descriptions": "Decades ago, a secret orgainzation brainwashed you and implanted a virtually unbreakable adamantium skeleton into your body. Now, as Wolverine - the X-Men's most dangerous weapon - you've discovered you were also implanted with a deadly virus that will kill you within the next 48 hoursDecades ago, a secret orgainzation brainwashed you and implanted a virtually unbreakable adamantium skeleton into your body. Now, as Wolverine - the X-Men's most dangerous weapon - you've discovered you were also implanted with a deadly virus that will kill you within the next 48 hours unless the antidote is found. Your future at risk, you must return to confront your past in an adventure that will take you back to the place you dread most of all - Alkali Lake. Time is running out. [Activision]… Expand"}, {"name": "Surf Rocket Racers", "details_link": "https://www.metacritic.com/game/dreamcast/surf-rocket-racers", "publisher": "Crave", "release_date": "Feb 28 2001", "developers": ["CRI"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 55, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/f0da910f1f21c7a653a1f5d543c7a73e-98.jpg", "descriptions": "Surf Rocket Racers is what happens when a game developer takes a stock game formula and simply goes nowhere with it."}, {"name": "Elite: Dangerous - Odyssey", "details_link": "https://www.metacritic.com/game/pc/elite-dangerous---odyssey", "publisher": "Frontier Developments", "release_date": "Mar 29 2021", "developers": ["Frontier Developments"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Massively Multiplayer", "genres": ["Simulation", "Space", "Civilian"], "meta_score": 55, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/6/e3bfa95e57a8047c6b2981b310a6cda9-98.jpg", "descriptions": "In the 34th century, across the vast expanse of an epic, full-scale recreation of our Milky Way, interstellar rivalries flare as galactic superpowers fight proxy wars. Start with a small starship and a handful of credits, and do whatever it takes to earn the skill, knowledge, wealth andIn the 34th century, across the vast expanse of an epic, full-scale recreation of our Milky Way, interstellar rivalries flare as galactic superpowers fight proxy wars. Start with a small starship and a handful of credits, and do whatever it takes to earn the skill, knowledge, wealth and power to stand among the ranks of the iconic Elite.… Expand"}, {"name": "Othello", "details_link": "https://www.metacritic.com/game/switch/othello", "publisher": "Arc System Works", "release_date": "Mar 23 2017", "developers": ["Arc System Works"], "platforms": "Switch", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 55, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/1da0698c1b8db7f7078b4d567aeddd05-98.jpg", "descriptions": "The well-acclaimed board game for all ages, Othello, is now on Nintendo Switch! Play in the comfort of your home or outside, and play in a style that suits you best!\r A total of 16 levels of computer AI difficulty are available for single-player modes! Hints on where the stones can beThe well-acclaimed board game for all ages, Othello, is now on Nintendo Switch! Play in the comfort of your home or outside, and play in a style that suits you best!\r A total of 16 levels of computer AI difficulty are available for single-player modes! Hints on where the stones can be placed, and displays to show which tiles will be flipped in this move are also available to help new players understand the game better!\r Two-player mode is also available! Both players can play together on one Nintendo Switch by simply sharing the Joy-Con, or using the touch screen!\r Do play with your family and friends!… Expand"}, {"name": "Cube Life: Island Survival", "details_link": "https://www.metacritic.com/game/wii-u/cube-life-island-survival", "publisher": "Cypronia", "release_date": "Jun  4 2015", "developers": ["Cypronia"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 55, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/9b53b9f47eadaab22967bcc49824f7d8-98.jpg", "descriptions": "Cube Life: Island Survival is the first block building open-world survival game for the Nintendo Wii U.\r Imagine being stranded on a beautiful deserted island... All of life's necessities: Food, water, shelter - all of your everyday needs are now gone, and it's up to you to survive.Cube Life: Island Survival is the first block building open-world survival game for the Nintendo Wii U.\r Imagine being stranded on a beautiful deserted island... All of life's necessities: Food, water, shelter - all of your everyday needs are now gone, and it's up to you to survive. Cannibals and wild animals will not make it any easier on you. You'll need to explore, build, and craft to stay alive.\r In Creative Mode, the game will allow players to build constructions in 3D generated game worlds. There is no limit to your imagination.\r In Survival Mode, the player must maintain health, explore caves, gather resources, and craft tools on an unknown island. Get food, explore and build during the day. Hide, fight, and surive as night falls on the island.\r Current Feature:\r-Block building open-world\r-Creative Mode\r-Survival Mode\r-Day/Night cycles\r-Crafting\r-Trading\r-Local Inhabitants\r-200+ Items and Tools\r-Explosives\r-Wild animals\r-Realistic graphical effects\r-Optimized rendering 30+fps\r-Internet Rankings\r-Updates - the game will keep getting better and better!… Expand"}, {"name": "Medal of Honor: Warfighter", "details_link": "https://www.metacritic.com/game/playstation-3/medal-of-honor-warfighter", "publisher": "Electronic Arts", "release_date": "Oct 23 2012", "developers": ["Danger Close"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 20 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Historic", "Modern", "Arcade"], "meta_score": 55, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/7b69e763bc4a68c855ff086f368f3569-98.jpg", "descriptions": "Medal of Honor Warfighter is an up close and personal look at today's battlefield and the fight against the ongoing global terror threat."}, {"name": "300: March to Glory", "details_link": "https://www.metacritic.com/game/psp/300-march-to-glory", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb 27 2007", "developers": ["Collision Studios"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 55, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/c08980a4d1af51f1c0e9106ba97f1006-98.jpg", "descriptions": "In the action packed 300: March to Glory, players take on the role of King Leonidas, who leads the brave 300 Spartans against Xerxes and his massive Persian army. The player, as Leonidas, uses his sword, spear and shield and the power of the soldiers in a battle to determine the very fate ofIn the action packed 300: March to Glory, players take on the role of King Leonidas, who leads the brave 300 Spartans against Xerxes and his massive Persian army. The player, as Leonidas, uses his sword, spear and shield and the power of the soldiers in a battle to determine the very fate of western civilization. 300: March to Glory is a visceral experience focused on action and combat, allowing the player to fight both solo and in a phalanx alongside his fellow Spartans. [Warner Bros.]… Expand"}, {"name": "Cartoon Network Racing", "details_link": "https://www.metacritic.com/game/ds/cartoon-network-racing", "publisher": "The Game Factory", "release_date": "Dec  4 2006", "developers": ["Firebrand Games"], "platforms": ["PlayStation 2", "DS"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/dbd30c918f1db0eb151c7ca51eea3b15-98.jpg", "descriptions": "The First Annual Cartoon Network Racing Championship is up for grabs and the best-loved Cartoon Network stars -The Powerpuff Girls, Courage the Cowardly Dog, Cow and Chicken, I M Weasel, Johnny Bravo, and Dexter's Laboratory -- are revving up their engines to compete for the grand prize!The First Annual Cartoon Network Racing Championship is up for grabs and the best-loved Cartoon Network stars -The Powerpuff Girls, Courage the Cowardly Dog, Cow and Chicken, I M Weasel, Johnny Bravo, and Dexter's Laboratory -- are revving up their engines to compete for the grand prize! Players race as their favorite Cartoon Network stars in an attempt to be the first to cross the finish line and gain the highest popularity score through a wacky variety of colorful cartoon environments. The more successful the player is at winning races the more Toon Coins they will earn to unlock new characters and fun bonus games. This kart-style racing game incorporates fast game-play, hilarious sound effects and character Super Powers unique to the personalities of the Cartoon Network stars! Players select their favorite driver and they are ready to go. [The Game Factory]… Expand"}, {"name": "Rush", "details_link": "https://www.metacritic.com/game/psp/rush", "publisher": "Midway", "release_date": "Oct 30 2006", "developers": ["Midway Studios - Newcastle"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 55, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/3424e5b232832bd79d4c7c75b1fa68bc-98.jpg", "descriptions": "(Known as \"L.A. Rush\" in the UK/EU)  For the first time on the PSP system, attempt mad jumps, high-flying stunts and arcade-style racing from the newest entry in the RUSH franchise. Go head-to-head with a friend in a street race or cruise mission using wireless functionality, or experience(Known as \"L.A. Rush\" in the UK/EU)  For the first time on the PSP system, attempt mad jumps, high-flying stunts and arcade-style racing from the newest entry in the RUSH franchise. Go head-to-head with a friend in a street race or cruise mission using wireless functionality, or experience Story Mode which allows you to race through five Los Angeles city re-creations while finding treacherous shortcuts and surviving death-defying jumps. Exclusive to the PSP system is an all-new Stunt Arena, where players can fly over ramps and perform stunts in the air and drive the loop-de-loop to gain massive bursts of speed, all the while collecting golden tokens to unlock extra content. Feel the rush as you race more than 36 licensed rides including muscles, tuner and exotic vehicles. [Midway]… Expand"}, {"name": "Hot Pixel", "details_link": "https://www.metacritic.com/game/psp/hot-pixel", "publisher": "Atari", "release_date": "Oct  2 2007", "developers": ["zSlide"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 55, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/c6b4dcc27346fb36f67bf7c23696b003-98.jpg", "descriptions": "(Also known as \"HOT PXL\")  Hot Pixel follows Djon, a skateboarder, through a loosely structured central storyline which is packed with challenges--in the form of some 200 minigames, which require players to draw on their reflexes and 2D gaming prowess. The various obstacles Djon must(Also known as \"HOT PXL\")  Hot Pixel follows Djon, a skateboarder, through a loosely structured central storyline which is packed with challenges--in the form of some 200 minigames, which require players to draw on their reflexes and 2D gaming prowess. The various obstacles Djon must successfully negotiate include performing tricks on a BMX bike, stagediving at a punk-rock show, playing an in-game video game, and just trying to cross a busy digital street. HOT PXL's minigame library can be updated with downloads via the PSP's wireless Internet functionality.… Expand"}, {"name": "Hyperdimension Neptunia Victory", "details_link": "https://www.metacritic.com/game/playstation-3/hyperdimension-neptunia-victory", "publisher": "NIS America", "release_date": "Mar 21 2013", "developers": ["Idea Factory", "Compile Heart"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 55, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/ac1a7abe657746f11a54c35258a1bd6a-98.jpg", "descriptions": "Several years after preventing Arfoire's revival, Gamindustri has remained at peace without any major issues. The CPUs and their younger sisters have been enjoying their quiet lives for a while... Then one day, the CPU of Planeptune-Neptune-is sent to another dimension. This new dimensionSeveral years after preventing Arfoire's revival, Gamindustri has remained at peace without any major issues. The CPUs and their younger sisters have been enjoying their quiet lives for a while... Then one day, the CPU of Planeptune-Neptune-is sent to another dimension. This new dimension feels very much like her own...except it has only progressed to the Gamindustri of the 1980s. In this dimension, a group of villains calling themselves the \"Seven Sages\" are trying to create a world without CPUs. With help from her new friends, including that dimension's CPU of Planeptune-Plutia-Neptune begins her quest to protect a totally different Gamindustri in her brand-new adventure!… Expand"}, {"name": "Insecticide", "details_link": "https://www.metacritic.com/game/ds/insecticide", "publisher": "Gamecock Media Group", "release_date": "Mar 11 2008", "developers": ["Creat Studios"], "platforms": ["PC", "DS"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 55, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/251e02b4eb390fafa8d0832634fbb29f-98.jpg", "descriptions": "Insecticide is a hard-boiled, fast-shooting detective game set in a festering future city where bugs have evolved as the planet’s dominant race. A murder at the powerful Nectarola soft drink company leads police from the Insecticide Squad on a bug hunt through the city’s seedy underbelly,Insecticide is a hard-boiled, fast-shooting detective game set in a festering future city where bugs have evolved as the planet’s dominant race. A murder at the powerful Nectarola soft drink company leads police from the Insecticide Squad on a bug hunt through the city’s seedy underbelly, and into a mystery of epic proportions.  Join Detective Chrys Liszt and partner Roachy Caruthers on the case as they become entangled in a web of crime in this 3rd-person shooter/detective game.  It’s an action-adventure in the truest sense of the word, immersing players in cinematic combat levels, as well as a story-based detective investigation. Use Chrys’ unique insect abilities, a range of creative bug weaponry, and old-fashioned street smarts to solve the case and uncover a shocking secret, ultimately bringing the mighty boot of justice down hard on the city's infestation of crime. [Gamecock Media]… Expand"}, {"name": "You're in the Movies", "details_link": "https://www.metacritic.com/game/xbox-360/youre-in-the-movies", "publisher": "Codemasters", "release_date": "Nov 17 2008", "developers": ["Zoe Mode"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Videos", "Application"], "meta_score": 55, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/04eafcdc43c267d6b86063941e28069e-98.jpg", "descriptions": "You're in the Movies brings the cool factor to kitsch as you live out your dreams of becoming a scream queen, zombie, or kung fu fighter. Premiering exclusively on Xbox 360 this holiday season, it's the first and only game of its kind to transport players into a magical world of cinema mixedYou're in the Movies brings the cool factor to kitsch as you live out your dreams of becoming a scream queen, zombie, or kung fu fighter. Premiering exclusively on Xbox 360 this holiday season, it's the first and only game of its kind to transport players into a magical world of cinema mixed with the hilarious world of improvisation. Using the Xbox LIVE Vision camera, players' actions are captured and placed into short, riotous films that highlight the unique and often dubious acting talents of friends and family. Performances never end up on the cutting room floor and are never the same. With You're in the Movies, you're about to be a star - if only straight to DVD. Get ready for your close-up. [Microsoft]… Expand"}, {"name": "Half Past Fate: Romantic Distancing", "details_link": "https://www.metacritic.com/game/switch/half-past-fate-romantic-distancing", "publisher": "Way Down Deep", "release_date": "Feb 14 2021", "developers": ["Serenity Forge"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/4a0ba6f3c69476e5ba7c9e422f928660-98.jpg", "descriptions": "Finding true love is hard enough when it’s in person. When a pandemic puts the lockdown on a blooming relationship, will the new couple keep the romance alive, or will distance pull them apart? Cozy up with their quarantine story and see if they’ll find a way to stay connected in theFinding true love is hard enough when it’s in person. When a pandemic puts the lockdown on a blooming relationship, will the new couple keep the romance alive, or will distance pull them apart? Cozy up with their quarantine story and see if they’ll find a way to stay connected in the weirdest of times in this new episode of the Half Past Fate story.\r Features:\r- Learn to love from afar through the charismatic 3D pixel-art style of Half Past Fate\r- Enjoy a charming and honest slice-of-life story set in all-too-familiar circumstances\r- Play from both sides of the new relationship and see how each of your lives have changed\r- Judge (or admire) each other’s home decor, peculiar roommates, and musical tastes\r- Explore in endearing detail the intimate environs of each other’s quarantined lives\r- Maybe figure out what the heck “defragging” does… Expand"}, {"name": "Solo: Islands of the Heart", "details_link": "https://www.metacritic.com/game/switch/solo-islands-of-the-heart", "publisher": "Merge Games", "release_date": "Aug  1 2019", "developers": ["Team Gotham"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/660fd4a1573182fab2e937a12c2b5bda-98.jpg", "descriptions": "Love is a universal feeling, but each of us experiences it in a different way. Solo – Islands of the Heart explores the theme of love in an introspective way, allowing players to identify and reflect on their own experiences. The world is divided into archipelagos, with each islandLove is a universal feeling, but each of us experiences it in a different way. Solo – Islands of the Heart explores the theme of love in an introspective way, allowing players to identify and reflect on their own experiences. The world is divided into archipelagos, with each island representing a unique puzzle. Solving puzzles will award the player with a Sleeping Totem, awakening them to answer a question about love and relationships. As with love, most puzzles have no unique solution. Using boxes, each with different properties and behaviors, players can build their own paths to the Sleeping Totems on each island. Nature and contemplation are also a huge part of Solo: pull out your camera and capture the moment, play the guitar, feed the animals or just sit on a bench and think.… Expand"}, {"name": "Hoshigami: Ruining Blue Earth Remix", "details_link": "https://www.metacritic.com/game/ds/hoshigami-ruining-blue-earth-remix", "publisher": "Aksys Games", "release_date": "Jun 25 2007", "developers": ["Barnhouse Effect"], "platforms": "DS", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy", "Tactics"], "meta_score": 55, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/dfebe906a72a800c06d472c95fb9c105-98.jpg", "descriptions": "On the floating continent of Mardias, a war has broken out between the Kingdoms of Valaim and Nightweld that threatens to upset the balance of power in the land. Our hero, Fazz, and his ragtag band of mercenaries are thrust into the fight and are hired to protect one of the Ruins of IxiaOn the floating continent of Mardias, a war has broken out between the Kingdoms of Valaim and Nightweld that threatens to upset the balance of power in the land. Our hero, Fazz, and his ragtag band of mercenaries are thrust into the fight and are hired to protect one of the Ruins of Ixia from the Valamian forces. Unbeknownst to them, an insidious evil begins to rise from the shadows...  Will Fazz be able to stop it before Mardias destroyed? Experience the world of Hoshigami like never before. Hoshigam Remix also features a brand new character, missions, music, character art, as well as a new localization. Novice tactician or battle-hardened veteran? Select from three different difficulty levels and tailor the game to your skill. Immerse yourself in battle with an enhanced user interface. Issue strategic commands quickly and efficiently with a revised, streamlined interface and optional stylus control. Trade special items with your friends. Be a power player and jumpstart your friends’ games with super weapons, armor and spells. [Aksys Games]… Expand"}, {"name": "Naruto: Ninja Council 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/naruto-ninja-council-2", "publisher": "D3", "release_date": "Oct  4 2006", "developers": ["Aspect"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 55, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/14ce2675bad70dff7ed616129c315db5-98.jpg", "descriptions": "The hit series on Cartoon Network is back for more on Nintendo Game Boy Advance with NARUTO: Ninja Council 2! Delivering solid side-scrolling, vertical or horizontal ninja action for 1-4 players the students of Kakashi are being challenged to become the greatest ninjas in the village. NarutoThe hit series on Cartoon Network is back for more on Nintendo Game Boy Advance with NARUTO: Ninja Council 2! Delivering solid side-scrolling, vertical or horizontal ninja action for 1-4 players the students of Kakashi are being challenged to become the greatest ninjas in the village. Naruto and his teammates are determined. With every new survival challenge thrown at them, they must decide who is best suited for the battle and use teamwork to make it past the toughest of enemies. The spontaneous bravery of Naruto isn't always the best choice; sometimes it requires the consistent skills of Sasuke, or the smarts of Sakura. Now, players can switch from any of the three teammates on the fly and call in their friends for help. The opponents are fiercer than before and have special powers that Naruto and his friends could only imagine. Are they ready for this test? Believe it!… Expand"}, {"name": "The Bradwell Conspiracy", "details_link": "https://www.metacritic.com/game/xbox-one/the-bradwell-conspiracy", "publisher": "A Brave Plan", "release_date": "Oct 11 2019", "developers": ["Bossa Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 55, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/a3faeb27564394a300890b98e9766e47-98.jpg", "descriptions": "Following a sudden explosion at the Stonehenge Museum fundraiser, you find yourself trapped in a hidden underground complex. Faced with a series of puzzles, your only means of escape is by sending photographs of your surroundings to another survivor confined elsewhere. But before long, aFollowing a sudden explosion at the Stonehenge Museum fundraiser, you find yourself trapped in a hidden underground complex. Faced with a series of puzzles, your only means of escape is by sending photographs of your surroundings to another survivor confined elsewhere. But before long, a disturbing truth begins to dawn…… Expand"}, {"name": "Topatoi: Spinning Through The Worlds", "details_link": "https://www.metacritic.com/game/playstation-3/topatoi-spinning-through-the-worlds", "publisher": "Boolat Games", "release_date": "Oct 15 2009", "developers": ["Boolat Games"], "platforms": "PlayStation 3", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 55, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/4/1f9eb123db50b09328de04c68fdb93cd-98.jpg", "descriptions": "[Playstation Network; Known as \"Topatoi: The Great Tree Story\" in the UK/EU] Raph, a brave explorer, and his companions have crash-landed in a mysterious corner of a strange planet. Now Raph must hunt for the spare parts needed to fix their skyship - and save his girlfriend too. Fortunately,[Playstation Network; Known as \"Topatoi: The Great Tree Story\" in the UK/EU] Raph, a brave explorer, and his companions have crash-landed in a mysterious corner of a strange planet. Now Raph must hunt for the spare parts needed to fix their skyship - and save his girlfriend too. Fortunately, our hero has access to the amazing GEMMA - the 'Gyroscopic Exploration Multidimensional Multiterrain Apparatus'. It's a small explorer vehicle that works like a spinning top - which is perfect for the crazy part of the world our characters are trapped in. Controlling GEMMA needs some practice. It's spin needs to be controlled carefully, as the degree of spin - and therefore its overall speed - directly affects its movement and behaviour. GEMMA can also be upgraded with special abilities to help you on your journey, too. Sounds like a solid platform/puzzler, don't you think? [Boolat]… Expand"}, {"name": "Sniper: Ghost Warrior", "details_link": "https://www.metacritic.com/game/pc/sniper-ghost-warrior", "publisher": "City Interactive", "release_date": "Jun 24 2010", "developers": ["City Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 55, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/c8e6cc50d8b8f85b3f2d0cbefc840ed6-98.jpg", "descriptions": "The democratic government of Isla Trueno has been overthrown and a military regime comes into power. The country becomes a theatre of influence war. You are sent as one of the covert commandos to support the rebels fighting their oppressor. [City Interactive]"}, {"name": "Gryphon Knight Epic", "details_link": "https://www.metacritic.com/game/pc/gryphon-knight-epic", "publisher": "Cyber Rhino Studios", "release_date": "Aug 20 2015", "developers": ["Cyber Rhino Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 55, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/d5dd041e3f5aa3c6e9257b4450965754-98.jpg", "descriptions": "Gryphon Knight Epic is a 2D Medieval Shoot’em up currently in development for Windows, MAC & Linux. Mixing elements from classical shoot’em ups, exploration and duel-like boss battles, it tells the story of Sir Oliver and Áquila, an accomplished knight and his loyal gryphon that are forcedGryphon Knight Epic is a 2D Medieval Shoot’em up currently in development for Windows, MAC & Linux. Mixing elements from classical shoot’em ups, exploration and duel-like boss battles, it tells the story of Sir Oliver and Áquila, an accomplished knight and his loyal gryphon that are forced back to adventure once again.Sir Oliver have already defeated a dragon, married a princess and saved the kingdom. But during his quest he will face adversaries he never imagined he would, because… in reality all of them were once friends. What happened? These heroes would never go rogue… and all at once? Something is rotten in the kingdom and its up to Oliver discover what.… Expand"}, {"name": "Ninjamurai", "details_link": "https://www.metacritic.com/game/psp/ninjamurai", "publisher": "Open Emotion Studios", "release_date": "Jul  5 2011", "developers": ["Open Emotion Studios"], "platforms": "PSP", "genres": ["Action", "General", "General"], "meta_score": 55, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/3/053f3d3fd36ec8f40a3640a7b3207599-98.jpg", "descriptions": "In Ninjamurai, the player assumes the role of Takezou Nishimura (Also\rknown as The Ninjamurai), a young warrior who is the offspring of a\runion between a Female Ninja and a male Samurai.  Rejected by both\r\nsides and looked down on as a kind of a mongrel breed, Takezou can be\r\nimpulsive dueIn Ninjamurai, the player assumes the role of Takezou Nishimura (Also\rknown as The Ninjamurai), a young warrior who is the offspring of a\runion between a Female Ninja and a male Samurai.  Rejected by both\rsides and looked down on as a kind of a mongrel breed, Takezou can be\rimpulsive due to his age and often has a cocky attitude. He does\rhowever have a good heart and a desire to help others. He is the most\rskilled warrior in his mountain shrine where he was raised by a man\rnamed Oro Sensei. After many years of training, Takezou is tasked with\rgoing into the nearby city and doing some recon.  When he gets to the\rcity he realizes something is amiss. It is overrun with Black Armor\rMilitia and Takezou sets about destroying the Black Armor presence in\rthe city. He meets a Black Armor commander named Bedros Majima, who\rinforms him that the Black Armor was responsible for the murder of his\rparents.… Expand"}, {"name": "Space Hulk: Deathwing", "details_link": "https://www.metacritic.com/game/playstation-4/space-hulk-deathwing", "publisher": "Focus Home Interactive", "release_date": "May 22 2018", "developers": ["Streum On Studio"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 55, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/ea10637a164c336c59295a62d1ef66dc-98.jpg", "descriptions": "Space Hulk: Deathwing is a First-Person Shooter experience based on Games Workshop's classic Space Hulk boardgame set in the universe of Warhammer 40,000. Space Hulk: Deathwing was developed on Unreal Engine 4, and offers you and up to three of your friends the chance to experience aSpace Hulk: Deathwing is a First-Person Shooter experience based on Games Workshop's classic Space Hulk boardgame set in the universe of Warhammer 40,000. Space Hulk: Deathwing was developed on Unreal Engine 4, and offers you and up to three of your friends the chance to experience a desperate battle against Genestealers in the claustrophobic tunnels of a Space Hulk. You also gain skills, new abilities, and new equipment as you earn experience during missions.Space Hulks drift along the currents of the Warp, the immaterial dimension of Chaos. Made up of gigantic, mangled asteroids, ship wrecks, and other stellar debris, they can grow to the size of a moon, and often contain treasured and ancient lost technologies. They are often also infested with broods of the lethal Genestealer.In the game you take on the role of a Space Marine from one of the most secret and most feared Space Marine forces: the Deathwing of the Dark Angels Chapter.As a Librarian, you can also master the destructive powers of the Psykers. Your skills and performance in battle grant you Fervor Points to spend on 3 skill trees, allowing you to improve your abilities and unlock new powers.Don your Terminator armour and arm yourself with the iconic weaponry of the Space Marines and face the threats that await you in the Space Hulk.Key Features* Take on the role of a Space Marine Terminator from the most secret and feared Deathwing.* Plunge into the claustrophobic tunnels of a Space Hulk. and experience a desperate battle against the Genestealers.* Unlock new abilities through 3 skill trees.* Grow in power and weild devastating weapons.* Coop mode: play with your friends as a Terminator squad in an epic coop mode… Expand"}, {"name": "Monochroma", "details_link": "https://www.metacritic.com/game/pc/monochroma", "publisher": "Nowhere Studios", "release_date": "May 28 2014", "developers": ["Nowhere Studios"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 55, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/dceb27556c35bad1c6edd22ae5357046-98.jpg", "descriptions": "Monochroma is a cinematic puzzle platformer that takes place in an industrial-alchemic setting. It's about being a child, having a little brother, growing up, falling down and solving some puzzles."}, {"name": "Shrek 2", "details_link": "https://www.metacritic.com/game/pc/shrek-2", "publisher": "Activision", "release_date": "May  3 2004", "developers": ["KnowWonder"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 55, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/f6c5ad8ba4d5f86d559b31fb5257e4b2-98.jpg", "descriptions": "This sequel takes you deeper into the world of Shrek and his friends. Enjoy rich, colorful scenery and events from the movie that bring these funny and enjoyable characters to life. Learn the attributes of each character's personality, attacks and abilities to progress through anThis sequel takes you deeper into the world of Shrek and his friends. Enjoy rich, colorful scenery and events from the movie that bring these funny and enjoyable characters to life. Learn the attributes of each character's personality, attacks and abilities to progress through an action-packed quest. Play as Shrek or choose from 10 other characters. Switch between four rotating characters instantly to utilize each character's special skills and attributes. Live out key moments from the movie and discover never-before-seen locations and characters. Go on special mini quests that highlight specific characters. Play with up to three friends at a time who can enter or leave the game with no interruption to your adventure.… Expand"}, {"name": "RLH: Run Like Hell", "details_link": "https://www.metacritic.com/game/xbox/rlh-run-like-hell", "publisher": "Interplay", "release_date": "Apr  9 2003", "developers": ["Digital Mayhem"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 55, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/717d405c365f227bb4a853214414cb3b-98.jpg", "descriptions": "Run Like Hell™ is a third-person action-adventure game designed to maximize the power of Xbox® technology. You take on the role of Nick Connor, a military hero exiled to a desolate mining station in deep space. Returning from a routine mission, Nick finds nearly everyone on theRun Like Hell™ is a third-person action-adventure game designed to maximize the power of Xbox® technology. You take on the role of Nick Connor, a military hero exiled to a desolate mining station in deep space. Returning from a routine mission, Nick finds nearly everyone on the station either dead or dying, wiped out by a vicious and intelligent alien race.… Expand"}, {"name": "Totaled!", "details_link": "https://www.metacritic.com/game/xbox/totaled!", "publisher": "Majesco Games", "release_date": "Jul 29 2002", "developers": ["Rage Software"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Driving", "Car Combat"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/4f925e37b7fbdd4c3312ea232ee20f0a-98.jpg", "descriptions": "Totaled! takes you for a ride in a destructive racing experience. In one of 12 cars, including hot rods, muscle, and performance cars, you must inflict as much damage on other cars as possible. Both the outer shell of each car (windows, hood, fenders, doors) and the chassis underneath canTotaled! takes you for a ride in a destructive racing experience. In one of 12 cars, including hot rods, muscle, and performance cars, you must inflict as much damage on other cars as possible. Both the outer shell of each car (windows, hood, fenders, doors) and the chassis underneath can sustain damage that affects the car's performance. You can compete in 18 customizable game types and challenges, including Free for All, Stuntman, Multi-Tag, and Bus Jumping.… Expand"}, {"name": "Frogger Advance: The Great Quest", "details_link": "https://www.metacritic.com/game/game-boy-advance/frogger-advance-the-great-quest", "publisher": "Konami", "release_date": "May 26 2002", "developers": ["KCEA"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 55, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/45692f2554554e7e47a9f90a656453ec-98.jpg", "descriptions": "We've come a long way from helping a frog cross a busy freeway in the original Frogger.  In Frogger Advance: The Great Quest, you take the persistent Frogger on-land and underwater, dodging a barrage of dangerous obstacles.  Frogger's side-stepping and jumping moves haven't failed him yet,We've come a long way from helping a frog cross a busy freeway in the original Frogger.  In Frogger Advance: The Great Quest, you take the persistent Frogger on-land and underwater, dodging a barrage of dangerous obstacles.  Frogger's side-stepping and jumping moves haven't failed him yet, and you'll need them to battle gigantic beetles, dragons, and a slew of fierce creatures.  As a reward for your efforts, you get to be united with the princess of your dreams.… Expand"}, {"name": "Legends of Wrestling", "details_link": "https://www.metacritic.com/game/playstation-2/legends-of-wrestling", "publisher": "Acclaim", "release_date": "Dec  3 2001", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1-5 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 55, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/ba6d2c4be99c2876c4e66dcf3ae4b3c4-98.jpg", "descriptions": "The names speak for themselves: Hulk Hogan, Bret \"Hitman\" Hart, Jerry \"The King\" Lawler, Rob Van Dam, Terry Funk, The Road Warriors, Jimmy \"Superfly\" Snuka , Ricky \"The Dragon\" Steamboat, Ted DiBiase, The Iron Sheik, \"King Kong\" Bundy, and George \"The Animal\" Steele, just to name a few."}, {"name": "SportsBarVR", "details_link": "https://www.metacritic.com/game/playstation-4/sportsbarvr", "publisher": "Cherry Pop Games", "release_date": "Oct 18 2016", "developers": ["Cherry Pop Games", "Perilous Orbit"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Sports", "General"], "meta_score": 55, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/0b5339323faca8abf5a4d797f8e3e449-98.jpg", "descriptions": "At launch, the game features: Pool, Darts, Air Hockey, Skeeball, Shuffleboard, Chess and Checkers."}, {"name": "Bright Memory", "details_link": "https://www.metacritic.com/game/xbox-series-x/bright-memory", "publisher": "Playism", "release_date": "Nov 10 2020", "developers": ["FYQD Personal Studio"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 55, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/7/96f11266e423408fad438a1e37d01865-98.jpg", "descriptions": "Bright Memory is a lightning-fast fusion of the FPS and action genres, created by one-man development studio FYQD using Unreal Engine. Combine a wide variety of skills and abilities to unleash dazzling combo attacks. SRO (Supernatural Science Research Organization) agent Shelia's adventureBright Memory is a lightning-fast fusion of the FPS and action genres, created by one-man development studio FYQD using Unreal Engine. Combine a wide variety of skills and abilities to unleash dazzling combo attacks. SRO (Supernatural Science Research Organization) agent Shelia's adventure is about to begin.\r This game depicts the maiden adventure of a woman named Shelia in the year 2020.\r The 1000-year-old relic swords known as \"Kanshou and Bakuya\", discovered through SRO research, have been found to comprise a unique multilayered structure, containing a mysterious substance in their cores. This substance, known as the \"Soul of Jiu Xuan\", possesses the ability to reanimate the dead. In an attempt to take possession of the substance, the \"SAI\" - a massive terrorist organization controlling its own army - has used a cutting-edge piece of technology known as a \"Quantum Transporter\" to infiltrate the SRO research facility and steal top-secret and incredibly dangerous data. To make matters worse, while attempting to calibrate coordinates on the Quantum Transporter, Shelia mistakenly activates the device, immediately transporting everyone in the vicinity to the Floating Island - an airborne continent near the North Pole, undisturbed in its slumber for over 1000 years. It is soon discovered that the various beasts and corpses of those who once populated the island have been reanimated by the \"Soul of Jiu Xuan\", and they're coming for Shelia...\r Shelia: Hannah Grace\rThe female main character. 21 years old. Her parents were in the military. After losing both parents in a sudden tragic accident at the age of six, she was raised by Professor Richard Carter, founder of the SRO. Having spent years undergoing various types of military training and shining among her peers in virtually every field, her near-superhuman abilities landed her a spot as a member of the ultra-elite \"SRO Emergency Inspection Team\".\r Carter: Jack Merluzzi\rFounder of the SAI. Male, 35 years old. Taking advantage of his influential status, he struck it rich by buying and selling vast numbers of ancient artifacts on the black market. After learning of the existence of the \"Soul of Jiu Xuan\", he immediately infiltrated the SRO in an attempt to steal top-secret data.… Expand"}, {"name": "The Assembly", "details_link": "https://www.metacritic.com/game/pc/the-assembly", "publisher": "nDreams", "release_date": "Jul 19 2016", "developers": ["nDreams"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General"], "meta_score": 55, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/0677037caa4923d361644b15c219cd8e-98.jpg", "descriptions": "A mysterious organisation known solely as the Assembly has been conducting secret experiments underground, their astonishing breakthroughs only made possible by operating outside government scrutiny and society’s morals. But what is the Assembly hiding?  How far will it go to keep itsA mysterious organisation known solely as the Assembly has been conducting secret experiments underground, their astonishing breakthroughs only made possible by operating outside government scrutiny and society’s morals. But what is the Assembly hiding?  How far will it go to keep its existence buried?  And what will it sacrifice in the pursuit of progress? Now, a chain of events threatens to expose this shadowy group.  Play as two individuals – each with their own motivations – and discover the mysteries of the Assembly’s facility through contrasting perspectives.  Make tough decisions, overcome trials and shake the foundations of this enigmatic collective.  Will your actions and their future repercussions save lives, or lead to catastrophe? The Assembly is a first-person interactive drama for mature audiences, created from the ground up for virtual reality headsets.  An experience with two sides to everything, where the truth is never clear, and a question is always left open: When does the end justify the means? The Assembly is a long-form, narrative-driven game designed from the ground up for your VR headset.  Freely explore intricate, realistic environments with intuitive, accessible movement controls as virtual reality immerses you within a game and its world. [nDreams]… Expand"}, {"name": "Ghostbusters: The Video Game", "details_link": "https://www.metacritic.com/game/ds/ghostbusters-the-video-game", "publisher": "Atari", "release_date": "Jun 16 2009", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 55, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/d64332d5b9b9e33638e7b721f4fa901c-98.jpg", "descriptions": "The Ghostbusters are back in an all new story penned by the original creators. With Manhattan newly overrun by ghosts and other supernatural creatures, it's up to you to take on the role of a new recruit joining the original film cast of the famous Ghostbusters team. Equipped with a varietyThe Ghostbusters are back in an all new story penned by the original creators. With Manhattan newly overrun by ghosts and other supernatural creatures, it's up to you to take on the role of a new recruit joining the original film cast of the famous Ghostbusters team. Equipped with a variety of unique weapons and gadgets, you will hunt, fight and capture a wide range of uncanny phantasms and demons in an all new funny and frightening battle to save New York City from its latest paranormal plague. To deliver a special gaming experience to the tremendous Ghostbusters’ fan base around the world, the game features the original film cast from the classic Ghostbusters films, Bill Murray, Dan Aykroyd, Harold Ramis, and Ernie Hudson, back again for the first time in more than 20 years. Supporting the ghost busting crew are the talents of Annie Potts, Brian Doyle Murray and William Atherton. [Sierra Entertainment]… Expand"}, {"name": "Trioncube", "details_link": "https://www.metacritic.com/game/ds/trioncube", "publisher": "Namco Bandai Games America", "release_date": "Feb 20 2007", "developers": ["Bandai Namco Games"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/03169ee9d6f70e555ff859646f72bd59-98.jpg", "descriptions": "In Trioncube, the player must embark on a journey across eight planets into the depths of space, as the captain of the mighty space ship Penko, to rescue the princess from the grasp of Hell Metal. Players reach this goal by creating a Trioncube – a series of 3x3 blocks, which start a chainIn Trioncube, the player must embark on a journey across eight planets into the depths of space, as the captain of the mighty space ship Penko, to rescue the princess from the grasp of Hell Metal. Players reach this goal by creating a Trioncube – a series of 3x3 blocks, which start a chain reaction that refuels the space ship. Try to create as big a chain as you can before time runs out and the Trioncube is broken. The bigger the chain you make, the farther distance your ship travels. Featuring four gameplay modes (Arcade, Story, Endless and Vs) Trioncube will provide endless fun for even the most seasoned puzzler. Unlike your typical puzzler where players try to quickly erase as many blocks as possible, Trioncube will have players at the edge of their seats as they try to create the ultimate 3x3 chain in a new type of thrilling puzzle experience. As they progress through the game, players will have to use different strategies to deal with new shapes in order to create the ultimate chain. Players will be able to collect coins as they create the Trioncube chain and purchase various unique Effects and Arts - like sushi rolls, dogs and tambourines jumping out of the Trioncube – as they travel the galaxy in their Penko. [Namco Bandai Games]… Expand"}, {"name": "Fist of the North Star: Ken's Rage 2", "details_link": "https://www.metacritic.com/game/xbox-360/fist-of-the-north-star-kens-rage-2", "publisher": "Koei Tecmo Games", "release_date": "Feb  5 2013", "developers": ["Koei"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 55, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/05306a81a1c77fdafe72c0678c15d142-98.jpg", "descriptions": "The collaboration between the popular action manga Fist of the North Star and the Warriors series returns, promising a stronger punch and more exploding action than before. Fist of the North Star: Ken's Rage 2 follows the storyline of the entire manga and offers players a variety of modesThe collaboration between the popular action manga Fist of the North Star and the Warriors series returns, promising a stronger punch and more exploding action than before. Fist of the North Star: Ken's Rage 2 follows the storyline of the entire manga and offers players a variety of modes and new features.… Expand"}]