[
  {
    "name": "Ninja Gaiden Black",
    "details_link": "https://www.metacritic.com/game/xbox/ninja-gaiden-black",
    "publisher": "Tecmo",
    "release_date": "Sep 20 2005",
    "developers": [
      "Team Ninja"
    ],
    "platforms": "Xbox",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 94,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/3/cc3c4a429beebd343556da429b0ce893-98.jpg",
    "descriptions": "In Ninja Gaiden Black you can reprise the role of Ryu Hayabusa, ninja extraordinaire. This sequel to Ninja Gaiden supplies a new story and new missions, plus two more difficulty settings and cinematic cut scenes that provide background about the protagonist. Ninja Gaiden Black alsoIn Ninja Gaiden Black you can reprise the role of Ryu Hayabusa, ninja extraordinaire. This sequel to Ninja Gaiden supplies a new story and new missions, plus two more difficulty settings and cinematic cut scenes that provide background about the protagonist. Ninja Gaiden Black also incorporates the additional content from Hurricane Packs 1 and 2 and includes unlockable content such as the original arcade version of Ninja Gaiden. Ninja Gaiden Black includes online features for keeping track of karma points on the online leader board.… Expand"
  },
  {
    "name": "The Elder Scrolls IV: Oblivion",
    "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-iv-oblivion",
    "publisher": "2K Games",
    "release_date": "Mar 20 2006",
    "developers": [
      "Bethesda Softworks",
      "Bethesda Game Studios"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 94,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/9/eff7141d6f5211ebdc3872217388fc55-98.jpg",
    "descriptions": "Oblivion is a single-player game that takes place in Tamriel's capital province, Cyrodiil. You are given the task of finding the hidden heir to a throne that sits empty, the previous emperor having been killed by an unknown assassin. With no true Emperor, the gates to Oblivion (theOblivion is a single-player game that takes place in Tamriel's capital province, Cyrodiil. You are given the task of finding the hidden heir to a throne that sits empty, the previous emperor having been killed by an unknown assassin. With no true Emperor, the gates to Oblivion (the equivalent of hell in the world of Tamriel) open, and demons begin to invade Cyrodiil and attack its people and towns. It's up to you to find the lost heir to the throne and unravel the sinister plot that threatens to destroy all of Tamriel. In keeping with the Elder Scrolls tradition, players have the option to experience the main quest at their own pace, and there are plenty of opportunities to explore the vast world and make your own way. Numerous factions can be joined, such as the thieves or mages guilds, and each contains its own complete storyline and the chance to rise to the head of the faction and reap further rewards. Oblivion features a groundbreaking new AI system, called Radiant AI, which gives non-player characters (NPCs) the ability to make their own choices based on the world around them. They decide where to eat or who to talk to and what they say. They sleep, go to church, and even steal items, all based on their individual characteristics. Full facial animations and lip-synching, combined with full speech for all dialog, allows NPCs to come to life like never before. [Bethesda]… Expand"
  },
  {
    "name": "Elden Ring",
    "details_link": "https://www.metacritic.com/game/pc/elden-ring",
    "publisher": "Bandai Namco Games",
    "release_date": "Feb 25 2022",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 94,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/8/0120618b1197a58226bfc36b63b14a02-98.jpg",
    "descriptions": "A New World Created By Hidetaka Miyazaki And George R. R. Martin. ELDEN RING, developed by FromSoftware, Inc. and BANDAI NAMCO Entertainment Inc., is a fantasy action-RPG adventure set within a world created by Hidetaka Miyazaki creator of the influential DARK SOULS video game series; andA New World Created By Hidetaka Miyazaki And George R. R. Martin. ELDEN RING, developed by FromSoftware, Inc. and BANDAI NAMCO Entertainment Inc., is a fantasy action-RPG adventure set within a world created by Hidetaka Miyazaki creator of the influential DARK SOULS video game series; and George R.R. Martin author of The New York Times best-selling fantasy series, A Song of Ice and Fire. Danger and discovery lurk around every corner in FromSoftware's largest game to-date.  Hidetaka Miyazaki, President and Game Director of FromSoftware Inc. Known for directing critically-acclaimed games in beloved franchises including Armored Core, Dark Souls, and Sekiro: Shadows Die Twice.  George R.R. Martin is the #1 New York Times bestselling author of many novels, including the acclaimed series A Song of Ice and Fire - A Game of Thrones, A Clash of Kings, A Storm of Swords, A Feast For Crows, and A Dance with Dragons. As a writer-producer, he has worked on The Twilight Zone, Beauty and the Beast, and various feature films and pilots that were never made.… Expand"
  },
  {
    "name": "Street Fighter IV",
    "details_link": "https://www.metacritic.com/game/playstation-3/street-fighter-iv",
    "publisher": "Capcom",
    "release_date": "Feb 17 2009",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "2  Online",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 94,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/5/ecb950b6c2f06b9ef1ca03876eb297bf-98.jpg",
    "descriptions": "Street Fighter IV features a mix of returning favourites such as Ryu, Ken, Chun-Li and Guile along with new characters created exclusively for this game such as Crimson Viper, Abel, El Fuerte, and Rufus. Characters and environments are rendered in high definition 3D, while the game is playedStreet Fighter IV features a mix of returning favourites such as Ryu, Ken, Chun-Li and Guile along with new characters created exclusively for this game such as Crimson Viper, Abel, El Fuerte, and Rufus. Characters and environments are rendered in high definition 3D, while the game is played in the classic Street Fighter 2D perspective with additional 3D camera flourishes. Six-button controls for the game return, with a host of new special moves and features integrated into the input system. Street Fighter IV also incorporates state of the art online match making and worldwide online gameplay. Mixing classic genre-defining game mechanics the franchise is known and loved for with all-new, never-before-seen gameplay systems, Street Fighter IV brings a brand new fighting game to fans the world over. With the inclusion of Capcom's latest advancements in new generation technology, Street Fighter IV promises to deliver an extraordinary experience that will re-introduce the world to the time-honoured art of virtual martial arts. New special moves that go beyond any Street Fighter fan's wildest imagination, including Focus attacks, Super Combos, and the revenged-fueled Ultra Combo system. Classic Street Fighter characters recreated for a new generation of gamers, including the original cast of Street Fighter II. New brawlers: female super-spy Crimson Viper, lucha libre wrestler El Fuerte, mixed martial artist Abel and more. New gameplay elements provide new challenges for both newcomers and the most seasoned Street Fighter pro. Online gameplay features, including instantaneous online challenges, versus mode, tournament mode, and world wide online gameplay. [Capcom]… Expand"
  },
  {
    "name": "Super Mario Advance 4: Super Mario Bros. 3",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/super-mario-advance-4-super-mario-bros-3",
    "publisher": "Nintendo",
    "release_date": "Oct 21 2003",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 94,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/8/93cab3b35e23b4443e27bdd09cd0f10e-98.jpg",
    "descriptions": "A combination of exciting platforming action, wild power-ups, and charming Mario style has made Super Mario Bros. 3 a classic.  With Super Mario Advance 4: Super Mario Bros. 3, you have your chance to partake in the special adventure anywhere you go on your Game Boy Advance.  Your mission isA combination of exciting platforming action, wild power-ups, and charming Mario style has made Super Mario Bros. 3 a classic.  With Super Mario Advance 4: Super Mario Bros. 3, you have your chance to partake in the special adventure anywhere you go on your Game Boy Advance.  Your mission is to rescue the Mushroom Kingdom monarchs who have been transformed into animals by Bowser and his mischievous offspring, and in the process save the princess kidnapped by Bowser.  Traverse eight huge worlds and encounter fun minigames and frantic boss battles as you explore the first Mario game to use an overworld map.  … Expand"
  },
  {
    "name": "Jet Grind Radio",
    "details_link": "https://www.metacritic.com/game/dreamcast/jet-grind-radio",
    "publisher": "Sega",
    "release_date": "Oct 30 2000",
    "developers": [
      "Smilebit"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 94,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/8/89817a60cf25748d318d11543a7fdc6b-98.jpg",
    "descriptions": "Join a graffiti crew, stamp your territory and protect it from rival taggers, but watch out for the angry cops!"
  },
  {
    "name": "Metal Gear Solid",
    "details_link": "https://www.metacritic.com/game/playstation/metal-gear-solid",
    "publisher": "Konami",
    "release_date": "Oct 21 1998",
    "developers": [
      "KCEJ"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 94,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/ba0a2b52b9ea87bc06713f98e895545a-98.jpg",
    "descriptions": "You are Snake, a government agent on a mission to regain control of a secret nuclear weapons base from terrorist hands. Lightly armed and facing an army of foes, Snake must avoid firefights in order to survive. If Snake can locate them he can utilize advanced hardware, ranging from silencedYou are Snake, a government agent on a mission to regain control of a secret nuclear weapons base from terrorist hands. Lightly armed and facing an army of foes, Snake must avoid firefights in order to survive. If Snake can locate them he can utilize advanced hardware, ranging from silenced pistols to ground-to-air missiles. Enemies react to sight and sound - so stay quiet and stay in the shadows. State-of-the-art graphics: textures, transparencies, models and explosions. Taut, gripping story with multiple endings - a truly cinematic experience.… Expand"
  },
  {
    "name": "Grim Fandango",
    "details_link": "https://www.metacritic.com/game/pc/grim-fandango",
    "publisher": "LucasArts",
    "release_date": "Oct 14 1998",
    "developers": [
      "LucasArts"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "General",
      "3D",
      "Third-Person",
      "Fantasy"
    ],
    "meta_score": 94,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/2/c3ac5d8edcc4d201cb9e92ad8903d9a5-98.jpg",
    "descriptions": "Something's rotten in the Land of Dead and you're being played for a sucker.  Meet Manny Calavera, travel agent at the Department of Death. He sells luxury packages to souls on their four-year journey to eternal rest. But there's trouble in paradise.  Help Manny untangle himself from aSomething's rotten in the Land of Dead and you're being played for a sucker.  Meet Manny Calavera, travel agent at the Department of Death. He sells luxury packages to souls on their four-year journey to eternal rest. But there's trouble in paradise.  Help Manny untangle himself from a conspiracy that threatens his very salvation. [LucasArts]… Expand"
  },
  {
    "name": "Tom Clancy's Splinter Cell Chaos Theory",
    "details_link": "https://www.metacritic.com/game/xbox/tom-clancys-splinter-cell-chaos-theory",
    "publisher": "Ubisoft",
    "release_date": "Mar 28 2005",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": "Xbox",
    "num_players": "4  Online",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 94,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/3/009ca566a4835ed1c5757c9238ea664b-98.jpg",
    "descriptions": "As Sam Fisher, Third Echelon's most skilled Splinter Cell operative, you are assigned to execute a hazardous series of operations to investigate and eliminate a new source of information attacks originating in North Korea. At your disposal is a lethal array of tactics ranging from CombatAs Sam Fisher, Third Echelon's most skilled Splinter Cell operative, you are assigned to execute a hazardous series of operations to investigate and eliminate a new source of information attacks originating in North Korea. At your disposal is a lethal array of tactics ranging from Combat Knife techniques to experimental prototype weapons skills and more-radical hand-to-hand techniques such as the Inverted Chokehold. Experience the intensity of acting as a lone operative fighting tomorrow's threats in the field and of cooperating online with a partner to accomplish crucial missions.… Expand"
  },
  {
    "name": "Resident Evil Code: Veronica",
    "details_link": "https://www.metacritic.com/game/dreamcast/resident-evil-code-veronica",
    "publisher": "Capcom",
    "release_date": "Feb 29 2000",
    "developers": [
      "NexTech"
    ],
    "platforms": "Dreamcast",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 94,
    "users_score": 9.5,
    "image": "https://static.metacritic.com/images/products/games/5/2b4cc311cda83d6f44f7daedf6a300ba-98.jpg",
    "descriptions": "Resident Evil Code: Veronica takes up the story of Claire Redfield, a character from Resident Evil 2. In that game she was searching for her brother Chris (a missing S.T.A.R.S. member) and in Resident Evil Code: Veronica we follow her to Europe where she continues her search at UmbrellaResident Evil Code: Veronica takes up the story of Claire Redfield, a character from Resident Evil 2. In that game she was searching for her brother Chris (a missing S.T.A.R.S. member) and in Resident Evil Code: Veronica we follow her to Europe where she continues her search at Umbrella headquarters.… Expand"
  },
  {
    "name": "The Witcher 3: Wild Hunt - Complete Edition",
    "details_link": "https://www.metacritic.com/game/playstation-5/the-witcher-3-wild-hunt---complete-edition",
    "publisher": "CD Projekt Red Studio",
    "release_date": "Dec 14 2022",
    "developers": [
      "CD Projekt Red Studio"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 94,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/6/ce3e645323561460666f0ff42cde7ca3-98.jpg",
    "descriptions": "You are Geralt of Rivia, mercenary monster slayer. Before you stands a war-torn, monster-infested continent you can explore at will. Your current contract? Tracking down Ciri — the Child of Prophecy, a living weapon that can alter the shape of the world. The Complete Edition contains theYou are Geralt of Rivia, mercenary monster slayer. Before you stands a war-torn, monster-infested continent you can explore at will. Your current contract? Tracking down Ciri — the Child of Prophecy, a living weapon that can alter the shape of the world. The Complete Edition contains the base game, offering a huge, over 100-hour long, open-world adventure, as well as both of its massive story expansions: Hearts of Stone & Blood and Wine worth an extra 50 hours of gameplay!  It also comes with all additional content released for the game, alongside new features and items, including a built-in Photo Mode, swords, armor, and alternate outfits inspired by The Witcher Netflix series — and more!\r UPDATED FOR PLAYSTATION 5\rBehold the dark fantasy world of the Continent like never before! This edition of The Witcher 3: Wild Hunt has been enhanced with numerous visual and technical improvements, including vastly improved level of detail, faster loading times, a range of community created and newly developed mods for the game, real-time ray tracing, 3D audio support, and more — all implemented with the power of the PlayStation 5 in mind. The game also utilizes the unique features of the Dual Sense controller, with its advanced haptics and adaptive triggers, letting you immerse yourself in the adventure even more!\r PLAY AS A HIGHLY TRAINED MONSTER SLAYER FOR HIRE\r-Trained from early childhood and mutated to gain superhuman skills, strength, and reflexes, witchers are a counterbalance to the monster-infested world in which they live.\r-Gruesomely destroy foes as a professional monster hunter armed with a range of upgradeable weapons, mutating potions, and combat magic.\r-Hunt down a wide variety of exotic monsters, from savage beasts prowling mountain passes to cunning supernatural predators lurking in the shadowy back alleys of densely populated cities.\r-Invest your rewards to upgrade your weaponry and buy custom armor, or spend them on horse races, card games, fist fighting, and other pleasures life brings.\r EXPLORE A MORALLY AMBIGUOUS FANTASY OPEN WORLD\r-Built for endless adventure, the massive open world of The Witcher sets new standards in terms of size, depth, and complexity.\r-Traverse a fantastical open world: explore forgotten ruins, caves, and shipwrecks, trade with merchants and dwarven smiths in cities, and hunt across the open plains, mountains, and seas.\r-Deal with treasonous generals, devious witches, and corrupt royalty to provide dark and dangerous services.\r-Make choices that go beyond good & evil, and face their far-reaching consequences.\r TRACK DOWN THE CHILD OF PROPHECY\r-Take on the most important contract of your life: to track down the child of prophecy, the key to saving or destroying this world.\r-In times of war, chase down the child of prophecy, a living weapon foretold by ancient elven legends.\r-Struggle against ferocious rulers, spirits of the wilds, and even a threat from beyond the veil – all hell-bent on controlling this world.\r-Define your destiny in a world that may not be worth saving.\r… Expand"
  },
  {
    "name": "Burnout 3: Takedown",
    "details_link": "https://www.metacritic.com/game/xbox/burnout-3-takedown",
    "publisher": "EA Games",
    "release_date": "Sep  7 2004",
    "developers": [
      "Criterion Games"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "8  Online",
    "genres": [
      "Driving",
      "Racing",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/d239a6e017d0176129f634f666f6dd1f-98.jpg",
    "descriptions": "Burnout 3 challenges you to crash into (and through) busy intersections, while creating as much damage as possible. You can battle your way to the front of the pack by taking down rivals and causing spectacular crashes. For those who thirst for crashes, the game includes a crash mode thatBurnout 3 challenges you to crash into (and through) busy intersections, while creating as much damage as possible. You can battle your way to the front of the pack by taking down rivals and causing spectacular crashes. For those who thirst for crashes, the game includes a crash mode that rewards you for creating massive pileups. With multiplayer gameplay, more than 100 events, and 40 tracks, Burnout 3 provides intense speed and action.… Expand"
  },
  {
    "name": "Diablo",
    "details_link": "https://www.metacritic.com/game/pc/diablo",
    "publisher": "Blizzard Entertainment",
    "release_date": "Dec 31 1996",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": "PC",
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 94,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/2/3d23d53559172dfdb3b3d910f9923547-98.jpg",
    "descriptions": "The kingdom of Khandaras has fallen into chaos. An unknown force of evil has swept across the land. Plunging it nto civil war and terrorizing the populace. A mad king, his missing son, and a mysterious archbishop are all pieces to the puzzle that faces you. You have journeyed to the sourceThe kingdom of Khandaras has fallen into chaos. An unknown force of evil has swept across the land. Plunging it nto civil war and terrorizing the populace. A mad king, his missing son, and a mysterious archbishop are all pieces to the puzzle that faces you. You have journeyed to the source of the evil. The town of Tristram. Now inhabited by only a handful of survivors. The catherdal there is buildt over the ruins of an ancient monastary, and now eerie lights and sounds are heard echoing through its abandoned halls. Perhaps the answer lies withing the remains of a forgotten past... Diablo invites you to enter a world of dark gothic fantasy. Play as a brave warrior, cunning rogue or mysterious sorceror. As you venture deeper into the labyrinth, you'll discover weapons, armor, and magical treasures, and develop your character's skills and abilities. [Blizzard]… Expand"
  },
  {
    "name": "God of War: Ragnarok",
    "details_link": "https://www.metacritic.com/game/playstation-5/god-of-war-ragnarok",
    "publisher": "PlayStation Studios",
    "release_date": "Nov  9 2022",
    "developers": [
      "SCE Santa Monica"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Open-World",
      "Action Adventure",
      "General"
    ],
    "meta_score": 94,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/4/f475a29eab99cd7823b8cf860df11335-98.jpg",
    "descriptions": "The freezing winds of Fimbulwinter have come to Midgard, making survival for Kratos, Atreus, and Mimir in the Norse wilds even more challenging than before.  Kratos, still bearing the knowledge of his past mistakes, wants to spare Atreus the bloody lessons he learned from his conflict withThe freezing winds of Fimbulwinter have come to Midgard, making survival for Kratos, Atreus, and Mimir in the Norse wilds even more challenging than before.  Kratos, still bearing the knowledge of his past mistakes, wants to spare Atreus the bloody lessons he learned from his conflict with gods. He wants to keep his son safe, above all, and their confrontation with Baldur has vindicated the belief that only tragedy will come from further entanglements with the Aesir. Together, Kratos and Atreus will have to make a choice about which path they will take. Whatever they choose will define the fate of all those living in the Nine Realms as Ragnarok approaches. Whatever your choice of combat strategy, the enemies that await in God of War Ragnarök will be ready. The realms have grown harsher, and a whole host of new creatures from across Norse mythology will test your skills. God of War Ragnarök will take you to the previously unreachable Vanaheim, Svartalfheim, and Asgard - as well as to new areas from locations featured in the last game. Exploring the realms will take you everywhere from verdant, otherworldly jungles to intricate subterranean mining networks. This next installment in the series will bring you a more diverse, beautiful, and mysterious variety of locations than in any other God of War game.… Expand"
  },
  {
    "name": "Metal Gear Solid 3: Subsistence",
    "details_link": "https://www.metacritic.com/game/playstation-2/metal-gear-solid-3-subsistence",
    "publisher": "Konami",
    "release_date": "Mar 14 2006",
    "developers": [
      "Aspect"
    ],
    "platforms": "PlayStation 2",
    "num_players": "8  Online",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 94,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/2/7362d4776d23a2c7fafb0a555fac686f-98.jpg",
    "descriptions": "Metal Gear goes online for the first time in Metal Gear Solid 3 Subsistence! Players can battle or team up with up to 7 other friends for online dominance. Featuring different gameplay modes, new camera system, and robust online play, Subsistence is the game that gives players a brand newMetal Gear goes online for the first time in Metal Gear Solid 3 Subsistence! Players can battle or team up with up to 7 other friends for online dominance. Featuring different gameplay modes, new camera system, and robust online play, Subsistence is the game that gives players a brand new Metal Gear experience. Includes MGS3 Snake Eater and all new Online Modes, including Death Match, Team Death Match, Sneaking Mission, Capture Mission, and Rescue Mission. Third Person Camera system gives players more control. Bonus Metal Gear and Metal Gear 2 Solid Snake games which have never been released before in the North America. Demo Theater, Duel Mode, and new stages for Snake vs. Monkey mini-game. [Konami]… Expand"
  },
  {
    "name": "Call of Duty: Modern Warfare 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-modern-warfare-2",
    "publisher": "Activision",
    "release_date": "Nov 10 2009",
    "developers": [
      "Infinity Ward"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 18 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/0/04718c8d5ed3c1a5a963d8714a10684e-98.jpg",
    "descriptions": "Modern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse. An entirely new gameplay mode which supports 2-player co-operative play online that is unique from the single player storyModern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse. An entirely new gameplay mode which supports 2-player co-operative play online that is unique from the single player story campaign. Special Ops pits players into a gauntlet of time-trial and objective-based missions. Rank-up as players unlock new Special Ops missions, each more difficult. Missions include highlights from the single player campaign, fan favorites from Call of Duty 4: Modern Warfare and all new, exclusive missions. Setting a new bar for online multiplayer, Modern Warfare 2 multiplayer delivers new capabilities, customization, gamestates and modes, including: Create-a-Class Evolved. Secondary Weapons - Machine Pistols, Shotguns, Handguns, Launchers. Riot Shields. Equipment - Throwing Knives, Blast Shield, Tactical Insertion. Perk Upgrades. Bling (Dual Attachments). Customizable Killstreaks - AC130, Sentry Gun, Predator Missile, Counter-UAV, Care Package. Accolades (Post match reports). [Activision]… Expand"
  },
  {
    "name": "Metal Gear Solid 4: Guns of the Patriots",
    "details_link": "https://www.metacritic.com/game/playstation-3/metal-gear-solid-4-guns-of-the-patriots",
    "publisher": "Konami",
    "release_date": "Jun 12 2008",
    "developers": [
      "Kojima Productions"
    ],
    "platforms": "PlayStation 3",
    "num_players": "Up to 16 ",
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern"
    ],
    "meta_score": 94,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/2/4cd9a6dee7a32ede89538ff28f23235c-98.jpg",
    "descriptions": "Metal Gear Solid 4: Guns of the Patriots features an aging and exhausted Solid Snake in the middle of a futuristic battlefield. In spite of his failing body, Snake is equipped with a crucial new device tentatively known as \"OctoCamo,\" a high-tech suit that dynamically transforms its textureMetal Gear Solid 4: Guns of the Patriots features an aging and exhausted Solid Snake in the middle of a futuristic battlefield. In spite of his failing body, Snake is equipped with a crucial new device tentatively known as \"OctoCamo,\" a high-tech suit that dynamically transforms its texture based on Snake's surroundings. This revolutionary new gameplay mechanic allows him to seamlessly blend into the environment, providing him with the means to stalk his enemies like never before. This latest chapter in Hideo Kojima's legendary tactical espionage actin series marks the return of several characters from previous Metal Gear Solid games including Revolver Ocelot, Meryl Silverburgh, Naomi Hunter and Raiden, and features an unforgettable story that depicts the desperate state of the future as seen through the eyes of an older Solid Snake. [Konami]… Expand"
  },
  {
    "name": "NCAA Football 2004",
    "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-football-2004",
    "publisher": "EA Sports",
    "release_date": "Jul 16 2003",
    "developers": [
      "EA Sports"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 94,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/87204fa6539ba956eda5f5fcb7f94138-98.jpg",
    "descriptions": "Take the rivalry online: Battle Michigan vs. Ohio State, USC vs. Notre Dame, Oklahoma vs. Nebraska, and more in online head-to-head exhibition games. Chat or sing your favorite fight song in-game with EA SPORTS Talk, or follow the stat leaders across the country in the Online Top 100. Get inTake the rivalry online: Battle Michigan vs. Ohio State, USC vs. Notre Dame, Oklahoma vs. Nebraska, and more in online head-to-head exhibition games. Chat or sing your favorite fight song in-game with EA SPORTS Talk, or follow the stat leaders across the country in the Online Top 100. Get in the end zone with new trick plays like the Halfback Throwback and Wide Receiver Double Reverse Pass. New animations include sideline tackles, stumbles, new over-the-shoulder and basket catches, user-controlled celebrations, and much more. See the receivers better through a new QB Rollout camera and use the Play-Action Pass camera to fake out the defense. New College Classics mode: Replay 20 of the greatest college football games from the last two decades. Take over the game at a key situation, relive the glorious victory, or change history with an upset. Over 150 new teams: Play as one of 36 new 1-AA teams or one of the 100+ NEW Classic Teams including 1930 Notre Dame, 1956 Oklahoma, 1972 USC, 1985 Auburn, and 2002 Ohio State. Continuing the dynasty: Project the season's top performers with the new Pre-Season All-American Team and revel in your weekly accomplishments with new Sports Illustrated magazine covers. [EA Sports]… Expand"
  },
  {
    "name": "The Witcher 3: Wild Hunt - Complete Edition",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/the-witcher-3-wild-hunt---complete-edition",
    "publisher": "CD Projekt Red Studio",
    "release_date": "Jan 26 2023",
    "developers": [
      "CD Projekt Red Studio"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 94,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/7/f78caac7be08134cc2775fb5905266fb-98.jpg",
    "descriptions": "You are Geralt of Rivia, mercenary monster slayer. Before you stands a war-torn, monster-infested continent you can explore at will. Your current contract? Tracking down Ciri — the Child of Prophecy, a living weapon that can alter the shape of the world. The Complete Edition contains theYou are Geralt of Rivia, mercenary monster slayer. Before you stands a war-torn, monster-infested continent you can explore at will. Your current contract? Tracking down Ciri — the Child of Prophecy, a living weapon that can alter the shape of the world. The Complete Edition contains the base game, offering a huge, over 100-hour long, open-world adventure, as well as both of its massive story expansions: Hearts of Stone & Blood and Wine worth an extra 50 hours of gameplay!  It also comes with all additional content released for the game, alongside new items including swords, armor, and alternate outfits inspired by The Witcher Netflix series — and more!\r UPDATED FOR XBOX SERIES X|S\rBehold the dark fantasy world of the Continent like never before! The Xbox Series X|S version of The Witcher 3: Wild Hunt has been enhanced with numerous visual and technical improvements, including vastly improved level of detail, faster loading times, a range of community created and newly developed mods for the game, real-time ray tracing, and more — all implemented with the power of the new consoles in mind — as well as a built-in Photo Mode. \r\rPLAY AS A HIGHLY TRAINED MONSTER SLAYER FOR HIRE\rTrained from early childhood and mutated to gain superhuman skills, strength, and reflexes, witchers are a counterbalance to the monster-infested world in which they live.\rGruesomely destroy foes as a professional monster hunter armed with a range of upgradeable weapons, mutating potions, and combat magic.\rHunt down a wide variety of exotic monsters, from savage beasts prowling mountain passes to cunning supernatural predators lurking in the shadowy back alleys of densely populated cities.\rInvest your rewards to upgrade your weaponry and buy custom armor, or spend them on horse races, card games, fist fighting, and other pleasures life brings.\r EXPLORE A MORALLY AMBIGUOUS FANTASY OPEN WORLD\rBuilt for endless adventure, the massive open world of The Witcher sets new standards in terms of size, depth, and complexity.\rTraverse a fantastical open world: explore forgotten ruins, caves, and shipwrecks, trade with merchants and dwarven smiths in cities, and hunt across the open plains, mountains, and seas.\rDeal with treasonous generals, devious witches, and corrupt royalty to provide dark and dangerous services.\rMake choices that go beyond good & evil, and face their far-reaching consequences.\r TRACK DOWN THE CHILD OF PROPHECY\rTake on the most important contract of your life: to track down the child of prophecy, the key to saving or destroying this world.\rIn times of war, chase down the child of prophecy, a living weapon foretold by ancient elven legends.\rStruggle against ferocious rulers, spirits of the wilds, and even a threat from beyond the veil – all hell-bent on controlling this world.\rDefine your destiny in a world that may not be worth saving.\r… Expand"
  },
  {
    "name": "God of War",
    "details_link": "https://www.metacritic.com/game/playstation-2/god-of-war",
    "publisher": "SCEA",
    "release_date": "Mar 22 2005",
    "developers": [
      "SCE Santa Monica"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 94,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/1/4dc6db1486fca9377e060d02d5173863-98.jpg",
    "descriptions": "Unleash the power of the Gods and embark on a merciless quest as Kratos, an ex-Spartan warrior driven to destroy Ares, the God of War. Armed with lethal double chainblades, Kratos must carve through mythology's darkest creatures including Medusa, Cyclops, the Hydra and more, while solvingUnleash the power of the Gods and embark on a merciless quest as Kratos, an ex-Spartan warrior driven to destroy Ares, the God of War. Armed with lethal double chainblades, Kratos must carve through mythology's darkest creatures including Medusa, Cyclops, the Hydra and more, while solving intricate puzzles in breathtaking environments. Driven by pure revenge, nothing can stop Kratos from achieving absolution. [SCEA]… Expand"
  },
  {
    "name": "Star Wars: Knights of the Old Republic",
    "details_link": "https://www.metacritic.com/game/xbox/star-wars-knights-of-the-old-republic",
    "publisher": "LucasArts",
    "release_date": "Jul 17 2003",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Third-Person"
    ],
    "meta_score": 94,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/4/4830747f7db0bf07f09754d22d5871e4-98.jpg",
    "descriptions": "Long before the Galactic Civil War, an epic drama begins.  Engage in this saga set in the Golden Age of the Republic--over 4,000 years before the first Star Wars film, when both Jedi and Sith number in the thousands.  With the Galaxy reeling from a recent conflict with the Dark Lords, theLong before the Galactic Civil War, an epic drama begins.  Engage in this saga set in the Golden Age of the Republic--over 4,000 years before the first Star Wars film, when both Jedi and Sith number in the thousands.  With the Galaxy reeling from a recent conflict with the Dark Lords, the ongoing battle between the Jedi and the Sith rages on.  It's up to guide your customizable and evolving characters through ten different worlds, fast-paced minigames, and locations including a Sith world, the Wookie homeworld, and the Jedi Academy.  Your actions determine the outcome of this colossal galactic war--and your destiny as a Jedi.  … Expand"
  },
  {
    "name": "Sid Meier's Civilization IV",
    "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-iv",
    "publisher": "2K Games",
    "release_date": "Oct 25 2005",
    "developers": [
      "Firaxis Games"
    ],
    "platforms": "PC",
    "num_players": "Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Historic",
      "Historic",
      "4X"
    ],
    "meta_score": 94,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/caaeaf62fb67e1eac34a4acfbaa54052-98.jpg",
    "descriptions": "Faster-Paced Fun - Gameplay has been streamlined for a tighter, faster, and more compelling experience.Greater Accessibility and Ease of Play - An easy-to-use interface will be immediately familiar to RTS and action game players, and newcomers to the series will be able to jump in and play.Faster-Paced Fun - Gameplay has been streamlined for a tighter, faster, and more compelling experience.Greater Accessibility and Ease of Play - An easy-to-use interface will be immediately familiar to RTS and action game players, and newcomers to the series will be able to jump in and play. Tech Tree - Flexible Tech tree allows players more strategic choices for developing their civilizations along unique paths. More Civs, Units, and Improvements to enhance and grow your empire. Multiplayer -LAN, Internet, PBEM, and Persistent Turn-Based Server (PTBS) offer players all-new strategies and ways to play when competing or cooperating with live opponents. Team Play - Whether playing multiplayer or single player, team play offers a new way of setting locked alliances that result in shared wonder effects, visibility, unit trading, and shared territory that delivers a plethora of new strategic and tactical options. Civ IV comes to life! - Beautiful 3D world with dozens of fully animated units (including culturally unique units), and totally customizable armies. Cities and wonders will appear on the map. Wonder movies are back! [2K Games]… Expand"
  },
  {
    "name": "Madden NFL 2004",
    "details_link": "https://www.metacritic.com/game/gamecube/madden-nfl-2004",
    "publisher": "EA Sports",
    "release_date": "Aug 12 2003",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 94,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/5/c7b50deee6be85ad472bc6dbd8d78e6f-98.jpg",
    "descriptions": "In its 14th season, Madden NFL Football isn't showing signs of slowing down. Madden NFL 2004 adds new features such as Playmaker Control and Owner Mode to it's deepen its football simulation. This year, players can make adjustments after the snap and create championship caliber plays withIn its 14th season, Madden NFL Football isn't showing signs of slowing down. Madden NFL 2004 adds new features such as Playmaker Control and Owner Mode to it's deepen its football simulation. This year, players can make adjustments after the snap and create championship caliber plays with the easy-to-use Playmaker Control. The new Owner mode allows you build and manage your own stadium in addition to your own team. Compete against other players through EA Sports Online Tournaments. With new plays, modes, and online play, Madden NFL 2004 is the most complete, authentic installment in the series yet.… Expand"
  },
  {
    "name": "Virtua Fighter 4",
    "details_link": "https://www.metacritic.com/game/playstation-2/virtua-fighter-4",
    "publisher": "Sega",
    "release_date": "Mar 17 2002",
    "developers": [
      "Sega AM2"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 94,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/9/a019d8bc9e987af3c6177ae9b64c9be2-98.jpg",
    "descriptions": "Two new characters (Lei Fei and Vanessa Lewis) join 11 VF veterans, each with their own unique styles based on real martial arts. New counters and defensive moves allow players to switch up their stances and fighting styles mid-bout. Train a computer-controlled character through sparring andTwo new characters (Lei Fei and Vanessa Lewis) join 11 VF veterans, each with their own unique styles based on real martial arts. New counters and defensive moves allow players to switch up their stances and fighting styles mid-bout. Train a computer-controlled character through sparring and an easy-to-use rewards system, then pit your character against a friend's or challenge the arcade mode. [Sega]… Expand"
  },
  {
    "name": "Super Mario 64",
    "details_link": "https://www.metacritic.com/game/nintendo-64/super-mario-64",
    "publisher": "Nintendo",
    "release_date": "Sep 26 1996",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Nintendo 64",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 94,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/3/22cde6082d9735d7699814bc61b95796-98.jpg",
    "descriptions": "Mario is super in a whole new way! Combining the finest 3-D graphics ever developed for a video game and an explosive sound track, Super Mario 64 becomes a new standard for video games. It's packed with bruising battles, daunting obstacle courses and underwater adventures. Retrieve the PowerMario is super in a whole new way! Combining the finest 3-D graphics ever developed for a video game and an explosive sound track, Super Mario 64 becomes a new standard for video games. It's packed with bruising battles, daunting obstacle courses and underwater adventures. Retrieve the Power Stars from their hidden locations and confront your arch nemesis - Bowser, King of the Koopas!… Expand"
  },
  {
    "name": "The Witcher 3: Wild Hunt",
    "details_link": "https://www.metacritic.com/game/pc/the-witcher-3-wild-hunt",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "May 18 2015",
    "developers": [
      "CD Projekt Red Studio"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action RPG",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 93,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/9/562c989431810e6aac45b6164ae0bfca-98.jpg",
    "descriptions": "With the Empire attacking the Kingdoms of the North and the Wild Hunt, a cavalcade of ghastly riders,  breathing down your neck, the only way to survive is to fight back. As Geralt of Rivia, a master swordsman and monster hunter, leave none of your enemies standing. Explore a gigantic openWith the Empire attacking the Kingdoms of the North and the Wild Hunt, a cavalcade of ghastly riders,  breathing down your neck, the only way to survive is to fight back. As Geralt of Rivia, a master swordsman and monster hunter, leave none of your enemies standing. Explore a gigantic open world, slay beasts and decide the fates of whole communities with your actions, all in a genuine next generation format.… Expand"
  },
  {
    "name": "Burnout 3: Takedown",
    "details_link": "https://www.metacritic.com/game/playstation-2/burnout-3-takedown",
    "publisher": "EA Games",
    "release_date": "Sep  7 2004",
    "developers": [
      "Criterion Games"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-16 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade"
    ],
    "meta_score": 93,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/9/362b08966df78f755703c22c9532dc99-98.jpg",
    "descriptions": "Burnout 3 takes the hit series even further, now featuring a unique \"crash and burn\" racing concept and a one-of-a-kind special effects engine that delivers spectacular visuals. The intensity heats up as players race, and often crash, their way through oncoming traffic in an attempt to claimBurnout 3 takes the hit series even further, now featuring a unique \"crash and burn\" racing concept and a one-of-a-kind special effects engine that delivers spectacular visuals. The intensity heats up as players race, and often crash, their way through oncoming traffic in an attempt to claim the top spot. Boasting multiple single-player, multiplayer and online crash and race modes, Burnout 3 offers players the opportunity to race through busy city streets and be rewarded for taking risks that result in heart-pounding action and electrifying crashes. [Electronic Arts]… Expand"
  },
  {
    "name": "Super Smash Bros. Brawl",
    "details_link": "https://www.metacritic.com/game/wii/super-smash-bros-brawl",
    "publisher": "Nintendo",
    "release_date": "Mar  9 2008",
    "developers": [
      "Game Arts"
    ],
    "platforms": "Wii",
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 93,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/7ee11338fe3b1d131fc4da0fcda945ee-98.jpg",
    "descriptions": "[Metacritic's 2008 Wii Game of the Year]  Super Smash Bros. Brawl is the next installment in the Smash Bros. series for the company's Wii console. Among the new characters playable in the game are Meta Knight, the sword-wielding nemesis of Kirby; Pit, the angelic archer from Kid Icarus; Zero[Metacritic's 2008 Wii Game of the Year]  Super Smash Bros. Brawl is the next installment in the Smash Bros. series for the company's Wii console. Among the new characters playable in the game are Meta Knight, the sword-wielding nemesis of Kirby; Pit, the angelic archer from Kid Icarus; Zero Suit Samus, the powerful Metroid series heroine minus her versatile armor; and Wario, who demonstrates a noxious attack of gastronomic proportions. Also Snake, the gritty soldier from Konami's hugely popular Metal Gear series. [Nintendo]… Expand"
  },
  {
    "name": "Company of Heroes",
    "details_link": "https://www.metacritic.com/game/pc/company-of-heroes",
    "publisher": "THQ",
    "release_date": "Sep 13 2006",
    "developers": [
      "Relic",
      "Relic Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "General",
      "Historic"
    ],
    "meta_score": 93,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/4/8d178665cd9b57f9965453cc1a8fedc7-98.jpg",
    "descriptions": "A real-time strategy game set in World War II, Company of Heroes brings to life, in full cinematic detail, the greatest war mankind has ever known. Company of Heroes is built on Relic's next-generation Essence Engine and also utilizes the Havok Physics engine, delivering cinematic visualA real-time strategy game set in World War II, Company of Heroes brings to life, in full cinematic detail, the greatest war mankind has ever known. Company of Heroes is built on Relic's next-generation Essence Engine and also utilizes the Havok Physics engine, delivering cinematic visual detail in a world completely driven by realistic physics. Gamers will experience the journey of the brave men of Able Company in a deep single-player campaign that begins with the invasion of Normandy through their fight across Europe, all set against the most dynamic battlefield ever seen in a game. Company of Heroes' completely destructable environment means no two battles ever play out in the same way. Advanced squad AI delivers startling new realism and responsiveness, bringing soldiers to life as they interact with the environment and execute advanced squad tactics to eliminate the opposition forces. [THQ]… Expand"
  },
  {
    "name": "Gran Turismo 2",
    "details_link": "https://www.metacritic.com/game/playstation/gran-turismo-2",
    "publisher": "SCEA",
    "release_date": "Nov 30 1999",
    "developers": [
      "Polyphony Digital"
    ],
    "platforms": "PlayStation",
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "GT / Street"
    ],
    "meta_score": 93,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/9/31c456da35b010b6c05318594f0f1820-98.jpg",
    "descriptions": "The world's most advanced racing game returns with thunderous new features."
  },
  {
    "name": "The Last of Us Part II",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-last-of-us-part-ii",
    "publisher": "SCEA",
    "release_date": "Jun 19 2020",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": "PlayStation 4",
    "num_players": "No Online Multiplayer",
    "genres": [
      "General",
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 93,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/3/976dc172a149f212d4b059e6eede1900-98.jpg",
    "descriptions": "Five years after their dangerous journey across the post-pandemic United States, Ellie and Joel have settled down in Jackson, Wyoming. Living amongst a thriving community of survivors has allowed them peace and stability, despite the constant threat of the infected and other, more desperateFive years after their dangerous journey across the post-pandemic United States, Ellie and Joel have settled down in Jackson, Wyoming. Living amongst a thriving community of survivors has allowed them peace and stability, despite the constant threat of the infected and other, more desperate survivors. When a violent event disrupts that peace, Ellie embarks on a relentless journey to carry out justice and find closure. As she hunts those responsible one by one, she is confronted with the devastating physical and emotional repercussions of her actions. … Expand"
  },
  {
    "name": "Hades",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/hades",
    "publisher": "Private Division",
    "release_date": "Aug 13 2021",
    "developers": [
      "Supergiant Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action Adventure",
      "Linear",
      "Roguelike"
    ],
    "meta_score": 93,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/2/b23c94bc90c967f7e79efb95285db7d3-98.jpg",
    "descriptions": "Defy the god of the dead as you hack and slash out of the Underworld in this rogue-like dungeon crawler from the creators of Bastion, Transistor, and Pyre.  Hades is a god-like rogue-like dungeon crawler that combines the best aspects of Supergiant's critically acclaimed titles, includingDefy the god of the dead as you hack and slash out of the Underworld in this rogue-like dungeon crawler from the creators of Bastion, Transistor, and Pyre.  Hades is a god-like rogue-like dungeon crawler that combines the best aspects of Supergiant's critically acclaimed titles, including the fast-paced action of Bastion, the rich atmosphere and depth of Transistor, and the character-driven storytelling of Pyre.\r BATTLE OUT OF HELL\rAs the immortal Prince of the Underworld, you'll wield the powers and mythic weapons of Olympus to break free from the clutches of the god of the dead himself, while growing stronger and unraveling more of the story with each unique escape attempt.\r UNLEASH THE FURY OF OLYMPUS\rThe Olympians have your back! Meet Zeus, Athena, Poseidon, and many more, and choose from their dozens of powerful Boons that enhance your abilities. There are thousands of viable character builds to discover as you go.\r BEFRIEND GODS, GHOSTS, AND MONSTERS\rA fully-voiced cast of colorful, larger-than-life characters is waiting to meet you! Grow your relationships with them, and experience thousands of unique story events as you learn about what's really at stake for this big, dysfunctional family.\r BUILT FOR REPLAYABILITY\rNew surprises await each time you delve into the ever-shifting Underworld, whose guardian bosses will remember you. Use the powerful Mirror of Night to grow permanently stronger, and give yourself a leg up the next time you run away from home.\r NOTHING IS IMPOSSIBLE\rPermanent upgrades mean you don't have to be a god yourself to experience the exciting combat and gripping story. Though, if you happen to be one, crank up the challenge and get ready for some white-knuckle action that will put your well-practiced skills to the test. \r\rSIGNATURE SUPERGIANT STYLE\rThe rich, atmospheric presentation and unique melding of gameplay and narrative that's been core to Supergiant's games is here in full force: spectacular hand-painted environments and a blood-pumping original score bring the Underworld to life.… Expand"
  },
  {
    "name": "Tom Clancy's Splinter Cell Pandora Tomorrow",
    "details_link": "https://www.metacritic.com/game/xbox/tom-clancys-splinter-cell-pandora-tomorrow",
    "publisher": "Ubisoft",
    "release_date": "Mar 23 2004",
    "developers": [
      "Ubisoft Shanghai"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 93,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/0/ca1eb081bb5cd0e1242564e52237d60c-98.jpg",
    "descriptions": "Tom Clancy's Splinter Cell: Pandora Tomorrow, the sequel to the stealth-action game Splinter Cell, once again casts you in the role of Sam Fisher, who is sent in to destroy top-secret documentation held in the embassy of militia leader Suhadi Sadono.  Use all-new moves and prototype gear toTom Clancy's Splinter Cell: Pandora Tomorrow, the sequel to the stealth-action game Splinter Cell, once again casts you in the role of Sam Fisher, who is sent in to destroy top-secret documentation held in the embassy of militia leader Suhadi Sadono.  Use all-new moves and prototype gear to infiltrate buildings and spare the hostages.  This time, you can take your games of espionage against three other players in online multiplayer mode, in which you choose to play as either a mercenary or spy.  You've got the moves and the gear, now put them to use.… Expand"
  },
  {
    "name": "Grand Theft Auto: Chinatown Wars",
    "details_link": "https://www.metacritic.com/game/ds/grand-theft-auto-chinatown-wars",
    "publisher": "Rockstar Games",
    "release_date": "Mar 17 2009",
    "developers": [
      "Rockstar Leeds"
    ],
    "platforms": [
      "iPhone/iPad",
      "DS"
    ],
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Open-World"
    ],
    "meta_score": 93,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/a4a0e7834e4f5ffe2a8f29063833b447-98.jpg",
    "descriptions": "Grand Theft Auto: Chinatown Wars is an entirely original entry into the critically acclaimed Grand Theft Auto series, and brings a new level of interactivity to its sprawling open environments. With the use of the DS touch screen, players navigate their way through the streets as theyGrand Theft Auto: Chinatown Wars is an entirely original entry into the critically acclaimed Grand Theft Auto series, and brings a new level of interactivity to its sprawling open environments. With the use of the DS touch screen, players navigate their way through the streets as they uncover the truth behind an epic tale of crime and corruption within the Triad crime syndicate, delivering the unprecedented amount of depth that has become a true trademark of the franchise.… Expand"
  },
  {
    "name": "Pac-Man Championship Edition DX",
    "details_link": "https://www.metacritic.com/game/xbox-360/pac-man-championship-edition-dx",
    "publisher": "Namco Bandai Games",
    "release_date": "Nov 17 2010",
    "developers": [
      "Namco Bandai Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Adventure",
      "General",
      "Action",
      "General",
      "General",
      "Arcade"
    ],
    "meta_score": 93,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/1/a9684ad13996997ede73d7184b808617-98.jpg",
    "descriptions": "PAC-MAN Championship Edition DX continues to uphold NAMCO BANDAI's tradition of enhancing a classic franchise for today's gamer. Building upon PAC-MAN Championship Edition’s original six courses, the new game features more than 100 varied and mind-boggling mazes to navigate. Several newPAC-MAN Championship Edition DX continues to uphold NAMCO BANDAI's tradition of enhancing a classic franchise for today's gamer. Building upon PAC-MAN Championship Edition’s original six courses, the new game features more than 100 varied and mind-boggling mazes to navigate. Several new modes will also be available to test a player's pellet-munching aptitude. In Time Attack Mode, players will vie for the quickest clear time. Fulfill a series of objectives in Mission Mode or compete to devour the most number of ghosts gobbled in Ghost Mode. … Expand"
  },
  {
    "name": "Street Fighter Alpha 3",
    "details_link": "https://www.metacritic.com/game/playstation/street-fighter-alpha-3",
    "publisher": "Capcom",
    "release_date": "Apr 30 1999",
    "developers": [
      "Capcom"
    ],
    "platforms": "PlayStation",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "2D"
    ],
    "meta_score": 93,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/9/bcd8d11694dfba72dffd0d9979f98445-98.jpg",
    "descriptions": "Street Fighter Alpha 3...scores a triple K.O.!"
  },
  {
    "name": "Hades",
    "details_link": "https://www.metacritic.com/game/switch/hades",
    "publisher": "Supergiant Games",
    "release_date": "Sep 17 2020",
    "developers": [
      "Supergiant Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action Adventure",
      "General",
      "Linear",
      "Roguelike"
    ],
    "meta_score": 93,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/1/bf637d4b63b7109b6fe17d30de68c42e-98.jpg",
    "descriptions": "Defy the god of the dead as you hack and slash out of the Underworld in this rogue-like dungeon crawler from the creators of Bastion, Transistor, and Pyre. Hades is a god-like rogue-like dungeon crawler that combines the best aspects of Supergiant's critically acclaimed titles, including theDefy the god of the dead as you hack and slash out of the Underworld in this rogue-like dungeon crawler from the creators of Bastion, Transistor, and Pyre. Hades is a god-like rogue-like dungeon crawler that combines the best aspects of Supergiant's critically acclaimed titles, including the fast-paced action of Bastion, the rich atmosphere and depth of Transistor, and the character-driven storytelling of Pyre.\r BATTLE OUT OF HELL\r As the immortal Prince of the Underworld, you'll wield the powers and mythic weapons of Olympus to break free from the clutches of the god of the dead himself, while growing stronger and unraveling more of the story with each unique escape attempt.\r UNLEASH THE FURY OF OLYMPUS\r The Olympians have your back! Meet Zeus, Athena, Poseidon, and many more, and choose from their dozens of powerful Boons that enhance your abilities. There are thousands of viable character builds to discover as you go.\r BEFRIEND GODS, GHOSTS, AND MONSTERS\r A fully-voiced cast of colorful, larger-than-life characters is waiting to meet you! Grow your relationships with them, and experience thousands of unique story events as you learn about what's really at stake for this big, dysfunctional family.\r BUILT FOR REPLAYABILITY\r New surprises await each time you delve into the ever-shifting Underworld, whose guardian bosses will remember you. Use the powerful Mirror of Night to grow permanently stronger, and give yourself a leg up the next time you run away from home.\r NOTHING IS IMPOSSIBLE\r Permanent upgrades mean you don't have to be a god yourself to experience the exciting combat and gripping story. Though, if you happen to be one, crank up the challenge and get ready for some white-knuckle action that will put your well-practiced skills to the test.\r SIGNATURE SUPERGIANT STYLE\r The rich, atmospheric presentation and unique melding of gameplay and narrative that's been core to Supergiant's games is here in full force: spectacular hand-painted environments and a blood-pumping original score bring the Underworld to life.\r… Expand"
  },
  {
    "name": "Dwarf Fortress",
    "details_link": "https://www.metacritic.com/game/pc/dwarf-fortress",
    "publisher": "Bay 12 Games",
    "release_date": "Dec  6 2022",
    "developers": [
      "Bay 12 Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Turn-Based",
      "Fantasy",
      "General",
      "Simulation",
      "Strategy",
      "General",
      "Management",
      "Government"
    ],
    "meta_score": 93,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/0/b06c0a6648e5332d7074a36237ea8d2c-98.jpg",
    "descriptions": "The deepest, most intricate simulation of a world that's ever been created. The legendary Dwarf Fortress is now on Steam. Build a fortress and try to help your dwarves survive against a deeply generated world."
  },
  {
    "name": "Tony Hawk's Pro Skater 3",
    "details_link": "https://www.metacritic.com/game/xbox/tony-hawks-pro-skater-3",
    "publisher": "Activision",
    "release_date": "Mar  4 2002",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 93,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/8/13aeeaddc1a64e444874098ba44120a3-98.jpg",
    "descriptions": "You may not be able to live like the legend, but now you can skate like him.  Skate as the legendary Tony Hawk or choose from a dream team of 12 top pro skaters, including old favorites like Lasek, Thomas, Muska, and Steamer, as well as new talent like Gilfberg, Caballero, Koston, andYou may not be able to live like the legend, but now you can skate like him.  Skate as the legendary Tony Hawk or choose from a dream team of 12 top pro skaters, including old favorites like Lasek, Thomas, Muska, and Steamer, as well as new talent like Gilfberg, Caballero, Koston, and Mullen.  Or enjoy full customization abilities with the enhanced Create-a-Skater (now including female skaters) and the Skatepark Editor.  Travel from L.A. to Tokyo, Suburbia to Skater's Island performing challenges and meeting goals.  New moves include the Revert, which allows you to link vert tricks, and flatland tricks such as Caspers, the Primo, and Handstand Manual.  If you're good, you can even unlock hidden pro footage.… Expand"
  },
  {
    "name": "Half-Life: Alyx",
    "details_link": "https://www.metacritic.com/game/pc/half-life-alyx",
    "publisher": "Valve Software",
    "release_date": "Mar 23 2020",
    "developers": [
      "Valve Software"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 93,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/4/559d5752e81e5bd977817d9de26bfe4b-98.jpg",
    "descriptions": "Half-Life: Alyx is Valve's VR return to the Half-Life series. It's the story of an impossible fight against a vicious alien race known as the Combine, set between the events of Half-Life and Half-Life 2. Playing as Alyx Vance, you are humanity's only chance for survival. The Combine'sHalf-Life: Alyx is Valve's VR return to the Half-Life series. It's the story of an impossible fight against a vicious alien race known as the Combine, set between the events of Half-Life and Half-Life 2. Playing as Alyx Vance, you are humanity's only chance for survival. The Combine's control of the planet since the Black Mesa incident has only strengthened as they corral the remaining population in cities. Among them are some of Earth's greatest scientists: you and your father, Dr. Eli Vance. As founders of a fledgling resistance, you've continued your clandestine scientific activityperforming critical research, and building invaluable tools for the few humans brave enough to defy the Combine. Every day, you learn more about your enemy, and every day you work toward finding a weakness.\r ABOUT GAMEPLAY IN VR:\r Valve's return to the Half-Life universe that started it all was built from the ground up for virtual reality. VR was built to enable the gameplay that sits at the heart of Half-Life.\r Immerse yourself in deep environmental interactions, puzzle solving, world exploration, and visceral combat.\r Lean to aim around a broken wall and under a Barnacle to make an impossible shot. Rummage through shelves to find a healing syringe and some shotgun shells. Manipulate tools to hack alien interfaces. Toss a bottle through a window to distract an enemy. Rip a Headcrab off your face and throw it at a Combine soldier.\r Extra content for Index owners\rCustomers who have purchased Valve Index hardware by the end of 2019 will have access to unique bonuses starting early next year:\r * Explore environments from Half-Life: Alyx in your SteamVR Home space\r* Alternate gun skins to embellish Alyx's arsenal\r* Special Half-Life: Alyx-themed content for Counter-Strike: Global Offensive and Dota 2\r Community-built environments\r * A set of Source 2 tools for building new environments will ship with the game, enabling any player to build and contribute new environments for the community to enjoy. Hammer, Valve's level authoring tool, has been updated with all of the game's virtual reality gameplay tools and components.… Expand"
  },
  {
    "name": "Divinity: Original Sin II - Definitive Edition",
    "details_link": "https://www.metacritic.com/game/switch/divinity-original-sin-ii---definitive-edition",
    "publisher": "Larian Studios Games",
    "release_date": "Sep  4 2019",
    "developers": [
      "Larian Studios Games",
      "BlitWorks",
      "The Dragon Commanders"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Western-Style"
    ],
    "meta_score": 93,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/7/69f5a3666181ae32f75a5d08b14f1eed-98.jpg",
    "descriptions": "Set a thousand years after the first game, Divinity: Original Sin II presents a darker, more grounded narrative and expands on the tactical combat system of its award-winning predecessor. In Divinity: Original Sin, you were on a quest for the forbidden Source magic. Now, you yourself are aSet a thousand years after the first game, Divinity: Original Sin II presents a darker, more grounded narrative and expands on the tactical combat system of its award-winning predecessor. In Divinity: Original Sin, you were on a quest for the forbidden Source magic. Now, you yourself are a Sourcerer: a dangerously powerful individual whose abilities summon creatures from the encroaching Void. The Divine is dead and the Void is everywhere. Sourcerers are blamed and the Divine Order is leading the charge against the threat: you. Captured and sent to Fort Joy, you will be \"cured\" of your powers -- no matter the cost. But the Order has secrets of its own that may cast doubt on its so-called holy mission. As you escape from Fort Joy, you realize that if the world remains godless, it will be consumed by the Void.… Expand"
  },
  {
    "name": "Divinity: Original Sin II",
    "details_link": "https://www.metacritic.com/game/pc/divinity-original-sin-ii",
    "publisher": "Larian Studios Games",
    "release_date": "Sep 14 2017",
    "developers": [
      "Larian Studios Games"
    ],
    "platforms": "PC",
    "num_players": "Up to 4 ",
    "genres": [
      "Action RPG",
      "Role-Playing",
      "Western-Style"
    ],
    "meta_score": 93,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/1/e7ec0efeb2d6f01d15c2254a395a3065-98.jpg",
    "descriptions": "Master deep, tactical combat. Join up to 3 other players - but know that only one of you will have the chance to become a God."
  },
  {
    "name": "Unreal Tournament 2004",
    "details_link": "https://www.metacritic.com/game/pc/unreal-tournament-2004",
    "publisher": "Atari",
    "release_date": "Mar 16 2004",
    "developers": [
      "Epic Games"
    ],
    "platforms": "PC",
    "num_players": "1-32 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 93,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/a6922b55f29ce22382e871976a6920f1-98.jpg",
    "descriptions": "Reload, rev up and ride out. The new Tournament is faster, higher and meaner. Land and air based vehicles take combat to a new level; while an arsenal of new weaponry, daunting arenas and battlefields and the challenge of the Assault and Onslaught modes make the gladiator blood sport of theReload, rev up and ride out. The new Tournament is faster, higher and meaner. Land and air based vehicles take combat to a new level; while an arsenal of new weaponry, daunting arenas and battlefields and the challenge of the Assault and Onslaught modes make the gladiator blood sport of the future a brand new experience. Buckle up; it?s gonna be one hell of a ride!  [Atari]… Expand"
  },
  {
    "name": "BioShock Infinite",
    "details_link": "https://www.metacritic.com/game/xbox-360/bioshock-infinite",
    "publisher": "2K Games",
    "release_date": "Mar 26 2013",
    "developers": [
      "Irrational Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 93,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/7/e302b462a7173a6b90fa14d4a547d654-98.jpg",
    "descriptions": "Thrust into the year 1912, players take on the role of former Pinkerton agent Booker DeWitt, who has traveled to the flying city of Columbia on a rescue mission. His target is Elizabeth, a young lady imprisoned since her childhood years. During their bold escape, Booker and Elizabeth form aThrust into the year 1912, players take on the role of former Pinkerton agent Booker DeWitt, who has traveled to the flying city of Columbia on a rescue mission. His target is Elizabeth, a young lady imprisoned since her childhood years. During their bold escape, Booker and Elizabeth form a powerful bond -- one which lets Booker enhance his own abilities with her world-altering control over the environment. As a team, they fight from high-speed Sky-Lines, in the streets and houses of Columbia, on giant Zeppelins and in the clouds, while simultaneously learning to harness an growing arsenal of weapons and abilities.\r… Expand"
  },
  {
    "name": "Ori and the Will of the Wisps",
    "details_link": "https://www.metacritic.com/game/switch/ori-and-the-will-of-the-wisps",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep 17 2020",
    "developers": [
      "Moon Studios"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D",
      "",
      "Metroidvania"
    ],
    "meta_score": 93,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/4/f1357aabbe0cb1b331ce11b1f4d2d96f-98.jpg",
    "descriptions": "From the creators of Ori and the Blind Forest comes the highly-anticipated sequel, Ori and the Will of the Wisps. Embark on an all-new adventure in a vast and exotic world where you’ll encounter towering enemies and challenging puzzles on your quest to discover Ori’s true destiny. ImmerseFrom the creators of Ori and the Blind Forest comes the highly-anticipated sequel, Ori and the Will of the Wisps. Embark on an all-new adventure in a vast and exotic world where you’ll encounter towering enemies and challenging puzzles on your quest to discover Ori’s true destiny. Immerse yourself in a hand-crafted narrative experience with deeply emotional storytelling, strikingly beautiful environments, and a stunning soundtrack. Master new skills to guide Ori through a journey of untold danger using newly acquired spirit weapons, spells, and attacks. Utilize an all-new shard system to power-up Ori’s newfound abilities. Face larger-than-life bosses and seek help from an expansive cast of new characters who will help you uncover Ori’s mysterious fate. Race to the top of the leaderboards in the all-new Spirit Trials mode where players dash, burrow, grapple, and leap to high scores in unique speed-run challenges throughout the game.… Expand"
  },
  {
    "name": "Braid",
    "details_link": "https://www.metacritic.com/game/xbox-360/braid",
    "publisher": "Number None Inc.",
    "release_date": "Aug  6 2008",
    "developers": [
      "Number None Inc."
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 93,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/6/ed83d7e849d4bc74845a1f41890f998e-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Braid is a puzzle-platformer, drawn in a painterly style, where the player manipulates the flow of time in strange and unusual ways. From a house in the city, journey to a series of worlds and solve puzzles to rescue an abducted princess. In each world, you have a[Xbox Live Arcade]  Braid is a puzzle-platformer, drawn in a painterly style, where the player manipulates the flow of time in strange and unusual ways. From a house in the city, journey to a series of worlds and solve puzzles to rescue an abducted princess. In each world, you have a different power to affect the way time behaves, and it is time's strangeness that creates the puzzles. The time behaviors include: the ability to rewind, objects that are immune to being rewound, time that is tied to space, parallel realities, time dilation, and perhaps more. Braid treats your time and attention as precious; there is no filler in this game. Every puzzle shows you something new and interesting about the game world. Braid is a 2-D platform game where you can never die and never lose. Despite this, Braid is challengingâ??but the challenge is about solving puzzles, rather than forcing you to replay tricky jumps. Travel through a series of worlds searching for puzzle pieces, then solving puzzles by manipulating time: rewinding, creating parallel universes, setting up pockets of dilated time. The gameplay feels fresh and new; the puzzles are meant to inspire new ways of thinking. [Microsoft]… Expand"
  },
  {
    "name": "God of War II",
    "details_link": "https://www.metacritic.com/game/playstation-2/god-of-war-ii",
    "publisher": "SCEA",
    "release_date": "Mar 13 2007",
    "developers": [
      "SCE Santa Monica"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 93,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/0/e9f70c8c7497360114f6a0b22ac4fcc4-98.jpg",
    "descriptions": "[Metacritic's 2007 PS2 Game of the Year]  God of War saw Kratos, a mortal warrior, set upon an epic quest to dethrone a God. But his journey did not end there. In God of War II, Kratos sits atop his Olympus throne, as the new God of War – far more ruthless than Ares ever was. To end his[Metacritic's 2007 PS2 Game of the Year]  God of War saw Kratos, a mortal warrior, set upon an epic quest to dethrone a God. But his journey did not end there. In God of War II, Kratos sits atop his Olympus throne, as the new God of War – far more ruthless than Ares ever was. To end his continued torment, Kratos must journey to the far reaches of the earth and defeat untold horrors and alter that which no mortal, or god has ever changed, his fate. God of War II sets an epic stage for a devastating mythological war to end all wars. In God of War II, players retake the role of Kratos. Armed with the deadly blades and blistering rage, players are aided by new breath-taking magic and new brutal combat moves. The journey takes them through vividly striking environments where they are faced with a labyrinth of challenging puzzles and mini-games intricately woven into the story. The violent world of Greek mythology comes to life in gory detail as Kratos encounters new mythical characters, and compete in epic boss battles in his quest. [SCEA]… Expand"
  },
  {
    "name": "Super Mario 3D World",
    "details_link": "https://www.metacritic.com/game/wii-u/super-mario-3d-world",
    "publisher": "Nintendo",
    "release_date": "Nov 22 2013",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Wii U",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Platformer",
      "3D",
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 93,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/1/dfdc874140ce4ae3309a2d5a8be43a0b-98.jpg",
    "descriptions": "Work together with  your friends or compete for the crown in the first multiplayer 3D Mario game for the Wii U console. In the Super Mario 3D World game, players can choose to play as Mario, Luigi, Princess Peach or Toad."
  },
  {
    "name": "Starcraft II: Wings of Liberty",
    "details_link": "https://www.metacritic.com/game/pc/starcraft-ii-wings-of-liberty",
    "publisher": "Blizzard Entertainment",
    "release_date": "Jul 27 2010",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": "PC",
    "num_players": "Up to 4 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Sci-Fi",
      "Command"
    ],
    "meta_score": 93,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/4/e3c315f435e55f897c4761d4fefc432e-98.jpg",
    "descriptions": "StarCraft II continues the epic saga of the Protoss, Terran, and Zerg. These three distinct and powerful races clash once again in the fast-paced real-time strategy sequel to the legendary original, StarCraft. Legions of veteran, upgraded, and brand-new unit types do battle across theStarCraft II continues the epic saga of the Protoss, Terran, and Zerg. These three distinct and powerful races clash once again in the fast-paced real-time strategy sequel to the legendary original, StarCraft. Legions of veteran, upgraded, and brand-new unit types do battle across the galaxy, as each faction struggles for survival. Featuring a unique single-player campaign that picks up where StarCraft: Brood War left off, StarCraft II presents a cast of new heroes and familiar faces in an edgy sci-fi story filled with adventure and intrigue. In addition, Blizzard again offers unparalleled online play through Battle.net, the company's world-renowned gaming service, with several enhancements and new features to make StarCraft II the ultimate competitive real-time strategy game. Features fast-paced, hard-hitting, tightly balanced competitive real-time strategy gameplay that recaptures and improves on the magic of the original game. New units and gameplay mechanics further distinguish each race. Vibrant new 3D-graphics engine with support for dazzling visual effects and massive unit and army sizes. Full map-making and scripting tools to give players incredible freedom in customizing and personalizing their gameplay experience. [Blizzard]… Expand"
  },
  {
    "name": "SSX",
    "details_link": "https://www.metacritic.com/game/playstation-2/ssx",
    "publisher": "EA Sports Big",
    "release_date": "Oct 30 2000",
    "developers": [
      "EA Sports Big"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Snowboarding"
    ],
    "meta_score": 93,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/6/ce866f54288a376e32cf6c133f4c3d8e-98.jpg",
    "descriptions": "Remember when snowboard sims used to suck?  The times have truly changed with the monster speed, detailed tracks and super-fast frame rates of EA's first extreme sports game for the PS2."
  },
  {
    "name": "Street Fighter IV",
    "details_link": "https://www.metacritic.com/game/xbox-360/street-fighter-iv",
    "publisher": "Capcom",
    "release_date": "Feb 17 2009",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "2  Online",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 93,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/6/163cf936070e630b6e9aa7f4a969ee95-98.jpg",
    "descriptions": "Street Fighter IV features a mix of returning favourites such as Ryu, Ken, Chun-Li and Guile along with new characters created exclusively for this game such as Crimson Viper, Abel, El Fuerte, and Rufus. Characters and environments are rendered in high definition 3D, while the game is playedStreet Fighter IV features a mix of returning favourites such as Ryu, Ken, Chun-Li and Guile along with new characters created exclusively for this game such as Crimson Viper, Abel, El Fuerte, and Rufus. Characters and environments are rendered in high definition 3D, while the game is played in the classic Street Fighter 2D perspective with additional 3D camera flourishes. Six-button controls for the game return, with a host of new special moves and features integrated into the input system. Street Fighter IV also incorporates state of the art online match making and worldwide online gameplay. Mixing classic genre-defining game mechanics the franchise is known and loved for with all-new, never-before-seen gameplay systems, Street Fighter IV brings a brand new fighting game to fans the world over. With the inclusion of Capcom's latest advancements in new generation technology, Street Fighter IV promises to deliver an extraordinary experience that will re-introduce the world to the time-honoured art of virtual martial arts. New special moves that go beyond any Street Fighter fan's wildest imagination, including Focus attacks, Super Combos, and the revenged-fueled Ultra Combo system. Classic Street Fighter characters recreated for a new generation of gamers, including the original cast of Street Fighter II. New brawlers: female super-spy Crimson Viper, lucha libre wrestler El Fuerte, mixed martial artist Abel and more. New gameplay elements provide new challenges for both newcomers and the most seasoned Street Fighter pro. Online gameplay features, including instantaneous online challenges, versus mode, tournament mode, and world wide online gameplay. [Capcom]… Expand"
  },
  {
    "name": "Minecraft",
    "details_link": "https://www.metacritic.com/game/pc/minecraft",
    "publisher": "Mojang AB",
    "release_date": "Nov 18 2011",
    "developers": [
      "Mojang AB"
    ],
    "platforms": [
      "3DS",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Wii U",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Action Adventure",
      "Adventure",
      "3D",
      "Sandbox",
      "First-Person",
      "Fantasy",
      "Fantasy"
    ],
    "meta_score": 93,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/2/0ec49754f864a372073dcc684094385d-98.jpg",
    "descriptions": "The game involves players creating and destroying various types of blocks in a three dimensional environment. The player takes an avatar that can destroy or create blocks, forming fantastic structures, creations and artwork across the various multiplayer servers in multiple game modes."
  },
  {
    "name": "The Stanley Parable: Ultra Deluxe",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/the-stanley-parable-ultra-deluxe",
    "publisher": "Galactic Cafe",
    "release_date": "Apr 27 2022",
    "developers": [
      "Crows Crows Crows"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 93,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/3/ee53fc60868cc31e4b630f001bf39eaf-98.jpg",
    "descriptions": "The Stanley Parable: Ultra Deluxe is an expanded re-imagining of 2013's The Stanley Parable. You will play as Stanley, and you will not play as Stanley. You will make a choice, and you will become powerless. You are not here to win. The Stanley Parable is a game that plays you."
  },
  {
    "name": "Hades",
    "details_link": "https://www.metacritic.com/game/playstation-5/hades",
    "publisher": "Private Division",
    "release_date": "Aug 13 2021",
    "developers": [
      "Supergiant Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action Adventure",
      "Linear",
      "Roguelike"
    ],
    "meta_score": 93,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/a66616196a10f5be40b1edfed3c61a54-98.jpg",
    "descriptions": "Defy the god of the dead as you hack and slash out of the Underworld in this rogue-like dungeon crawler from the creators of Bastion, Transistor, and Pyre.  Hades is a god-like rogue-like dungeon crawler that combines the best aspects of Supergiant's critically acclaimed titles, includingDefy the god of the dead as you hack and slash out of the Underworld in this rogue-like dungeon crawler from the creators of Bastion, Transistor, and Pyre.  Hades is a god-like rogue-like dungeon crawler that combines the best aspects of Supergiant's critically acclaimed titles, including the fast-paced action of Bastion, the rich atmosphere and depth of Transistor, and the character-driven storytelling of Pyre. BATTLE OUT OF HELL. As the immortal Prince of the Underworld, you'll wield the powers and mythic weapons of Olympus to break free from the clutches of the god of the dead himself, while growing stronger and unraveling more of the story with each unique escape attempt.\r UNLEASH THE FURY OF OLYMPUS\rThe Olympians have your back! Meet Zeus, Athena, Poseidon, and many more, and choose from their dozens of powerful Boons that enhance your abilities. There are thousands of viable character builds to discover as you go.\r BEFRIEND GODS, GHOSTS, AND MONSTERS\rA fully-voiced cast of colorful, larger-than-life characters is waiting to meet you! Grow your relationships with them, and experience thousands of unique story events as you learn about what's really at stake for this big, dysfunctional family.\r BUILT FOR REPLAYABILITY\rNew surprises await each time you delve into the ever-shifting Underworld, whose guardian bosses will remember you. Use the powerful Mirror of Night to grow permanently stronger, and give yourself a leg up the next time you run away from home.\r NOTHING IS IMPOSSIBLE\rPermanent upgrades mean you don't have to be a god yourself to experience the exciting combat and gripping story. Though, if you happen to be one, crank up the challenge and get ready for some white-knuckle action that will put your well-practiced skills to the test. \r\rSIGNATURE SUPERGIANT STYLE\rThe rich, atmospheric presentation and unique melding of gameplay and narrative that's been core to Supergiant's games is here in full force: spectacular hand-painted environments and a blood-pumping original score bring the Underworld to life.… Expand"
  },
  {
    "name": "Undertale",
    "details_link": "https://www.metacritic.com/game/switch/undertale",
    "publisher": "tobyfox",
    "release_date": "Sep 18 2018",
    "developers": [
      "tobyfox",
      "8-4"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 93,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/c15ca7be6ab41982351c83d45911f629-98.jpg",
    "descriptions": "Welcome to UNDERTALE. In this RPG, you control a human who falls underground into the world of monsters. Now you must find your way out... or stay trapped forever.\r ((Healthy Dog's Warning: Game contains imagery that may be harmful to players with photosensitive epilepsy or similarWelcome to UNDERTALE. In this RPG, you control a human who falls underground into the world of monsters. Now you must find your way out... or stay trapped forever.\r ((Healthy Dog's Warning: Game contains imagery that may be harmful to players with photosensitive epilepsy or similar condition.))\r features:\r *    Killing is unnecessary: negotiate out of danger using the unique battle system.\r*    Time your attacks for extra damage, then dodge enemy attacks in a style reminiscent of top-down shooters.\r*    Original art and soundtrack brimming with personality.\r*    Soulful, character-rich story with an emphasis on humor.\r*    Created mostly by one person.\r*    Become friends with all of the bosses!\r*    At least 5 dogs.\r*    You can date a skeleton.\r*    Hmmm... now there are 6 dogs...?\r*    Maybe you won't want to date the skeleton.\r*    I thought I found a 7th dog, but it was actually just the 3rd dog.\r*    If you play this game, can you count the dogs for me...? I'm not good at it.… Expand"
  },
  {
    "name": "Persona 4 Golden",
    "details_link": "https://www.metacritic.com/game/playstation-vita/persona-4-golden",
    "publisher": "Atlus",
    "release_date": "Nov 20 2012",
    "developers": [
      "Atlus"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation Vita"
    ],
    "num_players": "Up to 40 ",
    "genres": [
      "Role-Playing",
      "Console-style RPG",
      "Console-style RPG",
      "Japanese-Style"
    ],
    "meta_score": 93,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/0/0d8a23ed237a918f86b0843d800c08e1-98.jpg",
    "descriptions": "Persona 4: The Golden is a remastered version of PS2 classic Shin Megami Tensei: Persona 4."
  },
  {
    "name": "Persona 5",
    "details_link": "https://www.metacritic.com/game/playstation-4/persona-5",
    "publisher": "Atlus",
    "release_date": "Apr  4 2017",
    "developers": [
      "Atlus"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 93,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/47dc3e3e49c9cbcf53beefcedcdd6cea-98.jpg",
    "descriptions": "Beneath the veneer of typical urban high school life, a group of teenagers mask their mysterious alter egos, their \"phantom thief\" side. Who are they? Why are they dressed as such? What are their motives? And... why are they being pursued? A picaresque coming-of-age story, Persona 5 brings aBeneath the veneer of typical urban high school life, a group of teenagers mask their mysterious alter egos, their \"phantom thief\" side. Who are they? Why are they dressed as such? What are their motives? And... why are they being pursued? A picaresque coming-of-age story, Persona 5 brings a new twist to the RPG genre. Assume the role of a second-year high school student who becomes a Persona-user through an unexpected incident. Having moved to Tokyo just before the start of the school year, he finds residence at a cafe run by his parents' friend, and is about to get his first taste of school life in the big city. The protagonist seems quiet and well-mannered at first glance, but gives a completely different impression once he has donned his \"phantom thief\" guise. What is the motivation of his alter ego...? Arsene is the protagonist's initial Persona, characterized by a mask-like face and a pair of huge, black wings. Some suspect an association between its name and the famous gentleman-thief, Arsene Lupin. What is the origin of this Persona, and what power does it hold? This is an account of the wild adventures experienced by a team of young misfits, who grow dramatically along the way. While attending Shujin High School, the protagonist will encounter a number of individuals, each with his or her own distinctive personality and charm. School life in the city is full of surprises and interesting events! It will most definitely be a fun year for the protagonist, living as an ordinary student. However, he and his friends become involved in an incident which leads to the awakening of their Personas. No one would ever suspect that these adolescents will eventually shake the world... Welcome to the next iteration of the Persona series, boasting a brand new metropolitan setting, all-new cast, and fresh, original story. [Atlus]\r… Expand"
  },
  {
    "name": "Red Dead Redemption 2",
    "details_link": "https://www.metacritic.com/game/pc/red-dead-redemption-2",
    "publisher": "Rockstar Games",
    "release_date": "Nov  5 2019",
    "developers": [
      "Rockstar Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Stadia",
      "Xbox One",
      "PC"
    ],
    "num_players": "Up to 32 ",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 93,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/6/ed4c1829d640cd58b8a6b9a82da58eaf-98.jpg",
    "descriptions": "America, 1899. The end of the wild west era has begun as lawmen hunt down the last remaining outlaw gangs. Those who will not surrender or succumb are killed.After a robbery goes badly wrong in the western town of Blackwater, Arthur Morgan and the Van der Linde gang are forced to flee.America, 1899. The end of the wild west era has begun as lawmen hunt down the last remaining outlaw gangs. Those who will not surrender or succumb are killed.After a robbery goes badly wrong in the western town of Blackwater, Arthur Morgan and the Van der Linde gang are forced to flee. With federal agents and the best bounty hunters in the nation massing on their heels, the gang must rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal divisions threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang who raised him.From the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America at the dawn of the modern age.… Expand"
  },
  {
    "name": "SSX 3",
    "details_link": "https://www.metacritic.com/game/playstation-2/ssx-3",
    "publisher": "EA Sports Big",
    "release_date": "Oct 20 2003",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 2"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Snowboarding"
    ],
    "meta_score": 93,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/0/71acc35053a04ab48d770220a93ee414-98.jpg",
    "descriptions": "Embark on the ultimate adventure and conquer the mountain with SSX 3. Life begins at the summit where a wide-open mountain awaits you -- board it, explore it, and beat it. Featuring all-new freestyle events and race courses, jaw-dropping tricks, and a cast of cool, customizable characters,Embark on the ultimate adventure and conquer the mountain with SSX 3. Life begins at the summit where a wide-open mountain awaits you -- board it, explore it, and beat it. Featuring all-new freestyle events and race courses, jaw-dropping tricks, and a cast of cool, customizable characters, SSX 3 is yours to conquer. Redefine the boundaries what you do and what you earn, and go anywhere gravity takes you with SSX 3!  [Electronic Arts]… Expand"
  },
  {
    "name": "Tom Clancy's Splinter Cell",
    "details_link": "https://www.metacritic.com/game/xbox/tom-clancys-splinter-cell",
    "publisher": "Ubisoft",
    "release_date": "Nov 17 2002",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 93,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/0/b0f1b36ab87b9ce98949663bc6ab70a4-98.jpg",
    "descriptions": "Infiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace.  In Tom Clancy's Splinter Cell, you are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon.  Suit up with theInfiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace.  In Tom Clancy's Splinter Cell, you are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon.  Suit up with the latest classified field operative gear and weapons as you travel through diverse mission objectives.  The world's future is in your hands, as cyber terrorism and international tensions are about to explode into WWIII.… Expand"
  },
  {
    "name": "Grand Theft Auto III",
    "details_link": "https://www.metacritic.com/game/pc/grand-theft-auto-iii",
    "publisher": "Rockstar Games",
    "release_date": "May 20 2002",
    "developers": [
      "DMA Design",
      "Rockstar North"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 4",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Open-World"
    ],
    "meta_score": 93,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/7/b0cddbca8fec88e94ec9269379a0d379-98.jpg",
    "descriptions": "The PC version features enhanced 3D audio. Environmentally scaled and referenced from the player's perspective. Create your own customizable Liberty City radio station, using the built-in mp3 player. State-of-the art visuals utilizing the latest PC hardware render the city more beautifullyThe PC version features enhanced 3D audio. Environmentally scaled and referenced from the player's perspective. Create your own customizable Liberty City radio station, using the built-in mp3 player. State-of-the art visuals utilizing the latest PC hardware render the city more beautifully than ever in 32 bit color. The skinnable player character enables fans to create and upload their own skin textures and to use a scanned-in photo to play as themselves. [Rockstar]… Expand"
  },
  {
    "name": "Quake III Arena",
    "details_link": "https://www.metacritic.com/game/dreamcast/quake-iii-arena",
    "publisher": "Sega",
    "release_date": "Oct 22 2000",
    "developers": [
      "Raster"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 93,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/6/99683ce6216a241b5fe037275ee3cdbd-98.jpg",
    "descriptions": "Prepare to abandon every ounce of common sence and any trace of doubt as you're engulfed by an online multiplayer frnezy throughout cyberspace! Delve into lands of eerie uncertainty and fatal hazards drawing you into the depths of dispair, as legions of foes surround you. Challenging the gutPrepare to abandon every ounce of common sence and any trace of doubt as you're engulfed by an online multiplayer frnezy throughout cyberspace! Delve into lands of eerie uncertainty and fatal hazards drawing you into the depths of dispair, as legions of foes surround you. Challenging the gut reaction that transported you here in the first place. Immerse yourself within.… Expand"
  },
  {
    "name": "Homeworld",
    "details_link": "https://www.metacritic.com/game/pc/homeworld",
    "publisher": "Sierra Entertainment",
    "release_date": "Aug 31 1999",
    "developers": [
      "Relic",
      "Relic Entertainment"
    ],
    "platforms": "PC",
    "num_players": "Up to 8 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Sci-Fi",
      "Sci-Fi",
      "General",
      "Command"
    ],
    "meta_score": 93,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/4/a005b637a637d3628b66c5b23e7c2573-98.jpg",
    "descriptions": "Deported to a harsh desert world, exiles have struggled for three thousand years to regain the stars. Now it's up to you to guide them home through a brutal empire bent on annihilation. Homeworld boasts amazing ship graphics and gorgeous deep-space vistas, a unique command and navigationDeported to a harsh desert world, exiles have struggled for three thousand years to regain the stars. Now it's up to you to guide them home through a brutal empire bent on annihilation. Homeworld boasts amazing ship graphics and gorgeous deep-space vistas, a unique command and navigation interface and white-knuckle real-time strategy. [Sierra]… Expand"
  },
  {
    "name": "Okami",
    "details_link": "https://www.metacritic.com/game/playstation-2/okami",
    "publisher": "Capcom",
    "release_date": "Sep 19 2006",
    "developers": [
      "Clover Studio"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 93,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/7/f1b3177e49ef39edb9eeeea169d04e9d-98.jpg",
    "descriptions": "In Okami, the legendary monster Orochi has come back to life and turned the world into a veritable wasteland. Players must assume the role of a wolf, an embodiment of the sun god Amaterasu, which is capable of wielding unimaginable power. The state of the world lies in gamer's hands as theyIn Okami, the legendary monster Orochi has come back to life and turned the world into a veritable wasteland. Players must assume the role of a wolf, an embodiment of the sun god Amaterasu, which is capable of wielding unimaginable power. The state of the world lies in gamer's hands as they must fight ominous beings and reclaim the earth from a curse that plagues it. It is crucial to help Amaterasu make the world a place where all living creatures can dwell once again. [Capcom]… Expand"
  },
  {
    "name": "The Elder Scrolls IV: Oblivion",
    "details_link": "https://www.metacritic.com/game/playstation-3/the-elder-scrolls-iv-oblivion",
    "publisher": "Bethesda Softworks",
    "release_date": "Mar 20 2007",
    "developers": [
      "4J Studios",
      "Bethesda Game Studios"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 93,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/8/0ba850e36e7ef60de881b2bf850b1716-98.jpg",
    "descriptions": "Oblivion is a single-player game that takes place in Tamriel's capital province, Cyrodiil. You are given the task of finding the hidden heir to a throne that sits empty, the previous emperor having been killed by an unknown assassin. With no true Emperor, the gates to Oblivion (theOblivion is a single-player game that takes place in Tamriel's capital province, Cyrodiil. You are given the task of finding the hidden heir to a throne that sits empty, the previous emperor having been killed by an unknown assassin. With no true Emperor, the gates to Oblivion (the equivalent of hell in the world of Tamriel) open, and demons begin to invade Cyrodiil and attack its people and towns. It's up to you to find the lost heir to the throne and unravel the sinister plot that threatens to destroy all of Tamriel. In keeping with the Elder Scrolls tradition, players have the option to experience the main quest at their own pace, and there are plenty of opportunities to explore the vast world and make your own way. Numerous factions can be joined, such as the thieves or mages guilds, and each contains its own complete storyline and the chance to rise to the head of the faction and reap further rewards. Oblivion features a groundbreaking new AI system, called Radiant AI, which gives non-player characters (NPCs) the ability to make their own choices based on the world around them. They decide where to eat or who to talk to and what they say. They sleep, go to church, and even steal items, all based on their individual characteristics. Full facial animations and lip-synching, combined with full speech for all dialog, allows NPCs to come to life like never before. [Bethesda]… Expand"
  },
  {
    "name": "Fallout 3",
    "details_link": "https://www.metacritic.com/game/xbox-360/fallout-3",
    "publisher": "Bethesda Softworks",
    "release_date": "Oct 28 2008",
    "developers": [
      "Bethesda Game Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 93,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/7/2592a146ce29b1d4bc818d4e6a58bbf8-98.jpg",
    "descriptions": "Vault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice, and an incredible cast of dynamicVault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice, and an incredible cast of dynamic characters. Every minute is a fight for survival against the terrors of the outside world – radiation, Super Mutants, and hostile mutated creatures. From Vault-Tec, America's First Choice in Post Nuclear Simulation. Vault 101 - Jewel of the Wastes. For 200 years, Vault 101 has faithfully served the surviving residents of Washington DC and its environs, now known as the Capital Wasteland. Though the global atomic war of 2077 left the US all but destroyed, the residents of Vault 101 enjoy a life free from the constant stress of the outside world. Giant Insects, Raiders, Slavers, and yes, even Super Mutants are all no match for superior Vault-Tec engineering. Yet one fateful morning, you awake to find that your father has defied the Overseer and left the comfort and security afforded by Vault 101 for reasons unknown. Leaving the only home you've ever known, you emerge from the Vault into the harsh Wasteland sun to search for your father, and the truth. [Bethesda Softworks]… Expand"
  },
  {
    "name": "Gears of War 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/gears-of-war-2",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov  7 2008",
    "developers": [
      "Epic Games"
    ],
    "platforms": "Xbox 360",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 93,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/73d5b14301766692addd210f3f97baa0-98.jpg",
    "descriptions": "Gears of War 2 builds upon the gameplay of the first title in every way. First, the scope of the action is bigger: new characters, more weapons, nastier enemies, bigger vehicles, and grander locales offer more action, more emotion, and more thrills. Next, every major aspect of the game hasGears of War 2 builds upon the gameplay of the first title in every way. First, the scope of the action is bigger: new characters, more weapons, nastier enemies, bigger vehicles, and grander locales offer more action, more emotion, and more thrills. Next, every major aspect of the game has been refined to create heightened, more immersive experiences. Finally, the overall tone of Gears of War 2 is more badass: replete with new weapon-specific executions, chainsaw duels, and shocking boss fights. Gears of War 2 raises the graphics bar for next-generation games through its breathtaking visual effects, which are made possible through advances in Unreal Engine 3. New visual effects include ambient occlusion, dynamic shadows, improved character lighting, the ability to render hundreds of on-screen characters simultaneously, improved water physics, additional blood and bullet decals, advanced destructible environments, new weather effects, and the introduction of fluid objects. When combined with the sweeping vistas and evocative locales in the world of Sera where the Gears of War 2 story unfolds, these additions help make this the most gorgeous game available this generation. Gears of War 2 continues to push deep, immersive storytelling in video games to greater heights. Humanity's epic battle for survival is felt on both the personal and epic levels as you explore multiple story arcs that introduce new characters and flesh out the histories of familiar ones. A new in-game conversational camera system also helps bring the compelling story to life in a cinematic fashion. [Microsoft]… Expand"
  },
  {
    "name": "God of War",
    "details_link": "https://www.metacritic.com/game/pc/god-of-war",
    "publisher": "PlayStation Studios",
    "release_date": "Jan 14 2022",
    "developers": [
      "SCE Santa Monica"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 4",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 93,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/1/d7bc93f705395a7d9cf86e9e4e572607-98.jpg",
    "descriptions": "The God of War has changed... and this is not the Kratos you know. A difficult and unfamiliar road awaits as you explore a stunning retelling of a classic story. Join Kratos as he adventures through a deep and reflective journey of growth, violence and the desire to become a better man forThe God of War has changed... and this is not the Kratos you know. A difficult and unfamiliar road awaits as you explore a stunning retelling of a classic story. Join Kratos as he adventures through a deep and reflective journey of growth, violence and the desire to become a better man for the sake of his son. In a world of monsters, dragons and gods, the weight of responsibility rests heavy on your shoulders -- and when your life is filled with blood and chaos, how can you prevent the mistakes of the past in order to protect your future?… Expand"
  },
  {
    "name": "SoulCalibur II",
    "details_link": "https://www.metacritic.com/game/gamecube/soulcalibur-ii",
    "publisher": "Namco",
    "release_date": "Aug 27 2003",
    "developers": [
      "Namco"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 93,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/98w-game.jpg",
    "descriptions": "Open the next chapter in world of Soul Calibur.  Soul Calibur II features seven distinctive gameplay modes including: Arcade, Versus, Time Attack, Survival, Team Battle, Practice, and the console exclusive Weapon Master.  Collect up to 200 different weapons and battle characters with theirOpen the next chapter in world of Soul Calibur.  Soul Calibur II features seven distinctive gameplay modes including: Arcade, Versus, Time Attack, Survival, Team Battle, Practice, and the console exclusive Weapon Master.  Collect up to 200 different weapons and battle characters with their own styles, strengths, and abilities.  In addition to the 13 fighters, each platform has unique special fighters:  Link for GameCube, Heihachi for PS2, and Spawn for Xbox.  Prove yourself through soul and sword.… Expand"
  },
  {
    "name": "World Soccer Winning Eleven 6 International",
    "details_link": "https://www.metacritic.com/game/playstation-2/world-soccer-winning-eleven-6-international",
    "publisher": "Konami",
    "release_date": "Mar 11 2003",
    "developers": [
      "KCET"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Soccer",
      "Sim"
    ],
    "meta_score": 93,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/4/c70f774f93314b065746edcbadd3af17-98.jpg",
    "descriptions": "North America, the wait is over. Experience the most realistic virtual recreation of the sport to date. Life-like player models, staggeringly realistic animations, and renowned gameplay bring a soccer experience that can't be beat. This critically acclaimed title is the must have soccer gameNorth America, the wait is over. Experience the most realistic virtual recreation of the sport to date. Life-like player models, staggeringly realistic animations, and renowned gameplay bring a soccer experience that can't be beat. This critically acclaimed title is the must have soccer game of the year. Find out what you've been missing. Create your own dream team in the Master League. [Konami]… Expand"
  },
  {
    "name": "NFL 2K3",
    "details_link": "https://www.metacritic.com/game/playstation-2/nfl-2k3",
    "publisher": "Sega",
    "release_date": "Aug 12 2002",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 93,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/3/1afbf33f86e4db230f188030cc62c536-98.jpg",
    "descriptions": "Get ready for a crowd of new features and improvements, including a completely new Franchise mode, thrilling new offensive and defensive animations, and broadcast-quality commentary regarded as the best in all of sports video games. Complete with all the updated rosters, the new NFLGet ready for a crowd of new features and improvements, including a completely new Franchise mode, thrilling new offensive and defensive animations, and broadcast-quality commentary regarded as the best in all of sports video games. Complete with all the updated rosters, the new NFL alignment changes, and completely redesigned stadiums, its time to hit the line hard and remember winning isn't a sometime thing: it's an all-time thing. [Sega]… Expand"
  },
  {
    "name": "Mass Effect 3",
    "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-3",
    "publisher": "Electronic Arts",
    "release_date": "Mar  6 2012",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Wii U",
      "Xbox 360"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 93,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/7/2fc081f5fbe90338b49495e2579643ba-98.jpg",
    "descriptions": "BioWare completes the Mass Effect Trilogy with Mass Effect 3. Earth is burning. Striking from beyond known space, a race of terrifying machines have begun their destruction of the human race. As Commander Shepard, an Alliance Marine, the only hope for saving mankind is to rally theBioWare completes the Mass Effect Trilogy with Mass Effect 3. Earth is burning. Striking from beyond known space, a race of terrifying machines have begun their destruction of the human race. As Commander Shepard, an Alliance Marine, the only hope for saving mankind is to rally the civilizations of the galaxy and launch one final mission to take back the Earth. … Expand"
  },
  {
    "name": "Resident Evil 4",
    "details_link": "https://www.metacritic.com/game/playstation-5/resident-evil-4",
    "publisher": "Capcom",
    "release_date": "Mar 24 2023",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 93,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/4/26098d10ee6e99935c062f01f1d83cd2-98.jpg",
    "descriptions": "Resident Evil 4, 2005’s legendary survival horror, is brought fully up-to-date in this ground-up remake. Six years after the events of Resident Evil 2, Raccoon City survivor Leon Kennedy has been dispatched to a secluded European village to investigate the disappearance of the US president’sResident Evil 4, 2005’s legendary survival horror, is brought fully up-to-date in this ground-up remake. Six years after the events of Resident Evil 2, Raccoon City survivor Leon Kennedy has been dispatched to a secluded European village to investigate the disappearance of the US president’s daughter. What he discovers there is unlike anything he has faced before. Every aspect of the classic game has been updated for the current generation, from modernized graphics and controls, to a reimagined storyline that may surprise even hardened fans of the original game.\r… Expand"
  },
  {
    "name": "Metal Gear Solid V: The Phantom Pain",
    "details_link": "https://www.metacritic.com/game/playstation-4/metal-gear-solid-v-the-phantom-pain",
    "publisher": "Konami",
    "release_date": "Sep  1 2015",
    "developers": [
      "Kojima Productions",
      "Moby Dick Studio"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Modern",
      "Action Adventure",
      "Modern",
      "Open-World"
    ],
    "meta_score": 93,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/5/92ba4685e153548a1d1ea590b8432b29-98.jpg",
    "descriptions": "Following the prologue METAL GEAR SOLID V: GROUND ZEROES, METAL GEAR SOLID V: THE PHANTOM PAIN concludes the METAL GEAR SOLID V experience by following the story of the protagonist of the series, Big Boss (a.k.a. Snake). The METAL GEAR SOLID V experience is Creator and Director HideoFollowing the prologue METAL GEAR SOLID V: GROUND ZEROES, METAL GEAR SOLID V: THE PHANTOM PAIN concludes the METAL GEAR SOLID V experience by following the story of the protagonist of the series, Big Boss (a.k.a. Snake). The METAL GEAR SOLID V experience is Creator and Director Hideo Kojima's first time incorporating open world gameplay to the groundbreaking METAL GEAR franchise.… Expand"
  },
  {
    "name": "Skies of Arcadia",
    "details_link": "https://www.metacritic.com/game/dreamcast/skies-of-arcadia",
    "publisher": "Sega",
    "release_date": "Nov 13 2000",
    "developers": [
      "Overworks"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 93,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/2/3b571a477cecac037901d45ddc84f8cf-98.jpg",
    "descriptions": "The age of exploration has dawned and you are about to embark on a magical journey, a voyage of discovery across the vast Skies of Arcadia in search of treasures untold, and where there is treasure, there will be Air Pirates! With over six vast lands to navigate, magnificent ships to fly andThe age of exploration has dawned and you are about to embark on a magical journey, a voyage of discovery across the vast Skies of Arcadia in search of treasures untold, and where there is treasure, there will be Air Pirates! With over six vast lands to navigate, magnificent ships to fly and customize, a host of weapons and magical spells to be discovered and unique Internet functions to aid your quest, Skies of Arcadia is the most immense gaming experience ever created.… Expand"
  },
  {
    "name": "The Legend of Zelda: Skyward Sword",
    "details_link": "https://www.metacritic.com/game/wii/the-legend-of-zelda-skyward-sword",
    "publisher": "Nintendo",
    "release_date": "Nov 20 2011",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Wii",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Fantasy",
      "General",
      "Fantasy",
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 93,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/3/b68f02ecc7a8fbf5789d8ae6efdcd0e6-98.jpg",
    "descriptions": "A Link to the Future - The Legend of Zelda: Skyward Sword shakes up the tried-and-true adventure game formula and marks a turning point for the franchise. The introduction of full motion controls enabled by Wii MotionPlus technology synchronizes player movements with Link's actions whileA Link to the Future - The Legend of Zelda: Skyward Sword shakes up the tried-and-true adventure game formula and marks a turning point for the franchise. The introduction of full motion controls enabled by Wii MotionPlus technology synchronizes player movements with Link's actions while offering the most intuitive play control of any game in the series to date.\r FEATURES:\r * The Legend of Zelda: Skyward Sword boasts the most realistic sword combat of any game to date, turning every encounter into a challenge of both brains and brawn. Wii MotionPlus technology accurately translates the angle of every sword slice, effectively putting Link's blade in the player's hand. Analyzing enemy attack and defense tendencies and counteracting with precise swings of the sword provide a satisfying experience that blends puzzle-solving with a new and distinctly unique combat system.\r * Explore a massive, multilayered world that seamlessly blends soaring exploration in a sea of clouds with intense ground-based adventuring that blurs the line between the main world and traditional Zelda dungeons. Link soars through the skies on the back of a noble bird and dives beneath the clouds to the continent below in an epic quest that lays the foundation for the events in the critically acclaimed The Legend of Zelda: Ocarina of Time.\r * Prepare for intense puzzle-solving as only The Legend of Zelda games can deliver. Exploration of the forests, volcanoes and deserts requires players to think on their feet as they solve puzzles, overcome obstacles and escape deadly traps. Once they find their way to each dungeon, they are confronted by even more puzzles guarded by fiendish enemies.\r * The Legend of Zelda: Skyward Sword redefines the traditional Zelda framework and introduces an arsenal of items, upgrades and rewards unlike any game in the franchise to date. The adventure guides players into, out of and back to dungeons and areas they've already completed. Along the way, Link gathers a massive inventory of peculiar items and resources that can be used to upgrade many of his weapons and equipment.\r  * Every copy in the initial production of the game will come packaged with a special music CD featuring orchestral arrangements of select songs that will be performed at The Legend of Zelda 25th Anniversary Symphony Concert.\r  * This version of The Legend of Zelda: Skyward Sword comes packaged with a special Gold Wii Remote Plus controller. You can also purchase a copy of the game without a controller.… Expand"
  },
  {
    "name": "Tetris Effect: Connected",
    "details_link": "https://www.metacritic.com/game/playstation-5/tetris-effect-connected",
    "publisher": "Enhance Games",
    "release_date": "Feb 22 2023",
    "developers": [
      "Monstars Inc.",
      "Resonair"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "genres": [
      "Puzzle",
      "Stacking"
    ],
    "meta_score": 93,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/8/9dbccdfe21468cf3a108bbdd75791d97-98.jpg",
    "descriptions": "Tetris Effect: Connected is Tetris like you've never seen it, or heard it, or felt it before - an incredibly addictive, unique, and breathtakingly gorgeous reinvention of one of the most popular puzzle games of all time, from the people who brought you the award-winning Rez Infinite andTetris Effect: Connected is Tetris like you've never seen it, or heard it, or felt it before - an incredibly addictive, unique, and breathtakingly gorgeous reinvention of one of the most popular puzzle games of all time, from the people who brought you the award-winning Rez Infinite and legendary puzzle game Lumines. Music, backgrounds, sounds, special effects - everything, down to the Tetris pieces themselves, pulse, dance, shimmer, and explode in perfect sync with how you're playing, making any of the game's 30+ stages and 10+ modes something you'll want to experience over and over again.… Expand"
  },
  {
    "name": "Mario Kart Super Circuit",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/mario-kart-super-circuit",
    "publisher": "Nintendo",
    "release_date": "Aug 26 2001",
    "developers": [
      "Intelligent Systems"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Racing",
      "Kart"
    ],
    "meta_score": 93,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/8/798ddc7ac13f8d73fa4434f3094b13d4-98.jpg",
    "descriptions": "Whoever hands out driver's licenses in the Mushroom Kingdom is about to be in some serious trouble.  Classic Mario Kart action is back once again, this time in a colorful, lightning-fast game that you can take anywhere.  Mario, Luigi, Peach, Toad, Wario, Yoshi, and Bowser are all tearing upWhoever hands out driver's licenses in the Mushroom Kingdom is about to be in some serious trouble.  Classic Mario Kart action is back once again, this time in a colorful, lightning-fast game that you can take anywhere.  Mario, Luigi, Peach, Toad, Wario, Yoshi, and Bowser are all tearing up the track, tossing Koopa Shells and laying banana peels along the way. Mario Kart: Super Circuit puts your driving skills to the test on 40 tracks, each littered with wild weapons and obstacles.  Four players can compete in Mario Kart: Super Circuit using only one Game Pak.  If each player has a copy of the game, bonus features and new modes of play become available.… Expand"
  },
  {
    "name": "Beat Saber",
    "details_link": "https://www.metacritic.com/game/pc/beat-saber",
    "publisher": "Hyperbolic Magnetism",
    "release_date": "May 21 2019",
    "developers": [
      "Hyperbolic Magnetism"
    ],
    "platforms": [
      "PlayStation 4",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Rhythm",
      "General",
      "Music"
    ],
    "meta_score": 93,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/8/af1484a5329836a8504ade60838b7eee-98.jpg",
    "descriptions": "Beat Saber is a VR rhythm game where your goal is to slash the beats which perfectly fit into precisely handcrafted music."
  },
  {
    "name": "Rock Band 3",
    "details_link": "https://www.metacritic.com/game/xbox-360/rock-band-3",
    "publisher": "MTV Games",
    "release_date": "Oct 26 2010",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 93,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/2/08660033f75cc4b9ac1a259b2ffc6093-98.jpg",
    "descriptions": "Rock Band returns with another iteration of the popular music game featuring new songs and instruments."
  },
  {
    "name": "Viewtiful Joe",
    "details_link": "https://www.metacritic.com/game/gamecube/viewtiful-joe",
    "publisher": "Capcom",
    "release_date": "Oct  7 2003",
    "developers": [
      "Clover Studio"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 93,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/5296417686fe71288614b9cdbd6a9abd-98.jpg",
    "descriptions": "Joe is no ordinary man and Viewtiful Joe is no ordinary game. Capcom's new superhero action game mixes funky cartoon-style visuals with classic side-scrolling gameplay and introduces the world's quirkiest million dollar action hero. More than just any ordinary dude, Joe must transform intoJoe is no ordinary man and Viewtiful Joe is no ordinary game. Capcom's new superhero action game mixes funky cartoon-style visuals with classic side-scrolling gameplay and introduces the world's quirkiest million dollar action hero. More than just any ordinary dude, Joe must transform into the ultimate superhero. It's up to you to activate the correct view mode like \"slow\" or \"zoom in\" in order to clobber your enemies with beautiful style. You can also speed up or slow down your visual effects for even more \"viewtiful\" moves. Viewtiful Joe mixes an innovative viewpoint with an amazing stunt-filled action movie universe.… Expand"
  },
  {
    "name": "Test Drive Le Mans",
    "details_link": "https://www.metacritic.com/game/dreamcast/test-drive-le-mans",
    "publisher": "Infogrames",
    "release_date": "Nov 13 2000",
    "developers": [
      "Melbourne House"
    ],
    "platforms": [
      "PC",
      "PC",
      "Dreamcast"
    ],
    "genres": [
      "Driving",
      "Racing",
      "GT / Street"
    ],
    "meta_score": 93,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/6/61a1c2a64a9080a1d9bd967a5026a1f8-98.jpg",
    "descriptions": "In order to join them, you will need excellent racing strategy and masterful driving skills to finish the race. You will have to be able to control the most powerful cars at speeds of over 350 kmh. You will have to bring out the hero in you! Are you ready for the challenge?"
  },
  {
    "name": "NBA 2K1",
    "details_link": "https://www.metacritic.com/game/dreamcast/nba-2k1",
    "publisher": "Sega",
    "release_date": "Nov  1 2000",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Sim"
    ],
    "meta_score": 93,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/7/ce62bcdcf49af8afe4afa342206d9f94-98.jpg",
    "descriptions": "Visual Concepts has tweaked and buffed out the annoying gameplay traits that plagued its original hoops game, and the result is a highly polished product."
  },
  {
    "name": "Hades",
    "details_link": "https://www.metacritic.com/game/pc/hades",
    "publisher": "Supergiant Games",
    "release_date": "Sep 17 2020",
    "developers": [
      "Supergiant Games"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action Adventure",
      "General",
      "Linear",
      "Roguelike"
    ],
    "meta_score": 93,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/5/66a3bd7342bf5b122b92862a465177ed-98.jpg",
    "descriptions": "Defy the god of death as you hack and slash your way out of the Underworld in this rogue-like dungeon crawler from the creators of Bastion and Transistor."
  },
  {
    "name": "Castlevania: Symphony of the Night",
    "details_link": "https://www.metacritic.com/game/playstation/castlevania-symphony-of-the-night",
    "publisher": "Konami",
    "release_date": "Oct  2 1997",
    "developers": [
      "Konami"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 93,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/0/3e92e4b30a3157280918c473cf495f6d-98.jpg",
    "descriptions": "As a descendant of Dracula, you must end the vampire bloodline. Can you rid the world of this unspeakable terror? Uncover the mystery of Castlevania and challenge an adventure as legendary as its name. Over 140 different enemies, bosses, and ghastly creatures. Awesome magical spells -As a descendant of Dracula, you must end the vampire bloodline. Can you rid the world of this unspeakable terror? Uncover the mystery of Castlevania and challenge an adventure as legendary as its name. Over 140 different enemies, bosses, and ghastly creatures. Awesome magical spells - transform into a bat, a wolf, or etheral mist. Hidden weapons, secrets, and characters...the largest Castlevania ever!… Expand"
  },
  {
    "name": "Star Wars: Knights of the Old Republic",
    "details_link": "https://www.metacritic.com/game/pc/star-wars-knights-of-the-old-republic",
    "publisher": "LucasArts",
    "release_date": "Nov 18 2003",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "iPhone/iPad",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Third-Person",
      "Third-Person",
      "General",
      "Western-Style"
    ],
    "meta_score": 93,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/9/fa5c67e8ea63a4c14cdacc9555accc60-98.jpg",
    "descriptions": "Engage in this saga set in the Golden Age of the Republic - over 4,000 years before the first Star Wars film, when both Jedi and Sith number in the thousands. With the Galaxy reeling from a recent conflict with the Dark Lords, the ongoing battle between the Jedi and the Sith rages on. YourEngage in this saga set in the Golden Age of the Republic - over 4,000 years before the first Star Wars film, when both Jedi and Sith number in the thousands. With the Galaxy reeling from a recent conflict with the Dark Lords, the ongoing battle between the Jedi and the Sith rages on. Your actions determine the outcome of this colossal galactic war - and your destiny as a Jedi. [LucasArts]… Expand"
  },
  {
    "name": "Virtua Fighter 4: Evolution",
    "details_link": "https://www.metacritic.com/game/playstation-2/virtua-fighter-4-evolution",
    "publisher": "Sega",
    "release_date": "Aug 13 2003",
    "developers": [
      "Sega"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 93,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/8/f16f9860b86318b58f9ba4a3b17973cf-98.jpg",
    "descriptions": "Challenge a steady stream of opponents with varying ranks and skill levels, with the impression that you're playing online against human opponents with different styles. Along with this illusion of online play, Virtua Fighter 4 has also been expanded upon, including the roster, the characterChallenge a steady stream of opponents with varying ranks and skill levels, with the impression that you're playing online against human opponents with different styles. Along with this illusion of online play, Virtua Fighter 4 has also been expanded upon, including the roster, the character customization features, the visuals, the training mode, and even the arcade mode. With the different tournaments and two new characters to explore, VF4: Evolution will put your fighting skills to the ultimate test.… Expand"
  },
  {
    "name": "Uncharted 4: A Thief's End",
    "details_link": "https://www.metacritic.com/game/playstation-4/uncharted-4-a-thiefs-end",
    "publisher": "SCEA",
    "release_date": "May 10 2016",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": "PlayStation 4",
    "num_players": "Up to 10 ",
    "genres": [
      "General",
      "Modern",
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 93,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/2/bccdebd6ae21b1a35353b6d9f27af1a5-98.jpg",
    "descriptions": "Set 3 years after the events of Uncharted 3, Nathan Drake has apparently left the world of fortune hunting behind. However, it doesn’t take long for adventure to come calling when Drake’s brother, Sam, re-emerges asking for his help to save his own life and offering an adventure Drake cannotSet 3 years after the events of Uncharted 3, Nathan Drake has apparently left the world of fortune hunting behind. However, it doesn’t take long for adventure to come calling when Drake’s brother, Sam, re-emerges asking for his help to save his own life and offering an adventure Drake cannot resist. On the hunt for Captain Henry Avery’s long-lost treasure, Sam and Drake embark on a journey to find Libertalia, the pirate utopia deep in the forests of Madagascar. Uncharted 4: A Thief’s End takes players around the globe, through jungle isles, urban cities and snow-capped peaks on the search for Avery’s fortune. [Naughty Dog]… Expand"
  },
  {
    "name": "Super Smash Bros. Ultimate",
    "details_link": "https://www.metacritic.com/game/switch/super-smash-bros-ultimate",
    "publisher": "Nintendo",
    "release_date": "Dec  7 2018",
    "developers": [
      "Nintendo",
      "HAL Labs",
      "Bandai Namco Games",
      "Sora Ltd."
    ],
    "platforms": "Switch",
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Fighting",
      "2D"
    ],
    "meta_score": 93,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/6/cb1c4fbf6a314df9c7354aea84c4198a-98.jpg",
    "descriptions": "Inklings from the Splatoon series, as well as returning Smash characters like Mario and Link will be making appearances in this classic Nintendo franchise's Switch debut. Faster combat, new items, new attacks, new defensive options, and more will keep the battle raging whether you’re at homeInklings from the Splatoon series, as well as returning Smash characters like Mario and Link will be making appearances in this classic Nintendo franchise's Switch debut. Faster combat, new items, new attacks, new defensive options, and more will keep the battle raging whether you’re at home or on the go. … Expand"
  },
  {
    "name": "Braid",
    "details_link": "https://www.metacritic.com/game/playstation-3/braid",
    "publisher": "Number None Inc.",
    "release_date": "Nov 12 2009",
    "developers": [
      "Hothead Games",
      "Number None Inc."
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 93,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/2/02b83437bb1f11162dc56654d570de8c-98.jpg",
    "descriptions": "[Playstation Network]  Explore the human condition and manipulate time as our hero Tim leaps onto the PlayStation Network in the lush, painterly world of Braid, a puzzle-platformer that takes you from a house in the city on a journey through a series of worlds to solve puzzles and rescue the[Playstation Network]  Explore the human condition and manipulate time as our hero Tim leaps onto the PlayStation Network in the lush, painterly world of Braid, a puzzle-platformer that takes you from a house in the city on a journey through a series of worlds to solve puzzles and rescue the princess. In each world, you have a different power to affect the way time behaves, including the ability to rewind, create parallel realities and utilize time dilation to overcome the many obstacles in your path. There is no filler in this game; every puzzle shows you something new and interesting about the game world. [Hothead Games]… Expand"
  },
  {
    "name": "Mass Effect 3",
    "details_link": "https://www.metacritic.com/game/playstation-3/mass-effect-3",
    "publisher": "Electronic Arts",
    "release_date": "Mar  5 2012",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "PC",
      "Wii U",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 93,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/6/e7a5d8d507c8bba07b21e91d067124b8-98.jpg",
    "descriptions": "BioWare completes the Mass Effect Trilogy with Mass Effect 3. Earth is burning. Striking from beyond known space, a race of terrifying machines have begun their destruction of the human race. As Commander Shepard, an Alliance Marine, the only hope for saving mankind is to rally theBioWare completes the Mass Effect Trilogy with Mass Effect 3. Earth is burning. Striking from beyond known space, a race of terrifying machines have begun their destruction of the human race. As Commander Shepard, an Alliance Marine, the only hope for saving mankind is to rally the civilizations of the galaxy and launch one final mission to take back the Earth. … Expand"
  },
  {
    "name": "Paper Mario",
    "details_link": "https://www.metacritic.com/game/nintendo-64/paper-mario",
    "publisher": "Nintendo",
    "release_date": "Feb  5 2001",
    "developers": [
      "Intelligent Systems"
    ],
    "platforms": "Nintendo 64",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 93,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/4/13d381476c4ff403d8be5b3b6e32d184-98.jpg",
    "descriptions": "Mario pals around in an all-new action adventure! Mario's back in his first adventure since Super Mario 64, and this time, Bowser's bent on preventing a storybook ending. When Princess Peach is kidnapped, Mario plots to rescue the seven Star Spirits and rid the Mushroom Kingdom of Koopa'sMario pals around in an all-new action adventure! Mario's back in his first adventure since Super Mario 64, and this time, Bowser's bent on preventing a storybook ending. When Princess Peach is kidnapped, Mario plots to rescue the seven Star Spirits and rid the Mushroom Kingdom of Koopa's cruel cohorts. As he travels from the tropical jungles of Lavalava Island to the frosty heights of Shiver Mountain, he'll meet up with seven all-new companions... and he'll need help from each one or there'll be no happily ever after.… Expand"
  },
  {
    "name": "Wipeout XL",
    "details_link": "https://www.metacritic.com/game/playstation/wipeout-xl",
    "publisher": "SCEE",
    "release_date": "Sep 30 1996",
    "developers": [
      "Psygnosis"
    ],
    "platforms": [
      "PC",
      "PlayStation"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "Futuristic"
    ],
    "meta_score": 93,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/5/6353c99bbe2280a9e8181e9a28ac32b6-98.jpg",
    "descriptions": "The original scorched the game world and became an instant classic. Fast-forward now to a brutal new generation of anti gravity racing. Loaded with faster, smoother graphics, more tracks, more crafts, and a range of nasty new weaponry. Wipeout XL will give you the rush of your life."
  },
  {
    "name": "Grand Theft Auto: San Andreas",
    "details_link": "https://www.metacritic.com/game/xbox/grand-theft-auto-san-andreas",
    "publisher": "Rockstar Games",
    "release_date": "Jun  7 2005",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 93,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/7a4316fe31d871863ce52498df332353-98.jpg",
    "descriptions": "Five years ago Carl Johnson escaped from the pressures of life in Los Santos, San Andreas... a city tearing itself apart with gang trouble, drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers. Now, it's the early 90s. Carl's got to goFive years ago Carl Johnson escaped from the pressures of life in Los Santos, San Andreas... a city tearing itself apart with gang trouble, drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers. Now, it's the early 90s. Carl's got to go home. His mother has been murdered, his family has fallen apart and his childhood friends are all heading towards disaster. On his return to the neighborhood, a couple of corrupt cops frame him for homicide. CJ is forced on a journey that takes him across the entire state of San Andreas, to save his family and to take control of the streets. … Expand"
  },
  {
    "name": "Resident Evil 2",
    "details_link": "https://www.metacritic.com/game/xbox-one/resident-evil-2",
    "publisher": "Capcom",
    "release_date": "Jan 25 2019",
    "developers": [
      "Capcom R&D Division 1"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 93,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/7/f40eafe48991fcaf2568b9795370089e-98.jpg",
    "descriptions": "In Resident Evil 2, the classic action, tense exploration, and puzzle solving gameplay that defined the Resident Evil series returns. Players join rookie police officer Leon Kennedy and college student Claire Redfield, who are thrust together by a disastrous outbreak in Raccoon City thatIn Resident Evil 2, the classic action, tense exploration, and puzzle solving gameplay that defined the Resident Evil series returns. Players join rookie police officer Leon Kennedy and college student Claire Redfield, who are thrust together by a disastrous outbreak in Raccoon City that transformed its population into deadly zombies. Both Leon and Claire have their own separate playable campaigns, allowing players to see the story from both characters’ perspectives. The fate of these two fan favorite characters is in players hands as they work together to survive and get to the bottom of what is behind the terrifying attack on the city. Will they make it out alive?… Expand"
  },
  {
    "name": "INSIDE",
    "details_link": "https://www.metacritic.com/game/xbox-one/inside",
    "publisher": "PLAYDEAD",
    "release_date": "Jun 29 2016",
    "developers": [
      "PLAYDEAD"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 93,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/1/b86322ec046780c594fda1702961ed0f-98.jpg",
    "descriptions": "Hunted and alone, a boy finds himself drawn into the center of a dark project. The second game from Limbo developer Playdead."
  },
  {
    "name": "World of Warcraft",
    "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft",
    "publisher": "Blizzard Entertainment",
    "release_date": "Nov 23 2004",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": "PC",
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Miscellaneous",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Board / Card Game",
      "Fantasy",
      "Fantasy"
    ],
    "meta_score": 93,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/3/c3383580eb989c3596326f861f063786-98.jpg",
    "descriptions": "Four years have passed since the aftermath of Warcraft III: Reign of Chaos, and a great tension now smolders throughout the ravaged world of Azeroth. As the battle-worn races begin to rebuild their shattered kingdoms, new threats, both ancient and ominous, arise to plague the world onceFour years have passed since the aftermath of Warcraft III: Reign of Chaos, and a great tension now smolders throughout the ravaged world of Azeroth. As the battle-worn races begin to rebuild their shattered kingdoms, new threats, both ancient and ominous, arise to plague the world once again. World of Warcraft is an online role-playing experience set in the award-winning Warcraft universe. Players assume the roles of Warcraft heroes as they explore, adventure, and quest across a vast world. Being \"Massively Multiplayer,\" World of Warcraft allows thousands of players to interact within the same world. Whether adventuring together or fighting against each other in epic battles, players will form friendships, forge alliances, and compete with enemies for power and glory. A dedicated live team will create a constant stream of new adventures to undertake, lands to explore, and monsters to vanquish. This content ensures that the game will never be the same from month to month, and will continue to offer new challenges and adventures for years to come. [Blizzard Entertainment]… Expand"
  },
  {
    "name": "Grand Theft Auto: San Andreas",
    "details_link": "https://www.metacritic.com/game/pc/grand-theft-auto-san-andreas",
    "publisher": "Rockstar Games",
    "release_date": "Jun  7 2005",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 2",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Open-World"
    ],
    "meta_score": 93,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/8/e7d44e60edd389e2916aa2bf9e5331bd-98.jpg",
    "descriptions": "Five years ago Carl Johnson escaped from the pressures of life in Los Santos, San Andreas... a city tearing itself apart with gang trouble, drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers. Now, it's the early 90s. Carl's got to goFive years ago Carl Johnson escaped from the pressures of life in Los Santos, San Andreas... a city tearing itself apart with gang trouble, drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers. Now, it's the early 90s. Carl's got to go home. His mother has been murdered, his family has fallen apart and his childhood friends are all heading towards disaster. On his return to the neighborhood, a couple of corrupt cops frame him for homicide. CJ is forced on a journey that takes him across the entire state of San Andreas, to save his family and to take control of the streets. [Rockstar]… Expand"
  },
  {
    "name": "Flipnote Studio",
    "details_link": "https://www.metacritic.com/game/ds/flipnote-studio",
    "publisher": "Nintendo",
    "release_date": "Aug 12 2009",
    "developers": [
      "Nintendo"
    ],
    "platforms": "DS",
    "genres": [
      "Miscellaneous",
      "General",
      "Application"
    ],
    "meta_score": 93,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/9198d8a64fb337b71ee137d799de93c3-98.jpg",
    "descriptions": "[DSiWare]  Let your inner artist loose with Flipnote Studio, an easy to use and surprisingly powerful animation application. Create Flipnotes by using the stylus to write letters and draw pictures, capture sounds using the microphone, and even insert photos captured with the Nintendo DSi[DSiWare]  Let your inner artist loose with Flipnote Studio, an easy to use and surprisingly powerful animation application. Create Flipnotes by using the stylus to write letters and draw pictures, capture sounds using the microphone, and even insert photos captured with the Nintendo DSi Camera. Save a Flipnote with multiple pages that run successively and you've just made an animated Flipnote that works like a flip book! And if you feel like sharing your masterpiece, send it to your Flipnote friends or, if you are a registered Hatena.com user, release it via Flipnote Hatena, an online service run by Japanese Web-service provider Hatena. With such a large set of tools available, you’ll quickly find that there are many ways to enjoy Flipnote Studio. [Nintendo]… Expand"
  },
  {
    "name": "World Soccer Winning Eleven 7 International",
    "details_link": "https://www.metacritic.com/game/playstation-2/world-soccer-winning-eleven-7-international",
    "publisher": "Konami",
    "release_date": "Feb 17 2004",
    "developers": [
      "KCET"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Soccer",
      "Sim"
    ],
    "meta_score": 93,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/8/bda6b61a55a5260d3fe3a39e6d118de8-98.jpg",
    "descriptions": "Winning Eleven 7 International features 100 teams, 21 stadiums, new player models and key additions to the Master League. Winning Eleven 7 also utilizes a custom designed engine that allows for great flexibility and customization. Upon entering a match, players will find incredibly masterfulWinning Eleven 7 International features 100 teams, 21 stadiums, new player models and key additions to the Master League. Winning Eleven 7 also utilizes a custom designed engine that allows for great flexibility and customization. Upon entering a match, players will find incredibly masterful gameplay, beautifully rendered stadiums and picture-perfect player models. While on the field, players will experience true-to-life gameplay, with carefully tuned A.I., realistic pace and balance. [Konami]… Expand"
  }
]