[{"name": "RIDE 4", "details_link": "https://www.metacritic.com/game/playstation-5/ride-4", "publisher": "Deep Silver", "release_date": "Jan 21 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/f28526c6e8aadb6eabd29ae769898492-98.jpg", "descriptions": "Choose among 176 Officially licensed bikes and ride on 30 tracks all around the world, carefully designed with an extraordinary level of detail! Every asset has been created starting from Cad data, laser and 3D scanning to achieve precision down to the smallest detail and let you enjoy theChoose among 176 Officially licensed bikes and ride on 30 tracks all around the world, carefully designed with an extraordinary level of detail! Every asset has been created starting from Cad data, laser and 3D scanning to achieve precision down to the smallest detail and let you enjoy the best two-wheel racing experience ever.\rchoose your path - Jump into an amazing and dynamic adventure that interacts with your decisions and choose your own path from the regional events up to the professional leagues. Show your riding skills through challenging races, ability tests, track days and a huge set of events. You could even become an official tester for the most celebrated manufacturers.\rday/night cycle, dynamic weather and Endurance Races - ride 4 features a fully dynamic weather conditions system and a complete day/night cycle. Experience the race in a new light and prove you are the best rider in any condition. And for the first time, the \"Endurance\" Mode will put your tenacity to the test, with animated pit-stops and long lasting races: prepare to face a world where strategy is the ultimate ingredient of your success.\rneural AI - let us introduce you to a.N.N.A. (Artificial neural network Agent), our revolutionary neural AI system based on machine learning. Race against faster, smarter, more accurate riders and compete with an AI more human than ever.\rexpanded customization - Race with your own style! Choose among plenty of official brands for your rider's outfit and customize your bikes aesthetically and mechanically. Unleash your creativity and design your helmet, suit and bike livery in total freedom thanks to our new graphics editor. Once you're done, share your creations online or just discover the best designs of the community.\ronline competitions - Enjoy the most complete and Lag-free online multiplayer experience ever thanks to our dedicated servers.\r… Expand"}, {"name": "Spy Hunter", "details_link": "https://www.metacritic.com/game/gamecube/spy-hunter", "publisher": "Midway", "release_date": "Mar 11 2002", "developers": ["Point of View"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/83983a4cc7ef48a9971b6272dd91a901-98.jpg", "descriptions": "The evil NOSTRA Corporation prepares to unleash havoc on the world, and only the SpyHunter is equipped to stop them. Get behind the wheel of the powerful G-6155 Interceptor, a vehicle that can transform into a boat, Jet Ski, or motorcycle. With an arsenal of both offensive and defensiveThe evil NOSTRA Corporation prepares to unleash havoc on the world, and only the SpyHunter is equipped to stop them. Get behind the wheel of the powerful G-6155 Interceptor, a vehicle that can transform into a boat, Jet Ski, or motorcycle. With an arsenal of both offensive and defensive weapons, you must elude NOSTRA spies, henchmen, and assassins at any cost. Hordes of air, ground, and water enemies pursue you as you try to save the world from the mind of a madman.… Expand"}, {"name": "Emergency: Fighters for Life", "details_link": "https://www.metacritic.com/game/pc/emergency-fighters-for-life", "publisher": "WizardWorks", "release_date": "Jul 31 1998", "developers": ["TopWare Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "General", "General"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/25eb8b7e373124ed14bb7cbea21f1a5f-98.jpg", "descriptions": "Emergency 4 boasts a rich mix of gripping real-time strategy game and true-to-life simulation. The player becomes head of operations in a fictional rescue and catastrophe management organisation, in command of a number of vehicles and staff from the fire department, medical rescue, policeEmergency 4 boasts a rich mix of gripping real-time strategy game and true-to-life simulation. The player becomes head of operations in a fictional rescue and catastrophe management organisation, in command of a number of vehicles and staff from the fire department, medical rescue, police and technical services. For the first time in the history of the Emergency series, all campaign missions are embedded into one continuous game set in a real town with a sheer infinite number of side-operations and tasks, so linking the various missions together. The player has to manage money as well as setting the right pre-requisites for upcoming missions. The player has to react to a variety of events, developing dynamically 24/7, set against a background of continuous day/night changes and constantly varying weather conditions.… Expand"}, {"name": "Transference", "details_link": "https://www.metacritic.com/game/playstation-4/transference", "publisher": "Ubisoft", "release_date": "Sep 18 2018", "developers": ["SpectreVision"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/e281b456571188ed94fb76f07c6f9def-98.jpg", "descriptions": "Transference is a psychological thriller and the first game collaboration between SpectreVision and Ubisoft. Bridging the gap between movies and games, we invite you to lose yourself in the destructive tale of a man's obsession as you explore his digitally recreated memories. Experience theTransference is a psychological thriller and the first game collaboration between SpectreVision and Ubisoft. Bridging the gap between movies and games, we invite you to lose yourself in the destructive tale of a man's obsession as you explore his digitally recreated memories. Experience the limits of techno-psychology, and escape a maze-like puzzle concealing a corrupted truth. Get projected into the digital consciousness of troubled case subjects and maybe you will influence their fate.… Expand"}, {"name": "Ty the Tasmanian Tiger 2: Bush Rescue", "details_link": "https://www.metacritic.com/game/playstation-2/ty-the-tasmanian-tiger-2-bush-rescue", "publisher": "EA Games", "release_date": "Oct 12 2004", "developers": ["Krome Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/d4d0103bb7bf340f3a11e7934b8912fe-98.jpg", "descriptions": "TY the Tasmanian Tiger 2 picks up where the original popular action platform game left off. The evil Boss Cass is up to his old tricks. After breaking out of Currawong Jail, this feathered villain has re-instated himself as the dictatorial ruler of Cassopolis, a high tech island home toTY the Tasmanian Tiger 2 picks up where the original popular action platform game left off. The evil Boss Cass is up to his old tricks. After breaking out of Currawong Jail, this feathered villain has re-instated himself as the dictatorial ruler of Cassopolis, a high tech island home to lizards and birds. Now Cass has hatched a plan to take over the world with an army of Uber Reptiles.  It's up to our boomerang-wielding hero, TY, and his newly formed team of Burramudgee Bush Rescue mates to stop Cass! Set in the Outback of Australia, TY the Tasmanian Tiger 2 offers platform gamers a huge open environment to explore by foot and vehicle. This time around TY is equipped with an arsenal of 21 upgradeable boomerangs, including the Lasharang, Kaboomarang, and Megarang. In addition, the game will feature five different \"Mech units\" to help TY fight large numbers of enemies and complete mini-missions.  With these \"Mech units\" TY has the ability to swim under lava; shoot lasers, Blastorangs, water or fire; and much more. TY is also challenged to complete driving and flying missions featuring combat and puzzle solving, with access to helicopters, submarines, and off-road trucks. Unlockable cart racing mini-games allow gamers to challenge their friends in seven unique cart racing levels. [Electronic Arts]… Expand"}, {"name": "SILT", "details_link": "https://www.metacritic.com/game/xbox-series-x/silt", "publisher": "Sold Out Software", "release_date": "Jun  1 2022", "developers": ["Spiral Circus"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/932a7f953d29a3ae47f97fed74079d67-98.jpg", "descriptions": "Silt is a puzzle-adventure set deep within a harrowing ocean abyss, where you play as a lone diver searching the deep and exploring dangerous waters to uncover long-forgotten mysteries. But the diver has a secret. Harnessing an unusual power, you’ll be able to possess sea creatures that roamSilt is a puzzle-adventure set deep within a harrowing ocean abyss, where you play as a lone diver searching the deep and exploring dangerous waters to uncover long-forgotten mysteries. But the diver has a secret. Harnessing an unusual power, you’ll be able to possess sea creatures that roam the ocean void, discovering new creatures and using their unique abilities to solve puzzles, traverse the environment, and make your way deeper into the darkness.… Expand"}, {"name": "LEGO Jurassic World", "details_link": "https://www.metacritic.com/game/switch/lego-jurassic-world", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 17 2019", "developers": ["Warner Bros."], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/21e608e660e072a52e48baf6ccd2a66e-98.jpg", "descriptions": "Following the epic storylines of Jurassic Park, The Lost World: Jurassic Park and Jurassic Park III, as well as the highly anticipated Jurassic World, LEGO Jurassic World is the first videogame where players will be able to relive and experience all four Jurassic films."}, {"name": "Hexologic", "details_link": "https://www.metacritic.com/game/switch/hexologic", "publisher": "MythicOwl", "release_date": "Jun 11 2018", "developers": ["MythicOwl"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/190344244fe21999fc7a83653f1b499b-98.jpg", "descriptions": "Immerse yourself in the beautiful world of Hexologic. Solve challenging, yet rewarding puzzles, listen to relaxing music, dive deep in the game's atmosphere and fall in love in sudoku again."}, {"name": "Cyberdimension Neptunia: 4 Goddesses Online", "details_link": "https://www.metacritic.com/game/playstation-4/cyberdimension-neptunia-4-goddesses-online", "publisher": "Idea Factory", "release_date": "Oct 10 2017", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/2f12c4eb3b66c36bbaf50af2be7fcd47-98.jpg", "descriptions": "In this hack 'n' slash adventure co-developed with Tamsoft and Compile Heart, everyone's favorite four Goddesses enter an online fantasy game world inspired by...themselves! Joined by the CPU Candidates, you'll fight in 4-person real-time brawls, unleash devastating Awakening Skills,In this hack 'n' slash adventure co-developed with Tamsoft and Compile Heart, everyone's favorite four Goddesses enter an online fantasy game world inspired by...themselves! Joined by the CPU Candidates, you'll fight in 4-person real-time brawls, unleash devastating Awakening Skills, customize with tons of cosmetic accessories, and even play online with others!… Expand"}, {"name": "LEGO Harry Potter: Years 5-7", "details_link": "https://www.metacritic.com/game/3ds/lego-harry-potter-years-5-7", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 11 2011", "developers": ["Traveller's Tales"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/f5f48d1b9ae5417a321f1505d5b2da10-98.jpg", "descriptions": "Based on the last three Harry Potter books and final four films, LEGO Harry Potter: Years 5-7 takes players through Harry Potter’s heroic adventures in the Muggle and wizarding worlds. From Privet Drive in Little Whinging to Diagon Alley, Hogsmeade and Hogwarts – plus new locations includingBased on the last three Harry Potter books and final four films, LEGO Harry Potter: Years 5-7 takes players through Harry Potter’s heroic adventures in the Muggle and wizarding worlds. From Privet Drive in Little Whinging to Diagon Alley, Hogsmeade and Hogwarts – plus new locations including Grimmauld Place, the Ministry of Magic, and Godric’s Hollow – players will encounter new faces, new challenges and new magic, preparing them for the ultimate face-off against Lord Voldemort.… Expand"}, {"name": "Dark Souls III: Ashes of Ariandel", "details_link": "https://www.metacritic.com/game/playstation-4/dark-souls-iii-ashes-of-ariandel", "publisher": "Bandai Namco Games", "release_date": "Oct 25 2016", "developers": ["From Software"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/6be9da705851e34d8ec3bd3f8f29e865-98.jpg", "descriptions": "Journey to the snowy world of Ariandel and encounter new areas, bosses, enemies, weapons, armor set, magic spells and more. Will you accept the challenge and embrace the darkness once more?"}, {"name": "Nexomon: Extinction", "details_link": "https://www.metacritic.com/game/switch/nexomon-extinction", "publisher": "PQube", "release_date": "Aug 28 2020", "developers": ["VEWO Interactive Inc."], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Trainer"], "meta_score": 71, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/4c39f8d8fab86457c41c3d7553af8349-98.jpg", "descriptions": "Nexomon: Extinction is a return to classic monster catching games, complete with a brand new story, eccentric characters and over 300 unique Nexomon to trap and tame. The world is on the brink of extinction as mighty Tyrant Nexomon fight for dominion over humans and monsters. Join the guildNexomon: Extinction is a return to classic monster catching games, complete with a brand new story, eccentric characters and over 300 unique Nexomon to trap and tame. The world is on the brink of extinction as mighty Tyrant Nexomon fight for dominion over humans and monsters. Join the guild of tamers and begin an epic journey to restore balance before all hope is lostBegin Your JourneyLeave the orphanage you grew up in, choose your first Nexomon and start your life as a Tamer.Explore a world teeming with NexomonTrap and tame over 300 brand new Nexomon from eleven elemental types, with powerful evolutions. Join the FightTyrant Nexomon roam free and the Guild of Tamers is stretched to the limit, can you change the tide of the battle? Battle Trainers and TyrantsStep up and take on would-be challengers and dangerous foes in beautifully animated turn-based battles. Discover Diverse RegionsFrom arid deserts to freezing tundra, navigate challenging environments and manage their effects on your Nexomon.Immerse yourself in the world of NexomonUncover secrets, stumble upon side-quests and encounter a raft of eccentric characters.Train hard to become the greatestDynamic difficulty will see the world around you get more challenging as you progress, as even defeated trainers come back stronger than before and ready to battle again!… Expand"}, {"name": "Uno", "details_link": "https://www.metacritic.com/game/playstation-4/uno", "publisher": "Ubisoft", "release_date": "Aug 16 2016", "developers": ["Ubisoft Chengdu"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/dc417f973905d7fdadf1bb94b0a9b905-98.jpg", "descriptions": "Uno makes its return to consoles and PC with an assortment of exciting features such as added video chat support and an all new theme system which adds more fun to enjoy your Uno game!Match cards either by matching color or value and play action cards to change things up. Race againstUno makes its return to consoles and PC with an assortment of exciting features such as added video chat support and an all new theme system which adds more fun to enjoy your Uno game!Match cards either by matching color or value and play action cards to change things up. Race against others to empty your hand before everyone else in either Classic Play or customize your experience with a variety of House Rules and match settings to ensure you and your friends never play the same game twice!Also, get ready to shake things up with new branded themes introducing never-before-seen Theme Cards that really change the way you play the game!… Expand"}, {"name": "CellFactor: Psychokinetic Wars", "details_link": "https://www.metacritic.com/game/playstation-3/cellfactor-psychokinetic-wars", "publisher": "Ubisoft", "release_date": "Jun  4 2009", "developers": ["Immersion Software & Graphics", "Timeline Interactive"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/51071d7146c2efe1cf6113f51653d10d-98.jpg", "descriptions": "[Playstation Network]  CellFactor: Psychokinetic Wars is a fast-paced first-person multiplayer shooter where you choose your side in the battle of technology vs. humanity. Manipulate your environment and kill your enemies with your choice of gunfire and/or telekinetic superpowers. Use your[Playstation Network]  CellFactor: Psychokinetic Wars is a fast-paced first-person multiplayer shooter where you choose your side in the battle of technology vs. humanity. Manipulate your environment and kill your enemies with your choice of gunfire and/or telekinetic superpowers. Use your mind to rip objects from the environment and smash them in any direction or use your powers to create a bullet-proof energy shield. Flying, teleporting and accelerated speed give you countless ways to kill or be killed. Take on the three single-player challenge modes (one mode for each character) or battle live enemies throughout the world in one of four multiplayer modes. Countless ways to kill your enemies: Guns, telekinesis and superpowers combine to offer you unparalleled battle options. Use your environment as a weapon: All maps contain objects to hurl at your enemies, including pipes that can be ripped off of walls, rocks, concrete blocks and many more. Massive online battles in four multiplayer modes: Death Match, Capture the Flag, Team Death Match, and Assault. 30 single player challenges: 10 for each character. 7 unique environments: From lava pools to ice storms, the environments impact the gameplay and give the warrior exciting options. Weapons: Pistols, sniper rifles, shotguns, assault rifles, small bombs, and rocket launchers. Powers: Telekinesis (summoning objects from the environment and chucking them at enemies), shooting lightning rods and energy beams (can kill in one shot), ability to blind your enemy, bullet-proof shields, teleporting, super jumping, flying, and accelerated running speed. Unlock rewards as you progress: As your score increases you gain access to rewards such as faster stamina regeneration, increased fire power, invisible to radar, longer super run, enhanced teleporting and more. Customize your character: Choose your armor and customize your look with a range of color schemes. [Sony]… Expand"}, {"name": "Silent Hill: Homecoming", "details_link": "https://www.metacritic.com/game/playstation-3/silent-hill-homecoming", "publisher": "Konami", "release_date": "Sep 30 2008", "developers": ["Double Helix Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/991dbf70eefbf397795a72327bfd0e0e-98.jpg", "descriptions": "The game thrusts players into a shadowy world of chaos and terror with atmospheric graphics and an original storyline that sheds new light on the desolate, fog-shrouded town of Silent Hill. Silent Hill: Homecoming follows Alex Shepherd, a war veteran returning home from an overseas tour ofThe game thrusts players into a shadowy world of chaos and terror with atmospheric graphics and an original storyline that sheds new light on the desolate, fog-shrouded town of Silent Hill. Silent Hill: Homecoming follows Alex Shepherd, a war veteran returning home from an overseas tour of duty to investigate the mysterious disappearance of his younger brother, Joshua. His travels lead him through the small, insular community of Shepherd's Glen and eventually through the hauntingly empty streets of Silent Hill. Building upon the series' trademark foundations of atmosphere, adventure and storytelling, Silent Hill: Homecoming introduces players to a frightening new experience. When confronted by the perverse incarnations of evil that roam Silent Hill and Shepherd's Glen, players are able to utilize an enhanced combat system and execute a number of offensive and defensive maneuvers as they experience every terrifying encounter with the game’s numerous nightmarish creatures. Players also have to solve a variety of puzzles as they progress through the highly atmospheric game world, using cues from the environment to unlock Silent Hill's darkest secrets. Continuing the series’ tradition of standout music and sound design, Silent Hill: Homecoming features an original soundtrack by famed composer Akira Yamaoka. [Konami]… Expand"}, {"name": "Moonscars", "details_link": "https://www.metacritic.com/game/playstation-5/moonscars", "publisher": "Humble Games", "release_date": "Sep 27 2022", "developers": ["Black Mermaid"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Metroidvania"], "meta_score": 71, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/338ae7043ef1c646a04780a31eebbb0f-98.jpg", "descriptions": "Push the limits of your combat skills, and master new abilities to progress through an unforgiving nonlinear 2D world. Face off against the relentless darkness that seeks to destroy you. In Moonscars, every death is a lesson learnt—and as you overcome each challenge, new truths will be revealed."}, {"name": "Fobia - St. Dinfna Hotel", "details_link": "https://www.metacritic.com/game/pc/fobia---st-dinfna-hotel", "publisher": "Maximum Games", "release_date": "Jun 28 2022", "developers": ["Pulsatrix Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/447a4ebda8bebb4b1d52169598ddd95c-98.jpg", "descriptions": "Treze Trilhas is home to the St. Dinfina Hotel, a decadent site that is the subject of numerous rumors including mysterious disappearances and paranormal activity. Hoping to break the story, amateur journalist Roberto Leite Lopes travels to Santa Catarina following a tip from his friendTreze Trilhas is home to the St. Dinfina Hotel, a decadent site that is the subject of numerous rumors including mysterious disappearances and paranormal activity. Hoping to break the story, amateur journalist Roberto Leite Lopes travels to Santa Catarina following a tip from his friend Stephanie.His investigative skills will be needed not only to uncover the truth but to survive when reality is turned upside down with his discovery of a camera that reveals different timelines, a fanatical cult, human experiments, and apparitions roaming the halls.Solve puzzles and scavenge for anything to stop their hunt as the past, present and future collide.… Expand"}, {"name": "Hoa", "details_link": "https://www.metacritic.com/game/pc/hoa", "publisher": "Skrollcat Studios", "release_date": "Aug 24 2021", "developers": ["Skrollcat Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 71, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/2a19b5c4f80a683043a95808b348192e-98.jpg", "descriptions": "Hoa is a beautiful puzzle-platforming game that features breathtaking hand-painted art, lovely music, and a peaceful, relaxing atmosphere."}, {"name": "Devil May Cry HD Collection", "details_link": "https://www.metacritic.com/game/xbox-one/devil-may-cry-hd-collection", "publisher": "Capcom", "release_date": "Mar 13 2018", "developers": ["Pipeworks Software", "Inc.", "NeoBards Entertainment"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 71, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/fc4557423dea33d567e0ec4ca2083a39-98.jpg", "descriptions": "Devil May Cry HD Collection brings the first three original Devil May Cry titles; Devil May Cry, Devil May Cry 2, and Devil May Cry 3: Dante's Awakening Special Edition together in one high definition package for the first time."}, {"name": "Stacking: The Lost Hobo King", "details_link": "https://www.metacritic.com/game/xbox-360/stacking-the-lost-hobo-king", "publisher": "THQ", "release_date": "Apr  6 2011", "developers": ["Double Fine Productions"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 71, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/8a8b2f5ec942103c6b6bb742b8f1a39c-98.jpg", "descriptions": "Stacking: The Lost Hobo King is the first DLC for Stacking."}, {"name": "Breakdown", "details_link": "https://www.metacritic.com/game/xbox/breakdown", "publisher": "Namco", "release_date": "Mar 16 2004", "developers": ["Namco"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 71, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/1f6b06fb26f20a4a467f2b429f659a8c-98.jpg", "descriptions": "Trapped inside a mysterious laboratory and unable to remember his past, Derrick Cole discovers his extraordinary powers as he fights for survival against a determined military faction and a legion of seemingly invincible superhuman warriors.  Breakdown is a science fiction thriller combiningTrapped inside a mysterious laboratory and unable to remember his past, Derrick Cole discovers his extraordinary powers as he fights for survival against a determined military faction and a legion of seemingly invincible superhuman warriors.  Breakdown is a science fiction thriller combining the best elements of shooters and fighters into a comprehensive first-person action adventure game.  High-end, real-time rendered graphics reveal Breakdown's intense storyline and brings an unprecedented level of realism to the gameplay experience.  The game features fierce hand-to-hand and weapons-based combat, challenging puzzles, surreal dream sequences, advanced AI, and massive, detailed environments for exploration.… Expand"}, {"name": "NFL Blitz Pro", "details_link": "https://www.metacritic.com/game/gamecube/nfl-blitz-pro", "publisher": "Midway", "release_date": "Dec  2 2003", "developers": ["Midway"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/696a79541d0da23bd4fbe507d821c389-98.jpg", "descriptions": "NFL Blitz Pro is an 11-on-11 licensed smash-mouth football videogame experience, delivering a new and sophisticated online feature set combined with its blend of lightning-fast, adrenaline-style gameplay.  NFL Blitz has been reinvented, without leaving behind the edginess of the previousNFL Blitz Pro is an 11-on-11 licensed smash-mouth football videogame experience, delivering a new and sophisticated online feature set combined with its blend of lightning-fast, adrenaline-style gameplay.  NFL Blitz has been reinvented, without leaving behind the edginess of the previous games in the series.  For the first time, NFL Blitz Pro will showcase authentic 11-on-11 gameplay with realistic rules, features, and online play.  New features also include a new Franchise mode, a reworked running game, and an improved AI.… Expand"}, {"name": "SpongeBob SquarePants: Battle for Bikini Bottom", "details_link": "https://www.metacritic.com/game/playstation-2/spongebob-squarepants-battle-for-bikini-bottom", "publisher": "THQ", "release_date": "Oct 31 2003", "developers": ["Heavy Iron Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/58333edf1918c10f6de69cad8cfa9754-98.jpg", "descriptions": "In an effort to cause the kind of global mayhem he has always dreamed of, the evil Plankton has set in motion his most diabolical plot ever to take over the world and the fate of Bikini Bottom has been put in the hands (or small tentacles) of three unsuspecting heroes. Put your platformIn an effort to cause the kind of global mayhem he has always dreamed of, the evil Plankton has set in motion his most diabolical plot ever to take over the world and the fate of Bikini Bottom has been put in the hands (or small tentacles) of three unsuspecting heroes. Put your platform skills to the ultimate test as SpongeBob, Patrick or Sandy Cheeks with an array of insane new maneuvers and power-ups at your disposal! Explore a huge 3D world, encounter familiar friends and finally put an end to Plankton's evil scheme! [THQ]… Expand"}, {"name": "Enclave", "details_link": "https://www.metacritic.com/game/pc/enclave", "publisher": "VU Games", "release_date": "Mar 10 2003", "developers": ["Starbreeze"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/b85405d0c9461725634c97328d09a3b4-98.jpg", "descriptions": "In an age long past, the rift was formed, decisively separating the lands of light and the plains of darkness by an impassable chasm. Over time the Enclave of light grew strong and prosperous, while those confined to war-ravaged plains of the outlands harbored nothing but hatred andIn an age long past, the rift was formed, decisively separating the lands of light and the plains of darkness by an impassable chasm. Over time the Enclave of light grew strong and prosperous, while those confined to war-ravaged plains of the outlands harbored nothing but hatred and jealousy. Now, after hundreds of years, the rift is closing, and it is only a matter of time before a full-scale war erupts. Enter the fantasy universe of Enclave where the eternal struggle between good and evil rages, and your actions will determine the fate of a nation.  [Vivendi Universal]… Expand"}, {"name": "Phalanx", "details_link": "https://www.metacritic.com/game/game-boy-advance/phalanx", "publisher": "Kemco", "release_date": "Dec 27 2001", "developers": ["Kemco"], "platforms": "Game Boy Advance", "genres": ["Action", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/597848d7c5200a176acac75857b502e3-98.jpg", "descriptions": "Aliens are invading Planet Delia! You're Rick Sanada, a crack fighter pilot assigned to the PHALANX A-144, the most powerful spacecraft ever created. Power-up your multiple weapons systems and hang on--the breathtaking graphics in this stunning arcade shooter are light years beyond anythingAliens are invading Planet Delia! You're Rick Sanada, a crack fighter pilot assigned to the PHALANX A-144, the most powerful spacecraft ever created. Power-up your multiple weapons systems and hang on--the breathtaking graphics in this stunning arcade shooter are light years beyond anything seen in a portable game!… Expand"}, {"name": "World War III: Black Gold", "details_link": "https://www.metacritic.com/game/pc/world-war-iii-black-gold", "publisher": "JoWooD Entertainment AG", "release_date": "Oct 16 2001", "developers": ["Reality Pump"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 71, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/194d50e7c2331b9a66d5dd696c123229-98.jpg", "descriptions": "A fully 3D RTS featuring three parties: the USA, Russia and Iraq. Whichever is chosen allows the player to select two campaigns, consisting of 5 missions on average. Features a first-rate weapon system: anti-aircraft, anti-tank, mass destruction weapons, highly destructive chemical weapons.A fully 3D RTS featuring three parties: the USA, Russia and Iraq. Whichever is chosen allows the player to select two campaigns, consisting of 5 missions on average. Features a first-rate weapon system: anti-aircraft, anti-tank, mass destruction weapons, highly destructive chemical weapons. The existing weapon systems allow the player to exploit weaknesses in the enemy defense. [JoWood]… Expand"}, {"name": "Arx Fatalis", "details_link": "https://www.metacritic.com/game/xbox/arx-fatalis", "publisher": "DreamCatcher Interactive", "release_date": "Dec 23 2003", "developers": ["Arkane Studios"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/2fa6b5f7aac2a4cb5c5e2ca13e76fde0-98.jpg", "descriptions": "Arx is the name of an underground urban environment where your special experience begins.  A threatening atmosphere has forced Arx inhabitants to take refuge in a dwarf mine, where goblins, trolls and ratmen dwell.  Arx Fatalis is an RPG that combines an intriguing story, a deep environment,Arx is the name of an underground urban environment where your special experience begins.  A threatening atmosphere has forced Arx inhabitants to take refuge in a dwarf mine, where goblins, trolls and ratmen dwell.  Arx Fatalis is an RPG that combines an intriguing story, a deep environment, and a high level of interactivity.  You can interact with objects and NPCs, cast spells, solve puzzles, and explore the underground fantasy world.  … Expand"}, {"name": "Guitar Hero: On Tour", "details_link": "https://www.metacritic.com/game/ds/guitar-hero-on-tour", "publisher": "Activision", "release_date": "Jun 22 2008", "developers": ["Vicarious Visions"], "platforms": "DS", "num_players": "2  Online", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/01afd8a4115820d32be414c9afc8508b-98.jpg", "descriptions": "Guitar Hero: On Tour continues to build on the franchise’s signature easy-to-play, yet difficult to master addictive gameplay, and now lets players take their experience on the road wherever they go.  Players use the Guitar Hero pick-stylus on the touch screen to strum their favorite tunesGuitar Hero: On Tour continues to build on the franchise’s signature easy-to-play, yet difficult to master addictive gameplay, and now lets players take their experience on the road wherever they go.  Players use the Guitar Hero pick-stylus on the touch screen to strum their favorite tunes and create their rock ‘n’ roll legacy in career mode. Fans can also join together to play co-op mode using a local wireless network, or battle each other in a Guitar Duel using new Battle Items unique to the DS platform.  For example, players must blow into the microphone to extinguish a pyrotechnics effects gone wrong, or use the touch screen to autograph a crazed fan’s shirt in the middle of their set. Featuring five unlockable new venues, the game lets players personalize their experience by choosing the color of their axe of choice, selecting to play as one of six characters -- two of which are all new and exclusive to Guitar Hero: On Tour – and outfitting their guitarist in numerous styles. [Activision]… Expand"}, {"name": "Morbid: The Seven Acolytes", "details_link": "https://www.metacritic.com/game/pc/morbid-the-seven-acolytes", "publisher": "Merge Games", "release_date": "Dec  3 2020", "developers": ["Still Running"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 71, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/3faa2ea1b0e362713ae88466c40ff004-98.jpg", "descriptions": "Morbid: The Seven Acolytes is a Horrorpunk Action RPG filled with Lovecraftian horrors and Cronenbergian gore."}, {"name": "King of Fighters R-2", "details_link": "https://www.metacritic.com/game/switch/king-of-fighters-r-2", "publisher": "SNK Corporation", "release_date": "Aug  7 2020", "developers": ["Code Mystics Inc.", "SNK Corporation"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/bd96f387c78aae5c03ed16b64bbdea95-98.jpg", "descriptions": "Mix it up in COLOR with King Of Fighters R-2 now on NEOGEO Pocket Color! Get SKILLS in the MAKING Mode and create your very own custom-made character! You can also play two-player VS. MODE battles and trade SKILLS using the NEOGEO Pocket Link Cable! 14 characters to choose from including 2Mix it up in COLOR with King Of Fighters R-2 now on NEOGEO Pocket Color! Get SKILLS in the MAKING Mode and create your very own custom-made character! You can also play two-player VS. MODE battles and trade SKILLS using the NEOGEO Pocket Link Cable! 14 characters to choose from including 2 new characters make King Of Fighters R-2 H-O-T!… Expand"}, {"name": "DreamWorks Over the Hedge", "details_link": "https://www.metacritic.com/game/ds/dreamworks-over-the-hedge", "publisher": "Activision", "release_date": "May  5 2006", "developers": ["Vicarious Visions"], "platforms": ["PlayStation 2", "DS"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/a7736df6fe38f51ffc8d97f448e1d9dc-98.jpg", "descriptions": "When a housing development intrudes on their woodland habitat and an opossum is kidnapped by an evil exterminator, three wise-cracking rodents and one very neurotic reptile invade the 'burbs in a quest to rescue their friend. Battle the exterminator and his army of mind-controlled mammals,When a housing development intrudes on their woodland habitat and an opossum is kidnapped by an evil exterminator, three wise-cracking rodents and one very neurotic reptile invade the 'burbs in a quest to rescue their friend. Battle the exterminator and his army of mind-controlled mammals, and save the forest (and your own hide) from the world’s peskiest critter-man. [Activision]… Expand"}, {"name": "Guardians of Middle-Earth", "details_link": "https://www.metacritic.com/game/xbox-360/guardians-of-middle-earth", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Dec  4 2012", "developers": ["Monolith Productions"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "Strategy", "Real-Time", "MOBA", "MOBA"], "meta_score": 71, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/e0371c34e8e7af1cf89c940c646331b4-98.jpg", "descriptions": "Guardians of Middle-earth brings up to 10 players together in five versus five competitive multiplayer battle arenas in the epic setting of Middle-earth. The game offers more than 20 iconic guardians, including Gandalf, Sauron, Gollum, Thrain and many more, for players to control in playerGuardians of Middle-earth brings up to 10 players together in five versus five competitive multiplayer battle arenas in the epic setting of Middle-earth. The game offers more than 20 iconic guardians, including Gandalf, Sauron, Gollum, Thrain and many more, for players to control in player versus player (PVP) matches. Gamers will have the ability to connect with other players via an in-game voice communication system, as well as access to a comprehensive online stat and leader board system where they can track friends' victories and defeats, and more.… Expand"}, {"name": "Cozy Grove", "details_link": "https://www.metacritic.com/game/playstation-4/cozy-grove", "publisher": "The Quantum Astrophysicists Guild", "release_date": "Apr  8 2021", "developers": ["Spry Fox"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "General", "Virtual", "Virtual Life"], "meta_score": 71, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/b0eecfc080c9945c3bbedda2faf59e80-98.jpg", "descriptions": "Welcome to Cozy Grove, a life-sim game about camping on a haunted, ever-changing island. As a Spirit Scout, you'll wander the island's forest each day, finding new hidden secrets and helping soothe the local ghosts. With a little time and a lot of crafting, you'll bring color and joy back toWelcome to Cozy Grove, a life-sim game about camping on a haunted, ever-changing island. As a Spirit Scout, you'll wander the island's forest each day, finding new hidden secrets and helping soothe the local ghosts. With a little time and a lot of crafting, you'll bring color and joy back to Cozy Grove!Features:* Beautiful, dynamic, hand-drawn landscapes that come alive when you help a spirit in need.* Dozens of memorable characters and spirits for you to find and befriend. Each spirit has a unique, extensive story for you to unravel over time.* Collect spirit animals, craft decorations, go fishing and more!* 40+ hour campaign filled with side quests, designed to span months of playtime.… Expand"}, {"name": "Blue Fire", "details_link": "https://www.metacritic.com/game/switch/blue-fire", "publisher": "Graffiti Games", "release_date": "Feb  4 2021", "developers": ["Graffiti Games", "Robi Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/cd3ebca23dc9f8385a8cbd61df675c57-98.jpg", "descriptions": "A Dark World Awaits – Travel through the perished world of Penumbra to explore unique areas filled with diverse enemies, sharp 3D platforming challenges, quests, collectibles, and more. Embark on an extraordinary journey through the desolated kingdom of Penumbra and discover the hiddenA Dark World Awaits – Travel through the perished world of Penumbra to explore unique areas filled with diverse enemies, sharp 3D platforming challenges, quests, collectibles, and more. Embark on an extraordinary journey through the desolated kingdom of Penumbra and discover the hidden secrets of this long-forgotten land. Explore mystical temples, encounter survivors and take on strange quests to collect valuable items. Along your adventure, slash your way through daunting adversaries, roam across mysterious and abandoned regions, leap through deadly traps and ultimately master the art of movement.… Expand"}, {"name": "Assassin's Creed Rogue Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-rogue-remastered", "publisher": "Bandai Namco Games", "release_date": "Mar 20 2018", "developers": ["Ubisoft"], "platforms": ["Stadia", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/b77aebce3720e9b7b07f7db96905d7cf-98.jpg", "descriptions": "18th century, North America. Amid the chaos and violence of the French and Indian War, Shay Patrick Cormac, a fearless young member of the Assassin Brotherhood, undergoes a dark transformation that will forever shape the future of the colonies. After a dangerous mission gone tragically18th century, North America. Amid the chaos and violence of the French and Indian War, Shay Patrick Cormac, a fearless young member of the Assassin Brotherhood, undergoes a dark transformation that will forever shape the future of the colonies. After a dangerous mission gone tragically wrong, Shay turns his back on the Assassins who, in response, attempt to end his life. Cast aside by those he once called brothers, Shay sets out on a mission to wipe out all who turned against him, to ultimately become the most feared Assassin hunter in history. In Assassin’s Creed Rogue Remastered, you will experience the slow transformation from Assassin to Assassin hunter. Follow your own creed and set off on an extraordinary journey through New York City, the wild river valley, and far away to the icy cold waters of the North Atlantic in pursuit of your ultimate goal to bring down the Assassins for good. [Ubisoft]… Expand"}, {"name": "Tesla vs Lovecraft", "details_link": "https://www.metacritic.com/game/playstation-4/tesla-vs-lovecraft", "publisher": "10tons", "release_date": "Mar 13 2018", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/cedc7b2867d60f427ea806b837d5c376-98.jpg", "descriptions": "Tesla vs Lovecraft is an intense top-down twin stick arena shooter. Play as the enigmatic inventor Nikola Tesla harnessing the static energy to power up Tesla-Mech and give the lovecraftian nightmares a lesson in horror!\r Tesla vs Lovecraft is a top-down twin stick shooter with goal basedTesla vs Lovecraft is an intense top-down twin stick arena shooter. Play as the enigmatic inventor Nikola Tesla harnessing the static energy to power up Tesla-Mech and give the lovecraftian nightmares a lesson in horror!\r Tesla vs Lovecraft is a top-down twin stick shooter with goal based levels. The games highlight features are Quantum Teleportation, which allows the player to warp short distances even through solid objects, and the Tesla-Mech, which provides the player an immense boost to firepower for a limited time.\r Genre hallmarks such as a large arsenal of weapons, a multitude of player empowering perks, monster crushing powerups, and secondary weapon abilities are also included.… Expand"}, {"name": "Nuclear Dawn", "details_link": "https://www.metacritic.com/game/pc/nuclear-dawn", "publisher": "Viva Media", "release_date": "Sep 22 2011", "developers": ["Interwave Studios"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/9f7af01d3bb7ca2dd855c5cfd74c13d0-98.jpg", "descriptions": "Play as a soldier in a war-torn post-apocalyptic landscape, modelled on modern cities, and take the fight to your enemies as armoured, assault or stealth infantry, using various weapons and loadouts to accomplish your objectives. The first person shooter action in Nuclear Dawn is hard, fastPlay as a soldier in a war-torn post-apocalyptic landscape, modelled on modern cities, and take the fight to your enemies as armoured, assault or stealth infantry, using various weapons and loadouts to accomplish your objectives. The first person shooter action in Nuclear Dawn is hard, fast and unforgiving, with weapons that rely on skill and tactics more than on twitch reflexes and map memorization.… Expand"}, {"name": "LEGO Pirates of the Caribbean: The Video Game", "details_link": "https://www.metacritic.com/game/3ds/lego-pirates-of-the-caribbean-the-video-game", "publisher": "Disney Interactive Studios", "release_date": "May 10 2011", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "3DS"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/3e3e3efd3743dc4033708fe66eb5d270-98.jpg", "descriptions": "LEGO Pirates of the Caribbean: The Video Game will be based in the world of the globally successful film franchise, incorporating storylines, locations and characters from the first three films (\"Pirates of the Caribbean: The Curse of the Black Pearl,\" \"Pirates of theLEGO Pirates of the Caribbean: The Video Game will be based in the world of the globally successful film franchise, incorporating storylines, locations and characters from the first three films (\"Pirates of the Caribbean: The Curse of the Black Pearl,\" \"Pirates of the Caribbean: Dead Man's Chest\" and \"Pirates of the Caribbean: At World's End\") as well as the upcoming fourth film, \"Pirates of the Caribbean: On Stranger Tides.\" … Expand"}, {"name": "Runes of Magic", "details_link": "https://www.metacritic.com/game/pc/runes-of-magic", "publisher": "Frogster Interactive", "release_date": "Mar 19 2009", "developers": ["Runewaker Entertainment"], "platforms": "PC", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 71, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/74c4c815903c0c7ab32df956d8a5ff53-98.jpg", "descriptions": "Runes of Magic is a fantasy MMORPG (Massively Multiplayer Online Role-Playing Game), in which words can create, but also destroy. Here you can explore and discover a magical world full of wonders and ancient riddles. Encounter arcane and dangerous creatures and solve the mystery of aRunes of Magic is a fantasy MMORPG (Massively Multiplayer Online Role-Playing Game), in which words can create, but also destroy. Here you can explore and discover a magical world full of wonders and ancient riddles. Encounter arcane and dangerous creatures and solve the mystery of a long-perished kingdom. You have access to a dual class system which gives you the freedom to combine your main and secondary class, in order to build your character the way you want conceive it. Learn professions and special skills, to forge mighty armor and weaponry or to enhance them. Accumulate unique in-Game collector's cards, which provide you with information and data of all creatures you have already encountered. Relax after a hard day of labor in your own house, which you can arrange just the way you want to. On your long journey from a helpless novice to a proud hero you will always be accompanied by magical runes and potent oracles - fragments of the divine book Taborea. Use them wisely for they might also lure you on to destruction. Master their handling and do not repeat past mistakes. Legend has it, that he, who embraces the oracle and acquires its might, will garner absolute power over the future. It is now up to you, to write the history of the world! Choose from a flexible class system with six main classes and 36 combinations. In addition you have access to a dynamic item and rune system, as well as three gathering and eight crafting professions. Obtain your own house, which you can proudly show your friends and others. Fight against powerful monsters and obtain magnificent treasures and glorious titles. Be astonished by regular updates. [Frogster Interactive]… Expand"}, {"name": "Sherlock Holmes: Nemesis", "details_link": "https://www.metacritic.com/game/pc/sherlock-holmes-nemesis", "publisher": "The Adventure Company", "release_date": "Apr 14 2008", "developers": ["Frogwares"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/a3433fea07f31e73902542f40e3be4b7-98.jpg", "descriptions": "(Also known as \"Sherlock Holmes versus Arsène Lupin\")  Having grappled with the machinations of a cult of Cthulhu in his last PC adventure, the world's greatest detective is now ready to challenge Arsène Lupin, the gentleman thief. Lupin, a character invented by renowned French writer(Also known as \"Sherlock Holmes versus Arsène Lupin\")  Having grappled with the machinations of a cult of Cthulhu in his last PC adventure, the world's greatest detective is now ready to challenge Arsène Lupin, the gentleman thief. Lupin, a character invented by renowned French writer Maurice Leblanc, has thrilled millions of readers worldwide with his exploits, and proves a perfect foil for Sherlock Holnmes. This new Sherlock Holmes game sends players to 19th Century London where Arsène Lupin, a young French burglar with an impressive track record, has just challenged Scotland Yard and the most famous of detectives - Sherlock Holmes. Lupin has announced that he plans to rob the capital of five objects of immense value over the course of five days. The objects are housed in highly prestigious locations such as the National Gallery, the British Museum, the Tower of London and even Buckingham Palace! Sherlock Holmes will have to muster all his courage and ingenuity to save England from terrible humiliation. The game invites you to visit 19th century London in all its splendor and to travel through superb decors which have been faithfully reproduced with the game's 3D engine. With famous places and some of the most prestigious landmarks as your playing field, it is as if you are on your own guided tour of one of Europe's most fabulous cities. If the pace of the adventure and its many surprises leaves you breathless, take a break and enjoy looking at the hundreds of works of art, all faithfully reproduced in their real locations. [Focus Home Interactive]… Expand"}, {"name": "Escape Plan", "details_link": "https://www.metacritic.com/game/playstation-vita/escape-plan", "publisher": "SCEA", "release_date": "Feb 14 2012", "developers": ["Fun Bits"], "platforms": ["PlayStation 4", "PlayStation Vita"], "genres": ["Miscellaneous", "Puzzle", "Action", "General", "Puzzle", "General"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/2bd1642efc431f19d5a787006b0f3465-98.jpg", "descriptions": "From the producers behind Fat Princess, comes an original new experience -- Escape Plan. Escape Plan takes advantage of the Vita system's multi-touch display, rear touch panel, swipe interfaces and motion sensor, putting the fate of the hapless heroes in the palm of your hand. Players canFrom the producers behind Fat Princess, comes an original new experience -- Escape Plan. Escape Plan takes advantage of the Vita system's multi-touch display, rear touch panel, swipe interfaces and motion sensor, putting the fate of the hapless heroes in the palm of your hand. Players can swipe, squeeze, poke and slap Lil and Laarg to manipulate the characters and interact with the diverse environments. Only you can help them survive each deadly room before their captor and nemesis, Bakuki, recycles them and turns them into his minions... or sheep. [Sony]… Expand"}, {"name": "Call of Duty: Modern Warfare 2 Campaign Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-modern-warfare-2-campaign-remastered", "publisher": "Activision", "release_date": "Mar 31 2020", "developers": ["Infinity Ward"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/3e625f05e669d55b3e2180e6c712f7e9-98.jpg", "descriptions": "Relive the epic single-player Campaign from the 2009 blockbuster Call of Duty: Modern Warfare 2, remastered in true high-definition. Experience classic missions including Cliffhanger, The Gulag, and Whiskey Hotel as you join Soap, Price, Ghost and the rest of Task Force 141 in theRelive the epic single-player Campaign from the 2009 blockbuster Call of Duty: Modern Warfare 2, remastered in true high-definition. Experience classic missions including Cliffhanger, The Gulag, and Whiskey Hotel as you join Soap, Price, Ghost and the rest of Task Force 141 in the globe-spanning fight to restore order to the world.… Expand"}, {"name": "50 Cent: Blood on the Sand", "details_link": "https://www.metacritic.com/game/xbox-360/50-cent-blood-on-the-sand", "publisher": "THQ", "release_date": "Feb 24 2009", "developers": ["Swordfish Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/363ce815b2f9470af0e4c52569dbcaf8-98.jpg", "descriptions": "After performing a sold-out concert in a fictional war-torn country, 50 Cent and the G-Unit are robbed of their cash and paid in kind with a priceless diamond encrusted skull, which is subsequently stolen by the local crime-lord’s gang. Determined to collect his payment and enact revenge onAfter performing a sold-out concert in a fictional war-torn country, 50 Cent and the G-Unit are robbed of their cash and paid in kind with a priceless diamond encrusted skull, which is subsequently stolen by the local crime-lord’s gang. Determined to collect his payment and enact revenge on the gangsters foolish enough to disrespect him, 50 Cent sets out to get rich or die trying. 50 Cent: Blood on the Sand features intense third-person action/shooter gameplay, an intuitive cover system, drop in and drop out online multiplayer co-op, merciless melee counter-kills and a soundtrack that combines 50 Cent’s greatest hits with 18 exclusive new tracks. 50 Cent: Blood on the Sand puts players in control of their own virtual action film by blending visuals from the Unreal 3 game engine technology with an over-the-top story and voiceover work by 50 Cent and the G-Unit’s Tony Yayo, Lloyd Banks, and DJ Whoo Kid. [THQ]… Expand"}, {"name": "NHL 22", "details_link": "https://www.metacritic.com/game/playstation-5/nhl-22", "publisher": "Electronic Arts", "release_date": "Oct 12 2021", "developers": ["Electronic Arts"], "platforms": ["PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 12 ", "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 71, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/1/03d45780a7f2f66a3ff3abba70bc5ea5-98.jpg", "descriptions": "Powered by Frostbite, EA SPORTS™NHL®22 gets the superstar treatment. For the first time ever, experience EA SPORTS NHL on one of the industry’s most powerful game engines bringing visual detail to every hit, deke and shot. Superstar X-Factors lets you feel the personality and power of NHLPowered by Frostbite, EA SPORTS™NHL®22 gets the superstar treatment. For the first time ever, experience EA SPORTS NHL on one of the industry’s most powerful game engines bringing visual detail to every hit, deke and shot. Superstar X-Factors lets you feel the personality and power of NHL superstars with an all-new ability system that unlocks the unique skills of the league’s most elite players. Authentic to real player skill and style, the stars of the NHL truly come to life in EA SPORTS NHL 22 making their time on ice more influential than ever . From HUT to World of Chel, Superstar X-Factors brings new class based strategy to every game mode. EA SPORTS NHL 22is an all new game for a new generation, giving you more ways to play and compete than ever before.… Expand"}, {"name": "Portal Knights", "details_link": "https://www.metacritic.com/game/playstation-4/portal-knights", "publisher": "505 Games", "release_date": "May 23 2017", "developers": ["Keen Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/014f1acecff7f530cc409662f705a556-98.jpg", "descriptions": "Leave the familiar world behind and step into the fantastic unknown with Portal Knights, a cooperative 3D sandbox action-RPG! Level up your character and craft powerful gear to defeat your enemies in real-time tactical combat. Explore dozens of randomly-generated islands and restore peace toLeave the familiar world behind and step into the fantastic unknown with Portal Knights, a cooperative 3D sandbox action-RPG! Level up your character and craft powerful gear to defeat your enemies in real-time tactical combat. Explore dozens of randomly-generated islands and restore peace to a world torn apart by The Fracture.\r Begin your journey as a Warrior, Mage, or Ranger. Defeat formidable monsters and epic bosses while gathering resources to craft powerful weapons, armor and spells to help you on your adventure.\r Travel between worlds by collecting portal shards and rebuilding the ancient gateways. Meet 100+ memorable NPCs, recruit a pet, and experience dynamic events that happen in real-time! Build your perfect home and choose from dozens of materials and furnishings to make it your own!\r Craft your adventure. Forge your hero. Defeat the Portal Guardians. Become the ultimate Portal Knight!… Expand"}, {"name": "Loot Rascals", "details_link": "https://www.metacritic.com/game/pc/loot-rascals", "publisher": "Hollow Ponds", "release_date": "Mar  7 2017", "developers": ["Hollow Ponds"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/31da534d6fc3ea5a8866a92d264b5ed5-98.jpg", "descriptions": "Only you can rescue Big Barry - your huge robot head pal - from a space theme park that’s been invaded by a tentacled pan-dimensional godbeast."}, {"name": "FIFA World Cup: Germany 2006", "details_link": "https://www.metacritic.com/game/ds/fifa-world-cup-germany-2006", "publisher": "Electronic Arts", "release_date": "Apr 24 2006", "developers": ["EA Canada", "Exient Entertainment"], "platforms": ["PC", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/efb5d13f811303930e14617a5d651a0f-98.jpg", "descriptions": "2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA SPORTS has emulated close to 100 of the world's superstars, capturing their playing styles and individual likenesses. In addition to enabling gamers to participate in the 2006 FIFA World Cup Germany by taking control of one of 127 national teams, the game features new compelling modes of play, including the groundbreaking Global Challenge that tests even the most hardcore soccer fan by recreating classic moments in FIFA World Cup history. [Electronic Arts]… Expand"}, {"name": "Lichtspeer: Double Speer Edition", "details_link": "https://www.metacritic.com/game/switch/lichtspeer-double-speer-edition", "publisher": "Crunching Koalas", "release_date": "Sep  7 2017", "developers": ["Crunching Koalas", "Lichthund"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/ee19ae50f3ad4bfe22f5fbe80f82359f-98.jpg", "descriptions": "In a land filled with Penguin Vikings, Wurst Zombies, and Hipster Ice Giants, survival is an art. Fortunately, an ancient champion with an elegant weapon has been summoned to please the Gods and restore balance to the universe. Grab your lightspear, become a Germonaut, and traverse landsIn a land filled with Penguin Vikings, Wurst Zombies, and Hipster Ice Giants, survival is an art. Fortunately, an ancient champion with an elegant weapon has been summoned to please the Gods and restore balance to the universe. Grab your lightspear, become a Germonaut, and traverse lands straight out of Germanic myths. Survive with style and expand your powers to fight for the glory and amusement of the almighty Gods. [Nintendo]… Expand"}, {"name": "The Hong Kong Massacre", "details_link": "https://www.metacritic.com/game/playstation-4/the-hong-kong-massacre", "publisher": "VRESKI", "release_date": "Jan 29 2019", "developers": ["VRESKI"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 71, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/aba37fd315b817354ef0bcf3e7d385ad-98.jpg", "descriptions": "Inspired by classic action movies, The Hong Kong Massacre places you at the centre of a hard-boiled revenge story, filled with brutal, cinematic shootouts and vivid underworld locations. Take on the role of a former police detective bent on exacting vengeance for his partner's murder and useInspired by classic action movies, The Hong Kong Massacre places you at the centre of a hard-boiled revenge story, filled with brutal, cinematic shootouts and vivid underworld locations. Take on the role of a former police detective bent on exacting vengeance for his partner's murder and use of a mixture of raw firepower, slow-motion and dive/dodge mechanics to tear your way through the criminal ranks.\r… Expand"}, {"name": "Juiced 2: Hot Import Nights", "details_link": "https://www.metacritic.com/game/playstation-3/juiced-2-hot-import-nights", "publisher": "THQ", "release_date": "Oct 22 2007", "developers": ["Juice Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/f488369937f6562e7ab6e6a2f73432b0-98.jpg", "descriptions": "Juiced 2: HIN evolves the current street racing scene, letting players experience the culture of the real-life HIN tour, the nation's largest lifestyle custom car show in an intense racing experience. Featuring track and drift racing at real-world locations around the globe, next-gen AI andJuiced 2: HIN evolves the current street racing scene, letting players experience the culture of the real-life HIN tour, the nation's largest lifestyle custom car show in an intense racing experience. Featuring track and drift racing at real-world locations around the globe, next-gen AI and vehicle customization, Juiced 2: HIN brings street racing to life, allowing players to test their skills at live street racing events against a back-drop of DJs, fashion, models and musicians. New features include addictive drift/ powersliding races and \"Driver DNA\" that tracks gamers' personal driving traits. These profiles, along with the profiles of select celebrities will be available for download across all online gaming systems. Racing developer Juice Games has evolved the game-play in its online racing, giving players the power to create their car, assemble their crew and put it all on the line in intense pink slip and crew races. Gamers can bet cash on each event, bringing a gambling element to the game that greatly increases the importance of each race. [THQ]… Expand"}, {"name": "Metal Slug 4 & 5", "details_link": "https://www.metacritic.com/game/playstation-2/metal-slug-4-5", "publisher": "SNK", "release_date": "May 25 2005", "developers": ["BrezzaSoft"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/fa9f152561c9c400f69162b5c53ffe78-98.jpg", "descriptions": "Metal Slug 4 Storyline: In the year 20XX, a cyber-terrorist group has struck out at the world by unleashing a computer virus through the internet with a sole purpose of hijacking the militaries of the world's nations. Join Marco, Fio, and new Metal Slug team members Trevor and Nadia to stopMetal Slug 4 Storyline: In the year 20XX, a cyber-terrorist group has struck out at the world by unleashing a computer virus through the internet with a sole purpose of hijacking the militaries of the world's nations. Join Marco, Fio, and new Metal Slug team members Trevor and Nadia to stop the distribution of the virus before it's too late. Metal Slug 5 Storyline: A research installation developing the next-generation of Metal Slugs is attached by unknown forces and a disc containing Metal Slug secrets has been stolen. Lead Marco, Tarma, Eri and Fio into \"The Corridor of Fire\" to recover the secrets and destroy the paramilitary syndicate known as the Ptolemaic Army. [SNK]… Expand"}, {"name": "Draglade", "details_link": "https://www.metacritic.com/game/ds/draglade", "publisher": "Atlus", "release_date": "Dec  4 2007", "developers": ["Dimps Corporation"], "platforms": "DS", "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/9d0081cf8d9bb2c40b3dda43faf47451-98.jpg", "descriptions": "In Draglade, it's not just about how hard you hit or fast you move, it's also how well you can groove.  An innovative mix of music and fighting means you will have to use your rhythm as well as your reflexes if you want to overcome your foes and show everyone that you’re a Draglade master.In Draglade, it's not just about how hard you hit or fast you move, it's also how well you can groove.  An innovative mix of music and fighting means you will have to use your rhythm as well as your reflexes if you want to overcome your foes and show everyone that you’re a Draglade master. In the world of Draglade, Grapping has become the world's premier spectator sport. Scientists will discover how to turn atmospheric Matter into energy. Soon thereafter, a means of harnessing this energy – G-Cons – will allow for the conversion of this power into a weapon called a \"Glade\". When a Glade hits something, the Glade emits a sound. Fighters and entertainers quickly realized the potential of Grapping, as the music generated by the clashing Glades in combat provided an experience that couldn't be matched in any other sport. In this world overcome by Grapping fever, four young indie Grappers – Hibito, Guy, Kyle, and Daichi – will strive to reach the ranks of the Major Grappers. [Atlus USA]… Expand"}, {"name": "Conga Master Party!", "details_link": "https://www.metacritic.com/game/switch/conga-master-party!", "publisher": "Rising Star Games", "release_date": "Sep 28 2017", "developers": ["Rising Star Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 71, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/9e81ad84b066225ea962d59296a19388-98.jpg", "descriptions": "The dance floor fills, the line gets longer… come on down, it's time to conga! Shake your virtual hips to the ridiculously fun arcade action of Conga Master as everyone fights to make the longest conga line possible. No rhythm required – anyone can conga. Playing Conga Master couldn't beThe dance floor fills, the line gets longer… come on down, it's time to conga! Shake your virtual hips to the ridiculously fun arcade action of Conga Master as everyone fights to make the longest conga line possible. No rhythm required – anyone can conga. Playing Conga Master couldn't be easier: steer your dancer across the floor, adding people to your line as you go. Longer congas let you add people faster, but watch out for pigs stinking up your line! Even better, drag three friends onto the dance floor for some local multiplayer conga madness and see who'll become the true Conga Master. [Nintendo]… Expand"}, {"name": "Full Spectrum Warrior: Ten Hammers", "details_link": "https://www.metacritic.com/game/playstation-2/full-spectrum-warrior-ten-hammers", "publisher": "THQ", "release_date": "Mar 28 2006", "developers": ["Pandemic Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Military"], "meta_score": 71, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/74331c4c49048d45aa8ad551dfa27351-98.jpg", "descriptions": "As squad leader, players coordinate the actions of multiple infantry fire teams, leading them through a variety of hostile environments. An intuitive control scheme allows direction of squads in real-time as players outthink, outmaneuver and outgun enemies through more than 12 levels ofAs squad leader, players coordinate the actions of multiple infantry fire teams, leading them through a variety of hostile environments. An intuitive control scheme allows direction of squads in real-time as players outthink, outmaneuver and outgun enemies through more than 12 levels of intense warfare. Players will utilize authentic battlefield tactics as they confront the enemy with a deadly arsenal of weapons, the latest military equipment, and new Player-controlled mechanized units. With an enhanced multiplayer mode, players can go online and battle friends through a variety of new head-to-head and co-op objective-based missions. [THQ]… Expand"}, {"name": "Knockout Home Fitness", "details_link": "https://www.metacritic.com/game/switch/knockout-home-fitness", "publisher": "XSEED Games", "release_date": "Sep 28 2021", "developers": ["Pocket"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Exercise / Fitness"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/33d81bf09c6c246ba4e2472389ebebdf-98.jpg", "descriptions": "Kick your workout up a notch! Grab a Joy-Con in each hand and get ready to achieve great results with a workout program based on martial arts moves developed specifically for the Nintendo Switch. Knock out inactivity with short and intense calorie-burning exercises using punches, elbows,Kick your workout up a notch! Grab a Joy-Con in each hand and get ready to achieve great results with a workout program based on martial arts moves developed specifically for the Nintendo Switch. Knock out inactivity with short and intense calorie-burning exercises using punches, elbows, knees, kicks, and more to get a full body workout in half the time! Exercises designed by experts for maximum efficiency based on strikes from not just boxing, but also Muay Thai, karate, and kung-fu, all to keep you fighting fit! Multiple game modes allow you to exercise in a way that fits your lifestyle and schedule. Take care of your body by properly warming up or cooling down with guided stretches, strive toward your goals in Personal Training Mode, or jump into 3-Minute Fitness Mode for short-duration, high-efficiency exercises when you are short on time. Over 25 diverse music tracks, ranging from electronic dance music to rock, will have you grooving as you punch and kick to the beat. Keep up the training and you can unlock additional exercises and moves to further round out your total body workout. With 60 courses created for both beginners and veterans alike, you can be sure to get a good workout no matter where you are on your fitness journey! … Expand"}, {"name": "Pinstripe", "details_link": "https://www.metacritic.com/game/pc/pinstripe", "publisher": "Armor Games", "release_date": "Apr 24 2017", "developers": ["Thomas Brush"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "General"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/565ead518020dfafea57136fd4f5052c-98.jpg", "descriptions": "Pinstripe is an emotionally charged adventure through Hell created entirely by a one-man team over the course of five years. Play as Teddy, an estranged ex-minister forced to venture through the frozen afterlife in search of his three-year-old daughter Bo, and her perverse kidnapper.Pinstripe is an emotionally charged adventure through Hell created entirely by a one-man team over the course of five years. Play as Teddy, an estranged ex-minister forced to venture through the frozen afterlife in search of his three-year-old daughter Bo, and her perverse kidnapper. Discover the dark secrets of Teddy's past, and confront his sleazy, demonic nemesis, Mr. Pinstripe.… Expand"}, {"name": "Naruto Powerful Shippuden", "details_link": "https://www.metacritic.com/game/3ds/naruto-powerful-shippuden", "publisher": "Namco Bandai Games America", "release_date": "Mar  5 2013", "developers": ["Inti Creates"], "platforms": "3DS", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 71, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/ad4cd28f081642cb52ca69dae7e6d612-98.jpg", "descriptions": "NARUTO Powerful Shippuden includes a Story Mode as well as an Endless Battle Mode so players can choose to either follow a progressive storyline or just pull out the punches for a sprightly ninja showdown. The action-packed gameplay allows players to earn experience points to power up theirNARUTO Powerful Shippuden includes a Story Mode as well as an Endless Battle Mode so players can choose to either follow a progressive storyline or just pull out the punches for a sprightly ninja showdown. The action-packed gameplay allows players to earn experience points to power up their vivacious characters and also use the touch screen to strengthen special attacks. Fans will recognize their favorite characters from the NARUTO franchise such as Kakashi, Sakura, Gaara, and many more; all can be called upon as support characters in the midst of battle. With familiar friends at their sides and ninja moves up their sleeves, players will embark on the journey of becoming a powerful Leaf ninja to knock out opponents or even become a knock-out with sexy jutsu.… Expand"}, {"name": "Assetto Corsa Competizione", "details_link": "https://www.metacritic.com/game/playstation-4/assetto-corsa-competizione", "publisher": "505 Games", "release_date": "Jun 23 2020", "developers": ["505 Games"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 71, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/70af6c2d1b0037e54c0793013657ac6c-98.jpg", "descriptions": "Assetto Corsa Competizione is an extraordinary racing simulation game allowing players to experience the real atmosphere of the GT3 championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved. Sprint,Assetto Corsa Competizione is an extraordinary racing simulation game allowing players to experience the real atmosphere of the GT3 championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved. Sprint, Endurance and Spa 24 Hours races come to life with an incredible level of realism, in both single and multiplayer modes. Born from KUNOS Simulazioni's long-term experience, this racing simulator takes full advantage of Unreal Engine 4 to ensure photorealistic weather conditions and graphics, night races, motion capture animations, reaching a new standard in terms of driving realism and immersion, thanks to its further improved tyre and aerodynamic models.… Expand"}, {"name": "Warlock: Master of the Arcane", "details_link": "https://www.metacritic.com/game/pc/warlock-master-of-the-arcane", "publisher": "Paradox Interactive", "release_date": "May  8 2012", "developers": ["Ino-Co", "1C:Ino-Co", "Ino-Co Plus"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/11bf6fcd58cc7221a808c526adf4a1a6-98.jpg", "descriptions": "Warlock – Master of the Arcane invites players to take on the role of the Great Mage and build a powerful magical empire, giving mighty mages the ability to control armies and wield magic to wage war against one another, as they compete with other wizards for the title of Warlock."}, {"name": "Meteos Wars", "details_link": "https://www.metacritic.com/game/xbox-360/meteos-wars", "publisher": "Q Entertainment", "release_date": "Dec 10 2008", "developers": ["Q Entertainment"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/790bda2fa29f36486376245e09d820bd-98.jpg", "descriptions": "[Xbox Live Arcade]  Take a ride through an intergalactic journey where you slide, stack, and ignite your blocks to blast away the world-ending Meteos. Only you can stop them from falling and crushing your planet! Master combo links and power-ups to challenge your friends in intense[Xbox Live Arcade]  Take a ride through an intergalactic journey where you slide, stack, and ignite your blocks to blast away the world-ending Meteos. Only you can stop them from falling and crushing your planet! Master combo links and power-ups to challenge your friends in intense multiplayer sessions. Planets galore: Defend over 20 planets, each with its own alien race, Meteos blocks, unique gravity effects, and visual and audio style. Special techniques: Master four of the \"Planet Impact\" special attacks -- Armageddon, Gambit, Sentinel, and Tempest. Massive modes: Test your action-puzzle skills in a variety of single-player modes, including Mission Mode, Attack Mode, or Vs. Mode. Three challenges await you in Attack Mode -- the One-Minute attack, 100-Meteo attack, and the Challenge attack. Multiplayer action: Blast away your opponents over Xbox LIVE in Matchmaking Vs. Mode and become one of the best Meteos Wars players in the community. You can also go head-to-head with your friend in Local Vs. Mode. New accessories: Collect various accessories for your aliens by clearing certain objectives. Accessorize your alien and give it some personality. [Q Entertainment]… Expand"}, {"name": "Spellbreak", "details_link": "https://www.metacritic.com/game/switch/spellbreak", "publisher": "Proletariat, Inc.", "release_date": "Sep  3 2020", "developers": ["Proletariat", "Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/ce5bb8d6c46d5e3f73b797a60158ea29-98.jpg", "descriptions": "Spellbreak is an epic fantasy action spellcasting game where players choose a class, weave spectacular spell combinations and fight other players to become an all-powerful battlemage."}, {"name": "Bird & Beans", "details_link": "https://www.metacritic.com/game/ds/bird-beans", "publisher": "Nintendo", "release_date": "Apr  5 2009", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/b394eb8430508aa42ff79d18a459ac4f-98.jpg", "descriptions": "[DSiWare; Also known as \"Pyoro\"]  Using an elastic tongue, players must scramble to collect falling beans. The harder a bean is to catch, the more points it's worth. [Nintendo]"}, {"name": "TimeShift", "details_link": "https://www.metacritic.com/game/pc/timeshift", "publisher": "Sierra Entertainment", "release_date": "Oct 30 2007", "developers": ["Saber Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/afcfb2295021ef99711bf6847d33b16d-98.jpg", "descriptions": "TimeShift challenges players to use their minds along with their weapons to battle enemies and solve complex gameplay puzzles. TimeShift changes the fundamental way gamers think about first-person shooters by using the fourth dimension: time itself. TimeShift empowers players with the giftTimeShift challenges players to use their minds along with their weapons to battle enemies and solve complex gameplay puzzles. TimeShift changes the fundamental way gamers think about first-person shooters by using the fourth dimension: time itself. TimeShift empowers players with the gift of time manipulation, including the ability to slow down, stop and rewind the world around them, allowing them to move freely while opponents and game objects are frozen in time.  TimeShift feature mores than 30 combat missions, each showcasing time control elements and challenges that players must solve using both their extraordinary capabilities and combat expertise. An array of devastating and unique weaponry from the world's alternate timeline is at the player's disposal, including bizarre incarnations of traditional sniper guns, machine guns, pistols and more, as well as never-before-imagined armaments from an era humanity has never seen. [Atari]… Expand"}, {"name": "NHL 2K8", "details_link": "https://www.metacritic.com/game/xbox-360/nhl-2k8", "publisher": "Take-Two Interactive", "release_date": "Sep 10 2007", "developers": ["Kush Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/bbfefb315ef4e38845cf9bdadab93c3f-98.jpg", "descriptions": "Fully redesigned next-gen player models with accurate equipment and updated player faces brings you realistic hockey. Goaltending has been completely overhauled with instinctive AI, entirely new animations, and situation specific behaviors. Goaltenders now come out and challenge, guard theFully redesigned next-gen player models with accurate equipment and updated player faces brings you realistic hockey. Goaltending has been completely overhauled with instinctive AI, entirely new animations, and situation specific behaviors. Goaltenders now come out and challenge, guard the post, perform spectacular butterfly saves, and much more. A new control system delivers an experience that transcends the hockey videogame genre. Take control of \"the DEEPEST franchise mode in the business,\" now complete with realistic CBA features including waivers, two-way contracts, restricted and unrestricted free agents, and salary cap management. Off-season has also been revamped, boasting a brand new negotiation system, improved draft, and refurbished free agent signing. Topping off everything is the addition of an all-new player progression system and dynamic player types. 2K Sports Online - Go head-to-head against the best players on the planet and enter for your chance to win a new Dodge. [2K Sports]… Expand"}, {"name": "Tak 2: The Staff of Dreams", "details_link": "https://www.metacritic.com/game/playstation-2/tak-2-the-staff-of-dreams", "publisher": "THQ", "release_date": "Oct 11 2004", "developers": ["Avalanche Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/065dc76da159f32f240d4b579005b5e9-98.jpg", "descriptions": "Tak 2: The Staff of Dreams will continue following Tak on his adventures against evil. However, players will take on the role of a more experienced Tak as he goes on an epic adventure that will require him to learn all new Juju magic in order to recover the Nightmare Scepter and defeat theTak 2: The Staff of Dreams will continue following Tak on his adventures against evil. However, players will take on the role of a more experienced Tak as he goes on an epic adventure that will require him to learn all new Juju magic in order to recover the Nightmare Scepter and defeat the evil shaman, Tlaloc, once and for all. Players will maneuver Tak as he's armed with new Juju abilities. He will master the ancient Juju magic of the animals, allowing him to possess various creatures and turn himself into a Spirit Animal. This innovative sequel will also feature nine interactively designed linear environments and a returning cast of favorite characters, along with three brand new Juju gods and the introduction of Jibolba's brother, JB. Nine new Nightmare Creatures will also help to further the action. In addition, Tak will be outfitted with new Juju powered artifacts, including the powerful Dream Shaker, which affords him the power to close dream rifts. [THQ]… Expand"}, {"name": "Relicta", "details_link": "https://www.metacritic.com/game/playstation-4/relicta", "publisher": "Ravenscourt", "release_date": "Aug  3 2020", "developers": ["Mighty Polygon"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/e5d4ddf1f8101513ad3cf83601b60712-98.jpg", "descriptions": "Relicta is a first-person puzzle game whose main mechanics combine magnetism and gravity. The player is equipped with a pair of special gloves that allow them to change the magnetic and gravitational properties of experimental cubes scattered around each level. These cubes can be moved byRelicta is a first-person puzzle game whose main mechanics combine magnetism and gravity. The player is equipped with a pair of special gloves that allow them to change the magnetic and gravitational properties of experimental cubes scattered around each level. These cubes can be moved by the player, either carrying them bodily or using magnetism or gravity. They can also be placed on teleporting machines to warp them to another teleporter and help solve puzzles. Mechanics really come alive when combined in ingenious ways. For instance, magnetism can be used to repel or attract cubes, but repelling a cube that has previously “anti-gravitated” gives you a frictionless device that will retain inertia until it collides against something solid, like a wall (or your skull). It can even be used as a means of transport for the player to reach new places. Cubes can also be used to power up some devices, in order to operate doors and force fields. As the player progresses towards more complex puzzles, they will encounter other devices - magnetic plates, elevators, buttons or even drones capable of nullifying magnetic and gravitational fields as well as stealing cubes.… Expand"}, {"name": "Sublevel Zero Redux", "details_link": "https://www.metacritic.com/game/playstation-4/sublevel-zero-redux", "publisher": "Sigtrap Games", "release_date": "Mar  7 2017", "developers": ["Sigtrap Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Simulation", "Space", "Combat"], "meta_score": 71, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/7918cc1ea370abbfc618f2e7dc94753e-98.jpg", "descriptions": "Sublevel Zero is a six-degree-of-freedom roguelite shooter in a universe where reality is falling apart. Jump into the cockpit of a lone gunship searching for ancient technology and answers in a procedurally generated underground labyrinth. Fight through an intense single-player campaignSublevel Zero is a six-degree-of-freedom roguelite shooter in a universe where reality is falling apart. Jump into the cockpit of a lone gunship searching for ancient technology and answers in a procedurally generated underground labyrinth. Fight through an intense single-player campaign which has been remastered and includes extra content and features.… Expand"}, {"name": "Oceanhorn: Monster of Uncharted Seas", "details_link": "https://www.metacritic.com/game/xbox-one/oceanhorn-monster-of-uncharted-seas", "publisher": "Cornfox & Bros.", "release_date": "Sep  7 2016", "developers": ["Cornfox & Bros."], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/ee053ac1349a81bd41f55318aa50ff5c-98.jpg", "descriptions": "You wake up and find a letter from your father. He is gone The only lead is his old notebook and a mysterious necklace. What happened? Oceanhorn: Monster of Uncharted Seas is an epic action-adventure experience. In the game you explore the islands of Uncharted Seas, a world filled with manyYou wake up and find a letter from your father. He is gone The only lead is his old notebook and a mysterious necklace. What happened? Oceanhorn: Monster of Uncharted Seas is an epic action-adventure experience. In the game you explore the islands of Uncharted Seas, a world filled with many dangers, puzzles and secrets. You must fight monsters, learn to use magic and discover ancient treasures, which will help you on your quest. Use all of your wits and skill to unravel the mysteries of the ancient kingdom of Arcadia and the sea monster, Oceanhorn.… Expand"}, {"name": "Cold Fear", "details_link": "https://www.metacritic.com/game/xbox/cold-fear", "publisher": "Ubisoft", "release_date": "Mar 15 2005", "developers": ["Darkworks"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/9b4c94446c8c940ca35d91b3679b0a8e-98.jpg", "descriptions": "Cold Fear introduces a new kind of horror experience in a constantly shifting environment out at sea. You'll play as Tom Hansen, a US Coast Guard crewman whose team is sent to investigate an abandoned Russian whaling ship. As you delve deeper beneath the ship's bloodstained decks, you'llCold Fear introduces a new kind of horror experience in a constantly shifting environment out at sea. You'll play as Tom Hansen, a US Coast Guard crewman whose team is sent to investigate an abandoned Russian whaling ship. As you delve deeper beneath the ship's bloodstained decks, you'll encounter hordes of evil creatures. To survive, you must eliminate your enemies, avoid traps, and get helpful information from other characters on the ship.… Expand"}, {"name": "EVE: Valkyrie", "details_link": "https://www.metacritic.com/game/playstation-4/eve-valkyrie", "publisher": "CCP", "release_date": "Oct 13 2016", "developers": ["CCP"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Action", "General", "Simulation", "Space", "Combat"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/79d50b1e8c1943bb99f2ccb9a6b305ac-98.jpg", "descriptions": "Assume the role of an elite fighter pilot and immerse yourself in virtual reality space combat. Become an elite spaceship pilot in the sprawling sci-fi universe of EVE. Join the Valkyrie, an outlaw band of galactic pirates, and take up arms to claim what's yours. Trade cannon fire for cashAssume the role of an elite fighter pilot and immerse yourself in virtual reality space combat. Become an elite spaceship pilot in the sprawling sci-fi universe of EVE. Join the Valkyrie, an outlaw band of galactic pirates, and take up arms to claim what's yours. Trade cannon fire for cash as you chase wealth and notoriety on the edge of space.\r… Expand"}, {"name": "Breathedge", "details_link": "https://www.metacritic.com/game/pc/breathedge", "publisher": "RedRuins Softworks", "release_date": "Feb 25 2021", "developers": ["RedRuins Softworks"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/d6c31ddb31a028d681cb88df9c719bef-98.jpg", "descriptions": "Experience the life of a simple guy with simple needs who tries to survive in the depths of the deep space. Explore, build, kick corpses, and poke everything with a chicken."}, {"name": "Destroy All Humans!", "details_link": "https://www.metacritic.com/game/pc/destroy-all-humans!", "publisher": "THQ Nordic", "release_date": "Jul 28 2020", "developers": ["Black Forest Games"], "platforms": ["PlayStation 2", "PlayStation 4", "Stadia", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/82d0fd3959064a02359fd79d3a2590a1-98.jpg", "descriptions": "The cult-classic returns! Terrorize the people of 1950s Earth in the role of the evil alien Crypto-137. Harvest DNA and bring down the US government in the remake of the legendary alien invasion action adventure. Annihilate puny humans using an assortment of alien weaponry and psychicThe cult-classic returns! Terrorize the people of 1950s Earth in the role of the evil alien Crypto-137. Harvest DNA and bring down the US government in the remake of the legendary alien invasion action adventure. Annihilate puny humans using an assortment of alien weaponry and psychic abilities. Reduce their cities to rubble with your flying Saucer! One giant step on mankind.… Expand"}, {"name": "Daytona USA", "details_link": "https://www.metacritic.com/game/playstation-3/daytona-usa", "publisher": "Sega", "release_date": "Oct 25 2011", "developers": ["Sega AM2"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/93c117ea15793dee1d8ba5395e69ba4c-98.jpg", "descriptions": "SEGA of America, Inc. and SEGA Europe Ltd. today announced the triumphant return of the cherished arcade racer, Daytona USA, coming this month to home consoles. Speeding out of the past from its 1993 debut, Daytona USA will be racing onto Xbox LIVE Arcade for the Xbox 360 video game andSEGA of America, Inc. and SEGA Europe Ltd. today announced the triumphant return of the cherished arcade racer, Daytona USA, coming this month to home consoles. Speeding out of the past from its 1993 debut, Daytona USA will be racing onto Xbox LIVE Arcade for the Xbox 360 video game and entertainment system from Microsoft, and PlayStation Network. The classic title has been tuned up and overhauled with enhanced graphics, steering wheel support and, for the first time on home consoles, online multiplayer. … Expand"}, {"name": "Lionheart: Kings' Crusade", "details_link": "https://www.metacritic.com/game/pc/lionheart-kings-crusade", "publisher": "Paradox Interactive", "release_date": "Oct  8 2010", "developers": ["NeocoreGames"], "platforms": "PC", "num_players": "2  Online", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/259c176b07d94813348cb4ebe2d21871-98.jpg", "descriptions": "Lionheart: Kings' Crusade invites players to rewrite history through controlling and upgrading leaders and their armies, guiding various historical factions through political events, collecting relics, and unlocking new content in a feature-rich campaign set to take on the strategy genre by force."}, {"name": "X3: Reunion", "details_link": "https://www.metacritic.com/game/pc/x3-reunion", "publisher": "Enlight Software", "release_date": "Nov 10 2005", "developers": ["Egosoft"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/23f60ef37c9c7c6cfab0f3af39802a12-98.jpg", "descriptions": "X3: Reunion immerses the player into the most realistic, living universe, ever experienced. Extensive development has gone into the X³ engine, making full use of DirectX 9 technology, to create dramatic visual effects and stunningly realistic starships. The economy model in X3: Reunion isX3: Reunion immerses the player into the most realistic, living universe, ever experienced. Extensive development has gone into the X³ engine, making full use of DirectX 9 technology, to create dramatic visual effects and stunningly realistic starships. The economy model in X3: Reunion is more complex than any previous X game. Coupled with the massively enhanced A.L. (Artificial Life) system, X³: Reunion presents players with an ever changing, evolving universe; where a player's actions can shape the future of the universe. Combat A.I. has been improved to take all ship classes into account and will challenge players; from individual dog fights to commanding full-scale fleets against massive enemy armadas. A new array of weapon systems give increased choice and tactics for any situation, while the multiple threat targeting system makes the player a force to be reckoned with. Rebalanced fighter classes make any encounter a challenge for players of all levels. [Enlight]… Expand"}, {"name": "The Medium", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-medium", "publisher": "Bloober Team", "release_date": "Jan 28 2021", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/2511f145cc8f74394801c4bc98b44bbc-98.jpg", "descriptions": "Become a medium living in two different worlds: the real one and the spirit one. Haunted by the vision of a child's murder, you travel to an abandoned hotel resort, which many years ago became the stage of an unthinkable tragedy. There you begin your search for difficult answers. As a mediumBecome a medium living in two different worlds: the real one and the spirit one. Haunted by the vision of a child's murder, you travel to an abandoned hotel resort, which many years ago became the stage of an unthinkable tragedy. There you begin your search for difficult answers. As a medium with access to both worlds, you have a wider perspective and can see more clearly that there's no one simple truth to what others perceive. Nothing is what it seems, everything has another side. The Medium features a \"dual\" soundtrack by Bloober Team's Arkadiusz Reikowski and legendary composer Akira Yamaoka of Silent Hill fame.… Expand"}, {"name": "Bendy and the Ink Machine", "details_link": "https://www.metacritic.com/game/playstation-4/bendy-and-the-ink-machine", "publisher": "TheMeatly Games", "release_date": "Nov 20 2018", "developers": ["TheMeatly Games", "Joey Drew Studios"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/0e7b822bafeeee643fbd6bab519ad9bc-98.jpg", "descriptions": "Bendy and the Ink Machine is a first-person puzzle action horror game that begins in the far days past of animation and ends in a very dark future. With twists and turns around every corner, this game promises to thrill you… and decimate your childhood."}, {"name": "The Invisible Hours", "details_link": "https://www.metacritic.com/game/xbox-one/the-invisible-hours", "publisher": "GameTrust", "release_date": "Apr 24 2018", "developers": ["GameTrust", "Tequila Works"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/39ad60e50b85ec342c0274ff010630d5-98.jpg", "descriptions": "A group of strangers receive a curious invitation from enigmatic inventor Nikola Tesla, offering each of them the chance to make amends for their darkest wrongdoings. When the last guest arrives at Tesla's isolated mansion laboratory, they find him dead - murdered. Disgraced SwedishA group of strangers receive a curious invitation from enigmatic inventor Nikola Tesla, offering each of them the chance to make amends for their darkest wrongdoings. When the last guest arrives at Tesla's isolated mansion laboratory, they find him dead - murdered. Disgraced Swedish detective, Gustaf Gustav, vows to find the killer amongst the other guests: a blind butler, a convicted murderer, the world's most famous actress, Tesla's former assistant, the son of a wealthy railroad magnate, and rival inventor Thomas Edison. But none of these people are what they seem. … Expand"}, {"name": "Aragami", "details_link": "https://www.metacritic.com/game/pc/aragami", "publisher": "Lince Works", "release_date": "Oct  4 2016", "developers": ["Lince Works"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/2c1bbc74d1be2bf22d94bccb6d8b9008-98.jpg", "descriptions": "Aragami is a third person stealth game which casts you as an undead assassin with the power to control the shadows. Teleport to any shadow, become invisible, materialize weapons or even summon a shadow dragon to infiltrate the enemy ranks and dispose of your targets."}, {"name": "Dreamfall Chapters", "details_link": "https://www.metacritic.com/game/pc/dreamfall-chapters", "publisher": "Red Thread Games", "release_date": "Jun 17 2016", "developers": ["Red Thread Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/0aef93320e4720580968bd6617742a60-98.jpg", "descriptions": "Dreamfall Chapters continues and concludes the gripping story of Zoe Castillo, the Dreamer."}, {"name": "Warriors Orochi 3", "details_link": "https://www.metacritic.com/game/xbox-360/warriors-orochi-3", "publisher": "Tecmo Koei America Corp.", "release_date": "Mar 27 2012", "developers": ["Omega Force"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 71, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/cf91127382b4fd2d0a1aa164822facfd-98.jpg", "descriptions": "Warriors Orochi 3 combines the much loved heroes of the Dynasty Warriors and Samurai Warriors series in an all new story."}, {"name": "SpongeBob SquarePants: Battle for Bikini Bottom", "details_link": "https://www.metacritic.com/game/gamecube/spongebob-squarepants-battle-for-bikini-bottom", "publisher": "THQ", "release_date": "Oct 31 2003", "developers": ["Heavy Iron Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/93254497f9f430fb4cb6c3d7ff40dda4-98.jpg", "descriptions": "In an effort to cause the kind of global mayhem he has always dreamed of, the evil Plankton has set in motion his most diabolical plot ever to take over the world. The fate of Bikini Bottom has been put in the hands (or small tentacles) of three unsuspecting heroes.  Put your platform skillsIn an effort to cause the kind of global mayhem he has always dreamed of, the evil Plankton has set in motion his most diabolical plot ever to take over the world. The fate of Bikini Bottom has been put in the hands (or small tentacles) of three unsuspecting heroes.  Put your platform skills to the test as SpongeBob, Patrick, or Sandy Cheeks, with an array of insane new maneuvers and power-ups at your disposal.  Explore a huge 3D world, encounter familiar friends, and finally put an end to Plankton's evil scheme.… Expand"}, {"name": "Tak and the Power of Juju", "details_link": "https://www.metacritic.com/game/gamecube/tak-and-the-power-of-juju", "publisher": "THQ", "release_date": "Oct 15 2003", "developers": ["Avalanche Software"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/941d697f9c3be2a009b9bd3f54c304aa-98.jpg", "descriptions": "Tak and the Power of Juju tells a tale of good versus evil, set in an ancient world where magic really works. You'll take on the role of Tak, a shaman's apprentice, as he sets off on an action-filled journey to save his village from an evil Juju Man. Tak's inventory of tools include the poleTak and the Power of Juju tells a tale of good versus evil, set in an ancient world where magic really works. You'll take on the role of Tak, a shaman's apprentice, as he sets off on an action-filled journey to save his village from an evil Juju Man. Tak's inventory of tools include the pole vault, spirit rattle, blowpipe, and explosive eggs. Through 10 different environments, you must use your wits, your environment, and the power of the Juju gods to complete your quest.… Expand"}, {"name": "Wario World", "details_link": "https://www.metacritic.com/game/gamecube/wario-world", "publisher": "Nintendo", "release_date": "Jun 24 2003", "developers": ["Treasure"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/fb195d382049e09b855a9cb4d51df3b1-98.jpg", "descriptions": "While Wario enjoys the riches from his many adventures, a mysterious black jewel in his trove transforms gems into monsters. Now, Wario must scramble to recover his riches in an alternate world filled with quirky puzzles, swarming enemies, and lots of loot. As Wario, you'll punch, kick,While Wario enjoys the riches from his many adventures, a mysterious black jewel in his trove transforms gems into monsters. Now, Wario must scramble to recover his riches in an alternate world filled with quirky puzzles, swarming enemies, and lots of loot. As Wario, you'll punch, kick, jump, grab monsters and objects, and inhale surrounding coins like a vacuum cleaner. You must cling to 3D balls to fight bosses, find hidden areas through trap doors, and bash your surroundings to uncover secrets.… Expand"}, {"name": "P.T.O. IV: Pacific Theater of Operations", "details_link": "https://www.metacritic.com/game/playstation-2/pto-iv-pacific-theater-of-operations", "publisher": "Koei", "release_date": "Feb  3 2003", "developers": ["Koei"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Strategy", "Wargame", "Turn-Based"], "meta_score": 71, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/e78ece9effd020d33e006af18ed95629-98.jpg", "descriptions": "The lastest in the \"Pacific Theater of Operations\" Series, P.T.O. IV is based on actuall World War II events. Order German Wolfpack Ops through the North Sea. Launch devastating fighter attacks on Leyte Gulf and establish supply lines to the South Pacific. Deploy Royal Navy cruisers toThe lastest in the \"Pacific Theater of Operations\" Series, P.T.O. IV is based on actuall World War II events. Order German Wolfpack Ops through the North Sea. Launch devastating fighter attacks on Leyte Gulf and establish supply lines to the South Pacific. Deploy Royal Navy cruisers to intercept Japanese dive-bombers off the coast of Ceylon - every conquest is one step closer to victory!… Expand"}, {"name": "Madden NFL 2002", "details_link": "https://www.metacritic.com/game/pc/madden-nfl-2002", "publisher": "EA Sports", "release_date": "Aug 20 2001", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/93d9619b87182a75d42582bfcbf4bbb7-98.jpg", "descriptions": "New physics, collision, time-of-day changes and a new graphics engine are a few of the additions to this EA staple which allows you to create your own team and go online to challenge other Madden-heads over the net."}, {"name": "Half-Life: Blue Shift", "details_link": "https://www.metacritic.com/game/pc/half-life-blue-shift", "publisher": "Sierra Entertainment", "release_date": "Jun 11 2001", "developers": ["Gearbox Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/73295fd2336857d7ffd144a6c087b5f4-98.jpg", "descriptions": "We're back in the Black Mesa compound yet again for the second \"official\" expansion for 1998's groundbreaking first-person shooter \"Half-Life.\" Take the role of security guard Barney Calhoun who, like Gordon Freeman, is given the task of wiping out every nasty extraterrestrial or misledWe're back in the Black Mesa compound yet again for the second \"official\" expansion for 1998's groundbreaking first-person shooter \"Half-Life.\" Take the role of security guard Barney Calhoun who, like Gordon Freeman, is given the task of wiping out every nasty extraterrestrial or misled soldier who crosses his path. (Also includes the first HL expansion pack \"Opposing Force.\")… Expand"}, {"name": "Disney's Donald Duck: Goin' Quackers", "details_link": "https://www.metacritic.com/game/dreamcast/disneys-donald-duck-goin-quackers", "publisher": "Ubisoft", "release_date": "Dec 13 2000", "developers": ["Ubisoft Montreal"], "platforms": "Dreamcast", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/5bda913b92f97a7192f0097e1ee74678-98.jpg", "descriptions": "Donald Duck is on a quest. He has to save the kidnapped Daisy from the clutchesof Merlock, the evil Magician. And, if this wasn't bad enough, he has to hurry, Donald must reach Daisy before his cousin Gladstone Gander! Master Donald Duck's quacky emotions and explosive temper in hisDonald Duck is on a quest. He has to save the kidnapped Daisy from the clutchesof Merlock, the evil Magician. And, if this wasn't bad enough, he has to hurry, Donald must reach Daisy before his cousin Gladstone Gander! Master Donald Duck's quacky emotions and explosive temper in his hyperactive humerous adventures.… Expand"}, {"name": "KISS: Psycho Circus - The Nightmare Child", "details_link": "https://www.metacritic.com/game/pc/kiss-psycho-circus---the-nightmare-child", "publisher": "Gathering", "release_date": "Jul 18 2000", "developers": ["Third Law Interactive"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Arcade"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/7e5b53a5bef0961d63bd3d4913b60533-98.jpg", "descriptions": "Utilizing an enhanced version of the LithTech engine, KISS Psycho Circus comes alive with realistic character and object motions, and interactive music and sound effects. The game supports up to 50 creatures on the screen at once, the largest number of creatures on the screen at one time inUtilizing an enhanced version of the LithTech engine, KISS Psycho Circus comes alive with realistic character and object motions, and interactive music and sound effects. The game supports up to 50 creatures on the screen at once, the largest number of creatures on the screen at one time in a first-person game.  [Gathering of Developers]… Expand"}, {"name": "Crime Cities", "details_link": "https://www.metacritic.com/game/pc/crime-cities", "publisher": "EON Digital Entertainment", "release_date": "Jan 15 2000", "developers": ["Techland"], "platforms": "PC", "num_players": "Up to 16 ", "genres": ["Simulation", "Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Space", "Automobile", "Combat"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/53d5b74f6aa528750d0e1a4f20499a70-98.jpg", "descriptions": "Get ready to enter a futuristic world where law and order have been replaced by terror and crime. The Human Federation decides to frame one of its best men, Garm Tiger, for treason. Now you must join Garm as he begins an intense mission within the Pandemia System. In the game's variedGet ready to enter a futuristic world where law and order have been replaced by terror and crime. The Human Federation decides to frame one of its best men, Garm Tiger, for treason. Now you must join Garm as he begins an intense mission within the Pandemia System. In the game's varied environments, you'll risk your life in different scenarios, such as flying a hovercraft through city skyscrapers. You can drive 50 different cars, modify your vehicles, and use more than 20 different weapons.… Expand"}, {"name": "Volume", "details_link": "https://www.metacritic.com/game/playstation-4/volume", "publisher": "Mike Bithell", "release_date": "Aug 18 2015", "developers": ["Mike Bithell"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "Action Adventure", "Platformer", "Linear", "3D"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/76e3652ee8ef2547769e677b36fcab16-98.jpg", "descriptions": "Robert Locksley is a petty thief who happens upon a device known as \"Volume\". Originally intended to be utilized as part of a secret military coup, Robert now has the ability to simulate high-profile heists, so what does he choose to do? Broadcast these crimes over the internet. Make yourRobert Locksley is a petty thief who happens upon a device known as \"Volume\". Originally intended to be utilized as part of a secret military coup, Robert now has the ability to simulate high-profile heists, so what does he choose to do? Broadcast these crimes over the internet. Make your way through this postmodern twist on Let's Play videos with the help of Danny Wallace as the voice of the Volume artificial Intelligence. From Mike Bithell, creator of Thomas Was Alone.… Expand"}, {"name": "Act of Aggression", "details_link": "https://www.metacritic.com/game/pc/act-of-aggression", "publisher": "Focus Home Interactive", "release_date": "Sep  2 2015", "developers": ["Eugen Systems"], "platforms": "PC", "genres": ["Military", "Strategy", "Real-Time", "General"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/0f6e74e86d2fbe3660ed2bfcbf0f9c99-98.jpg", "descriptions": "In what is shaping up to be their most ambitious project since Act of War, Eugen Systems will deliver a real-time strategy experience set in the 2020's in a darkly realistic future where 3 major factions fight for their interests. In a world where international crisis and financial order isIn what is shaping up to be their most ambitious project since Act of War, Eugen Systems will deliver a real-time strategy experience set in the 2020's in a darkly realistic future where 3 major factions fight for their interests. In a world where international crisis and financial order is set in a seemingly unending loop, the shadowy organization known as \"The Cartel\" attempt to complete a secret agenda with high-tech technology, stolen prototypes and stealthy operatives. Against this looming threat stands the Chimere, a UNO funded, classified military organization specialized in fast strikes, which attempts to maintain global peace and order. Finally, somewhere between the two stands the US Army, worn out by two decades of being kept on a war footing with too few replacements, but still fielding a great deal of battle-hardened veterans.… Expand"}, {"name": "LEGO Rock Band", "details_link": "https://www.metacritic.com/game/xbox-360/lego-rock-band", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov  3 2009", "developers": ["TT Fusion"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/7c3b999e8898677fa4698d35b3dea35d-98.jpg", "descriptions": "The game, which allows families, tweens and teens to experience a wild journey to rock stardom where they can \"Build a Band and Rock the Universe,\" combines the multiplayer music experience of Rock Band with the fun, customization and humor of the LEGO videogame franchise packed withThe game, which allows families, tweens and teens to experience a wild journey to rock stardom where they can \"Build a Band and Rock the Universe,\" combines the multiplayer music experience of Rock Band with the fun, customization and humor of the LEGO videogame franchise packed with brilliant chart-topping songs and classic favorites suitable for younger audiences, including: Blur's \"Song 2\", Carl Douglas's \"Kung Fu Fighting\", Europe's \"The Final Countdown\", Good Charlotte's \"Boys and Girls\", and Pink's \"So What.\" Players become rockers as they embark on a journey to stardom that the whole family can enjoy as they work their way through local venues, stadiums and fantasy locations on Earth and beyond that mimic the imaginative settings that the LEGO world offers. Also continuing the LEGO \"build-and-play\" gaming experience, players are able to create their own LEGO Rock Band style as they customize their minifigure avatars, band and entourage, including roadies, managers and crew. LEGO Rock Band supports Rock Band instruments, as well as other music game controllers. [Warner Bros.]… Expand"}, {"name": "No More Heroes III", "details_link": "https://www.metacritic.com/game/playstation-5/no-more-heroes-iii", "publisher": "XSEED Games", "release_date": "Oct 11 2022", "developers": ["Grasshopper Manufacture"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 71, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/107361b2f178b07c8640d04e6216949d-98.jpg", "descriptions": "The latest numbered entry in the No More Heroes series... No More Heroes 3 is coming in 2020!Travis Touchdown returns to Santa Destroy after a ten-year absence.\n\nThere he finds a huge artificial island metropolis floating in the sea, and a mysterious flying object hovering high above.The latest numbered entry in the No More Heroes series... No More Heroes 3 is coming in 2020!Travis Touchdown returns to Santa Destroy after a ten-year absence.There he finds a huge artificial island metropolis floating in the sea, and a mysterious flying object hovering high above.What kind of crazy dangerous assassins will Travis face off against this time?!… Expand"}, {"name": "RiMS Racing", "details_link": "https://www.metacritic.com/game/playstation-5/rims-racing", "publisher": "Bigben Interactive", "release_date": "Aug 19 2021", "developers": ["RaceWard Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 10 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 71, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/e03400720a61b328f68dc20345997427-98.jpg", "descriptions": "The first motorbike simulation that combines a realistic racing challenge with engineering and mechanics! Ride the world's most powerful motorbikes and optimise their performance by swapping out parts and analysing data in real time."}, {"name": "Crazy Machines 3", "details_link": "https://www.metacritic.com/game/pc/crazy-machines-3", "publisher": "Daedalic Entertainment", "release_date": "Oct 18 2016", "developers": ["FAKT Software GmBH", "FAKT Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/bfa9241272fbdfa20fbcb6c2a0841265-98.jpg", "descriptions": "How do you successfully punch an Egyptian statue in the face? How do you shoot a kettle from the head of a clumsycorn with a 'high precision crossbow'? How do you jumpstart the grey-matter-engine of that old junker of a space taxi?Find out in Crazy Machines 3!\n\nPrepare yourself for theHow do you successfully punch an Egyptian statue in the face? How do you shoot a kettle from the head of a clumsycorn with a 'high precision crossbow'? How do you jumpstart the grey-matter-engine of that old junker of a space taxi?Find out in Crazy Machines 3!Prepare yourself for the ultimate playground of vast Rube Goldberg style possibilities!Use physical systems to your advantage, no matter if it's electricity, explosions, lasers, lightning, or wind. By tinkering with chips you can delve into even deeper detail and provide objects with individual properties. Nothing is impossible. If you don't like that wooden plank, take your pick from different materials like metal or stone and change the size, rotation and color. It is, after all, your own machine...… Expand"}, {"name": "Final Fantasy: The 4 Heroes of Light", "details_link": "https://www.metacritic.com/game/ds/final-fantasy-the-4-heroes-of-light", "publisher": "Square Enix", "release_date": "Oct  5 2010", "developers": ["Matrix Software"], "platforms": "DS", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 71, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/8b9548d359aa9186c1be9b718821b0fd-98.jpg", "descriptions": "With FINAL FANTASY: THE 4 HEROES OF LIGHT, the FINAL FANTASY series is rendered anew as an epic storybook adventure by the creators of the FINAL FANTASY III and FINAL FANTASY IV Nintendo DS remakes. Players will enter a beautiful fairy-tale world featuring illustrations and character designsWith FINAL FANTASY: THE 4 HEROES OF LIGHT, the FINAL FANTASY series is rendered anew as an epic storybook adventure by the creators of the FINAL FANTASY III and FINAL FANTASY IV Nintendo DS remakes. Players will enter a beautiful fairy-tale world featuring illustrations and character designs by acclaimed character designer Akihiko Yoshida (FINAL FANTASY III for DS, FINAL FANTASY XII).… Expand"}, {"name": "Robert Ludlum's The Bourne Conspiracy", "details_link": "https://www.metacritic.com/game/xbox-360/robert-ludlums-the-bourne-conspiracy", "publisher": "Sierra Entertainment", "release_date": "Jun  3 2008", "developers": ["High Moon Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/06d4d85260ee791e85e4f6684d7e34d2-98.jpg", "descriptions": "Robert Ludlum's The Bourne Conspiracy gives players the experience of becoming a 30 million dollar elite agent, fusing an experience that delves deep into Jason Bourne's character with game play and game presentation inspired by the aggressive filmmaking and frenetic action found in theRobert Ludlum's The Bourne Conspiracy gives players the experience of becoming a 30 million dollar elite agent, fusing an experience that delves deep into Jason Bourne's character with game play and game presentation inspired by the aggressive filmmaking and frenetic action found in the films. Only by playing Robert Ludlum's The Bourne Conspiracy can players discover Bourne's true identity and experience the very moment he became a malfunctioning weapon, first hunting targets around the world as a deadly government assassin then marking himself as his agency’s most wanted. As a third-person espionage action game, players move from fistfights to firefights to experience sequences that blend Bourne's signature hand-to-hand combat with intense shooting and the ability to escape and evade deadly situations. [Vivendi Games]… Expand"}, {"name": "The Red Star", "details_link": "https://www.metacritic.com/game/psp/the-red-star", "publisher": "XS Games", "release_date": "Mar 17 2010", "developers": ["XS Games"], "platforms": ["iPhone/iPad", "PlayStation 2", "PSP"], "num_players": "1-2 ", "genres": ["Action", "General", "General"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/beccbf9e68ea4a990f046148c7554b87-98.jpg", "descriptions": "Blending the mechanics of melee based brawlers with the side-scrolling shooters of the classic console era, The Red Star updates each style with combo attacks, enemy lock-on features, and the ability to switch between the two seamlessly and on the fly. You will fight your way through 19Blending the mechanics of melee based brawlers with the side-scrolling shooters of the classic console era, The Red Star updates each style with combo attacks, enemy lock-on features, and the ability to switch between the two seamlessly and on the fly. You will fight your way through 19 stages of intense enemies with one goal in mind: take them all down. [XS Games]… Expand"}, {"name": "CRUSH3D", "details_link": "https://www.metacritic.com/game/3ds/crush3d", "publisher": "Sega", "release_date": "Mar  6 2012", "developers": ["Zoe Mode"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/c3036eb41c5baad22f6459c07b0df240-98.jpg", "descriptions": "CRUSH3D has players navigate across the surreal platforms of Danny's mind by 'crushing' your way from a 2-dimensional to a 3-dimensional world and back again whenever you need to."}]