[{"name": "King Oddball", "details_link": "https://www.metacritic.com/game/playstation-4/king-oddball", "publisher": "10tons Ltd", "release_date": "Apr  8 2014", "developers": ["10tons Ltd", "10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Miscellaneous", "Puzzle", "Action"], "meta_score": 64, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/6c350f3ce72b2a30b81cb2481f45a703-98.jpg", "descriptions": "The gameplay is based on pressing a button at precisely the right moment. The King picks up a rock with his tongue and swings it back and forth like a pendulum. The rock is released when you hit X. It’s not just a simple test of timing though: After the first few levels, you’ll need to crushThe gameplay is based on pressing a button at precisely the right moment. The King picks up a rock with his tongue and swings it back and forth like a pendulum. The rock is released when you hit X. It’s not just a simple test of timing though: After the first few levels, you’ll need to crush more enemies than you have rocks for. That, in turn, requires careful strategy and anticipation of how the chain reactions will unfold. We’ve tuned the physics model to pretty extreme accuracy, so relying solely on luck won’t work. [Playstation.com]… Expand"}, {"name": "Shaun Palmer's Pro Snowboarder", "details_link": "https://www.metacritic.com/game/playstation-2/shaun-palmers-pro-snowboarder", "publisher": "Activision", "release_date": "Nov 13 2001", "developers": ["Dearsoft"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 64, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/a3e0114ec2761a261612a5423f30c69e-98.jpg", "descriptions": "Ride the mountain as six-time X-Games gold medalist Shaun Palmer or 9 other top pros in real-to-life racing competitions and freestyle snowboarding. Pull off hundreds of trick combos in real-life locations like Kirkwood and Donner Ski Ranch. [Activision]"}, {"name": "Star Trek Away Team", "details_link": "https://www.metacritic.com/game/pc/star-trek-away-team", "publisher": "Activision", "release_date": "Mar 19 2001", "developers": ["Reflexive Entertainment"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/ffed90c100f3365243652efce03d7bd0-98.jpg", "descriptions": "Venture into the Black Ops side of the Trek universe as the head of Star Trek AT, a special forces unit brought in to handle those \"sticky\" situations the Star Fleet won't officially touch, in this self-proclaimed squad-based strategy."}, {"name": "Heroes Chronicles: Conquest of the Underworld", "details_link": "https://www.metacritic.com/game/pc/heroes-chronicles-conquest-of-the-underworld", "publisher": "3DO", "release_date": "Sep 27 2000", "developers": ["3DO"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "General", "General"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/bb50905353b6b6d19535e6b80c99e4fc-98.jpg", "descriptions": "When the soul of Queen Allison's father is kidnapped from Paradise, Tanrum escorts her through the cursed grounds of the Underworld. Every step is blocked by a fiery inferno or foggy necropolis from which march demons and undead determined to make Tanrum a permanent inhabitant of the land ofWhen the soul of Queen Allison's father is kidnapped from Paradise, Tanrum escorts her through the cursed grounds of the Underworld. Every step is blocked by a fiery inferno or foggy necropolis from which march demons and undead determined to make Tanrum a permanent inhabitant of the land of the dead.  [3DO]… Expand"}, {"name": "The Franz Kafka Videogame", "details_link": "https://www.metacritic.com/game/pc/the-franz-kafka-videogame", "publisher": "mif2000", "release_date": "Apr  6 2017", "developers": ["mif2000"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 64, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/30e9e3028392030685b674d90ea80a80-98.jpg", "descriptions": "A point-and-click puzzle/adventure game inspired by the writings of Franz Kafka."}, {"name": "GoldenEye 007", "details_link": "https://www.metacritic.com/game/ds/goldeneye-007", "publisher": "Activision", "release_date": "Sep 14 2010", "developers": ["n-Space"], "platforms": "DS", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 64, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/fdcc7996e92393d4e3f7da0672d168f8-98.jpg", "descriptions": "Goldeneye makes its DS debut in the 2010 holiday season."}, {"name": "Scooby-Doo! Unmasked", "details_link": "https://www.metacritic.com/game/gamecube/scooby-doo!-unmasked", "publisher": "THQ", "release_date": "Sep 12 2005", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/2b65f5fd66c6ca4ea6318dc8da30d408-98.jpg", "descriptions": "In this action adventure platform game, players assume the role of Scooby-Doo as he and the teenage sleuths of Mystery Inc. visit Fred's cousin Jed, a monster movie set designer. They find Jed has disappeared and his animatronics are out of control, sending mechanical monsters haywire andIn this action adventure platform game, players assume the role of Scooby-Doo as he and the teenage sleuths of Mystery Inc. visit Fred's cousin Jed, a monster movie set designer. They find Jed has disappeared and his animatronics are out of control, sending mechanical monsters haywire and making Jed the prime suspect. Players must stop the creepy costumed characters, unmask the truth and prove Jed's innocence. Scooby is able to don Kung Fu, bat and archer costumes so that he can karate chop, glide and aim plungers at monsters. The game consists of three sprawling worlds that each feature multiple levels and mini games with numerous cut scenes and climactic boss battles. Players recognize will the voice of the original Batman television series' Adam West as Winslow Stanton, the game's main villain, as well as authentic Scooby-Doo! cartoon voice actors. In addition, effects from the original cartoon, such as canned laughter and classic catch phrases, have been incorporated into the game.… Expand"}, {"name": "Time Machine: Rogue Pilot", "details_link": "https://www.metacritic.com/game/playstation-3/time-machine-rogue-pilot", "publisher": "Lesta Studio", "release_date": "Mar 13 2012", "developers": ["Lesta Studio"], "platforms": "PlayStation 3", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/f85b009869508cce886b0c7fba9c4b86-98.jpg", "descriptions": "Time Machine: Rogue Pilot is a mix of classic match 3 experience and  innovative hidden objects\rgameplay."}, {"name": "Rise & Fall: Civilizations at War", "details_link": "https://www.metacritic.com/game/pc/rise-fall-civilizations-at-war", "publisher": "Midway", "release_date": "Jun 12 2006", "developers": ["Midway", "Stainless Steel Studios"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 64, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/22291c8886c6b46fdf5ced6ae635fd1e-98.jpg", "descriptions": "Rise & Fall: Civilizations at War is the latest creation from award-winning developer Stainless Steel Studios and renowned game designer Rick Goodman. Rise & Fall: Civilizations at War is a detailed real-time strategy game that lets players completely command one of the four mightiestRise & Fall: Civilizations at War is the latest creation from award-winning developer Stainless Steel Studios and renowned game designer Rick Goodman. Rise & Fall: Civilizations at War is a detailed real-time strategy game that lets players completely command one of the four mightiest empires of the ancient world: Greece, Rome, Egypt, and Persia. Rise & Fall allows players to fight alongside their troops as one of history's eight greatest heroes, and bring victory to their nation on the battlefield. [Midway]… Expand"}, {"name": "Tony Hawk's American Sk8land", "details_link": "https://www.metacritic.com/game/game-boy-advance/tony-hawks-american-sk8land", "publisher": "Activision", "release_date": "Oct 18 2005", "developers": ["Vicarious Visions"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 64, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/9/f87f33c959042c8f4b53da04c31f75c0-98.jpg", "descriptions": "No levels. No load times. Just never-ending action that doesn't stop until you leave the game. Tony Hawk's American Wasteland gives you - for the first time ever in a Hawk game - the freedom to skate, or bike, throughout a rich, expansive open environment. Once you arrive in Los Angeles, theNo levels. No load times. Just never-ending action that doesn't stop until you leave the game. Tony Hawk's American Wasteland gives you - for the first time ever in a Hawk game - the freedom to skate, or bike, throughout a rich, expansive open environment. Once you arrive in Los Angeles, the vast city that gave birth to skate culture, the sky's the limit as you progress through the Wasteland story and choose missions that will have you immersed in the action without ever skating the same line twice. New on the board tricks include the Bert slides, Natas spins handstands, and one-footed grinds and manuals. New off the board tricks include wall runs, wall flips, and charged jumps. Choose Board Or Bike: For the first time, you can choose to ride BMX bikes throughout the entire game, with all-new physics, a BMX specific control system and several BMX-specific goals. Customize Like Crazy: Enter and explore dozens of shops in game to customize your gear and your look! Check out skate shops, barbershops, tattoo parlors, and clothing stores as you accomplish goals and earn cash.… Expand"}, {"name": "Scorn", "details_link": "https://www.metacritic.com/game/xbox-series-x/scorn", "publisher": "Ebb Software", "release_date": "Oct 14 2022", "developers": ["Ebb Software"], "platforms": ["PC", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/8b883784c8d9082a263d29398587adfa-98.jpg", "descriptions": "Scorn is an atmospheric first person horror adventure game set in a nightmarish universe of odd forms and somber tapestry. It is designed around an idea of \"being thrown into the world\". Isolated and lost inside this dream-like world you will explore different interconnected regions in aScorn is an atmospheric first person horror adventure game set in a nightmarish universe of odd forms and somber tapestry. It is designed around an idea of \"being thrown into the world\". Isolated and lost inside this dream-like world you will explore different interconnected regions in a non-linear fashion. The unsettling environment is a character itself. Every location contains its own theme (story), puzzles and characters that are integral in creating a cohesive lived in world. Throughout the game you will open up new areas, acquire different skill sets, weapons, various items and try to comprehend the sights presented to you.… Expand"}, {"name": "NFL Head Coach 09", "details_link": "https://www.metacritic.com/game/playstation-3/nfl-head-coach-09", "publisher": "Electronic Arts", "release_date": "Sep  3 2008", "developers": ["EA Tiburon"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Management", "Management", "Sim"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/2b9b518830f69c65501cbda660dee682-98.jpg", "descriptions": "NFL Head Coach 09 provides a complete NFL experience, offering a variety of different ways to control an NFL franchise, on and off the field, in-season and off-season.  With strategic game planning features, NFL Head Coach 09 places gamers in the coach's seat by allowing gamers toNFL Head Coach 09 provides a complete NFL experience, offering a variety of different ways to control an NFL franchise, on and off the field, in-season and off-season.  With strategic game planning features, NFL Head Coach 09 places gamers in the coach's seat by allowing gamers to comprehensively scout the opponent, build playbooks, and develop a team that will adapt to the philosophy and system of an NFL franchise. The sideline is your playing field in NFL Head Coach 09 - gamers can make adjustments to plays and game strategies in an instant.  The outcome of every game depends on game-time decisions made on the sideline. Success depends on proper preparation and knowledge of the opposing teams’ strategies, as well as expert and timely play calling. [Electronic Arts]… Expand"}, {"name": "Speedball 2: Brutal Deluxe", "details_link": "https://www.metacritic.com/game/xbox-360/speedball-2-brutal-deluxe", "publisher": "Empire Interactive", "release_date": "Oct 17 2007", "developers": ["Razorworks"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Sports", "Alternative", "Team", "Futuristic", "Futuristic"], "meta_score": 64, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/c72041cf57e64650b178722d4a452e68-98.jpg", "descriptions": "[Xbox Live Arcade]  In the year 2326, rival gangs form an ultra-violent streetsports league called Speedball to settle their deadly disputes. Get your steel ball into the opponent's goal. That's it, there are no other rules, and anything goes. The sport becomes quite popular, but it is also[Xbox Live Arcade]  In the year 2326, rival gangs form an ultra-violent streetsports league called Speedball to settle their deadly disputes. Get your steel ball into the opponent's goal. That's it, there are no other rules, and anything goes. The sport becomes quite popular, but it is also extremely dangerous. Ten years later, Speedball becomes the national sport with sponsors, professional teams, and insanely brutal action. Now, the Bitmap Brothers and Empire Interactive bring you the legendary futuristic sports game Speedball 2: Brutal Deluxe completely remastered for Xbox LIVE Arcade. Play the fast-paced and utterly brutal game with its classic 2-D graphics, or go full on with the new super-enhanced high definition 3-D visuals. Smash your way to the top of the league in the solo game or go head to head locally or on Xbox LIVE. The game features 32 teams, 4 leagues, cup and knockout competitions, team enhancements, management and training options, and Ranked Preset or Ranked Career games. [Microsoft]… Expand"}, {"name": "Final Fantasy Crystal Chronicles: Echoes of Time", "details_link": "https://www.metacritic.com/game/wii/final-fantasy-crystal-chronicles-echoes-of-time", "publisher": "Square Enix", "release_date": "Mar 24 2009", "developers": ["Square Enix"], "platforms": "Wii", "num_players": "Up to 4 ", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/d5c73ee5c0bfd221deda3655324576d2-98.jpg", "descriptions": "An innovative new concept in multiplayer gaming, Final Fantasy Crystal Chronicles: Echoes of Time enables Wii and DS users to play side by side for the first time. This breakthrough in gaming connectivity allows players on both Nintendo platforms to journey together in the fantastical worldAn innovative new concept in multiplayer gaming, Final Fantasy Crystal Chronicles: Echoes of Time enables Wii and DS users to play side by side for the first time. This breakthrough in gaming connectivity allows players on both Nintendo platforms to journey together in the fantastical world of the beloved Final Fantasy Crystal Chronicles series. Echoes of Time offers a gameplay system that allows for a seamless, hassle-free in-game switch from single to multiplayer mode. Play anytime, anywhere, with anyone and experience a new level of connectivity with this latest adventure in the FFCC series. A triumphant return from a monster-infested forest marks the completion of the 16-year-old hero’s coming-of-age ceremony. However, the hero's joy is short-lived as a young village girl is found to be afflicted by a mysterious illness known as \"crystal sickness.\" Determined to obtain the cure, the hero steps out of the secluded village for the first time, only to discover a world in which crystals are merely artifacts of the past and no longer exist. Play anytime, anywhere with anyone Multiplayer connectivity reaches new heights in Echoes of Time, where players can team up or compete with friends and players around the world. The intuitive control scheme introduced in Ring of Fates returns, now adapted to Wii for double the action. Players can switch between single and multiplayer modes at any time while playing, enjoying two great gaming options in one integrated experience. A personalized hero can be generated from a choice of the four familiar races of the series; Clavats, Lilties, Selkies or Yukes. Players joining from the Wii can also introduce their Miis to the world of FFCC. Create and customize materials, armor and equipment for characters with tailored appearances and abilities - no two heroes will be the same! Players can continue to enjoy the game even after completing the main adventure, as the New Game+ feature provides increased difficulty and better items with every new round. [Square Enix]… Expand"}, {"name": "Sonic Gems Collection", "details_link": "https://www.metacritic.com/game/gamecube/sonic-gems-collection", "publisher": "Sega", "release_date": "Aug 16 2005", "developers": ["Sonic Team"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 64, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/7d41fac6e4837ed2b63b9922119a3cf2-98.jpg", "descriptions": "9 classic titles from the Sonic the Hedgehog library previously available only in the arcade, on SEGA CD, SEGA Saturn, and Game Gear are now combined into one collection!"}, {"name": "The Incredibles", "details_link": "https://www.metacritic.com/game/xbox/the-incredibles", "publisher": "THQ", "release_date": "Oct 31 2004", "developers": ["Heavy Iron Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 64, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/f3fcdcf4b4ee5fc1b38d868cb1e4cbd5-98.jpg", "descriptions": "Superstrength, superspeed, invisibility, and elasticity are all the powers you have to combat evil in The Incredibles. You'll need them, because your enemies throw bombs, bullets, and lasers at you. Based on the movie from Pixar, The Incredibles tells the story of a family of undercoverSuperstrength, superspeed, invisibility, and elasticity are all the powers you have to combat evil in The Incredibles. You'll need them, because your enemies throw bombs, bullets, and lasers at you. Based on the movie from Pixar, The Incredibles tells the story of a family of undercover superheroes that is trying to live a quiet, suburban life but is forced back into action to save the world. As the film's main characters, you must fight, race, and solve puzzles in more than 18 action-packed levels.… Expand"}, {"name": "Borderlands 2", "details_link": "https://www.metacritic.com/game/playstation-vita/borderlands-2", "publisher": "SCEA", "release_date": "May  6 2014", "developers": ["Iron Galaxy Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation Vita"], "num_players": "2 ", "genres": ["Shooter", "Sci-Fi", "Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 64, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/7d2d49313b7faa8a9fb77bb71460d294-98.jpg", "descriptions": "Borderlands 2 furthers the distinct blending of First Person Shooter and Role Playing genres to create the true evolution of the Role Playing Shooter. Team up with up to three other players for four-player online goodness or go old-school with two-player split-screen couch sharing mayhem asBorderlands 2 furthers the distinct blending of First Person Shooter and Role Playing genres to create the true evolution of the Role Playing Shooter. Team up with up to three other players for four-player online goodness or go old-school with two-player split-screen couch sharing mayhem as you spend hours leveling up your character and equipping them with one of the millions of badass weapons. Borderlands 2 features a new visually stunning array of procedurally generated guns, shields, grenades, artifacts, enemies and more. Choose one of the four new character classes to be taken through a carefully crafted and connected story to all new and surprising environments across the living planet of Pandora. Make new friends, arm them to the teeth and fight alongside them on your relentless quest for revenge and redemption.… Expand"}, {"name": "King of Fighters: Maximum Impact", "details_link": "https://www.metacritic.com/game/playstation-2/king-of-fighters-maximum-impact", "publisher": "SNK Playmore", "release_date": "Oct 12 2004", "developers": ["SNK Playmore"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/0d52fdc370d2892ba25830d36d5893bb-98.jpg", "descriptions": "King of Fighers: Maximum Impact is the first KOF title to be designed specifically for the PlayStation 2, rather than being based on any existing SNK arcade version. Maximum Impact features 24 of the most popular KOF characters such as Terry Bogard and Kyo Kusanagi all rendered in 3D. TheKing of Fighers: Maximum Impact is the first KOF title to be designed specifically for the PlayStation 2, rather than being based on any existing SNK arcade version. Maximum Impact features 24 of the most popular KOF characters such as Terry Bogard and Kyo Kusanagi all rendered in 3D. The game also features six brand new characters to the franchise, 4 unlockable characters, and a wide assortment of detailed battlegrounds and fighting maneuvers. [SNK NeoGeo]… Expand"}, {"name": "The Legend of Spyro: Dawn of the Dragon", "details_link": "https://www.metacritic.com/game/wii/the-legend-of-spyro-dawn-of-the-dragon", "publisher": "Sierra Entertainment", "release_date": "Oct 21 2008", "developers": ["Etranges Libellules"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 64, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/59c70356c3abc349ab251c29efa126b8-98.jpg", "descriptions": "In the final chapter of the Legend of Spyro trilogy, players find Sypro teaming up with an unlikely ally - Cynder, his former enemy, to face his most challenging mission to date. As the Dark Master's (voiced by Mark Hamill) evil envelopes the world like a plague, Spyro must fulfill hisIn the final chapter of the Legend of Spyro trilogy, players find Sypro teaming up with an unlikely ally - Cynder, his former enemy, to face his most challenging mission to date. As the Dark Master's (voiced by Mark Hamill) evil envelopes the world like a plague, Spyro must fulfill his destiny and unlock the true power of the purple dragon within him to stop the Dark Master in his tracks. The game introduces two never before seen elements into the Spyro universe: Spyro can now fly at any time and players can drop-in/drop-out with the new cooperative feature. The co-op feature allows players to have the option of completing the game as either Spyro or Cynder, giving them more freedom to explore Spyro's world in completely new ways. [Sierra Entertainment]… Expand"}, {"name": "Operation Flashpoint: Elite", "details_link": "https://www.metacritic.com/game/xbox/operation-flashpoint-elite", "publisher": "Codemasters", "release_date": "Nov  8 2005", "developers": ["Bohemia Interactive"], "platforms": ["PC", "Xbox"], "num_players": "14  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 64, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/18a9b213b84c32b8d38e010bfe0611ab-98.jpg", "descriptions": "Operation Flashpoint: Elite immerses you in realistic Cold War military situations. Not only do you control and command squads and soldiers, but also land, sea, and air vehicles. You'll have access to cars, APCs, tanks, and even military helicopters. The game's open-ended environments letOperation Flashpoint: Elite immerses you in realistic Cold War military situations. Not only do you control and command squads and soldiers, but also land, sea, and air vehicles. You'll have access to cars, APCs, tanks, and even military helicopters. The game's open-ended environments let you experience different kinds of gameplay, whether you're commanding a squad, driving tanks, transporting troops, piloting a helicopter, or taking on the role of a sniper. … Expand"}, {"name": "Way of the Hunter", "details_link": "https://www.metacritic.com/game/pc/way-of-the-hunter", "publisher": "THQ Nordic", "release_date": "Aug 16 2022", "developers": ["Nine Rocks Games"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "genres": ["Sports", "Individual", "Nature", "Hunting"], "meta_score": 64, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/726f521f92174246269e450605eeda06-98.jpg", "descriptions": "Become the new owner of a hunting lodge nestled among gorgeous habitats and rich animal populations. Explore vast open world environments across the USA and Europe. Hunt with a premium selection of firearms and equipment. Enjoy the perfect hunt on your own or with a friend in multiplayerBecome the new owner of a hunting lodge nestled among gorgeous habitats and rich animal populations. Explore vast open world environments across the USA and Europe. Hunt with a premium selection of firearms and equipment. Enjoy the perfect hunt on your own or with a friend in multiplayer coop.This authentic hunting experience lets you explore and hunt in large open-world environments in the USA and Europe. Discover true to life animals in beautiful natural habitats and handle various detailed and highly realistic weapons.Face the challenges of ethical hunting, supported by a compelling story, or simply enjoy hunting the rich environments freely.… Expand"}, {"name": "Puzzle Kingdoms", "details_link": "https://www.metacritic.com/game/ds/puzzle-kingdoms", "publisher": "Zoo Games", "release_date": "May  4 2009", "developers": ["Infinite Interactive"], "platforms": ["PC", "DS"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Matching", "General"], "meta_score": 64, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/edf0814eb9a1a8ee1809955115f39218-98.jpg", "descriptions": "From the acclaimed designer of Puzzle Quest, Steve Fawkner of Infinite Interactive, comes Puzzle Kingdoms. Deep, classic turn based empire gameplay tells an incredible story. Instead of auto-resolved conflict, a unique puzzle mechanic makes each battle unique and addictive. [Zoo Games]"}, {"name": "Ys: The Ark of Napishtim", "details_link": "https://www.metacritic.com/game/psp/ys-the-ark-of-napishtim", "publisher": "Konami", "release_date": "Feb 28 2006", "developers": ["Konami Software Shanghai"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/ff5b7fff1f56d51f567460c0f2625211-98.jpg", "descriptions": "Washed ashore on an uncharted island, Adol Christin begins a new journey in Ys: The Ark of Napishtim. Lush environments, beautifully rendered characters and animated 3D backdrops combine to create the setting for Adol's newest adventure. Now on the PSP, our red-headed hero must fight deadlyWashed ashore on an uncharted island, Adol Christin begins a new journey in Ys: The Ark of Napishtim. Lush environments, beautifully rendered characters and animated 3D backdrops combine to create the setting for Adol's newest adventure. Now on the PSP, our red-headed hero must fight deadly monsters and menacing bosses with a variety of sword combinations, special attacks and magical spells to uncover the secrets that lie in Canaan's mysterious whirlpools. Power-up three magical swords to gain special abilities and attacks. Combines real-time, fast-paced action and strategic boss battles. Unlock and play fun new mini-games with characters from the island. Play soundtrack & view character profiles in brand new modes. [Konami]… Expand"}, {"name": "White Knight Chronicles International Edition", "details_link": "https://www.metacritic.com/game/playstation-3/white-knight-chronicles-international-edition", "publisher": "SCEA", "release_date": "Feb  2 2010", "developers": ["Level 5"], "platforms": "PlayStation 3", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 64, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/f365abdcf16b4487fa145508b4257436-98.jpg", "descriptions": "A fantasy role-playing game in which the main character can transform himself into a huge knight as he strives to rescue a princess."}, {"name": "Biomutant", "details_link": "https://www.metacritic.com/game/playstation-4/biomutant", "publisher": "THQ Nordic", "release_date": "May 25 2021", "developers": ["Experiment 101"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/dd8941bff3bdea412879b9dd91e78c4d-98.jpg", "descriptions": "Biomutant is an open-word, post-apocalyptic Kung-Fu fable RPG, with a unique martial arts styled combat system allowing you to mix melee, shooting and mutant ability action. Your actions play a major part in the unfolding of a story where End is coming to the New World. A plague is ruiningBiomutant is an open-word, post-apocalyptic Kung-Fu fable RPG, with a unique martial arts styled combat system allowing you to mix melee, shooting and mutant ability action. Your actions play a major part in the unfolding of a story where End is coming to the New World. A plague is ruining the land and the Tree-of-Life is bleeding death from its roots. The Tribes stand divided, in need of someone strong enough to unite them or bring them all down...\rAlthough you are guided through the world by a Storyteller that narrates every step of your journey, it's your actions and choices that'll decide how your story of survival ends.… Expand"}, {"name": "F1 Race Stars", "details_link": "https://www.metacritic.com/game/xbox-360/f1-race-stars", "publisher": "Codemasters", "release_date": "Nov 13 2012", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Wii U", "Xbox 360"], "genres": ["Driving", "Racing", "Arcade", "Formula One", "Formula One", "Automobile"], "meta_score": 64, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/29e0c2931b0813704603e4299c1742f1-98.jpg", "descriptions": "Get ready to experience FORMULA ONE cars, teams and circuits with F1 Race Stars from Codemasters Racing. F1 RACE STARS is a fast-to-the-fun arcade racing game for all ages featuring the official FORMULA ONE cars, teams and circuits as they've never been seen before. Drivers including LewisGet ready to experience FORMULA ONE cars, teams and circuits with F1 Race Stars from Codemasters Racing. F1 RACE STARS is a fast-to-the-fun arcade racing game for all ages featuring the official FORMULA ONE cars, teams and circuits as they've never been seen before. Drivers including Lewis Hamilton, Fernando Alonso and Sebastian Vettel have been transformed into personality-packed heroes bursting with charm and character and stunning FORMULA ONE locations have become exhilarating racing theme parks designed for speed and wheel-to-wheel competition.… Expand"}, {"name": "Shining Force EXA", "details_link": "https://www.metacritic.com/game/playstation-2/shining-force-exa", "publisher": "Sega", "release_date": "Mar 20 2007", "developers": ["Neverland"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/8039078c8d6944e9ad3cc29d63a2f02e-98.jpg", "descriptions": "The world of Shining Force EXA has long been steeped in devastating wars and oppression. Two bitter nations wage constant war upon each other by summoning armies of beasts and demons. Now, decades later, neither side has gained any perceivable advantage over the other, while the world andThe world of Shining Force EXA has long been steeped in devastating wars and oppression. Two bitter nations wage constant war upon each other by summoning armies of beasts and demons. Now, decades later, neither side has gained any perceivable advantage over the other, while the world and its people lay ravaged and devastated by the ceaseless fighting. Players take the role of two characters in Shining Force EXA; Toma, a warrior who holds the power to wield the Shining Force, is destined to unite the divided world in which he lives; and Cyrille, a powerful sorceress who fights to create a better future for her homeland. Together Toma and Cyrille embark on a quest to bring peace and order back to their war-ravaged world. Shining Force EXA debuts an innovative Fortress System by which players manage the growth, layout, and defense of the Geo Fortress, the player's home base. As players leave the Geo Fortress to go on missions and quests, they are kept abreast of events at the fortress. If at anytime the Geo Fortress is attacked during the quest, players must switch between parties and use members from the defensive force that were left to protect the fortress from invasion. The Geo Fortress can evolve during the game to match players' personal style and tactics. [Sega]… Expand"}, {"name": "Warhammer 40,000: Fire Warrior", "details_link": "https://www.metacritic.com/game/playstation-2/warhammer-40000-fire-warrior", "publisher": "THQ", "release_date": "Nov 17 2003", "developers": ["Kuju Entertainment"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 64, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/46749dd244a2635c4c1e00c8197adb5e-98.jpg", "descriptions": "Welcome to the dark nightmare future of the 41st Millennium, the grim era of the Imperium of Man. The battlefield is spread across a million different worlds. Powerful armies of Space Marines, Imperial Guard, and Tau Fire Warriors are in constant conflict, unleashing carnage via mechanicalWelcome to the dark nightmare future of the 41st Millennium, the grim era of the Imperium of Man. The battlefield is spread across a million different worlds. Powerful armies of Space Marines, Imperial Guard, and Tau Fire Warriors are in constant conflict, unleashing carnage via mechanical war machines, crushing artillery, and vast starships. Warhammer® 40,000: Fire Warrior™ follows one day in the tumultuous life of Kais, young Tau Warrior who must battle alone against a force that shows no mercy: The Imperium of Man. Kais will soon learn there is a darker foe at hand and becomes entangled in a frightening story that leads him through an ongoing war. [THQ]… Expand"}, {"name": "Painkiller: Hell & Damnation", "details_link": "https://www.metacritic.com/game/pc/painkiller-hell-damnation", "publisher": "Nordic Games Publishing", "release_date": "Oct 31 2012", "developers": ["The Farm 51"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/5b22984bbe4ce91b1e2bd4026d2e3d6b-98.jpg", "descriptions": "Powered by Epic's world-renowned and highly-respected Unreal Engine 3, Painkiller Hell & Damnation recreates the sensations and hardcore gameplay of the original Painkiller. Released in 2004, Painkiller won high praise and many accolades and fans for its fast and unique gameplay. KeepingPowered by Epic's world-renowned and highly-respected Unreal Engine 3, Painkiller Hell & Damnation recreates the sensations and hardcore gameplay of the original Painkiller. Released in 2004, Painkiller won high praise and many accolades and fans for its fast and unique gameplay. Keeping true to the old-school FPS ideology, lightning-fast movement enables skillful players to get into the heart of the fast-paced gameplay, topped off with stunning enormo-boss fights requiring sneaky tactics. … Expand"}, {"name": "Pop", "details_link": "https://www.metacritic.com/game/wii/pop", "publisher": "Nnooo", "release_date": "May 12 2008", "developers": ["Nnooo"], "platforms": ["iPhone/iPad", "Wii"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/ab893fb62bb41778d39cdd365c9796c0-98.jpg", "descriptions": "[WiiWare]  Pop bubbles to score points and stop the timer from running out. Pop can be enjoyed on 2 levels - casual gamers can simply play to pop bubbles and keep the game moving. Advanced players will need to pick their shots rapidly and accurately and generate combos to maximize their[WiiWare]  Pop bubbles to score points and stop the timer from running out. Pop can be enjoyed on 2 levels - casual gamers can simply play to pop bubbles and keep the game moving. Advanced players will need to pick their shots rapidly and accurately and generate combos to maximize their score. [Nintendo]… Expand"}, {"name": "Windbound", "details_link": "https://www.metacritic.com/game/playstation-4/windbound", "publisher": "5 Lives Studios", "release_date": "Aug 28 2020", "developers": ["5 Lives Studios"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 64, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/170f16e63d1ddb30e30bb6f9786a8100-98.jpg", "descriptions": "Embark on a personal journey and discover the history of the idyllic forbidden islands; each holding the key to a mystery and unexpected revelations. Head towards the horizon, advancing across the islands, each with their own wildlife, landscapes and challenges to face. Scavenge the island'sEmbark on a personal journey and discover the history of the idyllic forbidden islands; each holding the key to a mystery and unexpected revelations. Head towards the horizon, advancing across the islands, each with their own wildlife, landscapes and challenges to face. Scavenge the island's untamed terrain for resources that you can use to craft a full range of tools and weapons to hunt wildlife and upgrade your boat. You must set sail when resources become scarce. Your boat is your key companion on this journey, carefully craft your own custom sailing vessel to take on the treacherous waters, traversing from one island to the next.… Expand"}, {"name": "Little Town Hero", "details_link": "https://www.metacritic.com/game/switch/little-town-hero", "publisher": "Nintendo", "release_date": "Oct 16 2019", "developers": ["Game Freak"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 64, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/3/b242da0478df0c826d637232da70add7-98.jpg", "descriptions": "GAME FREAK, the developer of the Pokémon series, has created a new RPG for Nintendo Switch. In TOWN, players must take up arms against invading monsters, all within the walls of a single village."}, {"name": "Symphony of the Machine", "details_link": "https://www.metacritic.com/game/playstation-4/symphony-of-the-machine", "publisher": "Stirfire Studios", "release_date": "Apr 25 2017", "developers": ["Stirfire Studios"], "platforms": ["PC", "PlayStation 4"], "genres": ["Puzzle", "General"], "meta_score": 64, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/9/cce037085310c059501a8762376c4447-98.jpg", "descriptions": "In Symphony of the Machine players awaken in a lifeless sun-scorched desert. A strange tower looming in the distance harbours a powerful beam of light. When directed at glyphs on the tower, the light causes the weather outside to change from scenes like blistering heat to freezing snowstormsIn Symphony of the Machine players awaken in a lifeless sun-scorched desert. A strange tower looming in the distance harbours a powerful beam of light. When directed at glyphs on the tower, the light causes the weather outside to change from scenes like blistering heat to freezing snowstorms and everything in between. Creating the perfect climate for multiple forms of life is the key to cultivating a new world.… Expand"}, {"name": "Rayman Raving Rabbids", "details_link": "https://www.metacritic.com/game/playstation-2/rayman-raving-rabbids", "publisher": "Ubisoft", "release_date": "Dec  5 2006", "developers": ["Ubisoft Montpellier"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/79bae7b5fdebe82681974754e21c078d-98.jpg", "descriptions": "Rayman Raving Rabbids marks the return of the iconic video-game hero, Rayman, in his funniest and zaniest adventure ever. When the world of Rayman is threatened by a devastating invasion of crazed, out-of-control bunnies Rayman must rise up against his furry foes to foil their wicked plans.Rayman Raving Rabbids marks the return of the iconic video-game hero, Rayman, in his funniest and zaniest adventure ever. When the world of Rayman is threatened by a devastating invasion of crazed, out-of-control bunnies Rayman must rise up against his furry foes to foil their wicked plans. Utilizing an array of amazing new abilities, and with the help of magical creatures, Rayman must break out all the moves to save his world from these delirious bunnies and their hare-raising antics. Combat the Ultra-Crazed Evil Rabbits – Take control of Rayman and his knack for attack to help save his world from the raving rabbids. They are mischievous, insane and completely out of control. There are several types of rabbids each with its own mischievous characteristics. Tame and control various creatures such as sharks, eagles, rhinos, spiders and angelfish. Rayman can master each animal's unique capabilities to help in his battle against the devious rabbits. Customize and disguise Rayman. Go punk, pop, rock or hip hop to infiltrate the bunnies and foil their devious plans. Explore amazing free-roaming environments and beautiful epic landscapes that mix real and fantastical styles to create a visually stunning experience. [Ubisoft]… Expand"}, {"name": "Silent Hill: Homecoming", "details_link": "https://www.metacritic.com/game/pc/silent-hill-homecoming", "publisher": "Konami", "release_date": "Nov  6 2008", "developers": ["Double Helix Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 64, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/dfdde2a024bba97f57ace4bb654f90f0-98.jpg", "descriptions": "The game thrusts players into a shadowy world of chaos and terror with atmospheric graphics and an original storyline that sheds new light on the desolate, fog-shrouded town of Silent Hill. Silent Hill: Homecoming follows Alex Shepherd, a war veteran returning home from an overseas tour ofThe game thrusts players into a shadowy world of chaos and terror with atmospheric graphics and an original storyline that sheds new light on the desolate, fog-shrouded town of Silent Hill. Silent Hill: Homecoming follows Alex Shepherd, a war veteran returning home from an overseas tour of duty to investigate the mysterious disappearance of his younger brother, Joshua. His travels lead him through the small, insular community of Shepherd's Glen and eventually through the hauntingly empty streets of Silent Hill. Building upon the series' trademark foundations of atmosphere, adventure and storytelling, Silent Hill: Homecoming introduces players to a frightening new experience. When confronted by the perverse incarnations of evil that roam Silent Hill and Shepherd's Glen, players are able to utilize an enhanced combat system and execute a number of offensive and defensive maneuvers as they experience every terrifying encounter with the game’s numerous nightmarish creatures. Players also have to solve a variety of puzzles as they progress through the highly atmospheric game world, using cues from the environment to unlock Silent Hill's darkest secrets. Continuing the series’ tradition of standout music and sound design, Silent Hill: Homecoming features an original soundtrack by famed composer Akira Yamaoka. [Konami]… Expand"}, {"name": "FATED: The Silent Oath", "details_link": "https://www.metacritic.com/game/playstation-4/fated-the-silent-oath", "publisher": "Frima Studio", "release_date": "Mar 28 2017", "developers": ["Frima Studio"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action Adventure", "Adventure", "General", "3D", "First-Person"], "meta_score": 64, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/a4473bb199afa62392b9e8e377e0e2eb-98.jpg", "descriptions": "FATED is an virtual reality action-adventure experience set in the Norse lands during Ragnarök."}, {"name": "WRC 4: FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/pc/wrc-4-fia-world-rally-championship", "publisher": "Plug In Digital", "release_date": "Oct 25 2013", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "genres": ["Rally / Offroad", "Driving", "Racing", "Simulation", "Rally / Offroad", "Automobile"], "meta_score": 64, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/7c319bff90ea1ba6931abdfbb3b24a44-98.jpg", "descriptions": "Tout your style and win the FIA WORLD RALLY CHAMPIONSHIP 2013 season. Experience the 2013 season with the drivers, cars and courses of the WRC, WRC2, WRC3 and, for the first time, Junior WRC championships."}, {"name": "Game of Thrones: A Telltale Games Series", "details_link": "https://www.metacritic.com/game/pc/game-of-thrones-a-telltale-games-series", "publisher": "Telltale Games", "release_date": "Nov 17 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Adventure", "Point-and-Click"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/7b6feb9537a508af8d6deb69a2615725-98.jpg", "descriptions": "Telltale's series is founded in the world, characters and events seen in HBO’s television show, which in turn is based on George R. R. Martin’s books (A Song of Ice and Fire)."}, {"name": "Enchanted Arms", "details_link": "https://www.metacritic.com/game/playstation-3/enchanted-arms", "publisher": "Ubisoft", "release_date": "Apr  3 2007", "developers": ["From Software"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/12acd521a631461739e6c1e7c31fe74f-98.jpg", "descriptions": "Enchanted Arms adventure takes place in a fantasy world filled with beautiful cinematic graphics and vibrant characters. It includes more than 50 hours of gameplay and is the only next-gen RPG with the fast-action SpeedTactics Battle System, which enables the player to move his or herEnchanted Arms adventure takes place in a fantasy world filled with beautiful cinematic graphics and vibrant characters. It includes more than 50 hours of gameplay and is the only next-gen RPG with the fast-action SpeedTactics Battle System, which enables the player to move his or her characters and use distance-dependent attacks while in battle. Players embark on an epic RPG adventure and escape to a fantasy world filled with unique and bizarre creatures. Taking the role of Atsuma, enchanter-in-training, players transform from a naïve student into the most powerful savior in a war 1,000 years in the making. In an immersive, deep storyline filled with increasingly difficult challenges, players meet new allies and master Atsuma's special fighting and magic abilities. SIXAXIS Wireless Controller Integration Provides an Immersive Experience: Use the motion-sensitive controller to harness weapons, recover your EX power meter, unlock more powerful attacks and solve puzzles. Master the SpeedTactics Battle System: Easy-to-navigate interface, the ability to move characters in-battle and distance-dependent attacks combine to create fast-paced, hands-on gameplay. More Than 500 Characters, Including 130 Unlockable Creatures You Control: Find and unlock 130 controllable creatures to use in battle as part of your team. Customize your party and learn to harness their unique abilities. Includes 30 all new creatures exclusive to the PS3. Includes Both the Original Japanese and an All-New English Language Track: Choose to play the game with either Japanese or English dialogue. [Ubisoft]… Expand"}, {"name": "Earth Defense Force 4.1: The Shadow of New Despair", "details_link": "https://www.metacritic.com/game/playstation-4/earth-defense-force-41-the-shadow-of-new-despair", "publisher": "XSEED Games", "release_date": "Dec  8 2015", "developers": ["Sandlot"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/883ce253ab398cc45111037bc2e66cac-98.jpg", "descriptions": "The sci-fi action of the EDF series comes to the PlayStation4 for the first time in this reimagining of Earth Defense Force 2025, now with improved framerates and graphics, and over 50% new content. After selecting from one of four unique playable classes and customizing their weapons,The sci-fi action of the EDF series comes to the PlayStation4 for the first time in this reimagining of Earth Defense Force 2025, now with improved framerates and graphics, and over 50% new content. After selecting from one of four unique playable classes and customizing their weapons, players lead NPC troops into city-wide battles against hordes of seemingly endless giant bugs, robots, and other colossal enemies. 2 players can enjoy local co-op and versus modes, while online co-op supports up to four players to increase the odds against a massive swarm of enemies. … Expand"}, {"name": "Override: Mech City Brawl", "details_link": "https://www.metacritic.com/game/xbox-one/override-mech-city-brawl", "publisher": "Modus", "release_date": "Dec  4 2018", "developers": ["Modus"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/120b6fc3ee42441ff48ccff68de8dcac-98.jpg", "descriptions": "No gears, no glory! Control gigantic fighting robots and duke it out across fantastic cityscapes in this 3D mech-based brawler! Epic and explosive battles await with anime-inspired mechs in local and online versus game modes, party co-op with two to four players, and a single-player campaign."}, {"name": "Alien Breed: Impact", "details_link": "https://www.metacritic.com/game/pc/alien-breed-impact", "publisher": "Team17", "release_date": "Jun  3 2010", "developers": ["Team17"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/59756687d8e85ec61efad7f9f39305a6-98.jpg", "descriptions": "Alien Breed: Impact is an explosive science fiction arcade-shooter that resurrects a much revered franchise with an epic story, swarms of highly intelligent alien enemies, high-impact weapons, highly detailed and rich environments; all implemented with superb technology in a state-of-the-artAlien Breed: Impact is an explosive science fiction arcade-shooter that resurrects a much revered franchise with an epic story, swarms of highly intelligent alien enemies, high-impact weapons, highly detailed and rich environments; all implemented with superb technology in a state-of-the-art gaming experience.… Expand"}, {"name": "Kane & Lynch: Dead Men", "details_link": "https://www.metacritic.com/game/playstation-3/kane-lynch-dead-men", "publisher": "Eidos Interactive", "release_date": "Nov 13 2007", "developers": ["Io Interactive"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 64, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/0/e4d821eaecf28e3898e2f6c688cff199-98.jpg", "descriptions": "Kane & Lynch: Dead Men is a dark and gritty drama featuring two men, one is a flawed mercenary and the other a medicated psychopath. Forced together on a violent and chaotic path of redemption and revenge, no action is considered too harsh as this volatile partnership is pushed beyond reasonKane & Lynch: Dead Men is a dark and gritty drama featuring two men, one is a flawed mercenary and the other a medicated psychopath. Forced together on a violent and chaotic path of redemption and revenge, no action is considered too harsh as this volatile partnership is pushed beyond reason in this brutally realistic, character-driven third person action shooter. [Eidos Interactive]… Expand"}, {"name": "Attack on Pearl Harbor", "details_link": "https://www.metacritic.com/game/pc/attack-on-pearl-harbor", "publisher": "cdv Software", "release_date": "Aug  6 2007", "developers": ["3D People"], "platforms": "PC", "num_players": "12  Online", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 64, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/f95df00b4875ee5cb5e82497cbb1d177-98.jpg", "descriptions": "In Attack on Pearl Harbor, players can sign up for either side as they are offered the role of daring US gunner turned pilot Douglas Knox or Japanese ace Zenji Yamada. History's yours to shape: Either nation can win the war depending on your actions as players battle for supremacy behind theIn Attack on Pearl Harbor, players can sign up for either side as they are offered the role of daring US gunner turned pilot Douglas Knox or Japanese ace Zenji Yamada. History's yours to shape: Either nation can win the war depending on your actions as players battle for supremacy behind the cockpits of some of the most prolific fighters, bombers and torpedo-bearing aircraft of the WWII Pacific Theater. Playable planes include Japan's Mitsubishi A6M \"Zero\", the D3A1 Aichi \"Val\" and the B5N Nakajima \"Kate\" as well as America's Chance Vought F4U Corsair, the Douglas SBD Dauntless and the Grumman TBM Avenger. Intuitive Controls – Pick up and play the game via a simple, straightforward control scheme that'll have anyone flying in seconds. Jaw-Dropping Graphics – Widescreen gaming support coupled with dazzling special effects provides a beautifully rendered backdrop of the Pacific. Choose Your Side – Play as the dashing Douglas Knox of the USAAF or fighter pilot Zenji Yamada of the Imperial Japanese Navy Air Service. Riveting Action – Take off from the deck of an aircraft carrier in the most prolific fighters, bombers and torpedo-bearing aircraft of the WWII Pacific Theatre. Historical Campaigns – Fight the selfsame battles that determined the outcome of the war, from Pearl Harbor to Iwo Jima.… Expand"}, {"name": "Warrior Kings: Battles", "details_link": "https://www.metacritic.com/game/pc/warrior-kings-battles", "publisher": "Strategy First", "release_date": "Sep 30 2003", "developers": ["Black Cactus"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 64, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/edfb43db2f9289571384002002b4cef7-98.jpg", "descriptions": "Orbis has been plunged into chaos and war rages across the land like the fires of hell. Anarchy has spread like a plague across the seas to the Empires of the South and East. The Empires, Nations and Kingdoms of Orbis have collapsed in on themselves, breaking down into Baronies, ProvincesOrbis has been plunged into chaos and war rages across the land like the fires of hell. Anarchy has spread like a plague across the seas to the Empires of the South and East. The Empires, Nations and Kingdoms of Orbis have collapsed in on themselves, breaking down into Baronies, Provinces and City States. Each man?s hand is set against his brothers? in terrible bloody battles for survival and supremacy. Chaos is driving the provinces apart and the Empire closer to war. Warrior Kings: Battles is set in the amazing and living medieval fantasy world of Orbis. To conquer it will take all the cunning, resourcefulness and tactics you can muster. [Strategy First Inc.]… Expand"}, {"name": "Fur Fighters: Viggo's Revenge", "details_link": "https://www.metacritic.com/game/playstation-2/fur-fighters-viggos-revenge", "publisher": "Acclaim", "release_date": "Jun  3 2001", "developers": ["Bizarre Creations"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/2ef5c5d52d18c31ccda70ba926d63b1c-98.jpg", "descriptions": "An elite fighting force of five stuffed animals from Fur Fighter Village are sent on a mission to rescue their homeland from the evil General Viggo (and they do it with shotguns, machine guns, rockets and other non-stuffed weopons)."}, {"name": "An Airport for Aliens Currently Run by Dogs", "details_link": "https://www.metacritic.com/game/pc/an-airport-for-aliens-currently-run-by-dogs", "publisher": "Strange Scaffold", "release_date": "May 25 2021", "developers": ["Strange Scaffold"], "platforms": ["Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/9ea6d59b5b8338f9abeb8bb70060581f-98.jpg", "descriptions": "An Airport for Aliens Currently Run by Dogs is a first-person open-world comedy adventure game with a very long name. You and your fiancee are the last two human beings left in the universe. Dogs run airports, along with the rest of society. Deal with alien logic, travel issues, andAn Airport for Aliens Currently Run by Dogs is a first-person open-world comedy adventure game with a very long name. You and your fiancee are the last two human beings left in the universe. Dogs run airports, along with the rest of society. Deal with alien logic, travel issues, and strange stock photo dogs as you attempt to stay in touch with the person you love, when you both live your lives on the go!… Expand"}, {"name": "NASCAR Heat 3", "details_link": "https://www.metacritic.com/game/playstation-4/nascar-heat-3", "publisher": "704Games", "release_date": "Sep  7 2018", "developers": ["Monster Games Inc.", "704Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 64, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/43947d00d8b7e7cd9fce3ac633f03c65-98.jpg", "descriptions": "Jump into the enhanced Career Mode, build your own race team and compete in the Xtreme Dirt Tour. Prove that you are the best in the world in the new Online Tournaments feature. Plus, all your favorite modes are back."}, {"name": "Spheroids", "details_link": "https://www.metacritic.com/game/xbox-one/spheroids", "publisher": "Eclipse Games", "release_date": "Feb 10 2017", "developers": ["Eclipse Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/3cfccaaa3d918ac89a72226010eb3ae9-98.jpg", "descriptions": "Save the cube world from the dangerous rounded Spheroid aliens. In Spheroids you take control of Lucas, a jumpy Canadian boy who sets out on an adventure with his crazy scientist companion Otto after it's discovered that the government has been hiding alternative universes from the cubicSave the cube world from the dangerous rounded Spheroid aliens. In Spheroids you take control of Lucas, a jumpy Canadian boy who sets out on an adventure with his crazy scientist companion Otto after it's discovered that the government has been hiding alternative universes from the cubic world they live in. Unfortunately, these alternative universes contain spheres that wish to turn everything round, so it's up to Lucas to save the world from these dangerous aliens: the Spheroids. Throughout Spheroids' 32 levels, youll encounter many different environments, with multiple hazards to avoid and enemies to destroy. Items such as the \"Modified Drilling Hoo\"k Otto lends Lucas will help you traverse the environment with ease, with many more to find throughout.… Expand"}, {"name": "The House of the Dead III", "details_link": "https://www.metacritic.com/game/playstation-3/the-house-of-the-dead-iii", "publisher": "Sega", "release_date": "Feb 14 2012", "developers": ["Wow Entertainment"], "platforms": "PlayStation 3", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Rail", "Light Gun"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/7b3d727742025698c0431b49c29ef9a6-98.jpg", "descriptions": "From the darkest corners, cadavers and zombies return to haunt your every move. In The House of the Dead III, you'll plow through the undead with shotgun in hand as you explore a postapocalyptic wasteland. The new shotgun can take out multiple enemies in a single blast. Take out wave afterFrom the darkest corners, cadavers and zombies return to haunt your every move. In The House of the Dead III, you'll plow through the undead with shotgun in hand as you explore a postapocalyptic wasteland. The new shotgun can take out multiple enemies in a single blast. Take out wave after wave of horrific zombies as you travel different routes and discover secrets and hidden areas. The House of the Dead III's time-sensitive gameplay forces you to exterminate your foes as quickly as possible.… Expand"}, {"name": "Crimsonland", "details_link": "https://www.metacritic.com/game/playstation-4/crimsonland", "publisher": "10tons Ltd", "release_date": "Jul 15 2014", "developers": ["10tons Entertainment", "10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Scrolling", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 64, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/b455f8237469a708ced9b24a5c3aea1d-98.jpg", "descriptions": "Thousands of aliens, giant spiders, mutant lizards, and more are on the attack - can you survive the onslaught? Crimsonland is a top-down shooter with a touch of RPG. Unlock over 30 weapons and over 50 perks from quirky to brutal. Complete the quest and show your skills in five survival modes."}, {"name": "Yonder: The Cloud Catcher Chronicles", "details_link": "https://www.metacritic.com/game/playstation-4/yonder-the-cloud-catcher-chronicles", "publisher": "Merge Games", "release_date": "Jul 18 2017", "developers": ["Prideful Sloth"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/96f69632f6932f196e5c01e14200bbea-98.jpg", "descriptions": "Yonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the islandYonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the island flourish.… Expand"}, {"name": "Project Sylpheed: Arc of Deception", "details_link": "https://www.metacritic.com/game/xbox-360/project-sylpheed-arc-of-deception", "publisher": "Square Enix", "release_date": "Jul 10 2007", "developers": ["Game Arts", "Seta Corporation"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 64, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/87a67ce662adce7454e83455c42c107d-98.jpg", "descriptions": "Project Sylpheed takes you centuries into the future where you customize and pilot amazing starships, battle swarms of enemy fighters, and enjoy stellar visuals. Become immersed in the full, multilayered storyline. Take on hordes of enemy starfighters in extreme 3-D space combat. EnjoyProject Sylpheed takes you centuries into the future where you customize and pilot amazing starships, battle swarms of enemy fighters, and enjoy stellar visuals. Become immersed in the full, multilayered storyline. Take on hordes of enemy starfighters in extreme 3-D space combat. Enjoy animation with vivid visuals, cool space settings, and over 50 minutes of CG video. [Square Enix]… Expand"}, {"name": "Rise & Shine", "details_link": "https://www.metacritic.com/game/pc/rise-shine", "publisher": "Adult Swim", "release_date": "Jan 13 2017", "developers": ["Super Mega Team", "Super Awesome Hyper Dimensional Mega Team"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/882d9e2e77e9ce6d2ab0d114d426c4eb-98.jpg", "descriptions": "Welcome to Gamearth, a once peaceful planet now threatened by the warmongering Space grunts of Nexgen. In the aftermath of their devastating first strike a child named Rise is forced to take on the sacred gun Shine - and with it the fate of his world."}, {"name": "Fallen Legion: Sins of an Empire", "details_link": "https://www.metacritic.com/game/playstation-4/fallen-legion-sins-of-an-empire", "publisher": "YummyYummyTummy", "release_date": "Jul 18 2017", "developers": ["YummyYummyTummy"], "platforms": "PlayStation 4", "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/8c5a9cf7dc208849a70df4b73f1121fb-98.jpg", "descriptions": "Fallen Legion: Sins of an Empire is an intense action RPG where every battle is a heart-pounding fight and each gut-wrenching choice impacts the realm."}, {"name": "Fallout 4: Nuka-World", "details_link": "https://www.metacritic.com/game/playstation-4/fallout-4-nuka-world", "publisher": "Bethesda Softworks", "release_date": "Aug 30 2016", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/3525296f281d3fb95e8b6cb62fafab17-98.jpg", "descriptions": "Take a trip to Nuka-World, a vast amusement park now a lawless city of Raiders. Explore an all-new region with an open wasteland and park zones like Safari Adventure, Dry Rock Gulch, Kiddie Kingdom and the Galactic Zone. Nuka-World features new quests, Raiders, weapons, creatures and more.Take a trip to Nuka-World, a vast amusement park now a lawless city of Raiders. Explore an all-new region with an open wasteland and park zones like Safari Adventure, Dry Rock Gulch, Kiddie Kingdom and the Galactic Zone. Nuka-World features new quests, Raiders, weapons, creatures and more. Enjoy the ride!… Expand"}, {"name": "Surf's Up", "details_link": "https://www.metacritic.com/game/wii/surfs-up", "publisher": "Ubisoft", "release_date": "May 30 2007", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "2  Online", "genres": ["Sports", "Alternative", "Individual", "Surfing", "Surfing", "Surf / Wakeboard"], "meta_score": 64, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/72a2746e7f149d0dbfbb410b0eadb36f-98.jpg", "descriptions": "Surf's Up is an arcade surfing and extreme sports video game. The action is set at the annual \"Reggie Belafonte Big Z Memorial Surf Off,\" where surfers from around the world are ready to risk it all for glory. Players experience the rush and thrills of surfing in exotic surf spots around PenSurf's Up is an arcade surfing and extreme sports video game. The action is set at the annual \"Reggie Belafonte Big Z Memorial Surf Off,\" where surfers from around the world are ready to risk it all for glory. Players experience the rush and thrills of surfing in exotic surf spots around Pen Gu Island and can rip it up and play as one of 10 characters from the film, including Cody, the young challenger from Shiverpool; Tank, the merciless champion; or Big Z, the surfing legend from the past. Only by mastering and understanding the waves can the player become not only the new champion, but a true surf legend. Game features include: Innovative arcade and surf feeling with players performing a variety of impressive tricks in the air and learning to surf inside a tube. Win the championship in the single-player mode or challenge your friends in the multiplayer mode with easy pick-up-and-play game controls. Surf in a variety of locations, each with its own waves and obstacles. Train in the calm water of Shiverpool, ride your first tubes in Pen Gu Island, and try to surf on the explosive waters of the volcano area. [Ubisoft]… Expand"}, {"name": "Prince of Persia: The Fallen King", "details_link": "https://www.metacritic.com/game/ds/prince-of-persia-the-fallen-king", "publisher": "Ubisoft", "release_date": "Dec  2 2008", "developers": ["Ubisoft"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 64, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/310b9e39d89fd93cd457ec7c02156558-98.jpg", "descriptions": "Facing imminent danger, the Prince flees to a deserted kingdom that seemingly offers sanctuary. Already touched by the evil Corruption, a dark substance that physically contaminates the land and the skies, the kingdom is filled with adventure, challenge and intrigue. As the Prince seeks aFacing imminent danger, the Prince flees to a deserted kingdom that seemingly offers sanctuary. Already touched by the evil Corruption, a dark substance that physically contaminates the land and the skies, the kingdom is filled with adventure, challenge and intrigue. As the Prince seeks a way to fight the spreading Corruption destroying the land, he encounters a partially infected creature that promises salvation. But is the creature truly an ally or merely an enemy in disguise? It seems this perilous alliance may be the only way for the Prince to face the forces of darkness and save the Persian kingdom from the Corruption once and for all. Use the DS stylus to master the acrobatics, strategy and fighting tactics of the most agile warrior of all time. Immerse yourself in the captivating Prince of Persia universe with an original and independent story that closely coincides with the action of the console & PC editions of the game. Brand-new art design delivers incredible environments in over 50+ maps. Explore deserted cities, dark labyrinths and forbidding jungles to battle the evil Corruption. Play as the all-new character: the Magus: Switch between the Prince and this mysterious new ally to fight, solve puzzles and utilize his magical powers to make your way through the corrupted land. [Ubisoft]… Expand"}, {"name": "Akiba's Trip: Undead & Undressed", "details_link": "https://www.metacritic.com/game/playstation-vita/akibas-trip-undead-undressed", "publisher": "XSEED Games", "release_date": "Aug 12 2014", "developers": ["Acquire"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Open-World"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/2afddd22d6d3e6c77152b00f7614f2a7-98.jpg", "descriptions": "The game features a recreation of Japan's Electronics Mecca - much like a virtual tour of Tokyo's Akihabara ward. Major outdoor locales from the city have been carefully recreated, with over 130 real-life shops accurately represented."}, {"name": "NBA Live 07", "details_link": "https://www.metacritic.com/game/psp/nba-live-07", "publisher": "EA Sports", "release_date": "Sep 25 2006", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/3c1cffee08c4658ff697e49685c0336f-98.jpg", "descriptions": "NBA LIVE 07 plays as good as it looks with gameplay advancements that build upon the depth and authenticity that the NBA LIVE franchise has delivered for more than a decade. NBA LIVE 07 introduces the next generation of basketball gameplay with EA SPORTS Total Freestyle Control, a newNBA LIVE 07 plays as good as it looks with gameplay advancements that build upon the depth and authenticity that the NBA LIVE franchise has delivered for more than a decade. NBA LIVE 07 introduces the next generation of basketball gameplay with EA SPORTS Total Freestyle Control, a new feature that gives users more control over athletes than ever. By introducing a next generation AI system that is both intuitive and intelligent, combined with advancements to fan-favorite features like All-Star Weekend and Dynasty Mode, NBA LIVE 07 continues to deliver its award-winning gameplay experience. This year NBA LIVE 07 partners with the worldwide leader in sports to deliver more ESPN content in-game while you play than ever before. [Electronic Arts]… Expand"}, {"name": "Nexuiz", "details_link": "https://www.metacritic.com/game/xbox-360/nexuiz", "publisher": "THQ", "release_date": "Feb 29 2012", "developers": ["IllFonic"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Tactical", "Arcade"], "meta_score": 64, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/f40baf50edead34744c21f98fbd401c8-98.jpg", "descriptions": "Nexuiz is a fast paced Arena first-person shooter with extremely competitive game play made specifically for consoles. The game will feature a mutator system that allows players to change the rules of the match; as players rank, new mutators become available for them to use. Leader boardsNexuiz is a fast paced Arena first-person shooter with extremely competitive game play made specifically for consoles. The game will feature a mutator system that allows players to change the rules of the match; as players rank, new mutators become available for them to use. Leader boards are designed for social networking, letting players feel more engaged with the community. … Expand"}, {"name": "Assassin's Creed Unity: Dead Kings", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-unity-dead-kings", "publisher": "Ubisoft", "release_date": "Jan 13 2015", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "Historic", "Open-World"], "meta_score": 64, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/edabdd1df1d5a3ee9435a8ff3aed5b0c-98.jpg", "descriptions": "Following the incidents of Assassin’s Creed Unity, Arno’s quest for redemption leads him to the town of Saint Denis, then known as Franciade. There he is dispatched on a mission that takes him to the bowels of the city, an intricate network of catacombs and deep caves that hold the remainsFollowing the incidents of Assassin’s Creed Unity, Arno’s quest for redemption leads him to the town of Saint Denis, then known as Franciade. There he is dispatched on a mission that takes him to the bowels of the city, an intricate network of catacombs and deep caves that hold the remains and best-kept secrets of past French kings. To unearth the dark mysteries that lie beneath the Basilica, Arno is equipped with a lantern to guide his way and will gain access to the Guillotine Gun, a powerful weapon made for both long-range destruction and deadly close-quarter combat.… Expand"}, {"name": "LEGO Harry Potter: Years 5-7", "details_link": "https://www.metacritic.com/game/playstation-vita/lego-harry-potter-years-5-7", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar  6 2012", "developers": ["Traveller's Tales"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "PlayStation Vita"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/d40c99b05c737c5fb56cc6b7cfbf1734-98.jpg", "descriptions": "Based on the last three Harry Potter books and final four films, LEGO Harry Potter: Years 5-7 takes players through Harry Potter’s heroic adventures in the Muggle and wizarding worlds. From Privet Drive in Little Whinging to Diagon Alley, Hogsmeade and Hogwarts – plus new locations includingBased on the last three Harry Potter books and final four films, LEGO Harry Potter: Years 5-7 takes players through Harry Potter’s heroic adventures in the Muggle and wizarding worlds. From Privet Drive in Little Whinging to Diagon Alley, Hogsmeade and Hogwarts – plus new locations including Grimmauld Place, the Ministry of Magic, and Godric’s Hollow – players will encounter new faces, new challenges and new magic, preparing them for the ultimate face-off against Lord Voldemort.… Expand"}, {"name": "lilt line", "details_link": "https://www.metacritic.com/game/wii/lilt-line", "publisher": "Gaijin Games", "release_date": "Dec 13 2010", "developers": ["different cloth"], "platforms": ["iPhone/iPad", "Wii"], "num_players": "1 Player", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 64, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/ccbf83139537597dad9c0eef4c37aa50-98.jpg", "descriptions": "lilt line is an award-winning rhythm racing game with a dubstep soundtrack and a visual aesthetic that will confound your senses and rock your soul."}, {"name": "Gal*Gun: Double Peace", "details_link": "https://www.metacritic.com/game/playstation-4/galgun-double-peace", "publisher": "PQube", "release_date": "Aug  2 2016", "developers": ["Alchemist", "Inti Creates"], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/a8dc3b43d038ff67e2131d4dbc67ccfa-98.jpg", "descriptions": "Houdai, a typically incompetent high school boy when it come to matters of the heart, accidentally eats a full power cupid shot and becomes insanely popular with the ladies at his academy. However, having an entire lifetime’s sex appeal condensed into one day is not without its problems. OurHoudai, a typically incompetent high school boy when it come to matters of the heart, accidentally eats a full power cupid shot and becomes insanely popular with the ladies at his academy. However, having an entire lifetime’s sex appeal condensed into one day is not without its problems. Our hero finds out the hard way that being Mr. Popular isn’t all it’s cracked up to be. Houdai must somehow resist every cute girl that throws herself at him in an effort to find his true love! If Houdai doesn’t find \"the one\" and confess to her by the end of the day, he will be forever alone.… Expand"}, {"name": "The Matrix: Path of Neo", "details_link": "https://www.metacritic.com/game/pc/the-matrix-path-of-neo", "publisher": "Atari", "release_date": "Nov  7 2005", "developers": ["Shiny Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 64, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/c4e652025669848638061ea9ecea85cd-98.jpg", "descriptions": "Set in the Matrix universe, The Matrix: Path of Neo enables players to play as Neo, the central character, and relive his most important and memorable scenarios from the complete film trilogy, including the original film, \"The Matrix.\" Throughout the game, the path the player takes toSet in the Matrix universe, The Matrix: Path of Neo enables players to play as Neo, the central character, and relive his most important and memorable scenarios from the complete film trilogy, including the original film, \"The Matrix.\" Throughout the game, the path the player takes to resolve each scenario and the resulting consequences are scripted and directed by the Wachowski Brothers. The likenesses of all of the films' key actors -- including Keanu Reeves (\"Neo\"), Laurence Fishburne (\"Morpheus\"), Carrie-Ann Moss (\"Trinity), and Hugo Weaving (\"Agent Smith\") -- are featured in the game, which also includes footage from all three feature films, as well as \"The Animatrix.\" [Atari]… Expand"}, {"name": "NBA Live 06", "details_link": "https://www.metacritic.com/game/xbox-360/nba-live-06", "publisher": "EA Sports", "release_date": "Nov 16 2005", "developers": ["EA Canada"], "platforms": ["PC", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 64, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/3c420d2c50f87fe4159e53ad3156a2b6-98.jpg", "descriptions": "Freestyle Superstars: You are in control of the top NBA stars, performing like their real-life counterparts based on distinct character types, including Power, Playmaker, Stopper and more. Authentic 5-on-5 Gameplay: The all-new animation system helps to visually present the up-tempo,Freestyle Superstars: You are in control of the top NBA stars, performing like their real-life counterparts based on distinct character types, including Power, Playmaker, Stopper and more. Authentic 5-on-5 Gameplay: The all-new animation system helps to visually present the up-tempo, fast-break brand of basketball that makes the NBA thrive. Also featured, is an improved transition game and a more physical brand of play with collisions and dunked-on scenarios. New Player Visuals: A new graphics engine now has player models not only playing and acting like their real life counterparts, but looking the part with striking detail and realism. [Electronic Arts]… Expand"}, {"name": "Rust: Console Edition", "details_link": "https://www.metacritic.com/game/xbox-one/rust-console-edition", "publisher": "Koch Media", "release_date": "May 18 2021", "developers": ["Facepunch Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Massively Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 64, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/0/9baa422e663ab3a20912f8b9aa690ec6-98.jpg", "descriptions": "The only aim in Rust is to survive.\r To do this you will need to overcome struggles such as hunger, thirst and cold. Build a fire. Build a shelter. Kill animals for meat. Protect yourself from other players, and kill them for meat. Create alliances with other players and form a town.The only aim in Rust is to survive.\r To do this you will need to overcome struggles such as hunger, thirst and cold. Build a fire. Build a shelter. Kill animals for meat. Protect yourself from other players, and kill them for meat. Create alliances with other players and form a town. \r\rWhatever it takes to survive.… Expand"}, {"name": "Bite the Bullet", "details_link": "https://www.metacritic.com/game/xbox-one/bite-the-bullet", "publisher": "Graffiti Games", "release_date": "Aug 14 2020", "developers": ["Mega Cat Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/083daf21b70c1e39e969540cd32f8bc9-98.jpg", "descriptions": "Satisfy your appetite for destruction in this roguelite RPG shooter where you must eat to powerup your character, weapons, and abilities. Consume strange species to add new entries to DarwinCorp's mysterious Compendium. Catalyze crafting fermentations in your belly by eating enemies! ExploreSatisfy your appetite for destruction in this roguelite RPG shooter where you must eat to powerup your character, weapons, and abilities. Consume strange species to add new entries to DarwinCorp's mysterious Compendium. Catalyze crafting fermentations in your belly by eating enemies! Explore three branching skill trees based on your diet - remember, you are what you eat!… Expand"}, {"name": "Serial Cleaner", "details_link": "https://www.metacritic.com/game/pc/serial-cleaner", "publisher": "iFun4all", "release_date": "Jul 17 2017", "developers": ["iFun4all"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Linear"], "meta_score": 64, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/d8ca57e76698a6b5df6a7842bbf297f8-98.jpg", "descriptions": "Serial Cleaner is a story-driven, fast-paced stealth/action game, characterized by a 1970s theme and aesthetics. You are a professional cleaner. Your job is to clean up murder scenes by disposing bodies, covering up blood stains and hiding murder weapons and other incriminating evidence."}, {"name": "The Walking Dead: The Telltale Series - A New Frontier Episode 5: From The Gallows", "details_link": "https://www.metacritic.com/game/xbox-one/the-walking-dead-the-telltale-series---a-new-frontier-episode-5-from-the-gallows", "publisher": "Telltale Games", "release_date": "May 30 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 64, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/620a1c3abb5229c24765d75affb47b46-98.jpg", "descriptions": "After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? Telltale’s latest episodic adventure in the world of the Walking Dead is now available on all your favorite devices."}, {"name": "Tank Troopers", "details_link": "https://www.metacritic.com/game/3ds/tank-troopers", "publisher": "Nintendo", "release_date": "Feb 16 2017", "developers": ["Nintendo"], "platforms": "3DS", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/c3dfd184820fa5c810e3c9f4ac335180-98.jpg", "descriptions": "You've never seen tanks like these!\r ATTENTION! Calling all troopers for 6-player* tank warfare!\r\n\r\nChoose a tank, pick troopers, and battle your friends via local wireless. Each trooper has a special ability, from electric shocks to healing. Deploy them tactically to win 30+ custom tanksYou've never seen tanks like these!\r ATTENTION! Calling all troopers for 6-player* tank warfare!\r Choose a tank, pick troopers, and battle your friends via local wireless. Each trooper has a special ability, from electric shocks to healing. Deploy them tactically to win 30+ custom tanks with unique stats. Battle with bombs, on teams, or in a free-for-allbut always fight! Fight! FIGHT!\r The single-player mode contains 30 stages, so you'll have to devise a multitude of strategies and maneuvers to conquer them all. Not to mention, each stage will issue you a new challenge, such as defeating an enormous tank that makes yours look like a chew toy. You can take on these challenges aboard your own customized tank or use a provided one. Either way, your tank will have a specific crew capacity and stats. As you battle, you'll find power-ups, like camouflage and Stamina Meat, while earning coins that you can spend to get more troopers, tanks, and paint jobs. Make sure this fight is one your friends and enemies won't soon forget!… Expand"}, {"name": "Tom Clancy's The Division - Underground", "details_link": "https://www.metacritic.com/game/playstation-4/tom-clancys-the-division---underground", "publisher": "Ubisoft", "release_date": "Jun 28 2016", "developers": ["Massive Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Arcade"], "meta_score": 64, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/67811a34de23c55db7975daa144d7c54-98.jpg", "descriptions": "Dive into the underbelly of New York to save what remains in Underground, the first expansion for Tom Clancy’s The Division. Explore the randomly generated mazes of subways, tunnels and sewers to fight deadly enemies and recover powerful loot. Experience an all-new incursion and find theDive into the underbelly of New York to save what remains in Underground, the first expansion for Tom Clancy’s The Division. Explore the randomly generated mazes of subways, tunnels and sewers to fight deadly enemies and recover powerful loot. Experience an all-new incursion and find the latest weapons, gear and more.… Expand"}, {"name": "The Delusions of Von Sottendorff and His Squared Mind", "details_link": "https://www.metacritic.com/game/3ds/the-delusions-of-von-sottendorff-and-his-squared-mind", "publisher": "Delirium Studios", "release_date": "Dec 17 2015", "developers": ["Delirium Studios"], "platforms": ["Wii U", "3DS"], "genres": ["Puzzle", "Logic"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/124d75f15b420194bcf54f7fefa55e7a-98.jpg", "descriptions": "El Barón Von Sottendorff es un aristócrata muy de su tiempo. Noble, con una gran presencia, reside en una impresionante mansión de principios del siglo XX. Y aunque puede entrar y salir de ella cuando quiera, lo que no sabe es que realmente está atrapado dentro de su propia mente.\r BajoEl Barón Von Sottendorff es un aristócrata muy de su tiempo. Noble, con una gran presencia, reside en una impresionante mansión de principios del siglo XX. Y aunque puede entrar y salir de ella cuando quiera, lo que no sabe es que realmente está atrapado dentro de su propia mente.\r Bajo esta premisa nace Los delirios de Von Sottendorff y su mente cuadriculada, el nuevo trabajo de Delirium Studios, que llegará el próximo invierno en exclusiva para Nintendo 3DS.… Expand"}, {"name": "Three Fourths Home: Extended Edition", "details_link": "https://www.metacritic.com/game/xbox-one/three-fourths-home-extended-edition", "publisher": "Digerati Distribution", "release_date": "Nov 27 2015", "developers": ["[bracket]games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "genres": ["Adventure", "General", "Text"], "meta_score": 64, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/7/6976a2513d9a70e138edae9a4f7ba068-98.jpg", "descriptions": "In her mid-20's, Kelly has been forced to move back to Nebraska. Back to that flat expanse, that seemingly endless sea of rustling cornstalks peppered by rusty silos and rustier towns. A typically intense Midwestern storm is approaching while Kelly is out; she has to get home. In the 20In her mid-20's, Kelly has been forced to move back to Nebraska. Back to that flat expanse, that seemingly endless sea of rustling cornstalks peppered by rusty silos and rustier towns. A typically intense Midwestern storm is approaching while Kelly is out; she has to get home. In the 20 miles between her grandparents' crumbling barn and her parents' house, she receives a phone call from her mother. Assume the role of Kelly during her drive through the storm in Three Fourths Home: Extended Edition. While driving through a stylized representation of rural Nebraska, players navigate an extended conversation between Kelly and her parents and younger brother. Through dialogue choice and simple driving mechanics, this critically-acclaimed visual short story explores a specific moment of these characters' lives and their relationships with one another. The Extended Edition of Three Fourths Home includes an epilogue that expands on the story of the main game. Set at a bus stop in snowy Minnesota, this epilogue examines Kelly's past as well as the effects that the events of the main story have had on her.… Expand"}, {"name": "Fire: Ungh's Quest", "details_link": "https://www.metacritic.com/game/pc/fire-unghs-quest", "publisher": "EuroVideo Medien", "release_date": "Apr  9 2015", "developers": ["Daedalic Entertainment"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "Puzzle", "Action", "Point-and-Click"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/177c902835e3f2534bb2dea677784cfe-98.jpg", "descriptions": "FIRE, the new adventure by Daedalic Entertainment is set in the cutest Stone Age setting you've ever seen. Ungh, FIRE’s adorably-naive protagonist, was supposed to watch over his tribe’s fireplace during the night. But being a slightly clumsy Neanderthal, Ungh fell asleep and let the fire goFIRE, the new adventure by Daedalic Entertainment is set in the cutest Stone Age setting you've ever seen. Ungh, FIRE’s adorably-naive protagonist, was supposed to watch over his tribe’s fireplace during the night. But being a slightly clumsy Neanderthal, Ungh fell asleep and let the fire go out.… Expand"}, {"name": "Abyss Odyssey", "details_link": "https://www.metacritic.com/game/xbox-360/abyss-odyssey", "publisher": "Atlus", "release_date": "Jul 16 2014", "developers": ["ACE Team"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Fantasy", "Linear"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/c0ab4bd4603fb90c7900463255c90f34-98.jpg", "descriptions": "From indie Chilean developer ACE Team comes a new side-scrolling action adventure game featuring a complex fighting engine in procedurally generated levels that destines its three warriors to battle a different abyss each time!"}, {"name": "Whispering Willows", "details_link": "https://www.metacritic.com/game/pc/whispering-willows", "publisher": "Night Light Interactive", "release_date": "Jul  9 2014", "developers": ["Night Light Interactive"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "Puzzle"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/1c1e9f4d16249b7d7d1b047302880244-98.jpg", "descriptions": "In Whispering Willows, the player takes on the role of Elena, a determined young girl with the extraordinary ability to project her spirit outside of her body. In her spectral form, Elena can interact with the benevolent spirits and wicked wraiths that used to dwell within the walls of theIn Whispering Willows, the player takes on the role of Elena, a determined young girl with the extraordinary ability to project her spirit outside of her body. In her spectral form, Elena can interact with the benevolent spirits and wicked wraiths that used to dwell within the walls of the sinister Willows Mansion - lost souls, stuck in time and space, who hold the secrets that Elena will need to traverse the terrifying old manor. Players need to make use of Elenas corporeal and ethereal forms to overcome obstacles, solve the riddles of the mansions enigmatic specters, and find Elenas lost father.… Expand"}, {"name": "Chronology", "details_link": "https://www.metacritic.com/game/pc/chronology", "publisher": "osao games", "release_date": "May 12 2014", "developers": ["osao games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/622d50f39f32fd40dd3c2ba09b0a5d06-98.jpg", "descriptions": "A platform-adventure game about time travelling, puzzle solving and a friendship between an Old Inventor and a Snail."}, {"name": "Warriors Orochi 3 Hyper", "details_link": "https://www.metacritic.com/game/wii-u/warriors-orochi-3-hyper", "publisher": "Tecmo Koei America Corp.", "release_date": "Nov 18 2012", "developers": ["Omega Force"], "platforms": ["PlayStation 3", "Xbox 360", "Wii U"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/142219b7f942328aa36ebead67180ac1-98.jpg", "descriptions": "Years after the battle against Orochi, the Serpent King, the heroes of the Three Kingdoms and the Warring States struggle to seize control of the new universe they were thrown into when a new threat arises. A terrible and colossal monster, resembling a serpent with eight heads, casts itsYears after the battle against Orochi, the Serpent King, the heroes of the Three Kingdoms and the Warring States struggle to seize control of the new universe they were thrown into when a new threat arises. A terrible and colossal monster, resembling a serpent with eight heads, casts its shadow across the land and defeats most of the brave warriors. The ones that survived, assisted by the mysterious Kaguya, travel back through time to save fallen warriors and forge new alliances, collect powerful weapons and build an army so they can have a chance to defeat the terrible Hydra. But that is not all the help they'll get this time, as the vortex created by Orochi drags a few more allies to their universe. Dragon Ninja Ryu Hayabusa, Achilles, Jeanne d'Arc, Nemea and Ayane are only a few of the new additions to the 120 plus playable character roster!… Expand"}, {"name": "Namco Museum Essentials", "details_link": "https://www.metacritic.com/game/playstation-3/namco-museum-essentials", "publisher": "Namco Bandai Games America", "release_date": "Jul 16 2009", "developers": ["Namco Bandai Games"], "platforms": "PlayStation 3", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 64, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/83674eafa51b3cecc23d7043d0eed0c2-98.jpg", "descriptions": "[Playstation Network]  With five classic games and a brand new arranged Xevious title, players can re-live the old-school days of classic arcade gaming with legends including Pac-Man, Galaga and Dig Dug. Namco Museum Essentials is jam-packed with nostalgic favorites and a future classic that[Playstation Network]  With five classic games and a brand new arranged Xevious title, players can re-live the old-school days of classic arcade gaming with legends including Pac-Man, Galaga and Dig Dug. Namco Museum Essentials is jam-packed with nostalgic favorites and a future classic that will keep you and your friends entertained for hours! The debut of a classic envisioned, Xevious Resurrection offers a new twist, a fresh digitally enhanced look, co-op gameplay and intense shooting action. Show off your skills in the High Score Attack Mode and compete against the world for the #1 spot. Collect stamps and NM Points to unlock Trophies and rewards to use in PLAYSTATION Home to customize your avatar and Club house. Connect with friends and share your play history, challenge your friends' high score rankings and view their rewards. [Namco Bandai Games]… Expand"}, {"name": "Nancy Drew: The Deadly Secret of Olde World Park", "details_link": "https://www.metacritic.com/game/ds/nancy-drew-the-deadly-secret-of-olde-world-park", "publisher": "Majesco Games", "release_date": "Sep 18 2007", "developers": ["Gorilla Systems"], "platforms": "DS", "genres": ["Adventure", "General", "General"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/934d51f3981c0a13a28c32bf7f45992c-98.jpg", "descriptions": "Olde World, a multimillion dollar vacation spot celebrating the peak of history’s greatest civilizations, is the brainchild of billionaire industrialist Thaddeus Belmont. On the eve of Olde World's opening, the usually boisterous billionaire hasn't been seen or heard from in days, and it’sOlde World, a multimillion dollar vacation spot celebrating the peak of history’s greatest civilizations, is the brainchild of billionaire industrialist Thaddeus Belmont. On the eve of Olde World's opening, the usually boisterous billionaire hasn't been seen or heard from in days, and it’s up to Nancy to unravel his mysterious disappearance. In Nancy Drew: The Deadly Secret of Olde World Park, players assume the role of the classic teenage super sleuth. Players must collect clues, decipher puzzles, follow suspects, sneak into areas and much more as they use their deductive reasoning skills to progress through 13 increasingly difficult chapters in graphic novel format. Touch Screen play is incorporated into unique conversation and unlocking mini-games, but players will also use the stylus in Nancy’s Clue Journal to access inventory and tasks. [Majesco Games]… Expand"}, {"name": "Disney/Pixar Ratatouille", "details_link": "https://www.metacritic.com/game/ds/disneypixar-ratatouille", "publisher": "THQ", "release_date": "Jun 26 2007", "developers": ["Helixe"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/2c8899d4eecc8719cba8e658767ed5ca-98.jpg", "descriptions": "Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6 action-packed worlds filled with dangerous enemies, heists and perilous missions. Players can go head-to-head with their friends in multiplayer mini-games or navigate their way through a sensational rat race that turns the culinary world of Paris upside down. [THQ]… Expand"}, {"name": "Fantastic 4", "details_link": "https://www.metacritic.com/game/playstation-2/fantastic-4", "publisher": "Activision", "release_date": "Jun 27 2005", "developers": ["7 Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/e9a065424cf720f2f97d4b8439a59581-98.jpg", "descriptions": "Fantastic Four game players are be able to harness the Marvel Super Heroes' unique and amazing powers through a compelling single-player or two-player co-operative team based gameplay experience.  Authored by Zak Penn, who co-wrote the story for \"X2,\" the game follows the Fantastic FourFantastic Four game players are be able to harness the Marvel Super Heroes' unique and amazing powers through a compelling single-player or two-player co-operative team based gameplay experience.  Authored by Zak Penn, who co-wrote the story for \"X2,\" the game follows the Fantastic Four film's storyline and expands the adventures by letting players stretch, control fire and use invisibility and brute force to defeat evil Super Villains in new environments and familiar comic book locales.  Challenged to master the individual powers of each Super Hero and combine them to level even more devastating attacks, players must battle some of Marvel's most notorious Super Villains, including, the ultimate evil - Doctor Doom -- to save the human race from disaster. [Activision]… Expand"}, {"name": "Alias", "details_link": "https://www.metacritic.com/game/xbox/alias", "publisher": "Acclaim", "release_date": "Apr  5 2004", "developers": ["Acclaim Studios Cheltenham"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/f3d8bca38b8f524bfee1683961631fb9-98.jpg", "descriptions": "Alias is a third-person action adventure containing a unique blend of action and stealth that puts you under fire and under pressure.  Whether you're up against the clock or being hunted by the enemy, fighting against the odds, or fleeing for your life, the action is relentless.  UtilizeAlias is a third-person action adventure containing a unique blend of action and stealth that puts you under fire and under pressure.  Whether you're up against the clock or being hunted by the enemy, fighting against the odds, or fleeing for your life, the action is relentless.  Utilize your incredible spyware, deadly moves, and array of disguises to complete the most dangerous covert missions across the globe.  All the heart-stopping action and tension of the TV series is now under your control.… Expand"}, {"name": "Freaky Flyers", "details_link": "https://www.metacritic.com/game/xbox/freaky-flyers", "publisher": "Midway", "release_date": "Aug  5 2003", "developers": ["Midway"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/6a117ce5c19821c72c07712c4eaba0eb-98.jpg", "descriptions": "Freaky Flyers takes you into the air for fast-and-furious racing with an interesting cast of animated characters. You'll either play as or encounter more than a dozen characters including an American hero, a female bandit from south of the border, and a mellow ambassador of tropicalFreaky Flyers takes you into the air for fast-and-furious racing with an interesting cast of animated characters. You'll either play as or encounter more than a dozen characters including an American hero, a female bandit from south of the border, and a mellow ambassador of tropical paradise. Explore, adventure, and dogfight in the skies over Danger Island, Haunted Transylvania, and Roaring Chicago. Pirates, haunted castles, and mob bosses all lie ahead of you--are you skilled enough to overcome these dangers?… Expand"}, {"name": "IGI 2: Covert Strike", "details_link": "https://www.metacritic.com/game/pc/igi-2-covert-strike", "publisher": "Codemasters", "release_date": "Mar  3 2003", "developers": ["Innerloop"], "platforms": "PC", "num_players": "Up to 16 ", "genres": ["Action", "Action Adventure", "Modern", "General", "Shooter", "First-Person", "Tactical"], "meta_score": 64, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/88e09f5088af28b91d6561cad6da515b-98.jpg", "descriptions": "Snipe out terrorism as David Jones takes aim once again in this spectacular action and stealth sequel to Project IGI. Shadow David Jones through Russia, across Libya and into China in three linked covert campaigns, as he infiltrates locations including military airbases, harbours and secretSnipe out terrorism as David Jones takes aim once again in this spectacular action and stealth sequel to Project IGI. Shadow David Jones through Russia, across Libya and into China in three linked covert campaigns, as he infiltrates locations including military airbases, harbours and secret government installations. Features completely new AI systems and an outstanding array of realistically modelled weaponry in both single and multi-player modes. [Codemasters]… Expand"}, {"name": "Harry Potter and the Sorcerer's Stone", "details_link": "https://www.metacritic.com/game/game-boy-advance/harry-potter-and-the-sorcerers-stone", "publisher": "Electronic Arts", "release_date": "Nov 15 2001", "developers": ["Griptonite Games"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "genres": ["Action Adventure", "Fantasy"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/122ce36d25f4491728aa2d6f36acc16f-98.jpg", "descriptions": "Leave the nonmagical world behind and enroll in Hogwarts School of Witchcraft and Wizardry in Harry Potter and The Sorcerer's Stone.  As Harry Potter, you will hone your magical skills and advance through three terms of study during Harry's first year at Hogwarts.  Each term will challengeLeave the nonmagical world behind and enroll in Hogwarts School of Witchcraft and Wizardry in Harry Potter and The Sorcerer's Stone.  As Harry Potter, you will hone your magical skills and advance through three terms of study during Harry's first year at Hogwarts.  Each term will challenge you to meet a number of objectives, such as collecting and mixing potions with Professor Snape or piloting a flying broom through the Forbidden Forest in search of Neville Longbottom's Remembrall.  In order to pass the first year of study, players must complete over 29 different objectives, while avoiding enemies and obstacles.… Expand"}, {"name": "Sports Jam", "details_link": "https://www.metacritic.com/game/dreamcast/sports-jam", "publisher": "Agetec Inc.", "release_date": "Jul 18 2001", "developers": ["Wow Entertainment"], "platforms": "Dreamcast", "genres": ["Sports", "Alternative", "Other"], "meta_score": 64, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/345a880aeda8de40c9b5660fe703949f-98.jpg", "descriptions": "Foot ball, Baseball, Basketball, Hockey, Tennis, Soccer, Golf, and Cycling! You must master skills from each of these sports to take on competitors in your quest to earn the title of King of Sports! Each game features full 3D characters and background graphics detailing your accomplishmentsFoot ball, Baseball, Basketball, Hockey, Tennis, Soccer, Golf, and Cycling! You must master skills from each of these sports to take on competitors in your quest to earn the title of King of Sports! Each game features full 3D characters and background graphics detailing your accomplishments or defeats. Play well and you'll learn what it feels like to be a champion in the greatest sports the world has to offer!… Expand"}, {"name": "Flipnic: Ultimate Pinball", "details_link": "https://www.metacritic.com/game/playstation-2/flipnic-ultimate-pinball", "publisher": "Capcom", "release_date": "Jul 13 2005", "developers": ["SCEI"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Parlor", "Pinball"], "meta_score": 64, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/7d6f2eb5041ecc616570e5ce5b2dba54-98.jpg", "descriptions": "\"Flipnic is an enjoyable simple-action amazing pinball game for you.\" And UbiSoft's delightfully surreal game is just that, a wonderfully entertaining slice of ball-flipping action that anyone can enjoy. The first thing you'll notice when you get your mitts on Flipnic is just how huge the\"Flipnic is an enjoyable simple-action amazing pinball game for you.\" And UbiSoft's delightfully surreal game is just that, a wonderfully entertaining slice of ball-flipping action that anyone can enjoy. The first thing you'll notice when you get your mitts on Flipnic is just how huge the 'tables' are. Based on five different themes, including Jungle, Techno and Metal, these unique worlds contain stunning landscapes, complete with their own individual wildlife, flora and fauna. The first set of tables has a lush tropical look, with butterflies floating over the game as you frantically bash buttons in an attempt to achieve Flipnic's surreal objectives. The challenges include saving pink flamingos from the jaws of hungry crocodiles, destroying UFOs, and feeding hungry monkeys by knocking bananas into their waiting paws. And when you're not putting your mean pinballing skills to the test in single-player mode, you can also throw down the gauntlet to friends in multiplayer modes, with Pinball Soccer and Pinball Basketball available for two-player action. Possibly the most surreal addition to the genre, Flipnic sports beautifully vibrant graphics, intuitive controls, and some of the best ball physics you'll ever encounter in a pinball sim. [Playstation.com]… Expand"}, {"name": "NFL Head Coach", "details_link": "https://www.metacritic.com/game/pc/nfl-head-coach", "publisher": "EA Sports", "release_date": "Jun 19 2006", "developers": ["EA Tiburon"], "platforms": "PC", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Management", "Management", "Sim"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/14ed1525c3a59836f40c3bf739cb0d67-98.jpg", "descriptions": "NFL Head Coach reinvents football gaming by introducing the first 3D strategy sports game that challenges gamers to build and manage every aspect of a football team from the ground up. A simple conversation system and an engaging 3D graphical interface allow users to immerse themselves intoNFL Head Coach reinvents football gaming by introducing the first 3D strategy sports game that challenges gamers to build and manage every aspect of a football team from the ground up. A simple conversation system and an engaging 3D graphical interface allow users to immerse themselves into the lives of an NFL head coach. As head coach, you develop a team strategy, execute it on and off the field, and try to build a winning organization year after year. Your status as a coaching legend will rise and fall based on all of your actions as you strive to become the greatest head coach of all time. Behind the desk, on the practice field, or while wearing the headset on game days, take the reins of your favorite NFL team and lead it to victory. [Electronic Arts]… Expand"}, {"name": "3 on 3 NHL Arcade", "details_link": "https://www.metacritic.com/game/xbox-360/3-on-3-nhl-arcade", "publisher": "Electronic Arts", "release_date": "Feb 11 2009", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "6  Online", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Arcade", "Arcade"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/6c0f5ebce2426a436073040870446ca2-98.jpg", "descriptions": "[Xbox Live Arcade]  EA SPORTS Freestyle welcomes you to the fast-paced world of arcade hockey. From the same team that brought you NHL 09 comes 3 on 3 NHL Arcade, a 3-on-3 experience that throws conventional hockey, and its rules, out the window. Choose from the NHL's top players and bring[Xbox Live Arcade]  EA SPORTS Freestyle welcomes you to the fast-paced world of arcade hockey. From the same team that brought you NHL 09 comes 3 on 3 NHL Arcade, a 3-on-3 experience that throws conventional hockey, and its rules, out the window. Choose from the NHL's top players and bring them into this no-rules hockey game where big hits rule the day. Power-ups: When you see a giant skating down the ice, you'll realize this is not traditional hockey. With eight different power-ups, from speed skating to giant goalie, on-ice mayhem is the only guarantee. Online game modes: Play against a friend one-on-one online or with up to three players a side. With leaderboards and ranked/unranked match options, 3 on 3 NHL Arcade is an experience best shared. Button controls: 3 on 3 NHL Arcade features two separate control schemes, the Skill Stick featured in the past three NHL titles, and all-new button controls. With everything mapped to the face buttons, including all-new trick moves, players of all skill levels will be able to jump right into the action. Trick moves: The new control scheme introduces trick moves and spin moves to the world of NHL. Spin out of the way of an oncoming check before batting the puck out of the air and past a diving goalie. Unique presentation: Bright lights and big heads make their way to the NHL franchise. Featuring exaggerated player looks, and a miniature rink, the game boasts a unique and lighthearted tone throughout. Player types: 3 on 3 NHL Arcade splits 40 of the top NHL players, representing every team in the league, into three distinct player types. Fast players specialize in dangling, Strong players bring extra power to their hits, and All-around players play a solid two-way game of hockey. Hard checking: The all-new physics-based checking engine introduced in NHL 09 makes a return in 3 on 3 NHL Arcade with one slight difference, every hit is huge. Hit a guy just right and don't be surprised to see him fly across the length of the ice. [Electronic Arts]… Expand"}, {"name": "Star Trek: Legacy", "details_link": "https://www.metacritic.com/game/xbox-360/star-trek-legacy", "publisher": "Bethesda Softworks", "release_date": "Dec 12 2006", "developers": ["Mad Doc Software"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Simulation", "Sci-Fi", "Space", "Large Spaceship", "Large Spaceship", "Combat", "Civilian"], "meta_score": 64, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/a2fe6f01289571c7e7ecd0f51e7bf961-98.jpg", "descriptions": "Star Trek: Legacy places you in the role of the Admiral of a task force of warships, which you control in small and large-scale battles. Test your strategic and tactical skills in real-time combat featuring authentic spaceships, full damage modeling, and spectacular visual effects. TheStar Trek: Legacy places you in the role of the Admiral of a task force of warships, which you control in small and large-scale battles. Test your strategic and tactical skills in real-time combat featuring authentic spaceships, full damage modeling, and spectacular visual effects. The storyline spans the entire Star Trek Universe, including the Original Series, Next Generation, Deep Space Nine, Voyager, and Enterprise eras. Taking advantage of next-generation consoles, Star Trek: Legacy features dynamic three-dimensional battlefields with graphically stunning space environments filled with fully realized nebulas, wormholes, planets, and stars. With full multiplayer support, you can to choose from small-scale engagements to all-out war involving multiple star systems in addition to tracking stats and player rankings. [Bethesda Softworks]… Expand"}, {"name": "Tiny Brains", "details_link": "https://www.metacritic.com/game/playstation-4/tiny-brains", "publisher": "505 Games", "release_date": "Dec  3 2013", "developers": ["Spearhead Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "genres": ["Action", "Puzzle", "Miscellaneous", "Puzzle", "Action"], "meta_score": 64, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/f3cf45873fc01acce7fcbef320dbd786-98.jpg", "descriptions": "Tiny Brains is a 3D co-op action puzzle game in which up to four players can take the role of tiny (but superpowered!) lab animals. The game will be released on unannounced platforms later this year."}, {"name": "TNT Racers", "details_link": "https://www.metacritic.com/game/xbox-360/tnt-racers", "publisher": "DTP Entertainment", "release_date": "Feb  9 2011", "developers": ["Keen Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/a8ebc0877fd5d950ccf42dae55c142bf-98.jpg", "descriptions": "18 action-packed courses, up to 4 simultaneous players (online or offline), and winning requires much more than just being the best driver. The decisive factor is being the best racer - you must collect the pickups and cleverly use the powerful weapons to catapult your opponents off the track!"}, {"name": "Gotham Knights", "details_link": "https://www.metacritic.com/game/xbox-series-x/gotham-knights", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 21 2022", "developers": ["WB Games Montreal", "Warner Bros. Games Montreal"], "platforms": ["PC", "PlayStation 5", "Xbox Series X"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 64, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/2/5b05ecf4c4f6fcfef4dce797792664d4-98.jpg", "descriptions": "Batman is dead. It is now up to the Batman Family - Batgirl, Nightwing, Red Hood and Robin - to protect Gotham City, bring hope to its citizens, discipline to its cops, and fear to its criminals. You must evolve into the new Dark Knight and save Gotham from chaos. Your legacy begins now.Batman is dead. It is now up to the Batman Family - Batgirl, Nightwing, Red Hood and Robin - to protect Gotham City, bring hope to its citizens, discipline to its cops, and fear to its criminals. You must evolve into the new Dark Knight and save Gotham from chaos. Your legacy begins now. Step into the Knight. Gotham Knights is a brand-new open world, third-person action RPG featuring the Batman Family as players step into the roles of Batgirl, Nightwing, Red Hood and Robin, a new guard of trained DC Super Heroes who must rise up as the protectors of Gotham City in the wake of Batman's death. An expansive, criminal underworld has swept through the streets of Gotham, and it is now up to these new heroes to protect the city, bring hope to its citizens, discipline to its cops and fear to its criminals. Players must save Gotham from descent into chaos and reinvent themselves into their own version of the Dark Knight.… Expand"}, {"name": "PUSS!", "details_link": "https://www.metacritic.com/game/switch/puss!", "publisher": "Samustai", "release_date": "Feb 19 2021", "developers": ["teamCOIL"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 64, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/73e2732504d8a9e659379c69da6c6b29-98.jpg", "descriptions": "In PUSS! you have to get through mazes without touching walls to reach the exit portal. All the levels are randomly sequenced, so every run is different. The game’s visuals are based on different elements of modern art: glitch art, surrealism, psychedelic art, web punk, vaporwave, naive art, etc."}, {"name": "The Simpsons Game", "details_link": "https://www.metacritic.com/game/wii/the-simpsons-game", "publisher": "EA Games", "release_date": "Oct 30 2007", "developers": ["Electronic Arts", "Rebellion"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/159eda2db9bf5df94b710c37111e9b05-98.jpg", "descriptions": "The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart,The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart, and Lisa use exciting, all-new powers to save the world from rising chaos. To help the Simpsons, gamers at home must journey through all of Springfield (as well as vast worlds beyond!), vanquish an amazing array of villains, and fight their way through parodies of popular games. [Electronic Arts]… Expand"}, {"name": "The Caligula Effect: Overdose", "details_link": "https://www.metacritic.com/game/playstation-4/the-caligula-effect-overdose", "publisher": "NIS America", "release_date": "Mar 12 2019", "developers": ["Aquria", "historia Inc"], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/34f23d69e89c46b4f6bbeeb0f67fc721-98.jpg", "descriptions": "An idyllic world that exists for the sake of letting people forget about the pain and problems of reality. In this world created by a sentient vocal program, μ (Mu), reality and fantasy has become blurred, allowing people to relive their high school years in bliss. Yet in this seeminglyAn idyllic world that exists for the sake of letting people forget about the pain and problems of reality. In this world created by a sentient vocal program, μ (Mu), reality and fantasy has become blurred, allowing people to relive their high school years in bliss. Yet in this seemingly beautiful and perfect world, something is amiss. Escape from this false paradise with your fellow students and return to reality in The Caligula Effect: Overdose!… Expand"}, {"name": "P-O-L-L-E-N", "details_link": "https://www.metacritic.com/game/pc/p-o-l-l-e-n", "publisher": "Mindfield Games", "release_date": "Apr 19 2016", "developers": ["Mindfield Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 64, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/4/889f5f8dcb8cd0a8562d03629c4ec3f3-98.jpg", "descriptions": "P-O-L-L-E-N is an atmospheric, suspenseful and highly interactive first person sci-fi exploration game set on Saturn's moon Titan. Delve into the richly detailed Station M, and try everything you can get your hands on to uncover the mysteries that lie beneath the moon’s crust."}]