[{"name": "Xenosaga Episode II: Jenseits von Gut und Bose", "details_link": "https://www.metacritic.com/game/playstation-2/xenosaga-episode-ii-jenseits-von-gut-und-bose", "publisher": "Namco", "release_date": "Feb 15 2005", "developers": ["Monolith Soft"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/845dfac6cbfcb05b2c3ef368c34f6fc4-98.jpg", "descriptions": "Four-thousand years into a war-torn future. Earth has been abandoned and mankind forges its existence in deep space, locked in eternal confrontation with the malevolent, alien Gnosis. With sophisticated weapons and robotics technology, humankind wages an epic battle for survival. In aFour-thousand years into a war-torn future. Earth has been abandoned and mankind forges its existence in deep space, locked in eternal confrontation with the malevolent, alien Gnosis. With sophisticated weapons and robotics technology, humankind wages an epic battle for survival. In a desperate bid to fend off extinction, the search continues for the Zohar, a legendary artifact rumored to be capable of eradicating the Gnosis and ushering in an era of universal peace. Rejoin Shion, KOS-MOS and their companions in the enthralling 2nd chapeter of this landmark multipart RPG saga. [Namco]… Expand"}, {"name": "Blitzkrieg: Rolling Thunder", "details_link": "https://www.metacritic.com/game/pc/blitzkrieg-rolling-thunder", "publisher": "cdv Software", "release_date": "Nov 30 2004", "developers": ["La Plata"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic", "Tactics"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/ded2b71800a025c221b9730ff5a74470-98.jpg", "descriptions": "Get involved!  Epic 18 mission campaign with the American legend General Patton. Follow Patton from the landing in Casablanca through seven countries: Fight for Northern Africa, Operation Husky (battle for Sicily 1943), breakout from the Normandy bridgehead (Operation Cobra), the RaceGet involved!  Epic 18 mission campaign with the American legend General Patton. Follow Patton from the landing in Casablanca through seven countries: Fight for Northern Africa, Operation Husky (battle for Sicily 1943), breakout from the Normandy bridgehead (Operation Cobra), the Race through France, Battle of the Bulge, Rhine crossing near Oppenheim, Commando Hammelburg (Patton's attempt to free his son-in-law from German imprisonment) and the capture of a secret underground weapon factory in Pilsen. [CDV]… Expand"}, {"name": "Pokemon Brilliant Diamond", "details_link": "https://www.metacritic.com/game/switch/pokemon-brilliant-diamond", "publisher": "Nintendo", "release_date": "Nov 19 2021", "developers": ["ILCA", "Inc."], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 73, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/2/49194b13817e436865e84fafa6ffd845-98.jpg", "descriptions": "The adventure through the Sinnoh region has been reborn. Experience the nostalgic story from the Pokémon Diamond and Pokémon Pearl games in an adventure reborn on the Nintendo Switch system. Adventures in the Pokémon Brilliant Diamond and Pokémon Shining Pearl games will take place in theThe adventure through the Sinnoh region has been reborn. Experience the nostalgic story from the Pokémon Diamond and Pokémon Pearl games in an adventure reborn on the Nintendo Switch system. Adventures in the Pokémon Brilliant Diamond and Pokémon Shining Pearl games will take place in the Sinnoh region. Rich in nature and with Mount Coronet towering at its heart, Sinnoh is a land of many myths passed down through the ages. You'll visit many different locations in the Sinnoh region, while striving to become the Champion of the Pokémon League. The original story has been faithfully reproduced, and the sense of scale in the originals' towns and routes has been carefully preserved. People who played Pokémon Diamond and Pokémon Pearl can revisit familiar places and relive familiar scenes once more. For those setting out through Sinnoh for the first time, plenty of new encounters and surprises await.\r These remakes include easy-to-understand, player-friendly conveniences of the modern Pokémon series, plus up-close-and-personal Pokémon battle scenes.\r Whether you played Pokémon Diamond or Pokémon Pearl back in the day or you're encountering these games for the first time, there's something for everyone to enjoy.\r You'll choose Turtwig, Chimchar, or Piplup to be your first partner Pokémon and then set off on your journey.\r Turtwig\rCategory: Tiny Leaf Pokémon\rType: Grass\rHeight: 1'4\"\rWeight: 22.5 lbs.\rAbility: Overgrow\r Made from soil, the shell on its back hardens when it drinks water. It lives along lakes. It undertakes photosynthesis within its body, making oxygen. The leaf on its head wilts if the Pokémon is thirsty. \r\rChimchar\rCategory: Chimp Pokémon\rType: Fire\rHeight: 1'8\"\rWeight: 13.7 lbs.\rAbility: Blaze\r It agilely scales sheer cliffs to live atop craggy mountains. Its fire is put out when it sleeps. Its fiery rear end is fueled by gas made in its belly. Even rain can't extinguish the fire. \r\rPiplup\rCategory: Penguin Pokémon\rType: Water\rHeight: 1'4\"\rWeight: 11.5 lbs.\rAbility: Torrent\r Because it is very proud, it hates accepting food from people. Its thick down guards it from cold. It lives along the shore in northern countries. A skilled swimmer, it dives for over 10 minutes while hunting. \r\rAlong the way, you'll be able to encounter the Legendary Pokémon Dialga in Pokémon Brilliant Diamond or Palkia in Pokémon Shining Pearl. \r\rDialga\rCategory: Temporal Pokémon\rType: Steel/Dragon\rHeight: 17'9\"\rWeight: 1505.8 lbs.\rAbility: Pressure\r It has the power to control time. It appears in Sinnoh-region myths as an ancient deity. This Pokémon is spoken of in legend. It is said that time began moving when Dialga was born. \r\rPalkia\rCategory: Spatial Pokémon\rType: Water/Dragon\rHeight: 13'9\"\rWeight: 740.8 lbs.\rAbility: Pressure\r It has the ability to distort space. It is described as a deity in Sinnoh-region mythology. It is said to live in a gap in the spatial dimension parallel to ours. Palkia appears in mythology.… Expand"}, {"name": "Dreamfall: The Longest Journey", "details_link": "https://www.metacritic.com/game/xbox/dreamfall-the-longest-journey", "publisher": "Aspyr", "release_date": "Apr 18 2006", "developers": ["Funcom"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Fantasy"], "meta_score": 73, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/feb5e5003090f06b1cb962801f1c21eb-98.jpg", "descriptions": "Dreamfall continues the story of \"The Longest Journey,\" one of the most critically acclaimed adventure games ever made, and brings adventure gaming into a new era. Focusing on story and characters, Dreamfall features unparalleled 3D visuals, advanced character animations, stunningDreamfall continues the story of \"The Longest Journey,\" one of the most critically acclaimed adventure games ever made, and brings adventure gaming into a new era. Focusing on story and characters, Dreamfall features unparalleled 3D visuals, advanced character animations, stunning audio, and innovative gameplay - wrapped in a unique and magical ambience. Dreamfall is set in the 23rd Century, where a young woman accidentally uncovers a conspiracy related to dreams; a conspiracy that may herald the destruction of the twin worlds of science and magic. Confronted by mysteries that she cannot resolve on her own, she must seek assistance from the one person who might have the answers: April Ryan, the heroine of \"The Longest Journey.\"… Expand"}, {"name": "Men of Valor", "details_link": "https://www.metacritic.com/game/xbox/men-of-valor", "publisher": "VU Games", "release_date": "Oct 19 2004", "developers": ["2015"], "platforms": "Xbox", "num_players": "1-12 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/b9607a154abff0bb4a3dc9a0fefdcbae-98.jpg", "descriptions": "Men of Valor follows an American marine through the early stages of the conflict in Vietnam to the Tet Offensive. In historically accurate scenarios, you must play a variety of roles in which you'll man the door gun on a Huey helicopter, steer a riverboat along enemy-infested shores, battleMen of Valor follows an American marine through the early stages of the conflict in Vietnam to the Tet Offensive. In historically accurate scenarios, you must play a variety of roles in which you'll man the door gun on a Huey helicopter, steer a riverboat along enemy-infested shores, battle your way through enemy tunnel complexes, and call down fire as a forward observer. Mission types include pilot rescues, recon patrols, POW rescue, and search-and-destroy ops.… Expand"}, {"name": "Animal Crossing: City Folk", "details_link": "https://www.metacritic.com/game/wii/animal-crossing-city-folk", "publisher": "Nintendo", "release_date": "Nov 16 2008", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "Up to 4 ", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/a43260682646c0851b7a44b67ca17ca6-98.jpg", "descriptions": "(Also known as \"Animal Crossing: Let's Go To The City\")  If life were an endless vacation, what would you do? Go fishing, collect shells or watch fireworks with friends? Build a snowman, exchange presents with family or decorate your house for the holidays? Take a trip to the city, go on a(Also known as \"Animal Crossing: Let's Go To The City\")  If life were an endless vacation, what would you do? Go fishing, collect shells or watch fireworks with friends? Build a snowman, exchange presents with family or decorate your house for the holidays? Take a trip to the city, go on a shopping spree or visit friends from all over the globe? In Animal Crossing: City Folk, life moves at a relaxed pace, but the world brims with endless possibilities. There's always something new to do. In the living, breathing world of Animal Crossing: City Folk, days and seasons pass in real time, so there’s always something to discover. Catch fireflies in the summer, go trick-or-treating on Halloween or hunt for eggs on Bunny Day. If you're in the mood for something a little faster paced, take a bus to a new urban city area that’s unique to Animal Crossing: City Folk. There you can catch a show at the theater or check out the sales at Gracie's boutique. But if you don't show your face back home for too long, your neighbors will miss you. Up to four people from your household can live and work together to build the perfect town. Design clothes and patterns, write letters and post messages on the bulletin board for each other, or invite up to three friends to visit your town using Nintendo Wi-Fi Connection. With the new WiiSpeak microphone, it's like you’re all in the same room. The microphone sits atop the sensor bar and picks up the conversation of everyone in the room to encourage a more inclusive experience. [Nintendo]… Expand"}, {"name": "Breakers Collection", "details_link": "https://www.metacritic.com/game/playstation-5/breakers-collection", "publisher": "QUByte Interactive", "release_date": "Jan 12 2023", "developers": ["QUByte Interactive"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/e7dc27780b6ccdede491ef356555f440-98.jpg", "descriptions": "Breakers Collection features both of the original games (Breakers and Breakers Revenge) and a brand new content for the cult-classic among the fans of Fighting Games, that was first released in 1996 for the Neogeo and Arcades and after released with a sequel in 1998 with additional playableBreakers Collection features both of the original games (Breakers and Breakers Revenge) and a brand new content for the cult-classic among the fans of Fighting Games, that was first released in 1996 for the Neogeo and Arcades and after released with a sequel in 1998 with additional playable characters, balance adjustments and new gameplay elements.\r Breakers Collection is a simple action-fighting game, with a rooster with many playable characters (10 in Breakers Revenge), that were all known by the fans from around the world.\r The collection version, the player will have more features and modes, like online versus mode - Rollback Netcode (GGPO) -, Art gallery and the most requested one, the training mode.… Expand"}, {"name": "A Little To The Left", "details_link": "https://www.metacritic.com/game/switch/a-little-to-the-left", "publisher": "Secret Mode", "release_date": "Nov  9 2022", "developers": ["Max Inferno"], "platforms": ["PC", "Switch"], "genres": ["Action", "Puzzle", "General"], "meta_score": 73, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/5dbe24fe720a6b7da8319bde25937f8e-98.jpg", "descriptions": "Sort, stack, and organize household objects into just the right spot in A Little to the Left, a tidy puzzle game with a mischievous cat who likes to shake things up!Which way should the clock hands point? How to arrange the eggs? Who put so many stickers on this fruit?!? Come enjoy aSort, stack, and organize household objects into just the right spot in A Little to the Left, a tidy puzzle game with a mischievous cat who likes to shake things up!Which way should the clock hands point? How to arrange the eggs? Who put so many stickers on this fruit?!? Come enjoy a calming world with an observational puzzle game with surprises around every corner. With charming illustrations and surprising scenarios, A Little to the Left is satisfying and curious with 75+ delightful puzzles to discover.Keep your eye out for a mischievous cat who has an inclination for chaos!… Expand"}, {"name": "Isonzo", "details_link": "https://www.metacritic.com/game/pc/isonzo", "publisher": "M2H", "release_date": "Sep 13 2022", "developers": ["M2H", "M2H & BlackMill Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/82d18ec8e2e7b442699f46250ba3d5b5-98.jpg", "descriptions": "Ferocious Alpine warfare will test your tactical skills in this authentic WW1 FPS. Battle among the scenic peaks, rugged valleys and idyllic towns of northern Italy. The Great War on the Italian Front is brought to life and elevated to unexpected heights!"}, {"name": "Outriders Worldslayer", "details_link": "https://www.metacritic.com/game/pc/outriders-worldslayer", "publisher": "Square Enix", "release_date": "Jun 30 2022", "developers": ["People Can Fly"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/1/4b77c8fb263fd88ec79de959cff59ffc-98.jpg", "descriptions": "OUTRIDERS is a story driven RPG-Shooter that will put the player in the shoes of an Outrider, the last hope of the human race trapped on Enoch, a dangerous and untamed planet. The campaign can be played entirely in single player, or in co-op with up to three players. Outriders Worldslayer isOUTRIDERS is a story driven RPG-Shooter that will put the player in the shoes of an Outrider, the last hope of the human race trapped on Enoch, a dangerous and untamed planet. The campaign can be played entirely in single player, or in co-op with up to three players. Outriders Worldslayer is a new expansion that takes place directly after the events of the main campaign. In it, you and up to 2 other players must travel to the far reaches of Enoch to battle a new threat known as Ereshkigal, a dark overlord, and the main villain of the expansion.… Expand"}, {"name": "Sonic Origins", "details_link": "https://www.metacritic.com/game/pc/sonic-origins", "publisher": "Sega", "release_date": "Jun 23 2022", "developers": ["Sega"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/6d35a226a716e6c26f3a349883158a27-98.jpg", "descriptions": "Relive the classic collected adventures of Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic 3 & Knuckles, and Sonic CD in the newly remastered Sonic Origins! From the iconic Green Hill Zone to the treacherous Death Egg Robot, you'll speed down memory lane to thwart the sinister plans ofRelive the classic collected adventures of Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic 3 & Knuckles, and Sonic CD in the newly remastered Sonic Origins! From the iconic Green Hill Zone to the treacherous Death Egg Robot, you'll speed down memory lane to thwart the sinister plans of Doctor Robotnik in polished high definition! This latest version includes new areas to explore, additional animations, and a brand new Anniversary mode! Explore the classic Sonic titles in high-resolution, with all-new opening and ending animations for each title! New Unlockables: Complete various missions to collect coins to unlock new content, challenges, and Special Stages through the Museum. Classic and Anniversary Mode. Choose to Spin Dash your way through the numerous zones in Classic mode with the game's original resolution and limited lives, or the new Anniversary mode with unlimited lives and revamped fullscreen resolution.… Expand"}, {"name": "Dark Deity", "details_link": "https://www.metacritic.com/game/switch/dark-deity", "publisher": "Freedom Games", "release_date": "Mar 17 2022", "developers": ["Sword & Axe LLC"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/dc90abc1f84b0bd60bb60566cae851f9-98.jpg", "descriptions": "Command legendary heroes to reshape a land fractured by broken oaths, reckless wars, and secret arcane powers. The technological and cultural achievements of a once-great civilization now lie locked inside the ruins of ancient temples throughout the world of Terrazael. Long after society'sCommand legendary heroes to reshape a land fractured by broken oaths, reckless wars, and secret arcane powers. The technological and cultural achievements of a once-great civilization now lie locked inside the ruins of ancient temples throughout the world of Terrazael. Long after society's mighty history is snuffed out by a powerful and mysterious \"Calamity\", the people of Etlan teeter on the brink of total war.In a desperate attempt to bolster his recruit ranks, King Varic of the Kingdom of Delia expedites the graduation of all students at the Brookstead Military Academy, severing a pact that has stood for a thousand years. With the course of their future undemocratically derailed, these four \"graduates\" of the Brookstead Academy set out to leave their mark on this world.This is their story.… Expand"}, {"name": "Aspire: Ina's Tale", "details_link": "https://www.metacritic.com/game/xbox-one/aspire-inas-tale", "publisher": "Untold Tales", "release_date": "Dec 17 2021", "developers": ["Wondernaut Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/8732ae60d51c252a899821f4157de2b1-98.jpg", "descriptions": "Ina was trapped, placed in perpetual slumber inside the Tower – where she dreamed. Suddenly and unknowingly, she is woken. Ina must now explore the Tower’s inner chambers in search of a way out and a reason for her imprisonment.\r Along the way, she’ll traverse marvelous scenery, meetIna was trapped, placed in perpetual slumber inside the Tower – where she dreamed. Suddenly and unknowingly, she is woken. Ina must now explore the Tower’s inner chambers in search of a way out and a reason for her imprisonment.\r Along the way, she’ll traverse marvelous scenery, meet enigmatic characters, solve intuitive puzzles, and conquer platforming sequences as she comes closer to her goal - but farther from innocence.\r For this isn't a story about how Ina was saved. This is the story about how she discovered she could be so much more.… Expand"}, {"name": "MXGP 2021 - The Official Motocross Videogame", "details_link": "https://www.metacritic.com/game/playstation-5/mxgp-2021---the-official-motocross-videogame", "publisher": "Milestone S.r.l", "release_date": "Nov 30 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 16 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 73, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/4/13d7a145ea8509e471f1e23e1fd13122-98.jpg", "descriptions": "All the tracks, all the riders, all the official bikes to fully experience the true emotions of this season. All of them, from the last corner to the first position. Your race to become number 1 is even more realistic and exciting. A renovated career path where your every decision will beAll the tracks, all the riders, all the official bikes to fully experience the true emotions of this season. All of them, from the last corner to the first position. Your race to become number 1 is even more realistic and exciting. A renovated career path where your every decision will be crucial. Relive the emotions of Ottobiano, Ernée, Leon and Agueda: 4 of the most celebrated tracks of past editions. History is ready to be rewritten… and become legend.… Expand"}, {"name": "John Wick Hex", "details_link": "https://www.metacritic.com/game/switch/john-wick-hex", "publisher": "Good Shepherd Entertainment", "release_date": "Dec  4 2020", "developers": ["Mike Bithell"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/a39d5d4f2b3a6fc4ff02cd9b7e211d34-98.jpg", "descriptions": "Become The Baba Yaga. John Wick Hex is a fast-paced, action-oriented strategy game that makes you think and strike like John Wick, the professional hitman of the critically acclaimed film franchise. Created in close cooperation with the creative teams behind the films, John Wick Hex isBecome The Baba Yaga. John Wick Hex is a fast-paced, action-oriented strategy game that makes you think and strike like John Wick, the professional hitman of the critically acclaimed film franchise. Created in close cooperation with the creative teams behind the films, John Wick Hex is fight-choreographed chess brought to life as a video game, capturing the series’ signature gun fu style while expanding its story universe. Players must make quick decisions and choose every action and attack they make, all the while considering their immediate cost and consequences. Featuring a unique blend of strategic time-based action, John Wick Hex captures the feel of the tactical combat from the films and blurs the line between the strategy and action video game genres. Perform well and progress in the main story mode to unlock new weapons, suit options and locations. Each weapon changes up the tactics you’ll use and the manner in which you’ll play. Ammo is finite and realistically simulated, so time your reloads and make the most of weapons you scavenge on the job. Experience an original new story set prior to the events of the films which sees John on a desperate mission to rescue Winston and Charon from a dangerous new adversary seeking his birthright. This story is brought to life by the world class voice talents of Ian McShane and Lance Reddick, reprising their iconic roles from the films, and voice acting legend Troy Baker, joining the stellar cast as the game's eponymous villain 'Hex'. John Wick Hex compliments the style of the films with a unique graphic noir art design and an original score by renowned composer Austin Wintory.… Expand"}, {"name": "Moero Crystal H", "details_link": "https://www.metacritic.com/game/switch/moero-crystal-h", "publisher": "EastAsiaSoft", "release_date": "Sep 17 2020", "developers": ["Idea Factory"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/d8bb8d77204bd621f76b82ee108996c9-98.jpg", "descriptions": "Assume the role of “Lucky Pervert” Zenox as he embarks on a mission to retrieve the Bra of Darkness from a mysterious thief who’s corrupting monster girls throughout the land. In this enhanced “Hyper” version of first-person dungeon RPG Moero Crystal, encounter and recruit more than 80Assume the role of “Lucky Pervert” Zenox as he embarks on a mission to retrieve the Bra of Darkness from a mysterious thief who’s corrupting monster girls throughout the land. In this enhanced “Hyper” version of first-person dungeon RPG Moero Crystal, encounter and recruit more than 80 monster girls, including all previous DLC characters, in remastered HD presentation and subtitled in English for the first time! Free the monster girls from the darkness afflicting them and win their affection through “Loving Scratch” mode. This time, “Double Scratch” can even be performed with two monster girls simultaneously.\r… Expand"}, {"name": "Sparklite", "details_link": "https://www.metacritic.com/game/xbox-one/sparklite", "publisher": "Merge Games", "release_date": "Nov 15 2019", "developers": ["Red Blue Games", "LLC", "Red Blue Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/3b0b80490908be697333623f16230948-98.jpg", "descriptions": "Sparklite is an action-adventure set in the whimsical and ever-changing land of Geodia. Battle foes in top-down action using an arsenal of gadgets, guns, and gear. Explore dangerous corners of the procedurally generated world, take down titans of the mining industry, and harness the power ofSparklite is an action-adventure set in the whimsical and ever-changing land of Geodia. Battle foes in top-down action using an arsenal of gadgets, guns, and gear. Explore dangerous corners of the procedurally generated world, take down titans of the mining industry, and harness the power of Sparklite.… Expand"}, {"name": "NBA 2K20", "details_link": "https://www.metacritic.com/game/switch/nba-2k20", "publisher": "2K Games", "release_date": "Sep  6 2019", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 73, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/4/c974f06a3e90111df4a53259c638671e-98.jpg", "descriptions": "From the blacktop to the hardwood and throughout the Neighborhood, NBA 2K20 and its next level features are the closest thing to actually playing in the league. Welcome to the Next. Put your career on the line to stand up for what you believe in. Executive produced by LeBron James &From the blacktop to the hardwood and throughout the Neighborhood, NBA 2K20 and its next level features are the closest thing to actually playing in the league. Welcome to the Next. Put your career on the line to stand up for what you believe in. Executive produced by LeBron James & SpringHill Entertainment, this year’s MyCAREER experience features topical storylines, true-to-life basketball characters, and a star-studded cast. [Take 2 Interactive]… Expand"}, {"name": "Team Sonic Racing", "details_link": "https://www.metacritic.com/game/xbox-one/team-sonic-racing", "publisher": "Sega", "release_date": "May 21 2019", "developers": ["Sumo Digital"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/e7647b1f7239c3a965021510a5e00d66-98.jpg", "descriptions": "Team Sonic Racing combines the best elements of arcade and fast and fast-paced competitive style racing as you face-off with friends in off with friends in intense multiplayer racing. Race together and work as a team by sharing power-ups and speed boosts. Take control of your racing style --Team Sonic Racing combines the best elements of arcade and fast and fast-paced competitive style racing as you face-off with friends in off with friends in intense multiplayer racing. Race together and work as a team by sharing power-ups and speed boosts. Take control of your racing style -- Choose from 3 distinct character types and unlock game changing vehicle customisation options to suit your racing style. Speed up. Gear Up -- Team Racing at Sonic Speed!… Expand"}, {"name": "Sniper Elite V2 Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/sniper-elite-v2-remastered", "publisher": "Rebellion", "release_date": "May 14 2019", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/588e01bc48e19527c1083eb3afef265b-98.jpg", "descriptions": "You are elite sniper Karl Fairburne, parachuted into Berlin amidst the Germans' final stand. Your mission is to prevent Nazi V2 rocket technology falling into the hands of the Red Army. You must aid key scientists keen to defect to the US, and terminate those who stand in your way.StealthYou are elite sniper Karl Fairburne, parachuted into Berlin amidst the Germans' final stand. Your mission is to prevent Nazi V2 rocket technology falling into the hands of the Red Army. You must aid key scientists keen to defect to the US, and terminate those who stand in your way.Stealth is key as you find yourself trapped between two desperate armies in a race against time. Master authentic weaponry, stalk your target, fortify your position, set up the shot, and use your skill, patience and cunning to achieve the mission.All new graphics and rendering technology gives you improved ball busting X-ray kill camera detail. Witness the terrifying power of your bullet as it enters an enemy's body.With all DLC missions included, take the fate of the war into your own hands, and hunt the Fuhrer himself.… Expand"}, {"name": "Vaporum", "details_link": "https://www.metacritic.com/game/playstation-4/vaporum", "publisher": "Fatbot Games", "release_date": "Apr  9 2019", "developers": ["Fatbot Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/6/0cd710cbfb5210aa6701c69f2ff1a2ab-98.jpg", "descriptions": "Vaporum is a grid-based dungeon crawler RPG in an original steampunk setting, inspired by old-school classics of the genre. Stranded in the middle of an ocean, in front of a gigantic tower, the hero has to find out what the place is, what happened there, and most importantly, who he is."}, {"name": "Dead or Alive 6", "details_link": "https://www.metacritic.com/game/pc/dead-or-alive-6", "publisher": "Team Ninja", "release_date": "Mar  1 2019", "developers": ["Team Ninja", "Koei Tecmo Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 73, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/71f0ca52c161d1e7e9702573136ef179-98.jpg", "descriptions": "DEAD OR ALIVE 6 is a fast-paced 3D fighting game, produced by Koei Tecmo Games, featuring graphics and multi-tiered stages that create a truly entertaining competitive experience. The story follows the events of DEAD OR ALIVE 5, focusing on 2 separate main narratives; namely, the battleDEAD OR ALIVE 6 is a fast-paced 3D fighting game, produced by Koei Tecmo Games, featuring graphics and multi-tiered stages that create a truly entertaining competitive experience. The story follows the events of DEAD OR ALIVE 5, focusing on 2 separate main narratives; namely, the battle between “Ninja and DOATEC” versus “M.I.S.T. lead by Donovan”, and the events that occur during the 6th DEAD OR ALIVE Tournament. New side story episodes will also be added for returning characters. Following the tradition, fights in DEAD OR ALIVE 6 are based on a triangle system: strikes beat throws, throws beat holds, and holds beat strikes. Landing a well-timed attack of the type that beats your opponent’s attack, like landing a strike when an opponent tries to throw, will result in a Hi Counter attack and do more damage.… Expand"}, {"name": "Cinders", "details_link": "https://www.metacritic.com/game/switch/cinders", "publisher": "Crunching Koalas", "release_date": "Feb 14 2019", "developers": ["Crunching Koalas"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/47a8ea76b67cb05fe9a89ad1c37e7ef8-98.jpg", "descriptions": "Cinders is our latest project, and one were putting lots of hope into. It is our take on a classic fairytale in a genre that we havent tried before. The game is going to be an atmospheric Visual Novel of quality thats not frequently seen in the genre. We want the players to enjoy theCinders is our latest project, and one were putting lots of hope into. It is our take on a classic fairytale in a genre that we havent tried before. The game is going to be an atmospheric Visual Novel of quality thats not frequently seen in the genre. We want the players to enjoy the beautiful world of animated illustrations by Gracjana Zielinska, and offer choices that will make them question the somehow naive and banal morals of the classic story. The game is under steady development and should be released around Summer 2011 for Windows and Mac OS X.… Expand"}, {"name": "Runner3", "details_link": "https://www.metacritic.com/game/switch/runner3", "publisher": "Nicalis", "release_date": "May 22 2018", "developers": ["Choice Provisions"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Platformer", "2D"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/49d8aa4e9a12fa0547bf776bbba97b25-98.jpg", "descriptions": "The rhythm-music gameplay of BIT.TRIP RUNNER and Runner2 is back. The Timbletot is determined to rid the multiverse of all its love and happiness. CommanderVideo, a lover if ever there were one, refuses to let this happen. He's ready to jump, double-jump, wall-jump, slide-jump, slide, kick,The rhythm-music gameplay of BIT.TRIP RUNNER and Runner2 is back. The Timbletot is determined to rid the multiverse of all its love and happiness. CommanderVideo, a lover if ever there were one, refuses to let this happen. He's ready to jump, double-jump, wall-jump, slide-jump, slide, kick, float, drive, fly, and dance his way to victory, all across a medley of thrilling, challenging, and joyous levels.… Expand"}, {"name": "World to the West", "details_link": "https://www.metacritic.com/game/switch/world-to-the-west", "publisher": "Rain Games", "release_date": "Jan 18 2018", "developers": ["Rain Games"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/ea14809f8526d9a0d543030330094e6d-98.jpg", "descriptions": "World to the West is an action puzzler developed by Rain Games that continues exploring the universe of Teslagrad, already started by over 1.6 million people. Play as four charactersLumina the Teslamancer, Knaus the orphan, Miss Teri the mind bender and the gloriously mustachioed strongman,World to the West is an action puzzler developed by Rain Games that continues exploring the universe of Teslagrad, already started by over 1.6 million people. Play as four charactersLumina the Teslamancer, Knaus the orphan, Miss Teri the mind bender and the gloriously mustachioed strongman, Lord Clonington, each hailing from individual nations and possessing unique identities and abilities. Explore untamed jungles, frozen tundras and the mysteries of an ancient prophecy. Be careful though. Nothing is ever what it seems. Will you join us in this journey to the West?\r Key Gameplay Features\r -Seamless transitions between combat and puzzle solving\r-Face your enemies head-on with brute force, avoid or convince them\r-A vibrant world enriched with tons of non-playable characters and a deep lore\r Platform Exclusive Features\r -Have the map display on the gamepad, and update your position in the world as you play.\r-Play the game in offscreen mode, and play it on the tablet screen exclusively.… Expand"}, {"name": "Mages of Mystralia", "details_link": "https://www.metacritic.com/game/playstation-4/mages-of-mystralia", "publisher": "Limited Run Games", "release_date": "Aug 22 2017", "developers": ["Borealys Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General", "Linear"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/dfbae6b0a943c0af290ddc949d37fff4-98.jpg", "descriptions": "Accompany Zia as she strikes off to train and learn to control her magical abilities that had her exiled. Journey across the lands to meet other exiled mages and uncover runes with magical properties that can be combined into millions of different possibilities, letting you come up withAccompany Zia as she strikes off to train and learn to control her magical abilities that had her exiled. Journey across the lands to meet other exiled mages and uncover runes with magical properties that can be combined into millions of different possibilities, letting you come up with completely new and incredible spells!… Expand"}, {"name": "Dragon Ball: Xenoverse 2", "details_link": "https://www.metacritic.com/game/xbox-one/dragon-ball-xenoverse-2", "publisher": "Bandai Namco Games", "release_date": "Oct 25 2016", "developers": ["Dimps Corporation"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/93daaa4418adcd288184f4d10790fc31-98.jpg", "descriptions": "DRAGON BALL XENOVERSE 2 builds upon the DRAGON BALL XENOVERSE with enhanced graphics that will further immerse players into the largest and most detailed Dragon Ball world ever developed.\r DRAGON BALL XENOVERSE 2 delivers a new hub city and the most character customization choices to dateDRAGON BALL XENOVERSE 2 builds upon the DRAGON BALL XENOVERSE with enhanced graphics that will further immerse players into the largest and most detailed Dragon Ball world ever developed.\r DRAGON BALL XENOVERSE 2 delivers a new hub city and the most character customization choices to date among a multitude of new features and special upgrades.\r *    Relive the Dragon Ball story by time traveling and protecting historic moments in the Dragon Ball universe\r*    Brand new hub city more than 7X the size of the original game with 300 players online at the same time\r*    Next-gen visuals bring the Dragon Ball anime experience to life\r*    New characters and boss fights\r*    More in depth character creation system and battle adjustments\r*    Free updates and post launch support for more than a year… Expand"}, {"name": "RIVE", "details_link": "https://www.metacritic.com/game/pc/rive", "publisher": "Two Tribes", "release_date": "Sep 13 2016", "developers": ["Two Tribes"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/280416f3bd429caa413af9028e4ffce8-98.jpg", "descriptions": "RIVE’s unique 360-degree shooter/platformer hybrid lets you choreograph a ‘dance of destruction’. It feels like the explosive games of yore, pumping megapixels like it’s 2016."}, {"name": "Dragon Quest Heroes: The World Tree's Woe and the Blight Below", "details_link": "https://www.metacritic.com/game/pc/dragon-quest-heroes-the-world-trees-woe-and-the-blight-below", "publisher": "Square Enix", "release_date": "Dec  3 2015", "developers": ["Koei Tecmo Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/c7f4db6e4f1325b3e0cea54e2e91c446-98.jpg", "descriptions": "In DRAGON QUEST HEROES, players must rise up against insurmountable odds, challenging swarms of enemies and conquering gigantic monsters. DRAGON QUEST HEROES comes to the PlayStation 4 system in beautiful high-definition graphics, filled with characters and monsters designed byIn DRAGON QUEST HEROES, players must rise up against insurmountable odds, challenging swarms of enemies and conquering gigantic monsters. DRAGON QUEST HEROES comes to the PlayStation 4 system in beautiful high-definition graphics, filled with characters and monsters designed by world-renowned artist Akira Toriyama.… Expand"}, {"name": "Minecraft: Story Mode - Episode 3: The Last Place You Look", "details_link": "https://www.metacritic.com/game/playstation-4/minecraft-story-mode---episode-3-the-last-place-you-look", "publisher": "Telltale Games", "release_date": "Nov 24 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Adventure", "General", "Point-and-Click", "Linear"], "meta_score": 73, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/bcc85fe0e91874d8add51b06d7338974-98.jpg", "descriptions": "Minecraft: Story Mode is like a playable TV show based on the game, where YOU are the star, and your choices and actions decide how the story is told. You are Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your gang stumbles onMinecraft: Story Mode is like a playable TV show based on the game, where YOU are the star, and your choices and actions decide how the story is told. You are Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your gang stumbles on something dreadful. Terror is unleashed, and your only hope is to track down the “Order of the Stone”, a fabled group of adventurers who slew the legendary Ender Dragon. But where are they? In a race against time, you will travel across the over-world, through the Nether, to The End, and beyond. … Expand"}, {"name": "Minecraft: Story Mode - Episode 3: The Last Place You Look", "details_link": "https://www.metacritic.com/game/pc/minecraft-story-mode---episode-3-the-last-place-you-look", "publisher": "Telltale Games", "release_date": "Nov 24 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "Adventure", "General", "Point-and-Click", "Linear"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/1010d55b09f9216b22263c764cc5d78f-98.jpg", "descriptions": "Minecraft: Story Mode is like a playable TV show based on the game, where YOU are the star, and your choices and actions decide how the story is told. You are Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your gang stumbles onMinecraft: Story Mode is like a playable TV show based on the game, where YOU are the star, and your choices and actions decide how the story is told. You are Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your gang stumbles on something dreadful. Terror is unleashed, and your only hope is to track down the “Order of the Stone”, a fabled group of adventurers who slew the legendary Ender Dragon. But where are they? In a race against time, you will travel across the over-world, through the Nether, to The End, and beyond. … Expand"}, {"name": "Dungeon Travelers 2: The Royal Library & the Monster Seal", "details_link": "https://www.metacritic.com/game/playstation-vita/dungeon-travelers-2-the-royal-library-the-monster-seal", "publisher": "Atlus", "release_date": "Aug 18 2015", "developers": ["Aqua Plus"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 73, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/f3822c909c27ac00bbd52e21a42ab366-98.jpg", "descriptions": "There once was an era in which the earth was inhabited by gods, humans, and an evil deity from the underworld known as the Demon God. Under the flag of the holy maiden Vitoria, humans fought against the spirits, or monsters, who worked as the Demon’s pawns for ages. – God's Era, Year 395. AThere once was an era in which the earth was inhabited by gods, humans, and an evil deity from the underworld known as the Demon God. Under the flag of the holy maiden Vitoria, humans fought against the spirits, or monsters, who worked as the Demon’s pawns for ages. – God's Era, Year 395. A technique for capturing monsters into a magical tome called a Sealbook was invented by the first royal alchemist, Siegdrad. A new, special class called Libras handled this sealing magic, and they garnered tremendous results in regard to monster suppression. Thanks to their efforts, the monsters’ population plummeted, and eventually the Demon God herself was sealed away. The world began to operate under the rule of humanity. Then came the King’s Era, Year 1. Vitoria had achieved continental unification through the hard work of mankind, and succeeded the throne as First Queen of the Kingdom of Romulea. [Atlus]… Expand"}, {"name": "Yatagarasu: Attack on Cataclysm", "details_link": "https://www.metacritic.com/game/pc/yatagarasu-attack-on-cataclysm", "publisher": "Nyu Media, Ltd.", "release_date": "Jul  7 2015", "platforms": "PC", "genres": ["Action", "Fighting", "2D"], "meta_score": 0, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/85fd36fb903668f969aa038731d290a9-98.jpg", "descriptions": null}, {"name": "Lara Croft and the Temple of Osiris", "details_link": "https://www.metacritic.com/game/pc/lara-croft-and-the-temple-of-osiris", "publisher": "Square Enix", "release_date": "Dec  8 2014", "developers": ["Nixxes Software"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "genres": ["Action", "Action Adventure", "Platformer", "Linear", "2D"], "meta_score": 73, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/34b5f3084bce90bf56851f03c222340f-98.jpg", "descriptions": "Lara Croft and the Temple of Osiris is the sequel to Lara Croft and the Guardian of Light. In her new adventure, Lara Croft travels to Egypt and realized she must join forces with rival treasure hunter Carter Bell and imprisoned gods Horus and Isis to defeat the evil god Set. Featuring aLara Croft and the Temple of Osiris is the sequel to Lara Croft and the Guardian of Light. In her new adventure, Lara Croft travels to Egypt and realized she must join forces with rival treasure hunter Carter Bell and imprisoned gods Horus and Isis to defeat the evil god Set. Featuring a 4-player co-op story, players must work together to explore the temple, defeat hordes of enemies from the Egyptian underworld, solve devious puzzles, and avoid deadly traps. At the same time, players compete for treasure, powerful artifacts, and ultimate bragging rights. … Expand"}, {"name": "The Wolf Among Us: Episode 2 - Smoke and Mirrors", "details_link": "https://www.metacritic.com/game/xbox-360/the-wolf-among-us-episode-2---smoke-and-mirrors", "publisher": "Telltale Games", "release_date": "Feb  5 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "Point-and-Click"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/366c88602b78e5d15510c84667c146ee-98.jpg", "descriptions": "The Wolf Among Us is a five episode series from the creators of the 2012 Game of the Year: The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore andThe Wolf Among Us is a five episode series from the creators of the 2012 Game of the Year: The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore and legend are real and exist in our world. As Bigby Wolf - THE big bad wolf in human form - you will discover that the brutal, bloody murder of a Fable is just a taste of things to come, in a game series where your every decision can have enormous consequences.… Expand"}, {"name": "PixelJunk Shooter", "details_link": "https://www.metacritic.com/game/pc/pixeljunk-shooter", "publisher": "Double Eleven", "release_date": "Nov 11 2013", "developers": ["Double Eleven", "Q-Games"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/6ff4cbf906fa2efc655fb994cc5bfbe1-98.jpg", "descriptions": "In PixelJunk Shooter, players pilot a subterranean vehicle to explore the interior of diverse cave-like complexes.  The player must affect the surrounding and dynamic terrain to progress.  The goal is to safely navigate through each vivid stage and rescue survivors scattered about theIn PixelJunk Shooter, players pilot a subterranean vehicle to explore the interior of diverse cave-like complexes.  The player must affect the surrounding and dynamic terrain to progress.  The goal is to safely navigate through each vivid stage and rescue survivors scattered about the cavernous environment.  Each stage is in-effect a flow simulation whereby the player attempts to control various types of liquid (water, magma, etc) and solid matter (rock, earth) either by destroying it, manipulating it or moving it.  These dynamic fluid effects are at the heart of the games visuals.  Strategy is paramount in PixelJunk Shooter.  The piloted craft is susceptible to extremes of heat, so the player must be careful about the craft's proximity to magma. If the craft becomes too hot, the player can regain a comfortable temperature by plunging into the nearest water source.  Additionally, each stage presents a puzzle scenario for the player to solve in order to safely rescue as many survivors as possible.  Both environmental elements and enemies, including Bosses, will attempt to hamper the player's progress.… Expand"}, {"name": "Battlefield 3: Close Quarters", "details_link": "https://www.metacritic.com/game/pc/battlefield-3-close-quarters", "publisher": "Electronic Arts", "release_date": "Jun 26 2012", "developers": ["EA DICE"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/2776cff6ce690eabab5ec11c638b7239-98.jpg", "descriptions": "Battlefield 3: Close Quarters is an expansion pack bringing the team play of Battlefield 3 to tight indoor environments. The frantic infantry combat is amplified by unprecedented destruction, added persistence, and new weapons. The HD Destruction lets players riddle the environment withBattlefield 3: Close Quarters is an expansion pack bringing the team play of Battlefield 3 to tight indoor environments. The frantic infantry combat is amplified by unprecedented destruction, added persistence, and new weapons. The HD Destruction lets players riddle the environment with bullets, reducing entire locales to ruin. The tight level design and vertical gameplay create a highly competitive environment. \r\r- Get plunged into frantic infantry combat on 4 new maps\r- HD Destruction lets you reduce entire locales to ruin\r- Earn 10 new weapons to bring back to the base game\r- Complete 10 Assignments and get 5 unique dog tags… Expand"}, {"name": "Pro Evolution Soccer 2012 3D", "details_link": "https://www.metacritic.com/game/3ds/pro-evolution-soccer-2012-3d", "publisher": "Konami", "release_date": "Feb  1 2012", "developers": ["Konami"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "3DS"], "genres": ["Sports", "Traditional", "Team", "Football", "Soccer", "Sim", "Sim", "Sim"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/8083c3753dd00ef6ef97681733412d63-98.jpg", "descriptions": "Pro Evolution Soccer 2012 is the latest annual update to the long-running football franchise, once known as Winning Eleven."}, {"name": "The Blackwell Deception", "details_link": "https://www.metacritic.com/game/pc/the-blackwell-deception", "publisher": "Wadjet Eye Games", "release_date": "Oct 12 2011", "developers": ["Wadjet Eye Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/e4e556a0804de74948399bed2f3cf411-98.jpg", "descriptions": "Blackwell Deception is the fourth installment in the Blackwell adventure series."}, {"name": "Sideway: New York", "details_link": "https://www.metacritic.com/game/playstation-3/sideway-new-york", "publisher": "Sony Online Entertainment", "release_date": "Oct 11 2011", "developers": ["Playbrains", "Fuel Industries"], "platforms": ["PC", "PlayStation 3"], "genres": ["Miscellaneous", "General", "General"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/818f44d6bb2f66559a4eabdc85f8c97b-98.jpg", "descriptions": "Set against the gritty art culture in New York City, Sideway follows the adventures of Nox, a 2D rebellious young artist, as he navigates the 3D urban streets."}, {"name": "Arcana Heart 3", "details_link": "https://www.metacritic.com/game/playstation-3/arcana-heart-3", "publisher": "Aksys Games", "release_date": "Apr 19 2011", "developers": ["Examu"], "platforms": "PlayStation 3", "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/bbe41e99bb836a6686f56fa6e9438b8f-98.jpg", "descriptions": "Arcana Heart 3 combines fast-paced aerial action with a unique cast for this fighting game."}, {"name": "Spider-Man: Shattered Dimensions", "details_link": "https://www.metacritic.com/game/ds/spider-man-shattered-dimensions", "publisher": "Activision", "release_date": "Sep  7 2010", "developers": ["Griptonite Games"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Adventure", "General", "Beat-'Em-Up", "Open-World", "Fantasy", "Third-Person", "Fantasy", "3D"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/8e5ac4185a158e9a54f7422a4077cf39-98.jpg", "descriptions": "Swing your way into action to help restore reality with your friendly neighborhood Spiderman."}, {"name": "DiRT 2", "details_link": "https://www.metacritic.com/game/ds/dirt-2", "publisher": "Codemasters", "release_date": "Sep  8 2009", "developers": ["Firebrand Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/7066eaafc30bc774749e025f2284c587-98.jpg", "descriptions": "(Also known as \"Colin McRae: DiRT 2\" in the UK/EU)  DiRT 2 takes racing games to a new level with thrilling new race types, striking locations, big event atmosphere, and a peerless line-up of super-charged speed machines, each selected to deliver spectacular, fast-paced racing. Taking(Also known as \"Colin McRae: DiRT 2\" in the UK/EU)  DiRT 2 takes racing games to a new level with thrilling new race types, striking locations, big event atmosphere, and a peerless line-up of super-charged speed machines, each selected to deliver spectacular, fast-paced racing. Taking players on an exhilarating World Tour, DiRT 2 delivers over 100 stunning events, including aggressive, multi-vehicle races and intense solo challenges, set in the most diverse and demanding real-world environments. From the muddy tracks of the Malaysian rainforest to spectator-packed stadiums in London and Los Angeles, racers compete in contemporary off-road race disciplines covering Rallycross, Trailblazer, Raid, Landrush, and Rally. Embracing the culture and new heroes of modern off-road racing, DiRT 2 features an exciting line-up of the best new rally drivers - including the multi medal-winning Subaru Rally Team USA driver Ken Block alongside Travis Pastrana, Dave Mirra, and Tanner Faust, who help players build their racing career. [Codemasters]… Expand"}, {"name": "Art Style: CUBELLO", "details_link": "https://www.metacritic.com/game/wii/art-style-cubello", "publisher": "Nintendo", "release_date": "Oct 13 2008", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/013ee7d30f7c12727ed3fadd3cc77e55-98.jpg", "descriptions": "[WiiWare]  Art Style: CUBELLO mixes the strategy and feel of a traditional puzzle game with the precision and reflexes required in a shooter. As each stage begins, various colored cubes form into one large object called a Cubello, which floats and rotates as you play. Launch additional cubes[WiiWare]  Art Style: CUBELLO mixes the strategy and feel of a traditional puzzle game with the precision and reflexes required in a shooter. As each stage begins, various colored cubes form into one large object called a Cubello, which floats and rotates as you play. Launch additional cubes from your magazine and try to connect four or more of the same color, removing them from the Cubello and eventually leaving only its core. Take on the challenge of either Stage or Endless mode and watch what happens when Bonus Time is activated. The straightforward controls and goal ensure that anyone can play, while offering enough depth that even advanced players will find themselves quickly addicted to the unique world of Art Style: CUBELLO. [Nintendo]… Expand"}, {"name": "It's Mr. Pants", "details_link": "https://www.metacritic.com/game/game-boy-advance/its-mr-pants", "publisher": "THQ", "release_date": "Nov 15 2005", "developers": ["Rare Ltd."], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/1a7b5dcbbe12f29b4652f4726058088c-98.jpg", "descriptions": "Mr. Pants is back and ready to show you the brutally funky sights of Pants Land. In what little spare time he has, Mr. Pants has been putting together some challenges for all you puzzling-loving fans."}, {"name": "The Suffering: Ties That Bind", "details_link": "https://www.metacritic.com/game/pc/the-suffering-ties-that-bind", "publisher": "Midway", "release_date": "Oct  2 2005", "developers": ["Surreal Software"], "platforms": ["PlayStation 2", "PC"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/5e650bd56f549eca1ed5ab8a56dfb04e-98.jpg", "descriptions": "The Suffering: Ties That Bind is a revolutionary action-horror game that emphasizes the disturbing terror of its predecessor, with new twisted creatures and a few familiar faces. Set in the unforgiving streets and prisons of Baltimore, the player once again controls Torque as he seeksThe Suffering: Ties That Bind is a revolutionary action-horror game that emphasizes the disturbing terror of its predecessor, with new twisted creatures and a few familiar faces. Set in the unforgiving streets and prisons of Baltimore, the player once again controls Torque as he seeks revenge against the mysterious grand manipulator Blackmore, a man somehow tied to the death of Torque's family. Players explore the tough inner-city, with poverty and urban injustices trapping people just as effectively as a physical prison. The unique morality system returns, as players delve into the perverse world of Torque's sanity to discover his past and struggle to control his future. [Midway]… Expand"}, {"name": "Star Wars Episode III: Revenge of the Sith", "details_link": "https://www.metacritic.com/game/game-boy-advance/star-wars-episode-iii-revenge-of-the-sith", "publisher": "Ubisoft", "release_date": "May  4 2005", "developers": ["Ubisoft"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/ada068ba14a2ed32df7d9834df7ce0ee-98.jpg", "descriptions": "Based on the third episode of the Star Wars trilogy, Star Wars Episode III: Revenge of the Sith promises an authentic Jedi experience. The third-person action game follows Anakin Skywalker and Obi-Wan Kenobi as they fight enemies, learn new skills, and pull off combo moves. In multiplayerBased on the third episode of the Star Wars trilogy, Star Wars Episode III: Revenge of the Sith promises an authentic Jedi experience. The third-person action game follows Anakin Skywalker and Obi-Wan Kenobi as they fight enemies, learn new skills, and pull off combo moves. In multiplayer duels, you can fight against Darth Vader and other challenging enemies.… Expand"}, {"name": "Pitfall: The Lost Expedition", "details_link": "https://www.metacritic.com/game/gamecube/pitfall-the-lost-expedition", "publisher": "Activision", "release_date": "Feb 18 2004", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/464d75379cf7fb6fd041e470a1b22b7c-98.jpg", "descriptions": "Delving deep in the Peruvian Jungle, you assume the role of Pitfall Harry--a fearless, rough-and-ready treasure seeker who battles evil using his athletic ability and a knapsack filled with adventure gear.  Your mission: Race against a rival explorer to find hidden treasures, which couldDelving deep in the Peruvian Jungle, you assume the role of Pitfall Harry--a fearless, rough-and-ready treasure seeker who battles evil using his athletic ability and a knapsack filled with adventure gear.  Your mission: Race against a rival explorer to find hidden treasures, which could spell doom for you and your friends if they fall into the wrong hands.  The game challenges you to explore an obstacle-filled world featuring over 50 perilous levels, including lush rainforests, creature-ridden caves and vast glacial mountains.  You'll be swinging on vines, avoiding crocodiles and dodging rolling logs as you unearth artifacts and use your cunning to defeat dangerous foes.  … Expand"}, {"name": "Dungeon Siege: Legends of Aranna", "details_link": "https://www.metacritic.com/game/pc/dungeon-siege-legends-of-aranna", "publisher": "Microsoft Game Studios", "release_date": "Nov 11 2003", "developers": ["Mad Doc Software"], "platforms": "PC", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/20a38cad37b90cdeca2c6ed2a9cad6ee-98.jpg", "descriptions": "The expansion pack to the award-winning RPG of 2002 unveils an all-new campaign that will challenge players to explore and fight their way through nine spectacular areas, including an expansive new jungle region, as they unravel the rich history and mystery of the world of Aranna. Legends ofThe expansion pack to the award-winning RPG of 2002 unveils an all-new campaign that will challenge players to explore and fight their way through nine spectacular areas, including an expansive new jungle region, as they unravel the rich history and mystery of the world of Aranna. Legends of Aranna will also introduce new spells and special over-the-top spell effects to combat fierce new creatures such as Clockwork Beasts and Doppelgangers. Those not content to play a standard farm girl or farm boy will be able to choose a new half-giant player character; and even use spells to transform into a wolf, lava monster or troll. Players will be able to collect rare and powerful treasures, including new consistent styles of armor sets and collectables. Also available is a new pack animal that will defend the player's treasure to the death. [Microsoft… Expand"}, {"name": "Worms Blast", "details_link": "https://www.metacritic.com/game/pc/worms-blast", "publisher": "Ubisoft", "release_date": "Oct 23 2002", "developers": ["Team17"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "General"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/4833f77139876b1e6c4f827a57562184-98.jpg", "descriptions": "Fall in line for fast, furious firefights with Worms Blast. Your mission: launch your Worm marine into hostile waters and blast your way to survival. Go head-to-head with a friend in a barrage of gameplay modes and mini-games. Recruit your Worm from a crazy corps of cartoon grunts withFall in line for fast, furious firefights with Worms Blast. Your mission: launch your Worm marine into hostile waters and blast your way to survival. Go head-to-head with a friend in a barrage of gameplay modes and mini-games. Recruit your Worm from a crazy corps of cartoon grunts with serious delusions of grandeur. Worms Blast puts your mettle, reflexes, and blasting skills to the ultimate test. Are you ready soldier? Then move out! [Ubi Soft]… Expand"}, {"name": "Defender", "details_link": "https://www.metacritic.com/game/playstation-2/defender", "publisher": "Midway", "release_date": "Oct 22 2002", "developers": ["7 Studios"], "platforms": ["iPhone/iPad", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/8a65b590bdaa89eff497ec1dfde80420-98.jpg", "descriptions": "Relive the excitement of the ultimate action videogame with the all-new next-generation remake of Defender. Developed by 7 Studios, this all-new 3D Defender -- based on the timeless arcade classic -- offers players space-combat action as they fight to defend their solar system and save theRelive the excitement of the ultimate action videogame with the all-new next-generation remake of Defender. Developed by 7 Studios, this all-new 3D Defender -- based on the timeless arcade classic -- offers players space-combat action as they fight to defend their solar system and save the human race from alien invasion. In addition to fast and furious space-combat action, Defender will showcase elements of strategy, multiple types of humans to protect and use, ground units for players to defend and strategically position, and bases to build and expand. Players will also be able to take flight in new Defender ships with the ability to upgrade with special weapons, shields and other technologies as they take on the aliens who've invaded their universe. [Midway]… Expand"}, {"name": "BloodRayne", "details_link": "https://www.metacritic.com/game/gamecube/bloodrayne", "publisher": "Majesco Games", "release_date": "Oct 15 2002", "developers": ["Terminal Reality"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/fa35b3e492ff8b4e0ebcd8f275eacb4c-98.jpg", "descriptions": "BloodRayne is a killing machine. The Brimstone Society calls upon this half-vampire, half-human agent to take on two missions in the years between the world wars. At the root of these missions is one man who searches for powerful occult artifacts that would bring Germany into a new age ofBloodRayne is a killing machine. The Brimstone Society calls upon this half-vampire, half-human agent to take on two missions in the years between the world wars. At the root of these missions is one man who searches for powerful occult artifacts that would bring Germany into a new age of domination. As BloodRayne, you must stop this man's elite Nazi army from releasing terrorizing creatures onto the world. With melee attacks, weapons, and bloodsucking abilities, your enemies won't stand a chance.… Expand"}, {"name": "2002 FIFA World Cup", "details_link": "https://www.metacritic.com/game/playstation-2/2002-fifa-world-cup", "publisher": "EA Sports", "release_date": "Apr 22 2002", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 73, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/2af8ef8795c28eb0f52cb46199b545f1-98.jpg", "descriptions": "The official soccer game of the 2002 Korea/Japan World Cup features new \"Air Play\" gameplay with intuitive one-button headers, volleys, scissor kicks, juggling and showboating. New player-to-player animations allow for agressive jostling for the ball on the ground and in the air. TheThe official soccer game of the 2002 Korea/Japan World Cup features new \"Air Play\" gameplay with intuitive one-button headers, volleys, scissor kicks, juggling and showboating. New player-to-player animations allow for agressive jostling for the ball on the ground and in the air. The Tournament Mode features a seven game series beginning with round-robin play, followed by playoffs leading to the final match with a progressive story line and a rising intensity as you advance. [EA Sports]… Expand"}, {"name": "Blender Bros.", "details_link": "https://www.metacritic.com/game/game-boy-advance/blender-bros", "publisher": "Infogrames", "release_date": "Apr 15 2002", "developers": ["AI"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/5f7881de394175bf4afb15208d285335-98.jpg", "descriptions": "Leap into the future as Blender, leader of the Cosmo Keepers, and use his super long ears to grab items, fight and fly. Clear multiple levels on different worlds, collect Mini Bros., use their power-ups and defeat the Zooligans! 20 Mini Bros. to find, collect and trade, 7 different planetsLeap into the future as Blender, leader of the Cosmo Keepers, and use his super long ears to grab items, fight and fly. Clear multiple levels on different worlds, collect Mini Bros., use their power-ups and defeat the Zooligans! 20 Mini Bros. to find, collect and trade, 7 different planets with unique environments and surprises, 3 mini games allow up to 4 players to compete using the Game Link Cable.… Expand"}, {"name": "Duke Nukem 64", "details_link": "https://www.metacritic.com/game/nintendo-64/duke-nukem-64", "publisher": "GT Interactive", "release_date": "Oct 31 1997", "developers": ["Eurocom Entertainment Software"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/d15b8c5cbe456de80476b3af52f4379d-98.jpg", "descriptions": "Duke Nukem's coming to get some! Prepare yourself to become the biggest, baddest, alien basher in the known universe - Duke Nukem; as you blast your way through the streets of LA out to an orbiting station, and onto the moon itself. Bag some aliens with over a dozen hi-tech weapons. 32Duke Nukem's coming to get some! Prepare yourself to become the biggest, baddest, alien basher in the known universe - Duke Nukem; as you blast your way through the streets of LA out to an orbiting station, and onto the moon itself. Bag some aliens with over a dozen hi-tech weapons. 32 levels of non-stop carnage. Run, jump, crawl, swim, and jetpack your way through danger. Big weapons and bigger bosses for a fun-filled fragfest! Four-player, split-screen Dukematch action.… Expand"}, {"name": "Lords of the Fallen", "details_link": "https://www.metacritic.com/game/pc/lords-of-the-fallen", "publisher": "City Interactive", "release_date": "Oct 28 2014", "developers": ["City Interactive", "Deck 13"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/0b2e4059d1e49a16a769df05d14b3202-98.jpg", "descriptions": "Lords of the Fallen is a hardcore action-RPG featuring an advanced combat systems and robust class skill trees. Set in a richly created fantasy world where the Gods have failed mankind, players will take on the role of a human named Harkyn who sets out on a quest to stand against anLords of the Fallen is a hardcore action-RPG featuring an advanced combat systems and robust class skill trees. Set in a richly created fantasy world where the Gods have failed mankind, players will take on the role of a human named Harkyn who sets out on a quest to stand against an apparently unstoppable supernatural force. Players travel across a world that is deeply dived by those that follow and others that resist, the Fallen God. Along their journey they will be faced with a series of decisions that will alter both the world and their character thus dramatically impacting the storyline.… Expand"}, {"name": "Strange Brigade", "details_link": "https://www.metacritic.com/game/playstation-4/strange-brigade", "publisher": "Rebellion", "release_date": "Aug 28 2018", "developers": ["Rebellion"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/fe88a0ba08c3691bbf19237e36f17bd0-98.jpg", "descriptions": "Egypt, the 1930's. Erased from ancient history and buried in a nameless tomb for 4,000 years, Seteki the Witch Queen has risen once again. Only one troop of daring heroes can stand against the fearsome power of Seteki and her army of mummified monstrosities: The Strange Brigade!\r ExploreEgypt, the 1930's. Erased from ancient history and buried in a nameless tomb for 4,000 years, Seteki the Witch Queen has risen once again. Only one troop of daring heroes can stand against the fearsome power of Seteki and her army of mummified monstrosities: The Strange Brigade!\r Explore remarkable ruins, solve perilous puzzles and uncover tantalising treasure while blasting your way through an array of undead enemies in thrilling third-person action that's certain to bring out your inner adventurer!… Expand"}, {"name": "Destiny 2: Shadowkeep", "details_link": "https://www.metacritic.com/game/playstation-4/destiny-2-shadowkeep", "publisher": "Activision", "release_date": "Oct  1 2019", "developers": ["Bungie"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/d8eef3070930e25b54f404b18f238066-98.jpg", "descriptions": "New nightmares have emerged from the shadows of our Moon. Called forth by haunting visions, Eris Morn has returned. Join her to slay these nightmares before they reach out beyond the Moon to cast humanity back into an age of darkness. Features: New Missions, & Quests; New Destination &New nightmares have emerged from the shadows of our Moon. Called forth by haunting visions, Eris Morn has returned. Join her to slay these nightmares before they reach out beyond the Moon to cast humanity back into an age of darkness. Features: New Missions, & Quests; New Destination & Dungeon; New Weapons and Gear to Earn; An All New Raid; and more.… Expand"}, {"name": "Summon Night: Twin Age", "details_link": "https://www.metacritic.com/game/ds/summon-night-twin-age", "publisher": "Atlus", "release_date": "Jun  3 2008", "developers": ["Flight-Plan"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/88bfff1c6387e0e1435f7c894523e44c-98.jpg", "descriptions": "From a very young age, the human girl Reiha displayed great aptitude for the magical art of Summoning. While still a child, her powers caused a terrible accident during a major Summoning experiment. It was reported that Reiha had died as result, but she survived, along with a young SummonFrom a very young age, the human girl Reiha displayed great aptitude for the magical art of Summoning. While still a child, her powers caused a terrible accident during a major Summoning experiment. It was reported that Reiha had died as result, but she survived, along with a young Summon Beast named Aldo that had been pulled into her world. Following the accident, the two children grew up together as brother and sister on the tropical island of Jarazi, among a race of people with beast-like features. There they learned to commune with the Nature Spirits that surrounded them. One day, the Spirits began acting strangely, prompting Reiha and Aldo to investigate. Their quest to find out who or what is behind the corruption of the Spirits will lead them back to the human lands where the cataclysm first brought them together. [Atlus USA]… Expand"}, {"name": "Anarchy Online: Alien Invasion", "details_link": "https://www.metacritic.com/game/pc/anarchy-online-alien-invasion", "publisher": "Funcom", "release_date": "Aug 31 2004", "developers": ["Funcom"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/52453e7cd4d89e982203ec28df070fba-98.jpg", "descriptions": "The new alien menace threatens all of the citizens of Rubi-Ka as the planet is suddenly invaded. A massive call to arms is sounded across the planet as the players rally to defend their own cities against the alien hordes. The players can also fight their way into the heart of invadingThe new alien menace threatens all of the citizens of Rubi-Ka as the planet is suddenly invaded. A massive call to arms is sounded across the planet as the players rally to defend their own cities against the alien hordes. The players can also fight their way into the heart of invading  spaceships, gaining riches, fame and power. [Funcom]… Expand"}, {"name": "Need for Speed Unbound", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-unbound", "publisher": "Electronic Arts", "release_date": "Dec  2 2022", "developers": ["Criterion Games"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 73, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/98404887a665b04e56d67e725fd0f123-98.jpg", "descriptions": "START AT THE BOTTOM, RACE TO THE TOP. The world is your canvas in Need for Speed™ Unbound. Prove you have what it takes to win The Grand, Lakeshore’s ultimate street racing challenge. Across four intense weeks of racing, earn enough cash to enter weekly qualifiers, beat the competition, andSTART AT THE BOTTOM, RACE TO THE TOP. The world is your canvas in Need for Speed™ Unbound. Prove you have what it takes to win The Grand, Lakeshore’s ultimate street racing challenge. Across four intense weeks of racing, earn enough cash to enter weekly qualifiers, beat the competition, and make your mark on the street racing scene while outdriving and outsmarting the cops. Pack your garage with precision-tuned, custom rides and light up the streets with your unique style, exclusive fits, and a vibrant global soundtrack led by A$AP Rocky and AWGE that bumps in every corner of the world. Express yourself to the fullest with the freshest new art styles and signature tags that represent what you're all about. With separate single and multiplayer campaigns, this latest edition in the Need for Speed™ franchise from Criterion Games™ delivers hours of electric, adrenaline-pumping action.\r • Graffiti comes to life in Need for Speed™ Unbound with an all-new, unique visual style that blends elements of the freshest street art with the most realistic looking cars in Need for Speed™ history. Access a brand-new toolkit of high-energy visual and sound effects to express your driving skills, including Burst Nitrous, a new boost tactic that delivers a dizzying rush of speed.\r • To get to the top, you gotta take risks. Choose how and when to put it all on the line, pulling huge drifts on the street, outdriving the cops, or placing side bets with your own earnings against rival racers. Time is money, so find the fastest way to earn enough cash to enter the weekly qualifiers and make it to Lakeshore’s ultimate race, The Grand.\r • The more you race, the more you build heat. While the cops pile on the pressure, you gotta make tactical decisions using new escape mechanics to take control of the chase. Do you outrun the cops, battle them head on, or hide out in Lakeshore's underground? Run these streets and you’ll reap the rewards.\r • Pull up to a Meetup and show off your unique style with hundreds of cosmetic items to choose from, including exclusive gear from some of the world’s most pioneering fashion innovators. Extend that look to your ride, transforming your cars with unique wraps and cutaways for the ultimate legendary custom. And when you take first, don't forget to stunt on the competition with your own personal win poses.… Expand"}, {"name": "Bury me, my Love", "details_link": "https://www.metacritic.com/game/switch/bury-me-my-love", "publisher": "Plug In Digital", "release_date": "Jan 10 2019", "developers": ["Plug In Digital"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 73, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/22c507a82e2eee2654c65baa7b36142e-98.jpg", "descriptions": "Bury me, my Love tells the story of Syrian refugee Nour and her husband Majd, as Nour undertakes a perilous journey to safety in Europe. Bury me, my Love is a Text Messaging Adventure game about Nour, a Syrian migrant trying to find her way to Europe. Her husband Majd, who remains behind inBury me, my Love tells the story of Syrian refugee Nour and her husband Majd, as Nour undertakes a perilous journey to safety in Europe. Bury me, my Love is a Text Messaging Adventure game about Nour, a Syrian migrant trying to find her way to Europe. Her husband Majd, who remains behind in Syria, communicates with Nour through a messaging app, advising her as best he can so that she reaches her destination safely. … Expand"}, {"name": "Call of Duty: Infinite Warfare", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-infinite-warfare", "publisher": "Activision", "release_date": "Nov  3 2016", "developers": ["Infinity Ward"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/9/5d8a78a2d5b6c3e1fbbbdd06b485b284-98.jpg", "descriptions": "Infinite Warfare is the first game in the franchise to venture beyond the reaches of Earth, framing a plausible future war in our solar system.  Infinite Warfare also introduces an original cooperative Zombies mode that takes players on a wild ride through a new storyline with uniqueInfinite Warfare is the first game in the franchise to venture beyond the reaches of Earth, framing a plausible future war in our solar system.  Infinite Warfare also introduces an original cooperative Zombies mode that takes players on a wild ride through a new storyline with unique gameplay features and mechanics. [Infinity Ward]… Expand"}, {"name": "Secrets of the Ark: A Broken Sword Game", "details_link": "https://www.metacritic.com/game/pc/secrets-of-the-ark-a-broken-sword-game", "publisher": "DreamCatcher Interactive", "release_date": "Feb 13 2007", "developers": ["Sumo Digital"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 73, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/7c8505f54bde0b6c7426d4cd430dcd85-98.jpg", "descriptions": "(Know in the U.S. for some reason as \"Secrets of the Ark\") When the forces of ancient worlds, and past forgotten myths battle against the power of old friends. When current emotions clash with past regret, and when some guys in York design cunning puzzles, write funny scripts and orchestrate(Know in the U.S. for some reason as \"Secrets of the Ark\") When the forces of ancient worlds, and past forgotten myths battle against the power of old friends. When current emotions clash with past regret, and when some guys in York design cunning puzzles, write funny scripts and orchestrate the type of music to make the hair on the back of your next stand on end, it can only mean the fourth instalment of Broken Sword has been born. After reluctantly battling dragons, Mayan gods and becoming a Knight of a long lost Holy Order, unwitting hero George Stobbart settles down to a life of mundane 9-5 office work. Who would have thought that a mysterious and beautiful woman would enter his life; a woman whose sudden disappearance draws him into a desperate search for a nefarious artefact of great and terrible power. (Well apart from those guys in York, that is) Emotion, humour, time pressure and puzzling combine for the latest Broken Sword Adventure and unfortunately for George, it looks like the world needs saving one more time. [THQ]… Expand"}, {"name": "Sword and Fairy: Together Forever", "details_link": "https://www.metacritic.com/game/playstation-5/sword-and-fairy-together-forever", "publisher": "EastAsiaSoft", "release_date": "Aug  4 2022", "developers": ["Softstar Technology (Beijing) Co.,Ltd"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/2a16e6ae9667963c023bd414a41378a7-98.jpg", "descriptions": "\"Swords and Fairy 7\" is an action role-playing game developed by Softstar Technology (Beijing) Co., Ltd.This game starts with the story among three clans \"Human\", \"Deity\", and \"Demon\", it brings rich story-lines as well as improves the battle system compared with its previous episodes.\"Swords and Fairy 7\" is an action role-playing game developed by Softstar Technology (Beijing) Co., Ltd.This game starts with the story among three clans \"Human\", \"Deity\", and \"Demon\", it brings rich story-lines as well as improves the battle system compared with its previous episodes. Third person real time action mode is being used to replace the traditional turn-based battle, more fun and excitements will be brought to the players. With the smooth combat experience, this game will come at you with a boom of the traditional oriental aesthetics. Get ready for the adventure in this beautiful oriental world.… Expand"}, {"name": "Surviving Mars", "details_link": "https://www.metacritic.com/game/playstation-4/surviving-mars", "publisher": "Paradox Interactive", "release_date": "Mar 15 2018", "developers": ["Haemimont Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 73, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/640abb720ed3596798f85a30f2baa362-98.jpg", "descriptions": "Surviving Mars is a sci-fi city builder all about colonizing Mars and surviving the process. Choose a space agency for resources and financial support before determining a location for your colony. Build domes and infrastructure, research new possibilities and utilize drones to unlock moreSurviving Mars is a sci-fi city builder all about colonizing Mars and surviving the process. Choose a space agency for resources and financial support before determining a location for your colony. Build domes and infrastructure, research new possibilities and utilize drones to unlock more elaborate ways to shape and expand your settlement. Cultivate your own food, mine minerals or just relax by the bar after a hard day's work. Most important of all, though, is keeping your colonists alive. Not an easy task on a strange new planet.\r There will be challenges to overcome. Execute your strategy and improve your colony's chances of survival while unlocking the mysteries of this alien world. Are you ready? Mars is waiting for you.… Expand"}, {"name": "Penumbra: Overture", "details_link": "https://www.metacritic.com/game/pc/penumbra-overture", "publisher": "Strategy First", "release_date": "Mar 30 2007", "developers": ["Frictional Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/3a83b2dc1f88b6ce398c79132fb5ebd6-98.jpg", "descriptions": "Played from a first person viewpoint, Penumbra is very different from other adventure games. Not only is it powered by a 3D engine utilising cutting edge technology, it also has an advanced physics system which allow for a never before seen environment interaction. The player can openPlayed from a first person viewpoint, Penumbra is very different from other adventure games. Not only is it powered by a 3D engine utilising cutting edge technology, it also has an advanced physics system which allow for a never before seen environment interaction. The player can open drawers, pull levers, pick up objects and more using natural mouse movements creating a highly interactive and immersive game world. The weapon system differs from your average game; swinging a melee weapon is done using the mouse which increases the realistic feel of combat. Fighting enemies is not something best done with brute force though, in most situations fighting is a last resort and the player is often better of using his/her wits. The AI of the enemies will also do its best to hunt and scare the player. The creatures encountered can break down doors, use group co-ordination, interact with the physics and more. Penumbra: Overture keeps players on the edge as they have to explore scary and immersive environments never knowing what is behind the next corner. The world is detailed, graphical as well as a story wise making the player feel part of the world as secrets are uncovered. [Strategy First]… Expand"}, {"name": "Fatal Frame: Mask of the Lunar Eclipse", "details_link": "https://www.metacritic.com/game/switch/fatal-frame-mask-of-the-lunar-eclipse", "publisher": "Koei Tecmo Games", "release_date": "Mar  9 2023", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 73, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/1/fc591caff5f9b4cb27c49b0cd20b9cdf-98.jpg", "descriptions": "Fatal Frame (aka Project Zero): Mask of the Lunar Eclipse takes place a decade after five girls mysteriously disappeared at a festival on Rogetsu Isle, an island in southern Japan. While all of the girls were eventually rescued, their memories were lost, with only the faint remembrance of aFatal Frame (aka Project Zero): Mask of the Lunar Eclipse takes place a decade after five girls mysteriously disappeared at a festival on Rogetsu Isle, an island in southern Japan. While all of the girls were eventually rescued, their memories were lost, with only the faint remembrance of a single melody and a seemingly possessed masked woman dancing in the moonlight. \r\rNow, ten years later, with still no memory of the events surrounding their disappearance, two of the five girls have died - discovered with covered faces and found in a tragic, crying pose. The remaining three girls now head off to the eerie island to solve the mystery of their friends' death, while also unlocking the mystery of the memories left behind.\r The remastered game features an all-new Photo Mode, along with new and altered costumes, and enhanced graphics including the improved rendering of shadows and light, delivering a more immersive and frightening experience. In addition, in-game movies and character models have been brushed-up to deliver a story that shines, both narratively and aesthetically as the three remaining girls attempt to rediscover their past before becoming victims once again.… Expand"}, {"name": "LEGO Batman 3: Beyond Gotham", "details_link": "https://www.metacritic.com/game/playstation-4/lego-batman-3-beyond-gotham", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 11 2014", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Modern"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/381d1b197186874ee6ce762a12d6534d-98.jpg", "descriptions": "Batman joins up with the super heroes of the DC Comics universe and blasts off to outer space to stop the evil Brainiac from destroying Earth. Using the power of the Lantern Rings, Brainiac miniaturizes worlds to add to his demented collection of mini cities from around the galaxy. TeBatman joins up with the super heroes of the DC Comics universe and blasts off to outer space to stop the evil Brainiac from destroying Earth. Using the power of the Lantern Rings, Brainiac miniaturizes worlds to add to his demented collection of mini cities from around the galaxy. Te greatest super heroes and the most cunning villains must now unite and travel to different Lantern Worlds to collect the Lantern Rings and stop Brainiac before nothing more can be done.… Expand"}, {"name": "LEGO Marvel Super Heroes 2", "details_link": "https://www.metacritic.com/game/playstation-4/lego-marvel-super-heroes-2", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 14 2017", "developers": ["TT Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/fa5485c2506da85c7ae91ddde937b3e5-98.jpg", "descriptions": "With a completely original branching storyline, LEGO® Marvel Super Heroes 2  introduces amazing new gameplay features, including the ability for characters to manipulate time and a four-player competitive Super Hero battling mode. With a huge array of brand new characters from the MarvelWith a completely original branching storyline, LEGO® Marvel Super Heroes 2  introduces amazing new gameplay features, including the ability for characters to manipulate time and a four-player competitive Super Hero battling mode. With a huge array of brand new characters from the Marvel Universe, including old favorites in new guises, this game is sure to thrill both LEGO and Marvel fans, as well as newcomers to the series.… Expand"}, {"name": "StarCraft II: Nova Covert Ops - Mission Pack 1", "details_link": "https://www.metacritic.com/game/pc/starcraft-ii-nova-covert-ops---mission-pack-1", "publisher": "Blizzard Entertainment", "release_date": "Mar 29 2016", "developers": ["Blizzard Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Command"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/42244f5e707c2375cd2dc07b95f8b1c5-98.jpg", "descriptions": "As Nova, you awaken in an unknown military facility with no memory of what brought you there. You've got to escape and learn the truth before it's too late-for you and the Terran Dominion."}, {"name": "Virtua Tennis 2009", "details_link": "https://www.metacritic.com/game/wii/virtua-tennis-2009", "publisher": "Sega", "release_date": "Jun  9 2009", "developers": ["Sumo Digital"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/c81b0ef6d281cad640b0fc2e9e06bb30-98.jpg", "descriptions": "Create your own player and join the new World Tour where you are trained by a real-life legend of tennis to compete for the #1 ranking against the biggest stars. Then take your character online and prove you're the best with the new online ranking system! With brand new courts, a new rollCreate your own player and join the new World Tour where you are trained by a real-life legend of tennis to compete for the #1 ranking against the biggest stars. Then take your character online and prove you're the best with the new online ranking system! With brand new courts, a new roll call of tennis stars to compete against and even more court mini-games, Virtua Tennis 2009 is set to be the #1 tennis title once again! New Players / Courts - Play as or against over 20 of the world’s top players, including seven new to Virtua Tennis and three legends. All-new arenas and the officially licensed Davis Cup provide the most realistic tennis competition to date. New Player Creation System - You now have full control over facial, body and clothing customization, as well as the depth to populate the game world with hundreds of unknown opponents. More Court Games. Playing alone or with up to three friends compete in 12 mini-games, five completely new, and upload your hi-scores on the worldwide rankings in games such as Zoo Feeder and Pirate War. Improved Gameplay - Courtside action is better than ever, with extensive updates to the famous arcade-style Virtua Tennis match engine, as well as 3D crowds and a more realistic courtside experience. [Sega]… Expand"}, {"name": "Strike Vector", "details_link": "https://www.metacritic.com/game/pc/strike-vector", "publisher": "Ragequit Corporation", "release_date": "Jan 28 2014", "developers": ["Strike Vector Team", "Ragequit Corporation"], "platforms": "PC", "genres": ["General", "Action", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/cf4d4efa6343911884298c9b081175cb-98.jpg", "descriptions": "Strike Vector is an intense, multiplayer third / first person air combat game. With a distinct old school feel, reminiscent to games such as Crimson Skies, Quake 3 and Unreal Tournament, Strike Vector will let you test your reflexes and skills against your friends."}, {"name": "NBA 2K Playgrounds 2", "details_link": "https://www.metacritic.com/game/playstation-4/nba-2k-playgrounds-2", "publisher": "2K Games", "release_date": "Oct 16 2018", "developers": ["Saber Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Basketball", "Arcade"], "meta_score": 73, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/f3b743893445930258dad0bcbbce6f9e-98.jpg", "descriptions": "NBA arcade action is back with NBA 2K Playgrounds 2. The sequel takes street balling to the next level with an expansive roster of current and retired NBA players, improved online matchmaking with dedicated servers, four-player online matches, three-point contests, new playgrounds, customNBA arcade action is back with NBA 2K Playgrounds 2. The sequel takes street balling to the next level with an expansive roster of current and retired NBA players, improved online matchmaking with dedicated servers, four-player online matches, three-point contests, new playgrounds, custom matches, and more. Pick your team, get ready to jam, and Ball Without Limits.… Expand"}, {"name": "Warlock 2: The Exiled", "details_link": "https://www.metacritic.com/game/pc/warlock-2-the-exiled", "publisher": "Paradox Interactive", "release_date": "Apr 10 2014", "developers": ["Paradox Interactive", "1C:Ino-Co", "Ino-Co Plus"], "platforms": "PC", "num_players": "Up to 6 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "4X"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/73f44d87c58483f4e5ce86c8e686f87b-98.jpg", "descriptions": "Warlock 2 is a turn-based strategy game of fantasy warfare. Rival against Great Mages, lead mighty armies into fierce battles, wield ancient magic, use cunning diplomacy and faith as your weapons. Experience the challenge in single or multiplayer."}, {"name": "The King of Fighters '98 Ultimate Match", "details_link": "https://www.metacritic.com/game/playstation-2/the-king-of-fighters-98-ultimate-match", "publisher": "Ignition Entertainment", "release_date": "Mar  3 2009", "developers": ["SNK Playmore"], "platforms": ["PlayStation 4", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 73, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/7/95aa1b76f01d822a9ef3a3ee9cecb812-98.jpg", "descriptions": "Originally created as a \"dream match\" for players to pit their favorite KOF characters against each other, KOF '98 UM takes that one step further by introducing new features such as new characters, game systems, game modes, stages and soundtracks not seen in the original. KOF '98 UM containsOriginally created as a \"dream match\" for players to pit their favorite KOF characters against each other, KOF '98 UM takes that one step further by introducing new features such as new characters, game systems, game modes, stages and soundtracks not seen in the original. KOF '98 UM contains 64 characters, 10 of which are new to the Ultimate Match version. This is the most characters ever included in one KOF game.… Expand"}, {"name": "2014 FIFA World Cup Brazil", "details_link": "https://www.metacritic.com/game/playstation-3/2014-fifa-world-cup-brazil", "publisher": "EA Sports", "release_date": "Apr 15 2014", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim"], "meta_score": 73, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/848e35f6930808cfe76f5e1c83b7975d-98.jpg", "descriptions": "An all-new feature and one of 100 new animations, Over-the-Back Headers give players the ability to jump over top of the opposition to win the ball. On defense, jump over the back of a holding attacker to clear the ball to safety or while in attack, jump over your defender to unleash aAn all-new feature and one of 100 new animations, Over-the-Back Headers give players the ability to jump over top of the opposition to win the ball. On defense, jump over the back of a holding attacker to clear the ball to safety or while in attack, jump over your defender to unleash a header on goal.… Expand"}, {"name": "Storyteller", "details_link": "https://www.metacritic.com/game/switch/storyteller", "publisher": "Annapurna Interactive", "release_date": "Mar 23 2023", "developers": ["Daniel Benmergui"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 73, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/d138bdc07daa8c7b076c421fe2c7b950-98.jpg", "descriptions": "Storyteller is a game about building stories. Start with a title, settings and characters and create a story that fits the story’s description. Play with stories of love, intrigue, crime, monsters, betrayal, and more."}, {"name": "Salt and Sacrifice", "details_link": "https://www.metacritic.com/game/playstation-5/salt-and-sacrifice", "publisher": "Ska Studios", "release_date": "May 10 2022", "developers": ["Ska Studios", "Devoured Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG", "Action", "Platformer", "", "Metroidvania"], "meta_score": 73, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/d9f1f966b8f8a459a3f5880f315f5a2a-98.jpg", "descriptions": "Salt and Sacrifice is the follow-up to Souls-like dark fantasy RPG, Salt and Sanctuary. In a land plagued by powerful and twisted Mages, the condemned Marked Inquisitors take up the hunt. A once-peaceful kingdom is plunged into chaos by encroaching tides of Mages: merciless embodiments ofSalt and Sacrifice is the follow-up to Souls-like dark fantasy RPG, Salt and Sanctuary. In a land plagued by powerful and twisted Mages, the condemned Marked Inquisitors take up the hunt. A once-peaceful kingdom is plunged into chaos by encroaching tides of Mages: merciless embodiments of elemental chaos. The Marked Inquisitors, a doomed force of the condemned, once again mobilizes to stand against the existential threat of Magic. A buried secret threatens to bring an ancient empire to utter ruin. As a Marked Inquisitor, you’ll journey through the western frontier: pursuing, hunting, and obliterating the Mages that roam the realm. You may be bound to the Inquisition, but your choices are yours.… Expand"}, {"name": "Disgaea 6: Defiance of Destiny", "details_link": "https://www.metacritic.com/game/switch/disgaea-6-defiance-of-destiny", "publisher": "NIS America", "release_date": "Jun 29 2021", "developers": ["Nippon Ichi Software"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 73, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/a1f1ba89c2be8407120fbefedb036600-98.jpg", "descriptions": "SRPGs are gonna get a serious punch in the throat. The first new DISGAEA game in six years is here! Meet Zed, a zombie that has risen above them all except one - a God of Destruction. Can a mere Netherworld zombie rise up and destroy a god? Find out in the newest installment of the DISGAEASRPGs are gonna get a serious punch in the throat. The first new DISGAEA game in six years is here! Meet Zed, a zombie that has risen above them all except one - a God of Destruction. Can a mere Netherworld zombie rise up and destroy a god? Find out in the newest installment of the DISGAEA series! Features such as Super Reincarnation, 3D visuals (a first for this series), and adjustable gameplay settings make this the perfect game for both new and old DISGAEA fans!… Expand"}, {"name": "Dragon Ball Z: Kakarot", "details_link": "https://www.metacritic.com/game/xbox-one/dragon-ball-z-kakarot", "publisher": "Bandai Namco Games", "release_date": "Jan 17 2020", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/699fb8fbae8cc4091f237814b5253197-98.jpg", "descriptions": "Relive the story of Goku in DRAGON BALL Z: KAKAROT! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku. Explore the new areas and adventures as you advance through the story and form powerful bonds with other heroes from theRelive the story of Goku in DRAGON BALL Z: KAKAROT! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku. Explore the new areas and adventures as you advance through the story and form powerful bonds with other heroes from the DRAGON BALL Z universe. \r\rExperience the Story\rExperience the story of DRAGON BALL Z from epic events to light-hearted side quests, including never-before-seen story moments that answer some burning questions of Dragon Ball lore for the first time!\r Iconic DRAGON BALL Z\rPlay through iconic DRAGON BALL Z battles on a scale unlike any other. Fight across vast battlefields with destructible environments and experience epic boss battles that will test the limits of your combat abilities. Increase your power level and rise to the challenge! \r\rDon't Just Fight As Goku\rLive as Goku. Fish, fly, eat, train, and battle your way through the DRAGON BALL Z sagas, making friends and building relationships with a massive cast of DRAGON BALL characters.… Expand"}, {"name": "Wallace & Gromit's Grand Adventures, Episode 2: The Last Resort", "details_link": "https://www.metacritic.com/game/xbox-360/wallace-gromits-grand-adventures-episode-2-the-last-resort", "publisher": "Telltale Games", "release_date": "Nov  4 2009", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/31b7c9912e08855364e8b20af833863b-98.jpg", "descriptions": "[Xbox Live Arcade]  Join Wallace & Gromit once again in Wallace & Gromit Episode 2: The Last Resort, the second tale in their newest adventure series by Telltale! When unrelenting rain ruins their holiday plans, Wallace & Gromit bring the beach to their basement and transform 62 West Wallaby[Xbox Live Arcade]  Join Wallace & Gromit once again in Wallace & Gromit Episode 2: The Last Resort, the second tale in their newest adventure series by Telltale! When unrelenting rain ruins their holiday plans, Wallace & Gromit bring the beach to their basement and transform 62 West Wallaby into a makeshift resort. Keeping the customers satisfied is tricky business, especially after one of them is clocked on the head by an unknown assailant. Whodunnit? It’s up to Gromit to find out … with a little help from Wallace’s latest invention, the Deduct-o-matic! Featuring a brand new story with the same slapstick humour, cinematic visuals, and British charm fans of the Wallace & Gromit films have come to love, The Last Resort is the second game in the series that has everyone buzzing! [Telltale Games]… Expand"}, {"name": "The Last Worker", "details_link": "https://www.metacritic.com/game/playstation-5/the-last-worker", "publisher": "Wired Productions", "release_date": "Mar 30 2023", "developers": ["Wolf & Wood Interactive"], "platforms": ["PC", "Switch", "Xbox Series X", "PlayStation 5"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/1660b06107ea717cb3f9d70b95c849b5-98.jpg", "descriptions": "The Last Worker is a first-person narrative adventure centered around our struggle in an increasingly automated world. Combining a hand-crafted art style with uniquely immersive gameplay mechanics in an epic setting, The Last Worker delivers an emotional, thought-provoking, and comedic storyThe Last Worker is a first-person narrative adventure centered around our struggle in an increasingly automated world. Combining a hand-crafted art style with uniquely immersive gameplay mechanics in an epic setting, The Last Worker delivers an emotional, thought-provoking, and comedic story packaged with rich characters performed by an all-star cast.… Expand"}, {"name": "Warhammer: Chaosbane", "details_link": "https://www.metacritic.com/game/xbox-one/warhammer-chaosbane", "publisher": "Bigben Interactive", "release_date": "May 31 2019", "developers": ["Games Workshop"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/c8e5edf135b9ae22793e9c286d9369ed-98.jpg", "descriptions": "In a world ravaged by war and dominated by magic, you must rise up to face the Chaos hordes. Playing solo or with up to four players in local or online co-op, choose a hero from four character classes and prepare for epic battles wielding some of the most powerful artefacts of the Old World."}, {"name": "Destiny: Rise of Iron", "details_link": "https://www.metacritic.com/game/xbox-one/destiny-rise-of-iron", "publisher": "Activision", "release_date": "Sep 20 2016", "developers": ["Bungie"], "platforms": ["PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/2/9fd9b844cd80fa44b22d7bc1e7f17107-98.jpg", "descriptions": "Destiny: Rise of Iron is the next expansion to the Destiny universe. It features an all new cinematic story campaign set within The Plaguelands, a brand new location on Earth. Under the command of Lord Saladin you will face a new faction of Fallen Devils, the Splicers, while unravelling theDestiny: Rise of Iron is the next expansion to the Destiny universe. It features an all new cinematic story campaign set within The Plaguelands, a brand new location on Earth. Under the command of Lord Saladin you will face a new faction of Fallen Devils, the Splicers, while unravelling the mystery of the Iron Lords. Rise of Iron features new weapons, armor, and gear, as well as a new cooperative three-player Strike, a new mode and maps for the Crucible competitive multiplayer, and an all new six-player cooperative Raid. [Activision]… Expand"}, {"name": "NBA Live 08", "details_link": "https://www.metacritic.com/game/playstation-3/nba-live-08", "publisher": "EA Sports", "release_date": "Oct  1 2007", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/377ab0f50b97d12c29cbca52a6bd4762-98.jpg", "descriptions": "Taking a page out of NBA Street Homecourt's book, NBA Live 08 introduces Quickstrike Ballhandling. This intuitive gameplay mechanic is mapped to the right analog stick and gives you the direct responsiveness you need to perform a full repertoire of ankle-breaking ball-handling moves that letTaking a page out of NBA Street Homecourt's book, NBA Live 08 introduces Quickstrike Ballhandling. This intuitive gameplay mechanic is mapped to the right analog stick and gives you the direct responsiveness you need to perform a full repertoire of ankle-breaking ball-handling moves that let you dominate on the perimeter. Pass the ball inside and win the battle in the post with all-new 'own the paint' post play for the big men down low. Use the new shot-countershot control to string together combos of fakes and shots to fool your defender into committing and create space for the game-defining bucket. NBA Live 08 introduces hot spots, where real NBA shot data is used to illuminate the locations on the floor where your players are most effective. Couple this with all-new signature go-to moves that capture the essence of the NBA's best, and you can now play the game on a console like you see it from the stands. [Electronic Arts]… Expand"}, {"name": "Rocket Arena", "details_link": "https://www.metacritic.com/game/pc/rocket-arena", "publisher": "Electronic Arts", "release_date": "Jul 14 2020", "developers": ["Final Strike Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/99d87e41b8f505f1ed0d35148c2454cd-98.jpg", "descriptions": "Welcome to a world where the rules are written in rocket fuel. Rockets control everything in Rocket Arena, an explosive 3v3 shooter where you’re never out of the action. Master your hero’s unique rockets and abilities to rule the arena and become a champion."}, {"name": "Late Shift", "details_link": "https://www.metacritic.com/game/switch/late-shift", "publisher": "Wales Interactive", "release_date": "Apr 26 2018", "developers": ["Wales Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/3ae4bb2cc22223363cb58fc00c99672e-98.jpg", "descriptions": "Late Shift is a high stakes FMV crime thriller. After being forced into the robbery of a lucrative auction house, mathematics student Matt is left proving his innocence in the brutal London heist. Your choices will have consequences from the very start, right through to the very end. One Late Shift is a high stakes FMV crime thriller. After being forced into the robbery of a lucrative auction house, mathematics student Matt is left proving his innocence in the brutal London heist. Your choices will have consequences from the very start, right through to the very end. One small decision could change the entire outcome in a choose-your-own-adventure style gameplay that can lead to one of seven conclusions.\r Written by the author of Sherlock Holmes (2009 film), experience a gripping live-action crime thriller with a total of over 180 decision points. Do you steal the car or do you run away? Do you follow orders or sabotage the plan? You'll have just seconds to decide as the film continues to roll with no pauses and no looping footage. … Expand"}, {"name": "Hybrid", "details_link": "https://www.metacritic.com/game/xbox-360/hybrid", "publisher": "Microsoft Game Studios", "release_date": "Aug  8 2012", "developers": ["5TH Cell"], "platforms": "Xbox 360", "num_players": "6  Online", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Tactical"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/94089c448e6c50a85709e2337d6e5dba-98.jpg", "descriptions": "Running at 60 FPS, Hybrid introduces intuitive flight-based cover-to-cover movements to create a unique shooter experience. Hybrid features character customization through upgradeable weapons, abilities, and upgrades with over 10 different maps and 6 unique game modes, and an offlineRunning at 60 FPS, Hybrid introduces intuitive flight-based cover-to-cover movements to create a unique shooter experience. Hybrid features character customization through upgradeable weapons, abilities, and upgrades with over 10 different maps and 6 unique game modes, and an offline practice arena. Set on Earth in the year 2032, the world was sent into turmoil when an alien species unexpectedly appears. Hybrid centers around a worldwide conflict between that species known as the Variant and a rebel human faction called Paladins. Players will be enveloped in a massive world war where every battle, in every district, factors into the status of the worldwide conflict and builds upon the unique persistent experience of Hybrid. [5th Cell]… Expand"}, {"name": "Dance Dance Revolution SuperNOVA", "details_link": "https://www.metacritic.com/game/playstation-2/dance-dance-revolution-supernova", "publisher": "Konami", "release_date": "Sep 26 2006", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/73830c0c089e92837f658be985dcd734-98.jpg", "descriptions": "(Also known as \"Dancing Stage SuperNOVA\" in the UK)  The hottest revolution and bestselling video game in the music game category returns to its arcade roots with Dance Dance Revolution SuperNOVA, the first arcade version to be released in North America in 6 years. Dance Dance Revolution(Also known as \"Dancing Stage SuperNOVA\" in the UK)  The hottest revolution and bestselling video game in the music game category returns to its arcade roots with Dance Dance Revolution SuperNOVA, the first arcade version to be released in North America in 6 years. Dance Dance Revolution SuperNOVA uses a completely new hardware engine and is the largest game in the series. Players will have access to over 300 songs from different musical genres and 2000+ dance step patterns. Dance Dance Revolution SuperNOVA is a brand new evolution in the DDR series and expands on every aspect of what made the original series innovative, fun and addictive. [Konami]… Expand"}, {"name": "Picross e", "details_link": "https://www.metacritic.com/game/3ds/picross-e", "publisher": "Jupiter Corporation", "release_date": "Jun 13 2013", "developers": ["Jupiter Corporation"], "platforms": "3DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/2e34fea05b7fbdc323efbb890828c02a-98.jpg", "descriptions": "Picross e features 150 puzzles of varying difficulties and dimensions."}, {"name": "Dishonored: Dunwall City Trials", "details_link": "https://www.metacritic.com/game/xbox-360/dishonored-dunwall-city-trials", "publisher": "Bethesda Softworks", "release_date": "Dec 11 2012", "developers": ["Arkane Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/581e68d98e6ab2e1402723f11aa42f53-98.jpg", "descriptions": "Dishonored: Dunwall City Trials, being released in December for $4.99 (or 400 Microsoft Points), will include 10 challenge maps that will test and track your combat, stealth and mobility skills. Ten distinct trials await challengers - including an arena battle against waves of enemy AI, aDishonored: Dunwall City Trials, being released in December for $4.99 (or 400 Microsoft Points), will include 10 challenge maps that will test and track your combat, stealth and mobility skills. Ten distinct trials await challengers - including an arena battle against waves of enemy AI, a gravity-defying run of drop assassinations, and a race against the clock. Dunwall City Trials also features a whole new set of achievements and trophies as well as a global online leaderboard that will establish the greatest assassins for each challenge.… Expand"}, {"name": "Dragon Ball Z: Supersonic Warriors", "details_link": "https://www.metacritic.com/game/game-boy-advance/dragon-ball-z-supersonic-warriors", "publisher": "Atari", "release_date": "Jun 22 2004", "developers": ["Arc System Works"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/f1b888fcdd9eb7d02f9f79198d43b5f9-98.jpg", "descriptions": "Dragon Ball Z: Supersonic Warriors takes the battle to the skies. You can fly at will as or against DBZ characters, including Goku, Vegeta, Cell, Frieza, and Buu. Engage in large tag-team battles and experience alternate endings to the DBZ story. Purchase fighting skills to enhance yourDragon Ball Z: Supersonic Warriors takes the battle to the skies. You can fly at will as or against DBZ characters, including Goku, Vegeta, Cell, Frieza, and Buu. Engage in large tag-team battles and experience alternate endings to the DBZ story. Purchase fighting skills to enhance your character's fighting moves and energy attacks. With the Game Boy Advance Link cable you can challenge your friend to a one-on-one match to see who the best is.… Expand"}, {"name": "Need for Speed: Hot Pursuit 2", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-hot-pursuit-2", "publisher": "Electronic Arts", "release_date": "Oct 21 2002", "developers": ["EA Seattle"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/e9f57443e0059b582f4bcb571c4025f6-98.jpg", "descriptions": "Become the \"Champion Road Racer\" by conquering numerous racing events, all carrying rewards such as: cars, tracks and high performance upgrades. The game challenges the driver to dodge traffic, police and natural elements in high speed and high style... true NFS style! Evade any copsBecome the \"Champion Road Racer\" by conquering numerous racing events, all carrying rewards such as: cars, tracks and high performance upgrades. The game challenges the driver to dodge traffic, police and natural elements in high speed and high style... true NFS style! Evade any cops encountered, as getting busted just might end your career. [Electronic Arts]… Expand"}, {"name": "RedCard 20-03", "details_link": "https://www.metacritic.com/game/playstation-2/redcard-20-03", "publisher": "Midway", "release_date": "Apr 16 2002", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/cf246008bb503873f95a89ea190fc690-98.jpg", "descriptions": "Finally, a videogame that understands soccer really is a contact sport. RedCard 20-03's unique adrenaline-style gameplay lets you kick, score, celebrate and tackle your way through 50 international teams all vying for the Cup Championship with 11-on-11 gameplay. Includes Finals Mode, aFinally, a videogame that understands soccer really is a contact sport. RedCard 20-03's unique adrenaline-style gameplay lets you kick, score, celebrate and tackle your way through 50 international teams all vying for the Cup Championship with 11-on-11 gameplay. Includes Finals Mode, a battle through 32 qualified national teams for the Cup Championship; World Conquest Mode, Friendly Mode, and Tournament Mode, where the battle for the Cup begins. [Midway]… Expand"}, {"name": "Sonic Adventure 2 Battle", "details_link": "https://www.metacritic.com/game/gamecube/sonic-adventure-2-battle", "publisher": "Sega", "release_date": "Feb 11 2002", "developers": ["Sonic Team"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/83790faf6abec68e9ffeb85ed53244d9-98.jpg", "descriptions": "Sonic and company are back and better than ever in Sonic Adventure 2: Battle.  Dr. Eggman is causing trouble once again, and it's up to Sonic, Tails, and Knuckles to stop him.  Experience faster action, all-new two-player games, and a branching storyline that lets you choose to save theSonic and company are back and better than ever in Sonic Adventure 2: Battle.  Dr. Eggman is causing trouble once again, and it's up to Sonic, Tails, and Knuckles to stop him.  Experience faster action, all-new two-player games, and a branching storyline that lets you choose to save the world as the Hero side, or conquer it as the Dark side.  In the single-player mode, you'll go through more than 30 unique stages, which include a forgotten pyramid, an abandoned military base, and a giant space station.  And then there's the expanded two-player mode, which features 12 playable characters competing in new head-to-head games.  … Expand"}, {"name": "Syphon Filter 3", "details_link": "https://www.metacritic.com/game/playstation/syphon-filter-3", "publisher": "SCEA", "release_date": "Nov  5 2001", "developers": ["Sony Bend"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 73, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/60ea4d94dc58762b4f15b88badc81e2d-98.jpg", "descriptions": "Syphon Filter 3 looks, plays, and feels more like an expansion pack for the previous games than a true sequel."}, {"name": "NFL GameDay 2001", "details_link": "https://www.metacritic.com/game/playstation/nfl-gameday-2001", "publisher": "SCEA", "release_date": "Oct 30 2000", "developers": ["989 Sports"], "platforms": ["PlayStation 2", "PlayStation"], "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/9bcd65a8a482d358468b3b152351a3b7-98.jpg", "descriptions": "In the end, GameDay 2001, aside from its obvious roster updates and a few minor additions, is totally identical to last year's title, which was a really good game."}, {"name": "4x4 Evolution", "details_link": "https://www.metacritic.com/game/pc/4x4-evolution", "publisher": "Gathering", "release_date": "Oct 29 2000", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-16 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/ff9a3c75a3b29ff4632f8177f430b89c-98.jpg", "descriptions": "A dynamic sim racer featuring rugged, customizable 4X4 vehicles. It's the first third-party game with online capabilities that will support connections between Sega Dreamcast, Mac, or PC versions, allowing players to compete head-to-head with one another regardless of platform.  [GatheringA dynamic sim racer featuring rugged, customizable 4X4 vehicles. It's the first third-party game with online capabilities that will support connections between Sega Dreamcast, Mac, or PC versions, allowing players to compete head-to-head with one another regardless of platform.  [Gathering of Developers]… Expand"}, {"name": "ESPN Winter X-Games Snowboarding", "details_link": "https://www.metacritic.com/game/playstation-2/espn-winter-x-games-snowboarding", "publisher": "Konami", "release_date": "Oct 24 2000", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/97f611f0b592c9bb1bd4b2081708c84b-98.jpg", "descriptions": "ESPN X Games-Snowboarding challenges players to test their skills in a variety of events and courses.  The game captures the realism of the sport with authentic ESPN graphics and stats of the biggest names in the sport."}]