[{"name": "Battlestations: Pacific", "details_link": "https://www.metacritic.com/game/xbox-360/battlestations-pacific", "publisher": "Eidos Interactive", "release_date": "May 12 2009", "developers": ["Eidos Interactive"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/cd583d970d1f909955dce30a2e26856c-98.jpg", "descriptions": "Battlestations: Pacific takes the action/strategy gameplay of Battlestations: Midway to the next level with more intense, strategic combat. Players can take to the skies and seas through two massive, action-packed campaigns across 28 missions, featuring some of the most decisive navalBattlestations: Pacific takes the action/strategy gameplay of Battlestations: Midway to the next level with more intense, strategic combat. Players can take to the skies and seas through two massive, action-packed campaigns across 28 missions, featuring some of the most decisive naval battles in history. A historically accurate U.S. campaign puts players in command of the U.S. Navy’s Pacific fleet through the Battles of Guadalcanal and on to Iwo Jima, Okinawa and victory. For the first time, players have a chance to rewrite history, commanding a Japanese campaign as the Imperial Japanese Navy from Pearl Harbor to Asia, Australia and beyond, expanding its empire throughout the Pacific Rim. Battlestations: Pacific takes the battle online with a massively enhanced multiplayer experience, offering five new and innovative co-op and team-based modes for up to eight players. ‘Siege’ and ‘Duel’ offer an all-out action experience, allowing players to control a selection of war machines as each side battles to turn the tide of war; joining forces for ‘Competitive’, players compete side-by-side against the opposing AI forces; ‘Escort’ allows for a mix of action and strategy, with players escorting or attacking a key naval unit as it heads to its destination; and ‘Island Capture’ offers a compelling strategic experience, with players not only battling for supremacy of the seas, but also capturing and controlling the island archipelago. [Eidos Interactive]… Expand"}, {"name": "Manhunt", "details_link": "https://www.metacritic.com/game/playstation-2/manhunt", "publisher": "Rockstar Games", "release_date": "Nov 18 2003", "developers": ["Rockstar North"], "platforms": ["PC", "PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 76, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/cfbcb30fc548e29af313f902121b3130-98.jpg", "descriptions": "They just killed Cash. Now, they want to kill him again. America is full of run down, broken rust-belt towns where nobody cares and anything goes. In Carcer City, nothing matters anymore and all that's left are cheap thrills. The ultimate rush is the power to grant life and take it away, forThey just killed Cash. Now, they want to kill him again. America is full of run down, broken rust-belt towns where nobody cares and anything goes. In Carcer City, nothing matters anymore and all that's left are cheap thrills. The ultimate rush is the power to grant life and take it away, for sport. This time James Earl Cash, you are the sport. They gave you your life back. Now, they are going to hunt you down. You awake to the sound of your own panicked breath. You must run, hide and fight to survive. If you can stay alive long enough, you may find out who did this to you. This is a brutal blood sport. [Rockstar]… Expand"}, {"name": "Necrobarista: Final Pour", "details_link": "https://www.metacritic.com/game/switch/necrobarista-final-pour", "publisher": "Playism", "release_date": "Aug 11 2021", "developers": ["Coconut Island Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Visual Novel"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/b4723b7b79658e8537879b5eb49c3eb3-98.jpg", "descriptions": "Discover a tale of mystery, magic, and, depending on who asks, the best/worst coffee around. Hidden in an unassuming alleyway lies The Terminal, a café that serves as a waypoint between the lands of the living and the dead, where any one of the patrons could be a spirit from beyond. WithDiscover a tale of mystery, magic, and, depending on who asks, the best/worst coffee around. Hidden in an unassuming alleyway lies The Terminal, a café that serves as a waypoint between the lands of the living and the dead, where any one of the patrons could be a spirit from beyond. With strict rules defining how long ghosts can spend in the corporeal realm before being forced to pass on, running this café is more complicated than your typical Melbourne coffeehouse. Apprentice necromancer Maddy has just taken ownership of The Terminal and all its magical responsibilities. Follow her story and those of mechanics-obsessed teen Ashley, infamous Australian outlaw Ned Kelly, exasperated necromancer Chay, and a cast of other colorful characters through their dark pasts and the secrets behind the place linking them all together.… Expand"}, {"name": "Call of Duty: Black Ops Cold War", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-black-ops-cold-war", "publisher": "Activision", "release_date": "Nov 13 2020", "developers": ["Raven Software", "Treyarch"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 76, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/6/132c8b076fcffe943c4b51a6bf804a10-98.jpg", "descriptions": "Black Ops Cold War will drop fans into the depths of the Cold War's volatile geopolitical battle of the early 1980s. Nothing is ever as it seems in a gripping single-player Campaign, where players will come face-to-face with historical figures and hard truths, as they battle around the globeBlack Ops Cold War will drop fans into the depths of the Cold War's volatile geopolitical battle of the early 1980s. Nothing is ever as it seems in a gripping single-player Campaign, where players will come face-to-face with historical figures and hard truths, as they battle around the globe through iconic locales like East Berlin, Vietnam, Turkey, Soviet KGB headquarters, and more.\r MULTIPLAYER\rEngage in deniable operations and signature combat in the next generation of Multiplayer.\r ZOMBIES\rPlayers will bring a Cold War arsenal of weapons and equipment into the next evolution of Treyarch's signature Zombies co-operative experience. \r\rWARZONE\rBlack Ops Cold War will also support and build on the hit, free-to-play experience Call of Duty: Warzone. \r\rCross Play, Cross-Progression and Cross-Generation Enabled. \r\rNEXT-GEN\rUnlock the power of next-gen Call of Duty experiences with higher framerate, hardware-based ray-tracing, shorter load times and more.… Expand"}, {"name": "Stirring Abyss", "details_link": "https://www.metacritic.com/game/pc/stirring-abyss", "publisher": "Slitherine", "release_date": "Oct 29 2020", "developers": ["Sleepy Sentry"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/1c5cb6e7f02ac011deb4e83fd2c8bef9-98.jpg", "descriptions": "Stirring Abyss is an indie tactical squad-based game with strong RPG elements in which you uncover the ancient mysteries of the depths depicted in the classic vein of Lovecraftian horror."}, {"name": "The Swords of Ditto: Mormo's Curse", "details_link": "https://www.metacritic.com/game/switch/the-swords-of-ditto-mormos-curse", "publisher": "Devolver Digital", "release_date": "May  2 2019", "developers": ["One Bit Beyond"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/18b716ba54b72b401a41860c8b000144-98.jpg", "descriptions": "The Swords of Ditto: Mormo's Curse is a compact action RPG that creates a unique adventure for each new hero of legend in the relentless fight against the evil Mormo. Explore a delightful but dangerous overworld, brave menacing dungeons, and improve your hero in a charming village, duringThe Swords of Ditto: Mormo's Curse is a compact action RPG that creates a unique adventure for each new hero of legend in the relentless fight against the evil Mormo. Explore a delightful but dangerous overworld, brave menacing dungeons, and improve your hero in a charming village, during your quest to overcome the evil that plagues the island. Unleash the mystical Sword of Ditto and grab a co-op friend for an unforgettable adventure filled with delightful characters, extraordinary loot, and heroic battles.… Expand"}, {"name": "Battlestar Galactica Deadlock", "details_link": "https://www.metacritic.com/game/playstation-4/battlestar-galactica-deadlock", "publisher": "Slitherine Software", "release_date": "Dec  8 2017", "developers": ["Black Lab Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General", "4X"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/36642ea44a7fc43b75ec0b137da8e5ad-98.jpg", "descriptions": "Four years of war and a steep price in human lives have not been enough to unlock a deadly stalemate. The Colonials have countered all of the Cylon’s offensives so far, but no decisive victory was achieved. The deadlock is suddenly broken by a surprise attack from the Cylons and the brutalFour years of war and a steep price in human lives have not been enough to unlock a deadly stalemate. The Colonials have countered all of the Cylon’s offensives so far, but no decisive victory was achieved. The deadlock is suddenly broken by a surprise attack from the Cylons and the brutal annihilation of the Colonial Fleet High Command on Picon. The fate of mankind is now resting on the shoulders of Rear-Admiral Lucinda Cain. The secret, cunning plan she has conceived could turn the tide of the war forever… [Playstation.com]… Expand"}, {"name": "Serious Sam's Bogus Detour", "details_link": "https://www.metacritic.com/game/pc/serious-sams-bogus-detour", "publisher": "Devolver Digital", "release_date": "Jun 20 2017", "developers": ["Crackshell"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/4ef4dc91af6f4e1e3fb0c2636597c420-98.jpg", "descriptions": "Serious Sam’s Bogus Detour is a new action-adventure in the Serious Sam saga from Hammerwatch developer Crackshell. Battle through Mediterranean locales, dangerous biological weapons labs and even high-tech moon bases as a one-man wrecking crew or in four-player online cooperative forSerious Sam’s Bogus Detour is a new action-adventure in the Serious Sam saga from Hammerwatch developer Crackshell. Battle through Mediterranean locales, dangerous biological weapons labs and even high-tech moon bases as a one-man wrecking crew or in four-player online cooperative for maximum chaos. Dominate the chaotic Survival and Versus modes or make your own mods, modes, and even total conversions with the include game editor.… Expand"}, {"name": "LEGO Star Wars: The Force Awakens", "details_link": "https://www.metacritic.com/game/xbox-one/lego-star-wars-the-force-awakens", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 28 2016", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/ead23f9780fa512b5e0654fdd59572a2-98.jpg", "descriptions": "Experience untold adventures set before Star Wars: The Force Awakens through exclusive new story levels that takes place between Star Wars: Return of the Jedi and the new film. Play as all of the heroic characters from the movie, including Rey, Finn, Poe Dameron, Han Solo, Chewbacca, C-3PO,Experience untold adventures set before Star Wars: The Force Awakens through exclusive new story levels that takes place between Star Wars: Return of the Jedi and the new film. Play as all of the heroic characters from the movie, including Rey, Finn, Poe Dameron, Han Solo, Chewbacca, C-3PO, and BB-8, as well as Kylo Ren, General Hux and Captain Phasma, while exploring classic Star Wars locales, such as Jakku and Starkiller Base, and utilizing a multitude of vehicles along the way. [LEGO]… Expand"}, {"name": "Atelier Shallie: Alchemists of the Dusk Sea", "details_link": "https://www.metacritic.com/game/playstation-3/atelier-shallie-alchemists-of-the-dusk-sea", "publisher": "Koei Tecmo Games", "release_date": "Mar 10 2015", "developers": ["Gust"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/aad65cc460ad6bbf95515969653a0c65-98.jpg", "descriptions": "Atelier Shallie: Alchemists of the Dusk Sea closes the final chapter in the Atelier Dusk series. The battle system incorporates strategy and speed, the time management system is free from restrictions allowing for unlimited play time and Alchemy RPG fans can look forward to a straightforwardAtelier Shallie: Alchemists of the Dusk Sea closes the final chapter in the Atelier Dusk series. The battle system incorporates strategy and speed, the time management system is free from restrictions allowing for unlimited play time and Alchemy RPG fans can look forward to a straightforward menu in the engaging Synthesis system. In Atelier Shallie: Alchemists of the Dusk Sea players choose to play as either the reserved, mission-focused Shallistera, daughter of a tribal leader who embarks on voyage to find a solution to a crisis affecting her homeland, on behalf of her ailing father or ambitious, energetic Shallotte, who has been struggling to bring success to the alchemy workshop since the passing of her father. While their personalities and appearance are drastically different, they both share the nickname \"Shallie\" and uncover the reasoning why along each of their journeys— the dual main character system has been improved with separate stories and multiple endings for Shallistera and Shallotte. [KEOI Tecmo]… Expand"}, {"name": "The Lost Chronicles of Zerzura", "details_link": "https://www.metacritic.com/game/pc/the-lost-chronicles-of-zerzura", "publisher": "Viva Media", "release_date": "Jul 10 2014", "developers": ["Cranberry Production"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/b32157e849a20872c79e330830de7b05-98.jpg", "descriptions": null}, {"name": "Nancy Drew: Warnings at Waverly Academy", "details_link": "https://www.metacritic.com/game/pc/nancy-drew-warnings-at-waverly-academy", "publisher": "Her Interactive", "release_date": "Oct 13 2009", "developers": ["Her Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/801814f74cf1a1a5de8e11bfc9054baf-98.jpg", "descriptions": "You, as Nancy Drew, are undercover at a prestigious girls' boarding school to discover the culprit behind threatening notes and dangerous accidents aimed at its valedictorian candidates! Is there a secret someone wants to protect or are the malicious pranks intended to scare away theYou, as Nancy Drew, are undercover at a prestigious girls' boarding school to discover the culprit behind threatening notes and dangerous accidents aimed at its valedictorian candidates! Is there a secret someone wants to protect or are the malicious pranks intended to scare away the competition - permanently? Solve the mystery before the threats turn deadly and you're expelled from the case! [Her Interactive]… Expand"}, {"name": "Race Driver: Create & Race", "details_link": "https://www.metacritic.com/game/ds/race-driver-create-race", "publisher": "Codemasters", "release_date": "Oct  2 2007", "developers": ["Firebrand Games"], "platforms": "DS", "num_players": "4  Online", "genres": ["Driving", "Racing", "Simulation", "General", "General", "Automobile"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/6412cfc44bc704b5229f11ff020c361f-98.jpg", "descriptions": "Race Driver: Create and Race has been designed from the ground up for Nintendo DS and lets players thrash the most formidable sports cars through closely-fought races on the world's most prestigious circuits... and then lets players create their own circuits with a full track constructionRace Driver: Create and Race has been designed from the ground up for Nintendo DS and lets players thrash the most formidable sports cars through closely-fought races on the world's most prestigious circuits... and then lets players create their own circuits with a full track construction kit. Using the DS stylus, the game's track editor lets players select and place race track elements, such as hairpin corners, long straights and chicanes, to design unique circuits. Once all the pieces are placed to perfection, players can take to their track and experience exactly what it's like in aggressive multiple car races. In addition to the track editor, the game features 32 real-world circuits – from Silverstone and the Nurburgring to Bathurst – and 25 officially licensed race cars, including the AMG Mercedes C Klasse D, and the Chevrolet Silverado Truck. Making use of the Nintendo DS Wi-Fi connection capabilities, players can challenge others to races on the game's official tracks as well as the circuits of their creation. Race Driver: Create and Race also enables up to four players to go head-to-head in races gamesharing from only one cartridge. Further championships and cars can be unlocked from the World Tour Mode and then raced in realtime online and ad hoc multiplayer modes. [Codemasters]… Expand"}, {"name": "Overlord", "details_link": "https://www.metacritic.com/game/xbox-360/overlord", "publisher": "Codemasters", "release_date": "Jun 26 2007", "developers": ["Triumph Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "2  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/4b2a65a1a84c76f66ae61d76258ac8d7-98.jpg", "descriptions": "Controlling a mysterious figure that has inherited the legacy of the evil, long-dead Overlord, the player emerges, near death, from the ruins of the old Overlord's Dark Tower. Only the player's actions determine if they will rise to become the new all-powerful Overlord; it's all down to howControlling a mysterious figure that has inherited the legacy of the evil, long-dead Overlord, the player emerges, near death, from the ruins of the old Overlord's Dark Tower. Only the player's actions determine if they will rise to become the new all-powerful Overlord; it's all down to how much of a bad ass they want to be in order to succeed...evil or really evil! Played out with plenty of black humour and dark irony, the game immerses players in twisted parodies of classic fantasy scenarios and characters. Overlord's key innovation is the introduction of an array of impish creatures – the Minions. They believe you are the old Overlord reborn and will use their unique skills to fetch, fight and die for you. Throughout the game players actively control a horde of these gremlin-like critters and they follow your every instruction no matter how despotic or, for the Minions, life threatening it is. [Codemasters]… Expand"}, {"name": "Burnout Dominator", "details_link": "https://www.metacritic.com/game/psp/burnout-dominator", "publisher": "Electronic Arts", "release_date": "Mar  6 2007", "developers": ["Criterion Games"], "platforms": ["PlayStation 2", "PSP"], "num_players": "Up to 6 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/2c3fbbbc75a50e4eef41c2a42ea77288-98.jpg", "descriptions": "Burnout Dominator is the next installment in the legendary Burnout series, loaded with intense racing action and dozens of retina-searing World Tour events. Burnout Dominator challenges gamers to face off against a series of hot-blooded rivals in brutal tests of aggressive driving techniquesBurnout Dominator is the next installment in the legendary Burnout series, loaded with intense racing action and dozens of retina-searing World Tour events. Burnout Dominator challenges gamers to face off against a series of hot-blooded rivals in brutal tests of aggressive driving techniques where performing burnouts gives you the advantage and multiplies your score potential. For the ultimate nerve-wracking experience, Burnout Dominator takes you to the very edge of control, punishing the smallest mistakes and rewarding drivers for taking outrageous risks. [Electronic Arts]… Expand"}, {"name": "Mega Man ZX", "details_link": "https://www.metacritic.com/game/ds/mega-man-zx", "publisher": "Capcom", "release_date": "Sep 12 2006", "developers": ["Inti Creates"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 76, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/5ba54ddcd885f2fe76c2f5e90142c484-98.jpg", "descriptions": "Players assume the role of either a human male character named Vent or his female counterpart, Aile, who are employees of the Girouette Express, a courier service that takes jobs transporting anything to anywhere. On a job accompanying their boss, Girouette, to transport a package containingPlayers assume the role of either a human male character named Vent or his female counterpart, Aile, who are employees of the Girouette Express, a courier service that takes jobs transporting anything to anywhere. On a job accompanying their boss, Girouette, to transport a package containing Model X and Model Z Biometals, they are attacked by a mysterious group of Mavericks who seeks to take the material for themselves. During the scuffle, the Model X Biometal is absorbed into the main character, causing a transformation into Model X form while the Model Z Biometal fuses with Girouette. Facing innumerable enemies, Girouette lends his newfound power to his employee and the two substances combine to form Model ZX. With powerful abilities at their disposal, they must discover who the menacing enemies are and what they are ultimately after. [Capcom]… Expand"}, {"name": "Full Throttle Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/full-throttle-remastered", "publisher": "Double Fine Productions", "release_date": "Apr 18 2017", "developers": ["Double Fine Productions"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/bf625cca24cc32b5747194c0c52ed3f8-98.jpg", "descriptions": "Released by LucasArts in 1995, Full Throttle is a classic graphic adventure game from Tim Schafer, telling the story of Ben Throttle butt-kicking leader of biker gang the Polecats, who gets caught up in a tale of Motorcycles, Mayhem and Murder. Now over 20 years later, Full Throttle is backReleased by LucasArts in 1995, Full Throttle is a classic graphic adventure game from Tim Schafer, telling the story of Ben Throttle butt-kicking leader of biker gang the Polecats, who gets caught up in a tale of Motorcycles, Mayhem and Murder. Now over 20 years later, Full Throttle is back in a remastered edition featuring all new hand-drawn and 3D high-resolution artwork, with remastered audio and music.\rPlayers can switch back and forth between classic and remastered modes, and mix and match audio, graphics and user interface to their heart’s desire. The've also included a concept art browser, and recorded a commentary track with the game’s original creators. [Playstation.com]… Expand"}, {"name": "Battalion Wars", "details_link": "https://www.metacritic.com/game/gamecube/battalion-wars", "publisher": "Nintendo", "release_date": "Sep 19 2005", "developers": ["Kuju Entertainment"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/0e81eb0b52aae8912e3d0b3fa7fb2258-98.jpg", "descriptions": "A global conflict has reached a stalemate in the console version of the Game Boy Advance series Advance Wars. The evil Kaiser Vlad, seeking to take advantage of the standoff, has assembled an army of shock troops, forcing The Western Frontier and the Tundran Territories to ally and fightA global conflict has reached a stalemate in the console version of the Game Boy Advance series Advance Wars. The evil Kaiser Vlad, seeking to take advantage of the standoff, has assembled an army of shock troops, forcing The Western Frontier and the Tundran Territories to ally and fight back. Battalion Wars is a real-time strategy game that lets you control teams of soldiers and vehicles and lead them through more than 20 missions, using a variety of weapons and tactics.… Expand"}, {"name": "Super Mario Strikers", "details_link": "https://www.metacritic.com/game/gamecube/super-mario-strikers", "publisher": "Nintendo", "release_date": "Dec  5 2005", "developers": ["Next Level Games"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/12eff0808c13f0c80dfcdc665391a3dc-98.jpg", "descriptions": "Nintendo's foray into sports titles continues with Super Mario Strikers, a new soccer game that's unlike anything ever to hit the pitch. Whether players are freezing their opponents with an ice-cold shell, unleashing a spiny shell on their hapless opponents or making entire teams flee inNintendo's foray into sports titles continues with Super Mario Strikers, a new soccer game that's unlike anything ever to hit the pitch. Whether players are freezing their opponents with an ice-cold shell, unleashing a spiny shell on their hapless opponents or making entire teams flee in terror with a roving Chain Chomp, they're sure to see something new around every corner kick. Super Mario Strikers features all the favorite characters from the Nintendo universe, as well as four-person multiplayer action that will have players and their friends cheering all night long. Get ready for the world cup of gaming.… Expand"}, {"name": "Mario Superstar Baseball", "details_link": "https://www.metacritic.com/game/gamecube/mario-superstar-baseball", "publisher": "Nintendo", "release_date": "Aug 29 2005", "developers": ["Namco"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/49db8bacdc102ba1557246afa68c1bd1-98.jpg", "descriptions": "Continuing the tradition started by such games as Mario Power Tennis and Mario Golf: Toadstool Tour, Mario Baseball lets you play in arcade-style baseball. You can clear all the trials in Challenge mode, or sit down for a game in the Toy Field. With multiplayer options for up to fourContinuing the tradition started by such games as Mario Power Tennis and Mario Golf: Toadstool Tour, Mario Baseball lets you play in arcade-style baseball. You can clear all the trials in Challenge mode, or sit down for a game in the Toy Field. With multiplayer options for up to four players, wild, character-specific power moves, intense minigames, and more than 50 characters from the Mario universe, Mario Baseball offers a complete arcade baseball experience.… Expand"}, {"name": "Mortal Shell", "details_link": "https://www.metacritic.com/game/playstation-4/mortal-shell", "publisher": "Playstack", "release_date": "Aug 18 2020", "developers": ["Cold Symmetry"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/5bd48f2f9cec73e2bf595fc6b4c199a4-98.jpg", "descriptions": "Mortal Shell is a deep action-RPG that tests your sanity and resilience in a shattered world. Your adversaries spare no mercy, with survival demanding superior awareness and precision. Possess lost warriors, discover hidden sanctums, and face formidable foes."}, {"name": "Rad", "details_link": "https://www.metacritic.com/game/xbox-one/rad", "publisher": "Bandai Namco Games", "release_date": "Aug 20 2019", "developers": ["Double Fine Productions"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Action Adventure", "General"], "meta_score": 76, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/c88359da37baafe2b24a1ef92849c96c-98.jpg", "descriptions": "RAD is a 3D action rogue-like set in a post-post-apocalyptic world, where humanity has faced armageddon not once, but twice."}, {"name": "Prototype 2", "details_link": "https://www.metacritic.com/game/pc/prototype-2", "publisher": "Activision", "release_date": "Jul 24 2012", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "Open-World"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/da4f8bc93ec0d3795829c10b2a4c87aa-98.jpg", "descriptions": "Behold New York Zero. Prototype 2 extends the experience of becoming the ultimate shape-shifting weapon. A vicious viral outbreak has killed Sgt James Heller’s family and transformed him into a PROTOTYPE. Powered by revolutionary shapeshifting powers, you must hunt, kill and consume your wayBehold New York Zero. Prototype 2 extends the experience of becoming the ultimate shape-shifting weapon. A vicious viral outbreak has killed Sgt James Heller’s family and transformed him into a PROTOTYPE. Powered by revolutionary shapeshifting powers, you must hunt, kill and consume your way across the ravaged wasteland of New York Zero to take revenge on the man responsible: Alex Mercer.… Expand"}, {"name": "Mass Effect: Andromeda", "details_link": "https://www.metacritic.com/game/xbox-one/mass-effect-andromeda", "publisher": "Electronic Arts", "release_date": "Mar 21 2017", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/b8e782cad15a4e43819f76656c6ebb50-98.jpg", "descriptions": "The story opens after a 600-year journey to the Andromeda galaxy, as the crew begins searching for a new home for humanity. The dreams of easy settlement are quickly shattered, as worlds expected to be paradises are instead wastelands, and the Pathfinder discovers that not all inhabitants ofThe story opens after a 600-year journey to the Andromeda galaxy, as the crew begins searching for a new home for humanity. The dreams of easy settlement are quickly shattered, as worlds expected to be paradises are instead wastelands, and the Pathfinder discovers that not all inhabitants of the galaxy welcome humanity. Terrifying enemies will challenge players and their crew, forcing them to utilize destructible environments, vertical movement through boosted jumps, customizable weapons, Biotics and other tools in their arsenal to even the playing field in a combat system and character progression that is more thrilling and open than ever. Mass Effect: Andromeda also features a separate team-based online multiplayer mode where players can engage in fast, fluid and frenetic combat to work together and achieve success. Utilizing combat skills, strategies, weapons and abilities gained from the field, players must coordinate to take down overwhelming forces. [Electronic Arts]… Expand"}, {"name": "Coffee Talk", "details_link": "https://www.metacritic.com/game/pc/coffee-talk", "publisher": "Toge Productions", "release_date": "Jan 29 2020", "developers": ["Toge Productions"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/cd0c1a1761b6f912578484df575d9f9a-98.jpg", "descriptions": "Coffee Talk is a coffee brewing and heart-to-heart talking simulator about listening to fantasy-inspired modern peoples’ problems, and helping them by serving up a warm drink or two. Immerse yourself in the stories of alternative-Seattle inhabitants that modern readers will find stronglyCoffee Talk is a coffee brewing and heart-to-heart talking simulator about listening to fantasy-inspired modern peoples’ problems, and helping them by serving up a warm drink or two. Immerse yourself in the stories of alternative-Seattle inhabitants that modern readers will find strongly echo the world around them.… Expand"}, {"name": "Assassin's Creed: Brotherhood - The Da Vinci Disappearance", "details_link": "https://www.metacritic.com/game/playstation-3/assassins-creed-brotherhood---the-da-vinci-disappearance", "publisher": "Ubisoft", "release_date": "Mar  8 2011", "developers": ["Ubisoft Montreal"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/d8e9c44ae8de2781d9456dd070202f39-98.jpg", "descriptions": "The Da Vinci Disappearance will include both single-player and multiplayer content for Assassin's Creed Brotherhood. After the fall of the Borgias in Rome, Leonardo Da Vinci is kidnapped by the Hermeticists, an underground cult dedicated to transforming mankind. Ezio will embark on aThe Da Vinci Disappearance will include both single-player and multiplayer content for Assassin's Creed Brotherhood. After the fall of the Borgias in Rome, Leonardo Da Vinci is kidnapped by the Hermeticists, an underground cult dedicated to transforming mankind. Ezio will embark on a relentless quest to recover stolen paintings in order to find Leo before it is too late, discovering two new locations and two new gameplay features along the way.… Expand"}, {"name": "Wallace & Gromit's Grand Adventures, Episode 1: Fright of the Bumblebees", "details_link": "https://www.metacritic.com/game/pc/wallace-gromits-grand-adventures-episode-1-fright-of-the-bumblebees", "publisher": "Telltale Games", "release_date": "Mar 23 2009", "developers": ["Telltale Games"], "platforms": ["Xbox 360", "PC"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/5c9cd8967e2454ec56cd976dde34d9f4-98.jpg", "descriptions": "[Xbox Live Arcade]  Enter the colorful world of West Wallaby Street in the first of four cracking adventures in Wallace & Gromit Episode 1: Fright of the Bumblebees. In this first episode, the inventor and his loyal pooch are faced with a big problem. They need 50 gallons of honey by tonight[Xbox Live Arcade]  Enter the colorful world of West Wallaby Street in the first of four cracking adventures in Wallace & Gromit Episode 1: Fright of the Bumblebees. In this first episode, the inventor and his loyal pooch are faced with a big problem. They need 50 gallons of honey by tonight - far more than their bees can handle. When Wallace's plans to step up production go horribly awry, it falls to Gromit to fight off the angry swarm. Featuring a brand new story with the same slapstick humour, cinematic visuals, and charm that fans of the Wallace & Gromit films have come to love, Fright of the Bumblebees kicks off this four-episode series in cracking style. [TellTale]… Expand"}, {"name": "Order Up!", "details_link": "https://www.metacritic.com/game/wii/order-up!", "publisher": "Zoo Games", "release_date": "Jul 22 2008", "developers": ["SuperVillain Studios"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "Miscellaneous", "General", "General", "General", "Virtual", "Career"], "meta_score": 76, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/dd60930a2b55cc8d937407f91ac7acf2-98.jpg", "descriptions": "Welcome to Port Abello, one of the most important locations on the culinary map. As the town’s newest upcoming, chef you have a lot to prove. After learning your trade in a local fast food joint, you decide to buy your own local diner. But being the proud owner of your own restaurant isn'tWelcome to Port Abello, one of the most important locations on the culinary map. As the town’s newest upcoming, chef you have a lot to prove. After learning your trade in a local fast food joint, you decide to buy your own local diner. But being the proud owner of your own restaurant isn't your only goal. The Fortified Chef Competition is about to visit town and winning it would launch you to the centre of the culinary stage. On your journey you'll become master of all types of fare until you own your a World Class eating establishment. With the Wiimote in hand, you'll be taught every aspect of running a kitchen from burgers to chateaubriand using the Wii’s motion sensing technology to simulate cooking, with real kitchen tools like knives, wooden spoons, tongs, spatulas and more. [Zoo Digital]… Expand"}, {"name": "Mercenary Kings", "details_link": "https://www.metacritic.com/game/pc/mercenary-kings", "publisher": "Tribute Games", "release_date": "Jul 22 2013", "developers": ["Tribute Games", "Tribute Games Inc."], "platforms": ["PlayStation 4", "PC"], "genres": ["General", "Action", "General", "Shooter", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/5d2d4cf8b0845f1f3c3a2a8b945e169c-98.jpg", "descriptions": "Craft your arsenal to avenge your fallen comrades and save the world from the fearsome forces of CLAW. Save the world. In this frantic 2D action game, you are part of the Mercenary Kings, the most skilled team of warriors-for-hire on Earth. When your comrades have fallen and the fearsomeCraft your arsenal to avenge your fallen comrades and save the world from the fearsome forces of CLAW. Save the world. In this frantic 2D action game, you are part of the Mercenary Kings, the most skilled team of warriors-for-hire on Earth. When your comrades have fallen and the fearsome forces of CLAW have seized an island-wide top secret Laboratory Base, you must do what it takes to stop them. But you're not going in unprepared - as backup you've got a crew of rogue geniuses and experts in their field. Able to craft and customize guns'n'blades or upgrade your body armour, you've never been this ready to join the fight.… Expand"}, {"name": "Din's Curse", "details_link": "https://www.metacritic.com/game/pc/dins-curse", "publisher": "Soldak Entertainment", "release_date": "Mar 31 2010", "developers": ["Soldak Entertainment"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/9d2aa8335594e9d6aff853f3396abc95-98.jpg", "descriptions": "Din's Curse is a single player and co-op multiplayer action RPG with 141 class combinations, infinite number of dynamically generated towns, real consequences, and a dynamic, evolving world. Din, champion of the gods, has cursed you into a second life of service because you selfishlyDin's Curse is a single player and co-op multiplayer action RPG with 141 class combinations, infinite number of dynamically generated towns, real consequences, and a dynamic, evolving world. Din, champion of the gods, has cursed you into a second life of service because you selfishly squandered your first one while causing misfortune to those around you. To redeem yourself, you must impress Din by building a reputation for helping others. Travel the spacious western plains of Aleria and save desperate towns from the brink of annihilation. Until you're redeemed, you're doomed to wander the earth alone for all eternity. In Din's Curse, you will explore an extensive underground, slaying dangerous monsters, solving dynamic quests, dodging deadly traps, and in your spare time, plundering loot. Quell uprisings, flush out traitors, kill assassins, cure plagues, purge curses, end wars, and complete other dangerous quests or the danger WILL escalate. Not all is as it seems though, traitors will gladly stab you in the back, renegades can revolt against the town, spies can set up ambushes, and items might even curse or possess your friends. [Soldak Entertainment]… Expand"}, {"name": "Hyrule Warriors", "details_link": "https://www.metacritic.com/game/wii-u/hyrule-warriors", "publisher": "Nintendo", "release_date": "Sep 26 2014", "developers": ["Omega Force"], "platforms": ["3DS", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/8149cf1701461b15329ae105590adffb-98.jpg", "descriptions": "The delicate balance of the Triforce has been disrupted, and Hyrule Kingdom is once again being torn apart by a dark power, this time lead by Sorceress Cia. Now its up to the legendary hero Link to face hordes of enemies and find the missing Princess Zelda. Advance the story to unlock newThe delicate balance of the Triforce has been disrupted, and Hyrule Kingdom is once again being torn apart by a dark power, this time lead by Sorceress Cia. Now its up to the legendary hero Link to face hordes of enemies and find the missing Princess Zelda. Advance the story to unlock new playable characters with unique moves and weapon types. Collect Rupees and other useful items to upgrade weapons and craft badges, which you can use to bolster each warriors abilities. Then unleash the full power of your attacks with intense combos to clear wave after wave of Bokoblin hordes. Youll have to get your gloves dirty to save Hyrule this time.\r *    Play as fan-favorite characters like Link and Impa for the first time in the series!\r*    Battle the fiercest Legend of Zelda enemies across Hyrules most famous locales.\r*    Lay waste to your opponents with brutally efficient attacks and intense combos\r*    Think tactically and complete missions in the most efficient way possible… Expand"}, {"name": "Stuntman: Ignition", "details_link": "https://www.metacritic.com/game/playstation-3/stuntman-ignition", "publisher": "THQ", "release_date": "Sep 17 2007", "developers": ["Paradigm Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 76, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/9f7b5653b1b42d6a645678ed2c62c6a3-98.jpg", "descriptions": "Stuntman: Ignition is the next installment in the Stuntman franchise. The game plunges gamers into the adrenaline-fueled role of a Hollywood stunt driver, challenging them to pull off the most breathtaking, death-defying stunts ever filmed. Players showcase their skills in a wide variety ofStuntman: Ignition is the next installment in the Stuntman franchise. The game plunges gamers into the adrenaline-fueled role of a Hollywood stunt driver, challenging them to pull off the most breathtaking, death-defying stunts ever filmed. Players showcase their skills in a wide variety of big-budget action films, commercial shoots and tournaments while commanding more than 25 unique vehicles, including exotic sports cars, motorcycles and hovercraft. Online multiplayer allows rival stuntmen to battle it out on the film sets and custom built back-lot arenas, or players can devise their own insane stunt runs and challenge other stuntmen at their own game. [THQ]… Expand"}, {"name": "Wraith: The Oblivion - Afterlife", "details_link": "https://www.metacritic.com/game/pc/wraith-the-oblivion---afterlife", "publisher": "Fast Travel Games", "release_date": "Apr 22 2021", "developers": ["Fast Travel Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/dbb31f8578482c7eb6da340c58783969-98.jpg", "descriptions": "You died in a mysterious seance and have become a Wraith, one of the restless undead. In this VR horror game, use your supernatural abilities to solve the mystery behind your death. But beware of the sinister Spectres lurking in the shadows..."}, {"name": "ShootMania Storm", "details_link": "https://www.metacritic.com/game/pc/shootmania-storm", "publisher": "Ubisoft", "release_date": "Apr 10 2013", "developers": ["Nadeo"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Arcade"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/bffe1650b850955927e71a136e3f66fb-98.jpg", "descriptions": "ShootMania is a first person shooter by Nadeo."}, {"name": "Klonoa Phantasy Reverie Series", "details_link": "https://www.metacritic.com/game/pc/klonoa-phantasy-reverie-series", "publisher": "Bandai Namco Games", "release_date": "Jul  8 2022", "developers": ["Bandai Namco Games", "MONKEYCRAFT Co. Ltd."], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/3489f19b2adccb5a1330c87fc1f4d331-98.jpg", "descriptions": "Klonoa Phantasy Reverie Series brings back \"Klonoa: Door to Phantomile\" and \"Klonoa 2: Lunatea's Veil\" remastered in one collection to fans new and old. Get ready to set off on an adventure to save the world. Released initially in 1997 by Namco, Klonoa is a side-scrolling platformerKlonoa Phantasy Reverie Series brings back \"Klonoa: Door to Phantomile\" and \"Klonoa 2: Lunatea's Veil\" remastered in one collection to fans new and old. Get ready to set off on an adventure to save the world. Released initially in 1997 by Namco, Klonoa is a side-scrolling platformer featuring a colorful character roster and vibrant game world, it's up to you as Klonoa to embark on a journey to save Phantomile. For the franchise's momentous twenty-fifth birthday, Klonoa: Door to Phantomile and Klonoa 2: Lunatea's Veil are receiving the remaster treatment in a two-in-one set—titled KLONOA Phantasy Reverie Series slated to hit the Nintendo Switch™, PlayStation®5, PlayStation®4, Xbox Series X|S, Xbox One, and Steam. The graphics have received an elegant revamp while Klonoa's beloved world and classic gameplay have been faithfully preserved. The remaster also features an adjustable difficulty level, allowing franchise newcomers to delve right into the action, and long-time fans to get reacquainted with ease.… Expand"}, {"name": "POST VOID", "details_link": "https://www.metacritic.com/game/pc/post-void", "publisher": "YCJY Games", "release_date": "Aug  6 2020", "developers": ["YCJY Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/800ca995197d2c5b3155431c1bd801b7-98.jpg", "descriptions": "Post Void is a hypnotic scramble of early first-person shooter design that values speed above all else. Keep your head full and reach the end; Kill what you can to see it mend; Get the high score or try again."}, {"name": "Utawarerumono: Prelude to the Fallen", "details_link": "https://www.metacritic.com/game/playstation-4/utawarerumono-prelude-to-the-fallen", "publisher": "NIS America", "release_date": "May 26 2020", "developers": ["Aqua Plus"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/1e3857c89bc48d678b39e7d6f5d9aca9-98.jpg", "descriptions": "Prelude to the Fallen follows the story of a young man with no memories who awakens in a strange world, and is taken in by a tribe of kindhearted villagers. He is raised as one of their own, eventually receiving the name \"Hakuowlo.\" When neighboring nations begin to encroach on his village,Prelude to the Fallen follows the story of a young man with no memories who awakens in a strange world, and is taken in by a tribe of kindhearted villagers. He is raised as one of their own, eventually receiving the name \"Hakuowlo.\" When neighboring nations begin to encroach on his village, Hakuoro rises up against the tyrannical invaders, setting off on an unforgettable journey that lives on in the songs of legend. … Expand"}, {"name": "Feudal Alloy", "details_link": "https://www.metacritic.com/game/pc/feudal-alloy", "publisher": "Lukas Navratil", "release_date": "Jan 17 2019", "developers": ["Lukas Navratil"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/e61fd77aeb1cd5c046c51379cc8210a2-98.jpg", "descriptions": null}, {"name": "Aggressors: Ancient Rome", "details_link": "https://www.metacritic.com/game/pc/aggressors-ancient-rome", "publisher": "Slitherine", "release_date": "Aug 30 2018", "developers": ["Kubat Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/eb26e51bcd24229d852d8bcd37258436-98.jpg", "descriptions": "A mix of deep gameplay and rich historical flavor, Aggressors: Ancient Rome lets you relive history as the ruler of one of the mighty civilizations of the ancient Mediterranean. Choose one of twenty available factions and conquer the world."}, {"name": "Crawl", "details_link": "https://www.metacritic.com/game/xbox-one/crawl", "publisher": "Powerhoof", "release_date": "Apr 11 2017", "developers": ["Powerhoof"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/7d33f53f70b62a8d6c52429be1b6f51d-98.jpg", "descriptions": "Crawl is a competitive multiplayer dungeon crawler where your friends control the monsters. Kill the hero to instantly swap places, and it's your turn to crawl! It's a race to gain enough experience and loot to take on the dungeon's boss, cooperatively controlled by the other players!"}, {"name": "The Magic Circle: Gold Edition", "details_link": "https://www.metacritic.com/game/playstation-4/the-magic-circle-gold-edition", "publisher": "Question", "release_date": "Apr 26 2016", "developers": ["Question"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/b273baee6506e5fa342cb69894ee91b6-98.jpg", "descriptions": "A story-driven puzzler. It’s a dark comedy about a legendary game that has been stuck in development hell for 20 years, and only you can save it."}, {"name": "DISTRAINT", "details_link": "https://www.metacritic.com/game/pc/distraint", "publisher": "Jesse Makkonen", "release_date": "Oct 21 2015", "developers": ["Jesse Makkonen"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/f784f7cf400fd3d81126cdb5cb248f0d-98.jpg", "descriptions": "DISTRAINT is a 2D psychological horror adventure game for PC. You step into the shoes of an ambitious young man named Price. In order to forge a partnership from a famous company, Price seizes a property of an elderly woman. In that very moment he finds out the price of his humanity."}, {"name": "Sayonara UmiharaKawase +", "details_link": "https://www.metacritic.com/game/playstation-vita/sayonara-umiharakawase-+", "publisher": "Agatsuma Entertainment", "release_date": "Apr 21 2015", "developers": ["Studio Saizensen"], "platforms": ["PC", "PlayStation Vita"], "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/b82812bc2cf916ee07fd5e73fe0985c8-98.jpg", "descriptions": null}, {"name": "Lone Survivor: The Director's Cut", "details_link": "https://www.metacritic.com/game/wii-u/lone-survivor-the-directors-cut", "publisher": "Curve Studios", "release_date": "Oct 16 2014", "developers": ["Curve Studios", "superflat games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/624ebdafd80bd0b23f6660da5eb44476-98.jpg", "descriptions": "From the creator of Soul Brother and Soundless Mountain II, comes an original and adult Psychological Horror.\r The masked protagonist must escape from a city ravaged by disease, by any means. Starving and exhausted, he has begun to question how much of what he sees is even real.\r\n\r\nA newFrom the creator of Soul Brother and Soundless Mountain II, comes an original and adult Psychological Horror.\r The masked protagonist must escape from a city ravaged by disease, by any means. Starving and exhausted, he has begun to question how much of what he sees is even real.\r A new kind of adventure where the choice of how to survive is up to you. Sneak through without firing a single shot, or kill everything in your path. Eat and sleep well, or resort to drugs to keep going. Search for survivors, or try to escape the city alone. Look after your mental health, or descend into madness...… Expand"}, {"name": "Watch Dogs: Legion", "details_link": "https://www.metacritic.com/game/xbox-one/watch-dogs-legion", "publisher": "Ubisoft", "release_date": "Oct 29 2020", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox Series X", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 76, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/a8d888fce820f54326f022687eed433e-98.jpg", "descriptions": "In the near future, London is facing its downfall: the people are being oppressed by an all-seeing surveillance state, a corrupt private military corporation controls the streets, and a powerful crime syndicate is preying on the vulnerable. The fate of London lies with you, and your abilityIn the near future, London is facing its downfall: the people are being oppressed by an all-seeing surveillance state, a corrupt private military corporation controls the streets, and a powerful crime syndicate is preying on the vulnerable. The fate of London lies with you, and your ability to recruit a resistance and fight back.\r Watch Dogs: Legion delivers a never-before-seen gameplay innovation that allows you to recruit and play as anyone you see in the iconic city of London. Every single character in the open world is playable, and everyone has a backstory, personality, and skillset that will help you personalize your own unique team. Bring your characters online and join forces with friends to take back London in four-player co-op missions, end-game challenges, and daily events. Welcome to the Resistance.… Expand"}, {"name": "Digimon Story Cyber Sleuth: Complete Edition", "details_link": "https://www.metacritic.com/game/switch/digimon-story-cyber-sleuth-complete-edition", "publisher": "Bandai Namco Games", "release_date": "Oct 18 2019", "developers": ["Media.Vision"], "platforms": ["PC", "Switch"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/de135ff7420b79f593cf54b00af59cba-98.jpg", "descriptions": "Become a cyber detective or powerful hacker to solve diabolical digi-mysteries. Embark on a thrilling adventure where the line between the real and digital worlds is blurred. Featuring more than 300 digital to collect, raise, and digivolve. Build an all-star Digimon team to take on opponentsBecome a cyber detective or powerful hacker to solve diabolical digi-mysteries. Embark on a thrilling adventure where the line between the real and digital worlds is blurred. Featuring more than 300 digital to collect, raise, and digivolve. Build an all-star Digimon team to take on opponents in classic turn-based battles.\r… Expand"}, {"name": "Payday: The Heist", "details_link": "https://www.metacritic.com/game/pc/payday-the-heist", "publisher": "Sony Online Entertainment", "release_date": "Oct 20 2011", "developers": ["Overkill Software"], "platforms": ["PlayStation 3", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/205e885ef2854c0bbbc320920d78b10b-98.jpg", "descriptions": "Players will embark on a spectacular crime spree of six heart stopping heists, including blasting their way through a downtown bank vault robbery, managing hostages in an armored car hijacking and even a midnight infiltration of a top-secret, high-security facility. Additionally, PAYDAY: ThePlayers will embark on a spectacular crime spree of six heart stopping heists, including blasting their way through a downtown bank vault robbery, managing hostages in an armored car hijacking and even a midnight infiltration of a top-secret, high-security facility. Additionally, PAYDAY: The Heist challenges players with dynamic environments and adaptive enemy tactics - meaning no scenario will ever play out the same way twice. Teamwork is essential to ensure crew members provide cover under fire, guard key access points, break through various security measures and keep civilians in check. Survive wave after wave of the best that law enforcement can deploy as they shift strategies in response to player actions and gameplay style.… Expand"}, {"name": "Snoopy vs. the Red Baron", "details_link": "https://www.metacritic.com/game/psp/snoopy-vs-the-red-baron", "publisher": "Namco Bandai Games America", "release_date": "Oct 24 2006", "developers": ["Smart Bomb Interactive"], "platforms": ["PC", "PSP"], "num_players": "1-6 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/10731e7640db7a84cdcfdf8e0f2abb8a-98.jpg", "descriptions": "Play as WWI Flying Ace Snoopy in an adventure that includes cameo appearance from 12 characters such as Charlie Brown, Woodstock, Linus, Lucy, Marcie and Sally. Barnstorm your way across six vividly rendered worlds and collect clues to reveal the whereabouts of the Red Baron's top secretPlay as WWI Flying Ace Snoopy in an adventure that includes cameo appearance from 12 characters such as Charlie Brown, Woodstock, Linus, Lucy, Marcie and Sally. Barnstorm your way across six vividly rendered worlds and collect clues to reveal the whereabouts of the Red Baron's top secret hideout. Pilot Snoopy's famous Sopwith Camel and other unique aircraft in perilous sky-high dogfights, no-holds-barred air races and heart-pounding missions behind enemy lines. Upgrade your craft with a comical collection of 25 weapons and gadgets, including the lightning fast, player-guided Woodstock missile, the Bee-Shooter and the Potato Cannon. Fight your way through 50+ single-player and co-op missions in a heroic attempt to foil the plans of the Red Baron. Play in any of five modes: Single-player, Cooperative, Team Multiplayer, Versus Multiplayer and Battle. [Namco]… Expand"}, {"name": "Paper Mario: Color Splash", "details_link": "https://www.metacritic.com/game/wii-u/paper-mario-color-splash", "publisher": "Nintendo", "release_date": "Oct  7 2016", "developers": ["Nintendo", "Intelligent Systems"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/33d619826dceeed2fa392f40dc33d857-98.jpg", "descriptions": "There’s a mystery on Prism Island. The solution? Mario. Someone's been draining the color from Prism Island! Can you help Mario unravel the mystery and use the power of paint to restore the island? [Nintendo]"}, {"name": "Batman: Arkham Origins", "details_link": "https://www.metacritic.com/game/playstation-3/batman-arkham-origins", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 25 2013", "developers": ["WB Games Montreal"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "Fantasy", "Open-World"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/6a3ea640ef468dc785dd60b3e91db33f-98.jpg", "descriptions": "Batman: Arkham Origins features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two games in the franchise. Taking place before the rise of Gotham City’s most notoriousBatman: Arkham Origins features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two games in the franchise. Taking place before the rise of Gotham City’s most notorious criminals, the game showcases a young, unrefined Batman as he faces the defining moment of his early career and sets his path to becoming the Dark Knight.… Expand"}, {"name": "Wulverblade", "details_link": "https://www.metacritic.com/game/switch/wulverblade", "publisher": "Darkwind Media", "release_date": "Oct 12 2017", "developers": ["Darkwind Media"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/42ead3ba5c187b0255a53b38d398476a-98.jpg", "descriptions": null}, {"name": "Furi", "details_link": "https://www.metacritic.com/game/pc/furi", "publisher": "The Game Bakers", "release_date": "Jul  5 2016", "developers": ["The Game Bakers"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Fighting", "3D"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/04521c2336549ec46c3cd7f55e993496-98.jpg", "descriptions": "Fight your way free in our frenzied all-boss fighter, and discover what’s waiting behind the last gate. Furi is all about the tension of one-on-one fights against deadly adversaries. It’s an intense, ultra-responsive game with a unique mix of fast-paced sword fighting and dual-stickFight your way free in our frenzied all-boss fighter, and discover what’s waiting behind the last gate. Furi is all about the tension of one-on-one fights against deadly adversaries. It’s an intense, ultra-responsive game with a unique mix of fast-paced sword fighting and dual-stick shooting. Each of the formidable guardians - designed by Afro Samurai creator Takashi Okazaki - has a unique and surprising combat style that requires focus and skill to defeat. The high-energy action gets a boost from an explosive soundtrack composed by electro musicians including Carpenter Brut.… Expand"}, {"name": "Forgotton Anne", "details_link": "https://www.metacritic.com/game/pc/forgotton-anne", "publisher": "Square Enix", "release_date": "May 15 2018", "developers": ["Throughline Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/d78bca6e4605df23c2860376244ec34f-98.jpg", "descriptions": "Imagine a place where everything that is lost and forgotten goes; old toys, letters, single socks. The Forgotten Lands is a magical world inhabited by Forgotlings; creatures composed of mislaid objects longing to be remembered again. Forgotton Anne is a seamless cinematic adventure game withImagine a place where everything that is lost and forgotten goes; old toys, letters, single socks. The Forgotten Lands is a magical world inhabited by Forgotlings; creatures composed of mislaid objects longing to be remembered again. Forgotton Anne is a seamless cinematic adventure game with light puzzle platforming elements. You play as Anne, the enforcer who keeps order in the Forgotten Lands, as she sets out to quash a rebellion that might prevent her master, Bonku, and herself from returning to the human world... [Square Enix]… Expand"}, {"name": "Ys IX: Monstrum Nox", "details_link": "https://www.metacritic.com/game/switch/ys-ix-monstrum-nox", "publisher": "NIS America", "release_date": "Jul  6 2021", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/0b0a176b07f920bedce459259636a6d5-98.jpg", "descriptions": "While imprisoned in Balduq, Adol is cursed and becomes a Monstrum. With his newfound powers, he must stop the Grimwald Nox from consuming the city. Feared Protectors: Play as any of the six notorious Monstrum, each with their own unique Gifts that grant abilities such as scaling sheerWhile imprisoned in Balduq, Adol is cursed and becomes a Monstrum. With his newfound powers, he must stop the Grimwald Nox from consuming the city. Feared Protectors: Play as any of the six notorious Monstrum, each with their own unique Gifts that grant abilities such as scaling sheer walls or detecting hidden objects to protect the city from shadowy creatures. The World Within the Walls: Explore the massive city, accept quests to aid the townsfolk, and enter the Grimwald Nox to vanquish the threats to Balduq. Strength of the Night: Familiar mechanics such as Flash Dodge and Flash Guard allow you to outmaneuver your foes, while new additions such as Gifts and Boost Mode further augment your ability to fight. Story\"What is real is defined by what is not.Who one is defined by who one isn't.\"To move forward, one must accept these truths.\"Yes, in this prisonthis cradlemy dreams and reality became one.\" Renowned adventurer Adol \"the Red\" Christin and his companion Dogi arrive at Balduq, a city annexed by the Romun Empire, only for Adol to be detained before setting foot inside. While imprisoned, he meets a mysterious woman named Aprilis who turns him into a Monstrum, a being with supernatural Gifts and the power to exorcise monsters. Now, Adol must ally with his fellow Monstrum to fend off the fearsome threats emerging from a shadowy dimension called the Grimwald Nox, as well as unravel the mysteries of the Monstrum curse, and the truth behind the unrest within Balduq.… Expand"}, {"name": "The Wild At Heart", "details_link": "https://www.metacritic.com/game/pc/the-wild-at-heart", "publisher": "Moonlight Kids", "release_date": "May 19 2021", "developers": ["Moonlight Kids"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/7d820285567f29d4e257a8dc5d65e609-98.jpg", "descriptions": "A mysterious hidden realm. Two precocious kids fleeing hardship. Magical creatures and an oddball order of guardians who have lost their way. A stygian evil imprisoned. Welcome to the Deep Woods.Collect and deploy a swarm of quirky Spritelings; small magical creatures for you to command.A mysterious hidden realm. Two precocious kids fleeing hardship. Magical creatures and an oddball order of guardians who have lost their way. A stygian evil imprisoned. Welcome to the Deep Woods.Collect and deploy a swarm of quirky Spritelings; small magical creatures for you to command. Break stuff, collect loot, fight enemies, build new paths, and more!Explore a unique and sequestered world rich with centuries full of lore. Woods, caves, coastline, ancient shrines... The Deep Woods is full of puzzles to be solved and secrets waiting to be uncovered.… Expand"}, {"name": "Journey to the Savage Planet", "details_link": "https://www.metacritic.com/game/pc/journey-to-the-savage-planet", "publisher": "505 Games", "release_date": "Jan 28 2020", "developers": ["Typhoon Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 76, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/a30481afd17cc444054758e460436215-98.jpg", "descriptions": "In this colorful, co-op adventure game you play as the newest recruit to Kindred Aerospace. Dropped onto an uncharted planet with little equipment, you must determine if this planet is fit for human habitation but perhaps you are not the first to set foot here…"}, {"name": "Everybody's Gone to the Rapture", "details_link": "https://www.metacritic.com/game/pc/everybodys-gone-to-the-rapture", "publisher": "The Chinese Room", "release_date": "Apr 14 2016", "developers": ["The Chinese Room"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 76, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/b59d230ec35beca7c7bd903ffdcd4f7d-98.jpg", "descriptions": "Everybody’s Gone to the Rapture transports the player back to the brief moments leading up to the apocalypse to explore the choices people make when they’re faced with world-shattering events beyond their control."}, {"name": "Phantom Brave: We Meet Again", "details_link": "https://www.metacritic.com/game/wii/phantom-brave-we-meet-again", "publisher": "NIS America", "release_date": "Aug 14 2009", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/a8d20a448f8a3fdb8ecbc2ec9f9c13f7-98.jpg", "descriptions": "Return to Ivoire to face new challenges or take pleasure in your first visit to a beautiful island paradise. Revel in the enhanced graphics, remixed score, and improved controls, and celebrate the return of the gridless map, giving you total freedom. [NIS America]"}, {"name": "Silent Hill 4: The Room", "details_link": "https://www.metacritic.com/game/playstation-2/silent-hill-4-the-room", "publisher": "Konami", "release_date": "Sep  7 2004", "developers": ["KCET"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/fc5a05755140bd2a3d7f9a536edf5b5a-98.jpg", "descriptions": "Taking the series in a new direction, apprehension and fear immediately run high when the new main character, Henry Townshend, finds himself trapped in his own cursed apartment. Only by exploring mysterious portals leading to disturbing alternate worlds will Henry begin to uncover clues asTaking the series in a new direction, apprehension and fear immediately run high when the new main character, Henry Townshend, finds himself trapped in his own cursed apartment. Only by exploring mysterious portals leading to disturbing alternate worlds will Henry begin to uncover clues as to why he is trapped. However, in true Silent Hill fashion, mysterious new characters, horrendous creatures, and the undead will use any means necessary to impede his progress. A tense atmosphere and grotesque enemies will get the player's heart thumping as Silent Hill 4 delivers a gameplay experience that fans and newcomers will never forget. Using state of the art technology, the development team has effectively created bone-chilling effects to add to the game's creepy atmosphere. Players will be able to see changes in environments over time, as the alternate world seeps into reality. In addition, Silent Hill 4 shifts between the first and third-person perspective, which is a first for the series. Beautifully detailed environments, a haunting soundtrack and the game's trademark psychological horror complete Silent Hill 4's overall fear factor as players travel between the room and their worst nightmare. [Konami]… Expand"}, {"name": "UEFA Euro 2004: Portugal", "details_link": "https://www.metacritic.com/game/playstation-2/uefa-euro-2004-portugal", "publisher": "Electronic Arts", "release_date": "May  4 2004", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/5852ef3447c166c006d3b161067b2436-98.jpg", "descriptions": "In EURO 2004 mode players can play as any of the 51 European nations. Players can arrange and play friendly matches against other nations or play through the tournament going from qualifying, to playoffs and into the finals. In addition to tracking injuries and suspensions, a new dynamicIn EURO 2004 mode players can play as any of the 51 European nations. Players can arrange and play friendly matches against other nations or play through the tournament going from qualifying, to playoffs and into the finals. In addition to tracking injuries and suspensions, a new dynamic morale system will track players' morale, which will fluctuate based on individual and team performances and affect player abilities on the field. [Electronic Arts]… Expand"}, {"name": "Midtown Madness 3", "details_link": "https://www.metacritic.com/game/xbox/midtown-madness-3", "publisher": "Microsoft Game Studios", "release_date": "Jun 17 2003", "developers": ["Digital Illusions"], "platforms": "Xbox", "num_players": "1-8 ", "genres": ["Driving", "Mission-based"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/b6b034af8ef7d4c4f5cac44363bff720-98.jpg", "descriptions": "Midtown Madness 3 provides you with madcap, over-the-top racing and driving excitement in two of the world's most fascinating cities: Paris and Washington, D.C.  The latest in the Midtown Madness franchise allows you to get behind the wheel of more than 30 vehicles and compete in excitingMidtown Madness 3 provides you with madcap, over-the-top racing and driving excitement in two of the world's most fascinating cities: Paris and Washington, D.C.  The latest in the Midtown Madness franchise allows you to get behind the wheel of more than 30 vehicles and compete in exciting race modes such as Blitz, Checkpoint, and Cruise.  With a robust Career mode, featuring 14 driving careers, Midtown Madness 3 delivers the rush and excitement of street racing.… Expand"}, {"name": "Grand Prix Challenge", "details_link": "https://www.metacritic.com/game/playstation-2/grand-prix-challenge", "publisher": "Atari", "release_date": "Mar  3 2003", "developers": ["Atari"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/b7b706810197e46360d55146910f7a86-98.jpg", "descriptions": "Features the official cars, tracks and drivers from the record-breaking 2002 FIA Formula One World Championship season. Feel the heat of real life competition with an AI that takes into account driving styles of each individual driver and test your nerves and tactical skills with an originalFeatures the official cars, tracks and drivers from the record-breaking 2002 FIA Formula One World Championship season. Feel the heat of real life competition with an AI that takes into account driving styles of each individual driver and test your nerves and tactical skills with an original dynamic and interactive pit stop system. Features include: 5 different game modes including split screen multiplayer option to challenge your friends; 3 levels of handling and 4 levels of Artificial Intelligence catering for the novice to F1 fanatics; Super-smooth high fidelity graphics running at 60 frames per second; Detailed environment and dynamic weather; 3D positional sound system. [Infogrames]… Expand"}, {"name": "Harry Potter and the Chamber of Secrets", "details_link": "https://www.metacritic.com/game/game-boy-advance/harry-potter-and-the-chamber-of-secrets", "publisher": "EA Games", "release_date": "Nov 14 2002", "developers": ["Eurocom Entertainment Software"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/1ab25796bd98ef2b3d4c05c0109438d4-98.jpg", "descriptions": "Be Harry Potter in a new adventure with more magic, friends, and danger. In his sophomore year at Hogwarts School of Witchcraft and Wizardry, Harry stumbles upon a dark chapter in the school's past. In an effort to confront the powers at the heart of the Chamber of Secrets, you'll learn newBe Harry Potter in a new adventure with more magic, friends, and danger. In his sophomore year at Hogwarts School of Witchcraft and Wizardry, Harry stumbles upon a dark chapter in the school's past. In an effort to confront the powers at the heart of the Chamber of Secrets, you'll learn new spells, undertake new quests, make new friends, and challenge new adversaries. Do you dare take the chance that you might face the evil Lord Voldemort again?… Expand"}, {"name": "Summoner 2", "details_link": "https://www.metacritic.com/game/playstation-2/summoner-2", "publisher": "THQ", "release_date": "Sep 23 2002", "developers": ["Volition Inc."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/7fc4dc8799647f8430cd753665c29fe4-98.jpg", "descriptions": "You are the Queen of Halassar. Thousands have fought and died for you. Millions adore you as the \"goddess Laharah reborn.\" Your fate is written in the Book of the Prophets. You are the savior of all creation. But your enemies are strong. The King of Galdyr wants you dead. Sinister factionsYou are the Queen of Halassar. Thousands have fought and died for you. Millions adore you as the \"goddess Laharah reborn.\" Your fate is written in the Book of the Prophets. You are the savior of all creation. But your enemies are strong. The King of Galdyr wants you dead. Sinister factions plot your downfall. The armies of Urath march on your borders. Below Munari City, the mysterious Unseen weave a dark conspiracy. And now one of your own has betrayed you. A thief robs your inner sanctum. Intrigue lures you to the Midnight Sea. In a howling tempest, your destiny begins to unfold. [THQ]… Expand"}, {"name": "MX Superfly", "details_link": "https://www.metacritic.com/game/playstation-2/mx-superfly", "publisher": "THQ", "release_date": "Jun 17 2002", "developers": ["Pacific Coast Power & Light"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/c9af0e9ed40ffaee5b1c75de66d035f5-98.jpg", "descriptions": "Show Off Your Skillz: Expanded freestyle mode with more of what's made the MX franchise dominate - mini-games, tons of arenas and wide-open worlds with secret areas to explore. The only motocross game where you can Create-A Rider, and as you play choose from the big name sponsors, five majorShow Off Your Skillz: Expanded freestyle mode with more of what's made the MX franchise dominate - mini-games, tons of arenas and wide-open worlds with secret areas to explore. The only motocross game where you can Create-A Rider, and as you play choose from the big name sponsors, five major bike manufacturers and authentic gear. The better you are the more stuff you can buy. Ride as Ricky Carmichael or 26 other pros. [THQ]… Expand"}, {"name": "NBA Live 2002", "details_link": "https://www.metacritic.com/game/xbox/nba-live-2002", "publisher": "Electronic Arts", "release_date": "Nov 18 2001", "developers": ["Electronic Arts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/1baf46956890d83d25f566fb1f073c98-98.jpg", "descriptions": "NBA Live 2002 is the full on-court NBA experience. Hear what the players are talking about and see what's going on from their eyes. Get inside for more lay-ups and dunks along with more control in the low post. Facial animation and lip synching are heavily focused during transition sequencesNBA Live 2002 is the full on-court NBA experience. Hear what the players are talking about and see what's going on from their eyes. Get inside for more lay-ups and dunks along with more control in the low post. Facial animation and lip synching are heavily focused during transition sequences and auto replays. See Allen Iverson with his tattoos and corn rows arguing a referee's call or yelling as he throws down a big time dunk and see his reaction as he celebrates afterwards. See--and play--NBA Live 2002!… Expand"}, {"name": "LEGO Star Wars III: The Clone Wars", "details_link": "https://www.metacritic.com/game/playstation-3/lego-star-wars-iii-the-clone-wars", "publisher": "LucasArts", "release_date": "Mar 22 2011", "developers": ["Traveller's Tales"], "platforms": ["3DS", "PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/861f2ad4585336907df18be9badcb807-98.jpg", "descriptions": "LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes,LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes, giving players unique, head-to-head combat and an upgraded level builder, allowing the creation of customized bases and in-game battlefields. Play either as a Jedi or Separatist with all-new character abilities, such as Squad command, Lightsaber slicing, Lightsaber jumps, long distance Jedi attacks and Grapple Tie-Ups, all within a new, easy-to-navigate hub.… Expand"}, {"name": "SingStar Amped", "details_link": "https://www.metacritic.com/game/playstation-2/singstar-amped", "publisher": "SCEA", "release_date": "Sep 18 2007", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/a56109a019a6481cc8682c9416aaf2ea-98.jpg", "descriptions": "Yet another in this karaoke game series featuring songs such as Tainted Love, Material Girl, and Rio."}, {"name": "Artifact", "details_link": "https://www.metacritic.com/game/pc/artifact", "publisher": "Valve Software", "release_date": "Nov 28 2018", "developers": ["Valve Software"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 76, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/6/63c9da48c961ee81b3699d9960402b00-98.jpg", "descriptions": "A collaboration between legendary game designer Richard Garfield and Valve, Artifact promises the deepest gameplay and the highest-fidelity experience ever seen in a trading card game."}, {"name": "Firewatch", "details_link": "https://www.metacritic.com/game/playstation-4/firewatch", "publisher": "Panic Inc.", "release_date": "Feb  9 2016", "developers": ["Campo Santo"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/82bf7ff864a25d2df3cf7039ba59590c-98.jpg", "descriptions": "In Firewatch you play as a man named Henry who has retreated from his messy life to work as a fire lookout in the Wyoming wilderness. Perched high atop a mountain, it’s your job to look for smoke and keep the wilderness safe. An especially hot and dry summer has everyone on edge. YourIn Firewatch you play as a man named Henry who has retreated from his messy life to work as a fire lookout in the Wyoming wilderness. Perched high atop a mountain, it’s your job to look for smoke and keep the wilderness safe. An especially hot and dry summer has everyone on edge. Your supervisor, a woman named Delilah, is available to you at all times over a small, handheld radio — and is your only contact with the world you've left behind. But when something strange draws you out of your lookout tower and into the world, you’ll explore a wild and unknown environment, facing questions and making interpersonal choices that can build or destroy the only meaningful relationship you have.… Expand"}, {"name": "Darius Cozmic Collection: Arcade", "details_link": "https://www.metacritic.com/game/switch/darius-cozmic-collection-arcade", "publisher": "ININ Games", "release_date": "Jun 16 2020", "developers": ["M2", "ININ Games"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/205b6d3053bb261677eda1ed7fed8dcb-98.jpg", "descriptions": "The Darius Cozmic Collection Arcade contains 4 legendary console titles in a total of 7 versions:\r DARIUS (old version)\r  DARIUS (new version)\r  DARIUS (extra version)\r  DARIUS II (dual screen version)\r  SAGAIA (Ver. 1)\r  SAGAIA (Ver. 2)\r  DARIUS GAIDEN"}, {"name": "Pro Evolution Soccer 2016", "details_link": "https://www.metacritic.com/game/pc/pro-evolution-soccer-2016", "publisher": "Konami", "release_date": "Sep 16 2015", "developers": ["Konami"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 76, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/8/d8c01520681c0a2ed72ed920aec7e2e2-98.jpg", "descriptions": "PES 2016 comes with a host of new and improved features:  Master League – completely overhauled from presentation to running of your team; New night time lighting and player models using Fox Engine; Human motion – 3x more animations for players and goalkeepers; Dynamic weather – Rain startsPES 2016 comes with a host of new and improved features:  Master League – completely overhauled from presentation to running of your team; New night time lighting and player models using Fox Engine; Human motion – 3x more animations for players and goalkeepers; Dynamic weather – Rain starts during matches; Deeper team intelligence – Player and team behaviour taken to the next level.… Expand"}, {"name": "Diablo III: Rise of the Necromancer", "details_link": "https://www.metacritic.com/game/pc/diablo-iii-rise-of-the-necromancer", "publisher": "Blizzard Entertainment", "release_date": "Jun 27 2017", "developers": ["Blizzard Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/6/f5e2c12f57a517692d9ae4c04a67f398-98.jpg", "descriptions": "Comprised of controlled, calculating individuals, the Priests of Rathma have long known the true stakes at the heart of the Eternal Conflict. Known to uneducated outsiders as Necromancers, these masters of blood, bone, and the dark arts are often misunderstood. Driven to protect the BalanceComprised of controlled, calculating individuals, the Priests of Rathma have long known the true stakes at the heart of the Eternal Conflict. Known to uneducated outsiders as Necromancers, these masters of blood, bone, and the dark arts are often misunderstood. Driven to protect the Balance at all costs, those dedicated to walking this path see neither good nor evil in their actions; simply obedience to the cycle of being.… Expand"}, {"name": "Wii Sports", "details_link": "https://www.metacritic.com/game/wii/wii-sports", "publisher": "Nintendo", "release_date": "Nov 19 2006", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General", "Individual", "Athletics"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/5c8510a0a7d9c36ba85838f581cb0b91-98.jpg", "descriptions": "Tennis (1-4 players): Players grab the controller like a racket and swing – the game will register forehands, backhands, volleys, lobs, slices, spin and power depending on how fast the user swings and at what angle. Don't worry about moving around the court to get to the ball – the gameTennis (1-4 players): Players grab the controller like a racket and swing – the game will register forehands, backhands, volleys, lobs, slices, spin and power depending on how fast the user swings and at what angle. Don't worry about moving around the court to get to the ball – the game automatically moves players into position. Baseball (1-2 players): Grip the controller like a bat and swat fastballs out of the park in a home run derby. Timing and bat speed will make all the difference between going yard and whiffing, so keep an eye on the ball and swing for the fences. In the two-player game, one player pitches and the other bats. Golf (1 player): Step up to the tee, hold the controller like a golf club and swing naturally to smack the ball onto the green. The harder players swing the club, the farther the ball will fly, so be sure to take some practice swings before going for the pin. After reaching the green, line up putts carefully, practice the stroke and try to hole out. [Nintendo]… Expand"}, {"name": "The Sims 2: Nightlife", "details_link": "https://www.metacritic.com/game/pc/the-sims-2-nightlife", "publisher": "EA Games", "release_date": "Sep 13 2005", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/489d58c5586e293aaebbd9f69d6e6d9d-98.jpg", "descriptions": "The Sims 2 Nightlife takes Sims into the night to explore all of their favorite after-dark activities.  Players can either head out and discover their love lives or have a crazy night out with friends.  With the new dating gameplay, players will see if their Sims have chemistry with othersThe Sims 2 Nightlife takes Sims into the night to explore all of their favorite after-dark activities.  Players can either head out and discover their love lives or have a crazy night out with friends.  With the new dating gameplay, players will see if their Sims have chemistry with others which will determine their romantic fate.  The newest addition to the game includes the brand new pleasure seeker aspiration allowing players to explore a life filled with unforgettable dates, endless nights of dancing and fine dining.  Make your Sims nightlife fantasy a reality with over 125 new objects including a DJ booth, poker table and all you need to design the ultimate nightclub and VIP lounge.  [Electronic Arts]… Expand"}, {"name": "Konami Classics Series: Arcade Hits", "details_link": "https://www.metacritic.com/game/ds/konami-classics-series-arcade-hits", "publisher": "Konami", "release_date": "Mar 30 2007", "developers": ["M2"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/928dccfe3e3d6a9cb4ee67c031c2aa4d-98.jpg", "descriptions": "Games include the following: Circus Charlie: Take control of a clown named Charlie, making your way through a series of circus themed challenges such as jumping on trampolines, tightrope walking and swinging on the flying trapeze. Contra: In this original arcade shooter smash hit, take onGames include the following: Circus Charlie: Take control of a clown named Charlie, making your way through a series of circus themed challenges such as jumping on trampolines, tightrope walking and swinging on the flying trapeze. Contra: In this original arcade shooter smash hit, take on the role of a hard boiled Marine as you single-handedly eradicate a deadly alien threat. Gradius: Customize the legendary Vic Viper space craft as you fly and shoot through hundreds of space enemies in this timeless shooter. Roc’N Rope: Play as an archaeologist and use your harpoon gun to swing across cliffs in search of legendary treasures, avoiding dangerous cavemen and dinosaurs along the way. Rush’N Attack: Players take on the role of a tough-as-nails special forces agent, rescuing prisoners of war and going head to head with endless waves of gun-toting enemies. Time Pilot: Zip back and forth through time in your futuristic fighter craft, saving your comrades while taking on enemies from different moments in history. Track and Field: Stake your claim for the gold medal, taking part in exciting competitions such as the 100 meter dash, long jump and javelin throw in this classic game of athletic prowess. Yie-Ar Kung Fu: Deflect shuriken, dodge swords and deliver ruthless high kicks while facing off one-on-one against a host of martial arts masters in merciless kung-fu matches. [Konami]… Expand"}, {"name": "Ultimate Spider-Man", "details_link": "https://www.metacritic.com/game/gamecube/ultimate-spider-man", "publisher": "Activision", "release_date": "Sep 21 2005", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/70df3af5d731db7e3cfd11efad80e6d6-98.jpg", "descriptions": "Based on the comic book of the same name, Ultimate Spider-Man lets you play as either the hero Spider-Man or his arch-nemesis, Venom. Use the unique combat techniques of either Spider-Man or Venom to battle a host of  Spider-Man characters. Artistic contributions by the creators of theBased on the comic book of the same name, Ultimate Spider-Man lets you play as either the hero Spider-Man or his arch-nemesis, Venom. Use the unique combat techniques of either Spider-Man or Venom to battle a host of  Spider-Man characters. Artistic contributions by the creators of the series make for an authentic Spider-Man experience.… Expand"}, {"name": "Warhammer 40,000: Space Marine", "details_link": "https://www.metacritic.com/game/xbox-360/warhammer-40000-space-marine", "publisher": "THQ", "release_date": "Sep  6 2011", "developers": ["Relic", "Relic Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Role-Playing", "Action RPG", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/a80c7e0512c24bf29a9660fc2454b3d8-98.jpg", "descriptions": "Warhammer 40,000: Space Marine takes place in the brutal, science fiction setting of Games Workshop's Warhammer 40,000 universe. In the 41st Millennium, humanity faces extinction at the hands of horrific aliens and demonic hordes. Only one force offers salvation, the superhuman SpaceWarhammer 40,000: Space Marine takes place in the brutal, science fiction setting of Games Workshop's Warhammer 40,000 universe. In the 41st Millennium, humanity faces extinction at the hands of horrific aliens and demonic hordes. Only one force offers salvation, the superhuman Space Marines. Warhammer 40,000: Space Marine is an intense Action-RPG featuring epic battles where players take direct control of the ultimate defender of humanity, the mighty Space Marine. In the grim darkness of the far future there is only war. [THQ]… Expand"}, {"name": "Destiny 2: Beyond Light", "details_link": "https://www.metacritic.com/game/playstation-4/destiny-2-beyond-light", "publisher": "Bungie", "release_date": "Nov 10 2020", "developers": ["Bungie"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/4/ed9562d089fc1238d5ee0c5c8da969b3-98.jpg", "descriptions": "The frontier of Europa holds many lost secrets from the past, including the dark power of Stasis. Work with the mysterious Exo Stranger to harness this new power before Eramis, the Kell of Darkness, bestows it on her Fallen forces. Grow your arsenal, command Stasis, and go beyond the Light."}, {"name": "Nobunaga's Ambition: Iron Triangle", "details_link": "https://www.metacritic.com/game/playstation-2/nobunagas-ambition-iron-triangle", "publisher": "Koei", "release_date": "Jan 27 2009", "developers": ["Koei"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/d1f79e36c4e93bda5b2a6b7a3dc329a1-98.jpg", "descriptions": "Compelled by a nation ravaged by war, it was legendary samurai Nobunaga Oda's ambition to silence the cries of war and usher in a new era of lasting peace for Japan. In Nobunaga's Ambition: Iron Triangle, video gamers can step into the role of Feudal Japan's most powerful warlords and turnCompelled by a nation ravaged by war, it was legendary samurai Nobunaga Oda's ambition to silence the cries of war and usher in a new era of lasting peace for Japan. In Nobunaga's Ambition: Iron Triangle, video gamers can step into the role of Feudal Japan's most powerful warlords and turn this magnificent vision of unification into a reality. In the latest edition of the series to come to North America, the acquisition of knowledge and a firm grasp of technology are even more crucial to establishing the groundwork for the future of the country. Players must embrace technology, govern wisely and shrewdly, and prepare a near-invincible military force for war on land and at sea. Only with the mastery of these three elements, the \"Iron Triangle,\" will the nation be united under one sword and will Nobunaga's dream be realized. [KOEI]… Expand"}, {"name": "Scene It? Box Office Smash", "details_link": "https://www.metacritic.com/game/xbox-360/scene-it-box-office-smash", "publisher": "Microsoft Game Studios", "release_date": "Oct 28 2008", "developers": ["Krome Studios", "Screenlife Games"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/bf55f66659406ac214a84f86b16c5499-98.jpg", "descriptions": "Scene It?  Box Office Smash for Xbox 360 brings movie and trivia fans together for a game that provides hours of laughter. Challenge your friends and family to see whose movie knowledge reigns supreme while you relive some of your favorite moments from the silver screen. With all-newScene It?  Box Office Smash for Xbox 360 brings movie and trivia fans together for a game that provides hours of laughter. Challenge your friends and family to see whose movie knowledge reigns supreme while you relive some of your favorite moments from the silver screen. With all-new questions, more high-definition (HD) movie clips, and several new puzzle types, you have a trivia game overflowing with images plus audio and video clips from hundreds of films you know and love. The new game lets up to four teams challenge one another from the comfort of your living room or across the miles via Xbox LIVE. With the new Xbox LIVE experience, Scene It? Box Office Smash is the first game that lets you virtually put yourself into the game through custom avatars that respond to your play and react to one another throughout the course of the game. [Microsoft]… Expand"}, {"name": "Legend of Keepers: Career of a Dungeon Manager", "details_link": "https://www.metacritic.com/game/pc/legend-of-keepers-career-of-a-dungeon-manager", "publisher": "Goblinz Studio", "release_date": "Apr 29 2021", "developers": ["Goblinz Studio"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 76, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/dff1d502f1c8c81190cb444867a1a549-98.jpg", "descriptions": "Legend of Keepers is the perfect mix between Dungeon Management and Roguelite. You have been hired as a dungeon master by the Dungeons Company. Your job is simple: protect their dungeons!"}, {"name": "Langrisser I & II", "details_link": "https://www.metacritic.com/game/switch/langrisser-i-ii", "publisher": "NIS America", "release_date": "Mar 10 2020", "developers": ["Kadokawa"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Compilation", "Tactics"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/6c240ed12da54d7816798c6299368ce8-98.jpg", "descriptions": "Both Langrisser I & II have returned with their classic stories of good and evil now remade in beautiful high-definition visuals, reorchestrated music, and quality-of-life improvements to the gameplay and user experience."}, {"name": "Worms", "details_link": "https://www.metacritic.com/game/playstation-3/worms", "publisher": "Team17", "release_date": "Mar 26 2009", "developers": ["Team17"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "Fantasy", "Artillery"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/5b9737ab614d1713fa2df79bc8751325-98.jpg", "descriptions": "[Playstation Network]  Battle up to three other players offline or online on one of six landscape themes, utilizing a selection of classic Worms weaponry: from the famed Bazooka to the devastating Banana Bomb. With a fine selection of single player battles and plenty of ways to customize[Playstation Network]  Battle up to three other players offline or online on one of six landscape themes, utilizing a selection of classic Worms weaponry: from the famed Bazooka to the devastating Banana Bomb. With a fine selection of single player battles and plenty of ways to customize your annelid army, it's a package sky-high on entertainment! [Sony]… Expand"}, {"name": "Suikoden V", "details_link": "https://www.metacritic.com/game/playstation-2/suikoden-v", "publisher": "Konami", "release_date": "Mar 21 2006", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/2d6a23ac976730ed94984ba57c37856e-98.jpg", "descriptions": "Suikoden V, like its predecessors, features unparalleled in-depth gameplay, a riveting storyline as well as the series' trademark 108 Stars of Destiny.  Thrust into a time of unbalance and unrest, a dynamic drama unfolds revolving around one of the 27 True Runes, the Sun Rune. Players areSuikoden V, like its predecessors, features unparalleled in-depth gameplay, a riveting storyline as well as the series' trademark 108 Stars of Destiny.  Thrust into a time of unbalance and unrest, a dynamic drama unfolds revolving around one of the 27 True Runes, the Sun Rune. Players are tasked to explore the lands of Falena, gather allies and become stronger to ultimately bring back peace and prosperity. While on their quest through rich 3D environments, exciting new secrets of the Suikoden world will be revealed. The game features significant enhancements from all the previous installments of the series, including 6-member battle parties, multiple mini-games and the homebase system, where all of your allies gather together along with new features to create a unique gameplay experience like no other. [Konami]… Expand"}, {"name": "The King of Fighters 02/03", "details_link": "https://www.metacritic.com/game/xbox/the-king-of-fighters-0203", "publisher": "SNK", "release_date": "Aug 31 2005", "developers": ["SNK"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/fa93d40f4436e36b419ca458bac8ebcc-98.jpg", "descriptions": "The eighth and ninth installments in the King of Fighters franchise make their ways to the PlayStation 2 in this double-pack collection of 2D fighting. This collection includes all of the great fighting teams, such as the Fatal Fury team and the Women Fighters team, comprising 39 charactersThe eighth and ninth installments in the King of Fighters franchise make their ways to the PlayStation 2 in this double-pack collection of 2D fighting. This collection includes all of the great fighting teams, such as the Fatal Fury team and the Women Fighters team, comprising 39 characters from the King of Fighters series. Unleash special moves, superspecial moves, and combos in a variety of levels, and unlock more levels and bonus characters as you progress.… Expand"}, {"name": "Demigod", "details_link": "https://www.metacritic.com/game/pc/demigod", "publisher": "Stardock", "release_date": "Apr 14 2009", "developers": ["Gas Powered Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Fantasy", "MOBA", "Strategy", "Real-Time", "MOBA"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/174be3b0e3b7b0501f90b389b1076cd1-98.jpg", "descriptions": "The all father has vanished, creating an opening in the pantheon. To fill the void, Demigods from across from the mortal world must wage war against one another in a bid to ascend to true godhood. Demigod is a real-time, tactical strategy game that includes extensive role-playing elements.The all father has vanished, creating an opening in the pantheon. To fill the void, Demigods from across from the mortal world must wage war against one another in a bid to ascend to true godhood. Demigod is a real-time, tactical strategy game that includes extensive role-playing elements. Choose from several Demigods, each poised for battle with their own unique capabilities and awe-inspiring powers. Vanquish other would-be gods as you gain levels, increase in power, unlock the power of mystic artifacts and slowly battle your way closer to joining the Pantheon. [Stardock Games]… Expand"}, {"name": "The Sims 4: Paranormal Stuff Pack", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-paranormal-stuff-pack", "publisher": "Electronic Arts", "release_date": "Jan 26 2021", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/832b9c0aeefb23415d4f77ef14e9a9d2-98.jpg", "descriptions": "Welcome to your Sim’s new home! Sure, the listing said “haunted,” but everyone knows that’s just a myth. Why should you believe it? At night, though… well. The lights flicker overhead, casting shadows at your Sim’s feet. In another room, a door slams shut, even though no one else is home.Welcome to your Sim’s new home! Sure, the listing said “haunted,” but everyone knows that’s just a myth. Why should you believe it? At night, though… well. The lights flicker overhead, casting shadows at your Sim’s feet. In another room, a door slams shut, even though no one else is home. And what was that sound? Where’s it coming from? This is getting weird. Okay, so it turns out there are some rumors that turn out to be true. These spooky specters moved in first, and they don’t let anyone forget it.  Mysterious runes and clay hands appear randomly while crawling vines sprout in the yard. The sacred candle your Sim lit for safety blows out with barely a wisp of smoke. And no one knows where that horrifying doll came from. As the house gets weirder and weirder, goosebumps rise and scared Sims scatter in a panic-induced terror. Luckily, your Sim doesn’t have to deal with this alone! There’s one helpful friend who’s happy to help: Claude René Duplantier Guidry (the Ghost). This somewhat flirty apparition offers the secrets to serenity. Under his tutelage, learn how to appease the specters ruining a good night’s sleep. Some specters are playful, other mischievous, and a few are downright ornery. If they leave accursed objects behind, try to tidy up and remove them. Offer gifts or attempt communicating with the specters to try and please them. If they’re satisfied, Sims might get a present in return as the specter fades away. Otherwise, it’s time to turn to the séance table. [Electronic Arts]… Expand"}, {"name": "The Jackbox Party Pack 7", "details_link": "https://www.metacritic.com/game/switch/the-jackbox-party-pack-7", "publisher": "Jackbox Games, Inc.", "release_date": "Oct 15 2020", "developers": ["Jackbox Games", "Inc."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 8 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/e25c5ae887e95ac3691eb68f4b5e0851-98.jpg", "descriptions": "Five new games: the hit threequel Quiplash 3, the collaborative chaos of The Devils and the Details, the fierce drawing game Champ’d Up, the speech game Talking Points and the guessing game Blather 'Round. Use phones or tablets as controllers and play with up to 8 players, and an audience ofFive new games: the hit threequel Quiplash 3, the collaborative chaos of The Devils and the Details, the fierce drawing game Champ’d Up, the speech game Talking Points and the guessing game Blather 'Round. Use phones or tablets as controllers and play with up to 8 players, and an audience of 10,000.… Expand"}, {"name": "A Hat in Time", "details_link": "https://www.metacritic.com/game/switch/a-hat-in-time", "publisher": "Gears for Breakfast", "release_date": "Oct 18 2019", "developers": ["Gears for Breakfast"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/5d185be21de574e70b6a53ea73266187-98.jpg", "descriptions": "A Hat in Time is a 3D collect-a-thon platformer featuring a little girl with a lot of heart! Travel the universe with Hat Kid as you rival the evil Mustache Girl in order to save the world! Unlock new platforming abilities, more combat moves and spice up your attacks with badges attached toA Hat in Time is a 3D collect-a-thon platformer featuring a little girl with a lot of heart! Travel the universe with Hat Kid as you rival the evil Mustache Girl in order to save the world! Unlock new platforming abilities, more combat moves and spice up your attacks with badges attached to your hat!… Expand"}, {"name": "Amnesia Collection", "details_link": "https://www.metacritic.com/game/switch/amnesia-collection", "publisher": "Frictional Games", "release_date": "Sep 12 2019", "developers": ["Frictional Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/ce156c02bfb69b32ff3b85f1f5b2f0cd-98.jpg", "descriptions": "Amnesia: The Dark Descent puts you in the shoes of Daniel as he wakes up in a desolate castle, barely remembering anything about his past. Exploring its eerie pathways, you must piece together Daniel's troubled memories and uncover the horror that lies deep below.\r In Amnesia: A MachineAmnesia: The Dark Descent puts you in the shoes of Daniel as he wakes up in a desolate castle, barely remembering anything about his past. Exploring its eerie pathways, you must piece together Daniel's troubled memories and uncover the horror that lies deep below.\r In Amnesia: A Machine For Pigs, wealthy industrialist Oswald Mandus wakes in his bed wracked with fever and haunted by dreams of a dark and hellish engine. All he knows is that his children are in grave peril, and it's up to him to save them.Amnesia: Justine puts you through a series of trials constructed by a demented mind. Will you risk your own life to save others?… Expand"}, {"name": "RIDE 3", "details_link": "https://www.metacritic.com/game/xbox-one/ride-3", "publisher": "MileStone Inc.", "release_date": "Nov 30 2018", "developers": ["MileStone Inc.", "Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/177e2b45accee166b15cea3d3266f947-98.jpg", "descriptions": "Experience what the creators promise to be the most complete racing ever with RIDE 3. Race on different tracks all over the world, put your favourite vehicles' speed to the test and have fun by customising them with the new Livery Editor."}, {"name": "XType Plus", "details_link": "https://www.metacritic.com/game/wii-u/xtype-plus", "publisher": "PhobosLab", "release_date": "Aug 14 2014", "developers": ["PhobosLab"], "platforms": "Wii U", "genres": ["Action", "Shooter", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/7652e67b254e65c4677f1e5f7687fa76-98.jpg", "descriptions": "Pure 2D blasting is what retro shooter, XType Plus, has in its gun sights, as it docks for download exclusively in Nintendo eShop on Wii U.\r Youll need a sturdy trigger finger to survive this vertical blaster, as you pilot an insignificant vessel against an infinite series ofPure 2D blasting is what retro shooter, XType Plus, has in its gun sights, as it docks for download exclusively in Nintendo eShop on Wii U.\r Youll need a sturdy trigger finger to survive this vertical blaster, as you pilot an insignificant vessel against an infinite series of randomly-generated bosses, each more difficult than the last. Its a simple mission: wipe out the enemy and dont get hit. The action kicks off with a laidback feel but very soon ramps up to hardcore proportions, where dodging is the key to survival. Lose your three lives, and its lights out.\r As you battle on, youll come under relentless enemy fire from hulking, organic-looking ships. And XType Plus relishes every single shot, as huge patterns of bullets descend on your ship, leaving the slimmest of spaces to squeeze through. One blessing is your tiny hit box - only a direct impact to the core will take you out, although youll still need fighter-pilot reflexes and the eyes of a hawk to stay alive.\r Beyond the blasting, XType brings fresh content in a supercharged Plus mode, exclusive to Wii U, pitting you against the clock, your lives exchanged for a countdown. Add in EMP bombs (electromagnetic pulse) and a larger enemy arsenal, and youve got tension on a plate.\r Conquer that all-important high score for a badge of honour, then showboat with the best of them via the leaderboard system. Better yet, every high score you upload is accompanied by a video of your game, and other players will be able to watch your performance, good or bad! The upside is that you can also watch how the top ten players reach such lofty heights - they might just help your battle strategy in XType Plus, a lean, pared down and intense challenge for all Wii U shooter fans.\r -Destroy an endless stream of bosses for the highest of high scores\r-Blast against the clock in Plus Mode, new for Wii U\r-Upload gameplay videos and check out other gamers victory runs… Expand"}, {"name": "Pokemon Emerald Version", "details_link": "https://www.metacritic.com/game/game-boy-advance/pokemon-emerald-version", "publisher": "Nintendo", "release_date": "Apr 30 2005", "developers": ["Game Freak"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 76, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/2/cf85e63d7a80447659c4dd21149d1756-98.jpg", "descriptions": "Like previous Pokémon games, Emerald challenges you to collect, trade, and battle Pokémon. In this extension of Pokémon Ruby and Pokémon Sapphire, you must stop Team Magma and Team Aqua from expanding and taking over the world of Hoenn. Help maintain the balanceLike previous Pokémon games, Emerald challenges you to collect, trade, and battle Pokémon. In this extension of Pokémon Ruby and Pokémon Sapphire, you must stop Team Magma and Team Aqua from expanding and taking over the world of Hoenn. Help maintain the balance by bringing your strategies and tactics onto all-new battlefields. In addition to single-player challenges, the game features multiplayer trading and battling with up to four players using a wireless adapter.… Expand"}, {"name": "Metal Gear Solid V: Ground Zeroes", "details_link": "https://www.metacritic.com/game/xbox-one/metal-gear-solid-v-ground-zeroes", "publisher": "Konami", "release_date": "Mar 18 2014", "developers": ["Kojima Productions"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General", "Modern", "Open-World"], "meta_score": 76, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/0e796cb4745043a1638f4ca726d67d51-98.jpg", "descriptions": "Ground Zeroes showcases Kojima Productions' FOX Engine, a true next-generation game engine which promises to revolutionize the Metal Gear Solid experience. The first Metal Gear Solid title to offer open world gameplay. Ground Zeroes offers total freedom of play: how missions are undertakenGround Zeroes showcases Kojima Productions' FOX Engine, a true next-generation game engine which promises to revolutionize the Metal Gear Solid experience. The first Metal Gear Solid title to offer open world gameplay. Ground Zeroes offers total freedom of play: how missions are undertaken is entirely down to the user. Unrestricted stealth: Imagine classic Metal Gear gameplay but with no restrictions or boundaries. Players use intelligence and cerebral strategy to sneak their way through entire missions, or go in all guns blazing. Each will have different effects on game consequences and advancement. Multiple missions and tasks - Ground Zeroes boasts a central story mode and Side-Ops missions ranging from tactical action, aerial assaults and \"covert\" missions that will be sure to surprise. Ground Zeroes users will benefit from a clean in-game HUD that shows the minimal amount of on-screen data to give a more intense gaming experience. [Konami]… Expand"}, {"name": "Tales of Hearts R", "details_link": "https://www.metacritic.com/game/playstation-vita/tales-of-hearts-r", "publisher": "Bandai Namco Games", "release_date": "Nov 11 2014", "developers": ["7thChord"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/c2c1aba6adb26f5344d76ac438b20d4a-98.jpg", "descriptions": "Kor Meteor is a youngster surviving in a small village by the sea who trains with his grandfather in the ways of the sword. Impressed by Kor’s increasing skills, his grandfather leaves to him an atypical weapon known as a Soma. Kor meets a young lady, Kohaku Hearts who is in search of a SomaKor Meteor is a youngster surviving in a small village by the sea who trains with his grandfather in the ways of the sword. Impressed by Kor’s increasing skills, his grandfather leaves to him an atypical weapon known as a Soma. Kor meets a young lady, Kohaku Hearts who is in search of a Soma weapon along with her brother Hisui. Amidst their search, a mysterious witch surfaces and casts a spell on Kohaku’s Spiria, the embodiment of her heart and soul. Kor tries to lift the spell by connecting to her Spiria but inadvertently shatters her Spiria Core, the font of all her emotions. Kor, armed only with the Soma left to him by his grandfather, must now embark on a journey to discover a way to make Kohaku’s Spiria whole once again.… Expand"}, {"name": "LEGO Marvel Super Heroes 2", "details_link": "https://www.metacritic.com/game/switch/lego-marvel-super-heroes-2", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 14 2017", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/0133b95f68f421c0888cf82c0dc24648-98.jpg", "descriptions": "With a completely original branching storyline, LEGO® Marvel Super Heroes 2  introduces amazing new gameplay features, including the ability for characters to manipulate time and a four-player competitive Super Hero battling mode. With a huge array of brand new characters from the MarvelWith a completely original branching storyline, LEGO® Marvel Super Heroes 2  introduces amazing new gameplay features, including the ability for characters to manipulate time and a four-player competitive Super Hero battling mode. With a huge array of brand new characters from the Marvel Universe, including old favorites in new guises, this game is sure to thrill both LEGO and Marvel fans, as well as newcomers to the series.… Expand"}, {"name": "1000 Tiny Claws", "details_link": "https://www.metacritic.com/game/psp/1000-tiny-claws", "publisher": "Mediatonic", "release_date": "Oct  4 2011", "developers": ["Mediatonic"], "platforms": "PSP", "genres": ["Action", "General", "General"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/8c2876b75e9b2d3e373a3603292e51cd-98.jpg", "descriptions": "1000 Tiny Claws is the third PlayStation Minis game from developer Mediatonic."}, {"name": "RoboBlitz", "details_link": "https://www.metacritic.com/game/xbox-360/roboblitz", "publisher": "Microsoft Game Studios", "release_date": "Nov 28 2006", "developers": ["Naked Sky Entertainment"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/74bec3f9a136b91dfe1d077b8e733632-98.jpg", "descriptions": "[Xbox Live Arcade]  RoboBlitz is a humorous, physics-driven action game full of inventive gizmos, weapons, and environments. Players take on the role of Blitz, a multi-talented robot who must activate an aging Space Cannon to save his world from a band of maladjusted space pirates. Set in[Xbox Live Arcade]  RoboBlitz is a humorous, physics-driven action game full of inventive gizmos, weapons, and environments. Players take on the role of Blitz, a multi-talented robot who must activate an aging Space Cannon to save his world from a band of maladjusted space pirates. Set in seven distinct environments, RoboBlitz features 19 levels of puzzle-solving and high-intensity action. [Naked Sky Entertainment]… Expand"}, {"name": "Sam & Max: The Devil's Playhouse - Episode 4: Beyond the Alley of the Dolls", "details_link": "https://www.metacritic.com/game/pc/sam-max-the-devils-playhouse---episode-4-beyond-the-alley-of-the-dolls", "publisher": "Telltale Games", "release_date": "Jul 20 2010", "developers": ["Telltale Games"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "3D", "Compilation", "Third-Person"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/59be9c445cf8dda808f6cb1457b57f17-98.jpg", "descriptions": "The new season Sam & Max: The Devil's Playhouse is the biggest, strangest and most epic to date. As the saga begins, an otherworldy power for controlling matter and space calls to the strongest and strangest who might wield it - intergalactic warlords and eldritch gods, under-dwellers andThe new season Sam & Max: The Devil's Playhouse is the biggest, strangest and most epic to date. As the saga begins, an otherworldy power for controlling matter and space calls to the strongest and strangest who might wield it - intergalactic warlords and eldritch gods, under-dwellers and scholars of the arcane.… Expand"}]