[
  {
    "name": "Medal of Honor: Allied Assault",
    "details_link": "https://www.metacritic.com/game/pc/medal-of-honor-allied-assault",
    "publisher": "Electronic Arts",
    "release_date": "Jan 20 2002",
    "developers": [
      "2015"
    ],
    "platforms": "PC",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Historic",
      "Historic",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/9/59b0a16eb0c85a314d5dcafc20cd34f7-98.jpg",
    "descriptions": "As Lt. Mike Powell, member of the famed 1st Ranger Battalion, you'll battle through over 20 levels based on historical military campaigns of World War II. Fire period weapons and command authentic war vehicles as you silence the gun batteries at Port Arzew, survive the Omaha Beach landing,As Lt. Mike Powell, member of the famed 1st Ranger Battalion, you'll battle through over 20 levels based on historical military campaigns of World War II. Fire period weapons and command authentic war vehicles as you silence the gun batteries at Port Arzew, survive the Omaha Beach landing, and more. [Electronic Arts]… Expand"
  },
  {
    "name": "Myth: The Fallen Lords",
    "details_link": "https://www.metacritic.com/game/pc/myth-the-fallen-lords",
    "publisher": "Bungie Software",
    "release_date": "Oct 31 1997",
    "developers": [
      "Bungie Software",
      "Bungie"
    ],
    "platforms": "PC",
    "num_players": "1-16 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 91,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/0/9b2b57cbbfdff713e41d1498f6ae05e0-98.jpg",
    "descriptions": "Myth is arguably the first real-time strategy game to put the player in a true 3D landscape, with an emphasis on tactical battlefield action rather than base construction. Myth also happens to be one of Bungie's most successful pre-Halo releases, and shows off the company's range and abilityMyth is arguably the first real-time strategy game to put the player in a true 3D landscape, with an emphasis on tactical battlefield action rather than base construction. Myth also happens to be one of Bungie's most successful pre-Halo releases, and shows off the company's range and ability in genres outside of first-person shooters. A single player mode features an engrossing and enjoyable plot, with you battling the evil and eponymous Fallen Lords, their evil leader, Balor and all manner of undead creatures, but Myth's multiplayer is where it really stands out. Bungie.net's game-matching technology has been much-emulated since, and at Myth's release, was something truly special. Multiple game modes including King of the Hill, Steal the Bacon and even co-op added huge variety to what was an outstanding and standard-setting game - and it still is. If ever an older game deserved another visit, it's Myth, with a huge, loyal and highly motivated following. [Bungie]… Expand"
  },
  {
    "name": "LittleBigPlanet 2",
    "details_link": "https://www.metacritic.com/game/playstation-3/littlebigplanet-2",
    "publisher": "SCEA",
    "release_date": "Jan 18 2011",
    "developers": [
      "Media Molecule"
    ],
    "platforms": "PlayStation 3",
    "num_players": "4  Online",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 91,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/7/d19a11fa8aff99a09a9f34858bd7511c-98.jpg",
    "descriptions": "Media Molecule and Sony Europe are already working on a follow-up to their critically acclaimed platformer."
  },
  {
    "name": "INSIDE",
    "details_link": "https://www.metacritic.com/game/switch/inside",
    "publisher": "PLAYDEAD",
    "release_date": "Jun 28 2018",
    "developers": [
      "PLAYDEAD"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/2/9707c53332e67137577454c38a8e2126-98.jpg",
    "descriptions": "Hunted and alone, a boy finds himself drawn into the center of a dark project."
  },
  {
    "name": "Microsoft Flight Simulator",
    "details_link": "https://www.metacritic.com/game/pc/microsoft-flight-simulator",
    "publisher": "Xbox Game Studios",
    "release_date": "Aug 18 2020",
    "developers": [
      "Asobo Studio"
    ],
    "platforms": [
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Simulation",
      "Flight",
      "Civilian"
    ],
    "meta_score": 91,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/8/f41c89f11e6eadc4b934fcd6504a0800-98.jpg",
    "descriptions": "From light planes to wide-body jets, fly highly detailed and accurate aircraft in the next generation of Microsoft Flight Simulator. Test your piloting skills against the challenges of night flying, real-time atmospheric simulation and live weather in a dynamic and living world."
  },
  {
    "name": "Chained Echoes",
    "details_link": "https://www.metacritic.com/game/pc/chained-echoes",
    "publisher": "Deck 13",
    "release_date": "Dec  8 2022",
    "developers": [
      "Matthias Linda"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 91,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/fed21c4393244efda5b8151d5a0c478a-98.jpg",
    "descriptions": "Take up your sword, channel your magic or board your Mech. Chained Echoes is a 16-bit SNES style RPG set in a fantasy world where dragons are as common as piloted mechanical suits. Follow a group of heroes as they explore a land filled to the brim with charming characters, fantasticTake up your sword, channel your magic or board your Mech. Chained Echoes is a 16-bit SNES style RPG set in a fantasy world where dragons are as common as piloted mechanical suits. Follow a group of heroes as they explore a land filled to the brim with charming characters, fantastic landscapes and vicious foes.\r Can you bring peace to a continent where war has been waged for generations and betrayal lurks around every corner?\r Chained Echoes is a story-driven game where a group of heroes travel around the vast continent of Valandis to bring an end to the war between its three kingdoms. In the course of their journey, they will travel through a wide array of diverse landscapes spanning from wind-tanned plateaus and exotic archipelagos to sunken cities and forgotten dungeons.… Expand"
  },
  {
    "name": "Guitar Hero",
    "details_link": "https://www.metacritic.com/game/playstation-2/guitar-hero",
    "publisher": "RedOctane",
    "release_date": "Nov  7 2005",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Rhythm",
      "Music"
    ],
    "meta_score": 91,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/0/0d2c48bcdd83f45b4f4ec10359cd41fd-98.jpg",
    "descriptions": "Strap on your Guitar Hero SG controller, plug-in, and CRANK IT UP. Guitar Hero creates all the sensations of being a rock star, as you rock out to 30 of the greatest rock anthems of all time and more. Soundtrack includes songs as made famous by such legendary artists as the Red Hot ChiliStrap on your Guitar Hero SG controller, plug-in, and CRANK IT UP. Guitar Hero creates all the sensations of being a rock star, as you rock out to 30 of the greatest rock anthems of all time and more. Soundtrack includes songs as made famous by such legendary artists as the Red Hot Chili Peppers, David Bowie, Boston, Sum 41, Ozzy Osbourne, Audioslave, White Zombie, Franz Ferdinand, and The Ramones. So kiss that air guitar goodbye and get ready to rock. Features over 30 of the greatest rock songs of all-time. 4 difficulty levels (Easy, Medium, Hard, and Expert). 6 venues that range from basement parties to sold out stadiums. 8 different characters that each offer their own look and unique style of playing, from metal head to classic rocker. Two-player mode that offers tons of multiplayer fun. [Red Octane]… Expand"
  },
  {
    "name": "World of Warcraft: Wrath of the Lich King",
    "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft-wrath-of-the-lich-king",
    "publisher": "Blizzard Entertainment",
    "release_date": "Nov 13 2008",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": "PC",
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Miscellaneous",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Board / Card Game",
      "Fantasy",
      "Fantasy"
    ],
    "meta_score": 91,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/e6f4d1b934f771c4f48823d5d560c051-98.jpg",
    "descriptions": "Players last visited Northrend in \"Warcraft III: The Frozen Throne,\" when Arthas Menethil fused with the spirit of Ner’zhul to become the Lich King, one of the most powerful beings in the Warcraft universe. He now broods atop the Frozen Throne deep in Icecrown Citadel, clutching the runePlayers last visited Northrend in \"Warcraft III: The Frozen Throne,\" when Arthas Menethil fused with the spirit of Ner’zhul to become the Lich King, one of the most powerful beings in the Warcraft universe. He now broods atop the Frozen Throne deep in Icecrown Citadel, clutching the rune blade Frostmourne and marshaling the undead armies of the Scourge. In Wrath of the Lich King, the forces of the Alliance and the Horde venture into battle against the Scourge amid Northrend’s howling winds and fields of jagged ice. Wrath of the Lich King adds a rich variety of content to an already massive game. New features in the game’s second expansion include: Death Knight Hero Class: Create a high-level Death Knight character -- the game’s first hero class -- once certain challenges have been met. Increased Level Cap: Advance to level 80 and gain potent new talents and abilities along the way. Northrend: Explore the harsh new continent of Northrend, packed with new zones, quests, dungeons, monsters, and items -- and do battle with the undead armies of the Lich King. \"Inscription\" Profession: Learn this exciting new profession and gain unique ways to permanently enhance spells and abilities in the game. Siege Weapons and Destructible Buildings: Take the battle to another level with new player-vs.-player game mechanics and new battlefields to wage war on. New Character Customization: Change how characters look and express themselves, with different hairstyles and dance animations. [Blizzard Entertainment]… Expand"
  },
  {
    "name": "Rock Band 3",
    "details_link": "https://www.metacritic.com/game/wii/rock-band-3",
    "publisher": "MTV Games",
    "release_date": "Oct 26 2010",
    "developers": [
      "Backbone Entertainment"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 91,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/4/2c8c060d25b201ecd39c16cb16edaddc-98.jpg",
    "descriptions": "Rock Band returns with the third iteration of the popular music game featuring new songs and instruments."
  },
  {
    "name": "Metroid Prime Trilogy",
    "details_link": "https://www.metacritic.com/game/wii/metroid-prime-trilogy",
    "publisher": "Nintendo",
    "release_date": "Aug 24 2009",
    "developers": [
      "Retro Studios"
    ],
    "platforms": "Wii",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Miscellaneous",
      "Shooter",
      "Compilation",
      "Compilation",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 91,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/1/8c8df35f95f26fd350c969c3d2cc8e87-98.jpg",
    "descriptions": "Metroid Prime 3: Corruption set a new standard for first-person motion controls in video games. Now it’s bringing those controls to the rest of the celebrated series, allowing players to experience the entire Metroid Prime story arc with the precision of the Wii Remote. Metroid PrimeMetroid Prime 3: Corruption set a new standard for first-person motion controls in video games. Now it’s bringing those controls to the rest of the celebrated series, allowing players to experience the entire Metroid Prime story arc with the precision of the Wii Remote. Metroid Prime Trilogy, is a three-game collection for the Wii console that bundles all three landmark Metroid Prime games onto one disc and revamps the first two installments with intuitive Wii Remote controls, wide-screen presentation and other enhancements. Each game maintains its original storyline and settings, but now Metroid Prime and Metroid Prime 2: Echoes let players use their Wii Remote to aim with precision as heroine Samus Aran. Based on the breakthrough control system that debuted in Metroid Prime 3: Corruption, these new Wii controls bring an entirely new level of immersion and freedom to these milestone games. Players can access the game they want from a unified main menu that ties together all three adventures. Through a new unlockables system, players can gain access to in-game rewards such as music and artwork by accomplishing objectives across all three games. [Nintendo]… Expand"
  },
  {
    "name": "I Was a Teenage Exocolonist",
    "details_link": "https://www.metacritic.com/game/pc/i-was-a-teenage-exocolonist",
    "publisher": "Northway Games",
    "release_date": "Aug 25 2022",
    "developers": [
      "Northway Games"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Card Battle"
    ],
    "meta_score": 91,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/2/dc5caaa4f837b11f31439c0520326dd4-98.jpg",
    "descriptions": "Spend your teenage years on an alien planet in this narrative RPG with card-based battles. Explore, grow up, and fall in love. The choices you make and skills you master over ten years will determine the course of your life and the survival of your colony."
  },
  {
    "name": "Overwatch",
    "details_link": "https://www.metacritic.com/game/pc/overwatch",
    "publisher": "Blizzard Entertainment",
    "release_date": "May 23 2016",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "General",
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 91,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/5/5b4b131363a4dba40e923bb8f788d56e-98.jpg",
    "descriptions": "Overwatch is a highly stylized team-based shooter set on earth in the near future. Every match is an intense multiplayer showdown pitting a diverse cast of soldiers, mercenaries, scientists, adventurers, and oddities against each other in an epic, globe-spanning conflict."
  },
  {
    "name": "F1 Challenge '99-'02",
    "details_link": "https://www.metacritic.com/game/pc/f1-challenge-99-02",
    "publisher": "Electronic Arts",
    "release_date": "Jun 24 2003",
    "developers": [
      "Electronic Arts"
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Formula One",
      "Formula One",
      "Automobile"
    ],
    "meta_score": 91,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/b87a595e7008b848233fa3ef6cb517b0-98.jpg",
    "descriptions": "Cutting-edge technology brings you the most accurate representation of Formula One to date. High-resolution car models include details right down to the very last shut line. Circuits include real life structures, helicopters, airplanes, panoramic skies, animated grid girls, motion capturedCutting-edge technology brings you the most accurate representation of Formula One to date. High-resolution car models include details right down to the very last shut line. Circuits include real life structures, helicopters, airplanes, panoramic skies, animated grid girls, motion captured pit crews, and even bumps in the track surface as they exist in reality. The glossy team-themed user interface puts you in the game and tracks your performance as a real life driver competing against the likes of world champion drives such as Damon Hill, Jacques Villeneuve, Mika Hakkinen, and Michael Schumacher. [Electronic Arts]… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 4",
    "details_link": "https://www.metacritic.com/game/gamecube/tony-hawks-pro-skater-4",
    "publisher": "Activision",
    "release_date": "Oct 23 2002",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": "GameCube",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 91,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/0/d20a372ec72ee10f78e3144ba99f532d-98.jpg",
    "descriptions": "Drop into the ultimate challenge.  In the next chapter in the Tony Hawk series, pros challenge you to make your mark in huge free-roaming levels, taking on 190 progressively harder goals with no time limits to hold you back.  Decide when you're ready to take on your Pro Challenge and moveDrop into the ultimate challenge.  In the next chapter in the Tony Hawk series, pros challenge you to make your mark in huge free-roaming levels, taking on 190 progressively harder goals with no time limits to hold you back.  Decide when you're ready to take on your Pro Challenge and move into the pro ranks, where it's a whole new game.  Build your skills, perform all-new tricks, play up to eight players online, and show that you've got what it takes to go Pro.  … Expand"
  },
  {
    "name": "Madden NFL 2001",
    "details_link": "https://www.metacritic.com/game/playstation-2/madden-nfl-2001",
    "publisher": "EA Sports",
    "release_date": "Oct 23 2000",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/5/465bd4c904570e3b95e139607a071e48-98.jpg",
    "descriptions": "EA Sports steps up to the challenge of Sega's \"NFL2k1\" with mind-blowing graphics and innovative \"Madden Cards\" -- Upper Deck creations purchased with tokens earned by completing in-game challenges which can be used as power-ups during the game.  Match up all current NFL teams as well asEA Sports steps up to the challenge of Sega's \"NFL2k1\" with mind-blowing graphics and innovative \"Madden Cards\" -- Upper Deck creations purchased with tokens earned by completing in-game challenges which can be used as power-ups during the game.  Match up all current NFL teams as well as great teams from the past in Season, Franchise, or Practice modes.… Expand"
  },
  {
    "name": "Baldur's Gate",
    "details_link": "https://www.metacritic.com/game/pc/baldurs-gate",
    "publisher": "Interplay",
    "release_date": "Dec 21 1998",
    "developers": [
      "BioWare"
    ],
    "platforms": "PC",
    "num_players": "Up to 6 ",
    "genres": [
      "Role-Playing",
      "PC-style RPG",
      "PC-style RPG",
      "Western-Style"
    ],
    "meta_score": 91,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/2/89a0525888498746e946d4df9faeb383-98.jpg",
    "descriptions": "Baldur's Gate takes you back to the Forgotten Realms on a visually dazzling role-playing adventure, one that brings to life the grand tradition of Advanced Dungeons & Dragons through cutting edge art and technology. Immerse yourself in this quintessential medieval fantasy world, where entireBaldur's Gate takes you back to the Forgotten Realms on a visually dazzling role-playing adventure, one that brings to life the grand tradition of Advanced Dungeons & Dragons through cutting edge art and technology. Immerse yourself in this quintessential medieval fantasy world, where entire nations hang in the balance of your actions, dark prophecies test your resolve, and heroic dreams can be fulfilled at last. [Interplay]… Expand"
  },
  {
    "name": "Bayonetta 2",
    "details_link": "https://www.metacritic.com/game/wii-u/bayonetta-2",
    "publisher": "Nintendo",
    "release_date": "Sep 20 2014",
    "developers": [
      "PlatinumGames"
    ],
    "platforms": [
      "Switch",
      "Wii U"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Fantasy",
      "Linear"
    ],
    "meta_score": 91,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/6/6a766bb02b7f6576ea561c7271f2f9dc-98.jpg",
    "descriptions": "In this climatic sequel to the critically acclaimed Bayonetta action game, players will be on the edge of their seats from start to finish. Brimming with epic, gorgeous cut scenes and battles that are more exhilarating than ever, this game never lets up on the action. Fight on top of a jetIn this climatic sequel to the critically acclaimed Bayonetta action game, players will be on the edge of their seats from start to finish. Brimming with epic, gorgeous cut scenes and battles that are more exhilarating than ever, this game never lets up on the action. Fight on top of a jet as it soars through a downtown city. Duke it out against a giant angel, who bears a whip for an arm, on top of a speeding train. And take to the skies in a fight against a demonic monster while ascending to the top of a skyscraper.… Expand"
  },
  {
    "name": "The Witcher 3: Wild Hunt",
    "details_link": "https://www.metacritic.com/game/xbox-one/the-witcher-3-wild-hunt",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "May 19 2015",
    "developers": [
      "CD Projekt Red Studio"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action RPG",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 91,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/6/125517eba511f72aba84a3d7a47a798c-98.jpg",
    "descriptions": "With the Empire attacking the Kingdoms of the North and the Wild Hunt, a cavalcade of ghastly riders,  breathing down your neck, the only way to survive is to fight back. As Geralt of Rivia, a master swordsman and monster hunter, leave none of your enemies standing. Explore a gigantic openWith the Empire attacking the Kingdoms of the North and the Wild Hunt, a cavalcade of ghastly riders,  breathing down your neck, the only way to survive is to fight back. As Geralt of Rivia, a master swordsman and monster hunter, leave none of your enemies standing. Explore a gigantic open world, slay beasts and decide the fates of whole communities with your actions, all in a genuine next generation format.… Expand"
  },
  {
    "name": "Rock Band 3",
    "details_link": "https://www.metacritic.com/game/playstation-3/rock-band-3",
    "publisher": "MTV Games",
    "release_date": "Oct 26 2010",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 91,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/3/4fd725f0ec10e1ef75d3c17ddfe95d58-98.jpg",
    "descriptions": "Rock Band returns with another iteration of the popular music game featuring new songs and instruments."
  },
  {
    "name": "Klonoa 2: Lunatea's Veil",
    "details_link": "https://www.metacritic.com/game/playstation-2/klonoa-2-lunateas-veil",
    "publisher": "Namco",
    "release_date": "Jul 25 2001",
    "developers": [
      "Namco"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 91,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/6/2835a47f4c9ff4946765017709bac195-98.jpg",
    "descriptions": "The sequel to 1997's sleeper platformer hit \"Klonoa:  Door to Phantomile\" finds our floppy-eared, baseball cap-wearing hero collecting dream stones and over-inflating his enemies with air bullets while protecting the dream world of Lunatea in this \"2-D style\" action game."
  },
  {
    "name": "IL-2 Sturmovik",
    "details_link": "https://www.metacritic.com/game/pc/il-2-sturmovik",
    "publisher": "Ubisoft",
    "release_date": "Nov 18 2001",
    "developers": [
      "1C",
      "1C Entertainment"
    ],
    "platforms": "PC",
    "num_players": "1-32 ",
    "genres": [
      "Simulation",
      "Flight",
      "WWII",
      "WWII",
      "Combat"
    ],
    "meta_score": 91,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/0/9370bb068a74c8c81a364fc7a4244318-98.jpg",
    "descriptions": "Fly 31 types of Russian, German and American planes. Engage in air-to-air and air-to-ground battles. Multiplay with up to 32 players in dogfight and 16 players in cooperative missions. Use custom paint schemes, squadron nose art, numbering on wings, and national markings for each plane. [Ubi Soft]"
  },
  {
    "name": "Mario Tennis",
    "details_link": "https://www.metacritic.com/game/nintendo-64/mario-tennis",
    "publisher": "Nintendo",
    "release_date": "Aug 28 2000",
    "developers": [
      "Camelot Software Planning"
    ],
    "platforms": "Nintendo 64",
    "genres": [
      "Sports",
      "Traditional",
      "Tennis"
    ],
    "meta_score": 91,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/404e27e5e116e46a5efb883c78d6d300-98.jpg",
    "descriptions": "All of your favorite characters hit the court in a wild and wacky multiplayer tennis game from the makers of Mario Golf. Mario, Luigi, Bowser, Peach, Toad, and Donkey Kong lead off the all-star, 14-player line-up. The fast-paced action will have you unleashing vicious volleys, life-savingAll of your favorite characters hit the court in a wild and wacky multiplayer tennis game from the makers of Mario Golf. Mario, Luigi, Bowser, Peach, Toad, and Donkey Kong lead off the all-star, 14-player line-up. The fast-paced action will have you unleashing vicious volleys, life-saving lobs, ballistic backhands and electrifying super-charged smashes!… Expand"
  },
  {
    "name": "FreeSpace 2",
    "details_link": "https://www.metacritic.com/game/pc/freespace-2",
    "publisher": "Interplay",
    "release_date": "Sep 30 1999",
    "developers": [
      "Volition Inc."
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Simulation",
      "Sci-Fi",
      "Space",
      "Small Spaceship",
      "Small Spaceship",
      "Combat"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/3/28edf758857984205ae5ad2aa0edeac0-98.jpg",
    "descriptions": "The year is 2367. Thirty-two years have passed since the Great War. As Terrans and Vasudans struggle to rebuild their civilizations, civil war erupts in the Polaris system. A rogue Terran admiral declares war against the Vasudans, threatening the stability of the Alliance. Without warning,The year is 2367. Thirty-two years have passed since the Great War. As Terrans and Vasudans struggle to rebuild their civilizations, civil war erupts in the Polaris system. A rogue Terran admiral declares war against the Vasudans, threatening the stability of the Alliance. Without warning, the Shivans return, and Terrans and Vasudans face annihilation at the hands of their Great War nemesis. [Interplay]… Expand"
  },
  {
    "name": "Colony Wars",
    "details_link": "https://www.metacritic.com/game/playstation/colony-wars",
    "publisher": "Psygnosis",
    "release_date": "Oct 31 1997",
    "developers": [
      "Psygnosis"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Simulation",
      "Sci-Fi",
      "Small Spaceship"
    ],
    "meta_score": 91,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/3/45688158c3cdea5500e5160be1043d8c-98.jpg",
    "descriptions": "Delivers the real experience with its spectacular cinematic graphics."
  },
  {
    "name": "Metal Gear Solid V: The Phantom Pain",
    "details_link": "https://www.metacritic.com/game/pc/metal-gear-solid-v-the-phantom-pain",
    "publisher": "Konami",
    "release_date": "Sep  1 2015",
    "developers": [
      "Kojima Productions"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Action Adventure",
      "Modern",
      "Open-World"
    ],
    "meta_score": 91,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/7/308b6defa2a2ea0fa6ddd8a59e4aa69f-98.jpg",
    "descriptions": "The Soviet invasion of Afghanistan has brought a new edge to the Cold War, and in 1984, a one-eyed man with a prosthetic arm appears in the country. Those who know him call him Snake; the legendary mercenary who was once swept from the stage of history and left in a coma by American privateThe Soviet invasion of Afghanistan has brought a new edge to the Cold War, and in 1984, a one-eyed man with a prosthetic arm appears in the country. Those who know him call him Snake; the legendary mercenary who was once swept from the stage of history and left in a coma by American private intelligence network Cipher. Snake is accompanied by Ocelot, an old friend who saved him from attack when he finally awoke.Now, Snake's former partner Kazuhira Miller is being held by the Soviet forces in Afghanistan. Snake must undertake a solo mission to rescue Miller and prove to the world that the legendary mercenary is not dead and gone. That first step will lead to a path of vengeance against the very Cipher that slaughtered so many of Snake's men, and to a battle that will embroil the whole world...What started in Ground Zeroes must finish with \"V\".… Expand"
  },
  {
    "name": "Ratchet & Clank: Up Your Arsenal",
    "details_link": "https://www.metacritic.com/game/playstation-2/ratchet-clank-up-your-arsenal",
    "publisher": "SCEA",
    "release_date": "Nov  3 2004",
    "developers": [
      "Insomniac Games"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 2"
    ],
    "num_players": "8  Online",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 91,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/8/686e864f4a43978297eabaf2d2808605-98.jpg",
    "descriptions": "(Also known as \"Ratchet & Clank 3\")  The third installment of the Ratchet & Clank franchise incorporates new elements of gameplay not seen previously in the series, including online and offline multiplayer capabilities that will appeal to a wide variety of players. Ratchet and Clank: Up Your(Also known as \"Ratchet & Clank 3\")  The third installment of the Ratchet & Clank franchise incorporates new elements of gameplay not seen previously in the series, including online and offline multiplayer capabilities that will appeal to a wide variety of players. Ratchet and Clank: Up Your Arsenal returns gamers to Planet Veldin, the setting of the original Ratchet & Clank, where the duo set off on a gripping new adventure through a multitude of diverse planets to fight for galactic peace. Players will be able to earn up to 20 weapons (including online and offline) with up to four levels of upgrades for most weapons, plus new high-tech gadgets to help them through their journey. [SCEA]… Expand"
  },
  {
    "name": "Resident Evil (2002)",
    "details_link": "https://www.metacritic.com/game/gamecube/resident-evil-2002",
    "publisher": "Capcom",
    "release_date": "Apr 30 2002",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "GameCube"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Horror"
    ],
    "meta_score": 91,
    "users_score": 9.7,
    "image": "https://static.metacritic.com/images/products/games/1/04846c8119f1197648f9d0d5773108a7-98.jpg",
    "descriptions": "Raccoon City has been completely overrun by mutant beasts and bloodthirsty zombies. You are a member of S.T.A.R.S.--a rescue squad sent into the community to investigate the ominous mansion at the core of the disaster. Take the role of operative Jill Valentine or Chris Redfield and uncoverRaccoon City has been completely overrun by mutant beasts and bloodthirsty zombies. You are a member of S.T.A.R.S.--a rescue squad sent into the community to investigate the ominous mansion at the core of the disaster. Take the role of operative Jill Valentine or Chris Redfield and uncover the secrets behind a radical, genetic research facility. With an array of weapons to master and horrors around every corner, the ultimate test may be just to make it out alive.… Expand"
  },
  {
    "name": "FIFA Soccer 10",
    "details_link": "https://www.metacritic.com/game/playstation-3/fifa-soccer-10",
    "publisher": "Electronic Arts",
    "release_date": "Oct 20 2009",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "Xbox 360",
      "PlayStation 3"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/3/e4de85d163925aaf0cf7557b26808012-98.jpg",
    "descriptions": "On the pitch, critical gameplay fundamentals have been enhanced to ensure that FIFA Soccer 10 mirrors real-world soccer, providing more sophisticated ball control, and physical interaction between players. In addition, players now move, behave and position themselves more realistically. OnOn the pitch, critical gameplay fundamentals have been enhanced to ensure that FIFA Soccer 10 mirrors real-world soccer, providing more sophisticated ball control, and physical interaction between players. In addition, players now move, behave and position themselves more realistically. On attack, players analyze space more effectively, curve their runs in an attempt to stay onside, create passing lanes naturally, and drive for more variety in attacking options. On defense, new concepts like position priority enable defenders to multitask so dangerous spaces left open by teammates out of position are covered. Plus, slide tackle targeting, press marking, and better-urgency clearance logic provide new options that make defending a tactical skill in FIFA Soccer 10. In goal, a myriad of improvements and refinements to goalkeeper intelligence result in a more responsive and powerful rushing system and ultra-realistic saves. Better balance on lofted through balls, improved goalkeeper intelligence, more realistic shooting mechanics with less shots hitting the goal posts, a practice arena to perfect skills, and a more immersive soccer experience through continuous play and quick free kicks are just a few of the issues raised by fans and addressed in FIFA Soccer 10. Three new innovations revealed today at E3 have been developed to change the player control experience in FIFA Soccer 10. The first-ever true 360 degree dribbling system gives players finer control of the ball, enabling them to find spaces between defenders that previously were not possible. Using an all-new animation technology, skilled dribblers now have the ability to face the defender and use highly responsive lateral dribbling to skip past him. An innovative concept called Freedom in Physical Play enables players to perform wider dribble touches and new collision sharing creates a varied, less predictable, and extended fight for possession between the dribbler and a defender.\rFIFA Soccer 10 also features a deeper iteration of the ever-popular Manager Mode with more than 50 major improvements, including new match realism, realistic player transfers based on multiple decision points, and true-to-life player growth curves. [Electronic Arts]… Expand"
  },
  {
    "name": "Resident Evil 4",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/resident-evil-4",
    "publisher": "Capcom",
    "release_date": "Mar 24 2023",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 91,
    "users_score": 4.4,
    "image": "https://static.metacritic.com/images/products/games/2/f169be681306de763413994957debe9f-98.jpg",
    "descriptions": "SURVIVAL IS JUST THE BEGINNING... Resident Evil 4 is a remake of the 2005 original Resident Evil 4. Reimagined for 2023 to bring state-of-the-art survival horror. Resident Evil 4 preserves the essence of the original game, while introducing modernized gameplay, a reimagined storyline, andSURVIVAL IS JUST THE BEGINNING... Resident Evil 4 is a remake of the 2005 original Resident Evil 4. Reimagined for 2023 to bring state-of-the-art survival horror. Resident Evil 4 preserves the essence of the original game, while introducing modernized gameplay, a reimagined storyline, and vividly detailed graphics to make this the latest survival horror game where life and death, terror and catharsis intersect. \r\rSTORY:\r6 years have passed since the biological disaster in Raccoon City. Leon S. Kennedy, one of the survivors of the incident,\rhas been recruited as an agent reporting directly to the president of the United States. With the experience of multiple missions on his back, Leon is sent to rescue the president's kidnapped daughter. He tracks her to a secluded European village, where there is something terribly wrong with the villagers. And the curtain rises on this story of daring rescue and grueling horror.… Expand"
  },
  {
    "name": "Assassin's Creed II",
    "details_link": "https://www.metacritic.com/game/playstation-3/assassins-creed-ii",
    "publisher": "Ubisoft",
    "release_date": "Nov 17 2009",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Historic",
      "Historic",
      "Open-World"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/4/06658bf64234b6fc0c9e9d8772f00f97-98.jpg",
    "descriptions": "Assassin's Creed II is the product of over two years of intensive development by the original creative team behind the Assassin's Creed brand. In a vast open world environment, the game invites players to incarnate Ezio, a privileged young noble in Renaissance Italy who's been betrayed byAssassin's Creed II is the product of over two years of intensive development by the original creative team behind the Assassin's Creed brand. In a vast open world environment, the game invites players to incarnate Ezio, a privileged young noble in Renaissance Italy who's been betrayed by the rival ruling families of Italy. Ezio's subsequent quest for vengeance plunges players into an epic story that offers more variety in missions, surprising and engaging new gameplay elements, diverse weapons and a profound character progression that appeal to fans of the original Assassin's Creed as well as entice players new to the brand. [Ubisoft]… Expand"
  },
  {
    "name": "Metal Gear Solid 3: Snake Eater",
    "details_link": "https://www.metacritic.com/game/playstation-2/metal-gear-solid-3-snake-eater",
    "publisher": "Konami",
    "release_date": "Nov 17 2004",
    "developers": [
      "KCEJ"
    ],
    "platforms": [
      "3DS",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 91,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/0/8b79d92d014ad92c9904c899bca76d4d-98.jpg",
    "descriptions": "In the struggle to achieve world peace and world dominance, rivaling governments are secretly developing weapons technology that could threaten the future existence of life. Destined to be the first, a race ensues to become the ultimate nation. A special elite tactical soldier is summoned toIn the struggle to achieve world peace and world dominance, rivaling governments are secretly developing weapons technology that could threaten the future existence of life. Destined to be the first, a race ensues to become the ultimate nation. A special elite tactical soldier is summoned to penetrate deep in the heart of enemy territory and obtain intel about \"Metal Gear,\" a prototype weapon with nuclear capabilities. This is your mission and you must infiltrate alone. Interactive environments where traps catch enemies and prey. Rely on camouflage, combat, hunting and instincts to survive. Set in the 1960s where politics and war are shaping real world history. Blockbuster musical score composed by Harry Gregson-Williams. [Konami]… Expand"
  },
  {
    "name": "Dragon Quest XI S: Echoes of an Elusive Age - Definitive Edition",
    "details_link": "https://www.metacritic.com/game/switch/dragon-quest-xi-s-echoes-of-an-elusive-age---definitive-edition",
    "publisher": "Square Enix",
    "release_date": "Sep 27 2019",
    "developers": [
      "Square Enix"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 91,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/5/39f4fe25429b192582ddb68d4d24b24f-98.jpg",
    "descriptions": "Dragon Quest XI: Echoes of an Elusive Age tells a captivating tale of a hunted hero and is the long-awaited role-playing game from series creator Yuji Horii, character designer Akira Toriyama and composer Koichi Sugiyama. While it is the eleventh mainline entry in the critically acclaimedDragon Quest XI: Echoes of an Elusive Age tells a captivating tale of a hunted hero and is the long-awaited role-playing game from series creator Yuji Horii, character designer Akira Toriyama and composer Koichi Sugiyama. While it is the eleventh mainline entry in the critically acclaimed series, Dragon Quest XI is a completely standalone experience that features entirely new characters, a beautifully detailed world, finely tuned turn-based combat, and an immersive story that will appeal to long-time fans and franchise newcomers alike. A young man, about to participate in his village's coming of age ceremony, travels to a Sacred Stone alongside his childhood friend. After a series of unexpected events, this intrepid adventurer learns he is the reincarnation of a legendary hero from a forgotten age. The young hero sets forth into an unknown world on a journey to unravel the mystery of his past... but the welcome he receives is far from warm. Upon revealing his identity to the King, the hero is branded as \"The Dark spawn\" and hunted by a relentless army. Fleeing from his pursuers, the hero assembles a band of endearing adventurers who believe he is actually The Luminary reborn. The hero and his newfound companions embark on a quest that will take them across continents and over vast oceans as they learn of an ominous threat facing the world.… Expand"
  },
  {
    "name": "Twisted Metal: Black",
    "details_link": "https://www.metacritic.com/game/playstation-2/twisted-metal-black",
    "publisher": "SCEA",
    "release_date": "Jun 18 2001",
    "developers": [
      "Incognito Inc."
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation 2"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Car Combat"
    ],
    "meta_score": 91,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/5ff96ad2bc3fd43af4dd43219212bc9a-98.jpg",
    "descriptions": "The original designers are back for the fifth game in the \"Twisted Metal Series,\" THE car-combat game cruising at a FAST 60 frames per second, featuring the mysterious Calypso who once again tempts inmates from a local metal hospital to compete in a tournament of automotive mayhem."
  },
  {
    "name": "Spyro: Year of the Dragon",
    "details_link": "https://www.metacritic.com/game/playstation/spyro-year-of-the-dragon",
    "publisher": "SCEA",
    "release_date": "Oct 23 2000",
    "developers": [
      "Insomniac Games"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 91,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/6/8ca82fd8dfc41de620d84057d01b6731-98.jpg",
    "descriptions": "Thieves have kidnapped a brood of dragon eggs, while, elsewhere in the Dragon Lands, a gateway to the Forgotten World has been uncovered. Sent to recapture the eggs, Spyro the Dragon, and his best friend Sparx, face a journey into uncharted territory against his most fearsome enemy yet - theThieves have kidnapped a brood of dragon eggs, while, elsewhere in the Dragon Lands, a gateway to the Forgotten World has been uncovered. Sent to recapture the eggs, Spyro the Dragon, and his best friend Sparx, face a journey into uncharted territory against his most fearsome enemy yet - the Sorceress! All new playable characters, frantic challenges and new exciting worlds to explore - the Year of the Dragon begins here!… Expand"
  },
  {
    "name": "Tomb Raider",
    "details_link": "https://www.metacritic.com/game/playstation/tomb-raider",
    "publisher": "Eidos Interactive",
    "release_date": "Nov 15 1996",
    "developers": [
      "Core Design Ltd."
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "PlayStation"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 91,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/dca192c788f395cfa30291f36223423c-98.jpg",
    "descriptions": "Climb, swim, and backflip your way through a maze of cryptic deathtraps so realistic you can practically smell the decaying flesh. Unload an arsenal of lethal firepower on any wild-dog, giant lizard or blood-thirsty mercenary that gets in your way.\rYour mission is the deadliest one to dateClimb, swim, and backflip your way through a maze of cryptic deathtraps so realistic you can practically smell the decaying flesh. Unload an arsenal of lethal firepower on any wild-dog, giant lizard or blood-thirsty mercenary that gets in your way.\rYour mission is the deadliest one to date -- the recovery of the fabled Scion, an incredible treasure reputed to give its possessor vast power. Get ready to cross the globe to take on impossible odds while exploring Incan ruins, Ancient Rome, Egyptian Pyramids, and the Lost City of Atlantis... … Expand"
  },
  {
    "name": "Overwatch",
    "details_link": "https://www.metacritic.com/game/xbox-one/overwatch",
    "publisher": "Blizzard Entertainment",
    "release_date": "May 23 2016",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 91,
    "users_score": 5.9,
    "image": "https://static.metacritic.com/images/products/games/7/8e6e4fc6afce19f84603b1697bd7477e-98.jpg",
    "descriptions": "Overwatch is a highly stylized team-based shooter set on earth in the near future. Every match is an intense multiplayer showdown pitting a diverse cast of soldiers, mercenaries, scientists, adventurers, and oddities against each other in an epic, globe-spanning conflict."
  },
  {
    "name": "Sekiro: Shadows Die Twice",
    "details_link": "https://www.metacritic.com/game/xbox-one/sekiro-shadows-die-twice",
    "publisher": "Activision",
    "release_date": "Mar 22 2019",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 91,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/5/0c9d4f0c2fe7df0dcdccd6541ffe8944-98.jpg",
    "descriptions": "Your death won’t come easily. Enter the world of late 1500s Sengoku Japan; a brutal, bloody period of constant life-and-death conflict. As tensions rise, a compelling new story unfolds amongst the chaos. Introducing Sekiro: Shadows Die Twice, a dark and twisted new gameplay experienceYour death won’t come easily. Enter the world of late 1500s Sengoku Japan; a brutal, bloody period of constant life-and-death conflict. As tensions rise, a compelling new story unfolds amongst the chaos. Introducing Sekiro: Shadows Die Twice, a dark and twisted new gameplay experience developed by the renowned team at FromSoftware and published by Activision. Directed by Hidetaka Miyazaki, Sekiro: Shadows Die Twice is a third-person, action-adventure game with RPG elements. The single-player game puts players in the protagonist role of a hard-hearted warrior whose mission is to rescue his master, a young lord, and exact revenge on his arch nemesis. As “Sekiro,” or the “one-armed wolf,” players discover the many ways to strategically approach combat and engage enemies. [Activision]… Expand"
  },
  {
    "name": "Resident Evil 4: Wii Edition",
    "details_link": "https://www.metacritic.com/game/wii/resident-evil-4-wii-edition",
    "publisher": "Capcom",
    "release_date": "Jun 19 2007",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "Wii"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Survival"
    ],
    "meta_score": 91,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/3/b141bdfa984a0cf1cc78c0795002e7c9-98.jpg",
    "descriptions": "Resident Evil 4 comes to the Wii with added Wii Remote and Nunchuck support, allowing players to immerse themselves in the game as never before. With RE4 Wii Edition, Capcom is offering new and more immersive sense of control to players, while keeping all of the game's incredible gameResident Evil 4 comes to the Wii with added Wii Remote and Nunchuck support, allowing players to immerse themselves in the game as never before. With RE4 Wii Edition, Capcom is offering new and more immersive sense of control to players, while keeping all of the game's incredible game systems intact. As Leon Kennedy, players explore a town overrun by cultists, mutants and mind-controlled villagers, using the Wii Remote to aim, fire, slash and avoid oncoming adversaries with intuitive motions and movements. RE4 Wii Edition also contains the additional content included in the PlayStation 2 computer entertainment system version of the game. [Capcom]… Expand"
  },
  {
    "name": "Shadow of the Colossus",
    "details_link": "https://www.metacritic.com/game/playstation-2/shadow-of-the-colossus",
    "publisher": "SCEA",
    "release_date": "Oct 18 2005",
    "developers": [
      "SCE Japan Studio"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 91,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/0/38cd8c442b23aaa7dcccf4d25c651995-98.jpg",
    "descriptions": "(Also known as \"Wanda and the Colossus\" or \"Wanda to Kyozou\" in Japan)  In Shadow of the Colossus, players take the role of a young man seeking the truth of an ancient tale of power hidden in a mystical land. Shadow of the Colossus is a majestic journey through ancient lands to seek out and(Also known as \"Wanda and the Colossus\" or \"Wanda to Kyozou\" in Japan)  In Shadow of the Colossus, players take the role of a young man seeking the truth of an ancient tale of power hidden in a mystical land. Shadow of the Colossus is a majestic journey through ancient lands to seek out and destroy gigantic mythical beasts. With a trusty horse at your side, players explore the spacious lands and unearth each Colossi. The uneasy task of defeating a Colossus relies on intelligent puzzle solving and action oriented gameplay. Armed with strong wits, a mystical sword and a sturdy bow, players use cunning and strategy to topple each behemoth. [Sony]… Expand"
  },
  {
    "name": "Forza Horizon 3",
    "details_link": "https://www.metacritic.com/game/xbox-one/forza-horizon-3",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep 23 2016",
    "developers": [
      "Playground Games"
    ],
    "platforms": [
      "PC",
      "Xbox One"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Racing",
      "Simulation",
      "Automobile"
    ],
    "meta_score": 91,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/7/54e778c0e3754fadc76bf8ec565130d6-98.jpg",
    "descriptions": "You are now in charge of the Horizon Festival. Customize everything, hire and fire your friends, and explore Australia in over 350 of the world’s greatest cars. Make your Horizon the ultimate celebration of cars, music, and freedom of the open road. How you get there is up to you. With theYou are now in charge of the Horizon Festival. Customize everything, hire and fire your friends, and explore Australia in over 350 of the world’s greatest cars. Make your Horizon the ultimate celebration of cars, music, and freedom of the open road. How you get there is up to you. With the new Horizon Blueprint feature, you have the power to create and instantly share your custom gameplay. You can even hire friends to star in your festival and win you more fans. If they’re not winning you fans, fire them. Danger Sign Jumps, Convoys, Drift Zones, and Showcase events that pit you and against a fleet of speedboats, a giant zeppelin, and more. Select your own driver character, customize your cars, create vanity license plates – even choose your own horn sound. Drive to the music you love choosing from eight diverse radio stations, or create a custom station using your own music collection. In addition to 12-player online free roam and multiplayer racing, all-new 4-player online co-op allows you and your friends to enjoy the variety, competition, and rewards of a Horizon campaign together for the first time. [Xbox.com]… Expand"
  },
  {
    "name": "Peggle",
    "details_link": "https://www.metacritic.com/game/playstation-3/peggle",
    "publisher": "PopCap",
    "release_date": "Nov 19 2009",
    "developers": [
      "PopCap"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Puzzle",
      "Action"
    ],
    "meta_score": 91,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/4/f9b3745d43d6c0ecd4e1371215e8f7ec-98.jpg",
    "descriptions": "[Playstation Network]  The PlayStation Network edition of Peggle brings all the compelling gameplay action of the original PC version, including 55 levels of ball-bouncing madness, 10 unlockable Peggle Masters, Quick Play mode, Duel mode, and 75 Challenge mode levels. For non-stop[Playstation Network]  The PlayStation Network edition of Peggle brings all the compelling gameplay action of the original PC version, including 55 levels of ball-bouncing madness, 10 unlockable Peggle Masters, Quick Play mode, Duel mode, and 75 Challenge mode levels. For non-stop competitive action, players can choose from two multiplayer options: two-player Duel mode, or Peg Party mode, where up to four players can compete against one another simultaneously. [PopCap Games]… Expand"
  },
  {
    "name": "The Legend of Zelda: Ocarina of Time / Master Quest",
    "details_link": "https://www.metacritic.com/game/gamecube/the-legend-of-zelda-ocarina-of-time-master-quest",
    "publisher": "Nintendo",
    "release_date": "Feb 28 2003",
    "developers": [
      "Nintendo"
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 91,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/9/90ebb994a8b51b812eb308082df50a1a-98.jpg",
    "descriptions": "The Legend of Zelda: Ocarina of Time Master Quest is a special version of Ocarina of Time that wasn't released for the N64 in North America. Both games were exclusively available for the Nintendo GameCube to those who preordered The Legend of Zelda: The Wind Waker at a participatingThe Legend of Zelda: Ocarina of Time Master Quest is a special version of Ocarina of Time that wasn't released for the N64 in North America. Both games were exclusively available for the Nintendo GameCube to those who preordered The Legend of Zelda: The Wind Waker at a participating retailer. The Master Quest version of Ocarina of Time contains the same overall storyline as the original Ocarina of Time adventure. However, the dungeons have been upgraded to be truly challenging, even to a Zelda master. … Expand"
  },
  {
    "name": "Borderlands 2",
    "details_link": "https://www.metacritic.com/game/playstation-3/borderlands-2",
    "publisher": "2K Games",
    "release_date": "Sep 18 2012",
    "developers": [
      "Gearbox Software"
    ],
    "platforms": [
      "PC",
      "PlayStation Vita",
      "Xbox 360",
      "Xbox One",
      "PlayStation 3"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/10f0f1c90e7facd5da3bdf04e8dc72f7-98.jpg",
    "descriptions": "Play as one of four new vault hunters facing off against a massive new world of creatures, psychos and the evil mastermind, Handsome Jack. Make new friends, arm them with a bazillion weapons and fight alongside them in 4 player co-op or split-screen on a relentless quest for revenge andPlay as one of four new vault hunters facing off against a massive new world of creatures, psychos and the evil mastermind, Handsome Jack. Make new friends, arm them with a bazillion weapons and fight alongside them in 4 player co-op or split-screen on a relentless quest for revenge and redemption across the undiscovered and unpredictable living planet.… Expand"
  },
  {
    "name": "Sonic Mania Plus",
    "details_link": "https://www.metacritic.com/game/switch/sonic-mania-plus",
    "publisher": "Sega",
    "release_date": "Jul 17 2018",
    "developers": [
      "Sega",
      "Tantalus"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/2/788798514cd10999c6aa3c9bfa2f16d0-98.jpg",
    "descriptions": "Sonic Mania Plus is the definitive retail enhanced version of the original Sonic Mania's digital release, presented in a pristine collectible physical release. The encore pack is a $5 upgrade fee for owners of the original game."
  },
  {
    "name": "Tom Clancy's Splinter Cell",
    "details_link": "https://www.metacritic.com/game/pc/tom-clancys-splinter-cell",
    "publisher": "Ubisoft",
    "release_date": "Feb 19 2003",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern"
    ],
    "meta_score": 91,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/9/2a08ba78f40d57d58995a4eef384bbcd-98.jpg",
    "descriptions": "Infiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace! You are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon. The world balance is in your hands, as cyberInfiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace! You are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon. The world balance is in your hands, as cyber terrorism and international tensions are about to explode into WWIII. [Ubi Soft]… Expand"
  },
  {
    "name": "Forza Horizon 5",
    "details_link": "https://www.metacritic.com/game/pc/forza-horizon-5",
    "publisher": "Xbox Game Studios",
    "release_date": "Nov  9 2021",
    "developers": [
      "Playground Games"
    ],
    "platforms": [
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "genres": [
      "Racing",
      "Simulation",
      "Automobile"
    ],
    "meta_score": 91,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/4/a572facc24b6ef4a322eed6e2fe6392a-98.jpg",
    "descriptions": "Your Ultimate Horizon Adventure awaits! Explore the vibrant and ever-evolving open world landscapes of Mexico with limitless, fun driving action in hundreds of the world’s greatest cars."
  },
  {
    "name": "Dead Cells",
    "details_link": "https://www.metacritic.com/game/xbox-one/dead-cells",
    "publisher": "Motion Twin",
    "release_date": "Aug  7 2018",
    "developers": [
      "Motion Twin"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/2/b4007446116f1fca84ea81022006ad84-98.jpg",
    "descriptions": "Dead Cells puts you in control of a failed alchemic experiment trying to figure out what's happening on a sprawling, ever-changing and seemingly cursed Island. Tough but fair combat, responsive controls, challenging foes, permadeath and of course, the emergency panic roll to get you out ofDead Cells puts you in control of a failed alchemic experiment trying to figure out what's happening on a sprawling, ever-changing and seemingly cursed Island. Tough but fair combat, responsive controls, challenging foes, permadeath and of course, the emergency panic roll to get you out of trouble, make for a demanding, visceral and cathartic action game.Experience a roguevania, mixing an interconnected world, branching paths and unlockable skills with the constant adrenaline-pumping threat of permadeath. No checkpoints. You either vanquish the final boss in one go, or you try again. However, you keep some of your progress for successive runs; new paths you've unlocked, access to new levels, mutations, abilities and weapons.Speaking of weapons, Dead Cells features a plethora of ways to slay your enemies. A large variety of swords, bows and of course spells, but also whips, grenades and turrets, each one with its own unique twist. Plus, mutations and scrolls allow you to build and customize your character differently with each and every run.At the end of the day though, it's your skills as a player that matter most! Roguelites are about constantly sharpening your skills, until what was an insurmountable obstacle becomes a walk in the park. Patience, you'll get better! ... eventually.FEATURES:* Roguevania: The progressive exploration of an interconnected world, with the replayability of a rogue-lite and the adrenaline pumping threat of permadeath.* 2D Souls-lite Action: Tough but fair combat, the iconic dodge roll, more than 90 weapons and spells with unique gameplay... The unforgiving action wed to the absence of any kind of safety net makes for an adrenalin pumping ride each and every run.* Nonlinear Progression: Sewers, Ossuary or Ramparts? Once unlocked, special permanent abilities allow you to access new paths to reach your objective. Opt for the path that suits your current build, your play style, or just your mood.* Exploration: Secret rooms, hidden passages, charming landscapes. Take a moment to stroll the towers and breath in that fresh sea mist infused air.… Expand"
  },
  {
    "name": "Kentucky Route Zero - Act III",
    "details_link": "https://www.metacritic.com/game/pc/kentucky-route-zero---act-iii",
    "publisher": "Cardboard Computer",
    "release_date": "May  6 2014",
    "developers": [
      "Cardboard Computer"
    ],
    "platforms": "PC",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 91,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/2/b868aaf076b781319567ab421b7dcea3-98.jpg",
    "descriptions": "Kentucky Route Zero is a magical realistic adventure game about a secret highway in the caves beneath Kentucky, and the mysterious folks who travel it."
  },
  {
    "name": "NCAA Football 2003",
    "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-football-2003",
    "publisher": "EA Sports",
    "release_date": "Jul 20 2002",
    "developers": [
      "EA Sports"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/0/62fc78efb9081783582418a3cbdf10a5-98.jpg",
    "descriptions": "The College Game: Feel all the pageantry with over 200 fight songs, 3D cheerleaders, and 117 Division I-A schools. My Favorite Team: Personalize the game interface based on your team's fight song, mascot, logos, and school colors. Build A Dynasty: Create your own school and schedule, recruitThe College Game: Feel all the pageantry with over 200 fight songs, 3D cheerleaders, and 117 Division I-A schools. My Favorite Team: Personalize the game interface based on your team's fight song, mascot, logos, and school colors. Build A Dynasty: Create your own school and schedule, recruit star athletes, and redshirt developing players to build a national powerhouse. Rivalry Mode: Beat your school's archrival and win one of 23 coveted trophies. Trophy Room: Display up to 59 total trophies including conference championships and individual player awards. [EA Sports]… Expand"
  },
  {
    "name": "Crysis",
    "details_link": "https://www.metacritic.com/game/pc/crysis",
    "publisher": "EA Games",
    "release_date": "Nov 13 2007",
    "developers": [
      "Crytek"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/8/3c939b96b0aac4a8338e6e49e16fddcd-98.jpg",
    "descriptions": "Crysis is a next-generation PC first-person shooter from Crytek, the award-winning developers of \"Far Cry.\" It is 2020, and global tensions have reached boiling point as the U.S. and North Korea square off in the South China Sea. At stake: a mysterious artifact uncovered by a team of U.S.Crysis is a next-generation PC first-person shooter from Crytek, the award-winning developers of \"Far Cry.\" It is 2020, and global tensions have reached boiling point as the U.S. and North Korea square off in the South China Sea. At stake: a mysterious artifact uncovered by a team of U.S. archeologists. The North Korean government quickly seizes the area, prompting the U.S. to dispatch an elite team of Delta Force operatives on a rescue mission. During the siege the true nature of the artifact quickly emerges, pointing to the existence of an alien presence on Earth, and ultimately the trigger for a massive-scale alien invasion. The battle to save Earth begins as the aliens' flash freeze the tropics into a ghostly-white frozen landscape. As gamers take up arms against the aliens, they will be outfitted with customizable weapons and a high tech Nanosuit, allowing them to adapt their tactics and abilities to a hostile, ever-changing environment and a mysterious enemy. [Electronic Arts]… Expand"
  },
  {
    "name": "Ninja Gaiden",
    "details_link": "https://www.metacritic.com/game/xbox/ninja-gaiden",
    "publisher": "Tecmo",
    "release_date": "Mar  2 2004",
    "developers": [
      "Team Ninja"
    ],
    "platforms": "Xbox",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 91,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/9/21ba971d021cb17085d426cdcae91fb1-98.jpg",
    "descriptions": "Ninja Gaiden first debuted in the 1988 and now the young ninja returns.  As Ryu Hayabusa, you seek revenge after the Vigor Empire massacres your clan.  Skilled in battle actions and ninja moves, you are well prepared to hunt down the Holy Emperor and reclaim the magic swordNinja Gaiden first debuted in the 1988 and now the young ninja returns.  As Ryu Hayabusa, you seek revenge after the Vigor Empire massacres your clan.  Skilled in battle actions and ninja moves, you are well prepared to hunt down the Holy Emperor and reclaim the magic sword \"Ryuken.\" Ninja Gaiden features killer gameplay, stunning graphics, and new weapons such as the Dragon Sword, warhammer, shurikens, and nunchakus. Plus, there are massive levels filled with enemies and Xbox Live feature will enable future high score tournaments and downloadable content.… Expand"
  },
  {
    "name": "God of War: Chains of Olympus",
    "details_link": "https://www.metacritic.com/game/psp/god-of-war-chains-of-olympus",
    "publisher": "SCEA",
    "release_date": "Mar  4 2008",
    "developers": [
      "Ready at Dawn"
    ],
    "platforms": [
      "PlayStation 3",
      "PSP"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Fantasy",
      "Linear"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/0/d5f3e9e79b91d19d33a35fbb772e5535-98.jpg",
    "descriptions": "[Metacritic's 2008 PSP Game of the Year] Unleash the power of the Gods and embark on a merciless quest as Kratos, an ex-Spartan warrior driven to destroy Ares, the God of War. Armed with lethal double chainblades, Kratos must carve through mythology's darkest creatures including Medusa,[Metacritic's 2008 PSP Game of the Year] Unleash the power of the Gods and embark on a merciless quest as Kratos, an ex-Spartan warrior driven to destroy Ares, the God of War. Armed with lethal double chainblades, Kratos must carve through mythology's darkest creatures including Medusa, Cyclops, the Hydra and more, while solving intricate puzzles in breathtaking environments. Driven by pure revenge, nothing can stop Kratos from achieving absolution. [SCEA]… Expand"
  },
  {
    "name": "Final Fantasy XIV: Shadowbringers",
    "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-xiv-shadowbringers",
    "publisher": "Square Enix",
    "release_date": "Jul  2 2019",
    "developers": [
      "Square Enix"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "genres": [
      "Role-Playing",
      "Massively Multiplayer"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/8/1a8d9f7ab605ba769f6822604892c0af-98.jpg",
    "descriptions": "Take part in the next saga of FINAL FANTASY® XIV Online with the next legendary expansion pack—SHADOWBRINGERS.\r New jobs: Gunbreaker and Dancer\r\nNew races: Viera and Hrothgar\r\nLevel cap increased: 70 to 80\r\nNew cities: The Crystarium and Eulmore\r\nJourney through expansive new areas, suchTake part in the next saga of FINAL FANTASY® XIV Online with the next legendary expansion pack—SHADOWBRINGERS.\r New jobs: Gunbreaker and Dancer\rNew races: Viera and Hrothgar\rLevel cap increased: 70 to 80\rNew cities: The Crystarium and Eulmore\rJourney through expansive new areas, such as the Rak’tika Greatwood, Amh Araeng, Il Mheg and Lakeland.\rNew trails, including harrowing encounters with Titania and Innocence.\rNew beast tribes: pixies, Nu Mou, and dwarves\rNew 8-player raid: Eden\rAn exciting new series of alliance raids YoRHa:Dark Apocalypse\rThe Restoration of the Holy See of Ishgard - In the aftermath of the Dragonsong War, Disciples of the Hand and Land work together to rebuild Ishgard… Expand"
  },
  {
    "name": "DOA2: Hardcore",
    "details_link": "https://www.metacritic.com/game/playstation-2/doa2-hardcore",
    "publisher": "Tecmo",
    "release_date": "Oct 25 2000",
    "developers": [
      "Team Ninja"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 91,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/8/9502cb431420d672c79210a332bb050a-98.jpg",
    "descriptions": "This third version of Tecmo's acclaimed fighter \"Dead or Alive 2,\" ported to the Dreamcast ealier in the year, is a visual feast for PS2 gamers with the addition of new costumes, levels, hidden characters, amped-up graphics."
  },
  {
    "name": "World of Warcraft: The Burning Crusade",
    "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft-the-burning-crusade",
    "publisher": "Blizzard Entertainment",
    "release_date": "Jan 16 2007",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": "PC",
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Miscellaneous",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Board / Card Game",
      "Fantasy",
      "Fantasy"
    ],
    "meta_score": 91,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/0/80fe059db5aa8bca4d200f2f385e15b3-98.jpg",
    "descriptions": "Several years have passed since the Burning Legion's defeat at Mount Hyjal and the races of Azeroth have continued to rebuild their once shattered lives. With renewed strength, the heroes of the Horde and Alliance have begun to explore new lands and broken through the Dark Portal toSeveral years have passed since the Burning Legion's defeat at Mount Hyjal and the races of Azeroth have continued to rebuild their once shattered lives. With renewed strength, the heroes of the Horde and Alliance have begun to explore new lands and broken through the Dark Portal to investigate the realms beyond the known world. Will these heroes find friends or foes? What dangers and rewards lie in wait beyond the Dark Portal? And what will they do when they discover that the demons they thought vanquished have returned to renew their terrible Burning Crusade? New Player Races: New allies will join the game, expanding the story line and allowing players to develop powerful new characters within the world. Higher Level Limit: The game's level cap is being raised to 70, and with these new levels will come meaningful spell, ability, and talent upgrades for each character class. New Lands and Battlegrounds: Explore the magical realms of the Blood Elves and Draenei, journey through the Dark Portal into untamed Outland, and visit dungeons and battlefields previously inaccessible to players. \rFlying Mounts: In Outland, players will gain access to unique airborne mounts that will allow for smoother travel over some of that region's more hazardous terrain. [Blizzard]… Expand"
  },
  {
    "name": "MLB 10: The Show",
    "details_link": "https://www.metacritic.com/game/playstation-3/mlb-10-the-show",
    "publisher": "SCEA",
    "release_date": "Mar  2 2010",
    "developers": [
      "SCEA"
    ],
    "platforms": "PlayStation 3",
    "num_players": "2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Baseball",
      "Sim",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/4/8353ae78e5ac20c69b9959a18cc4f1de-98.jpg",
    "descriptions": "MLB 10 The Show NEW Features: HR Derby – The Home Run Derby and MLB All-Star Futures Game are now available during the All-Star break in our season modes and as a stand-alone experience. Catcher Calling the Game – Call pitches and play as the field general, just like Joe Mauer. OnlineMLB 10 The Show NEW Features: HR Derby – The Home Run Derby and MLB All-Star Futures Game are now available during the All-Star break in our season modes and as a stand-alone experience. Catcher Calling the Game – Call pitches and play as the field general, just like Joe Mauer. Online Gameplay Improved – This year the online gameplay experience has been vastly improved and will detect and respond better to adverse network conditions along with reduced bandwidth to help the speed and flow of online gameplay. User Controlled Pick-Offs – Surprise a base runner with a quick move or lull him to sleep with our new pick-off mechanism. Custom Music, Fan Yells, and Chants – Assign music or a recording to an entire team, edit tracks to assign batter walk-up music, or record your own voice and assign it to play for the team or player during the situation of your choice. [SCEA]… Expand"
  },
  {
    "name": "Shadow of the Colossus",
    "details_link": "https://www.metacritic.com/game/playstation-4/shadow-of-the-colossus",
    "publisher": "Sony Interactive Entertainment",
    "release_date": "Feb  6 2018",
    "developers": [
      "Bluepoint Games",
      "SCE Japan Studio"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 91,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/8/b8fa7cf05ab8da759d053fcba9df9f75-98.jpg",
    "descriptions": "Tales speak of an ancient realm where Colossi roam the majestic landscape.  Bound to the land, these creatures hold a key to a mystical power of revival – a power you must obtain to bring a loved one back to life."
  },
  {
    "name": "Yoshi's Island: Super Mario Advance 3",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/yoshis-island-super-mario-advance-3",
    "publisher": "Nintendo",
    "release_date": "Sep 24 2002",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/9/3e908ea55766f130dd57606eec583977-98.jpg",
    "descriptions": "When Baby Mario falls from the sky, the big-hearted Yoshis vow to reunite him with his twin brother on the far side of the island.  It won't be easy, but you must help them take on a meddling Magikoopa and his entire cast of underhanded underlings.  Your journey spans the island's jungles,When Baby Mario falls from the sky, the big-hearted Yoshis vow to reunite him with his twin brother on the far side of the island.  It won't be easy, but you must help them take on a meddling Magikoopa and his entire cast of underhanded underlings.  Your journey spans the island's jungles, caves, and snowcapped peaks--each area filled with hidden rooms, secret passages, charming minigames, demented bosses, and all-new pals.  Sure, Yoshi looks cute, but he packs some pretty amazing firepower--he can throw eggs, hover, stomp, pound the ground, slurp up enemies, and morph into a toy submarine.  … Expand"
  },
  {
    "name": "The Witcher 3: Wild Hunt - Blood and Wine",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-witcher-3-wild-hunt---blood-and-wine",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "May 30 2016",
    "developers": [
      "CD Projekt Red Studio"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 91,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/0/9b1b2e62c39046ca8397075fb9ab5111-98.jpg",
    "descriptions": "This expansion pack is an old-school add on with 20 hours of new adventures, where players will travel to the land of Toussaint."
  },
  {
    "name": "Tiger Woods PGA Tour 2005",
    "details_link": "https://www.metacritic.com/game/pc/tiger-woods-pga-tour-2005",
    "publisher": "EA Sports",
    "release_date": "Sep 20 2004",
    "developers": [
      "Headgate"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Golf",
      "Sim",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 4.0,
    "image": "https://static.metacritic.com/images/products/games/0/55232607853540318e597a2ea2a38c99-98.jpg",
    "descriptions": "TigerProofing is a revolutionary course-altering system that allows players to modify course dynamics and create the most intensely competitive course imaginable. Alter tee-box length, width and patterns on fairways and greens, the depth of a greenside bunker, and even the color of theTigerProofing is a revolutionary course-altering system that allows players to modify course dynamics and create the most intensely competitive course imaginable. Alter tee-box length, width and patterns on fairways and greens, the depth of a greenside bunker, and even the color of the leaves on the trees, course moisture and the season which you play. Take on the legends of golf including Arnold Palmer, Jack Nicklaus, and Ben Hogan and become a legend yourself! EA SPORTS GameFace II: The industry-leading GameFace technology just got a whole lot deeper with more control and freedom to express your creative vision from a youthful prodigy to a grizzled old veteran. Eight new licensed courses and two new fantasy courses have been added for a total of 14 courses. New licensed courses for console only include Coeur d?Alene and Colonial Country Club. New licensed courses for both console and PC include, Sherwood Country Club, Fancourt Golf Club Estate and Troon North ? Monument Course. Compete as or against 15 different PGA TOUR players including Tiger Woods, John Daly, Vijay Singh, Charles Howell III, Notah Begay III, and Jesper Parnevik, among others. Total Precision Swing: New putting and chipping systems allow for more control on the green or when you leave an approach shot short. [EA Sports]… Expand"
  },
  {
    "name": "ESPN NFL Football",
    "details_link": "https://www.metacritic.com/game/xbox/espn-nfl-football",
    "publisher": "Sega",
    "release_date": "Sep  3 2003",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/824a2845e7aedd58c7fcc8d28b8234f2-98.jpg",
    "descriptions": "Sega's latest addition to its NFL 2K series, ESPN NFL Football delivers the most complete NFL experience.   Experience a new level of gaming through First Person Football, a mode that allows you to see the game through the eyes of any player on your team.   Earn and unlock trophies,Sega's latest addition to its NFL 2K series, ESPN NFL Football delivers the most complete NFL experience.   Experience a new level of gaming through First Person Football, a mode that allows you to see the game through the eyes of any player on your team.   Earn and unlock trophies, mini-games, and music to show off in your Crib. Listen to commentary from ESPN's own Chris Berman and watch the game as if you're watching an ESPN broadcast. Take on your friends or play online.… Expand"
  },
  {
    "name": "NCAA Football 2003",
    "details_link": "https://www.metacritic.com/game/gamecube/ncaa-football-2003",
    "publisher": "Electronic Arts",
    "release_date": "Jul 20 2002",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/9/4f853b2aaa5d84c8ca6827c0142fa28a-98.jpg",
    "descriptions": "NCAA Football 2003 delivers the tradition and spirit of college football's storied programs with intense rivalries, authentic stadium atmospheres, and realistic gameplay. You'll choose from 117 Division 1-A and 27 Division 1-AA schools across the country, or create your own, and then coachNCAA Football 2003 delivers the tradition and spirit of college football's storied programs with intense rivalries, authentic stadium atmospheres, and realistic gameplay. You'll choose from 117 Division 1-A and 27 Division 1-AA schools across the country, or create your own, and then coach your school through a variety of game modes. In Dynasty mode, you can recruit the best athletes, redshirt your developing players, and use TV exposure to gain status as you build a dominating force in the NCAA. NCAA Football 2003 also features a variety of new moves--including play fakes, spins, and one-foot toe drag--which you must master in order to reach the championship. … Expand"
  },
  {
    "name": "The Longest Journey",
    "details_link": "https://www.metacritic.com/game/pc/the-longest-journey",
    "publisher": "Funcom",
    "release_date": "Nov 16 2000",
    "developers": [
      "Funcom"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Third-Person",
      "Point-and-Click",
      "Fantasy",
      "Fantasy"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/b44be7322174200948fe9e637f5442f0-98.jpg",
    "descriptions": "An epic 3-D adventure spanning over 150 unique locations across two distinct and detailed worlds.  [Funcom]"
  },
  {
    "name": "Tony Hawk's Pro Skater 2",
    "details_link": "https://www.metacritic.com/game/pc/tony-hawks-pro-skater-2",
    "publisher": "Activision",
    "release_date": "Oct 25 2000",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Alternative",
      "Individual",
      "Skateboarding",
      "Skateboarding",
      "Skate / Skateboard"
    ],
    "meta_score": 91,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/5/56177305651e34a2e7d404f05701b853-98.jpg",
    "descriptions": "Players can choose to skate with the skills of Tony Hawk, the most legendary pro of all time, or as one of 12 pro skaters from the star-studded lineup. The game's intuitive and solid control scheme allows players to perform hundreds of tricks in a variety of realistic, obstacle-filled,Players can choose to skate with the skills of Tony Hawk, the most legendary pro of all time, or as one of 12 pro skaters from the star-studded lineup. The game's intuitive and solid control scheme allows players to perform hundreds of tricks in a variety of realistic, obstacle-filled, real-world locations.  [Activision]… Expand"
  },
  {
    "name": "Star Wars Jedi Knight: Dark Forces II",
    "details_link": "https://www.metacritic.com/game/pc/star-wars-jedi-knight-dark-forces-ii",
    "publisher": "LucasArts",
    "release_date": "Oct  9 1997",
    "developers": [
      "LucasArts"
    ],
    "platforms": "PC",
    "num_players": "Up to 32 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/9/0a39b899979832d09ceb4a824d68532a-98.jpg",
    "descriptions": "In Dark Forces, Kyle Katarn, a young mercenary successfully infiltrated the Empire. Jedi Knight continues the story of Katarn as he embarks on a quest into his past and learns the mysterious ways of the Jedi. With this knowledge, he must stop seven Dark Jedi from unlocking the powers of aIn Dark Forces, Kyle Katarn, a young mercenary successfully infiltrated the Empire. Jedi Knight continues the story of Katarn as he embarks on a quest into his past and learns the mysterious ways of the Jedi. With this knowledge, he must stop seven Dark Jedi from unlocking the powers of a hidden Jedi burial ground. This task forces Katarn to decide his destiny. If he chooses the Dark side, he will come into enormous power. If he chooses the Light side, he faces seemingly insurmountable evil. Whatever path Katarn chooses will change the face of the galaxy forever. [LucasArts]… Expand"
  },
  {
    "name": "Batman: Arkham Asylum",
    "details_link": "https://www.metacritic.com/game/pc/batman-arkham-asylum",
    "publisher": "Eidos Interactive",
    "release_date": "Sep 15 2009",
    "developers": [
      "Rocksteady Studios"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 91,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/5/8c0d025f0ad5d0f625717b6806ed0afc-98.jpg",
    "descriptions": "In Batman: Arkham Asylum, the player assumes the role of Batman as he delivers The Joker to Arkham Asylum. There, the imprisoned super-villains have set a trap and an immersive combat gaming experience unfolds. With an original script penned by Emmy Award-winning Batman writer Paul Dini, theIn Batman: Arkham Asylum, the player assumes the role of Batman as he delivers The Joker to Arkham Asylum. There, the imprisoned super-villains have set a trap and an immersive combat gaming experience unfolds. With an original script penned by Emmy Award-winning Batman writer Paul Dini, the game brings the universe of DC Comics' detective to life with stunning graphics. Batman: Arkham Asylum offers players the chance to battle Gotham's worst villains with Batman's physical and psychological strength in a graphically distinct and story-driven game. [Eidos Interactive]… Expand"
  },
  {
    "name": "Halo: Reach",
    "details_link": "https://www.metacritic.com/game/xbox-360/halo-reach",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep 14 2010",
    "developers": [
      "Bungie"
    ],
    "platforms": "Xbox 360",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/5/eeaf192498d900cc77e5d62622e00552-98.jpg",
    "descriptions": "From the beginning, you know the end. In Halo: Reach, players experience the fateful moments that forged the Halo legend. It's the story of Noble Team, a squad of heroic Spartan soldiers, and their final stand on the planet Reach, humanity's last line of defense between the terrifyingFrom the beginning, you know the end. In Halo: Reach, players experience the fateful moments that forged the Halo legend. It's the story of Noble Team, a squad of heroic Spartan soldiers, and their final stand on the planet Reach, humanity's last line of defense between the terrifying Covenant and Earth. This darker story is echoed by grittier visuals amid a backdrop of massive, awe-inspiring environments. Characters, enemies and environments are rendered in amazing detail by an all-new engine designed to deliver epic-scale encounters against the cunning and ruthless Covenant.… Expand"
  },
  {
    "name": "Galactic Civilizations II: Dark Avatar",
    "details_link": "https://www.metacritic.com/game/pc/galactic-civilizations-ii-dark-avatar",
    "publisher": "Stardock",
    "release_date": "Feb 14 2007",
    "developers": [
      "Stardock"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Sci-Fi",
      "Sci-Fi",
      "4X"
    ],
    "meta_score": 91,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/9/3b8103a58f6e6d78d742145bf443e665-98.jpg",
    "descriptions": "The year is 2226 and the Drengin Empire reigns supreme across the galaxy. But something utterly evil is devouring the Drengin Empire from within. Expand your Galactic Civilizations II experience with espionage agents, player designed opponents, new alien races, new ships, unique planetaryThe year is 2226 and the Drengin Empire reigns supreme across the galaxy. But something utterly evil is devouring the Drengin Empire from within. Expand your Galactic Civilizations II experience with espionage agents, player designed opponents, new alien races, new ships, unique planetary environments, asteroid fields, improved graphics and much more. [Stardock]… Expand"
  },
  {
    "name": "Mass Effect",
    "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov 20 2007",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Console-style RPG",
      "Japanese-Style",
      "Western-Style"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/9163b068da45f70379f184bac6130d17-98.jpg",
    "descriptions": "Mass Effect is a science fiction action-RPG created by BioWare Corp., the commercially and critically acclaimed RPG developer of \"Jade Empire,\" and \"Star Wars: Knights of the Old Republic.\" As the first human on the galactic stage, you must uncover the greatest threat to civilization. YourMass Effect is a science fiction action-RPG created by BioWare Corp., the commercially and critically acclaimed RPG developer of \"Jade Empire,\" and \"Star Wars: Knights of the Old Republic.\" As the first human on the galactic stage, you must uncover the greatest threat to civilization. Your job is complicated by the very fact of your humanity, as no one trusts you and you need to find a way to convince everyone of the grave threat. You will travel across an expansive universe to piece the mystery together. As you discover and explore the uncharted edges of the galaxy, you come closer to an overwhelming truth - learning that the placid and serene universe you know is about to come to a violent end and that you may be the only person who can stop it! In addition to the main story arc of the game, players are be able to visit a large number of uncharted, unexplored planets which are side quests independent from the main story. At any time during the campaign, a player can choose to explore one of these planets and have an opportunity to discover new alien life, resources, ruined civilizations and powerful technologies. Talents and abilities are upgradeable and advanced talent options become available at higher levels. Weapons and vehicles are customizable to include various effects, abilities and upgrades using the \"X-Mod\" system. Each character class have unique talents and abilities which increase in power as the player progresses through the game. [Microsoft]… Expand"
  },
  {
    "name": "The Operative: No One Lives Forever",
    "details_link": "https://www.metacritic.com/game/pc/the-operative-no-one-lives-forever",
    "publisher": "Fox Interactive",
    "release_date": "Nov 11 2000",
    "developers": [
      "Monolith Productions"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-16 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/1f7c2ccc2c4abbaba7e9d247ea9d75c2-98.jpg",
    "descriptions": "A story-driven, first-person adventure delivering over-the-top action, tense subterfuge, outrageous villains, and wry humor in the tradition of the great 1960's spy films and TV shows. [Fox Interactive]"
  },
  {
    "name": "Resident Evil 3: Nemesis",
    "details_link": "https://www.metacritic.com/game/playstation/resident-evil-3-nemesis",
    "publisher": "Capcom",
    "release_date": "Nov 11 1999",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation"
    ],
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 91,
    "users_score": 9.6,
    "image": "https://static.metacritic.com/images/products/games/9/c9fd45672e126abc4062f6a5c76c489d-98.jpg",
    "descriptions": "A month and a half have passed since the mansion lab incident and now the secrets come back to haunt you in Resident Evil 3: Nemesis. Join Jill Valentine in her attempt to escape a nightmarish city in ruins. Around every corner lurk hordes of flesh-eating zombies, hideous mutants, and aA month and a half have passed since the mansion lab incident and now the secrets come back to haunt you in Resident Evil 3: Nemesis. Join Jill Valentine in her attempt to escape a nightmarish city in ruins. Around every corner lurk hordes of flesh-eating zombies, hideous mutants, and a relentless new nemesis. You'll soon rely on cunning and brute force to stay alive. The Resident Evil series has taken a horrifying turn, unveiling new layers in the Umbrella Corporation's devious activities.… Expand"
  },
  {
    "name": "Forza Motorsport 4",
    "details_link": "https://www.metacritic.com/game/xbox-360/forza-motorsport-4",
    "publisher": "Microsoft Game Studios",
    "release_date": "Oct 11 2011",
    "developers": [
      "Turn 10"
    ],
    "platforms": "Xbox 360",
    "num_players": "Up to 16 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "GT / Street",
      "GT / Street",
      "Automobile"
    ],
    "meta_score": 91,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/e5e57bdec8165d9bc7b4d626b647cd22-98.jpg",
    "descriptions": "Forza Motorsport 4 is the biggest entry in the series to date. Hundreds of the world’s most exciting cars spanning more than eighty manufacturers. The best driving circuits in the world. Bringing you closer to the cars of your dreams. Online features that redefine online community. ForzaForza Motorsport 4 is the biggest entry in the series to date. Hundreds of the world’s most exciting cars spanning more than eighty manufacturers. The best driving circuits in the world. Bringing you closer to the cars of your dreams. Online features that redefine online community. Forza Motorsport 4 promises to be an entirely new car experience.… Expand"
  },
  {
    "name": "Resident Evil",
    "details_link": "https://www.metacritic.com/game/playstation/resident-evil",
    "publisher": "Capcom",
    "release_date": "Mar 30 1996",
    "developers": [
      "Capcom"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Horror"
    ],
    "meta_score": 91,
    "users_score": 9.5,
    "image": "https://static.metacritic.com/images/products/games/2/667fba1dd59e7f5d8ba2a13ac3b50df6-98.jpg",
    "descriptions": "Raccoon City has been completely overrun by mutant beasts and bloodthirsty zombies. You are a member of S.T.A.R.S.--a rescue squad sent into the community to investigate the ominous mansion at the core of the disaster. Take the role of operative Jill Valentine or Chris Redfield and uncoverRaccoon City has been completely overrun by mutant beasts and bloodthirsty zombies. You are a member of S.T.A.R.S.--a rescue squad sent into the community to investigate the ominous mansion at the core of the disaster. Take the role of operative Jill Valentine or Chris Redfield and uncover the secrets behind a radical, genetic research facility. With an array of weapons to master and horrors around every corner, the ultimate test may be just to make it out alive.… Expand"
  },
  {
    "name": "Crusader Kings III",
    "details_link": "https://www.metacritic.com/game/pc/crusader-kings-iii",
    "publisher": "Paradox Interactive",
    "release_date": "Sep  1 2020",
    "developers": [
      "Paradox Interactive"
    ],
    "platforms": [
      "PlayStation 5",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Up to 64 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "General"
    ],
    "meta_score": 91,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/bf1475c161c6857e0c52670b80486e4c-98.jpg",
    "descriptions": "Paradox Development Studio brings you the sequel to one of the most popular strategy games ever made. Crusader Kings III is the heir to a long legacy of historical grand strategy experiences and arrives with a host of new ways to ensure the success of your royal house."
  },
  {
    "name": "Psychonauts 2",
    "details_link": "https://www.metacritic.com/game/xbox-one/psychonauts-2",
    "publisher": "Starbreeze",
    "release_date": "Aug 25 2021",
    "developers": [
      "Double Fine Productions"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Beat-'Em-Up",
      "Action",
      "Action Adventure",
      "Platformer",
      "Open-World",
      "3D"
    ],
    "meta_score": 91,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/6/43fbccddb0ad0727132661339e36091f-98.jpg",
    "descriptions": "Razputin Aquato, trained acrobat and powerful young psychic, has realized his life long dream of joining the international psychic espionage organization known as the Psychonauts! But these psychic super spies are in trouble. Their leader hasn't been the same since he was kidnapped, andRazputin Aquato, trained acrobat and powerful young psychic, has realized his life long dream of joining the international psychic espionage organization known as the Psychonauts! But these psychic super spies are in trouble. Their leader hasn't been the same since he was kidnapped, and what's worse, there's a mole hiding in headquarters. Raz must use his powers to stop the mole before they execute their secret plan--to bring the murderous psychic villain, Maligula, back from the dead.… Expand"
  },
  {
    "name": "Battlefield 2",
    "details_link": "https://www.metacritic.com/game/pc/battlefield-2",
    "publisher": "EA Games",
    "release_date": "Jun 21 2005",
    "developers": [
      "Digital Illusions"
    ],
    "platforms": "PC",
    "num_players": "64  Online",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Tactical",
      "Modern",
      "Modern"
    ],
    "meta_score": 91,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/1/d2f0e4e5cdb9eec66e1a8e5dcc7f9cf4-98.jpg",
    "descriptions": "In Battlefield 2, players will choose to fight for one of three military superpowers: the United States, China, or the newly formed Middle East Coalition. Armed with the latest modern weaponry, players can take control of any of the game's 30+ vehicles to engage in major conflicts with overIn Battlefield 2, players will choose to fight for one of three military superpowers: the United States, China, or the newly formed Middle East Coalition. Armed with the latest modern weaponry, players can take control of any of the game's 30+ vehicles to engage in major conflicts with over 100 players in some of the largest online battles on the PC. Battlefield 2 features immense, richly detailed, destructible environments, from city streets to remote forests, in some of the most notorious hot spots around the world. Each map in Battlefield 2 adjusts in scale to support the number of players in the world, providing the ideal vehicle-to-player ratio and an optimized game play experience.  Enhanced team play features allow players to enter the action on the front lines as part of a formal squad, or work behind the scenes in Commander Mode to direct the strategic assaults of their teammates.  With in-game success, players increase their rank from recruit all the way to General and unlock awards, including new weapons, vehicle decals, medals, and more. Additionally, Battlefield 2 showcases an all-new game engine and physics system to bring the modern battlefield to life like never before. The new material penetration feature measures weapons' ability to fire through barriers based on their composition and players will need to know the difference between concealment and cover in order to survive. [Electronic Arts]… Expand"
  },
  {
    "name": "God of War Collection",
    "details_link": "https://www.metacritic.com/game/playstation-3/god-of-war-collection",
    "publisher": "SCEA",
    "release_date": "Nov 17 2009",
    "developers": [
      "Bluepoint Games"
    ],
    "platforms": [
      "PlayStation Vita",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Action Adventure",
      "Fantasy",
      "Compilation",
      "Compilation"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/8/8f87f62c56f8965cebfea7b645540d5b-98.jpg",
    "descriptions": "Two Epic Adventures of Conquest, Destiny, and Vengeance, God of War and God of War II, return for the first time on BluRay Disc! In God of War: Collection, players will experience the dark world of Ancient Greece through Kratos, a brutal warrior determined to murder the God of War and alterTwo Epic Adventures of Conquest, Destiny, and Vengeance, God of War and God of War II, return for the first time on BluRay Disc! In God of War: Collection, players will experience the dark world of Ancient Greece through Kratos, a brutal warrior determined to murder the God of War and alter what no mortal has ever changed... fate itself. [SCEA]… Expand"
  },
  {
    "name": "Persona 5 Royal",
    "details_link": "https://www.metacritic.com/game/playstation-5/persona-5-royal",
    "publisher": "Sega",
    "release_date": "Oct 21 2022",
    "developers": [
      "Atlus"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 91,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/29de53248f9b0e7d6b450de56434f94a-98.jpg",
    "descriptions": "Forced to transfer to a high school in Tokyo, the protagonist has a strange dream. \"You truly are a prisoner of fate. In the near future, ruin awaits you.\" With the goal of \"rehabilitation\" looming overhead, he must save others from distorted desires by donning the mask of a Phantom Thief.Forced to transfer to a high school in Tokyo, the protagonist has a strange dream. \"You truly are a prisoner of fate. In the near future, ruin awaits you.\" With the goal of \"rehabilitation\" looming overhead, he must save others from distorted desires by donning the mask of a Phantom Thief. \r\rPrepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! \r\rDon the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona 5 Royal is packed with new characters, confidants, story depth, new locations to explore, and a new grappling hook mechanic for stealthy access to new areas. With a new semester at Shujin Academy, get ready to strengthen your abilities in the metaverse and in your daily life. \r\rPersona 5 Royal presents a unique visual style and award nominated composer Shoji Meguro returns with an all-new soundtrack. Explore Tokyo, unlock new Personas, customize your own personal Thieves Den, discover a never-before-seen story arc, cutscenes, alternate endings, and more! Even for the most seasoned Phantom Thieves among us, Persona 5 Royal is a new challenge to defy conventions, discover the power within, and fight for justice. Wear the mask. Reveal your truth.… Expand"
  },
  {
    "name": "Celeste",
    "details_link": "https://www.metacritic.com/game/playstation-4/celeste",
    "publisher": "Matt Makes Games Inc.",
    "release_date": "Jan 25 2018",
    "developers": [
      "Matt Makes Games Inc."
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Stadia",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/9/26adcc65f024318b4989f515662022b6-98.jpg",
    "descriptions": "Help Madeline survive her journey to the top of Celeste Mountain in this super-tight, hand-crafted platformer from the creators of TowerFall."
  },
  {
    "name": "Madden NFL 2005",
    "details_link": "https://www.metacritic.com/game/playstation-2/madden-nfl-2005",
    "publisher": "EA Sports",
    "release_date": "Aug  9 2004",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/3/7e5869401bb3ac35ffdc438498680f10-98.jpg",
    "descriptions": "Force the action on defense in Madden NFL 2005. New defensive tools allow you to make more plays and be in on all of the action. The all-new Hit Stick lets you lay the big hit to turn the momentum of the game in your favor. Modify pre-snap assignments, including double teams andForce the action on defense in Madden NFL 2005. New defensive tools allow you to make more plays and be in on all of the action. The all-new Hit Stick lets you lay the big hit to turn the momentum of the game in your favor. Modify pre-snap assignments, including double teams and player-specific match ups, for any defensive player on the field. With the new Storyline Central, you get the inside scoop around the league from radio host Tony Bruno, along with local and national newspapers, to help you make critical franchise decisions. New Hit Stick — Change the momentum of a game by using the right analog stick to make a huge hit, force a turnover, and send the crowd into a frenzy. Time it just right or you'll get burned for a big play. Enhanced Franchise Mode — Players now react to everything that happens in the franchise—reward a hard-working player by naming him team captain or trade away unhappy players. The new game-by-game progression system rewards players for their performance during the season. Your team's crowd is now customizable with new Create-a-Fan. Be on the lookout for team-specific super fans via all-new 3D fan scenes. New EA SPORTS Online - Take on the best Madden players in quick tournaments, or compete in a mini-game of Rushing Attack. Improved EA SPORTS Fair Play keeps the playing field level. [Electronic Arts]… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 3",
    "details_link": "https://www.metacritic.com/game/gamecube/tony-hawks-pro-skater-3",
    "publisher": "Activision",
    "release_date": "Nov 13 2001",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "GameCube"
    ],
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 91,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/9/00d91b4a6277faf5959d38a744efc3d3-98.jpg",
    "descriptions": "You may not be able to live like the legend, but now you can skate like him.  Skate as the legendary Tony Hawk or choose from a dream team of 12 top pro skaters, including old favorites like Lasek, Thomas, Muska, and Steamer, as well as new talent like Gilfberg, Caballero, Koston, andYou may not be able to live like the legend, but now you can skate like him.  Skate as the legendary Tony Hawk or choose from a dream team of 12 top pro skaters, including old favorites like Lasek, Thomas, Muska, and Steamer, as well as new talent like Gilfberg, Caballero, Koston, and Mullen.  Or enjoy full customization abilities with the enhanced Create-a-Skater (now including female skaters) and the Skatepark Editor.  Travel from L.A. to Tokyo, Suburbia to Skater's Island performing challenges and meeting goals.  New moves include the Revert, which allows you to link vert tricks, and flatland tricks such as Caspers, the Primo, and Handstand Manual.  If you're good, you can even unlock hidden pro footage.… Expand"
  },
  {
    "name": "Street Fighter IV",
    "details_link": "https://www.metacritic.com/game/pc/street-fighter-iv",
    "publisher": "Capcom",
    "release_date": "Jul  1 2009",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "2  Online",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 91,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/7/320de58b94d10aaf7cd7999d2016b2a2-98.jpg",
    "descriptions": "At the completion of the second World Warrior Tournament, the Shadaloo crime syndicate was left in ruins, its grandmasters defeated and scattered to the winds. Now, the mysterious Seth, CEO of the S.I.N. Corporation, has set up yet another tournament and invited a blend of old friends andAt the completion of the second World Warrior Tournament, the Shadaloo crime syndicate was left in ruins, its grandmasters defeated and scattered to the winds. Now, the mysterious Seth, CEO of the S.I.N. Corporation, has set up yet another tournament and invited a blend of old friends and new faces to battle again for the title of the world's strongest. With 25 characters (including the original 12 street fighters), a blend of 2D and 3D graphics, and the new focus-attack system, Street Fighter has returned with a vengeance.… Expand"
  },
  {
    "name": "Fallout 3",
    "details_link": "https://www.metacritic.com/game/pc/fallout-3",
    "publisher": "Bethesda Softworks",
    "release_date": "Oct 28 2008",
    "developers": [
      "Bethesda Game Studios"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 91,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/3/238d54d1a52ed5516801b82897e4f79b-98.jpg",
    "descriptions": "[Metacritic's 2008 PC Game of the Year] Vault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice,[Metacritic's 2008 PC Game of the Year] Vault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice, and an incredible cast of dynamic characters. Every minute is a fight for survival against the terrors of the outside world – radiation, Super Mutants, and hostile mutated creatures. From Vault-Tec, America's First Choice in Post Nuclear Simulation. Vault 101 - Jewel of the Wastes. For 200 years, Vault 101 has faithfully served the surviving residents of Washington DC and its environs, now known as the Capital Wasteland. Though the global atomic war of 2077 left the US all but destroyed, the residents of Vault 101 enjoy a life free from the constant stress of the outside world. Giant Insects, Raiders, Slavers, and yes, even Super Mutants are all no match for superior Vault-Tec engineering. Yet one fateful morning, you awake to find that your father has defied the Overseer and left the comfort and security afforded by Vault 101 for reasons unknown. Leaving the only home you've ever known, you emerge from the Vault into the harsh Wasteland sun to search for your father, and the truth. [Bethesda Softworks]… Expand"
  },
  {
    "name": "Batman: Arkham City",
    "details_link": "https://www.metacritic.com/game/pc/batman-arkham-city",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Nov 21 2011",
    "developers": [
      "Rocksteady Studios"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Fantasy",
      "Open-World"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/7/8ca786aa6ce79e3b0c30cdda2f3cb821-98.jpg",
    "descriptions": "DC Comics' Dark Knight clashes with the Joker again in this sequel from Warner Bros. and Rocksteady Games."
  },
  {
    "name": "Fez",
    "details_link": "https://www.metacritic.com/game/pc/fez",
    "publisher": "Trapdoor",
    "release_date": "May  1 2013",
    "developers": [
      "Polytron Corp."
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/4/2201778f9d89d2154c018818155c1722-98.jpg",
    "descriptions": "In Fez, you play as Gomez, a 2D creature living in what he believes is a 2D world. Until a strange and powerful artifact reveals to him the existence of a mysterious third dimension!"
  },
  {
    "name": "Planescape: Torment",
    "details_link": "https://www.metacritic.com/game/pc/planescape-torment",
    "publisher": "Interplay",
    "release_date": "Dec 14 1999",
    "developers": [
      "Black Isle Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General",
      "PC-style RPG",
      "Western-Style"
    ],
    "meta_score": 91,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/7/a99c16e3950e1ba1b6312a0daccac6b9-98.jpg",
    "descriptions": "Welcome to Sigil, the \"City of Doors\", a place with gates that lead anywhere in existence, provided you have the proper key. It is a neutral ground and watering hole for races across the multiverse, all under the watchful shadow of the Lady of Pain, the enigmatic ruler of the city. It is aWelcome to Sigil, the \"City of Doors\", a place with gates that lead anywhere in existence, provided you have the proper key. It is a neutral ground and watering hole for races across the multiverse, all under the watchful shadow of the Lady of Pain, the enigmatic ruler of the city. It is a place where the word is mightier than the sword, where thought defines reality, where belief has the power to reshape worlds and change the laws of physics. [Interplay]… Expand"
  },
  {
    "name": "Gears of War 3",
    "details_link": "https://www.metacritic.com/game/xbox-360/gears-of-war-3",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep 20 2011",
    "developers": [
      "Epic Games"
    ],
    "platforms": "Xbox 360",
    "num_players": "Up to 10 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/3/145056cddf802f18166b0a63dad83876-98.jpg",
    "descriptions": "Developed by acclaimed studio Epic Games and available only on Xbox 360, \"Gears of War 3\" plunges players into a harrowing tale of hope, survival, and brotherhood that will conclude the current story arc for \"Gears of War.\" With the last human city destroyed and theDeveloped by acclaimed studio Epic Games and available only on Xbox 360, \"Gears of War 3\" plunges players into a harrowing tale of hope, survival, and brotherhood that will conclude the current story arc for \"Gears of War.\" With the last human city destroyed and the remaining survivors stranded, time is running out for Marcus and his comrades as they fight to save the human race from the jaws of extinction. … Expand"
  },
  {
    "name": "Killzone 2",
    "details_link": "https://www.metacritic.com/game/playstation-3/killzone-2",
    "publisher": "SCEA",
    "release_date": "Feb 27 2009",
    "developers": [
      "Guerrilla"
    ],
    "platforms": "PlayStation 3",
    "num_players": "Up to 32 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/1/b2fee2de78f0710cb08068bb57206e8b-98.jpg",
    "descriptions": "Two years after the Helghast assault on Vekta, the ISA is taking the fight to the enemy's home world of Helghan. The ISA goal is direct: capture the Helghast leader, Emperor Visari, and bring the Helghast war machine to a halt. Assuming the role of Sev, a battle-hardened veteran and a memberTwo years after the Helghast assault on Vekta, the ISA is taking the fight to the enemy's home world of Helghan. The ISA goal is direct: capture the Helghast leader, Emperor Visari, and bring the Helghast war machine to a halt. Assuming the role of Sev, a battle-hardened veteran and a member of the special forces unit known as the Legion, players lead a group of highly trained soldiers on a mission to take out the Helghast threat. For Sev and his squad, the invasion of Helghan is just the beginning. Tasked with securing Pyrrhus, the Capital City, the team quickly discovers that the Helghast are a formidable enemy on their home planet. Not only have they adjusted to the planet's hostile conditions, they have also harnessed a source of power they can now use against the ISA. Sev discovers his squad isn't just fighting enemy forces – their fiercest opponent may be the planet itself. [Sony]… Expand"
  },
  {
    "name": "Neverwinter Nights",
    "details_link": "https://www.metacritic.com/game/pc/neverwinter-nights",
    "publisher": "Atari",
    "release_date": "Jun 16 2002",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "Up to 64 ",
    "genres": [
      "Role-Playing",
      "PC-style RPG",
      "PC-style RPG",
      "Western-Style"
    ],
    "meta_score": 91,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/2/ae233e55748d7d015acfa5e7a2dc68df-98.jpg",
    "descriptions": "A hideous evil has awoken in the Forgotten Realms. Now, in order to save the inhabitants of the town of Neverwinter you must uncover a sinister conspiracy, unmask your mysterious betrayer and complete an epic struggle to defeat the powerful forces that look to halt your quest and unleash anA hideous evil has awoken in the Forgotten Realms. Now, in order to save the inhabitants of the town of Neverwinter you must uncover a sinister conspiracy, unmask your mysterious betrayer and complete an epic struggle to defeat the powerful forces that look to halt your quest and unleash an evil your people would surely never survive. [Infogrames]… Expand"
  },
  {
    "name": "Batman: Arkham Asylum",
    "details_link": "https://www.metacritic.com/game/playstation-3/batman-arkham-asylum",
    "publisher": "Eidos Interactive",
    "release_date": "Aug 25 2009",
    "developers": [
      "Rocksteady Studios"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 91,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/4/c2941b067f7983c508ec5aff875d1667-98.jpg",
    "descriptions": "In Batman: Arkham Asylum, the player assumes the role of Batman as he delivers The Joker to Arkham Asylum. There, the imprisoned super-villains have set a trap and an immersive combat gaming experience unfolds. With an original script penned by Emmy Award-winning Batman writer Paul Dini, theIn Batman: Arkham Asylum, the player assumes the role of Batman as he delivers The Joker to Arkham Asylum. There, the imprisoned super-villains have set a trap and an immersive combat gaming experience unfolds. With an original script penned by Emmy Award-winning Batman writer Paul Dini, the game brings the universe of DC Comics' detective to life with stunning graphics. Batman: Arkham Asylum offers players the chance to battle Gotham's worst villains with Batman's physical and psychological strength in a graphically distinct and story-driven game. [Eidos Interactive]… Expand"
  },
  {
    "name": "Castlevania: Aria of Sorrow",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/castlevania-aria-of-sorrow",
    "publisher": "Konami",
    "release_date": "May  6 2003",
    "developers": [
      "KCET"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/0/95e62eabf7def121bd7621d2bfcdb5b6-98.jpg",
    "descriptions": "The year is 2035 and Soma Cruz is about to witness the first solar eclipse of the 21st century when he suddenly blacks out -- only to awaken inside a mysterious castle. As Soma, you must navigate the castle's labyrinths while confronting perilous monsters at every turn. But beware, you mustThe year is 2035 and Soma Cruz is about to witness the first solar eclipse of the 21st century when he suddenly blacks out -- only to awaken inside a mysterious castle. As Soma, you must navigate the castle's labyrinths while confronting perilous monsters at every turn. But beware, you must escape before the evil consumes you!… Expand"
  },
  {
    "name": "No One Lives Forever 2: A Spy in H.A.R.M.'s Way",
    "details_link": "https://www.metacritic.com/game/pc/no-one-lives-forever-2-a-spy-in-harms-way",
    "publisher": "Sierra Entertainment",
    "release_date": "Sep 30 2002",
    "developers": [
      "Monolith Productions"
    ],
    "platforms": "PC",
    "genres": [
      "Action",
      "Action Adventure",
      "Shooter",
      "General",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/7/8bfb71297900bc0fa29e25f0ddc0f102-98.jpg",
    "descriptions": "A humorous story-driven first-person shooter featuring the beautiful but deadly UNITY operative Cate Archer. Cate must investigate a super-secret Soviet project that, if successful, could bring about a third world war. Armed with an assortment of conventional and experimental weaponry andA humorous story-driven first-person shooter featuring the beautiful but deadly UNITY operative Cate Archer. Cate must investigate a super-secret Soviet project that, if successful, could bring about a third world war. Armed with an assortment of conventional and experimental weaponry and gadgets, players will explore exotic locales, circumvent devious traps, and contend with deadly agents determined to take Cate out of the spy trade once and for all. [Sierra]… Expand"
  },
  {
    "name": "INSIDE",
    "details_link": "https://www.metacritic.com/game/playstation-4/inside",
    "publisher": "PLAYDEAD",
    "release_date": "Aug 23 2016",
    "developers": [
      "PLAYDEAD"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/6/c581ae173ec05ec8990c05374f7b117d-98.jpg",
    "descriptions": "Hunted and alone, a boy finds himself drawn into the center of a dark project. The second game from Limbo developer Playdead."
  },
  {
    "name": "Legacy of Kain: Soul Reaver",
    "details_link": "https://www.metacritic.com/game/playstation/legacy-of-kain-soul-reaver",
    "publisher": "Eidos Interactive",
    "release_date": "Aug 16 1999",
    "developers": [
      "Crystal Dynamics"
    ],
    "platforms": [
      "PC",
      "PlayStation"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Horror"
    ],
    "meta_score": 91,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/9/6fa70ade6b2f6545f3908414e4df177c-98.jpg",
    "descriptions": "Cast down to the material world, the mysterious entity 'Raziel' seeks vengeance for betrayal by his master: Kain. Cursed to stalk the dark realms of Nosgoth, he must slay his undead brethren; only then can he absorb their souls for the energy he craves. Moving between the spectral andCast down to the material world, the mysterious entity 'Raziel' seeks vengeance for betrayal by his master: Kain. Cursed to stalk the dark realms of Nosgoth, he must slay his undead brethren; only then can he absorb their souls for the energy he craves. Moving between the spectral and material plane, Raziel must negotiate puzzles, overcome traps and defy blood-chilling enemies to reach his goal - the final battle with Kain!… Expand"
  },
  {
    "name": "Dragon Age: Origins",
    "details_link": "https://www.metacritic.com/game/pc/dragon-age-origins",
    "publisher": "Electronic Arts",
    "release_date": "Nov  3 2009",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "PC-style RPG",
      "PC-style RPG",
      "Western-Style"
    ],
    "meta_score": 91,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/1/9792a1d13ac952d86ca0bf645f5d4fca-98.jpg",
    "descriptions": "As the spiritual successor to BioWare's \"Baldur's Gate\", one of the most successful role-playing games in the industry, Dragon Age: Origins represents BioWare's return to its roots, delivering a fusion of the best elements of existing fantasy works with stunning visuals, emotionally-drivenAs the spiritual successor to BioWare's \"Baldur's Gate\", one of the most successful role-playing games in the industry, Dragon Age: Origins represents BioWare's return to its roots, delivering a fusion of the best elements of existing fantasy works with stunning visuals, emotionally-driven narrative, heart-pounding combat, powerful magic abilities and credible digital actors. The spirit of classic RPGs comes of age, as Dragon Age: Origins features a dark and mature story and gameplay. Epic Party-Based Combat – Dragon Age: Origins introduces an innovative, scalable combat system, as players face large-scale battles and use their party’s special abilities to destroy hoardes of enemies and massive creatures. Powerful Magic – Raining down awesome destruction on enemies is even more compelling as players apply \"spell combos,\" a way of combining together different spells to create emergent unique effects. Players develop their characters and gain powerful special abilities (spells, talents and skills) and discover ever-increasing weapons of destruction. With its emotionally compelling story, players choose with whom they wish to forge alliances or crush under their mighty fist, redefining the world with the choices they make and how they wield their power. Players select and play a unique prelude that provides the lens through which the player sees the world and how the world sees the player. The player's choice of Origin determines who they are and where they begin the adventure, as they play through a customized story opening that profoundly impacts the course of every adventure. [BioWare]… Expand"
  },
  {
    "name": "Golden Sun",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/golden-sun",
    "publisher": "Nintendo",
    "release_date": "Nov 11 2001",
    "developers": [
      "Camelot Software Planning"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 91,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/2/b83c7e497133fa89301b8d18cffbf84b-98.jpg",
    "descriptions": "In a dark time, an epic adventure begins as evil slowly envelops the world! The forces of darkness are pursuing the lost art of Alchemy, and as they draw ever closer to their foul purpose, mankind's future hangs in the balance. You and your companions are the last hope: armed with nobleIn a dark time, an epic adventure begins as evil slowly envelops the world! The forces of darkness are pursuing the lost art of Alchemy, and as they draw ever closer to their foul purpose, mankind's future hangs in the balance. You and your companions are the last hope: armed with noble weapons, mysterious Psynergy and a host of elemental creatures, you must find a way to stem the evil tide. Your ordinary life is over, as a Golden Sun rises above you and forever broadens your horizon!\r … Expand"
  },
  {
    "name": "Rayman Legends",
    "details_link": "https://www.metacritic.com/game/playstation-3/rayman-legends",
    "publisher": "Ubisoft",
    "release_date": "Sep  3 2013",
    "developers": [
      "Ubisoft Montpellier"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Stadia",
      "Wii U",
      "Xbox 360",
      "Xbox One",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/7/7f02e7390a741dad084aa06576428896-98.jpg",
    "descriptions": "Rayman Legends is the follow-up to Rayman Origins and brings multiplayer interactions for you to employ. The Glade of Dreams is in trouble again. During a 100-year nap, the nightmares multiplied and spread, creating new monsters even scarier than before. These creatures are the stuff ofRayman Legends is the follow-up to Rayman Origins and brings multiplayer interactions for you to employ. The Glade of Dreams is in trouble again. During a 100-year nap, the nightmares multiplied and spread, creating new monsters even scarier than before. These creatures are the stuff of legend… Dragons, giant toads, sea monsters, and even evil luchadores. With the help of Murfy, Rayman and Globox awake and must now help fight these nightmares and save the Teensies.… Expand"
  },
  {
    "name": "F1 2020",
    "details_link": "https://www.metacritic.com/game/xbox-one/f1-2020",
    "publisher": "Codemasters",
    "release_date": "Jul 10 2020",
    "developers": [
      "Codemasters"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Xbox One"
    ],
    "num_players": "Up to 20 ",
    "genres": [
      "Racing",
      "Simulation",
      "Automobile"
    ],
    "meta_score": 91,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/1/c623b8eafe8fe931793e7f004b663b86-98.jpg",
    "descriptions": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode,For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.… Expand"
  },
  {
    "name": "Mark of the Ninja",
    "details_link": "https://www.metacritic.com/game/pc/mark-of-the-ninja",
    "publisher": "Microsoft Game Studios",
    "release_date": "Oct 16 2012",
    "developers": [
      "Klei Entertainment"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/1/465d91a6acb0742208924721a8e87cc3-98.jpg",
    "descriptions": "\"Mark of the Ninja\" is a side-scrolling stealth action game from Klei Entertainment that combines fluid 2D animation with intense stealth gameplay. Observe your enemies from afar, manipulate them with your tools, and execute your plan with precision. But be careful - you're as\"Mark of the Ninja\" is a side-scrolling stealth action game from Klei Entertainment that combines fluid 2D animation with intense stealth gameplay. Observe your enemies from afar, manipulate them with your tools, and execute your plan with precision. But be careful - you're as fragile as you are powerful.… Expand"
  },
  {
    "name": "Disco Elysium",
    "details_link": "https://www.metacritic.com/game/pc/disco-elysium",
    "publisher": "ZA/UM",
    "release_date": "Oct 15 2019",
    "developers": [
      "ZA/UM"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General",
      "Western-Style"
    ],
    "meta_score": 91,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/259cfab379c2636758908c1812f4fcff-98.jpg",
    "descriptions": "Disco Elysium is an open world role playing game. You’re a detective with a unique skill system at your disposal and a whole city block to carve your path across. Interrogate unforgettable characters, crack murders or take bribes. Become a hero or an absolute disaster of a human being."
  }
]