[
  {
    "name": "Shrek 2",
    "details_link": "https://www.metacritic.com/game/playstation-2/shrek-2",
    "publisher": "Activision",
    "release_date": "Apr 28 2004",
    "developers": [
      "Luxoflux",
      "Inc."
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/9/b7a08ce9b9ed04c7a31e09294a95fc8c-98.jpg",
    "descriptions": "This sequel takes you deeper into the world of Shrek and his friends. Enjoy rich, colorful scenery and events from the movie that bring these funny and enjoyable characters to life. Learn the attributes of each character's personality, attacks and abilities to progress through anThis sequel takes you deeper into the world of Shrek and his friends. Enjoy rich, colorful scenery and events from the movie that bring these funny and enjoyable characters to life. Learn the attributes of each character's personality, attacks and abilities to progress through an action-packed quest. Play as Shrek or choose from 10 other characters. Switch between four rotating characters instantly to utilize each character's special skills and attributes. Live out key moments from the movie and discover never-before-seen locations and characters. Go on special mini quests that highlight specific characters. Play with up to three friends at a time who can enter or leave the game with no interruption to your adventure.… Expand"
  },
  {
    "name": "Teenage Mutant Ninja Turtles",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/teenage-mutant-ninja-turtles",
    "publisher": "Konami",
    "release_date": "Oct 31 2003",
    "developers": [
      "Konami"
    ],
    "platforms": [
      "PlayStation 2",
      "Game Boy Advance"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 71,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/2/91d50e641de1b0bbba6744f5738740d3-98.jpg",
    "descriptions": "Be your favorite Teenage Mutant Ninja Turtle and master your ninja skills in their action-packed world.  Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of foot ninjas.   Find scrolls to unlock specialBe your favorite Teenage Mutant Ninja Turtle and master your ninja skills in their action-packed world.  Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of foot ninjas.   Find scrolls to unlock special attack moves and effects.  Interact with characters from the animated television series, such as Splinter and Casey Jones.  Don't hide in your shell--be a hero.… Expand"
  },
  {
    "name": "Hulk",
    "details_link": "https://www.metacritic.com/game/playstation-2/hulk",
    "publisher": "Universal Interactive",
    "release_date": "May 27 2003",
    "developers": [
      "Radical Entertainment"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 71,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/3/90da464c7d4c4809e695c19d2a568e44-98.jpg",
    "descriptions": "One year after the events that take place in the film; troubled scientist Bruce Banner and his enraged alter ego, the Hulk, are forced into battle against the terrifying forces of the Leader, who's intent on using the Hulk's gamma energy to unleash a relentless army of gamma creatures on theOne year after the events that take place in the film; troubled scientist Bruce Banner and his enraged alter ego, the Hulk, are forced into battle against the terrifying forces of the Leader, who's intent on using the Hulk's gamma energy to unleash a relentless army of gamma creatures on the world. Two types of gameplay - use the powers of stealth and logic as Bruce Banner or command the incredible strength and fury of the Hulk. 30 massive, highly-detailed levels featuring environments both directly from the film and exclusive to the game. Fully destructible and interactive environments - virtually anything can be manipulated, picked up, destroyed or used a weapon. Intense boss battles - battle it out against gamma-enhanced super villains like Flux, Rampage and Half Life. Hollywood quality VO and soundtrack featuring detailed voice over from Eric Bana as Bruce Banner. Take down the Hulk's foes with over 25 devastating attacks, including super attacks like the Sonic Clap and Gamma Slam. [Vivendi Universal]… Expand"
  },
  {
    "name": "Sub Rebellion",
    "details_link": "https://www.metacritic.com/game/playstation-2/sub-rebellion",
    "publisher": "Metro3D",
    "release_date": "Oct 12 2002",
    "developers": [
      "Racjin"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Simulation",
      "Sci-Fi",
      "Futuristic Sub"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/1/157e87e722f1bf61d6a4e02a711642f8-98.jpg",
    "descriptions": "Hi-Tech Alliance nuclear attack submarine at Minus 1,000 feet. Your mission is simple: Blow the Meluguis Empire to kingdom come. Underwater, your adversary will never see you coming. They better not hear you either. Non-stop, adrenaline-pumping action and adventure await you and your crew.Hi-Tech Alliance nuclear attack submarine at Minus 1,000 feet. Your mission is simple: Blow the Meluguis Empire to kingdom come. Underwater, your adversary will never see you coming. They better not hear you either. Non-stop, adrenaline-pumping action and adventure await you and your crew. Move full speed ahead around a massive post-apocalyptic underwater world in the most intense sub shooter ever. [Metro3D]… Expand"
  },
  {
    "name": "Zone of the Enders: The Fist of Mars",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/zone-of-the-enders-the-fist-of-mars",
    "publisher": "Konami",
    "release_date": "Mar  3 2002",
    "developers": [
      "WinkySoft"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Sci-Fi"
    ],
    "meta_score": 71,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/4/51776f49d2ff826b5d6d859d2a4468ef-98.jpg",
    "descriptions": "The year is 2173 A.D. A young boy named Cage finds himself in control of a fully armed prototype mechanized robots and now he must prevent a space colony hijack of Mars. An army of trucks, tanks, fighters, and giant, anime-style robots all collide in this exciting new chapter of the Zone ofThe year is 2173 A.D. A young boy named Cage finds himself in control of a fully armed prototype mechanized robots and now he must prevent a space colony hijack of Mars. An army of trucks, tanks, fighters, and giant, anime-style robots all collide in this exciting new chapter of the Zone of the Enders saga.… Expand"
  },
  {
    "name": "Mat Hoffman's Pro BMX",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/mat-hoffmans-pro-bmx",
    "publisher": "Activision",
    "release_date": "Nov 19 2001",
    "developers": [
      "HotGen"
    ],
    "platforms": [
      "PC",
      "Game Boy Advance"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Biking"
    ],
    "meta_score": 71,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/34d9872006b8414a90cbd8b7b56496f2-98.jpg",
    "descriptions": "Ride like 10-time World Vert Chamption Mat Hoffman or 7 other BMX pros. Pull off over 200 tricks and combo moves, including pro-signature moves. Shred through Street, Vert and Dirt courses with 4 different game modes to choose from."
  },
  {
    "name": "Gallop Racer 2001",
    "details_link": "https://www.metacritic.com/game/playstation-2/gallop-racer-2001",
    "publisher": "Tecmo",
    "release_date": "Aug 20 2001",
    "developers": [
      "Tecmo"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Horse Racing"
    ],
    "meta_score": 71,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/8/f0adc6c5857d84b91d763464ec1e299e-98.jpg",
    "descriptions": "Following up \"Gallop Racer\" for the PSX, GR 2001 players can manage and assemble\rtheir own stable or simply bet on the races themselves. Players can assume the role of the breeder, the jockey, or a spectator in the stands.  [Tecmo]."
  },
  {
    "name": "Hellgate: London",
    "details_link": "https://www.metacritic.com/game/pc/hellgate-london",
    "publisher": "EA Games",
    "release_date": "Oct 31 2007",
    "developers": [
      "Flagship Studios"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 70,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/4/50e9244cb289380944f4eedef29c149d-98.jpg",
    "descriptions": "Set twenty-five years in the future, Hellgate: London introduces a world devastated by a demon invasion and a desolate city scorched by hellfire where mankind has gone underground to survive. Among them are the Templar, an archaic and secret society that foresaw this demonic apocalypseSet twenty-five years in the future, Hellgate: London introduces a world devastated by a demon invasion and a desolate city scorched by hellfire where mankind has gone underground to survive. Among them are the Templar, an archaic and secret society that foresaw this demonic apocalypse centuries ago. Followers of arcane rites, the Templar combine futuristic technology with ancient artifacts to forge powerful weapons and armor. The mystic sanctuary of the Underground system provides players safe conduct throughout the sprawling metropolis of London as they seek to preserve the bloodline of man and gain a foothold against the minions of darkness. Hellgate: London combines the depth of role-playing games and action of first-person titles, while offering infinite playability with randomly created levels, items, and events. The player creates a heroic character, completes quests, and battles through innumerable hordes of demons to advance through experience levels and branching skill paths. A robust, flexible skill and spell system, highly customizable appearances, and a massive variety of randomly generated equipment allow players to create their own unique hero. [Namco]… Expand"
  },
  {
    "name": "Worms: Open Warfare",
    "details_link": "https://www.metacritic.com/game/psp/worms-open-warfare",
    "publisher": "THQ",
    "release_date": "Mar 22 2006",
    "developers": [
      "Team17"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Xbox 360",
      "PSP"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy",
      "Fantasy",
      "Artillery"
    ],
    "meta_score": 70,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/5/0cc14bbf95c2d8db7c84cfe93d3d819a-98.jpg",
    "descriptions": "Retaining the same award-winning gameplay, unique sense of humor and clever mix of action and strategy that has epitomized the brand for almost a decade, Worms makes its debut on the Sony PSP and the Nintendo DS. Classic Gameplay – Return of the classic and much acclaimed 2D turn-basedRetaining the same award-winning gameplay, unique sense of humor and clever mix of action and strategy that has epitomized the brand for almost a decade, Worms makes its debut on the Sony PSP and the Nintendo DS. Classic Gameplay – Return of the classic and much acclaimed 2D turn-based gameplay. Over The Weapons – Including bazooka-toting worms, exploding sheep, homing missiles, grenades and banana bouncing bombs of death. Unparalleled Multiplayer Experience – Multiplayer mode allowing up to four players using one unit (hot seat). Multiplayer mode via WIFI technology allowing connection of 4 units. Conflict and Destruction – Take on all-comers over a nearly infinite number of randomly-generated landscapes, or face the fiendishly intelligent artificial intelligence in Deathmatch Challenge mode. [THQ]… Expand"
  },
  {
    "name": "Deadly Premonition: The Director's Cut",
    "details_link": "https://www.metacritic.com/game/playstation-3/deadly-premonition-the-directors-cut",
    "publisher": "Rising Star Games",
    "release_date": "Apr 30 2013",
    "developers": [
      "Access Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Open-World"
    ],
    "meta_score": 70,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/6/abfcc3c7a9c9466c2974204a18e93703-98.jpg",
    "descriptions": "Deadly Premonition is a third-person survival horror action game which puts players in the role of the intuitive FBI Agent Francis York Morgan. In the process of investigating a murder, players will examine a series of interlocking mysteries in a remote rural town and will encounter an arrayDeadly Premonition is a third-person survival horror action game which puts players in the role of the intuitive FBI Agent Francis York Morgan. In the process of investigating a murder, players will examine a series of interlocking mysteries in a remote rural town and will encounter an array of complex characters pivotal to the unraveling of the storyline's mystery. Suspenseful action sequences will force players to make strategic moves, gliding by enemies in the shadows or engaging them with long-range weapons or hand-to-hand melee combat. From the unparalleled atmosphere, music and mysterious storyline to driving vehicles and exploring the entire town, Deadly Premonition will offer players a unique and haunting interactive gaming experience unlike any other.… Expand"
  },
  {
    "name": "Castlevania: Curse of Darkness",
    "details_link": "https://www.metacritic.com/game/playstation-2/castlevania-curse-of-darkness",
    "publisher": "Konami",
    "release_date": "Nov  1 2005",
    "developers": [
      "Konami"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 70,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/1/3168749af5d7989cda663709182197d9-98.jpg",
    "descriptions": "The legendary Castlevania series returns with a new story and a new hero. Hector, one of two Devil Forgemasters who once trained under Dracula, has fled Vallachia disillusioned with the ideals of his mentor. Now, three years after Dracula was defeated in battle at the hands of the Belmonts,The legendary Castlevania series returns with a new story and a new hero. Hector, one of two Devil Forgemasters who once trained under Dracula, has fled Vallachia disillusioned with the ideals of his mentor. Now, three years after Dracula was defeated in battle at the hands of the Belmonts, Isaac – a former friend and fellow Devil Forgemaster suddenly reappears and orchestrates the execution of Hector's beloved. Fueled by revenge, Hector returns to Vallachia to confront Isaac. Use Devil Forgery skills to develop & enhance \"Innocent Devils\" allies. RPG elements featuring character growth based on experience points. A deep storyline that unfolds against a backdrop of beautifully environments. Increased number of unlockable features enhances replayability. [Konami]… Expand"
  },
  {
    "name": "Eragon",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/eragon",
    "publisher": "Sierra Entertainment",
    "release_date": "Nov 14 2006",
    "developers": [
      "Amaze Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox 360",
      "Game Boy Advance"
    ],
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 70,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/3/886269128e5432819c4492a8861cb180-98.jpg",
    "descriptions": "Play as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features aPlay as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features a variety of blistering attacks and defences, including a unique degradable block system. Extensive Dragon Combat - Ride Saphira and blast your enemies with bursts of fire, and call in devastating dragon attacks during melee battles. Eragon features multiplayer co-op with team attack bonuses and dragon fight/flight combo gameplay. Full cooperation from the film production team provides faithful implementation of the movie's look-and-feel. As Eragon discovers the powers hidden within him he learns to unleash magical attacks to decimate his foes.… Expand"
  },
  {
    "name": "Top Darts",
    "details_link": "https://www.metacritic.com/game/playstation-3/top-darts",
    "publisher": "SCEA",
    "release_date": "Dec 21 2010",
    "developers": [
      "SCEA"
    ],
    "platforms": "PlayStation 3",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Miscellaneous",
      "General",
      "General",
      "Individual",
      "Other"
    ],
    "meta_score": 70,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/5/ebc154b02211cc305d522f5e6dc9a537-98.jpg",
    "descriptions": "Top Darts features a large selection of traditional darts games as well as an assortment of unique challenges & frantic offline multiplayer games for up to 8 players. Using the accuracy of the PlayStation Move motion controller, aim for the highest score in nine classic dart games includingTop Darts features a large selection of traditional darts games as well as an assortment of unique challenges & frantic offline multiplayer games for up to 8 players. Using the accuracy of the PlayStation Move motion controller, aim for the highest score in nine classic dart games including 501, Around the Clock, Soccer & Warfare. Or go for gold in a wide range of fun and diverse challenges based on time limits, target scores, and accuracy. Then take your game to the next level and throw yourself into a league or cup competition to become the ultimate Top Darts champion! … Expand"
  },
  {
    "name": "Spectrobes: Beyond the Portals",
    "details_link": "https://www.metacritic.com/game/ds/spectrobes-beyond-the-portals",
    "publisher": "Disney Interactive Studios",
    "release_date": "Oct  7 2008",
    "developers": [
      "Jupiter Corporation",
      "Jupiter Multimedia"
    ],
    "platforms": "DS",
    "num_players": "4  Online",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 70,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/7/d976a90ffcaa2b66427cc0f05073d42d-98.jpg",
    "descriptions": "Spectrobes: Beyond The Portals for Nintendo DS continues the story of Rallen and Jeena, interplanetary patrol officers who discover, excavate, awaken and train mysterious fossilized creatures known as Spectrobes and then use them to battle enemies. The story surrounds the origins ofSpectrobes: Beyond The Portals for Nintendo DS continues the story of Rallen and Jeena, interplanetary patrol officers who discover, excavate, awaken and train mysterious fossilized creatures known as Spectrobes and then use them to battle enemies. The story surrounds the origins of mysterious portals that lead to distant dimensions. With the game’s inclusion of DGamer, players can customize a unique 3D avatar, earn exclusive Disney content, interact and chat with their friends via their Nintendo DS using the Nintendo Wi-Fi Connection or on a computer through the Disney.com website. [Disney Interactive Studios]… Expand"
  },
  {
    "name": "Afterparty",
    "details_link": "https://www.metacritic.com/game/playstation-4/afterparty",
    "publisher": "Night School Studio",
    "release_date": "Oct 29 2019",
    "developers": [
      "Night School Studio"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 70,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/9/fc5fc8bd6fbbdb85547937d44df36822-98.jpg",
    "descriptions": "In Afterparty, you are Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth. What adventures will you stumble through in the underworld? Every step is up to you.In Afterparty, you are Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth. What adventures will you stumble through in the underworld? Every step is up to you. Time to go on the best bender ever, uncover the mystery of why you’ve been damned, and drink the big guy under the table. [Night School]… Expand"
  },
  {
    "name": "Assassin's Creed Unity",
    "details_link": "https://www.metacritic.com/game/pc/assassins-creed-unity",
    "publisher": "Ubisoft",
    "release_date": "Nov 11 2014",
    "developers": [
      "Ubisoft",
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PlayStation 4",
      "Stadia",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Action Adventure",
      "Historic",
      "Open-World"
    ],
    "meta_score": 70,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/0/27d7503488d6aed120e5234fd8417c94-98.jpg",
    "descriptions": "The city: 1789 Paris. The French Revolution transforms a once-magnificent city into a hot house of terror and calamity. Its cobblestone streets run red with the blood of the proletariat who dared to rise up against the oppressive aristocracy. As the nation is in upheaval, a man named ArnoThe city: 1789 Paris. The French Revolution transforms a once-magnificent city into a hot house of terror and calamity. Its cobblestone streets run red with the blood of the proletariat who dared to rise up against the oppressive aristocracy. As the nation is in upheaval, a man named Arno leaves on a journey to expose the true powers of the Revolution. His mission throws him into the middle of a ruthless struggle for the fate of a nation, and transform him into a real Master Assassin. From the storming of the Bastille to the execution of King Louis XVI, experience the French Revolution as never before, and help the people of France carve an entirely new destiny.… Expand"
  },
  {
    "name": "Hector: Badge of Carnage - Episode 3: Beyond Reasonable Doom",
    "details_link": "https://www.metacritic.com/game/pc/hector-badge-of-carnage---episode-3-beyond-reasonable-doom",
    "publisher": "Telltale Games",
    "release_date": "Sep 22 2011",
    "developers": [
      "Straandlooper"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "genres": [
      "Action",
      "Action Adventure",
      "Adventure",
      "General",
      "General"
    ],
    "meta_score": 70,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/6/b78938e2703ba278d007187d28a8cddc-98.jpg",
    "descriptions": null
  },
  {
    "name": "DARQ",
    "details_link": "https://www.metacritic.com/game/pc/darq",
    "publisher": "Unfold Games",
    "release_date": "Aug 15 2019",
    "developers": [
      "Unfold Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Adventure",
      "General",
      "Linear"
    ],
    "meta_score": 70,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/aae2cacf2c7f7589e0cacd86fef6905a-98.jpg",
    "descriptions": "DARQ tells the story of Lloyd, a boy who becomes aware of the fact that he is dreaming. The dream quickly turns into a nightmare and all attempts to wake up end in failure. Lloyd learns how to survive the nightmare by bending the laws of physics and manipulating the fluid fabric of the dream world."
  },
  {
    "name": "BUTCHER",
    "details_link": "https://www.metacritic.com/game/switch/butcher",
    "publisher": "Crunching Koalas",
    "release_date": "Sep 28 2017",
    "developers": [
      "Transhuman Design"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 70,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/5/125fea819f7a8dca7905fa5aefdce6f3-98.jpg",
    "descriptions": "BUTCHER is a fast-paced 2D shooter and a blood-soaked love letter to the cult classics of the genre. As a cyborg programmed to eradicate the last remnants of humanity, your sole purpose is to… well... annihilate anything that moves. So grab your weapon of choice (from chainsaws, to shotguns,BUTCHER is a fast-paced 2D shooter and a blood-soaked love letter to the cult classics of the genre. As a cyborg programmed to eradicate the last remnants of humanity, your sole purpose is to… well... annihilate anything that moves. So grab your weapon of choice (from chainsaws, to shotguns, to grenade launchers) and kill your way through underground hideouts, post-apocalyptic cities, jungles, and more. And if you're feeling creative, there are plenty of other ways to end your enemies' misery – hooks, lava pits, saws... no death will ever be the same again. [Nintendo] … Expand"
  },
  {
    "name": "Batman: The Enemy Within - Episode 1: The Enigma",
    "details_link": "https://www.metacritic.com/game/playstation-4/batman-the-enemy-within---episode-1-the-enigma",
    "publisher": "Telltale Games",
    "release_date": "Aug  8 2017",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 70,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/8/df2d7638aee88ef7f4d8a5a2363d93cd-98.jpg",
    "descriptions": "Both Bruce Wayne and Batman ARE forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis. With the arrival of a ruthless federal agent and the return of a still nascent Joker, Batman must navigateBoth Bruce Wayne and Batman ARE forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis. With the arrival of a ruthless federal agent and the return of a still nascent Joker, Batman must navigate uneasy alliances while Bruce Wayne undertakes a perilous series of deceptions.… Expand"
  },
  {
    "name": "Goblin Commander: Unleash the Horde",
    "details_link": "https://www.metacritic.com/game/xbox/goblin-commander-unleash-the-horde",
    "publisher": "Jaleco Entertainment",
    "release_date": "Nov 11 2003",
    "developers": [
      "Jaleco Entertainment"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy"
    ],
    "meta_score": 70,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/1/2ee36f19c707efb553c28c552e57fa88-98.jpg",
    "descriptions": "Goblin Commander: Unleash the Horde calls upon your skill and courage to destroy the enemy, pillage the enclaves, and scorch the earth. With a horde of specialized goblin warriors at your command, you can wage war in single-player and multiplayer modes. Design a custom army from over 25Goblin Commander: Unleash the Horde calls upon your skill and courage to destroy the enemy, pillage the enclaves, and scorch the earth. With a horde of specialized goblin warriors at your command, you can wage war in single-player and multiplayer modes. Design a custom army from over 25 different goblins with melee, ranged, elemental, acid, and magical combat specialties. You can even take direct control of giant titans, powerful turrets, and battle-ready vehicles to cause reckless mayhem across the lands.… Expand"
  },
  {
    "name": "Bionic Commando",
    "details_link": "https://www.metacritic.com/game/xbox-360/bionic-commando",
    "publisher": "Capcom",
    "release_date": "May 18 2009",
    "developers": [
      "GRIN"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Action Adventure",
      "Adventure",
      "Third-Person",
      "General",
      "Platformer",
      "Sci-Fi",
      "Sci-Fi",
      ""
    ],
    "meta_score": 70,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/8/79cd5a50ac56f1716432f70971daa5b6-98.jpg",
    "descriptions": "The first true sequel to the classic 1988 Nintendo Entertainment System original, Bionic Commando sees the return of the bionically-enhanced Nathan \"Rad\" Spencer, voiced by Mike Patton, the former lead singer of Faith No More. Time has not been kind to Spencer: 10 years after his heroicThe first true sequel to the classic 1988 Nintendo Entertainment System original, Bionic Commando sees the return of the bionically-enhanced Nathan \"Rad\" Spencer, voiced by Mike Patton, the former lead singer of Faith No More. Time has not been kind to Spencer: 10 years after his heroic defeat of the Imperials in the original game, he has been betrayed by the government he swore to serve, imprisoned for crimes he didn't commit, and sentenced to death. On the very day of Spencer's execution, terrorists detonate a massive experimental weapon in Ascension City, unleashing an intense earthquake that has turned the city into rubble and wiped out its population. With the terrain in ruins and the city's air defense grid now in the control of a massive terrorist force whose goal remains unclear, the FSA have only one option left - a behind-the-lines assault. The perfect job for a Bionic Commando. Bionic Commando transposes the swing-and-shoot gameplay of the 8-bit original to a stunning 3D environment of towering buildings, suspended roadways and monorails, deep canyons and sheer rock faces, where every environment is scalable using swinging, scaling, climbing and wall-walking techniques. [Capcom]… Expand"
  },
  {
    "name": "Dice Legacy",
    "details_link": "https://www.metacritic.com/game/pc/dice-legacy",
    "publisher": "Ravenscourt",
    "release_date": "Sep  9 2021",
    "developers": [
      "DESTINYbit"
    ],
    "platforms": [
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "General"
    ],
    "meta_score": 70,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/8/43e17d1913f31b13e0c683d3bb07b1ba-98.jpg",
    "descriptions": "In this roguelike survival city builder, you lead your realm by rolling the dice - literally, because the dice rolls determining your fate aren't happening in the background but are one of the main gameplay elements of Dice Legacy. Discover uncharted lands and guide your loyal subjects.PutIn this roguelike survival city builder, you lead your realm by rolling the dice - literally, because the dice rolls determining your fate aren't happening in the background but are one of the main gameplay elements of Dice Legacy. Discover uncharted lands and guide your loyal subjects.Put your faith in the dice as you gather resources, construct buildings and expand the borders of your realm. Create a strategy that fits your playstyle as you explore the wilderness. Test your luck as you make contact with the enigmatic factions populating the ringworld. But beware: something wicked is lurking in the mists beyond your realm, waiting for its chance to strike.… Expand"
  },
  {
    "name": "A Fisherman's Tale",
    "details_link": "https://www.metacritic.com/game/playstation-4/a-fishermans-tale",
    "publisher": "Vertigo Games",
    "release_date": "Jan 22 2019",
    "developers": [
      "Innerspace VR"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 70,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/1/681b86d0a32bf42cfdc8f2a4fe1f0d24-98.jpg",
    "descriptions": "Bend and twist reality in A Fisherman’s Tale, the mind-bending VR puzzle adventure game in which being turned upside down and inside out is not merely a play on words."
  },
  {
    "name": "Sheltered",
    "details_link": "https://www.metacritic.com/game/playstation-4/sheltered",
    "publisher": "Team17",
    "release_date": "Mar 15 2016",
    "developers": [
      "Unicube"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Strategy",
      "Real-Time",
      "Defense"
    ],
    "meta_score": 70,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/0/4acea7c742a1448d0bb0c666bae386dd-98.jpg",
    "descriptions": "It’s a post-apocalyptic survival game with some pretty complicated mechanics that brings it snugly into the roguelike arena. In Sheltered you’ll find some familiar mechanics: scavenging for supplies, crafting, building, and maintaining your shelter, but that’s where familiarity ends.It’s a post-apocalyptic survival game with some pretty complicated mechanics that brings it snugly into the roguelike arena. In Sheltered you’ll find some familiar mechanics: scavenging for supplies, crafting, building, and maintaining your shelter, but that’s where familiarity ends. Sheltered doesn’t focus on soul survivors, but an average family. Your family. [Unicube]… Expand"
  },
  {
    "name": "BloodRayne 2",
    "details_link": "https://www.metacritic.com/game/playstation-2/bloodrayne-2",
    "publisher": "Majesco Games",
    "release_date": "Oct 12 2004",
    "developers": [
      "Terminal Reality"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Fantasy"
    ],
    "meta_score": 70,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/4/33f8e245ecde4d3f298766c854382ffe-98.jpg",
    "descriptions": "Born from the unnatural union of vampire and human, BloodRayne is blessed with the powers of a vampire but cursed with the unquenchable thirst for blood and a weakness to sunlight. BloodRayne 2 challenges the supernatural anti-heroine with her most personal battle yet as she hunts down eachBorn from the unnatural union of vampire and human, BloodRayne is blessed with the powers of a vampire but cursed with the unquenchable thirst for blood and a weakness to sunlight. BloodRayne 2 challenges the supernatural anti-heroine with her most personal battle yet as she hunts down each of her wicked siblings who are carrying on the legacy of their dead father, Kagan. They have created \"The Shroud,\" a mysterious substance which, when released, renders the sun?s lethal rays harmless to vampires. Now only BloodRayne stands between an unsuspecting humanity and a horrifying vampire dawn. Expanding upon the distinctive features that were the hallmark of its predecessor ? fast-paced acrobatic combat and supernatural powers ? BloodRayne 2 includes new in-game dynamics such as pole combat, rail sliding and advanced melee fighting with fatality moves. Built upon a modified version of the Infernal Engine, BloodRayne 2 introduces threatening new bosses, all new environments set within a huge modern day city, a range of new supernatural powers and new motion-captured movements complete with soft-body physics. [Majesco]… Expand"
  },
  {
    "name": "Dead State",
    "details_link": "https://www.metacritic.com/game/pc/dead-state",
    "publisher": "DoubleBear Productions",
    "release_date": "Dec  4 2014",
    "developers": [
      "DoubleBear Productions"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "General",
      "Role-Playing",
      "General"
    ],
    "meta_score": 70,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/1/d440dec5a5d1283bf3e6acb9c8044df9-98.jpg",
    "descriptions": "Dead State is a high-tension survival RPG set at the beginning of the zombie apocalypse. As society begins to fall apart, the player must organize a scant handful of allies, working on fortifying a shelter, scouting for food and supplies, making uncertain alliances with others, andDead State is a high-tension survival RPG set at the beginning of the zombie apocalypse. As society begins to fall apart, the player must organize a scant handful of allies, working on fortifying a shelter, scouting for food and supplies, making uncertain alliances with others, and attempting to hold together a group as humanity teeters on the brink of extinction. A full-fledged RPG featuring shelter building and management, turn-based tactical combat, and reactive story and dialogue with an emphasis on survival at any cost. Attract new allies, scavenge food and supplies, and protect your shelter at any cost. Do you have what it takes to lead a desperate group through a crisis? This is your chance to find out. … Expand"
  },
  {
    "name": "Harvest Moon: Another Wonderful Life",
    "details_link": "https://www.metacritic.com/game/gamecube/harvest-moon-another-wonderful-life",
    "publisher": "Natsume",
    "release_date": "Jul 26 2005",
    "developers": [
      "Marvelous"
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 70,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/4/1adcf1653ee913b36524a6279d696e94-98.jpg",
    "descriptions": "Live the simple life in quaint Forget-Me-Not Valley in Harvest Moon: Another Wonderful Life. This game is similar to the original Harvest Moon: A Wonderful Life, but now you can play as a girl who has left the city to pursue a life on the farm. You'll take part in growing crops, managingLive the simple life in quaint Forget-Me-Not Valley in Harvest Moon: Another Wonderful Life. This game is similar to the original Harvest Moon: A Wonderful Life, but now you can play as a girl who has left the city to pursue a life on the farm. You'll take part in growing crops, managing livestock, finding a husband, and raising children. The game contains six chapters that span your life and reflect the decisions that you have made along the way. … Expand"
  },
  {
    "name": "ARK: Survival Evolved",
    "details_link": "https://www.metacritic.com/game/pc/ark-survival-evolved",
    "publisher": "Studio Wildcard",
    "release_date": "Aug 29 2017",
    "developers": [
      "Studio Wildcard"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Stadia",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Action Adventure",
      "Survival",
      "Sandbox"
    ],
    "meta_score": 70,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/2/053069c29004d5e2163af18d2784a1e3-98.jpg",
    "descriptions": "Stranded on the shores of a mysterious island, you must learn to survive. Use your cunning to kill or tame the primeval creatures roaming the land, and encounter other players to survive, dominate... and escape."
  },
  {
    "name": "Super Swing Golf Season 2",
    "details_link": "https://www.metacritic.com/game/wii/super-swing-golf-season-2",
    "publisher": "Tecmo",
    "release_date": "Dec 11 2007",
    "developers": [
      "Tecmo",
      "Ntreev Soft"
    ],
    "platforms": "Wii",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Golf",
      "Arcade",
      "Arcade"
    ],
    "meta_score": 70,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/2/7e81e73491eb730cef42e4c2dcb5cd97-98.jpg",
    "descriptions": "Swing into action with your favorite characters as they return to the island to challenge new courses with all new story and tournament modes. New multiplayer modes have been introduced to keep the party going with friends and family. With completely new customizations, costumes, andSwing into action with your favorite characters as they return to the island to challenge new courses with all new story and tournament modes. New multiplayer modes have been introduced to keep the party going with friends and family. With completely new customizations, costumes, and secrets, Super Swing Golf Season 2 is a true hole-in-one. [Tecmo]… Expand"
  },
  {
    "name": "Aspire: Ina's Tale",
    "details_link": "https://www.metacritic.com/game/switch/aspire-inas-tale",
    "publisher": "Untold Tales",
    "release_date": "Dec 17 2021",
    "developers": [
      "Wondernaut Studio"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 70,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/7/23c1ae4a86a0816c5878489c3bba1793-98.jpg",
    "descriptions": "A journey of self-discovery set across the grand landscapes of a living tower.\r Ina was trapped, placed in perpetual slumber inside the Tower – where she dreamed. Suddenly and unknowingly, she is woken. Ina must now explore the Tower’s inner chambers in search of a way out and a reason forA journey of self-discovery set across the grand landscapes of a living tower.\r Ina was trapped, placed in perpetual slumber inside the Tower – where she dreamed. Suddenly and unknowingly, she is woken. Ina must now explore the Tower’s inner chambers in search of a way out and a reason for her imprisonment.\r Along the way, she’ll traverse marvelous scenery, meet enigmatic characters, solve intuitive puzzles, and conquer platforming sequences as she comes closer to her goal - but farther from innocence.\r For this isn't a story about how Ina was saved. This is the story about how she discovered she could be so much more.\r Explore a Living Tower\rGet lost in a mystical side-scrolling adventure through beautiful sprawling levels, each with their own distinct feel. Every region presents its own peculiarities to unravel.\r Engaging Story\rIna's dreams shape reality while the Tower feeds. Hopes and imagination satiate its hunger. How are the two connected?\r Meet the Tower Dwellers\rLearn about the other denizens of the Tower as you search for the truth. Uncover their pasts, their memories, and set them free.… Expand"
  },
  {
    "name": "Sparklite",
    "details_link": "https://www.metacritic.com/game/pc/sparklite",
    "publisher": "Merge Games",
    "release_date": "Nov 14 2019",
    "developers": [
      "Red Blue Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 70,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/5/dd71f01d61b8f9f630fbabd64449bc5c-98.jpg",
    "descriptions": "Sparklite is an action-adventure set in the whimsical and ever-changing land of Geodia. Battle foes in top-down action using an arsenal of gadgets, guns, and gear. Explore dangerous corners of the procedurally generated world, take down titans of the mining industry, and harness the power ofSparklite is an action-adventure set in the whimsical and ever-changing land of Geodia. Battle foes in top-down action using an arsenal of gadgets, guns, and gear. Explore dangerous corners of the procedurally generated world, take down titans of the mining industry, and harness the power of Sparklite.… Expand"
  },
  {
    "name": "Harold",
    "details_link": "https://www.metacritic.com/game/pc/harold",
    "publisher": "Moon Spider Studio",
    "release_date": "Feb 12 2015",
    "developers": [
      "Moon Spider Studio"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Platformer",
      "2D",
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 70,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/3/97ebb2a0878f2c3ac08dac41a2ad96da-98.jpg",
    "descriptions": "Harold is a singleplayer sidescrolling platformer with an emphasis on the high quality, hand-drawn style of classic animated films. You play as Gabe, the guardian angel responsible for guiding Harold through the multiple paths of each map, constantly saving your human charge from imminentHarold is a singleplayer sidescrolling platformer with an emphasis on the high quality, hand-drawn style of classic animated films. You play as Gabe, the guardian angel responsible for guiding Harold through the multiple paths of each map, constantly saving your human charge from imminent death by manipulating obstacles in different environments. To edge out the other runners and prove your angelic abilities you'll need every ounce of cunning and foresight you can muster, because your greatest hindrance is the oafish clumsiness of Harold himself.… Expand"
  },
  {
    "name": "Crackdown 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/crackdown-2",
    "publisher": "Microsoft Game Studios",
    "release_date": "Jul  6 2010",
    "developers": [
      "Ruffian Games"
    ],
    "platforms": "Xbox 360",
    "num_players": "Up to 16 ",
    "genres": [
      "Action",
      "Shooter",
      "Sci-Fi",
      "Third-Person",
      "Sci-Fi",
      "Shooter",
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 70,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/2/419d263a056156db112df0d9d0b147c6-98.jpg",
    "descriptions": "The sequel to the award-winning vertical-world adventure, Crackdown 2 is the ultimate open-ended world action experience. The game lets you be judge, jury, and executioner for a huge, fully explorable city. Crackdown 2 takes multiplayer gaming to new levels for the ultimate co-op andThe sequel to the award-winning vertical-world adventure, Crackdown 2 is the ultimate open-ended world action experience. The game lets you be judge, jury, and executioner for a huge, fully explorable city. Crackdown 2 takes multiplayer gaming to new levels for the ultimate co-op and competitive multiplayer experience, providing you and your friends with the complete freedom to explore, destroy, and play your way as you restore justice and peace to Pacific City—by any means necessary. [Microsoft]… Expand"
  },
  {
    "name": "Fractured Soul",
    "details_link": "https://www.metacritic.com/game/3ds/fractured-soul",
    "publisher": "Endgame Studios",
    "release_date": "Sep 13 2012",
    "developers": [
      "Endgame Studios"
    ],
    "platforms": [
      "PC",
      "3DS"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Scrolling",
      "Scrolling",
      "Shoot-'Em-Up",
      "Vertical"
    ],
    "meta_score": 70,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/2/2f976480c639c849373cb70d620c2955-98.jpg",
    "descriptions": "In Fractured Soul 3D, players take on the role of interplanetary rogue, Jake DeSaul a man with a checkered and mysterious past who must confront his demons in his desperate plight to escape an eerie and malevolent space station. As they progress through each level, the boundaries betweenIn Fractured Soul 3D, players take on the role of interplanetary rogue, Jake DeSaul a man with a checkered and mysterious past who must confront his demons in his desperate plight to escape an eerie and malevolent space station. As they progress through each level, the boundaries between dream and reality continue to blur as Jake faces a lifetime of regrets, hopes, dreams, and what might have been in his efforts to reconcile himself with his past.\r In order to help Jake, players must blast their way through 20 exciting and brain bending platform levels spread across five distinct worlds - each offering a unique challenge including inverted gravity, damage, wind, ice, and underwater. Additionally, there are four shoot 'em up levels that also make use of the screen switching. Each level is timed and ranked to encourage replayability.… Expand"
  },
  {
    "name": "The Sims 3: Pets",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-sims-3-pets",
    "publisher": "Electronic Arts",
    "release_date": "Oct 18 2011",
    "developers": [
      "The Sims Studio"
    ],
    "platforms": [
      "3DS",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Simulation",
      "Miscellaneous",
      "Virtual Life",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 70,
    "users_score": 3.4,
    "image": "https://static.metacritic.com/images/products/games/1/9a1f10488da4ae6388a67daf210a496d-98.jpg",
    "descriptions": "Players take creativity by the reins and play out the stories they want to tell whether it’s the single guy in the dog park picking up women or the criminal overlord and her evil cat. Across all platforms, The Sims 3 Pets players will be able to create, customize and control over a hundredPlayers take creativity by the reins and play out the stories they want to tell whether it’s the single guy in the dog park picking up women or the criminal overlord and her evil cat. Across all platforms, The Sims 3 Pets players will be able to create, customize and control over a hundred different kinds of cats and dogs like the Australian Shepherd and the Maine Coon, and can breed and share them with friends providing endless possibilities to create new and exciting breeds. Each platform brings a new world for players to explore from the Xbox 360 and PlayStation 3 versions where players will unlock achievements by solving mysteries around town, the Nintendo 3DS with new lots to unlock to the PC/Mac version where they’ll be able to take their pets on play dates or meet other Sims at the dog park, cat jungles and even a horse ranch. With The Sims 3 Pets, players will be able to create, control and play with life with their pets.… Expand"
  },
  {
    "name": "Clockwork Aquario",
    "details_link": "https://www.metacritic.com/game/switch/clockwork-aquario",
    "publisher": "Strictly Limited Games",
    "release_date": "Dec 14 2021",
    "developers": [
      "Westone Bit Entertainment"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch"
    ],
    "genres": [
      "Action",
      "Arcade"
    ],
    "meta_score": 70,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/4/f42d2e6424561394a4e836f9b0c55bde-98.jpg",
    "descriptions": "Clockwork Aquario was the last arcade game ever developed by the legendary Westone Bit Entertainment in 1992, but was never finished. The game was thought to be lost in time, but Strictly Limited Games set out on the mission to dig deep into video game archeology and save Clockwork AquarioClockwork Aquario was the last arcade game ever developed by the legendary Westone Bit Entertainment in 1992, but was never finished. The game was thought to be lost in time, but Strictly Limited Games set out on the mission to dig deep into video game archeology and save Clockwork Aquario from being lost in time. … Expand"
  },
  {
    "name": "Resident Evil 0",
    "details_link": "https://www.metacritic.com/game/switch/resident-evil-0",
    "publisher": "Capcom",
    "release_date": "May 21 2019",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 70,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/5b05722f5c50e7ec426d54ea528fac44-98.jpg",
    "descriptions": "The year is 1998 and reports have begun mounting about unusual murders on the outskirts of Raccoon City. The city's special forces division, S.T.A.R.S., sends Bravo Team to investigate. Among the six team members is rookie Rebecca Chambers.\r En route to the murder scene, their helicopterThe year is 1998 and reports have begun mounting about unusual murders on the outskirts of Raccoon City. The city's special forces division, S.T.A.R.S., sends Bravo Team to investigate. Among the six team members is rookie Rebecca Chambers.\r En route to the murder scene, their helicopter suddenly experiences engine trouble and is forced to make a crash landing in the forest.After the rough landing, the team finds an overturned prisoner transport vehicle with the brutally murdered bodies of military police scattered close by.\r A document found amongst the wreckage indicates they were transporting a prisoner who was wanted for murder: ex-lieutenant Billy Coen.Team leader Enrico tells everyone to split up to search the area. Rebecca searches the dark forest alone and eventually stumbles upon a train stopped on the tracks. She enters the train unaware of the nightmare that awaits her inside.… Expand"
  },
  {
    "name": "Age of Empires Online",
    "details_link": "https://www.metacritic.com/game/pc/age-of-empires-online",
    "publisher": "Microsoft Game Studios",
    "release_date": "Aug 16 2011",
    "developers": [
      "Gas Powered Games"
    ],
    "platforms": "PC",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "Historic",
      "Command"
    ],
    "meta_score": 70,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/1/33b5b377ff1845975d60566298b36249-98.jpg",
    "descriptions": "With more than 20 million copies sold worldwide, the “Age of Empires” series redefined real-time strategy games for Windows-based PC players. Now, the timeless franchise once again invites players to experience its rich storyline in new ways. “Age of Empires Online” will invite players toWith more than 20 million copies sold worldwide, the “Age of Empires” series redefined real-time strategy games for Windows-based PC players. Now, the timeless franchise once again invites players to experience its rich storyline in new ways. “Age of Empires Online” will invite players to create a living, growing online world, shared with friends and friendly rivals around the globe. Begin the journey with your own Greek civilisation, and watch as it progresses from a village to an empire. Embark on quests along the way, alone or with friends, and immerse yourself in epic tales, quirky characters, adventure, history and strategy. Together with the Games for Windows – LIVE service, “Age of Empires Online” delivers a rich, social experience that lets you play however you want — anywhere, anytime.… Expand"
  },
  {
    "name": "Gunpey DS",
    "details_link": "https://www.metacritic.com/game/ds/gunpey-ds",
    "publisher": "Namco Bandai Games",
    "release_date": "Nov 17 2006",
    "developers": [
      "Q Entertainment"
    ],
    "platforms": "DS",
    "num_players": "1-4 ",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "General",
      "Puzzle",
      "General"
    ],
    "meta_score": 70,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/9/b4f2ee207d80a25b745566673b8f5c33-98.jpg",
    "descriptions": "(Also known in Japan as \"Gunpey Reverse\")  With Q Entertainment's tradition for visual style and original music, Gunpey offers a unique puzzle experience. As lines of various angles climb up the screen, the player's objective is to flip the lines, located in squares, to connect them over(Also known in Japan as \"Gunpey Reverse\")  With Q Entertainment's tradition for visual style and original music, Gunpey offers a unique puzzle experience. As lines of various angles climb up the screen, the player's objective is to flip the lines, located in squares, to connect them over five columns.  Connecting lines from left to right remove the connected row. If an incomplete line reaches the top of the screen, the game is over. Features 40 varied backgrounds and stylized music and two-player multiplayer over wireless ad-hoc connectivity. [Namco Bandai Games]… Expand"
  },
  {
    "name": "Life is Strange 2",
    "details_link": "https://www.metacritic.com/game/pc/life-is-strange-2",
    "publisher": "Square Enix",
    "release_date": "Sep 27 2018",
    "developers": [
      "DONTNOD Entertainment"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Adventure",
      "General",
      "3D",
      "Third-Person"
    ],
    "meta_score": 70,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/7/faf0916f46acd9b6390c39f07b88fe2a-98.jpg",
    "descriptions": "The long awaited sequel to the award winning Life is Strange returns with a new 5-part narrative adventure from DONTNOD Entertainment."
  },
  {
    "name": "Still Life",
    "details_link": "https://www.metacritic.com/game/xbox/still-life",
    "publisher": "The Adventure Company",
    "release_date": "Jun  6 2005",
    "developers": [
      "Microids"
    ],
    "platforms": [
      "PC",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Adventure",
      "Third-Person",
      "Modern"
    ],
    "meta_score": 70,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/2/9710661dc7c69446d416cad8c0adf2a9-98.jpg",
    "descriptions": "In Still Life, you play the role of Victoria McPherson, a young FBI agent who's investigating a serial murder case. Set in modern Chicago and late-1920s Prague, the game lets you investigate the crime scenes of gruesome serial homicides. With the body count now at five, you must solveIn Still Life, you play the role of Victoria McPherson, a young FBI agent who's investigating a serial murder case. Set in modern Chicago and late-1920s Prague, the game lets you investigate the crime scenes of gruesome serial homicides. With the body count now at five, you must solve puzzles, interact with characters, and gather clues to stop the killer from striking again. You'll soon find that, oddly enough, Victoria's present case resembles the one from the past, right down to the killer's MO.… Expand"
  },
  {
    "name": "Layers of Fear 2",
    "details_link": "https://www.metacritic.com/game/pc/layers-of-fear-2",
    "publisher": "Gun Media",
    "release_date": "May 28 2019",
    "developers": [
      "Bloober Team"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 70,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/4/27db4020381fd3bdc64f745639bf7fc0-98.jpg",
    "descriptions": "Layers of Fear 2 is a first-person psychological horror game with an emphasis on exploration and story. Players control a Hollywood actor who heeds the call of an enigmatic director to take on the lead role in a film shot aboard an ocean liner. Beware, for all may not truly be what it seems."
  },
  {
    "name": "Crossing Souls",
    "details_link": "https://www.metacritic.com/game/pc/crossing-souls",
    "publisher": "Devolver Digital",
    "release_date": "Feb 13 2018",
    "developers": [
      "Fourattic"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 70,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/7/e05ccc56254a0fe6adeeb817b0a21cb8-98.jpg",
    "descriptions": "It’s 1986 in California. A group of friends discover a mysterious pink stone that allows to travel between two realms. This gang will live the summer of their lives in an adventure that will get them involved in a government conspiracy. Control five kids with specials skills while fightingIt’s 1986 in California. A group of friends discover a mysterious pink stone that allows to travel between two realms. This gang will live the summer of their lives in an adventure that will get them involved in a government conspiracy. Control five kids with specials skills while fighting and solving puzzles.… Expand"
  },
  {
    "name": "Last Stop (2021)",
    "details_link": "https://www.metacritic.com/game/pc/last-stop-2021",
    "publisher": "Annapurna Interactive",
    "release_date": "Jul 22 2021",
    "developers": [
      "Variable State"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "Third-Person"
    ],
    "meta_score": 70,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/2/78ba8117484f0d9f784059a487c29b32-98.jpg",
    "descriptions": "Last Stop is a single-player third-person narrative adventure game set in present day London, where you play as three separate characters whose worlds collide in the midst of a supernatural crisis. An anthology drama, Last Stop is three stories in one. What connects these three strangers?Last Stop is a single-player third-person narrative adventure game set in present day London, where you play as three separate characters whose worlds collide in the midst of a supernatural crisis. An anthology drama, Last Stop is three stories in one. What connects these three strangers? Where will fate lead them?… Expand"
  },
  {
    "name": "Silent Hill: Homecoming",
    "details_link": "https://www.metacritic.com/game/xbox-360/silent-hill-homecoming",
    "publisher": "Konami",
    "release_date": "Sep 30 2008",
    "developers": [
      "Double Helix Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Survival"
    ],
    "meta_score": 70,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/4/e2ae858daec85c8c94396015cb09f3a6-98.jpg",
    "descriptions": "The game thrusts players into a shadowy world of chaos and terror with atmospheric graphics and an original storyline that sheds new light on the desolate, fog-shrouded town of Silent Hill. Silent Hill: Homecoming follows Alex Shepherd, a war veteran returning home from an overseas tour ofThe game thrusts players into a shadowy world of chaos and terror with atmospheric graphics and an original storyline that sheds new light on the desolate, fog-shrouded town of Silent Hill. Silent Hill: Homecoming follows Alex Shepherd, a war veteran returning home from an overseas tour of duty to investigate the mysterious disappearance of his younger brother, Joshua. His travels lead him through the small, insular community of Shepherd's Glen and eventually through the hauntingly empty streets of Silent Hill. Building upon the series' trademark foundations of atmosphere, adventure and storytelling, Silent Hill: Homecoming introduces players to a frightening new experience. When confronted by the perverse incarnations of evil that roam Silent Hill and Shepherd's Glen, players are able to utilize an enhanced combat system and execute a number of offensive and defensive maneuvers as they experience every terrifying encounter with the game’s numerous nightmarish creatures. Players also have to solve a variety of puzzles as they progress through the highly atmospheric game world, using cues from the environment to unlock Silent Hill's darkest secrets. Continuing the series’ tradition of standout music and sound design, Silent Hill: Homecoming features an original soundtrack by famed composer Akira Yamaoka. [Konami]… Expand"
  },
  {
    "name": "Yurukill: The Calumniation Games",
    "details_link": "https://www.metacritic.com/game/playstation-5/yurukill-the-calumniation-games",
    "publisher": "NIS America",
    "release_date": "Jul  5 2022",
    "developers": [
      "G.Rev"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shoot-'Em-Up",
      "Vertical"
    ],
    "meta_score": 70,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/7/949907699ccb71c7b5139ca8a967867b-98.jpg",
    "descriptions": "Renowned author Homura Kawamoto delivers a twisted, multifaceted story in Yurukill. Accused of arson and the murders of 21 people, protagonist Sengoku Shunju is forced to fight for his freedom and prove his innocence. As one of six Prisoners, he must pair up with one of five victims,Renowned author Homura Kawamoto delivers a twisted, multifaceted story in Yurukill. Accused of arson and the murders of 21 people, protagonist Sengoku Shunju is forced to fight for his freedom and prove his innocence. As one of six Prisoners, he must pair up with one of five victims, referred to as Executioners, within the confines of the strange and secluded amusement park known as Yurukill Land. Together each of the five teams—Mass Murderers, Death Dealing Duo, Crafty Killers, Sly Stalkers, and Peeping Toms—must face and overcome the entertainment venue's so-called \"attractions\" in order to attain what they desire. Should the Prisoners succeed, their crimes shall be pardoned. But if the Executioners win, they will be granted revenge for their loved ones. The in-depth story offers unique gameplay experiences including collating evidence, gathering testimonies, and solving puzzles.Yurukill’s shoot-‘em-up gameplay developed by veteran developer G.rev features action packed and fast-paced combat. In addition, online leaderboards give players the opportunity to see how they stack up against the competition.\r… Expand"
  },
  {
    "name": "Lost Ember",
    "details_link": "https://www.metacritic.com/game/playstation-4/lost-ember",
    "publisher": "Mooneye Studios",
    "release_date": "Nov 22 2019",
    "developers": [
      "Mooneye Studios"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 70,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/8/66a60172dfeddb97d403b6167bd2b371-98.jpg",
    "descriptions": "A  beautiful world holds the secrets of its past for you and your companion to uncover. Play any animal you meet to see the world from new perspectives and chase your destiny in the exploration adventure Lost Ember."
  },
  {
    "name": "Marvel's Guardians of the Galaxy - Episode 3: More Than A Feeling",
    "details_link": "https://www.metacritic.com/game/xbox-one/marvels-guardians-of-the-galaxy---episode-3-more-than-a-feeling",
    "publisher": "Telltale Games",
    "release_date": "Aug 22 2017",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "genres": [
      "Action",
      "Adventure",
      "General",
      "3D",
      "Third-Person"
    ],
    "meta_score": 70,
    "users_score": 6.1,
    "image": "https://static.metacritic.com/images/products/games/98w-game.jpg",
    "descriptions": "In the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-partIn the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-part episodic series puts you in the rocket-powered boots of Star-Lord in an original Guardians adventure.… Expand"
  },
  {
    "name": "MX vs. ATV Untamed",
    "details_link": "https://www.metacritic.com/game/wii/mx-vs-atv-untamed",
    "publisher": "THQ",
    "release_date": "Feb 18 2008",
    "developers": [
      "Rainbow Studios"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Rally / Offroad",
      "Rally / Offroad",
      "Automobile"
    ],
    "meta_score": 70,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/46f1ba7e8a74b132f2b2466290e39b8c-98.jpg",
    "descriptions": "MX vs ATV kicks it up a notch and shifts into high gear as the best selling offroad franchise returns. MX vs ATV’s legendary Rhythm Racing lets players pre-load into massive jumps and clutch through hairpin turns at full speed all while retaining the smooth and authentic feel not found inMX vs ATV kicks it up a notch and shifts into high gear as the best selling offroad franchise returns. MX vs ATV’s legendary Rhythm Racing lets players pre-load into massive jumps and clutch through hairpin turns at full speed all while retaining the smooth and authentic feel not found in any other game. Attempt to own the offroad by dominating the innovative new \"X-Cross Tournament \". X-Cross brings together 6 unique racing series like Opencross, Supercross, Rally and Supermoto and then crosses them into one ultimate offroad championship. Brand new styles of racing are born as powerful vehicles tear through treacherous trails in the new Opencross mode, while then shifting gears to navigate asphalt and dirt in Supermoto. Players can take control of the Monster and Trophy Trucks as they blitz through rough rivers, rip though swampy everglades, and blaze through the desert dunes. Customize your ride with new sponsorship logos on your vehicle. Be the last vehicle standing as 6 players compete online. [THQ]… Expand"
  },
  {
    "name": "Tom Clancy's Ghost Recon: Jungle Storm",
    "details_link": "https://www.metacritic.com/game/playstation-2/tom-clancys-ghost-recon-jungle-storm",
    "publisher": "Ubisoft",
    "release_date": "Mar 16 2004",
    "developers": [
      "Red Storm Entertainment"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical",
      "Modern"
    ],
    "meta_score": 70,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/0/f69db8566ee17cc696f057b2201aae4b-98.jpg",
    "descriptions": "Developed with PlayStation 2 players in mind, Tom Clancy?s Ghost Recon: Jungle Storm will fully exploit the capabilities of the platform with features such as the wildly popular voice command, and voice chat systems plus online statistics tracking and ladder ranking. Most importantly, thisDeveloped with PlayStation 2 players in mind, Tom Clancy?s Ghost Recon: Jungle Storm will fully exploit the capabilities of the platform with features such as the wildly popular voice command, and voice chat systems plus online statistics tracking and ladder ranking. Most importantly, this game will mark the first time that PlayStation 2 fans can take their great ghost action online and learn firsthand why action-packed online game play quickly established Tom Clancy?s Ghost Recon as the most popularly played game on the Xbox LIVE online game service. Deep in the sweltering jungles of Cuba, an insidious revolution is brewing. Led by a drug-funded warlord, its aim is to take advantage of the post-Castro power vacuum and seize control of the island republic. Bogotá, a few months later... While the Cubans revel in their newfound democracy, the Colombian drug cartel that financed the failed revolution has set its sites on a new target. Readying a retaliatory blow against its own American-allied government, the Columbian cartel rocks the capital with severe explosions, including one that severely damages the American embassy. [Ubisoft]… Expand"
  },
  {
    "name": "Nosferatu: The Wrath of Malachi",
    "details_link": "https://www.metacritic.com/game/pc/nosferatu-the-wrath-of-malachi",
    "publisher": "iGames",
    "release_date": "Oct 19 2003",
    "developers": [
      "Idol FX"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Fantasy",
      "Fantasy",
      "Arcade"
    ],
    "meta_score": 70,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/5/b572a1f6dcb01bbbb65e3d546bd80577-98.jpg",
    "descriptions": "Delivering a blend of atmospheric survival horror and intense first person shooter action, Nosferatu: The Wrath of Malachi immerses players in the terror of an ancient, gothic castle full of vampires. With the monstrous undead lurking around every corner, players must search through theDelivering a blend of atmospheric survival horror and intense first person shooter action, Nosferatu: The Wrath of Malachi immerses players in the terror of an ancient, gothic castle full of vampires. With the monstrous undead lurking around every corner, players must search through the shadowy halls and dank dungeons of a massive castle to free their imprisoned friends and family...failure to rescue the prisoners will not only result in their death, but in the resurrection of an ancient supernatural being who will threaten all of mankind. [iGames]… Expand"
  },
  {
    "name": ".hack//Outbreak Part 3",
    "details_link": "https://www.metacritic.com/game/playstation-2/hackoutbreak-part-3",
    "publisher": "Bandai",
    "release_date": "Sep  9 2003",
    "developers": [
      "CyberConnect2"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 70,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/3ebbc0134c199d4249d9c73cd1f92189-98.jpg",
    "descriptions": "In the 3rd chapter of the .hack saga, \"The World\" continues to deteriorate as the virus spreads out of control. As the outlaw player, Kite, you must choose your strategy wisely. Not only is the OUTBREAK affecting \"The World\" in the game, but now repercussions are being felt in the real worldIn the 3rd chapter of the .hack saga, \"The World\" continues to deteriorate as the virus spreads out of control. As the outlaw player, Kite, you must choose your strategy wisely. Not only is the OUTBREAK affecting \"The World\" in the game, but now repercussions are being felt in the real world too. Is there a way to stop this outbreak? Where does the answer to the mystery lie? Fight through contaminated cyberspace as you take on and eliminate enemies, and unlock codes to gate hack to even more environments. Will you ever find out who or what is behind this nightmare and wake Orca from his coma? [Bandai]… Expand"
  },
  {
    "name": "Ultimate Muscle: The Kinnikuman Legacy - The Path of the Superhero",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/ultimate-muscle-the-kinnikuman-legacy---the-path-of-the-superhero",
    "publisher": "Bandai",
    "release_date": "Jun  5 2003",
    "developers": [
      "Bandai"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "Wrestling"
    ],
    "meta_score": 70,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/3/8b61ae3a6197abd9a2d6a25607845f09-98.jpg",
    "descriptions": "His unwilling arrival on Earth comes conspicuously close to the legendary Muscle League Champions' embarrassing beating at the hands of the d.M.p, a devious new breed of evil wrestling super villains. The Muscle League has recruited King Muscle's own son to reinvigorate their fallingHis unwilling arrival on Earth comes conspicuously close to the legendary Muscle League Champions' embarrassing beating at the hands of the d.M.p, a devious new breed of evil wrestling super villains. The Muscle League has recruited King Muscle's own son to reinvigorate their falling fortunes! And they've enlisted and trained a whole new generation of heroes to take on the diabolical d.M.p and save the planet!!… Expand"
  },
  {
    "name": "The Sims Online",
    "details_link": "https://www.metacritic.com/game/pc/the-sims-online",
    "publisher": "EA Games",
    "release_date": "Dec 18 2002",
    "developers": [
      "Maxis"
    ],
    "platforms": "PC",
    "genres": [
      "Role-Playing",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Modern",
      "Modern"
    ],
    "meta_score": 70,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/9/3cb3f404bc96d0697526d8c82b5125e3-98.jpg",
    "descriptions": "The Sims Online is a virtual world built from the imaginations of thousands of players like you -- an unpredictable, alternate reality where you are both spectator and participant. Build a network of friends to enhance your power, wealth, reputation and social standing. ExploreThe Sims Online is a virtual world built from the imaginations of thousands of players like you -- an unpredictable, alternate reality where you are both spectator and participant. Build a network of friends to enhance your power, wealth, reputation and social standing. Explore neighborhoods, create crazy locations, or host wild events to entertain others. In this massive and never-ending online event you become a Sim, choose your role and find your destiny. [Electronic Arts]… Expand"
  },
  {
    "name": "Silent Hill 2",
    "details_link": "https://www.metacritic.com/game/pc/silent-hill-2",
    "publisher": "Konami",
    "release_date": "TBA",
    "developers": [
      "Bloober Team"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 0,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/5/8fba72da316ec1e49c45e94f5ebdda26-98.jpg",
    "descriptions": "Having received a letter from his deceased wife, James heads to where they shared so many memories, in the hope of seeing her one more time: Silent Hill. There, by the lake, he finds a woman eerily similar to her...\"My name...is Maria,\" the woman smiles. Her face, her voice... She's justHaving received a letter from his deceased wife, James heads to where they shared so many memories, in the hope of seeing her one more time: Silent Hill. There, by the lake, he finds a woman eerily similar to her...\"My name...is Maria,\" the woman smiles. Her face, her voice... She's just like her.Experience a master-class in psychological survival horror - lauded as the best in the series - on the latest hardware with chilling visuals and visceral sounds.… Expand"
  },
  {
    "name": "Mario Party 4",
    "details_link": "https://www.metacritic.com/game/gamecube/mario-party-4",
    "publisher": "Nintendo",
    "release_date": "Oct 21 2002",
    "developers": [
      "Hudson"
    ],
    "platforms": "GameCube",
    "num_players": "1-4 ",
    "genres": [
      "Miscellaneous",
      "Party"
    ],
    "meta_score": 70,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/7/ac01c7de58aa22d13a4773c632c33b2d-98.jpg",
    "descriptions": "Toad, Koopa, and other party-planning pranksters have hidden birthday presents for their closest friends inside the Party Cube.  To win the presents, Mario, Yoshi, Peach, and other Mushroom Kingdom favorites will have to plunge into a circus of minigame trickery.  As always, keep an eye outToad, Koopa, and other party-planning pranksters have hidden birthday presents for their closest friends inside the Party Cube.  To win the presents, Mario, Yoshi, Peach, and other Mushroom Kingdom favorites will have to plunge into a circus of minigame trickery.  As always, keep an eye out for Bowser and his trouble-making goons.  Even Whomp and Thwomp have rockin' surprises for you in their Extra Room.  Packed with surprises, wild multiplayer action, and zany challenges, Mario Party 4 is your ticket to a good time.  … Expand"
  },
  {
    "name": "Dynasty Warriors 3",
    "details_link": "https://www.metacritic.com/game/xbox/dynasty-warriors-3",
    "publisher": "Koei",
    "release_date": "Sep 24 2002",
    "developers": [
      "Omega Force"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 70,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/3f68623d341acbf929a0f6c9b1b58f4b-98.jpg",
    "descriptions": "The third installment of Dynasty Warriors tests your warrior spirit through vast lands and impossible odds.  Dynasty Warriors 3 features battlefield action with over 20 stages and 40 playable warriors.  Storm the battlefield with more bone-crushing moves, improved Musou attacks, and squadThe third installment of Dynasty Warriors tests your warrior spirit through vast lands and impossible odds.  Dynasty Warriors 3 features battlefield action with over 20 stages and 40 playable warriors.  Storm the battlefield with more bone-crushing moves, improved Musou attacks, and squad level commands to your massive elephant troops.  In addition to Endurance and Time Attack, Dynasty Warriors 3 also includes brand new two-player Versus and Cooperative modes.  Can you become a warrior worth a thousand?… Expand"
  },
  {
    "name": "Quantum Redshift",
    "details_link": "https://www.metacritic.com/game/xbox/quantum-redshift",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep 16 2002",
    "developers": [
      "Curly Monsters"
    ],
    "platforms": "Xbox",
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Racing",
      "Futuristic"
    ],
    "meta_score": 70,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/8/d59796b7e5ec24c0e225e5374fdd183d-98.jpg",
    "descriptions": "Shift to the future and compete in racing grudge matches against your archrival and multiple racing opponents. Each of the 16 drivers has their own unique ship, home circuit, and weapons. It takes skill and weapons strategy to master the game's 16 tracks filled with massive jumps and roughShift to the future and compete in racing grudge matches against your archrival and multiple racing opponents. Each of the 16 drivers has their own unique ship, home circuit, and weapons. It takes skill and weapons strategy to master the game's 16 tracks filled with massive jumps and rough terrain. As you acquire more racing trophies, you'll earn higher speeds, special characters, and tracks. Ensure your victory by attacking characters with everything from plasma bolts or tidal waves to nuclear weapons.… Expand"
  },
  {
    "name": "Wizardry: Tale of the Forsaken Land",
    "details_link": "https://www.metacritic.com/game/playstation-2/wizardry-tale-of-the-forsaken-land",
    "publisher": "Atlus Co.",
    "release_date": "Dec 19 2001",
    "developers": [
      "Racjin"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "PC-style RPG"
    ],
    "meta_score": 70,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/9/ac72d1e24c611e6e54c96742f9819edc-98.jpg",
    "descriptions": "Our story takes place in the peaceful kingdom of Duhan, until one day a sphere of light from the heavens shatters the evening sky... Thousands are killed and the kingdom is in ruins... Demonic creatures from the underworld have emerged and the Queen of Duhan has disappeared into theOur story takes place in the peaceful kingdom of Duhan, until one day a sphere of light from the heavens shatters the evening sky... Thousands are killed and the kingdom is in ruins... Demonic creatures from the underworld have emerged and the Queen of Duhan has disappeared into the labyrinths beneath the castle.  The labyrinths are said to hold the greatest treasures in the land, but will you survive long enough to enjoy them...[Atlus]… Expand"
  },
  {
    "name": "NBA Live 2002",
    "details_link": "https://www.metacritic.com/game/playstation-2/nba-live-2002",
    "publisher": "Electronic Arts",
    "release_date": "Oct 29 2001",
    "developers": [
      "Electronic Arts"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Sim"
    ],
    "meta_score": 70,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/3/688c49b8589dce9e300f7134e13f9159-98.jpg",
    "descriptions": "Low-post controls let you move, shoot and dunk with more versatility than ever before. Franchise mode allows you to build the next great NBA dynasty over several seasons. New cut scenes focus on player-to-player and player-to-referee interaction. Legendary players bring their skills toLow-post controls let you move, shoot and dunk with more versatility than ever before. Franchise mode allows you to build the next great NBA dynasty over several seasons. New cut scenes focus on player-to-player and player-to-referee interaction. Legendary players bring their skills to today's NBA for some classic matchups.  [EA Sports]… Expand"
  },
  {
    "name": "Giga Wing 2",
    "details_link": "https://www.metacritic.com/game/dreamcast/giga-wing-2",
    "publisher": "Capcom",
    "release_date": "May 16 2001",
    "developers": [
      "Takumi Corporation"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Action",
      "Shooter",
      "Scrolling"
    ],
    "meta_score": 70,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/60e54b6d66dc7ee363d6051c079e815d-98.jpg",
    "descriptions": "The heavens explode into inter-galactic chaos in this classic arcade shooter for the Sega Dreamcast. The rebellion's savage forces have returned in an all-out campaign for universal domination. Only you can defeat them! Pick your aircraft and prepare for hi-tech dogfights, relentless enemyThe heavens explode into inter-galactic chaos in this classic arcade shooter for the Sega Dreamcast. The rebellion's savage forces have returned in an all-out campaign for universal domination. Only you can defeat them! Pick your aircraft and prepare for hi-tech dogfights, relentless enemy fire, fantastic power-ups and devastating weapons like the Reflect Laser and Reflect Force. Use the Score Multiplier to rack up astronomical high scores. Team up with three of your friends for an all-out, 4-player simultaneous space battle to deliver the universe from the dark forces.… Expand"
  },
  {
    "name": "Battle Isle: The Andosia War",
    "details_link": "https://www.metacritic.com/game/pc/battle-isle-the-andosia-war",
    "publisher": "Blue Byte",
    "release_date": "Nov 29 2000",
    "developers": [
      "Cauldron Ltd."
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Sci-Fi",
      "Sci-Fi",
      "General",
      "Tactics"
    ],
    "meta_score": 70,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/4/5fae1ea1e1ca684636d6df05d5d560e6-98.jpg",
    "descriptions": "On the border between exciting real-time maneuvers and the demands of strategic planning, a new exciting kind of game experience emerges where there is a time for cool planning, quick reactions, discovery of stunning landscapes, and time for pursuing mission goals!  [Blue Byte]"
  },
  {
    "name": "Virtua Tennis 4",
    "details_link": "https://www.metacritic.com/game/xbox-360/virtua-tennis-4",
    "publisher": "Sega",
    "release_date": "May 10 2011",
    "developers": [
      "Sega"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Tennis",
      "Tennis"
    ],
    "meta_score": 70,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/7/2e9ba98b07e387cead12f11e02497aca-98.jpg",
    "descriptions": "Virtua Tennis 4 with the PlayStation Move is more than just hitting the ball; it's about the angle of the racquet, the spin and speed of the ball and the power of the shot.  The advanced motion sensors of PlayStation Move precisely track both the fast and subtle movements of the controllerVirtua Tennis 4 with the PlayStation Move is more than just hitting the ball; it's about the angle of the racquet, the spin and speed of the ball and the power of the shot.  The advanced motion sensors of PlayStation Move precisely track both the fast and subtle movements of the controller allowing for pinpoint accurate shots as players improve their racquet skills.  Virtua Tennis 4 will also support 3D technology delivering unprecedented realism to the tennis experience, bringing you closer than ever to being out on the court.… Expand"
  },
  {
    "name": "In Sound Mind",
    "details_link": "https://www.metacritic.com/game/playstation-5/in-sound-mind",
    "publisher": "Modus Games",
    "release_date": "Sep 28 2021",
    "developers": [
      "We Create Stuff"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Adventure",
      "3D",
      "Survival",
      "First-Person"
    ],
    "meta_score": 70,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/1/6375585b9689390eb37667e2cc1bd524-98.jpg",
    "descriptions": "From the creators of cult classic Nightmare House 2, comes an imaginative psychological horror experience that challenges your expectations and ushers you through the deepest corners of your mind. As you awake in the corridors of an inexplicable building, you find the environment takes on aFrom the creators of cult classic Nightmare House 2, comes an imaginative psychological horror experience that challenges your expectations and ushers you through the deepest corners of your mind. As you awake in the corridors of an inexplicable building, you find the environment takes on a life of its own and leads you to discover a series of victims, all exposed to the same experimental therapy. In your search for answers, bizarre visions emerge and introduce a host of imposing horrors. With your sanity in question, you have no choice but to rely on your instinct…and a cat named Tonia. In Sound Mind is a witty first-person psychological horror with frenetic puzzles, unique boss fights, and original music by The Living Tombstone. Explore and fight through a series of unsettling memories as you journey within the inner workings of the one place you can’t seem to escape—your own mind.… Expand"
  },
  {
    "name": "Slipstream",
    "details_link": "https://www.metacritic.com/game/switch/slipstream",
    "publisher": "BlitWorks",
    "release_date": "Apr  7 2022",
    "developers": [
      "ansdor"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Switch"
    ],
    "genres": [
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 70,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/0/86042563bb846267c77c92aed373b63f-98.jpg",
    "descriptions": "It's 199X, you're in the driver seat. As you turn the key and hear the engine starting, a cassette plays on the stereo. The clear blue sky invites you to escape, to explore a world of exotic landscapes and thrilling races. Step on the gas, choose your path, drive across cities, mountains,It's 199X, you're in the driver seat. As you turn the key and hear the engine starting, a cassette plays on the stereo. The clear blue sky invites you to escape, to explore a world of exotic landscapes and thrilling races. Step on the gas, choose your path, drive across cities, mountains, deserts, forests, beaches — places from all over the world and beyond. Slipstream is a racing game influenced and inspired by the OutRun series, SEGA games in general, Initial D, Vaporwave & Synthwave aesthetics and the spirit of 90s arcades. It uses a real pseudo3D engine to provide an authentic retro experience in a modern shell. After being funded via kickstarter in 2016 and delayed more times than the developer would like to admit, it was released independently for PC in 2018.… Expand"
  },
  {
    "name": "H1Z1",
    "details_link": "https://www.metacritic.com/game/pc/h1z1",
    "publisher": "Daybreak Games",
    "release_date": "Feb 28 2018",
    "developers": [
      "Daybreak Games"
    ],
    "platforms": [
      "PlayStation 4",
      "PC"
    ],
    "num_players": "Up to more than 64 ",
    "genres": [
      "Third-Person",
      "Arcade",
      "Action",
      "Action Adventure",
      "Shooter",
      "Survival",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 70,
    "users_score": 4.0,
    "image": "https://static.metacritic.com/images/products/games/4/dc07770252fb2ca3b0596a30cc91ee87-98.jpg",
    "descriptions": "Play the Battle Royale game that started it all. Now includes AUTO ROYALE. Drive into battle as part of a team-based vehicle of mayhem. Fight for power-ups to equip your squad and upgrade your ride."
  },
  {
    "name": "Lead and Gold: Gangs of the Wild West",
    "details_link": "https://www.metacritic.com/game/pc/lead-and-gold-gangs-of-the-wild-west",
    "publisher": "Paradox Interactive",
    "release_date": "Apr  8 2010",
    "developers": [
      "Fatshark AB",
      "Fatshark"
    ],
    "platforms": [
      "PlayStation 3",
      "PC"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Modern",
      "Historic",
      "Historic",
      "Arcade"
    ],
    "meta_score": 70,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/cb0e93877997c1c09b3f70e3aad05e82-98.jpg",
    "descriptions": "Lead and Gold: Gangs of the Wild West is a third person shooter delivering an intense team based multiplayer experience. Relive the violent era of the Wild West as it ought to be with adrenaline fueled action and fast paced gunfights. Fight gritty battles in beautifully rendered classicLead and Gold: Gangs of the Wild West is a third person shooter delivering an intense team based multiplayer experience. Relive the violent era of the Wild West as it ought to be with adrenaline fueled action and fast paced gunfights. Fight gritty battles in beautifully rendered classic western settings. Test your mettle in genre specific game modes and levels tailor-made for satisfying team play. Lead and Gold features the unique Synergy system, a power up system encouraging co-operation and team tactics. The Synergy system permeates the frantic shooter gameplay and rewards the player for objective oriented gameplay. [Paradox Interactive]… Expand"
  },
  {
    "name": "oOo: Ascension",
    "details_link": "https://www.metacritic.com/game/xbox-one/ooo-ascension",
    "publisher": "Extra Mile Studios",
    "release_date": "May 25 2018",
    "developers": [
      "Kenny Creanor"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "Arcade"
    ],
    "meta_score": 70,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/6/0a5675c17700adfe215e297a0296486f-98.jpg",
    "descriptions": "oOo: Ascension is a lightning-paced test of reflexes and skill - can you navigate your ship through these short but ferociously challenging courses? Every millisecond counts in this retro-futuristic world of miniature planets and massive frustration. [Microsoft]"
  },
  {
    "name": "ACA NeoGeo: Shock Troopers",
    "details_link": "https://www.metacritic.com/game/switch/aca-neogeo-shock-troopers",
    "publisher": "Hamster",
    "release_date": "Mar  9 2017",
    "developers": [
      "Saurus"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shoot-'Em-Up",
      "Top-Down"
    ],
    "meta_score": 70,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/7/0cac1dba808bcd488d0de5e94e3dc814-98.jpg",
    "descriptions": "A run-and-gun shooting game featuring 8 mercenaries who face a huge terrorist organization, enlist for action on NEOGEO Station! You can choose between 2 fighting styles: Control one character in \"LONELY WOLF\" mode, or pick up a team of 3 soldiers you can switch between at any timeA run-and-gun shooting game featuring 8 mercenaries who face a huge terrorist organization, enlist for action on NEOGEO Station! You can choose between 2 fighting styles: Control one character in \"LONELY WOLF\" mode, or pick up a team of 3 soldiers you can switch between at any time in \"TEAM BATTLE\" mode. Run through the battlefield and choose the best routes and strategy!… Expand"
  },
  {
    "name": "Nom Nom Galaxy",
    "details_link": "https://www.metacritic.com/game/playstation-4/nom-nom-galaxy",
    "publisher": "Double Eleven",
    "release_date": "May 12 2015",
    "developers": [
      "Q-Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 70,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/0/9f22dd221881fac25273f0c45775baed-98.jpg",
    "descriptions": "Nom Nom Galaxy melds many themes of gameplay, with equal elements of classic platforming, mining, construction, resource management, and tower defence."
  },
  {
    "name": "Sanctum (2011)",
    "details_link": "https://www.metacritic.com/game/pc/sanctum-2011",
    "publisher": "Coffee Stain Studios",
    "release_date": "Apr 15 2011",
    "developers": [
      "Coffee Stain Studios"
    ],
    "platforms": "PC",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 70,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/3/88eabecfad7baa0e13322aceb14664e4-98.jpg",
    "descriptions": "Sanctum is a First Person Shooter Tower Defense game where you take the role as Skye, an elite soldier sent out to protect her hometown, Elysion One from hordes of mysterious alien creatures."
  },
  {
    "name": "Company of Heroes: Tales of Valor",
    "details_link": "https://www.metacritic.com/game/pc/company-of-heroes-tales-of-valor",
    "publisher": "THQ",
    "release_date": "Apr  7 2009",
    "developers": [
      "Relic",
      "Relic Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Military",
      "General",
      "Military"
    ],
    "meta_score": 70,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/2/4bcc65d97a822391ec8f89e2f7b6d440-98.jpg",
    "descriptions": "Company of Heroes: Tales of Valor is the next standalone chapter in the Company of Heroes franchise, featuring all-new content, including three single-player campaigns, new multiplayer modes, additional maps and units. Company of Heroes: Tales of Valor also introduces a new “direct-fire”Company of Heroes: Tales of Valor is the next standalone chapter in the Company of Heroes franchise, featuring all-new content, including three single-player campaigns, new multiplayer modes, additional maps and units. Company of Heroes: Tales of Valor also introduces a new “direct-fire” feature that allows players more tactical control of their units and more strategic options in-game. Developed by internal studio Relic Entertainment and powered by Relic’s proprietary Essence Engine, Company of Heroes: Tales of Valor is fully compatible with Company of Heroes and Company of Heroes: Opposing Fronts, allowing players who own the entire series complete access to the epic battles of World War. [THQ]… Expand"
  },
  {
    "name": "Romance of the Three Kingdoms XI",
    "details_link": "https://www.metacritic.com/game/pc/romance-of-the-three-kingdoms-xi",
    "publisher": "Koei",
    "release_date": "Sep  9 2008",
    "developers": [
      "Koei"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Real-Time",
      "Historic",
      "General",
      "Historic"
    ],
    "meta_score": 70,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/3/8cfbc27b342b44422615d9debbad9a68-98.jpg",
    "descriptions": "Set during the end of China's Han Dynasty and the 2nd and 3rd centuries A.D., RTK XI presents the most visually captivating evolution in the history of the series. Blurring the line between video games and art, RTK XI features visuals evocative of classical Chinese ink-paintings along withSet during the end of China's Han Dynasty and the 2nd and 3rd centuries A.D., RTK XI presents the most visually captivating evolution in the history of the series. Blurring the line between video games and art, RTK XI features visuals evocative of classical Chinese ink-paintings along with debates and duels rendered in real-time 3D animation. As the ruler of a kingdom, each player has complete control over their territories. More than 40 base commands give players the power to govern cities, manage their personnel, practice diplomacy and much more. Complete freedom to develop markets, shipyards, outposts, forts and military units expand on the already substantial benchmarks established by previous editions of the series. Furthermore, players watch the era come to life through the uniquely individual personalities of the more than 780 officers and supporting characters they encounter. Players need to dig deep within to prove themselves adept at both the military and political arts in order to bring China under one rule. Domestic affairs, diplomacy and warfare are all conducted on a single vast 3D relief map, dramatically bringing to life the eight massive scenarios that lie before them. For improved control over each military campaign, RTK XI's turn-based game play allows the player to plan their movements without undue time constraints, and then execute their battle tactics when ready. RTK XI also introduces an entirely new system for researching military techniques, as well as an Advanced Tactics System that allows players to drive or lure enemies into devastating ambushes. Skilled players link together tactics for maximum damage. [Koei]… Expand"
  },
  {
    "name": "The Urbz: Sims in the City",
    "details_link": "https://www.metacritic.com/game/playstation-2/the-urbz-sims-in-the-city",
    "publisher": "EA Games",
    "release_date": "Nov  9 2004",
    "developers": [
      "Maxis"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Virtual Life"
    ],
    "meta_score": 70,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/1/9315d29ff1b81265a6b551b77f593428-98.jpg",
    "descriptions": "For the first time, Sims are living in the city where reputation (rep) is everything. Players will custom-create these new Sims, called Urbz, by customizing their unique style and building their status to become the biggest \"player\" in the city. Players will take their Urbz to work and beFor the first time, Sims are living in the city where reputation (rep) is everything. Players will custom-create these new Sims, called Urbz, by customizing their unique style and building their status to become the biggest \"player\" in the city. Players will take their Urbz to work and be challenged by bosses at locations like the Sushi Bar, Chop Shop, or Bootleg Fireworks, Inc. Success brings the player well-earned promotions and gets them access to power socials to help them influence other Urbz. The fast-paced lifestyles in The URBZ is evident in gameplay including job challenges based on a direct-control mechanic for job objects, skill-building objects, and power social interactions. The URBZ is built on an all-new graphics engine that recreates the essence of living in a vibrant city with distinct districts inhabited by Urbz with unique lifestyles. The game's style captures the pulse of the action-packed downtown, ritzy shopping districts, Bohemian artist workshops, and a gritty subway station. Players create their Urbz using a new character customization engine to show off attitude and unique style, as well as signature \"bling\" such as tattoos and nose rings. Players build relationships to increase their rep, influence other Urbz, and gain access to city districts, jobs, and lifestyles. Gaining access to all districts in the city, being able to live in any district, live any lifestyle, and become the biggest \"player\" in the city is the ultimate goal. The URBZ will support the Sony EyeToy. Players will download their image into the game with the Sony EyeToy and as their rep grows; their image or their Urbz image will begin to be reflected in the game.[Electronic Arts]… Expand"
  },
  {
    "name": "Luxor 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/luxor-2",
    "publisher": "MumboJumbo",
    "release_date": "Apr  4 2007",
    "developers": [
      "MumboJumbo"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "General",
      "Puzzle",
      "General"
    ],
    "meta_score": 70,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/1/2354527144e301fd913d9e396e339024-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Set, the Egyptian god of chaos, again threatens the Two Lands, and you must save Ancient Egypt from his terrible wrath in Luxor 2. Wielding the powers of Isis, battle your way across Egypt. Use your mystical winged scarab to shoot magical spheres and destroy encroaching[Xbox Live Arcade]  Set, the Egyptian god of chaos, again threatens the Two Lands, and you must save Ancient Egypt from his terrible wrath in Luxor 2. Wielding the powers of Isis, battle your way across Egypt. Use your mystical winged scarab to shoot magical spheres and destroy encroaching colored spheres by making matches of three or more. Stop them all before they can reach the pyramids. Unleash the powers of Isis by catching falling power-ups. Collect gems and jewelry for bonus points, or Golden Ankh coins to earn extra lives. Defeat Set in his temple stronghold or Egypt is doomed. Levels: Play through 88 explosive levels with 13 new bonus rounds. Difficulty: Choose from four levels of difficulty, including the mind-bending Challenge of Horus. Modes: Experience four awesome modes of play -  Adventure, Practice, Survival, and Pharaoh's Challenge. Power-ups: Collect 13 exciting power-ups including the new Lightning Storm and Pharaoh's Dagger. Rankings: The player ranking system has 100 levels from Farm Hand to Pharaoh of the Two Lands. [Microsoft]… Expand"
  },
  {
    "name": "Deadlight: Director's Cut",
    "details_link": "https://www.metacritic.com/game/playstation-4/deadlight-directors-cut",
    "publisher": "Deep Silver",
    "release_date": "Jun 21 2016",
    "developers": [
      "Tequila Works"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 70,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/8/2ec51dddd80aa2a42fb85133a1ddb62d-98.jpg",
    "descriptions": "Set in an apocalyptic 1986, you play Randall Wayne, a lone survivor searching for his loved ones in the ruins of Seattle. Through tense platforming and deadly encounters with the undead, known as ‘shadows’, you’ll either fight using scarce resources, or navigate the environment to run andSet in an apocalyptic 1986, you play Randall Wayne, a lone survivor searching for his loved ones in the ruins of Seattle. Through tense platforming and deadly encounters with the undead, known as ‘shadows’, you’ll either fight using scarce resources, or navigate the environment to run and hide from them.… Expand"
  },
  {
    "name": "Starship Troopers - Terran Command",
    "details_link": "https://www.metacritic.com/game/pc/starship-troopers---terran-command",
    "publisher": "Slitherine",
    "release_date": "Jun 16 2022",
    "developers": [
      "The Artistocrats"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "General",
      "Command"
    ],
    "meta_score": 70,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/5/aa1a40a9ba785214868672477324af2c-98.jpg",
    "descriptions": "Starship Troopers - Terran Command is a thrilling real-time strategy game set in the Starship Troopers movies universe. Take command of the Mobile Infantry and do your part in the war against the Arachnid threat. Build, develop and control your armies to strike an effective balance betweenStarship Troopers - Terran Command is a thrilling real-time strategy game set in the Starship Troopers movies universe. Take command of the Mobile Infantry and do your part in the war against the Arachnid threat. Build, develop and control your armies to strike an effective balance between tactical superiority and strength in numbers. Ensure that human civilization, not insect, dominates the galaxy now and always!Planetary CampaignsFight for control over an entire planet in the campaign mode, where the storyline and missions develop according to your choices and achievements on the battlefield. Remain obedient to the demands of Terran Command no matter how costly or ruthless to benefit from exclusive unit types and special abilities, or follow your own path to glory to become an irrefutable Hero of the Federation. Develop and customize your forces through a detailed technology tree and upgradeable leader characters that can be assigned to your units.Tactics & NumbersWhile the Arachnids can rely on virtually limitless numbers, the Mobile Infantry must develop effective tactics to overcome this imbalance. Deploy your units at strategic locations to cover vital choke points and gain superior firepower through tactical use of elevation levels. Be wary, however, that battle mechanics such as True Line of Sight and True Line of Fire also allow Bugs to lay ambushes around every corner, as they are well known for their use of surprise attacks and deception.Units & AbilitiesAn expansive range of unique units, weapons, and special abilities are at the disposal of MI commanders. Infantry squads armed with Morita Assault Rifles and MX-90 Fragmentation Grenades form the mainstay of your forces. Rocket Troopers deliver deadly payloads with pin-point accuracy while Engineers are vital to shore up defensive positions with MG turrets, barricades, and minefields. As a campaign progresses, technological breakthroughs unlock the true potential of the Federation's arsenal with Power Armor infantry squads, TAC Fighter airstrikes, Marauder mobile suits, and many more developments optimized for spraying Bug ichor across the battlefield.Key features- Dynamically generated campaigns for virtually limitless replayability.- Dozens of unique unit types, each with their own special abilities.- Terrain elevation, True Line of Sight & True Line of Fire provide deep tactical gameplay.- An extensive technology tree to develop and customize your forces.- Persistent leaders can be attached to units and upgraded throughout the campaign.- Heroics, explosions, gore, and Bugs. Lots of Bugs.… Expand"
  },
  {
    "name": "The Dark Pictures Anthology: The Devil in Me",
    "details_link": "https://www.metacritic.com/game/playstation-5/the-dark-pictures-anthology-the-devil-in-me",
    "publisher": "Bandai Namco Games",
    "release_date": "Nov 18 2022",
    "developers": [
      "Supermassive Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "Adventure",
      "3D",
      "Survival",
      "Third-Person"
    ],
    "meta_score": 70,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/6/537cb56ad1156617a806307039ca4d36-98.jpg",
    "descriptions": "From the creators of Until DawnSwitch between the perspective of 5 playable characters - All can live or die in your version of the story\n\nMultiple ways to play including 2 player online coop mode\n\nHugely branching storyline that changes based on the decisions you make\n\nEach game in TheFrom the creators of Until DawnSwitch between the perspective of 5 playable characters - All can live or die in your version of the storyMultiple ways to play including 2 player online coop modeHugely branching storyline that changes based on the decisions you makeEach game in The Dark Pictures Anthology is a complete and original story in its own right3 ways to play!Introducing multiplayer to The Dark Pictures Anthology! 1. Solo storyThe complete terrifying story as a single player experience2. Movie night modeYou and up to 4 friends will play the story together on the couch, each controlling a different characterAnd:3. Shared story2 player online co-operative mode. Play the whole story online with a friend, making choices that affect you both.… Expand"
  },
  {
    "name": "BurgerTime Party!",
    "details_link": "https://www.metacritic.com/game/switch/burgertime-party!",
    "publisher": "XSEED Games",
    "release_date": "Oct  8 2019",
    "developers": [
      "G-mode"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Arcade"
    ],
    "meta_score": 70,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/2/8d27c1a6a69b1eff65613bb66c51c270-98.jpg",
    "descriptions": "A Feast for the senses - chock-full of carefully crafted stages with new hazards such as icy ladders, conveyor belts, and fiery floors, along with colorful characters inspired by old-school cartoons"
  },
  {
    "name": "I Am Setsuna",
    "details_link": "https://www.metacritic.com/game/pc/i-am-setsuna",
    "publisher": "Square Enix",
    "release_date": "Jul 19 2016",
    "developers": [
      "Tokyo RPG Factory"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 70,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/5/8ab24936133521705829330de13b1e0b-98.jpg",
    "descriptions": "Inspired by Chrono Trigger, I am Setsuna is an homage to the JRPG masterpieces of yesteryear. Journey with Setsuna as she prepares to make the ultimate sacrifice and save the people of her land."
  },
  {
    "name": "Crash: Mind Over Mutant",
    "details_link": "https://www.metacritic.com/game/wii/crash-mind-over-mutant",
    "publisher": "Activision",
    "release_date": "Oct  7 2008",
    "developers": [
      "Radical Entertainment"
    ],
    "platforms": [
      "Xbox 360",
      "Wii"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "3D"
    ],
    "meta_score": 70,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/8/7f7bba71169684715d59ed02a0d440ce-98.jpg",
    "descriptions": "In Crash Bandicoot: Mind over Mutant, a rejuvenated Neo Cortex is taking over the world one brain at a time!  Cortex and N. Brio devise a new kind of evil - a text-messaging, do-anything device which controls both mutant and bandicoot minds. Armed with his quick-wits and lightening agility,In Crash Bandicoot: Mind over Mutant, a rejuvenated Neo Cortex is taking over the world one brain at a time!  Cortex and N. Brio devise a new kind of evil - a text-messaging, do-anything device which controls both mutant and bandicoot minds. Armed with his quick-wits and lightening agility, Crash must free his friends, the titans and save the day. Not only does Crash gain the ability to control his enemies when he jacks them – now he can store his favorite monsters in his pocket, upgrade them and utilize their powers when they are most advantageous. Wumpa Island  becomes a \"free-romping\" environment, allowing players to travel and explore through intersecting worlds, with different gameplay options available depending on what creature you've brought along for the ride. Your co-op partner is Crash's sister, Coco, playable for the first time in the cooperative mode. Not only does Coco make the game that much more inviting for girls to pick up and play, she also brings with her a new tactile \"treasure hunt\" ability. [Sierra Entertainment]… Expand"
  },
  {
    "name": "Fight Crab",
    "details_link": "https://www.metacritic.com/game/switch/fight-crab",
    "publisher": "Mastiff",
    "release_date": "Sep 15 2020",
    "developers": [
      "Calappa Games"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 70,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/4/ca7c4afa98e9d128fb13837b3d770295-98.jpg",
    "descriptions": "Claw through 7 Tutorial stages and a Campaign Mode with 34 stages spread out across 7 chapters\r- 23 types of playable crab, 48 different weapons, and 11 unique battle arenas\r- A variety of matchmaking options including 1 vs. 1, 2 vs. 2, and both offline and online co-op and versus battleClaw through 7 Tutorial stages and a Campaign Mode with 34 stages spread out across 7 chapters\r- 23 types of playable crab, 48 different weapons, and 11 unique battle arenas\r- A variety of matchmaking options including 1 vs. 1, 2 vs. 2, and both offline and online co-op and versus battle modes\r- Unlock special Skills like the fabled Kanihameha, the devastating Crab Copter, and more\r- Level up your crab, recruit new crabs, and purchase deadly new weapons – build the ultimate crab warrior\r- Use the Nintendo Switch Joy-Con™ motion controls to freely manipulate limbs to punch, grab, and flip your way to victory\r- Use Photo Mode to capture, share, and immortalize epic confrontations and intense battles… Expand"
  },
  {
    "name": "2010 FIFA World Cup South Africa",
    "details_link": "https://www.metacritic.com/game/wii/2010-fifa-world-cup-south-africa",
    "publisher": "EA Sports",
    "release_date": "Apr 27 2010",
    "developers": [
      "Electronic Arts"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 70,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/7/6213473733ba14bbed7304d8bf2aa475-98.jpg",
    "descriptions": "EA SPORTS 2010 FIFA World Cup South Africa features all the emotion and passion of the fiercest national rivalries battling on the world’s biggest stage, with all 199 national teams that took part in qualification, all 10 official stadiums to be used in South Africa and stadiums from eachEA SPORTS 2010 FIFA World Cup South Africa features all the emotion and passion of the fiercest national rivalries battling on the world’s biggest stage, with all 199 national teams that took part in qualification, all 10 official stadiums to be used in South Africa and stadiums from each qualifying region. Gamers can play as their home nation from qualification right through to a virtual reproduction of the FIFA World Cup Final and feel what it is like to score the goal that lifts a nation.  Everything fans love about the World Cup comes to life in spectacular  detail, including confetti rain, streamers, & fireworks - just like the official tournament. [Electronic Arts]… Expand"
  },
  {
    "name": "Scurge: Hive",
    "details_link": "https://www.metacritic.com/game/ds/scurge-hive",
    "publisher": "SouthPeak Games",
    "release_date": "Nov  1 2006",
    "developers": [
      "Orbital Media",
      "Inc."
    ],
    "platforms": "DS",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 70,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/4/34d3fb875a36bca2f3dc222af5c6bd60-98.jpg",
    "descriptions": "Scurge: Hive features its main character Jenosa Arma, a bounty hunter. 48 hours ago a distress signal was sent from a remote research lab studying a virulent organism identified as the \"Scurge\". Scientists have been studying its remarkable metamorphic and energy abilities. Jenosa Arma hasScurge: Hive features its main character Jenosa Arma, a bounty hunter. 48 hours ago a distress signal was sent from a remote research lab studying a virulent organism identified as the \"Scurge\". Scientists have been studying its remarkable metamorphic and energy abilities. Jenosa Arma has been commissioned by a black-ops cell from the government to investigate and salvage any research technology from within the facility. She is armed with top-secret projectile gauntlets and a prototype battle suit. Scurge: Hive is an intense fast-paced action-packed game from start to finish. [Orbital Media]… Expand"
  },
  {
    "name": "Nervous Brickdown",
    "details_link": "https://www.metacritic.com/game/ds/nervous-brickdown",
    "publisher": "Eidos Interactive",
    "release_date": "Jun 26 2007",
    "developers": [
      "Arkedo Studio"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "General",
      "Arcade"
    ],
    "meta_score": 70,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/1/015c82e0bd7e2b08349390e3f0da23d7-98.jpg",
    "descriptions": "Nervous Brickdown allows players to revisit old school roots with a twist to the classic breakout game.  Revamped, restyled and stepping into the next generation of handheld gaming, Nervous Brickdown refreshes the player's skills in paddle and ball gameplay while introducing new gameplayNervous Brickdown allows players to revisit old school roots with a twist to the classic breakout game.  Revamped, restyled and stepping into the next generation of handheld gaming, Nervous Brickdown refreshes the player's skills in paddle and ball gameplay while introducing new gameplay elements across 135 levels, like controlling spaceships to blast away bricks or even drawing a custom paddle. Featuring 135 diverse levels spanning over 10 unique modes, Nervous Brickdown turns classic brick-breaking gameplay on its head by taking players into other retro gaming worlds such as intense space shooters, action platforms, and scary haunted houses.  Do everything from controlling submarines or blowing the ball into bricks to taking on boss monsters. Designed especially for the Nintendo DS, Nervous Brickdown takes full advantage of the DS’ hardware utilizing the dual screen, stylus, and microphone to present an interesting visual style, charming soundtrack, and unique gameplay features which breathes new life into the brick-breaking genre. [Secret Stash Games]… Expand"
  },
  {
    "name": "Brigador",
    "details_link": "https://www.metacritic.com/game/pc/brigador",
    "publisher": "Stellar Jockeys",
    "release_date": "Jun  2 2016",
    "developers": [
      "Stellar Jockeys"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "Shooter",
      "Shoot-'Em-Up",
      "Top-Down"
    ],
    "meta_score": 70,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/f70c3a783e39cf0d5a630ed51821fc3d-98.jpg",
    "descriptions": "Choose your vehicle, weapons, pilot, and defense. Assault the districts of Solo Nobre, then escape or die trying. Your choice."
  },
  {
    "name": "Bubble Bobble Neo!",
    "details_link": "https://www.metacritic.com/game/xbox-360/bubble-bobble-neo!",
    "publisher": "Taito Corporation",
    "release_date": "Sep 16 2009",
    "developers": [
      "Taito Corporation"
    ],
    "platforms": "Xbox 360",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 70,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/1/1703345fa809518e68f6c1d79aa63400-98.jpg",
    "descriptions": "[Xbox Live Arcade]  The action game classic Bubble Bobble returns as an Xbox LIVE Arcade game in BUBBLE BOBBLE Neo! Encase your enemies in bubbles with the bubble-spitting dragon Bub! Learn the various techniques of the game and clear all the rounds in multiple game modes, including offline[Xbox Live Arcade]  The action game classic Bubble Bobble returns as an Xbox LIVE Arcade game in BUBBLE BOBBLE Neo! Encase your enemies in bubbles with the bubble-spitting dragon Bub! Learn the various techniques of the game and clear all the rounds in multiple game modes, including offline co-op play. Classic Mode: Enjoy a full-on recreation of the arcade version of the original game with 100 rounds in Classic Mode. Multiplayer: Try competitive play in VS mode, or invite your friends over for offline co-op play for up to 4 players in Arrange Mode. Achievements: Master your bubble bobbling skills to earn new achievements and Gamerscore. [Microsoft]… Expand"
  },
  {
    "name": "The Sims 2",
    "details_link": "https://www.metacritic.com/game/ds/the-sims-2",
    "publisher": "Electronic Arts",
    "release_date": "Oct 24 2005",
    "developers": [
      "Griptonite Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "Virtual Life",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 70,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/5/a9065d323de1277e5ac2a273c4d1ad2b-98.jpg",
    "descriptions": "Explore the wide-open world of The Sims 2 while trying to gain fame and fortune for your own custom created Sims. Become a real estate mogul building, customizing and running a hotel in Strangetown. Bring in the cash by keeping everyone happy and keeping the hotel in good condition. DesignExplore the wide-open world of The Sims 2 while trying to gain fame and fortune for your own custom created Sims. Become a real estate mogul building, customizing and running a hotel in Strangetown. Bring in the cash by keeping everyone happy and keeping the hotel in good condition. Design the paintings on the walls of the gallery and record the music in the lounge though touch screen mini-games. Keep Strangetown's Sims happy to uncover their hidden secrets. [Electronic Arts]… Expand"
  },
  {
    "name": "Maquette",
    "details_link": "https://www.metacritic.com/game/pc/maquette",
    "publisher": "Annapurna Interactive",
    "release_date": "Mar  2 2021",
    "developers": [
      "Graceful Decay"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "General"
    ],
    "meta_score": 70,
    "users_score": 5.1,
    "image": "https://static.metacritic.com/images/products/games/8/95f6385a7b9f58710e5f13deea387245-98.jpg",
    "descriptions": "Maquette is a first-person recursive puzzle game that takes you into a world where every building, plant, and object are simultaneously tiny and staggeringly huge."
  },
  {
    "name": "Atelier Ayesha: The Alchemist of Dusk",
    "details_link": "https://www.metacritic.com/game/playstation-3/atelier-ayesha-the-alchemist-of-dusk",
    "publisher": "Koei Tecmo Games",
    "release_date": "Mar  5 2013",
    "developers": [
      "Gust"
    ],
    "platforms": [
      "PlayStation Vita",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General",
      "General",
      "Japanese-Style"
    ],
    "meta_score": 70,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/c9c438a2db2ccf560793bf84f22038e5-98.jpg",
    "descriptions": "Atelier Ayesha: The Alchemist of Dusk follows the story of Ayesha Altugle, a girl who has been living alone in a secluded workshop ever since her grandfather died and her younger sister went missing a few years ago. She supports herself by making and selling medicine. As the story begins,Atelier Ayesha: The Alchemist of Dusk follows the story of Ayesha Altugle, a girl who has been living alone in a secluded workshop ever since her grandfather died and her younger sister went missing a few years ago. She supports herself by making and selling medicine. As the story begins, she finds out that her younger sister IS alive somewhere in the world. Now, she must devote herself to finding her younger sister. Her journey to keep her promise begin...… Expand"
  },
  {
    "name": "Payday: The Heist",
    "details_link": "https://www.metacritic.com/game/playstation-3/payday-the-heist",
    "publisher": "Sony Online Entertainment",
    "release_date": "Oct 18 2011",
    "developers": [
      "Overkill Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 3"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Fantasy",
      "Fantasy",
      "Arcade"
    ],
    "meta_score": 70,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/5/259f4fc96708136e918a2578c4508a3f-98.jpg",
    "descriptions": "Players will embark on a spectacular crime spree of six heart stopping heists, including blasting their way through a downtown bank vault robbery, managing hostages in an armored car hijacking and even a midnight infiltration of a top-secret, high-security facility. Additionally, PAYDAY: ThePlayers will embark on a spectacular crime spree of six heart stopping heists, including blasting their way through a downtown bank vault robbery, managing hostages in an armored car hijacking and even a midnight infiltration of a top-secret, high-security facility. Additionally, PAYDAY: The Heist challenges players with dynamic environments and adaptive enemy tactics - meaning no scenario will ever play out the same way twice. Teamwork is essential to ensure crew members provide cover under fire, guard key access points, break through various security measures and keep civilians in check. Survive wave after wave of the best that law enforcement can deploy as they shift strategies in response to player actions and gameplay style.… Expand"
  },
  {
    "name": "The Sims 3: Pets",
    "details_link": "https://www.metacritic.com/game/playstation-3/the-sims-3-pets",
    "publisher": "Electronic Arts",
    "release_date": "Oct 18 2011",
    "developers": [
      "The Sims Studio"
    ],
    "platforms": [
      "3DS",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "Virtual Life",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 70,
    "users_score": 4.2,
    "image": "https://static.metacritic.com/images/products/games/2/a7c05b2ae0d9319c76366396e8bf66d1-98.jpg",
    "descriptions": "Players take creativity by the reins and play out the stories they want to tell whether it’s the single guy in the dog park picking up women or the criminal overlord and her evil cat. Across all platforms, The Sims 3 Pets players will be able to create, customize and control over a hundredPlayers take creativity by the reins and play out the stories they want to tell whether it’s the single guy in the dog park picking up women or the criminal overlord and her evil cat. Across all platforms, The Sims 3 Pets players will be able to create, customize and control over a hundred different kinds of cats and dogs like the Australian Shepherd and the Maine Coon, and can breed and share them with friends providing endless possibilities to create new and exciting breeds. Each platform brings a new world for players to explore from the Xbox 360 and PlayStation 3 versions where players will unlock achievements by solving mysteries around town, the Nintendo 3DS with new lots to unlock to the PC/Mac version where they’ll be able to take their pets on play dates or meet other Sims at the dog park, cat jungles and even a horse ranch. With The Sims 3 Pets, players will be able to create, control and play with life with their pets.… Expand"
  },
  {
    "name": "Global Agenda",
    "details_link": "https://www.metacritic.com/game/pc/global-agenda",
    "publisher": "Hi-Rez Studios",
    "release_date": "Feb  1 2010",
    "developers": [
      "Hi-Rez Studios"
    ],
    "platforms": "PC",
    "genres": [
      "Role-Playing",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Sci-Fi",
      "Sci-Fi"
    ],
    "meta_score": 70,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/0f62e1392fc93f77d5d72c9371f596f2-98.jpg",
    "descriptions": "Global Agenda is a massively multi-player action game set in 22nd Earth, a 'spy-fi' world of advanced technology and player-driven conflict. In the wake of severe global disaster, the political face of 22nd century earth has changed and player-created factions scheme against each other forGlobal Agenda is a massively multi-player action game set in 22nd Earth, a 'spy-fi' world of advanced technology and player-driven conflict. In the wake of severe global disaster, the political face of 22nd century earth has changed and player-created factions scheme against each other for power. Traditional full-scale wars a thing of the past, factions must rely on covert agencies, teams of elite special operatives able to seize and defend key facilities. The future of humanity is their battleground, where knowledge is power, technology is a race, and everyone has an agenda. [Hi-Rez Studios]… Expand"
  },
  {
    "name": "Sundered",
    "details_link": "https://www.metacritic.com/game/playstation-4/sundered",
    "publisher": "Thunder Lotus Games",
    "release_date": "Jul 28 2017",
    "developers": [
      "Thunder Lotus Games"
    ],
    "platforms": [
      "PC",
      "Stadia",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "Platformer",
      ""
    ],
    "meta_score": 70,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/6/27522f41a3ffcb9ebfa5856ba98c8a6b-98.jpg",
    "descriptions": "Sundered is a horrifying fight for survival and sanity, a hand­-drawn epic from the ​creators of ​​Jotun. Resist or embrace ancient eldritch powers. You play Eshe, a wanderer in a ruined world, trapped in ever-­changing caverns filled with hordes of terrifying enemies."
  },
  {
    "name": "Cruis'n Blast",
    "details_link": "https://www.metacritic.com/game/switch/cruisn-blast",
    "publisher": "GameMill Entertainment",
    "release_date": "Sep 14 2021",
    "developers": [
      "Raw Thrills"
    ],
    "platforms": "Switch",
    "genres": [
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 70,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/6/d17eed40d535424487a6724131fdfc12-98.jpg",
    "descriptions": "Cruis'n Blast, developed by the crack Raw Thrills studio team, takes Cruis'n into the new millennium as players zoom 200 mph through the bustle of London, blast through the exotic wonders of Madagascar, celebrate Carnival in Rio, amaze to the hi tech splendor of Singapore, and drive anCruis'n Blast, developed by the crack Raw Thrills studio team, takes Cruis'n into the new millennium as players zoom 200 mph through the bustle of London, blast through the exotic wonders of Madagascar, celebrate Carnival in Rio, amaze to the hi tech splendor of Singapore, and drive an earth-shaking thriller through Death Valley.… Expand"
  },
  {
    "name": "The Outfit",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-outfit",
    "publisher": "THQ",
    "release_date": "Mar 13 2006",
    "developers": [
      "Relic",
      "Relic Entertainment"
    ],
    "platforms": "Xbox 360",
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Tactical",
      "Historic",
      "Historic"
    ],
    "meta_score": 70,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/4/388cb4ce6ac1ac41b561a5b81c9a762c-98.jpg",
    "descriptions": "THQ and Relic Entertainment take explosive World War II combat to the next generation in an all-new 3rd Person Action Game. Combining intense squad-based combat with the freedom of total destruction, The Outfit takes players behind enemy lines, battling the Nazi War Machine through a varietyTHQ and Relic Entertainment take explosive World War II combat to the next generation in an all-new 3rd Person Action Game. Combining intense squad-based combat with the freedom of total destruction, The Outfit takes players behind enemy lines, battling the Nazi War Machine through a variety of combat missions. Choose from three playable squad leaders - each with their own skills and abilities, as you lead a squad of battle-forged soldiers on missions ranging from reconnaissance and rescue to search and destroy. With interactive and fully destructible environments, you have the freedom to shoot, blow up or demolish anything in your path. As you complete mission objectives, you'll gain Field Units (FUs), a currency that can be used to order \"Destruction on Demand\" - air-dropped into the action at any time. With \"Destruction On Demand\" (D.O.D.) you can order in everything from tanks, jeeps, half-tracks and other combat vehicles to machinegun nests and anti-tank emplacements, or call in for squad reinforcements, air-strikes or artillery strikes. Experience the cinematic intensity of WWII combat through 12 epic Single-player missions or go online for a variety of Multiplayer modes, including Co-Op and Versus. [THQ]… Expand"
  },
  {
    "name": "Assassin's Creed III: Liberation",
    "details_link": "https://www.metacritic.com/game/playstation-vita/assassins-creed-iii-liberation",
    "publisher": "Ubisoft",
    "release_date": "Oct 30 2012",
    "developers": [
      "Ubisoft",
      "Ubisoft Sofia"
    ],
    "platforms": "PlayStation Vita",
    "num_players": "Up to 64 ",
    "genres": [
      "Action Adventure",
      "Historic",
      "Historic",
      "Open-World"
    ],
    "meta_score": 70,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/8/117fe8ea9a6a50962bcc27e7222c018b-98.jpg",
    "descriptions": "It's 1765. 10 years before the American Revolutionary War in the north, Spanish forces plan to take control of the Louisiana Territory in the south...but they have yet to reckon with Aveline, a deadly Assassin who uses every weapon and well-honed skill in her arsenal to win freedom for herIt's 1765. 10 years before the American Revolutionary War in the north, Spanish forces plan to take control of the Louisiana Territory in the south...but they have yet to reckon with Aveline, a deadly Assassin who uses every weapon and well-honed skill in her arsenal to win freedom for her land and her people. Whether silently eliminating her enemies with vicious slow-motion chain kills or luring them into deadly traps, Aveline strikes mortal fear into the hearts of any who stand in her way. As an Assassin, Aveline finds herself on an unforgettable journey that will take her from the crowded streets and voodoo-haunted swamps of New Orleans to ancient Mayan ruins. She plays a pivotal role in the turbulent birth of the new nation and fights for freedom not only for herself, but for her fellow citizens, as well. [Sony]… Expand"
  },
  {
    "name": "Pacer",
    "details_link": "https://www.metacritic.com/game/pc/pacer",
    "publisher": "R8 Games",
    "release_date": "Oct 29 2020",
    "developers": [
      "R8 Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Racing",
      "Arcade",
      "Futuristic"
    ],
    "meta_score": 70,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/4/968143d55c5b2f992ded31d21b55f07c-98.jpg",
    "descriptions": "Unique Storm Mode for single player and multiplayer: Life or death in a contracting field of play - the first ever Battle Royale arcade racer .\rSpectator Mode: Follow any pilot with Chase, Nose, Orbit or Environment cameras while displaying all race stats.\rHighly customizable: Craft,Unique Storm Mode for single player and multiplayer: Life or death in a contracting field of play - the first ever Battle Royale arcade racer .\rSpectator Mode: Follow any pilot with Chase, Nose, Orbit or Environment cameras while displaying all race stats.\rHighly customizable: Craft, weapons and cosmetics.\rReplay Mode: For capturing and sharing amazing action clips and stills.\rOnline Ranked Mode: Find out how your piloting skills rate against the best in the world.\rOnline Tournament/Spectator Mode: For easy streaming and encouraging fun events at all levels.\rCampaign: Unlock team skins, as well as more challenging tracks and speed classes.\rDesigners Republic partnership: Graphic designs that influenced a generation in games and music.\rOST and SFX: Created by Tim Wright aka CoLD SToRAGE.\rIn-game VOIP, making in-game chat both easy and fun.\rHosted servers: To level the online playing field and minimize the possibility of cheating.… Expand"
  },
  {
    "name": "Deadly Premonition Origins",
    "details_link": "https://www.metacritic.com/game/switch/deadly-premonition-origins",
    "publisher": "Rising Star Games",
    "release_date": "Sep  4 2019",
    "developers": [
      "Toybox Games",
      "TOYBOX"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 70,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/6/13dbc26686db8fd535d6b9b41c2a8b45-98.jpg",
    "descriptions": "Deadly Premonition is a third-person survival horror action game which puts players in the role of the intuitive FBI Agent Francis York Morgan. In the process of investigating a murder, players will examine a series of interlocking mysteries in a remote rural town and will encounter an arrayDeadly Premonition is a third-person survival horror action game which puts players in the role of the intuitive FBI Agent Francis York Morgan. In the process of investigating a murder, players will examine a series of interlocking mysteries in a remote rural town and will encounter an array of complex characters pivotal to the unraveling of the storyline's mystery. Suspenseful action sequences will force players to make strategic moves, gliding by enemies in the shadows or engaging them with long-range weapons or hand-to-hand melee combat. From the unparalleled atmosphere, music and mysterious storyline to driving vehicles and exploring the entire town, Deadly Premonition will offer players a unique and haunting interactive gaming experience unlike any other.… Expand"
  }
]