[{"name": "Huntdown", "details_link": "https://www.metacritic.com/game/pc/huntdown", "publisher": "Coffee Stain Studios", "release_date": "May 12 2020", "developers": ["Coffee Stain Studios", "Easy Trigger Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/67b215da7d1eac8027ea12ed7db779f9-98.jpg", "descriptions": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy."}, {"name": "Chaos Reborn", "details_link": "https://www.metacritic.com/game/pc/chaos-reborn", "publisher": "Snapshot Games Inc.", "release_date": "Oct 26 2015", "developers": ["Snapshot Games Inc."], "platforms": ["iPhone/iPad", "PC"], "genres": ["Fantasy", "Strategy", "Turn-Based", "General"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/1bb2de36f8a2af023ba5fdcb3d55269e-98.jpg", "descriptions": "At the heart of Chaos Reborn is an intuitive and fluid turn-based wizard combat system. You play the role of a fighting wizard armed with a selection of spells and magical staff. Some spells summon creatures but others are more exotic, such as the Gooey Blob which spreads uncontrollablyAt the heart of Chaos Reborn is an intuitive and fluid turn-based wizard combat system. You play the role of a fighting wizard armed with a selection of spells and magical staff. Some spells summon creatures but others are more exotic, such as the Gooey Blob which spreads uncontrollably across the terrain. The balance between Law and Chaos can be altered to your advantage, or you can cast illusions to deceive your adversaries. It’s a game of bluff, tactics and calculated risks with nail-biting decisions from one turn to the next.… Expand"}, {"name": "Assassin's Creed Origins", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-origins", "publisher": "Ubisoft", "release_date": "Oct 27 2017", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Edutainment", "Open-World"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/2e70c5dde2ac1a574bb6ed7512676a6c-98.jpg", "descriptions": "Set in mysterious Ancient Egypt, Assassin’s Creed Origins is a new beginning. Experience a new way to fight while exploring the Great Pyramids and hidden tombs across the country of Ancient Egypt, and encounter many memorable storylines along your journey. And discover the origin story ofSet in mysterious Ancient Egypt, Assassin’s Creed Origins is a new beginning. Experience a new way to fight while exploring the Great Pyramids and hidden tombs across the country of Ancient Egypt, and encounter many memorable storylines along your journey. And discover the origin story of the Assassin's Brotherhood. [Ubisoft]… Expand"}, {"name": "GTR: FIA GT Racing Game", "details_link": "https://www.metacritic.com/game/pc/gtr-fia-gt-racing-game", "publisher": "10tacle Studios", "release_date": "May  3 2005", "developers": ["SimBin"], "platforms": "PC", "num_players": "Up to 60 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "Automobile"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/fc5bd375677ad2122f661bbe91416e36-98.jpg", "descriptions": "Experience the original FIA GT Championship first-hand on your PC as you pit your skills against over 70 different opponents on all 10 legendary race courses such as SPA, Donington, and Monza. Developed by racing professionals, GTR is the most realistic racing experience ever. Original FIAExperience the original FIA GT Championship first-hand on your PC as you pit your skills against over 70 different opponents on all 10 legendary race courses such as SPA, Donington, and Monza. Developed by racing professionals, GTR is the most realistic racing experience ever. Original FIA GT Series cars and courses. 3 playing modes for newcomers, experienced players and simulation pros including intense multiplayer action. Real racing teams featuring over 70 race cars, including the Porsche 911, Viper GTS-R, BMW Z3 M and Ferrari 550 Maranello. Highly realistic opponent AI giving a total race experience! Dynamic weather changes during the race. Unrestricted game save and reload function. MOTEC Analysis Software: GTR uses the analysis software used by real racing teams. Based on real-life FIA GT team telemetry data. Live Track Technology: course conditions change as the race progresses. [Atari]… Expand"}, {"name": "Final Fantasy IX", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-ix", "publisher": "Square Enix", "release_date": "Sep 19 2017", "developers": ["SquareSoft", "Square Enix"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/f65bd7524b2d384732f2a1211d097947-98.jpg", "descriptions": "The last Final Fantasy for the PlayStation, Final Fantasy IX returns to the pure fantasy roots that spawned the series.  This latest installment features highly detailed characters, vehicles, and environments, and breathtaking cinema-graphics.  The addition of brand new features such as theThe last Final Fantasy for the PlayStation, Final Fantasy IX returns to the pure fantasy roots that spawned the series.  This latest installment features highly detailed characters, vehicles, and environments, and breathtaking cinema-graphics.  The addition of brand new features such as the story-enhancing Active Time Event system and the return of minigames that grant additional gameplay make Final Fantasy IX not only a memorable gaming experience, but also a significant step forward in the series.… Expand"}, {"name": "Shadow Hearts: Covenant", "details_link": "https://www.metacritic.com/game/playstation-2/shadow-hearts-covenant", "publisher": "Midway", "release_date": "Sep 27 2004", "developers": ["Nautilus"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 85, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/02a7ea55c72a7e0a651a739e0d6b92dc-98.jpg", "descriptions": "(Also known as \"Shadow Hearts II\" in Japan) The story unfolds via amazingly detailed cutscenes which bring the enthralling and complex characters, powerful battle sequences and unique gameplay to life. Shadow Hearts: Covenant also brings back the innovative combat system, the Judgment Ring,(Also known as \"Shadow Hearts II\" in Japan) The story unfolds via amazingly detailed cutscenes which bring the enthralling and complex characters, powerful battle sequences and unique gameplay to life. Shadow Hearts: Covenant also brings back the innovative combat system, the Judgment Ring, which not only allows players to choose which characters to bring to battle, but also determines the final outcome of the battle based on the players' speed and accuracy. New to the Shadow Hearts sequel, are enhancements to the Judgment Ring which allow team-based combo attacks. Set during World War I in a fantastical world of magic and creatures, the game takes place six months after the original Shadow Hearts ended. Yuri, the main character is back, and he embarks on a new expedition with friends Gepetto, a puppet master, and Kallen, a German female soldier. Yuri's morphing abilities have been weakened because he has been cursed by Nicholas, a member of a secret society taking advantage of the war to fulfill their evil ambitions of ruling the world. Yuri and his companions must journey to find a cure for his curse and defeat the malevolent cult. [Midway]… Expand"}, {"name": "Rogue Legacy", "details_link": "https://www.metacritic.com/game/playstation-vita/rogue-legacy", "publisher": "Cellar Door Games", "release_date": "Jul 29 2014", "developers": ["Cellar Door Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "PlayStation Vita"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/3bcf4ab9f72bd3e9d6bbba6853a3670c-98.jpg", "descriptions": "Each time you die, your child will succeed you. Every child is unique. One child might be colorblind, another might have tourettes-- they could even be a dwarf.\r That's OK, because no one is perfect, and you don't have to be perfect to win this game. But you do have to be pretty darn goodEach time you die, your child will succeed you. Every child is unique. One child might be colorblind, another might have tourettes-- they could even be a dwarf.\r That's OK, because no one is perfect, and you don't have to be perfect to win this game. But you do have to be pretty darn good because this game is HARD. Fortunately, every time you die all the gold you've collected can be used to upgrade you manor, giving your next child a step up in life and another chance at vanquishing evil.… Expand"}, {"name": "Control", "details_link": "https://www.metacritic.com/game/pc/control", "publisher": "505 Games", "release_date": "Aug 27 2019", "developers": ["Remedy Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/ba8eb862dd90befe3acd0916195a179c-98.jpg", "descriptions": "After a secretive agency in New York is invaded by an otherworldly threat, you become the new Director struggling to regain Control. This supernatural third-person action-adventure game will challenge you to master a combination of supernatural abilities, modifiable loadouts and reactiveAfter a secretive agency in New York is invaded by an otherworldly threat, you become the new Director struggling to regain Control. This supernatural third-person action-adventure game will challenge you to master a combination of supernatural abilities, modifiable loadouts and reactive environments, while fighting through a deep and unpredictable world.… Expand"}, {"name": "Madden NFL 10", "details_link": "https://www.metacritic.com/game/playstation-3/madden-nfl-10", "publisher": "Electronic Arts", "release_date": "Aug 14 2009", "developers": ["EA Tiburon"], "platforms": ["iPhone/iPad", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 85, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/50cb2b07819422e1f4ea973801a107e7-98.jpg", "descriptions": "Experience first-hand what it's like to Fight for Every Yard in Madden NFL 10. With the all-new Pro-Tak animation technology, players have more control over the outcome of each play. Whether driving a receiver towards the first down, or battling for a fumble at the bottom of a pile, the playExperience first-hand what it's like to Fight for Every Yard in Madden NFL 10. With the all-new Pro-Tak animation technology, players have more control over the outcome of each play. Whether driving a receiver towards the first down, or battling for a fumble at the bottom of a pile, the play won't end until the whistle blows. Add to that the most immersive broadcast presentation and online innovation to date, and Madden NFL 10 captures the authenticity and emotion of the NFL like never before. Pro-Taks's all new animation technology provides unprecedented control over the outcome of every play. Drag defenders towards the first down marker, including up to 9-man gang tackles, fight for a fumble at the bottom of the pile, and evade the rush with all-new quarterback avoidance actions. Enhanced play at the line of scrimmage features a new blocking system that allows the quarterback to step into the pocket and gives the defensive line more control over the rush. Authenticity - Referees peeling players off a fumble pile, the chain gang rushing in to measure for a key first down, and all-new player equipment ensure that if you see it on Sunday, you’ll see it in Madden NFL 10. Fight for Online Dominance - Delivering the most comprehensive online offerings in franchise history, Madden NFL 10 includes new modes to satisfy the competitive and cooperative football gamer. New TV broadcast-style presentation and cinematic cameras bring the suspense and intensity of the NFL to your living room. Enhanced Franchise Mode - Run each aspect of an NFL franchise: draft players, sign free agents, manage the salary cap - just like a real GM. Enjoy all of the action throughout the league via a new, network inspired highlight show. The most customizable version of Madden NFL to date. Alter gameplay options to adjust the experience to your liking. A revamped play calling system and menu takes you to kickoff faster than ever before. Speed up online matches with accelerated clocks, streamlined presentation and more. [Electronic Arts]… Expand"}, {"name": "Syphon Filter: Logan's Shadow", "details_link": "https://www.metacritic.com/game/psp/syphon-filter-logans-shadow", "publisher": "SCEA", "release_date": "Oct  2 2007", "developers": ["Sony Bend"], "platforms": ["PlayStation 2", "PSP"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/bbf35dfc5e823b06e550d4e8904475b3-98.jpg", "descriptions": "We find Gabe Logan once again using a combination of stealth and \"run-and-gun\" gameplay as he is called into action when a dangerous new technology is hijacked by a criminal extremist group. In a story that takes him from the depths of the Indian Ocean to the deserts of the Middle East, GabeWe find Gabe Logan once again using a combination of stealth and \"run-and-gun\" gameplay as he is called into action when a dangerous new technology is hijacked by a criminal extremist group. In a story that takes him from the depths of the Indian Ocean to the deserts of the Middle East, Gabe is faced with the possibility that his long time partner, Lian Xing is a double agent. Logan's Shadow is complete with a variety of combat mechanics including the ability to force enemies into cover with \"blind-fire\", an advanced melee system that allows Gabe to use enemies as human shields, and 360 degree underwater combat. For the first time in the franchise \"interactive moments\" have been added for increased player interaction, such as airlifting debris and escaping wrist restraints. Returning to the franchise are buddy missions which have been enhanced with a variety of new objectives. [SCEA]… Expand"}, {"name": "Football Manager 2011", "details_link": "https://www.metacritic.com/game/pc/football-manager-2011", "publisher": "Sega", "release_date": "Nov  4 2010", "developers": ["Sports Interactive"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/fc195fa5e5e9f82959d92bda2ff8a86d-98.jpg", "descriptions": "With more new features than ever before, including real-time contract negotiation, a revamped training system and a number of match engine improvements, Football Manager 2011 will once again raise the bar for Soccer management games."}, {"name": "Dust: An Elysian Tail", "details_link": "https://www.metacritic.com/game/pc/dust-an-elysian-tail", "publisher": "Microsoft Game Studios", "release_date": "May 24 2013", "developers": ["Humble Hearts"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Action RPG", "Platformer", "Action RPG", ""], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/f9b60e5684b6d1c104614e37d36030b0-98.jpg", "descriptions": "Immerse yourself in a gorgeous hand-painted world on a search for your true identity. As the mysterious warrior, Dust, your action-packed journey will take you from peaceful glades to snowy mountaintops and beyond. At your disposal is the mythical Blade of Ahrah, capable of turning itsImmerse yourself in a gorgeous hand-painted world on a search for your true identity. As the mysterious warrior, Dust, your action-packed journey will take you from peaceful glades to snowy mountaintops and beyond. At your disposal is the mythical Blade of Ahrah, capable of turning its wielder into an unstoppable force of nature, and the blade's diminutive guardian, Fidget. Battle dozens of enemies at once with an easy-to-learn, difficult-to-master combat system, take on a variety of quests from friendly villagers, discover ancient secrets and powerful upgrades hidden throughout the massive, open world, and uncover the story of an ancient civilization on the brink of extinction as you fight to uncover your own past.… Expand"}, {"name": "NBA Live 2005", "details_link": "https://www.metacritic.com/game/xbox/nba-live-2005", "publisher": "EA Sports", "release_date": "Sep 28 2004", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/e34c1aebf8d129c6761ed4e8483c4784-98.jpg", "descriptions": "Elevate your game on both ends of the court with NBA Live 2005. Create new dribble moves, flashy dunks, and tenacious defensive plays that express your individual style--all with a touch of the right analog stick. The new 10-man Freestyle implementation enhances individual player movementsElevate your game on both ends of the court with NBA Live 2005. Create new dribble moves, flashy dunks, and tenacious defensive plays that express your individual style--all with a touch of the right analog stick. The new 10-man Freestyle implementation enhances individual player movements and floor spacing, putting you in the middle of the action. Enhanced player graphics reproduce NBA players with realistic faces, hairstyles, jerseys, and shoes. NBA Live 2005 also offers a deeper Dynasty mode, where you can watch your franchise flourish for 25 seasons.… Expand"}, {"name": "NHL 2004", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-2004", "publisher": "EA Sports", "release_date": "Sep 22 2003", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/c7cfa0d825622cfd14eb68435b85f231-98.jpg", "descriptions": "It's more physical than ever before, with new Bruise Control, an all-new fighting system, more realistic player collisions, and powerful visuals such as popping helmets and breaking glass. Total Control on the Ice: Total player control allows you to direct 2-button touch sensitive passesIt's more physical than ever before, with new Bruise Control, an all-new fighting system, more realistic player collisions, and powerful visuals such as popping helmets and breaking glass. Total Control on the Ice: Total player control allows you to direct 2-button touch sensitive passes anywhere on the ice, call team strategies on the fly, and aggressively tie up opponents against the boards and in front of the net. Go Deep Into Dynasty Mode: Take on the role of GM for up to 20 seasons, drafting and trading players, negotiating contracts, and managing the financial bottom line of your franchise. Earn valuable experience points to upgrade your GM office and/or purchase improvements to staff and facilities, thus improving your team?s on ice performance. All-New Elite Leagues: 39 new international teams from Germany?s DEL, Sweden?s Elitserien, and Finland?s SM-Liga. Enhanced EA SPORTS Online: Compete in one-on-one or all-new on-line tournament games, and chat in-game with EA SPORTS Talk. New EA SPORTS Bio: Unlock special rewards in NHL 2004 by playing multiple titles, including Madden NFL 2004, NBA Live 2004, and much more. [Electronic Arts]… Expand"}, {"name": "NFL 2K2", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-2k2", "publisher": "Sega", "release_date": "Nov 19 2001", "developers": ["Visual Concepts"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/a967b2f988a4d66462baef4b152d70c3-98.jpg", "descriptions": "The Sega Sports NFL franchise makes its PS2 debut with such new features as its intelligent passing/catching system providing for greater accuracy in pass play timing and execution, and advanced in-game effects such as natural outdoor lighting that casts real-time stadium shadows onto the field."}, {"name": "South Park: The Stick of Truth", "details_link": "https://www.metacritic.com/game/pc/south-park-the-stick-of-truth", "publisher": "Ubisoft", "release_date": "Mar  4 2014", "developers": ["Obsidian Entertainment"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/9abcebdcfc5e259df3e2a32300b58054-98.jpg", "descriptions": "South Park: The Game is an epic role-playing adventure that will allow the user to befriend Stan, Kyle, Cartman and Kenny and explore the quiet little mountain town like never before."}, {"name": "Destiny 2: The Witch Queen", "details_link": "https://www.metacritic.com/game/pc/destiny-2-the-witch-queen", "publisher": "Bungie", "release_date": "Feb 22 2022", "developers": ["Bungie"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/458684c3f743594a2f576b0b07c6ef29-98.jpg", "descriptions": "The Definitive Destiny Campaign. Delve into Savathûn’s Throne World to uncover the mystery of how she and her Lucent Hive stole the Light. Learn the secrets to crafting new weapons, the new Glaive, and survive the truth within her web of lies. New Destination. A twisted wonderland ofThe Definitive Destiny Campaign. Delve into Savathûn’s Throne World to uncover the mystery of how she and her Lucent Hive stole the Light. Learn the secrets to crafting new weapons, the new Glaive, and survive the truth within her web of lies. New Destination. A twisted wonderland of corruption and splendor, Savathûn’s Throne World plays host to a fragile balance of power. From her palace to the swamp, all that she hides can be found here. Weapon Crafting. Create custom weaponry with unique mod, shader, and stat combinations. Master the new Glaive weapon type and unleash powerful melee combos, projectile attacks, and a deployable energy shield. … Expand"}, {"name": "Monkey Island 2 Special Edition: LeChuck's Revenge", "details_link": "https://www.metacritic.com/game/xbox-360/monkey-island-2-special-edition-lechucks-revenge", "publisher": "LucasArts", "release_date": "Jul  7 2010", "developers": ["LucasArts"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/4df3c27d9c368db11aef5fc2352a917d-98.jpg", "descriptions": "[Xbox Live Arcade]  More Pirates! More Adventure! More Monkeys! Relive the second swashbuckling misadventure of the wannabe pirate Guybrush Threepwood as he searches for the lost treasure of Big Whoop, attempts to win back the beautiful Elaine Marley and takes on the now evil zombie pirate,[Xbox Live Arcade]  More Pirates! More Adventure! More Monkeys! Relive the second swashbuckling misadventure of the wannabe pirate Guybrush Threepwood as he searches for the lost treasure of Big Whoop, attempts to win back the beautiful Elaine Marley and takes on the now evil zombie pirate, LeChuck! Monkey Island 2 Special Edition: LeChuck’s Revenge faithfully re-imagines the original classic in signature Special Edition detail. Plus, interact with the world of Monkey Island like never before with new direct-character controls, an interactive object highlight system, behind the scenes art viewer and creator commentary featuring the original developers of Monkey Island 2: LeChuck’s Revenge! Play it again for the first time with signature Special Edition features. [LucasArts]… Expand"}, {"name": "Clive Barker's Undying", "details_link": "https://www.metacritic.com/game/pc/clive-barkers-undying", "publisher": "Electronic Arts", "release_date": "Feb 21 2001", "developers": ["Dreamworks Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 85, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/f83e6e2a632e06596c60d0c369ac181c-98.jpg", "descriptions": "An FPS that delivers an unparalleled tale of horror. Summoned by an old friend, you are Patrick Galloway, master of the occult, armed with the dark knowledge of arcane magic and a six-shot weapon of forged metal grace. You must unravel the curse of the Covenant family ... or die trying.An FPS that delivers an unparalleled tale of horror. Summoned by an old friend, you are Patrick Galloway, master of the occult, armed with the dark knowledge of arcane magic and a six-shot weapon of forged metal grace. You must unravel the curse of the Covenant family ... or die trying.  [Electronic Arts]… Expand"}, {"name": "Assassin's Creed III", "details_link": "https://www.metacritic.com/game/playstation-3/assassins-creed-iii", "publisher": "Ubisoft", "release_date": "Oct 30 2012", "developers": ["Ubisoft"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 85, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/ba58d0c9478a04324c628e05398970d1-98.jpg", "descriptions": "Pursue your enemies through 1775 America in an ever-changing environment. From the legendary battlefields of Lexington and Concord and the bustling streets of Boston and New York, to the snow-covered Appalachian wilderness, you’ll wage war in a stunningly mutable environment. Whether you’rePursue your enemies through 1775 America in an ever-changing environment. From the legendary battlefields of Lexington and Concord and the bustling streets of Boston and New York, to the snow-covered Appalachian wilderness, you’ll wage war in a stunningly mutable environment. Whether you’re tracking your quarry’s blood trail through fresh snow, or taking advantage of driving winds and thick fog to hide your attack, liberty is on the line, so unleash your killing power in Assassin's Creed 3.… Expand"}, {"name": "Fire Emblem: The Sacred Stones", "details_link": "https://www.metacritic.com/game/game-boy-advance/fire-emblem-the-sacred-stones", "publisher": "Nintendo", "release_date": "May 23 2005", "developers": ["Intelligent Systems"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 85, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/1/9bef42efebfef1a94b2e34fdcbc19772-98.jpg", "descriptions": "In Fire Emblem: The Sacred Stones, you must help protect the nation of Renais from the invading Grado Empire. Plan your strategy, choose your units, and then lead your soldiers in to battle. The more experience your soldiers gain, the more you can upgrade their abilities. This time, yourIn Fire Emblem: The Sacred Stones, you must help protect the nation of Renais from the invading Grado Empire. Plan your strategy, choose your units, and then lead your soldiers in to battle. The more experience your soldiers gain, the more you can upgrade their abilities. This time, your soldiers can gain experience by fighting new monsters in the Tower of Valni.… Expand"}, {"name": "Dragon Age: Inquisition", "details_link": "https://www.metacritic.com/game/xbox-one/dragon-age-inquisition", "publisher": "Electronic Arts", "release_date": "Nov 18 2014", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 4 ", "genres": ["General", "Role-Playing", "General", "Action RPG", "Western-Style"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/cdbb455cc53e25ad6c46902a8b39d824-98.jpg", "descriptions": "Draft and lead a group of characters into rugged battles against a diversity of enemies – from earth-shattering High Dragons to demonic forces from the otherworld of the Fade. Go hand to hand in visceral, heroic combat as your followers fight by your side, or switch to tactical view toDraft and lead a group of characters into rugged battles against a diversity of enemies – from earth-shattering High Dragons to demonic forces from the otherworld of the Fade. Go hand to hand in visceral, heroic combat as your followers fight by your side, or switch to tactical view to coordinate murderous offensives using the combined might of your party. See the tangible, visible results of your journey through a living world – raise structures, customize outposts, and change the landscape itself as environments are re-shaped in the wake of your Inquisition. Lead a party chosen from nine unique, fully-formed characters – each of whom react to your actions and choices differently, forming complex relationships both with you and with each other. Create your own character from multiple races, customize their appearance, and select their powers and abilities as the game progresses. Extensive customization options allow you to choose everything from the color of your follower’s boots to the features of your Inquisition stronghold. Become an agent of change in a time of uncertainty and upheaval.  Shape the course of empires, bring war or peace to factions in conflict, and drive the ultimate fate of the Inquisition. Will you stop the cataclysmic anarchy gripping the Dragon Age? [Electronic Arts]… Expand"}, {"name": "Dark Souls: Prepare to Die Edition", "details_link": "https://www.metacritic.com/game/pc/dark-souls-prepare-to-die-edition", "publisher": "Namco Bandai Games", "release_date": "Aug 24 2012", "developers": ["From Software"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/a5dff6cb0dafd1638d3ab646217a5d1a-98.jpg", "descriptions": "With tense dungeon crawling and fearsome enemy encounters, the seamlessly intertwined world of Dark Souls is full of extreme battles, rewarding challenges, nuanced weaponry and magic, and the flexibility to customize each character to suit any desired play style.  The innovative onlineWith tense dungeon crawling and fearsome enemy encounters, the seamlessly intertwined world of Dark Souls is full of extreme battles, rewarding challenges, nuanced weaponry and magic, and the flexibility to customize each character to suit any desired play style.  The innovative online component allows gamers to draw from the collective experience of the Dark Souls community as they either help or sabotage each other on the journey through the world of Lordran to save the land from darkness.  With a massive, seamless open world design, Dark Souls encourages deep exploration and an adaptable gameplay experience.… Expand"}, {"name": "The Binding of Isaac: Afterbirth +", "details_link": "https://www.metacritic.com/game/switch/the-binding-of-isaac-afterbirth-+", "publisher": "Nicalis", "release_date": "Mar 17 2017", "developers": ["Edmund McMillen", "Nicalis"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/d408a6521a06a2d6e87c3a2bb96e51e0-98.jpg", "descriptions": "The latest expansion to The Binding of Isaac: Rebirth features: 55+ new items, new final chapter with boss and ending, new playable character, greed hard mode, daily greed runs, 5 new challenges, loads of new achievements, new bosses and other little editions, plus new dev tools! so you canThe latest expansion to The Binding of Isaac: Rebirth features: 55+ new items, new final chapter with boss and ending, new playable character, greed hard mode, daily greed runs, 5 new challenges, loads of new achievements, new bosses and other little editions, plus new dev tools! so you can design, edit and play and endless number of mods, features and whole new games that the community will no doubt eventually design.… Expand"}, {"name": "NBA 2K13", "details_link": "https://www.metacritic.com/game/wii-u/nba-2k13", "publisher": "2K Sports", "release_date": "Nov 18 2012", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "1 Player", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/dfffc789b273d40ceaecc928369d0b85-98.jpg", "descriptions": "Featuring an enhanced MyCAREER mode and new gameplay features, NBA 2K13 lets gamers pit the best players in NBA history against the new dynasty of talent, including the much-debated matchup between the 2012 U.S. Men’s National Team and the 1992 “Dream Team.”"}, {"name": "Tunic", "details_link": "https://www.metacritic.com/game/pc/tunic", "publisher": "Finji", "release_date": "Mar 16 2022", "developers": ["ISOMETRICORP Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/88aa3fd9016ed1c8da43d55a2a70e5f9-98.jpg", "descriptions": "Tunic is an isometric action adventure about a tiny fox in a big world. Embark on an adventuresome questabout set in that place just beyond the farthest you’ve ever been. Explore ancient ruins, fight monsters and uncover mysterious secrets. The world is big and scary — so be brave, little one."}, {"name": "Shadow Tactics: Blades of the Shogun", "details_link": "https://www.metacritic.com/game/pc/shadow-tactics-blades-of-the-shogun", "publisher": "Daedalic Entertainment", "release_date": "Dec  6 2016", "developers": ["Mimimi Productions", "Mimimi Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/f64dcb7f0fe97c655c1303c2546a122c-98.jpg", "descriptions": "The tactical game with stealth elements Shadow Tactics: Blades of the Shogun is a cooperative endeavor of Daedalic Entertainment and Mimimi Productions. The game is a special take on the genre: it takes place during the Edo-Era of Japan in 1615. Within a playtime of roughly 25 hours, 5The tactical game with stealth elements Shadow Tactics: Blades of the Shogun is a cooperative endeavor of Daedalic Entertainment and Mimimi Productions. The game is a special take on the genre: it takes place during the Edo-Era of Japan in 1615. Within a playtime of roughly 25 hours, 5 characters will face challenging missions, each protagonist with their own special field of expertise. Only if you know the positive and negative qualities of your characters and play tactically and with finesse, will you master the challenges ahead.… Expand"}, {"name": "Super Smash Bros. for Nintendo 3DS", "details_link": "https://www.metacritic.com/game/3ds/super-smash-bros-for-nintendo-3ds", "publisher": "Nintendo", "release_date": "Oct  3 2014", "developers": ["Bandai Namco Games"], "platforms": ["Wii U", "3DS"], "num_players": "Up to 4 ", "genres": ["Fighting", "3D", "2D", "Action", "Fighting", "2D", "3D"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/9dda6f00348d7881edf21fce7a8007a9-98.jpg", "descriptions": "Return to a world of exciting battles with Super Smash Bros. as you fight your way through a host of fan-favorite opponents. Make your way through memorable stages inspired by the most notorious classic Nintendo games. Challenge a myriad of familiar faces to battle, including Mario, Link,Return to a world of exciting battles with Super Smash Bros. as you fight your way through a host of fan-favorite opponents. Make your way through memorable stages inspired by the most notorious classic Nintendo games. Challenge a myriad of familiar faces to battle, including Mario, Link, Samus and Pikachu, or take on new contenders, such as Mega Man, Little Mac and Palutena, the Goddess of Light from the Kid Icarus games. Leap into battle as your own personalized Mii characters. Dive into a thrilling new mode, exclusive to the Nintendo 3DS, Smash Run. Fight solo through a battlefield of enemies, and snatch up their dropped powerups before the clock runs out — and the real battle begins. Customize your fighter for when you're playing locally or online. Experience all the stunning beauty of the Super Smash Bros. world rendered in immersive 3D. Challenge family and friends locally or online, or seek out new competition from around the globe in online For Fun or For Glory matches.… Expand"}, {"name": "Medieval II: Total War Kingdoms", "details_link": "https://www.metacritic.com/game/pc/medieval-ii-total-war-kingdoms", "publisher": "Sega", "release_date": "Aug 28 2007", "developers": ["Creative Assembly"], "platforms": ["iPhone/iPad", "PC"], "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 85, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/4/43485dad6b3fe368d14e07a7ab4f19c3-98.jpg", "descriptions": "Medieval II: Total War Kingdoms is the official expansion to Medieval II: Total War, presenting players with all-new territories to explore, troops to command, and enemies to conquer. Kingdoms features four new entire campaigns centered on expanded maps of the British Isles, TeutonicMedieval II: Total War Kingdoms is the official expansion to Medieval II: Total War, presenting players with all-new territories to explore, troops to command, and enemies to conquer. Kingdoms features four new entire campaigns centered on expanded maps of the British Isles, Teutonic Northern Europe, the Middle East, and the Americas. In Medieval II, players were only given a glimpse of South America, but in Kingdoms, vast tracts of land in both North and South America have been opened up for players to conquer. All-new factions from the New World are also now fully playable, including the Aztecs, Apaches, and Mayans. Along with the new maps in the Britannia, Teutonic, Crusades, and New World Campaigns, there are 13 new factions to play, over 110 units to control, and 50 building types, adding up to 80 hours of new gameplay. Kingdoms also offers new multiplayer maps and hotseat multiplayer, a first for the Total War series, allowing players to play one-versus-one campaign games on the same computer. [Sega]… Expand"}, {"name": "Call of Duty: World at War", "details_link": "https://www.metacritic.com/game/playstation-3/call-of-duty-world-at-war", "publisher": "Activision", "release_date": "Nov 10 2008", "developers": ["Treyarch"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/52671001ff3af04ba89ea51c7521fe13-98.jpg", "descriptions": "Utilizing the Call of Duty 4: Modern Warfare engine, Call of Duty: World at War throws out the rulebook of war to transform WWII combat through a new enemy, new tactics and an uncensored experience of the climatic battles that gripped a generation. As U.S. Marines and Russian soldiers,Utilizing the Call of Duty 4: Modern Warfare engine, Call of Duty: World at War throws out the rulebook of war to transform WWII combat through a new enemy, new tactics and an uncensored experience of the climatic battles that gripped a generation. As U.S. Marines and Russian soldiers, players employ new features like cooperative gameplay, and weapons such as the flamethrower in the most chaotic and cinematically intense experience to date. Call of Duty: World at War introduces co-operative play, bringing fresh meaning to the \"No One Fights Alone\" mantra with up to four-players online for Xbox 360, PS3 and PC, or two-player local split-screen on consoles. Nintendo Wii will also support a unique co-op mode for two players. For the first time ever players can experience harrowing single-player missions together for greater camaraderie and tactical execution.  The co-op campaign allows players to rank up and unlock perks in competitive multiplayer by completing challenges and earning experience points, adding continuous re-playability and team-based gameplay. Whether playing competitively or cooperatively – if players are online with Call of Duty: World at War – they always gain experience points. Based on a player’s experience rank and rank of the player's friends, Call of Duty: World at War scales dynamically to provide a deeper level of challenge. [Activision]… Expand"}, {"name": "Mario Kart 8 Deluxe: Booster Course Pass - Wave 4", "details_link": "https://www.metacritic.com/game/switch/mario-kart-8-deluxe-booster-course-pass---wave-4", "publisher": "Nintendo", "release_date": "Mar  9 2023", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 85, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/36a71446250720c91fb00edc52982d4a-98.jpg", "descriptions": "Egg-cellent! Birdo joins the fun in Wave 4 of the Mario Kart 8 Deluxe - Booster Course Pass! And get ready to take a speedy trip through the brand-new Yoshi's Island course when Wave 4 arrives this Spring!"}, {"name": "Easy Come Easy Golf", "details_link": "https://www.metacritic.com/game/switch/easy-come-easy-golf", "publisher": "Clap Hanz", "release_date": "Sep 13 2022", "developers": ["Clap Hanz"], "platforms": "Switch", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 85, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/26a0dc593d58b6c9a5dbbbbf167d34ac-98.jpg", "descriptions": "Golf-game developer Clap Hanz' latest work makes its Nintendo Switch™ debut. Play with friends, family, people from all over the world, or kick back and golf on your own! Earn new characters, costumes, and courses as you play rounds in the main mode, Tour Mode. Track your growth by improvingGolf-game developer Clap Hanz' latest work makes its Nintendo Switch™ debut. Play with friends, family, people from all over the world, or kick back and golf on your own! Earn new characters, costumes, and courses as you play rounds in the main mode, Tour Mode. Track your growth by improving your Best Score on each course!\r Hop online and participate in a World Tournament or Online Match. World Tournaments with set rules are hosted weekly, and players worldwide pull out all the stops to see who has the top score! Play rounds with players from all over the world, hassle-free, in Online Match. If private affairs are more up your alley, create password-protected rooms to hit the course with friends!… Expand"}, {"name": "Inscryption", "details_link": "https://www.metacritic.com/game/pc/inscryption", "publisher": "Devolver Digital", "release_date": "Oct 19 2021", "developers": ["Daniel Mullins Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/69ffbc46012458029662c19e1d4d73a3-98.jpg", "descriptions": "Inscryption is an inky black card-based odyssey that blends the deckbuilding roguelike, escape-room style puzzles, and psychological horror into a blood-laced smoothie. Darker still are the secrets inscrybed upon the cards..."}, {"name": "Warframe", "details_link": "https://www.metacritic.com/game/playstation-5/warframe", "publisher": "Digital Extremes", "release_date": "Nov 26 2020", "developers": ["Digital Extremes"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "PlayStation 5"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/f76b111fcc137f5120109909a7720f18-98.jpg", "descriptions": "Set in the far reaches of outer space during a new Dark Age, WARFRAME introduces the Tenno, a race on the brink of extinction after being enslaved by the Grineer for centuries. Players enter WARFRAME on the cusp of the Grineer's victory over the Tenno until they begin to arm themselves withSet in the far reaches of outer space during a new Dark Age, WARFRAME introduces the Tenno, a race on the brink of extinction after being enslaved by the Grineer for centuries. Players enter WARFRAME on the cusp of the Grineer's victory over the Tenno until they begin to arm themselves with WARFRAMES - an ancient exo-skeletal technology only they can operate. Hidden within the Orokin Derelicts of a lost civilization, new WARFRAMES lie dormant and undiscovered.  These artifacts are the Tenno's only hope for survival.… Expand"}, {"name": "Planet Coaster: Console Edition", "details_link": "https://www.metacritic.com/game/xbox-one/planet-coaster-console-edition", "publisher": "Frontier Developments", "release_date": "Nov 10 2020", "developers": ["Frontier Developments"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/700a2376694f10046ec7098355054047-98.jpg", "descriptions": "Welcome to a new era in coaster park simulation! Bring your ideas to life with easy-to-use tools, manage all aspects of your expanding empire, and harness the world’s best creations from an endlessly creative community in the Frontier Workshop."}, {"name": "Dragon Quest Builders 2", "details_link": "https://www.metacritic.com/game/pc/dragon-quest-builders-2", "publisher": "Square Enix", "release_date": "Dec 10 2019", "developers": ["Omega Force", "Koei Tecmo Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Sandbox"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/6bcf3c742128283eec1063b691bdb568-98.jpg", "descriptions": "DRAGON QUEST BUILDERS 2 is a block-building RPG set in a fantasy land threatened by an evil cult. Explore, battle, build and harvest in the charming single-player campaign or build big projects in the online sandbox mode for up to 4-players."}, {"name": "The Outer Worlds", "details_link": "https://www.metacritic.com/game/xbox-one/the-outer-worlds", "publisher": "Obsidian Entertainment", "release_date": "Oct 25 2019", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/0383b3e86d463c45ad85fddc38e73fed-98.jpg", "descriptions": "The Outer Worlds is a new single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division. Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening toThe Outer Worlds is a new single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division. Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening to destroy the Halcyon colony. As you explore the furthest reaches of space and encounter various factions, all vying for power, the character you decide to become will determine how this player-driven story unfolds. In the corporate equation for the colony, you are the unplanned variable.… Expand"}, {"name": "DJMax Respect", "details_link": "https://www.metacritic.com/game/playstation-4/djmax-respect", "publisher": "Neowiz", "release_date": "Mar  6 2018", "developers": ["Rocky Studio"], "platforms": "PlayStation 4", "num_players": "2 ", "genres": ["Action", "Rhythm", "Music"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/6a642648d36a93182fd0955917a8a9ce-98.jpg", "descriptions": "Meet the legend of music game again on PlayStation 4. Enjoy variety of legendary DJMAX classics and also new songs at 'DJMAX RESPECT'."}, {"name": "Pro Evolution Soccer 2017", "details_link": "https://www.metacritic.com/game/playstation-4/pro-evolution-soccer-2017", "publisher": "Konami", "release_date": "Sep 13 2016", "developers": ["Konami"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/acac97706694fe1e3016de78ee66596b-98.jpg", "descriptions": "In PES 2017, the 1st touch is calculated by player attributes, as well as the further inclusion of real ball physics directly controlled by the input ball touch. See how different players control the ball in unique and different ways based on where and how you control them, dictating theIn PES 2017, the 1st touch is calculated by player attributes, as well as the further inclusion of real ball physics directly controlled by the input ball touch. See how different players control the ball in unique and different ways based on where and how you control them, dictating the flow of the game based on how they react to the unpredictable movement of the ball. In addition, there is more control in how you receive passes, and depending on the pass, players can visually execute the exact play intended, from receiving a pass to sending the ball out again. [Konami]… Expand"}, {"name": "Resogun: Defenders", "details_link": "https://www.metacritic.com/game/playstation-4/resogun-defenders", "publisher": "SCEA", "release_date": "Feb 17 2015", "developers": ["Housemarque"], "platforms": "PlayStation 4", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/e6c163ebbe027ad4a5fea9c15772fc3d-98.jpg", "descriptions": "The expansion features two new game modes — Protector and Commando — new ships, and all new planets."}, {"name": "Shovel Knight", "details_link": "https://www.metacritic.com/game/pc/shovel-knight", "publisher": "Yacht Club Games", "release_date": "Jun 26 2014", "developers": ["Yacht Club Games"], "platforms": ["3DS", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "PC"], "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/62c414f9d84688be9db47ea16f3a6e09-98.jpg", "descriptions": "Shovel Knight is a sweeping classic action adventure game with memorable characters and an 8-bit retro aesthetic created by Yacht Club Games. You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this valley with two goals: to defeat the evilShovel Knight is a sweeping classic action adventure game with memorable characters and an 8-bit retro aesthetic created by Yacht Club Games. You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this valley with two goals: to defeat the evil Enchantress and save his lost beloved. He wields a ShovelBlade; a multipurpose weapon whose techniques have now been lost to the ages. Always honest and helpful, Shovel Knight is a shining example of the code of Shovelry: Slash Mercilessly and Dig Tirelessly. However, between Shovel Knight and his beloved stands a cadre of villainous knights. These terrible foes, known as The Order of No Quarter, have been dispatched to prevent Shovel Knight from reaching the Enchantress at any cost.… Expand"}, {"name": "Final Fantasy X / X-2 HD Remaster", "details_link": "https://www.metacritic.com/game/playstation-3/final-fantasy-x-x-2-hd-remaster", "publisher": "Square Enix", "release_date": "Mar 18 2014", "developers": ["Virtuos"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "Console-style RPG", "Compilation", "Compilation"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/f05980ce3b41e870a61b7f341c76689b-98.jpg", "descriptions": "Final Fantasy X HD is a remake of the PS2 classic for the PlayStation 3 and PlayStation VITA."}, {"name": "DmC: Devil May Cry", "details_link": "https://www.metacritic.com/game/pc/dmc-devil-may-cry", "publisher": "Capcom", "release_date": "Jan 24 2013", "developers": ["Ninja Theory", "QLOC"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 85, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/5830b44386c73d93068d1887328fd6a1-98.jpg", "descriptions": "DmC is the next installment in the Devil May Cry series, set in the present day, with new weapons and a new setting for Dante. Chain together combo after combo with panache and dispatch demonic spawn back to hell."}, {"name": "The Legend of Zelda: Four Swords Anniversary Edition", "details_link": "https://www.metacritic.com/game/ds/the-legend-of-zelda-four-swords-anniversary-edition", "publisher": "Nintendo", "release_date": "Sep 28 2011", "developers": ["GREZZO"], "platforms": "DS", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/7467cfd4f314d13d669e0e72319a03ac-98.jpg", "descriptions": "The Legend of Zelda: Four Swords is a free DSiWare download."}, {"name": "Maboshi's Arcade", "details_link": "https://www.metacritic.com/game/wii/maboshis-arcade", "publisher": "Nintendo", "release_date": "Dec 29 2008", "developers": ["Mindware"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/796637b5ed750d023d335c6a94767dde-98.jpg", "descriptions": "[WiiWare] - (Also known as \"Maboshi's Arcade\")  This unique arcade action title features three games in one, based on three classic shapes: circle, bar and square. There are three game windows on screen at the same time, allowing for three people to play different games simultaneously. But[WiiWare] - (Also known as \"Maboshi's Arcade\")  This unique arcade action title features three games in one, based on three classic shapes: circle, bar and square. There are three game windows on screen at the same time, allowing for three people to play different games simultaneously. But there is a twist – each game impacts the other players. For every player, the goal is the same – score a million points – but the challenge is different, whether you’re bashing enemies in Circle Mode, weaving your way through Bar Mode, or burning through a maze of obstacles in Square Mode. MaBoShi: The Three Shape Arcade also features Mii characters, action replays that you can send to friends via WiiConnect24, and even a Nintendo DS download version for playing on the go. [Nintendo]… Expand"}, {"name": "Peggle Deluxe", "details_link": "https://www.metacritic.com/game/pc/peggle-deluxe", "publisher": "PopCap", "release_date": "Mar  6 2007", "developers": ["PopCap"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/b4d63b9551335a47050f7a32c9cab00e-98.jpg", "descriptions": "Ready, aim... bounce! Clear the orange pegs from 55 fanciful levels as 10 whimsical teachers guide you toward Peggle greatness. Wield mystifying Magic Powers, rack up huge bonus points and make shots you'll smile about for weeks. Amidst all this fevered action, only one question remains: CanReady, aim... bounce! Clear the orange pegs from 55 fanciful levels as 10 whimsical teachers guide you toward Peggle greatness. Wield mystifying Magic Powers, rack up huge bonus points and make shots you'll smile about for weeks. Amidst all this fevered action, only one question remains: Can you become a Peggle Master? [PopCap Games]… Expand"}, {"name": "Viewtiful Joe 2", "details_link": "https://www.metacritic.com/game/playstation-2/viewtiful-joe-2", "publisher": "Capcom", "release_date": "Dec  7 2004", "developers": ["Clover Studio"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/ff85423530193c0818fab1a13c908f32-98.jpg", "descriptions": "At the beginning of this new adventure, we find Joe and his girlfriend, Silvia, ready to face even tougher enemies and greater challenges. This time around, not only will gamers be able to play as Joe, but as Silvia right off the bat as well. In addition to being equipped with her pompoms,At the beginning of this new adventure, we find Joe and his girlfriend, Silvia, ready to face even tougher enemies and greater challenges. This time around, not only will gamers be able to play as Joe, but as Silvia right off the bat as well. In addition to being equipped with her pompoms, Silvia will be packing some heat as she wields a projectile weapon to help defeat the encroaching evil that lurks in the shadows. Keeping to the stylized yet richly detailed visuals, Viewtiful Joe 2 stays true to its masterfully crafted roots and delivers an even more brilliant and polished videogame. New cinematic visual effect (VFX) powers, such as ?Replay? which allows gamers to repeat a part of the action for heroic results, have been implemented to help solve ingenious puzzles, defeat unique yet relentless enemies and add variety to gameplay: Spanning across an increased number of stages and environments including a jungle, snowy mountains and outer space, Viewtiful Joe 2 incorporates more impressive quasi 2D/3D action with over 40 new types of adversaries to obliterate. The not-so-average-Joe will once again break the gaming mold and deliver an experience unlike any other with his polished martial arts attacks, high-flying acrobatics, and compelling storyline. [Capcom]… Expand"}, {"name": "Tony Hawk's Underground", "details_link": "https://www.metacritic.com/game/xbox/tony-hawks-underground", "publisher": "Activision", "release_date": "Oct 27 2003", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/ad710fbe0136257872cd9cc77b1e8dfb-98.jpg", "descriptions": "Get ready for a major new step for the Tony Hawk series.  Tony Hawk's Underground tweaks the gameplay of previous installments to include a plot-twisting story, customizable tricks and decks, online play, and the ability to include your own mug shot on your custom player.  Of course, you canGet ready for a major new step for the Tony Hawk series.  Tony Hawk's Underground tweaks the gameplay of previous installments to include a plot-twisting story, customizable tricks and decks, online play, and the ability to include your own mug shot on your custom player.  Of course, you can also play as any one of pro skating's biggest stars including Tony Hawk, Bob Burnquist, and Elissa Steamer.  Ride, walk, or drive through nine expansive levels then test your skills against other gamers online.  Become a star of the Underground.… Expand"}, {"name": "WWE SmackDown! Here Comes the Pain", "details_link": "https://www.metacritic.com/game/playstation-2/wwe-smackdown!-here-comes-the-pain", "publisher": "THQ", "release_date": "Oct 27 2003", "developers": ["Yuke's"], "platforms": "PlayStation 2", "num_players": "1-6 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 85, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/0/d6d8fcb2c69852c16617203bd8e9b436-98.jpg", "descriptions": "Features an exclusive story mode with original storylines developed by WWE. Unique Superstar abilities featuring real-life attributes of strength, submission, technique, speed and stamina. New and improved controls including an in-depth countering and interactive submission system. All-newFeatures an exclusive story mode with original storylines developed by WWE. Unique Superstar abilities featuring real-life attributes of strength, submission, technique, speed and stamina. New and improved controls including an in-depth countering and interactive submission system. All-new match types including Bra & Panty, First Blood and Elimination Chamber. Enhanced production values feature dynamic camera transitions, an improved audio experience, Superstar voice over and more-realistic animations. [THQ]… Expand"}, {"name": "Tony Hawk's Pro Skater 4", "details_link": "https://www.metacritic.com/game/game-boy-advance/tony-hawks-pro-skater-4", "publisher": "Activision", "release_date": "Oct 28 2002", "developers": ["Vicarious Visions"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 85, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/10a5a443f7766690c0aaf35eba8e4e7e-98.jpg", "descriptions": "Drop into the ultimate challenge.  In the next chapter in the Tony Hawk series, pros challenge you to make your mark in huge free-roaming levels, taking on 190 progressively harder goals with no time limits to hold you back.  Decide when you're ready to take on your Pro Challenge and moveDrop into the ultimate challenge.  In the next chapter in the Tony Hawk series, pros challenge you to make your mark in huge free-roaming levels, taking on 190 progressively harder goals with no time limits to hold you back.  Decide when you're ready to take on your Pro Challenge and move into the pro ranks, where it's a whole new game.  Build your skills, perform all-new tricks, play up to eight players online, and show that you've got what it takes to go Pro.  … Expand"}, {"name": "Hot Shots Golf 3", "details_link": "https://www.metacritic.com/game/playstation-2/hot-shots-golf-3", "publisher": "SCEA", "release_date": "Mar 11 2002", "developers": ["Clap Hanz"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/e24e905fe1f882f865af27628bcbdca4-98.jpg", "descriptions": "Join the new cast of characters who come to tee off on the greens and on each other with trash-talking quips. The new swing Meter will test your skills with a variety of interfaces depending on the lie of the ball, whether it is in the fairway, rough, treeline, dirt or sand trap. Earn \"HotJoin the new cast of characters who come to tee off on the greens and on each other with trash-talking quips. The new swing Meter will test your skills with a variety of interfaces depending on the lie of the ball, whether it is in the fairway, rough, treeline, dirt or sand trap. Earn \"Hot Shot Points\" for superb performances, great shots and remarkable putts to use towards enhanced golf equipment and insane golf gadgets. [SCEA]… Expand"}, {"name": "Monopoly Tycoon", "details_link": "https://www.metacritic.com/game/pc/monopoly-tycoon", "publisher": "Atari", "release_date": "Sep 24 2001", "developers": ["Deep Red"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Miscellaneous", "Tycoon", "Management", "Tycoon", "Board / Card Game", "Business / Tycoon"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/e0992c3d4526269dfabf1768e036ebd8-98.jpg", "descriptions": "A simulation game where the traditional fantasy of \"owning it all\" is taken to the next level. Plan, invest, build, demolish, and bankrupt your opponents in a real time 3D environment. Construct a fabulous upscale apartment building on Park Place or start a department store chain on BalticA simulation game where the traditional fantasy of \"owning it all\" is taken to the next level. Plan, invest, build, demolish, and bankrupt your opponents in a real time 3D environment. Construct a fabulous upscale apartment building on Park Place or start a department store chain on Baltic or Mediterranean. It's all about money ? and making more of it than your opponents.  [Infogrames]… Expand"}, {"name": "FIFA 2001 Major League Soccer", "details_link": "https://www.metacritic.com/game/playstation/fifa-2001-major-league-soccer", "publisher": "EA Sports", "release_date": "Nov 14 2000", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation"], "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/027f5ed26d1cc9090ca175b751e69804-98.jpg", "descriptions": "Though FIFA 2001 is a solid enough game in its own right, the game's lack of innovation or significant upgrades keeps it from having the same impact as FIFA 2000."}, {"name": "Indigo Prophecy", "details_link": "https://www.metacritic.com/game/pc/indigo-prophecy", "publisher": "Atari", "release_date": "Sep 20 2005", "developers": ["Quantic Dream"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/332d57d3c00008e3ea1662d4dd582d5d-98.jpg", "descriptions": "(Also known as \"Fahrenheit\")  New York, January 2009. For no apparent reason, ordinary people are killing total strangers in public places. Although there is no link between the murderers, they all seem to respect exactly the same ritual and pattern. Lucas Kane becomes another of these(Also known as \"Fahrenheit\")  New York, January 2009. For no apparent reason, ordinary people are killing total strangers in public places. Although there is no link between the murderers, they all seem to respect exactly the same ritual and pattern. Lucas Kane becomes another of these murderers when he kills a stranger in the men's room of a restaurant. Haunted by strange visions, he must keep one step ahead of the police to find out what is happening to him. Inspector Carla Valenti and her teammate agent Tyler Miles are in charge of the investigation. A series of disturbing clues projects them into a world they had never even dreamed of. Meanwhile, the early onset of winter paralyses Manhattan in an unbearable fury of cold and snow. Each day the temperature drops, as a coat of brilliant white snow is drawn over the dark streets of New York. One thing is sure : The final countdown has already begun. Indigo Prophecy creates a new breed of interactive entertainment, merging cinema and interactivity. A spectacular real-time 3D adventure with state-of-the-art camera direction and multi-path scenario. Play different protagonists in this epic quest and make the story progress depending on YOUR decisions. Control different characters in an awe-inspiring paranormal thriller, discern the dark secrets behind mysterious serial killings, understand why the city is brought to a standstill by snow and dropping temperatures, Play the hunter and the fugitive : explore, interact, fight and confront by all means dark forces during your journey. After Indigo Prophecy, the world just can't be the same place again. [Quantic Dream]… Expand"}, {"name": "Prince of Persia: The Two Thrones", "details_link": "https://www.metacritic.com/game/pc/prince-of-persia-the-two-thrones", "publisher": "Ubisoft", "release_date": "Dec  1 2005", "developers": ["Ubisoft"], "platforms": ["PlayStation 2", "PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "Fantasy", "Linear"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/d0500c24e7083a65a2f2ec019d63642f-98.jpg", "descriptions": "The Prince of Persia, a seasoned warrior, returns from the Island of Time to Babylon with his love, Kaileena. Instead of the peace that he longs for, he finds his homeland ravaged by war and the kingdom turned against him. The Prince is rapidly captured and Kaileena has no choice but toThe Prince of Persia, a seasoned warrior, returns from the Island of Time to Babylon with his love, Kaileena. Instead of the peace that he longs for, he finds his homeland ravaged by war and the kingdom turned against him. The Prince is rapidly captured and Kaileena has no choice but to sacrifice herself and unleash the Sands of Time in order to save him. Now cast out on the streets and hunted as a fugitive, the Prince soon discovers that past battles have given rise to a deadly Dark Prince, whose spirit gradually possesses him. Play and master two distinct characters: Wield the powers and weapons of two master warriors with different combat styles, attitudes, and histories. Choose your way to fight: Master the expanded Free-Form Fighting system to destroy enemies in your own style; strangle enemies from afar with the deadly Daggertail; or surprise them with full-speed one-shot kills using a brand new stealth art. The choice is yours. Battle freely through Babylon: Dominate enemies on the perilous rooftops, dodge through chaotic streets, and ambush pursuers in dark, underground passageways. Immerse yourself in a dramatic story: Experience unparalleled depth in storytelling as you fight your way through a twisting tale filled with adrenaline, tension and discovery. Manipulate time to surprise enemies: Execute powerful attacks against entire armies by slowing down or rewinding time, or surprise them by using some all-new Sands of Time powers. Experience a masterful blend of gameplay: True to the Prince of Persia; franchise, the game provides a variety of action combat, agility and story-driven puzzles - all masterfully blended together into a rich gaming experience. [Ubisoft]… Expand"}, {"name": "Sam & Max Episode 204: Chariots of the Dogs", "details_link": "https://www.metacritic.com/game/pc/sam-max-episode-204-chariots-of-the-dogs", "publisher": "Telltale Games", "release_date": "Mar 13 2008", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Point-and-Click", "Third-Person"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/c5962c8567d275811b4c56a4c4743bbc-98.jpg", "descriptions": "Could it be? How could it happen? It’s virtually impossible -- Bosco, proprietor of Bosco’s Inconvenience and ultra-paranoid master of disguise -- is missing! Could it be a kidnapping? What kind of inhuman monstrosity would want Bosco around badly enough to steal him? This could be theCould it be? How could it happen? It’s virtually impossible -- Bosco, proprietor of Bosco’s Inconvenience and ultra-paranoid master of disguise -- is missing! Could it be a kidnapping? What kind of inhuman monstrosity would want Bosco around badly enough to steal him? This could be the toughest case yet for Sam & Max! [GameTap]… Expand"}, {"name": "Marvel vs. Capcom 3: Fate of Two Worlds", "details_link": "https://www.metacritic.com/game/xbox-360/marvel-vs-capcom-3-fate-of-two-worlds", "publisher": "Capcom", "release_date": "Feb 15 2011", "developers": ["Capcom"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 85, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/e9a49c246979ac853ab08b1e7065ce32-98.jpg", "descriptions": "After a decade of waiting, iconic Marvel and Capcom characters join forces again in a re-envisioned team fighting game for a new generation. Fill the shoes of legendary characters from the most beloved franchises in entertainment as you battle in a living comic book brought to life in a VS.After a decade of waiting, iconic Marvel and Capcom characters join forces again in a re-envisioned team fighting game for a new generation. Fill the shoes of legendary characters from the most beloved franchises in entertainment as you battle in a living comic book brought to life in a VS. fighting game for the first time by Capcom’s MT Framework. … Expand"}, {"name": "Assetto Corsa", "details_link": "https://www.metacritic.com/game/pc/assetto-corsa", "publisher": "Kunos Simulazioni", "release_date": "Dec 19 2014", "developers": ["Kunos Simulazioni"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Driving", "General", "GT / Street", "Racing", "Simulation", "Automobile"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/6f6547f78ce0673749f8c235884a86c7-98.jpg", "descriptions": "Assetto Corsa is designed to provide a very realistic driving experience, with single player and multiplayer options, officially licensed cars and tracks developed using Laser scan technology, and the highest level of accuracy possible in reproducing real world motor racing environments.Assetto Corsa is designed to provide a very realistic driving experience, with single player and multiplayer options, officially licensed cars and tracks developed using Laser scan technology, and the highest level of accuracy possible in reproducing real world motor racing environments. Also, Assetto Corsa allows for considerable customisation and modification, in order to satisfy the expectations of professional simracers, gamers who prefer to approach the driving experience more progressively, and hobbyists who just like to collect lots of cars and tracks.… Expand"}, {"name": "Ys VIII: Lacrimosa of DANA", "details_link": "https://www.metacritic.com/game/playstation-4/ys-viii-lacrimosa-of-dana", "publisher": "NIS America", "release_date": "Sep 12 2017", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 5", "PlayStation Vita", "Stadia", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/7fc099300d15e28498d615e204aa78a5-98.jpg", "descriptions": "Adol awakens shipwrecked and stranded on a cursed island. There, he and the other shipwrecked passengers he rescues form a village to challenge fearsome beasts and mysterious ruins on the isolated island."}, {"name": "Machinarium", "details_link": "https://www.metacritic.com/game/pc/machinarium", "publisher": "Amanita Design", "release_date": "Oct 16 2009", "developers": ["Amanita Design"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Third-Person", "General", "Point-and-Click", "Sci-Fi"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/1489dd3ef724fb55bd5471a61ecaeedb-98.jpg", "descriptions": "Machinarium is independent puzzle / adventure game developed by the makers of popular web-games Samorost and Samorost2. A little robot who’s been thrown out to the scrap yard behind the city must return and confront the Black Cap Brotherhood and save his robot-girl friend."}, {"name": "Nioh 2", "details_link": "https://www.metacritic.com/game/playstation-4/nioh-2", "publisher": "Koei Tecmo Games", "release_date": "Mar 13 2020", "developers": ["Team Ninja"], "platforms": "PlayStation 4", "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/3f95eb44da34bdb9c97e2e0a9a1ec0dc-98.jpg", "descriptions": "Master the lethal arts of the samurai as a mysterious half-human, half-supernatural Yokai warrior, in this challenging action RPG sequel. Explore violent Sengoku-era Japan and the deadly Dark Realm, both plagued with grotesque, merciless demons. Unsheathe your deadly weapons and cut down allMaster the lethal arts of the samurai as a mysterious half-human, half-supernatural Yokai warrior, in this challenging action RPG sequel. Explore violent Sengoku-era Japan and the deadly Dark Realm, both plagued with grotesque, merciless demons. Unsheathe your deadly weapons and cut down all enemies in your path using a revamped combat system and the ability to transform into a full Yokai to unleash devastating paranormal powers. … Expand"}, {"name": "Frozen Synapse", "details_link": "https://www.metacritic.com/game/pc/frozen-synapse", "publisher": "Matrix Games", "release_date": "May 26 2011", "developers": ["Mode 7 Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General", "Modern", "Tactics"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/d09dc838b3d3aed607d8a8af91f683a5-98.jpg", "descriptions": "Frozen Synapse is a thrilling PC strategy game that brings the simultaneous turn-based strategy genre bang up-to-date and lets you give detailed, accurate orders to your squad. Plan your moves, test them out, then hit the \"Execute\" button: both you and your enemy's turns areFrozen Synapse is a thrilling PC strategy game that brings the simultaneous turn-based strategy genre bang up-to-date and lets you give detailed, accurate orders to your squad. Plan your moves, test them out, then hit the \"Execute\" button: both you and your enemy's turns are executed simultaneously.… Expand"}, {"name": "Champions of Norrath", "details_link": "https://www.metacritic.com/game/playstation-2/champions-of-norrath", "publisher": "Sony Online Entertainment", "release_date": "Feb 10 2004", "developers": ["Snowblind Studios"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/b7ee559da309faceaacda4c1f5f4b477-98.jpg", "descriptions": "Create your own champions, each with unique powers, appearances and skills in this Action RPG. Experience an epic adventure filled with powerful action and ominous intrigue. Battle vicious monsters where your mastery of weaponry and spells is the only thing between you and the supremacy ofCreate your own champions, each with unique powers, appearances and skills in this Action RPG. Experience an epic adventure filled with powerful action and ominous intrigue. Battle vicious monsters where your mastery of weaponry and spells is the only thing between you and the supremacy of evil. Champions of Norrath allows gamers to create their own unique hero to journey from the city of Faydwer into the wilds of Norrath to save the land from a gathering army of evil orcs and goblins. Players can adventure alone or with a band of up to three other players either over the Internet or on a single PlayStation 2 system with a Multitap. Import player characters into friends' games using a memory card and then take them home to play solo--the play options offer console gamers the freedom to play anytime and from any location. Champions of Norrath offers players more than 100 hours of gameplay per player character, unlimited battles, deadly missions and unmatched character customization in an enthralling fantasy world. [Sony Online Entertainment]… Expand"}, {"name": "F1 2016", "details_link": "https://www.metacritic.com/game/xbox-one/f1-2016", "publisher": "Codemasters", "release_date": "Aug 19 2016", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 22 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/e6dfc923969a52a9ba566b79109c5200-98.jpg", "descriptions": "Includes the full 2016 season calendar of 21 tracks, including the brand new Baku circuit in Azerbaijan, and the full roster of 22 drivers and 11 teams, including the new Haas F1 Team. F1 2016 immerses you in not only the on-track excitement of a FORMULA ONE career, including the inclusionIncludes the full 2016 season calendar of 21 tracks, including the brand new Baku circuit in Azerbaijan, and the full roster of 22 drivers and 11 teams, including the new Haas F1 Team. F1 2016 immerses you in not only the on-track excitement of a FORMULA ONE career, including the inclusion of the iconic Safety Car and also the Virtual Safety Car for the first time, but also uniquely offers the drama and vehicle development that goes on behind the scenes. Work with your agent, engineer and team to develop your car in the deepest ever career experience, spanning up to ten seasons. Forge your own path to glory, and rise to be the champion. … Expand"}, {"name": "Valkyria Chronicles", "details_link": "https://www.metacritic.com/game/pc/valkyria-chronicles", "publisher": "Sega", "release_date": "Nov 11 2014", "developers": ["Sega"], "platforms": ["PlayStation 3", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Historic", "Strategy", "Turn-Based", "Tactics"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/4f2b6989e3b3b053414490d7e0de5d5e-98.jpg", "descriptions": "Includes all previously released downloadable content. Set in a fictitious continent harkening back to the 1930s, Valkyria Chronicles highlights a Europe divided in two and governed by two powers: the Empire and the Federation. The Empire has designs on invading the small neutral country ofIncludes all previously released downloadable content. Set in a fictitious continent harkening back to the 1930s, Valkyria Chronicles highlights a Europe divided in two and governed by two powers: the Empire and the Federation. The Empire has designs on invading the small neutral country of Gallia, located between the two superpowers' territories, in an attempt to secure precious natural resources. Amidst this struggle a hero named Welkin, and his fellow soldiers of the Federation's Seventh Platoon, are fighting back against the invasion and the Empires attempts to unify the continent under its power.… Expand"}, {"name": "The Witcher 3: Wild Hunt - Complete Edition", "details_link": "https://www.metacritic.com/game/switch/the-witcher-3-wild-hunt---complete-edition", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 15 2019", "developers": ["Saber Interactive", "CD Projekt Red Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/793f6a24fd8c7435688ab04c75f02c6c-98.jpg", "descriptions": "AKA \"Switcher 3\".... A whole world to explore, at home and on the go. The Witcher 3: Wild Hunt is a story-driven, open world adventure set in a dark fantasy universe. You are Geralt of Rivia, mercenary monster slayer. At your disposal is every tool of the trade: razor-sharp swords, lethalAKA \"Switcher 3\".... A whole world to explore, at home and on the go. The Witcher 3: Wild Hunt is a story-driven, open world adventure set in a dark fantasy universe. You are Geralt of Rivia, mercenary monster slayer. At your disposal is every tool of the trade: razor-sharp swords, lethal mixtures, stealthy crossbows, and powerful combat magic. Before you stands a war-torn, monster-infested continent you can explore at will. Your current contract? Tracking down the Child of Prophecy, a living weapon that can alter the shape of the world.\r The Complete Edition contains every piece of downloadable content released for the game, including two massive story expansions: Hearts of Stone & Blood and Wine. It's the perfect opportunity to enter this world for the first time or relive the adventure on the go!\r Features:\r * A gigantic open world to explore.\r Visit the luxurious and corrupt city of Novigrad, face the frigid cold of the wind-swept Skellige islands, and challenge the dark forces roaming the forlorn, ravaged No Man's Land. Sail through open seas, dive in search of long lost artifacts or gallop your mount into combat the world of the Witcher beckons to be explored.\r * Unparalleled novel-like story spanning over 150 hours of gameplay.\r With over 100 hours of core and side-quest gameplay and over 50 hours of additional content, The Witcher 3: Wild Hunt combines the intense, plot-driven pull of traditional RPGs with the freedom of choice only open world games can offer. Make choices and face their consequences to unlock endings tailored to how you play.\r * Now on Switch play at home and on the go.\r Developed to take advantage of everything Nintendo Switch has to offer, the game delivers a truly powerful on-the-go experience.… Expand"}, {"name": "Monster Hunter Rise: Sunbreak", "details_link": "https://www.metacritic.com/game/switch/monster-hunter-rise-sunbreak", "publisher": "Capcom", "release_date": "Jun 30 2022", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/3/d3e4200b87db1a30f3684efca8d7db73-98.jpg", "descriptions": "Monster Hunter Rise: Sunbreak is an expansion to the original Monster Hunter Rise. Featuring improved gameplay and nimble-feeling additions to combat mechanics, unique new monsters and hunting locales, and a new difficulty level in the form of Master Rank quests. As the hunter who savedMonster Hunter Rise: Sunbreak is an expansion to the original Monster Hunter Rise. Featuring improved gameplay and nimble-feeling additions to combat mechanics, unique new monsters and hunting locales, and a new difficulty level in the form of Master Rank quests. As the hunter who saved Kamura from calamity, you must now journey to the far-off reaches of Elgado, an outpost near a Kingdom beset by a sinister new nemesis—the elder dragon Malzeno! Kamura Village is finally at peace, having fought off an onslaught of monsters attacks known as the Rampage. That hard-earned peace is disrupted by the unexpected appearance of the wolf-like monster Lunagaron in the Shrine Ruins. In the Shrine Ruins, the hunter meets Fiorayne, a knight of the Royal Order. Fiorayne asks for the hunter's help in investigating why monsters from the Kingdom are becoming violently aggressive and invading other territories, including Kamura. United in mission, they set off for the far-off outpost of Elgado. … Expand"}, {"name": "Freelancer", "details_link": "https://www.metacritic.com/game/pc/freelancer", "publisher": "Microsoft Game Studios", "release_date": "Mar  3 2003", "developers": ["Digital Anvil"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 85, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/436e50cf85072ffc9602dd39a3ecf3cf-98.jpg", "descriptions": "A society taking its first timid steps into 48 sprawling galactic systems cannot hope to dam every human spring of greed and bloodlust. Make your own way, Freelancer. Ply the trade lanes for profit or raid them for plunder; slake your own thirst for vengeance on the world or take up arms toA society taking its first timid steps into 48 sprawling galactic systems cannot hope to dam every human spring of greed and bloodlust. Make your own way, Freelancer. Ply the trade lanes for profit or raid them for plunder; slake your own thirst for vengeance on the world or take up arms to enforce the law. Take your wealth as a hired gun if you choose. No single truth rules the limitless possibility of space. [Microsoft]… Expand"}, {"name": "Guitar Hero 5", "details_link": "https://www.metacritic.com/game/xbox-360/guitar-hero-5", "publisher": "Activision", "release_date": "Sep  1 2009", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "8  Online", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 85, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/6059a1bd104a1773a9277b037b88f4bb-98.jpg", "descriptions": "For the first time ever, players can customize the make-up of their band by rocking with any combination of instruments in-game: whether it be two guitars and two drums, or three guitars and a microphone, any combination is possible, allowing players to experience music their own way. BrandFor the first time ever, players can customize the make-up of their band by rocking with any combination of instruments in-game: whether it be two guitars and two drums, or three guitars and a microphone, any combination is possible, allowing players to experience music their own way. Brand new, innovative, easy-to-use gameplay modes like Party Play and RockFest put fun, competition and control at center stage as fans tailor the Guitar Hero experience to match their personal style and interests. For extended hours of entertainment, downloadable content from Guitar Hero World Tour is compatible with the game and can automatically be updated to include all of the upgrades and enhancements of Guitar Hero 5. Guitar Hero 5 features the strongest, most varied set list to-date comprised of master tracks from 85 of the hottest bands of today and the biggest classic acts including; Kings of Leon, The Rolling Stones, The White Stripes, Santana, Vampire Weekend, Tom Petty, Johnny Cash, Bob Dylan, plus more than 25 artists from a variety of music genres that are making their music video game debut. Among the first-time-ever features of Guitar Hero 5 are: Party Play, where players can jump in or drop out of gameplay seamlessly; RockFest, a comprehensive competitive experience available featuring five new head-to-head modes playable online or in your living room; and the ability to play the entire set-list from the first time the game is turned on. Guitar Hero 5 refines the player experience, enhances the art style and redesigns core features such as GHMusic StudioSM, making it the most accessible, fun-to-play and authentic experience for seasoned music gamers as well as first-time players. New innovations such as Band Moments, where bands are rewarded for hitting special note streams together and song challenges where gamers are tasked to play through a song a specific way, add a new competitive layer of excitement and accomplishment to the music rhythm genre. [Activision]… Expand"}, {"name": "Bayonetta & Vanquish", "details_link": "https://www.metacritic.com/game/playstation-4/bayonetta-vanquish", "publisher": "Sega", "release_date": "Feb 18 2020", "developers": ["PlatinumGames"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 85, "users_score": 9.3, "image": "https://static.metacritic.com/images/products/games/1/9432b6ed3605c28f48249dfa587af984-98.jpg", "descriptions": "Celebrate the 10th Anniversary of two PlatinumGames cult classics with the Bayonetta & Vanquish 10th Anniversary Bundle. Bayonetta: Experience the genesis of the Bayonetta series with the cult classic, original action-adventure game. Vanquish: The hit sci-fi shooter returns. An overpopulatedCelebrate the 10th Anniversary of two PlatinumGames cult classics with the Bayonetta & Vanquish 10th Anniversary Bundle. Bayonetta: Experience the genesis of the Bayonetta series with the cult classic, original action-adventure game. Vanquish: The hit sci-fi shooter returns. An overpopulated Earth suffocating under limited resources looks to Providence, the solar-powered space colony for support. … Expand"}, {"name": "Zenzizenzic", "details_link": "https://www.metacritic.com/game/pc/zenzizenzic", "publisher": "Adult Swim", "release_date": "Jul 23 2015", "developers": ["Ruud Koorevaar"], "platforms": "PC", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 85, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/6913dca39b3140a90931ab62f2542f16-98.jpg", "descriptions": "Zenzizenzic is a fast-paced twin stick bullet hell shoot 'em up and open world roguelike. Featuring an abstract art style and a thumping, soundtrack, it promises to get your thumbs sweating and your blood pumping."}, {"name": "NBA Jam: On Fire Edition", "details_link": "https://www.metacritic.com/game/xbox-360/nba-jam-on-fire-edition", "publisher": "Electronic Arts", "release_date": "Oct  5 2011", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/2c043fe3906e1590d2b783a53bbffd32-98.jpg", "descriptions": "NBA JAM: On Fire Edition will feature exciting new gameplay enhancements, including ground-breaking artificial intelligence that will change the way gamers play NBA JAM."}, {"name": "Galactic Civilizations III: Crusade", "details_link": "https://www.metacritic.com/game/pc/galactic-civilizations-iii-crusade", "publisher": "Stardock", "release_date": "May  4 2017", "developers": ["Stardock"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 85, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/b559fce0403553d0044c8661c6676170-98.jpg", "descriptions": "Experience a new side of Galactic Civilizations III with the Crusade expansion. Discover your enemy’s weak points with espionage, actively invade and conquer planets, and help talented citizens rise to power and drive your civilization into a golden age. With a detailed civilization builderExperience a new side of Galactic Civilizations III with the Crusade expansion. Discover your enemy’s weak points with espionage, actively invade and conquer planets, and help talented citizens rise to power and drive your civilization into a golden age. With a detailed civilization builder tool for Steam workshop, espionage, revamped invasions, Galactic Citizens system, new races and civilizations, and more, Crusade adds a host of depth for Galactic Civilizations III.… Expand"}, {"name": "The Wolf Among Us: Episode 1 - Faith", "details_link": "https://www.metacritic.com/game/pc/the-wolf-among-us-episode-1---faith", "publisher": "Telltale Games", "release_date": "Oct 11 2013", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Fantasy", "General", "Fantasy", "Point-and-Click"], "meta_score": 85, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/7/f6e8940900f333ad4a97c1fe930969db-98.jpg", "descriptions": "The Wolf Among Us is a 5-episode series from the creators of The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore and legend are real and exist inThe Wolf Among Us is a 5-episode series from the creators of The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore and legend are real and exist in our world. As Bigby Wolf - THE big bad wolf in human form - you discover that the brutal, bloody murder of a Fable is just a taste of things to come, in a game series where your every decision can have enormous consequences. Your choices matter: it’s not only WHAT you choose to do that will affect how your story plays out, but WHEN you choose to do it. A mature and gritty take on characters from fairy tales, legends and folklore who have escaped into our world. These are not the characters you’d see on a little child’s lunchbox. Play as Bigby Wolf: formerly the most feared monster among the Fables, now Sheriff of Fabletown and protector of those he used to hunt. He must restrain the beast within if he is to earn the trust of those around him. Choose Bigby’s actions carefully. Will you approach a situation calmly or unleash your inner rage? The way you act will determine how others respond to you. Set before the events seen in the first issue of the comics – you don’t have to know the characters or the world to play. [Telltale Games]… Expand"}, {"name": "Final Fantasy IV Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/final-fantasy-iv-advance", "publisher": "Nintendo", "release_date": "Dec 12 2005", "developers": ["TOSE"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/778a4101e192df2a4eb41160ece16764-98.jpg", "descriptions": "Final Fantasy II for the Super Nintendo is back on the Game Boy Advance as Final Fantasy IV Advance. This game is a faithful port of the Super Nintendo game (called Final Fantasy IV in Japan) with some graphical improvements. You can play as Cecil, a soldier who has defected from darkFinal Fantasy II for the Super Nintendo is back on the Game Boy Advance as Final Fantasy IV Advance. This game is a faithful port of the Super Nintendo game (called Final Fantasy IV in Japan) with some graphical improvements. You can play as Cecil, a soldier who has defected from dark knighthood to rid the land of evil. Final Fantasy II was one of the first games to set the standard for the Square Enix style of RPGs.… Expand"}, {"name": "SteamWorld Dig 2", "details_link": "https://www.metacritic.com/game/pc/steamworld-dig-2", "publisher": "Image & Form", "release_date": "Sep 22 2017", "developers": ["Image & Form"], "platforms": ["3DS", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "2D", ""], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/0b534bffe24e47f5a01bf26b520cb843-98.jpg", "descriptions": "SteamWorld Dig is back! Dig deep, gain riches and unearth the terrors of the underworld in this platform mining adventure influenced by classic Metroidvania style games."}, {"name": "Robo Recall", "details_link": "https://www.metacritic.com/game/pc/robo-recall", "publisher": "Epic Games", "release_date": "Mar  1 2017", "developers": ["Epic Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Light Gun"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/c127dd5718fd87ecf25a3dd174127197-98.jpg", "descriptions": "An eruption of defective, homicidal robots is inundating RoboReady customer service, where you’ve been promoted from tech repairman to Recaller. Thrown into the fray, you must rely on your wits, reflexes and a vast arsenal of weaponry to eliminate the robot uprising. Use creative combatAn eruption of defective, homicidal robots is inundating RoboReady customer service, where you’ve been promoted from tech repairman to Recaller. Thrown into the fray, you must rely on your wits, reflexes and a vast arsenal of weaponry to eliminate the robot uprising. Use creative combat tactics and skill shots to earn high scores as you teleport through city streets and rooftops in an awe-inspiring ballet of bullets. Tear apart your robot foes and use them to fend off the enemy onslaught. Unlock, customize and test weapons before taking on challenges that put your newfound skills to the test. [Epic Games]… Expand"}, {"name": "Super Stardust HD", "details_link": "https://www.metacritic.com/game/playstation-3/super-stardust-hd", "publisher": "SCEA", "release_date": "Jun 28 2007", "developers": ["Housemarque"], "platforms": "PlayStation 3", "num_players": "1-2 ", "genres": ["Action", "General", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/b35a3f69d7dfadc58a14bf84f3a7f5e2-98.jpg", "descriptions": "[Downloadable Game]  Super Stardust HD for the PS3 is a fully updated version of the classic game Stardust. Your mission is simple: destroy everything in sight. Twelve years have passed by. The times have been peaceful and prosperous in the home solar system. Not a single sign of evil[Downloadable Game]  Super Stardust HD for the PS3 is a fully updated version of the classic game Stardust. Your mission is simple: destroy everything in sight. Twelve years have passed by. The times have been peaceful and prosperous in the home solar system. Not a single sign of evil penguin Professor Schaumund or his sinister forces have been detected. That is, of course, until today...The Professor is back for the most ultimate revenge. You must defeat his forces and save your home solar system from total annihilation. Five planets are under attack. Your destiny is to save the home solar system, yet again. With five highly detailed 3D planets to save, hordes of enemies and asteroids to destroy, and various game play modes, Super Stardust HD presents super intense action. [Sony]… Expand"}, {"name": "Sine Mora", "details_link": "https://www.metacritic.com/game/playstation-vita/sine-mora", "publisher": "Digital Reality", "release_date": "Nov 20 2012", "developers": ["Digital Reality", "Grasshopper Manufacture"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "PlayStation Vita"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/5c67b4273d0f5442377b385d9ad126b1-98.jpg", "descriptions": "Co-developed by Grasshopper Manufacture and Digital Reality, and published by Microsoft Studios, Sine Mora is a dieselpunk shoot 'em up that provides a unique take on the genre, where time is the ultimate factor. Mixing classic shooter sensibilities with next-gen presentation, Sine Mora is aCo-developed by Grasshopper Manufacture and Digital Reality, and published by Microsoft Studios, Sine Mora is a dieselpunk shoot 'em up that provides a unique take on the genre, where time is the ultimate factor. Mixing classic shooter sensibilities with next-gen presentation, Sine Mora is a gorgeous shmup that appeals to both hardcore and casual gamers alike. Coming exclusively to Xbox LIVE Arcade, Sine Mora features over 60 combinations of planes, characters and time manipulation devices to complete every beautifully-crafted stage with scaling difficulty. All of this is set to an epic score of soaring heights, composed by Akira Yamaoka, acclaimed for his works on Shadows of the Damned and the Silent Hill series.… Expand"}, {"name": "Super Paper Mario", "details_link": "https://www.metacritic.com/game/wii/super-paper-mario", "publisher": "Nintendo", "release_date": "Apr  9 2007", "developers": ["Intelligent Systems"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Platformer", "Platformer", "Action RPG", "3D", "3D"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/bb69f7ea54a35780af0ed04fbbb3147e-98.jpg", "descriptions": "The newest chapter of the Paper Mario story isn't just out of this world ... it's out of this dimension. What at first glance appears to be a 2-D sidescroller ripped straight from the pages of the Paper Mario universe soon turns into a 3-D action-adventure that defies all video game logic.The newest chapter of the Paper Mario story isn't just out of this world ... it's out of this dimension. What at first glance appears to be a 2-D sidescroller ripped straight from the pages of the Paper Mario universe soon turns into a 3-D action-adventure that defies all video game logic. Fusing 2-D and 3-D perspectives, not to mention RPG and platformer elements, the game slips back and forth between dimensions. The action sprawls across eight worlds filled with traps, puzzles, bizarre mysteries and items that often draw themselves out of thin air. Oh, and just because Mario's in the title doesn't mean he's the only star – players also get to play as Peach and Bowser. [Nintendo]… Expand"}, {"name": "Mega Man Legacy Collection", "details_link": "https://www.metacritic.com/game/pc/mega-man-legacy-collection", "publisher": "Capcom", "release_date": "Aug 24 2015", "developers": ["Digital Eclipse"], "platforms": ["3DS", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/c4e2fca675c32dd439f12246754eef4f-98.jpg", "descriptions": "Featuring reproductions of the series origins with the original six Mega Man games, the Legacy Collection should remind long-time fans and introduce newcomers to what made Mega Man such a popular and iconic character. Mega Man Legacy Collection will feature all six games and more. InFeaturing reproductions of the series origins with the original six Mega Man games, the Legacy Collection should remind long-time fans and introduce newcomers to what made Mega Man such a popular and iconic character. Mega Man Legacy Collection will feature all six games and more. In addition to the six Mega Man games, Mega Man Legacy Collection features new ways to experience the classic games with the Museum Mode and new Challenge Mode. Challenge Mode remixes gameplay segments from all six games, with plenty of scaling difficulty objectives for experienced players to conquer yet serving as a good starting point for new players, too. Museum Mode contains a comprehensive collection of history, high-res art and original concept pieces.… Expand"}, {"name": "Star Wars: Rogue Squadron", "details_link": "https://www.metacritic.com/game/nintendo-64/star-wars-rogue-squadron", "publisher": "LucasArts", "release_date": "Nov 17 1998", "developers": ["Factor 5"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/97ae599a8ff5cd2526c9cd970fcde7d7-98.jpg", "descriptions": "Fly against the evil Empire! As Luke Skywalker, co-founder of the Rebel Alliance's elite Rogue Squadron, you must combat the evil Galactic Empire! Engage in intense, fast-paced planetary air-to-ground and air-to-air missions - dogfights, search and destroy, reconnaissance, bombing runs,Fly against the evil Empire! As Luke Skywalker, co-founder of the Rebel Alliance's elite Rogue Squadron, you must combat the evil Galactic Empire! Engage in intense, fast-paced planetary air-to-ground and air-to-air missions - dogfights, search and destroy, reconnaissance, bombing runs, rescue assignments and more! Pilot X-wings, Y-wings, A-wings, V-wings and Snowspeeders with powerful weapons in over 15 missions battling TIE fighters, TIE bombers, Imperial shuttles, AT-AT walkers, AT-STs and other challenging foes.… Expand"}, {"name": "Football Manager 2022", "details_link": "https://www.metacritic.com/game/pc/football-manager-2022", "publisher": "Sega", "release_date": "Nov  9 2021", "developers": ["Sports Interactive"], "platforms": ["iPhone/iPad", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Sports", "Team", "Soccer", "Management"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/290253eb0ec728d9a05c9dc4bf116d3b-98.jpg", "descriptions": "M22 brings new, progressive ways to find that winning edge, instil your footballing style and earn it for the fans. Pack includes an FM 'Coaching Planner' to take your tactical planning and squad building to the next level. Football isn't just about winning - it's about overcoming the oddsM22 brings new, progressive ways to find that winning edge, instil your footballing style and earn it for the fans. Pack includes an FM 'Coaching Planner' to take your tactical planning and squad building to the next level. Football isn't just about winning - it's about overcoming the odds and earning your success. Fighting your way to the top or clawing your way back from the brink; these are the moments that taste sweetest. In Football Manager 2022, you're the architect of your club's destiny - the fans' fortunes rest with you. Prevail in the moments that matter to turn their dreams into reality and earn your place alongside the managerial greats. … Expand"}, {"name": "Two Point Hospital", "details_link": "https://www.metacritic.com/game/switch/two-point-hospital", "publisher": "Sega", "release_date": "Feb 25 2020", "developers": ["Two Point Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Management", "Virtual", "Career", "Business / Tycoon"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/acc72a0473d8e913e4a0ee6c577da121-98.jpg", "descriptions": "Build up a hospital from nothing to a masterpiece as you design the most beautiful - or functional - healthcare operation in the whole of Two Point County. Optimize your hospital design to increase patient (and cash) flow, arranging corridors, rooms and waiting areas to your exactBuild up a hospital from nothing to a masterpiece as you design the most beautiful - or functional - healthcare operation in the whole of Two Point County. Optimize your hospital design to increase patient (and cash) flow, arranging corridors, rooms and waiting areas to your exact specifications. Expand your hospital to multiple buildings as you look to get as many patients through the door as possible. Place decorative and functional items around your hospital to improve its prestige, lower patient boredom, increase happiness and keep those end of year awards flowing in.… Expand"}, {"name": "Far Cry 2", "details_link": "https://www.metacritic.com/game/pc/far-cry-2", "publisher": "Ubisoft", "release_date": "Oct 21 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 85, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/1b883343974c761585aea3033ad9e48b-98.jpg", "descriptions": "Caught between two rival factions in war-torn Africa, you are sent to take out \"The Jackal,\" a mysterious character who has rekindled the conflict between the warlords, jeopardizing thousands of lives. In order to fulfil your mission you will have to play the factions against each other,Caught between two rival factions in war-torn Africa, you are sent to take out \"The Jackal,\" a mysterious character who has rekindled the conflict between the warlords, jeopardizing thousands of lives. In order to fulfil your mission you will have to play the factions against each other, identify and exploit your their weaknesses, and neutralize their superior numbers and firepower with surprise, subversion, cunning and, of course, brute force. Real-time story telling, systemic auto-healing, minimal in-game interface are just few of the features that make you feel the tension of being alone against barbarous warlords that threaten thousands of innocent lives. Choose from a wide range of weapons to make your way to your primary target. Meet the fight head-on with your machine-gun, go berserk with your machete or make stealth kills as a Sniper. If you feel that the atmosphere is not warm enough, light up your flamethrower and let your enemies and everything around them feel the heat. [Ubisoft]… Expand"}, {"name": "Professor Layton and the Curious Village", "details_link": "https://www.metacritic.com/game/ds/professor-layton-and-the-curious-village", "publisher": "Nintendo", "release_date": "Feb 10 2008", "developers": ["Level 5"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "Puzzle", "Edutainment", "General", "Puzzle", "General"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/b04b0ff4bea6be1d4aedccfa7826f4e2-98.jpg", "descriptions": "(Also known as \"Layton Kyouju no Fushigi na Machi\" and \"Professor Layton and the Mysterious Village\")  Marking Level 5's first foray onto the DS, Professor Layton is an old-fashioned point-and-click adventure which requires your use of skills such as reasoning, knowledge and creativity to(Also known as \"Layton Kyouju no Fushigi na Machi\" and \"Professor Layton and the Mysterious Village\")  Marking Level 5's first foray onto the DS, Professor Layton is an old-fashioned point-and-click adventure which requires your use of skills such as reasoning, knowledge and creativity to solve various puzzles.… Expand"}, {"name": "Labyrinth of Galleria: The Moon Society", "details_link": "https://www.metacritic.com/game/playstation-5/labyrinth-of-galleria-the-moon-society", "publisher": "NIS America", "release_date": "Feb 14 2023", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 85, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/e233099a637ba9aec8ec6f8031b6345a-98.jpg", "descriptions": "From the creators of Labyrinth of Refrain: Coven of Dusk comes a new tale in the dungeon-exploring adventure filled with charm and mystery!Aided by the master witch Madame Marta, her assistant Eureka, and an army of soul-infused puppets, you are tasked with delving into the depths of aFrom the creators of Labyrinth of Refrain: Coven of Dusk comes a new tale in the dungeon-exploring adventure filled with charm and mystery!Aided by the master witch Madame Marta, her assistant Eureka, and an army of soul-infused puppets, you are tasked with delving into the depths of a mysterious underground labyrinth teeming with enchanted monsters to unearth the treasures and secrets within.… Expand"}, {"name": "The Walking Dead: Episode 3 - Long Road Ahead", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-episode-3---long-road-ahead", "publisher": "Telltale Games", "release_date": "Aug 29 2012", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/b16686f4f85035168fc7cc8c4f9cc8b1-98.jpg", "descriptions": "Episode 3 of a 5-part game series set in Robert Kirkman’s universe. Treachery within the group leads to a devastating series of events. Will the tough choices you made in episodes one and two come back to haunt you or prove to be worthwhile decisions?"}, {"name": "AudioSurf", "details_link": "https://www.metacritic.com/game/pc/audiosurf", "publisher": "Invisible Handlebar", "release_date": "Feb 15 2008", "developers": ["BestGameEver.com"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/a8ead7c3a84bb1ea191f7b04d0344bf2-98.jpg", "descriptions": "Ride your music. Audiosurf is a music-adapting puzzle racer where you use your own music to create your own experience. The shape, the speed, and the mood of each ride is determined by the song you choose. You earn points for clustering together blocks of the same color on the highway, andRide your music. Audiosurf is a music-adapting puzzle racer where you use your own music to create your own experience. The shape, the speed, and the mood of each ride is determined by the song you choose. You earn points for clustering together blocks of the same color on the highway, and compete with others on the internet for the high score on your favorite songs. Audiosurf on Steam includes The Orange Box soundtrack, integrated with the game to enable \"Still Alive\" surfing and more. In addition, Audiosurf is one of the first titles to leverage the recently announced Steamworks, offering full support for the Steam Achievements that appear on Steam Community profile pages. [Valve]… Expand"}, {"name": "Forza Horizon 5: Hot Wheels", "details_link": "https://www.metacritic.com/game/xbox-series-x/forza-horizon-5-hot-wheels", "publisher": "Xbox Game Studios", "release_date": "Jul 19 2022", "developers": ["Playground Games"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/d536ee3c0bf754ac53f42d4ce1838fbf-98.jpg", "descriptions": "Calling all daredevil drivers and creators! Blast off to the visually stunning, exhilarating new Horizon Hot Wheels Park in the clouds high above Mexico.Experience the fastest, most extreme tracks ever devised. Design, build, and share your own Hot Wheels adventure with 80 distinct,Calling all daredevil drivers and creators! Blast off to the visually stunning, exhilarating new Horizon Hot Wheels Park in the clouds high above Mexico.Experience the fastest, most extreme tracks ever devised. Design, build, and share your own Hot Wheels adventure with 80 distinct, snappable track pieces. Race 10 amazing new cars including the lightning fast 2021 Hennessey Venom F5 and the iconic 2000 Hot Wheels Deora II.… Expand"}, {"name": "Final Fantasy X / X-2 HD Remaster", "details_link": "https://www.metacritic.com/game/xbox-one/final-fantasy-x-x-2-hd-remaster", "publisher": "Square Enix", "release_date": "Apr 16 2019", "developers": ["Virtuos"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 85, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/e4976c73e52e128ccae1917668a973a5-98.jpg", "descriptions": "Final Fantasy X tells the story of a star blitzball player, Tidus, who journeys with a young and beautiful summoner named Yuna on her quest to save the world of Spira. Then return in Final Fantasy X-2, join Yuna along with her companions Rikku and Paine on a quest around the world."}, {"name": "Yakuza 0", "details_link": "https://www.metacritic.com/game/playstation-4/yakuza-0", "publisher": "Sega", "release_date": "Jan 24 2017", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/64c226b723557521fc01b9b6c9595cd2-98.jpg", "descriptions": "The story follows Kazuma Kiryu as a junior yakuza member who finds himself in a heap of trouble when a simple debt collection goes upside down and his mark ends up murdered. Meanwhile, Goro Majima is living a \"normal\" life as the proprieter of a cabaret club, but is doing whatever it takesThe story follows Kazuma Kiryu as a junior yakuza member who finds himself in a heap of trouble when a simple debt collection goes upside down and his mark ends up murdered. Meanwhile, Goro Majima is living a \"normal\" life as the proprieter of a cabaret club, but is doing whatever it takes to rejoin the yakuza. What that entails isn't exactly easy.… Expand"}, {"name": "Super Mario 64 DS", "details_link": "https://www.metacritic.com/game/ds/super-mario-64-ds", "publisher": "Nintendo", "release_date": "Nov 20 2004", "developers": ["Nintendo"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/1cb96286caf946e08a6b681477722271-98.jpg", "descriptions": "Super Mario 64, the genre-defining Nintendo 64 classic, arrives on the Nintendo DS with all-new features that take full advantage of the new portable system's dual screens, touch screen and wireless multiplayer capability. Play as Mario, Yoshi, Luigi and even Wario. You'll need to use eachSuper Mario 64, the genre-defining Nintendo 64 classic, arrives on the Nintendo DS with all-new features that take full advantage of the new portable system's dual screens, touch screen and wireless multiplayer capability. Play as Mario, Yoshi, Luigi and even Wario. You'll need to use each one's unique abilities to find 150 Power Stars hidden in the castle and grounds. Play through Adventure mode and try your stylus-wielding hand at tons of new touch-sensitive mini-games. Battle up to three friends in Wireless Versus mode, which you can play with only one Super Mario 64 DS game card. Each of the four main characters has multiple jumping moves that cover great horizontal and vertical distances. Each has unique moves: Yoshi can eat enemies and turn them into eggs that he can throw; Mario can punch, kick and wall-jump to great heights; super-strong Wario can break certain blocks; and Luigi can jump incredibly high. Power Flowers give each character even cooler powers, like invisibility, fire breath or the power to float through the air. [Nintendo]… Expand"}, {"name": "Dead Rising", "details_link": "https://www.metacritic.com/game/xbox-360/dead-rising", "publisher": "Capcom", "release_date": "Aug  8 2006", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Open-World"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/3314b9215766b5d491ef9cdbc1ff3367-98.jpg", "descriptions": "Dead Rising follows the harrowing tale of Frank West, an overly zealous freelance photojournalist on a hunt for the scoop of a lifetime. In pursuit of a juicy lead, he makes his way to a small suburban town only to find that it has become overrun by zombies. He escapes to the local shoppingDead Rising follows the harrowing tale of Frank West, an overly zealous freelance photojournalist on a hunt for the scoop of a lifetime. In pursuit of a juicy lead, he makes his way to a small suburban town only to find that it has become overrun by zombies. He escapes to the local shopping mall, thinking it will be a bastion of safety but it turns out to be anything but. It will be a true struggle to survive the endless stream of enemies, but players will have full reign of a realistic shopping center, utilizing anything they find to fight off the flesh-hungry mob and search for the truth behind the horrendous epidemic. Dead Rising features an open level of freedom and offers a vast array of gameplay possibilities. As part of a real time system, time is dynamic in Dead Rising, marching on whether Frank is actively engaged or if he is stationary. Time also plays a role as zombies become more powerful when the sun goes down. Though they move slowly during the day, the zombies become stronger and faster at night, making it even more dangerous for players to survive. The unprecedented numbers of enemies come in never-ending waves and consist of a diverse population of former humans that have retained some memory of their previous lives, which is reflected in their behavior and appearance. The variety of different stores in the mall offers players an endless supply of resources including vehicles, makeshift weapons and more. Players will also encounter other survivors along the way and by helping them can acquire valuable clues as to what has happened.… Expand"}, {"name": "MLB The Show 17", "details_link": "https://www.metacritic.com/game/playstation-4/mlb-the-show-17", "publisher": "Sony Interactive Entertainment", "release_date": "Mar 28 2017", "developers": ["Sony Interactive Entertainment"], "platforms": "PlayStation 4", "num_players": "Online Multiplayer", "genres": ["Sports", "Team", "Baseball", "Sim"], "meta_score": 85, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/89a4644797df927b0f8a2eec85597be3-98.jpg", "descriptions": "With expanded missions, exclusive rewards, and all new live content\rthat responds quickly to real-life baseball events, there are more ways to enjoy the Diamond Dynasty. Test your deck building skills in all new Events, which challenge you to build a team based on specific event themes."}, {"name": "BattleBlock Theater", "details_link": "https://www.metacritic.com/game/pc/battleblock-theater", "publisher": "The Behemoth", "release_date": "May 15 2014", "developers": ["The Behemoth"], "platforms": ["Xbox 360", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/e75c9d6b004a1eb7557bf233f90eb469-98.jpg", "descriptions": "Shipwrecked. Captured. Betrayed. Forced to perform for an audience of cats? Wait, what?? You've just unlocked the door to BattleBlock Theater! There's no turning back once you've started on your quest to free your imprisoned friends from evil technological cats! Immerse yourself in this mindShipwrecked. Captured. Betrayed. Forced to perform for an audience of cats? Wait, what?? You've just unlocked the door to BattleBlock Theater! There's no turning back once you've started on your quest to free your imprisoned friends from evil technological cats! Immerse yourself in this mind bending tale of treachery as you battle your way through hundreds of levels in order to discover the puzzling truth behind BattleBlock Theater.… Expand"}, {"name": "Dragon Ball FighterZ", "details_link": "https://www.metacritic.com/game/pc/dragon-ball-fighterz", "publisher": "Bandai Namco Games", "release_date": "Jan 26 2018", "developers": ["Arc System Works"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/d0c4fdaf9c902ff01fb3e443566edfed-98.jpg", "descriptions": "After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters.After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters. Partnering with Arc System Works, DRAGON BALL FighterZ maximizes high end Anime graphics and brings easy to learn but difficult to master fighting gameplay to audiences worldwide. \r\rKey Features:\r * 3vs3 TAG/SUPPORT\rAllows players to train and master more than one fighter/style which brings deeper gameplay\r * HIGH-END ANIME GRAPHICS\rUsing the power of the Unreal engine and the talented team at Arc System Works, DRAGON BALL FighterZ is a visual tour-de-force \r\r* SPECTACULAR FIGHTS\rExperience aerial combos, destructible stages, famous scenes from the DRAGON BALL anime reproduced in 60FPS and 1080p resolution (Higher resolution will be supported on PS4 Pro and Xbox Scorpio)… Expand"}, {"name": "Star Wars: Knights of the Old Republic II - The Sith Lords", "details_link": "https://www.metacritic.com/game/pc/star-wars-knights-of-the-old-republic-ii---the-sith-lords", "publisher": "LucasArts", "release_date": "Feb  8 2005", "developers": ["Obsidian Entertainment"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Third-Person", "Third-Person", "General", "Western-Style"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/64c1da74887ddae03974864ff0344c28-98.jpg", "descriptions": "Beginning approximately five years after the events of the first Knights of the Old Republic, The Sith Lords takes players on an entirely new journey as they assume the role of what is believed to be the last Jedi in the galaxy. The game features a cast of memorable returning characters andBeginning approximately five years after the events of the first Knights of the Old Republic, The Sith Lords takes players on an entirely new journey as they assume the role of what is believed to be the last Jedi in the galaxy. The game features a cast of memorable returning characters and sinister new villains. Using more than 30 new Force powers, players can turn weak-minded enemies against one another in combat with \"Force confusion\" or see through doors and view character alignment with \"Force sight.\" Assigned to protect the Old Republic and the Jedi Order from the terrifying Dark Lords of the Sith, players must explore and battle through seven diverse worlds while being challenged whether to choose the light side of the Force or surrender to the lure of the dark side. [LucasArts]… Expand"}, {"name": "Tony Hawk's Pro Skater 1 + 2", "details_link": "https://www.metacritic.com/game/switch/tony-hawks-pro-skater-1-+-2", "publisher": "Activision", "release_date": "Jun 25 2021", "developers": ["Vicarious Visions", "Turn Me Up Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/a12de24a39ac3fd6869111a9bdb7c92e-98.jpg", "descriptions": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more."}, {"name": "Death's Door", "details_link": "https://www.metacritic.com/game/pc/deaths-door", "publisher": "Devolver Digital", "release_date": "Jul 20 2021", "developers": ["Acid Nerve"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/30221a7ecf1cae32ee68c38a89e99f85-98.jpg", "descriptions": "Reaping souls of the dead and punching a clock might get monotonous but it's honest work for a Crow. The job gets lively when your assigned soul is stolen and you must track down a desperate thief to a realm untouched by death - where creatures grow far past their expiry and overflow withReaping souls of the dead and punching a clock might get monotonous but it's honest work for a Crow. The job gets lively when your assigned soul is stolen and you must track down a desperate thief to a realm untouched by death - where creatures grow far past their expiry and overflow with greed and power. Talon Sharp Combat:  Utilise melee weapons, arrows and magic to overcome a fantastic array of beasts and demigods. Mistakes are punished and victory is rewarded. Gain an edge by customising your character stats and mastering the abilities and upgrades you obtain.\r A Beautifully Bleak World: Venture beyond the Doors and explore a land full of twisted inhabitants and countless secrets, bringing hope to the weird and wonderful characters you’ll meet along the way.\r A Dark Mystery to Unravel: Track down and defeat colossal tyrants with stories and motivations of their own. Experience a somber yet darkly comedic tale, uncovering the truths behind the flow of souls, the role of the Crows and the origin of the Doors.… Expand"}]