[{"name": "Puddle", "details_link": "https://www.metacritic.com/game/xbox-360/puddle", "publisher": "Konami", "release_date": "Jan 25 2012", "developers": ["Neko Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Logic", "Logic"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/87f6bd466506c0c7fc32979477707c67-98.jpg", "descriptions": "Experience a brilliantly designed physics-based puzzle/platform game where you must guide a puddle of fluid to its target destination, not by moving the fluid, but by tilting the game world. The player must work with friction, momentum, and the unique properties of each type of fluid andExperience a brilliantly designed physics-based puzzle/platform game where you must guide a puddle of fluid to its target destination, not by moving the fluid, but by tilting the game world. The player must work with friction, momentum, and the unique properties of each type of fluid and environment to send as much of each puddle past fires, rifts, potential spills and more. But watch out: the fluid motion is realistic!  Tilt too quickly and some droplets are left behind; tilt too slowly you may not be able to make certain jumps… or may simply evaporate away.… Expand"}, {"name": "Minecraft: Story Mode Season Two - Episode 1: Hero in Residence", "details_link": "https://www.metacritic.com/game/playstation-4/minecraft-story-mode-season-two---episode-1-hero-in-residence", "publisher": "Telltale Games", "release_date": "Jul 11 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 68, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/68b015e3acdf8ffe37bd6f648f53be03-98.jpg", "descriptions": "Now that Jesse and the gang have vanquished the Wither Storm, saved the world, and become totally super famous heroes, life has gotten a bit more… complicated. With more responsibilities and less time for adventure, old friendships have started to fade — at least until Jesse’s hand getsNow that Jesse and the gang have vanquished the Wither Storm, saved the world, and become totally super famous heroes, life has gotten a bit more… complicated. With more responsibilities and less time for adventure, old friendships have started to fade — at least until Jesse’s hand gets stuck in a creepy gauntlet that belongs to an ancient underwater temple.… Expand"}, {"name": "Outlast 2", "details_link": "https://www.metacritic.com/game/playstation-4/outlast-2", "publisher": "Red Barrels", "release_date": "Apr 24 2017", "developers": ["Red Barrels"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/a56896c144f748c9dcf041ec8c11ff1c-98.jpg", "descriptions": "Outlast 2 is the sequel to the acclaimed survival horror game Outlast. Set in the same universe as the first game, but with different characters and a different setting, Outlast 2 is a twisted new journey into the depths of the human mind and its dark secrets. No conflict is ever black andOutlast 2 is the sequel to the acclaimed survival horror game Outlast. Set in the same universe as the first game, but with different characters and a different setting, Outlast 2 is a twisted new journey into the depths of the human mind and its dark secrets. No conflict is ever black and white. Outlast 2 introduces you to Sullivan Knoth and his followers, who left our wicked world behind to give birth to Temple Gate, a town, deep in the wilderness and hidden from civilization. Knoth and his flock are preparing for the tribulations of the end of times, and you’re right in the thick of it.… Expand"}, {"name": "Genital Jousting", "details_link": "https://www.metacritic.com/game/pc/genital-jousting", "publisher": "Devolver Digital", "release_date": "Jan 18 2018", "developers": ["Free Lives"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 68, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/f9d53b4e7cc2dea8d3fc7140ced73b41-98.jpg", "descriptions": "Genital Jousting is an online and local multiplayer party game about flaccid penises and wiggly anuses for up to eight players at once."}, {"name": "Armored Core V", "details_link": "https://www.metacritic.com/game/xbox-360/armored-core-v", "publisher": "Namco Bandai Games America", "release_date": "Mar 20 2012", "developers": ["From Software"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 20 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/aeaaeaa7c5cdf1e2ecb947093554bd1a-98.jpg", "descriptions": "The ARMORED CORE series is known in the mech action genre for its intense one-on-one battles and customization options. ARMORED CORE V is a new entry that ups the ante with more content than the previous games, a completely new atmosphere, and a robust offline mode. In addition, the onlineThe ARMORED CORE series is known in the mech action genre for its intense one-on-one battles and customization options. ARMORED CORE V is a new entry that ups the ante with more content than the previous games, a completely new atmosphere, and a robust offline mode. In addition, the online mode has been newly designed to focus on huge team-based battles on a global scale. … Expand"}, {"name": "The Witcher Adventure Game", "details_link": "https://www.metacritic.com/game/pc/the-witcher-adventure-game", "publisher": "CD Projekt Red Studio", "release_date": "Nov 27 2014", "developers": ["Can Explode"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Miscellaneous", "Adventure", "General", "Board / Card Game"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/60cd22a42af0a39ee42daf60b5a3bd99-98.jpg", "descriptions": "The Witcher Adventure Game takes players on a journey across the world of The Witcher as they assume the roles of four distinct characters known from the books and video games: Geralt of Rivia, monster slayer; Triss Merigold,cunning sorceress; Yarpen Zigrin, dwarven warrior; and Dandelion,The Witcher Adventure Game takes players on a journey across the world of The Witcher as they assume the roles of four distinct characters known from the books and video games: Geralt of Rivia, monster slayer; Triss Merigold,cunning sorceress; Yarpen Zigrin, dwarven warrior; and Dandelion, rogu- ish bard. Each character has unique skills and multiple ways of overcoming obstacles—the choice is yours: do you fight your way to victory, call on your charm, or try your hand at diplomacy?A variety of quests invite players to hunt monsters, earn gold, and interact with the characters they meet in a web of alliances and treachery—a wild ride that starts as soon as you sit down to play, thanks to clear, simple rules and intuitive mechanics. Players may assist one another from time to time, but make no mistake—there can be only one winner!… Expand"}, {"name": "Schizoid", "details_link": "https://www.metacritic.com/game/xbox-360/schizoid", "publisher": "Microsoft Game Studios", "release_date": "Jul  9 2008", "developers": ["Torpex Games LLC"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "General", "General"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/e0c5f5434688a6d9ea3efc12fde149fc-98.jpg", "descriptions": "[Xbox Live Arcade]  Cooperative gameplay is redefined in the fast-paced and unique Schizoid! Control red and blue ships, ramming them into enemies of the same color to destroy them. But be careful, because if you hit the opposite color, you will be destroyed. Quick thinking and quicker[Xbox Live Arcade]  Cooperative gameplay is redefined in the fast-paced and unique Schizoid! Control red and blue ships, ramming them into enemies of the same color to destroy them. But be careful, because if you hit the opposite color, you will be destroyed. Quick thinking and quicker reflexes help you seize victory, but sharp teamwork provides the best chance of earning gold medals along the way. Schizoid offers more than 120 levels of challenge, playable in either single-player or co-op mode, plus the brain-melting Uberschizoid hardcore mode, in which one player controls both ships. Co-op gameplay to the max: No other multiplayer co-op game has such tight cooperative gameplay. The two players (or one player with a computer A.I. partner, or one player controlling both ships in Uberschizoid) must work together closely in order to defeat the hordes on each level. Uberschizoid mode: For perhaps the most challenging and \"brain-melting\" challenge yet, try Uberschizoid Mode. Control both red and blue ships, matching them to each enemy color in order to succeed. Tremendous graphics: The glowing, flashing, megabursting graphics add to the game's inherent chaos. [Microsoft]… Expand"}, {"name": "FLOCK!", "details_link": "https://www.metacritic.com/game/xbox-360/flock!", "publisher": "Capcom", "release_date": "Apr  8 2009", "developers": ["Proper Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "General"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/4e8040551df1c4df88dc59fb86bd78f1-98.jpg", "descriptions": "[Xbox Live Arcade]  Protect your cornfields and lock up your livestock, because Flock! is here! Pilot a UFO around vibrantly-colored landscapes in this charming sandbox puzzle game where you must herd animal life back to the Motherflocker. Using a powerful physics engine that drives many of[Xbox Live Arcade]  Protect your cornfields and lock up your livestock, because Flock! is here! Pilot a UFO around vibrantly-colored landscapes in this charming sandbox puzzle game where you must herd animal life back to the Motherflocker. Using a powerful physics engine that drives many of the game's elements, Flock! features over 50 pastoral puzzles. Pick up wood to form bridges, move boulders to create obstructions, and flatten fields into pathways all to help deliver your herd before time runs out! Flock together with a friend and even create and share your own crazy levels online. Animal control: Herd, poke, prod and manipulate cute, cuddly animals that react to each other and their hazardous surroundings. Unique style: Enjoy the whimsical hand stitched and stuffed art style using beautiful next-gen graphics. Level editor: The level editor allows for custom puzzles to be created, shared, and rated. Multiplayer fun: Two-player local co-op lets you flock with a friend. Extras: Explore with lots of fun surprises, secret collectibles, and upgrades to find along the way. [Capcom]… Expand"}, {"name": "Mafia III", "details_link": "https://www.metacritic.com/game/playstation-4/mafia-iii", "publisher": "2K Games", "release_date": "Oct  7 2016", "developers": ["Hangar 13"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 68, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/9b39891f6c2c9cf9f3fb5385ca06cfaf-98.jpg", "descriptions": "In 1968, after years in Vietnam, Lincoln Clay knows this truth: Family isn't who you're born with, it's who you are willing to die for. Now back home, in a new New Orleans, Lincoln is dedicated to rebuilding his life, but established ties keep him from exiting the city. It'll take more thanIn 1968, after years in Vietnam, Lincoln Clay knows this truth: Family isn't who you're born with, it's who you are willing to die for. Now back home, in a new New Orleans, Lincoln is dedicated to rebuilding his life, but established ties keep him from exiting the city. It'll take more than a few friends to make it in this new world. Intense gun fights, hand-to-hand combat, white knuckle driving and street smarts will all be required. But with the right crew, tough decisions and some dirty hands, it's possible to ascend to the top of the city's underworld. It's about time to create a new family. … Expand"}, {"name": "Strikers Edge", "details_link": "https://www.metacritic.com/game/playstation-4/strikers-edge", "publisher": "Fun Punch Games", "release_date": "Jan 30 2018", "developers": ["Fun Punch Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/b7213b896e491ed9b5291540e2c15f24-98.jpg", "descriptions": "Strikers Edge is a medieval dodgeball with weapons, ancient warriors, and special powers. Challenge your opponents in online and local multiplayer, ascend to the top of the ladder and become the best striker."}, {"name": "TouchMaster 3", "details_link": "https://www.metacritic.com/game/ds/touchmaster-3", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 23 2009", "developers": ["Hijinx Studios"], "platforms": "DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/3675cc11d3d12a1d3d35a9f7117d26c2-98.jpg", "descriptions": "TouchMaster 3 is packed with challenging and addictive mini games for players of all ages and abilities, making it a great gift and perfect for holiday travel. Making full use of the DS touch screen and stylus, TouchMaster 3 is perfect for quick play sessions or hours of fun, and players canTouchMaster 3 is packed with challenging and addictive mini games for players of all ages and abilities, making it a great gift and perfect for holiday travel. Making full use of the DS touch screen and stylus, TouchMaster 3 is perfect for quick play sessions or hours of fun, and players can work through puzzles alone or compete head-to-head. Up to two players can compete using local wireless in addition to single player and download play options. Players take on action, word, puzzle, strategy and card game challenges to become a TouchMaster expert. The game features 16 brand new games to the franchise including Bumperball, Canon Fire, Domino Run, Nine Hole, Electro Maze, Sea Word, Stud Royale, Target Royale, Counterweight, Block Dropper, Fuse Line, Slime Assault, Recall, Chef Memory, Sludge Works and Wild Words. Newly updated games include Prisma Tix 2, Dice King 2, Triples Plus, and Poker Slide Challenge. TouchMaster 3 contains updated graphics and features new 3D art in the trophy rooms for a more enjoyable and visually appealing gameplay experience. Players can track progress by collecting trophies and badges to earn wizard points and unlock new titles. Gamers can earn all 500 wizard points and become the Grand Touch Master! [Warner Bros.]… Expand"}, {"name": "Tron 2.0: Killer App", "details_link": "https://www.metacritic.com/game/game-boy-advance/tron-20-killer-app", "publisher": "Buena Vista Interactive", "release_date": "Oct 20 2004", "developers": ["Digital Eclipse"], "platforms": ["PC", "Game Boy Advance"], "num_players": "1-4 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/ae53f91a81072fd12dbbeb4bb23a340f-98.jpg", "descriptions": "Take on the role of digital warriors Tron and Mercury as you battle against The Corruptor, an evil computer program attempting to create the ultimate virus and take over the system. In more than 30 intense levels featuring multiple types of gameplay, you'll engage in third-person isometricTake on the role of digital warriors Tron and Mercury as you battle against The Corruptor, an evil computer program attempting to create the ultimate virus and take over the system. In more than 30 intense levels featuring multiple types of gameplay, you'll engage in third-person isometric action, first-person vehicle combat, and light cycle racing. You can battle against three of your friends in multiplayer Light Cycle, Tank, and Recognizer modes. Collect and trade 100 upgrade chips that allow you to customize your character, unlock secrets, and more. … Expand"}, {"name": "Eric Young's Squad Assault: West Front", "details_link": "https://www.metacritic.com/game/pc/eric-youngs-squad-assault-west-front", "publisher": "Matrix Games", "release_date": "Nov  2 2003", "developers": ["Freedom LLC"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Military", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/29e5bb4e85e1f743ae0845c8ad8572d0-98.jpg", "descriptions": "In Squad Assault: West Front, you command troops in both the Allied and German Armies of the West Front of World War II in an immersive full 3-D continuous time environment. Squad Assault: West Front features detailed models for all the major armies that fought in France in 1944, includingIn Squad Assault: West Front, you command troops in both the Allied and German Armies of the West Front of World War II in an immersive full 3-D continuous time environment. Squad Assault: West Front features detailed models for all the major armies that fought in France in 1944, including American, German, British, Canadian, and Free French. For those who prefer traditional turn-oriented play, a user defined auto-pause feature for order entry and battlefield assessment allows for a more thoughtful game. A 2D overhead map view with order entry is also available for those who prefer to see the battle from above. [Matrix Games]… Expand"}, {"name": "WWE Raw 2", "details_link": "https://www.metacritic.com/game/xbox/wwe-raw-2", "publisher": "THQ", "release_date": "Sep 16 2003", "developers": ["Anchor (Legacy)"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/62ad3d3bf5bcc8235de3c00c6ba64619-98.jpg", "descriptions": "The sequel to WWF Raw features enhanced graphics and gameplay, a story mode, and more than 60 WWE superstars. WWE Raw 2 showcases its new features in eight arenas that come to life with 3D crowds and special effects. The enhanced gameplay controls provide better grappling, more balancedThe sequel to WWF Raw features enhanced graphics and gameplay, a story mode, and more than 60 WWE superstars. WWE Raw 2 showcases its new features in eight arenas that come to life with 3D crowds and special effects. The enhanced gameplay controls provide better grappling, more balanced momentum shifts, and a realistic AI. Now you can play in different modes including multiplayer season mode, Exhibition, Season, King of The Ring, Royal Rumble, expanded Title Match, and Create-A-Superstar. The game also includes Hell in a Cell and TLC match types. … Expand"}, {"name": "Grandia Xtreme", "details_link": "https://www.metacritic.com/game/playstation-2/grandia-xtreme", "publisher": "Enix Corporation", "release_date": "Sep 30 2002", "developers": ["Game Arts"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/68ca63ed2dde69048048a6cc8ba6935c-98.jpg", "descriptions": "With an enhanced battle system, Grandia Xtreme pushes RPG gaming in new directions with a faster-paced game of exploration and discovery. With over 130 different types of monsters and 8 elemental lands standing between you and victory, the future of world has never looked more desperate. CanWith an enhanced battle system, Grandia Xtreme pushes RPG gaming in new directions with a faster-paced game of exploration and discovery. With over 130 different types of monsters and 8 elemental lands standing between you and victory, the future of world has never looked more desperate. Can you avert the disaster rising from the ancient ruins? [Enix]… Expand"}, {"name": "Sudden Strike II", "details_link": "https://www.metacritic.com/game/pc/sudden-strike-ii", "publisher": "cdv Software", "release_date": "Sep 26 2002", "developers": ["Fireglow"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 68, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/eec03296aabca93cedf0498279528ada-98.jpg", "descriptions": "The whole world is nothing but a battlefield. And you are on the front line - in the very center of realistic battle action, which even amazes and delights the shrewdest strategy experts. As the commander of German, Russian, British, American and, finally, Japanese troops, you fight on waterThe whole world is nothing but a battlefield. And you are on the front line - in the very center of realistic battle action, which even amazes and delights the shrewdest strategy experts. As the commander of German, Russian, British, American and, finally, Japanese troops, you fight on water and on land as well as in the air. You can extend your actions through numerous specific commands in remarkable ways. The four different available difficulty levels and the fascinating multiplayer mode are thrilling beyond imagination. The user-friendly editor allows for unlimited supplies of professionally generated maps and missions - making sure the action never ends. With Sudden Strike II the war is far from over! [CDV]… Expand"}, {"name": "Capcom vs. SNK 2 EO", "details_link": "https://www.metacritic.com/game/gamecube/capcom-vs-snk-2-eo", "publisher": "Capcom", "release_date": "Sep 23 2002", "developers": ["Capcom"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/21610b6944c40fa8820f9e3835fc2022-98.jpg", "descriptions": "Two fighting giants clash in Capcom vs. SNK 2 EO. Now you can choose from more than 44 characters from the Capcom and SNK fighting universes and pit them against one another in one-on-one slugfests. Before each match, you can customize your character's fighting style with one of six newTwo fighting giants clash in Capcom vs. SNK 2 EO. Now you can choose from more than 44 characters from the Capcom and SNK fighting universes and pit them against one another in one-on-one slugfests. Before each match, you can customize your character's fighting style with one of six new Grooves. Then, put your uppercuts, throws, and combos to the test in six gameplay modes featuring multiple tournaments. With the new Free Ratio System, you can easily determine the level of your fighter's strength.… Expand"}, {"name": "WWF Raw", "details_link": "https://www.metacritic.com/game/xbox/wwf-raw", "publisher": "THQ", "release_date": "Feb 11 2002", "developers": ["Anchor (Legacy)"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/bf68f44808a85678843689779b659879-98.jpg", "descriptions": "With WWE Raw, you can bring more than 35 WWE superstars into your living room. This game puts you inside the squared circle to compete against your favorite wrestlers in a variety of match types, including tag team, King of the Ring, and more. Each player has his or her own finishing moves,With WWE Raw, you can bring more than 35 WWE superstars into your living room. This game puts you inside the squared circle to compete against your favorite wrestlers in a variety of match types, including tag team, King of the Ring, and more. Each player has his or her own finishing moves, entrances, and entrance effects. Set up tournaments against the game's AI, or face off against three of your friends in multiplayer modes. … Expand"}, {"name": "Zoo Tycoon (2001)", "details_link": "https://www.metacritic.com/game/pc/zoo-tycoon-2001", "publisher": "Microsoft Game Studios", "release_date": "Oct 17 2001", "developers": ["Blue Fang Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/ab896658a42e0d55c7d097ab003fd350-98.jpg", "descriptions": "Build, manage, and maintain the most healthy and vibrant zoo possible with over 200 animals, exhibits, and zoo materials. Plan wisely, and all of your animals will be happy. Plan poorly, and those lions, tigers, and bears may find a new found interest in you! [Microsoft]"}, {"name": "Chicken Run", "details_link": "https://www.metacritic.com/game/dreamcast/chicken-run", "publisher": "Eidos Interactive", "release_date": "Nov 13 2000", "developers": ["Blitz Games"], "platforms": ["PC", "Dreamcast"], "genres": ["Action Adventure", "Fantasy"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/3a02335fe5d9c6f0f19878b005db7108-98.jpg", "descriptions": "Behind the barbed wire fence of Tweedy Farm, Ginger is a chicken with a mission. Fearing for the lives of her friends, she is determined to escape to freedom before it is too late. To do this she enlists the help of Rocky, the smooth talking, flying Rooster...or is he?\r Guide a rescueBehind the barbed wire fence of Tweedy Farm, Ginger is a chicken with a mission. Fearing for the lives of her friends, she is determined to escape to freedom before it is too late. To do this she enlists the help of Rocky, the smooth talking, flying Rooster...or is he?\r Guide a rescue attempt to get all of the chickens to safety before they end up as pies. To do this you will have to sneak around the farm collecting objects necessary for the escape. Be careful not to disturb the dogs and avoid being caught by Mr. and Mrs. Tweedy at all costs in this humorous, 3D action game. … Expand"}, {"name": "Goat Simulator 3", "details_link": "https://www.metacritic.com/game/playstation-5/goat-simulator-3", "publisher": "Deep Silver", "release_date": "Nov 17 2022", "developers": ["Coffee Stain North"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Simulation", "General"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/1b73c3787bf509223a0f4ae59aefc4c8-98.jpg", "descriptions": "That's right - we're doing this again. The baa has been raised, and Pilgor is joined by other goats too. You can invite up to three friends in local or online co-op, create carnage as a team, or compete in mini-games and then not be friends anymore. Get ready for another round of udderThat's right - we're doing this again. The baa has been raised, and Pilgor is joined by other goats too. You can invite up to three friends in local or online co-op, create carnage as a team, or compete in mini-games and then not be friends anymore. Get ready for another round of udder mayhem. Lick, headbutt, and ruin your way through a brand new open world in the biggest waste of your time since Goat Simulator! We won't tell you how to play (except in the tutorial), but merely provide the means to be the goats of your dreams.… Expand"}, {"name": "The Wizard of Oz: Beyond the Yellow Brick Road", "details_link": "https://www.metacritic.com/game/ds/the-wizard-of-oz-beyond-the-yellow-brick-road", "publisher": "XSEED Games", "release_date": "Sep 29 2009", "developers": ["Media.Vision"], "platforms": "DS", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/4deb27cb4689d791fb49b1500a413f51-98.jpg", "descriptions": "The Wizard of OZ: Beyond the Yellow Brick Road is an RPG inspired by the beloved tale of Dorothy and her magical journey through the Land of Oz, showing a unique new perspective on what happened after reaching the end of the Yellow Brick Road. The game takes players through the endearingThe Wizard of OZ: Beyond the Yellow Brick Road is an RPG inspired by the beloved tale of Dorothy and her magical journey through the Land of Oz, showing a unique new perspective on what happened after reaching the end of the Yellow Brick Road. The game takes players through the endearing adventure of protagonist Dorothy and her lovely dog, Toto, turning these charming characters into classic RPG heroes. A tornado suddenly strikes a small farm in Kansas, savagely uprooting Dorothy and Toto with just one gust. After hours of dancing around in the bushel of wind, the pair eventually settles in an unfamiliar countryside. It is here Dorothy learns that the only way to return home is by following the ominous voice calling out to her to the end of the Yellow Brick Road. On her journey, Dorothy encounters some unlikely characters who eventually decide to join her on her quest. Dorothy and Toto, together with their newfound companions - the Scarecrow, Lion and Tin Man- embark on an enchanting voyage filled with many obstacles. Upon reaching the castle at the end of the Yellow Brick Road, the group learns from a mysterious wizard that the magical land has been taken over by four evil witches that are running amuck. Dorothy and her friends are tasked with defeating the witches with a return trip to Kansas as the reward, but is this new mission beyond the Yellow Brick Road everything it appears to be? [XSeed Games]… Expand"}, {"name": "MXGP 2019", "details_link": "https://www.metacritic.com/game/playstation-4/mxgp-2019", "publisher": "Milestone S.r.l", "release_date": "Aug 27 2019", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 68, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/3/9f4bc4f435f007e8bf69347cf7f395ec-98.jpg", "descriptions": "The official MXGP videogame is back and, for the very first time, you will be able to live the experience of the current MXGP World Championship. 2019 season's official riders, bikes and teams of MXGP and MX2 are ready to challenge you in all the 19 official events all over the world. As inThe official MXGP videogame is back and, for the very first time, you will be able to live the experience of the current MXGP World Championship. 2019 season's official riders, bikes and teams of MXGP and MX2 are ready to challenge you in all the 19 official events all over the world. As in real life, experience different weather conditions while playing. After all, after the rain, there is always the sun! Become the main actor of gameplay and shape your own best gaming experience thanks to brand-new game modes ever seen in the whole MXGP series!… Expand"}, {"name": "Rad", "details_link": "https://www.metacritic.com/game/switch/rad", "publisher": "Bandai Namco Games", "release_date": "Aug 20 2019", "developers": ["Double Fine Productions"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Action Adventure", "General"], "meta_score": 68, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/c79c36b12ece085fc80ecc47974d2709-98.jpg", "descriptions": "RAD – a 3D action rogue-like set in a post-post-apocalyptic world, where humanity has faced armageddon not once, but twice.\r Playing as a teenage protagonist, you must venture into the Fallow — an ever-changing, radioactive wasteland filled with unknown and unspeakable creatures. It isRAD – a 3D action rogue-like set in a post-post-apocalyptic world, where humanity has faced armageddon not once, but twice.\r Playing as a teenage protagonist, you must venture into the Fallow — an ever-changing, radioactive wasteland filled with unknown and unspeakable creatures. It is here that you will find the solution to heal the world, and transform the cracked, barren landscape into a lush source of new life.\r But humanity’s future comes at great personal cost, as the deeper you journey into unknown lands, the more you will expose yourself to gnarly toxins which will wreak havoc on your fragile human form.\r The fate of the world depends on you, your trusty bat, and whatever strange new abilities you gain as the world around you ravages your body — twisting and mutating you into something far less than human, but far more powerful.\r But forget all that — go grab that sweet bat and help save the world…or what’s remaining of it anyway.… Expand"}, {"name": "My Hero One's Justice", "details_link": "https://www.metacritic.com/game/playstation-4/my-hero-ones-justice", "publisher": "Bandai Namco Games", "release_date": "Oct 26 2018", "developers": ["Bandai Namco Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "General", "Fighting", "3D"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/a08c1798c80ac54c9b715d425ba5ea22-98.jpg", "descriptions": "Your fight for Justice starts now.Whether you want to see the destruction of humanity or believe heroes should defend those in need, fight to prove your justice in My Hero One's Justice. The popular weekly Shonen Jump manga series comes to life, as players experience the abilities of fanYour fight for Justice starts now.Whether you want to see the destruction of humanity or believe heroes should defend those in need, fight to prove your justice in My Hero One's Justice. The popular weekly Shonen Jump manga series comes to life, as players experience the abilities of fan favorite characters such as Izuku, Deku, Midoriya, Katsuki Katchan Bakugo, All Might and many more in this arena brawler, where you'll get to choose between hero and villain in your path to justice. Utilize Quirks and call upon your sidekicks to activate powerful attacks where your environments are at your disposal in total field destruction.Features:* Based on the hit weekly Shonen Jump manga series.* Heroes or Villains -- Choose between fan favorite characters like Deku, All Might, Tomura, and many more in your path to justice.* Total destruction -- The environments are at your disposal as players can destroy their surroundings in fierce battles.* Unleash Superpowers -- Utilize each character's quirks to plant explosive attacks.* Gorgeous and faithful Anime-style graphics.… Expand"}, {"name": "Just Cause 4", "details_link": "https://www.metacritic.com/game/pc/just-cause-4", "publisher": "Square Enix", "release_date": "Dec  4 2018", "developers": ["Avalanche Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 68, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/e37a3e4cdcb3b293e7de1146b8681ecb-98.jpg", "descriptions": "Welcome to Solis, a huge South American world home of conflict, oppression and extreme weather conditions. Just Cause 4 sees rogue hero Rico Rodriguez land in Solis to hunt down the truth about his past, at any costs. Strap into your wingsuit, equip your fully customizable grappling hook,Welcome to Solis, a huge South American world home of conflict, oppression and extreme weather conditions. Just Cause 4 sees rogue hero Rico Rodriguez land in Solis to hunt down the truth about his past, at any costs. Strap into your wingsuit, equip your fully customizable grappling hook, and get ready to bring the thunder. Soar through the skies with your wingsuit - Skydive, Base Jump and Free Dive with no limits. Fight your enemies under extreme weather conditions, including treacherous tornadoes and tropical lightning storms, taking the iconic Just Cause action to insane new heights. Use extreme weather events to your advantage thanks to never seen before in-game physics. Spearhead the rebellion and defeat the Black Hand, a hi-tech private military organisation. Face off against Gabriela Morales – your most fierce, capable, and unpredictable adversary yet. Uncover the truth of Rico’s father’s past life on Solís’ and its extreme weather. Explore the remote South American country of Solís, home of conflict, secrets, and danger. Enjoy 100 square kilometres of exotic playground, from rainforest to desert, via snowy mountain peaks. Discover a plethora of wonders as you explore the world of Solís from bustling cities to rural grasslands. [Square Enix]\r… Expand"}, {"name": "Solstice Chronicles: MIA", "details_link": "https://www.metacritic.com/game/pc/solstice-chronicles-mia", "publisher": "Ironward", "release_date": "Jul 26 2017", "developers": ["Ironward"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/e3cc101a67b364b7f58b35d4314169bc-98.jpg", "descriptions": "Battle for survival against waves of Martian mutants in this tactical twist on twin-stick shooters. Using the skills of your drone companion, make fight-or-flight decisions that drastically alter the threats you face. Will your choices lead you to freedom... or your doom?"}, {"name": "Fledgling Heroes", "details_link": "https://www.metacritic.com/game/switch/fledgling-heroes", "publisher": "Subtle Boom", "release_date": "May  7 2020", "developers": ["Subtle Boom"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Arcade", "2D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/5b370028017d7f647d323f44a4d438e2-98.jpg", "descriptions": "Leap from the nest into a fun-filled adventure! Meet cute feathered friends, each with their own wondrous story to tell, as they dodge dastardly pirate lizARRrds, dash through frozen forests, dive under sunken temples, and flap their way from fledglings to a fully-fledged heroes."}, {"name": "Songbringer", "details_link": "https://www.metacritic.com/game/pc/songbringer", "publisher": "Wizard Fu Games", "release_date": "Sep  1 2017", "developers": ["Wizard Fu Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Role-Playing", "Action Adventure", "General", "Action RPG", "Open-World"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/374fea5f1386932029d09f820828f705-98.jpg", "descriptions": "Explore 308 million procedurally-generated worlds. Awaken and face dormant evil. Uncover lost technology and create powerful artifacts. Those familiar with the nanosword will crush giants and check galactic war."}, {"name": "Men of War: Vietnam", "details_link": "https://www.metacritic.com/game/pc/men-of-war-vietnam", "publisher": "1C", "release_date": "Sep  8 2011", "developers": ["Best Way"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Military", "General", "Military", "Tactics"], "meta_score": 68, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/47b052e55396a4fe1a33eec2ca980206-98.jpg", "descriptions": "This successor to Men of War brings tactical strategy to the jungle battles of the Vietnam War."}, {"name": "Conan Exiles", "details_link": "https://www.metacritic.com/game/playstation-4/conan-exiles", "publisher": "Funcom", "release_date": "May  8 2018", "developers": ["Funcom"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["Action Adventure", "Survival"], "meta_score": 68, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/91e6161dbb53c9656736508c6262b1c0-98.jpg", "descriptions": "You are an exile, outcast and downtrodden, sentenced to walk in a barbaric wasteland where the weak are crushed and only the strong can live. Here you must fight to survive, build, and dominate the world alone on your own server, or with enemies and allies in online multiplayer.\r JourneyYou are an exile, outcast and downtrodden, sentenced to walk in a barbaric wasteland where the weak are crushed and only the strong can live. Here you must fight to survive, build, and dominate the world alone on your own server, or with enemies and allies in online multiplayer.\r Journey through a vast, seamless world filled with the ruins of ancient civilizations and uncover its dark history and buried secrets as you seek to conquer and dominate the exiled lands yourself. Start with nothing but your bare hands and forge the legacy of your clan, from simple tools and weapons to gigantic fortresses and entire cities. Enslave the bandits of the exiled lands to do your bidding by breaking them on the grueling Wheel of Pain. Sacrifice the beating hearts of your enemies on the blood-soiled altars of your god to seize true power and glory. Summon the colossal avatar of your god and see them lay waste to your enemies and their homes.\r Just remember: in this brutal land of vengeful gods, bloodthirsty cannibals, and vicious monsters, survival is more than tracking down food and water. Explore mysterious ruins in search of treasure and knowledge, but beware the risk of your mind being corrupted by the dark forces of the world. Traverse vast sand dunes and seek shelter from scouring sandstorms sweeping across the burning sands. March into war against your enemies and unleash your savage fury in brutal combat. Go in unprepared and it will be your head rolling and limbs flying.\r Conan Exiles is not an empty sandbox. It is a world rich in history where you must discover the knowledge and secrets of ancient civilizations as you struggle to build your own.\r * SURVIVE THE BARBARIC WASTELAND\rIn the world of Conan the Barbarian, survival is more than being well-fed and hydrated. Here you must weather scouring sandstorms, save your mind from being corrupted and going insane, and fight vicious monsters from the darkest holes of the earth.\r * BUILD YOUR LEGACY IN A VAST, SEAMLESS WORLD\rJourney through a huge, seamless world filled with danger and opportunity, exploring everything from sand dunes to towering ruins. Harvest resources to craft tools and weapons, then build everything from a small settlement to entire cities.\r * DISCOVER THE DARK HISTORY OF ANCIENT CIVILIZATIONS\rExplore shadow-haunted ruins of ancient civilizations and discover great treasures and knowledge. Learn about the people who inhabited this world before and what led to their demise through inscriptions, wandering NPCs, and the environment itself.\r * CALL UPON THE POWER OF THE GODS\rCut out the hearts of your enemies and sacrifice it upon the altars of your god to earn their blessing. Summon and take direct control of huge, towering avatars and wreak havoc on your enemies as you crush their homes and drive them from their lands.\r * DEFEND YOUR LAND WITH AN ARMY OF SLAVES\rEnslave the criminals of the exiled lands and force them to join your cause and defend your territory. Put them through the grueling Wheel of Pain to break their will, then turn them into archers, crafters, entertainers, and more. Find rare thralls for the greatest rewards!\r * DOMINATE YOUR ENEMIES\rMarch forth to war against your enemies, use explosives and see their fortifications crumble to dust, then unleash your savage fury with brutal attacks that will see heads rolling and limbs flying. Find or craft a wide range of weapons and armor.\r * PLAY TOGETHER OR ALONE\rPlay alone locally or fight for survival and dominance in persistent multiplayer on public servers. You can also host your own server and invite others to join you in a world where you have full control of the rules and settings. Want to play with just handful of friends? Try co-op mode!\r * CONTROL YOUR EXPERIENCE\rWhen playing alone locally or on a server you are the administrator of you have access to a range of in-game tools. These allow you to change progression speed, spawn monsters, turn yourself invisible, deactivate avatars, and much more. Be the dungeon master of your own server!\r * PLAY WITH MODS\rDownload Conan Exiles mods directly from the Steam workshop to customize your game experience. You can also download the custom Conan Exiles Unreal Editor and start creating your own!… Expand"}, {"name": "Lapis x Labyrinth", "details_link": "https://www.metacritic.com/game/switch/lapis-x-labyrinth", "publisher": "NIS America", "release_date": "May 28 2019", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/9cdeeefc1a635061fb6133c87f763353-98.jpg", "descriptions": "Stack, raid, and GET PAID. The dungeon-diving action RPG Lapis x Labyrinth puts you at the center of a high-octane treasure-hunting quest, where the danger is great and the rewards are even greater! Do you have what it takes to smash through hordes of monsters and traps to gain riches beyondStack, raid, and GET PAID. The dungeon-diving action RPG Lapis x Labyrinth puts you at the center of a high-octane treasure-hunting quest, where the danger is great and the rewards are even greater! Do you have what it takes to smash through hordes of monsters and traps to gain riches beyond your imagination? When a struggling village falls on hard times and is desperate need of wealth, there's only one solution: gather your comrades, venture into the Labyrinth below the Golden Forest, and claim the piles of gold and treasures hidden within! You will need all your courage and wits to survive the dangers ahead, but the treasures that await you are well worth it! Customize your team with over 4,000 unique combinations, then use the creative stacking mechanic to perform synchronized attacks. When you've racked up enough destruction, unleash the explosive power of Fever Mode to really make the cash flow! With 8 different character classes, engaging monster encounters, and stylish, over-the-top visuals, this adventure has everything you need to make it rain.… Expand"}, {"name": "The Rub Rabbits!", "details_link": "https://www.metacritic.com/game/ds/the-rub-rabbits!", "publisher": "Sega", "release_date": "Feb 13 2006", "developers": ["Sonic Team"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Party / Minigame", "General"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/48ccd80de5a8eefcd6d3daba6057af34-98.jpg", "descriptions": "(Also known as \"Where do Babies Come From?\" in Japan)  Getting the girl is never easy, especially when competing against 12 other rivals. Players will battle rivals and win the affection of the game's love interest, and that's just the beginning. The Rub Rabbits! offers over 35 chapters in(Also known as \"Where do Babies Come From?\" in Japan)  Getting the girl is never easy, especially when competing against 12 other rivals. Players will battle rivals and win the affection of the game's love interest, and that's just the beginning. The Rub Rabbits! offers over 35 chapters in Story Mode, in addition to double the content in the newly expanded Memories Mode, which tests players' skills at clearing all stages for added bonuses; and Maniac Mode, which is packed with character customization options. Hold the DS sideways, upside down, or hold it with a friend for co-op and battle play. An all-new \"rub comedy\" adventure. Double the content with over 35 Chapters in the Story Mode alone. In addition to Story, Memories and Maniac Modes, four brand new modes - Attack, Hullabaloo, \"Baby Making\" and Connect Modes - will keep players entertained and interacting for a long time! Brand new customization modes allow you to unlock songs and sounds to make your own original music, and customize your girl's hair, dress, and shoes in Maniac Mode. Compete in six different multiplayer contests with up to four players. [Sega]… Expand"}, {"name": "Mytran Wars", "details_link": "https://www.metacritic.com/game/psp/mytran-wars", "publisher": "Deep Silver", "release_date": "Oct 26 2009", "developers": ["Stormregion"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 68, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/b494211a4dcc156b591e87d0656f479a-98.jpg", "descriptions": "It's the 23rd century: The earth's natural resources are virtually exhausted and the ruling multinational conglomerates are searching for new raw material deposits in space in order to avert the impending catastrophe. One planet turns out to be a real El Dorado in this respect. But as theIt's the 23rd century: The earth's natural resources are virtually exhausted and the ruling multinational conglomerates are searching for new raw material deposits in space in order to avert the impending catastrophe. One planet turns out to be a real El Dorado in this respect. But as the human conquerors in their armed mecha encounter the extraterrestrial inhabitants a dreadful war breaks out. The player researches into new technologies and continues to rearm his mecha in Mytran Wars. Battles are thereby fought in wonderful 3D landscapes - against the merciless AI or other human opponents in various multiplayer modes. 30 missions with 30 to 40 hours of single player gameplay! Dozens of unlockable extras and more than 250 research-able items on six different tech-trees. 4 campaigns with 2 different fractions, supported by a comprehensive story plot. [Deep Silver]… Expand"}, {"name": "Arkanoid: Eternal Battle", "details_link": "https://www.metacritic.com/game/playstation-5/arkanoid-eternal-battle", "publisher": "Microids", "release_date": "Oct 27 2022", "developers": ["Pasta Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action", "Arcade"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/2bfb61d393f13e6c53f182c0efdb3311-98.jpg", "descriptions": "Discover or re-discover, the emblematic block breaker game in a fully modernized version! Classic elements from the franchise will definitely make a comeback, with a brand-new look, new rules, as well as new effects, bonuses and features!For the first time ever, players will be able toDiscover or re-discover, the emblematic block breaker game in a fully modernized version! Classic elements from the franchise will definitely make a comeback, with a brand-new look, new rules, as well as new effects, bonuses and features!For the first time ever, players will be able to compete against each other, offering an online experience thanks to the Eternal Battle mode, the main new feature of this game, bringing the arcade experience to a whole new level. This Battle Royale mode offers the possibility to compete among 25 players online.… Expand"}, {"name": "This Is the President", "details_link": "https://www.metacritic.com/game/pc/this-is-the-president", "publisher": "THQ Nordic", "release_date": "Dec  6 2021", "developers": ["SuperPAC"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/abf4f7d305e2f805fc4d9be686ed5853-98.jpg", "descriptions": "This Is the President is a story driven management game. In the year 2020 you are elected to be the President of the United States of America. To escape justice for your past crimes as a shady multi-millionaire businessman, you need to ratify Amendment 28 which would grant lifetime immunityThis Is the President is a story driven management game. In the year 2020 you are elected to be the President of the United States of America. To escape justice for your past crimes as a shady multi-millionaire businessman, you need to ratify Amendment 28 which would grant lifetime immunity to any President.Manage your official and unofficial staff like a real mafioso in order to deal with all the old problems you've had in the past, as well as the shiny new problems that come with the office. You'll battle with your competitors, the establishment, the media and even foreign leaders.In this political thriller-satire mix, the player's actions will inescapably lead to situations that escalate into absurd, terrifying, tragic and even ridiculous situations.… Expand"}, {"name": "TERROR SQUID", "details_link": "https://www.metacritic.com/game/switch/terror-squid", "publisher": "Apt Games", "release_date": "Oct 15 2020", "developers": ["Apt Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/36836f5f9407f72a806fa21a6f4663e6-98.jpg", "descriptions": "Create your own bullet hell in this relentlessly escalating symphony of destruction. How long can you survive?\rSee how long you can survive in TERROR SQUID, the first game from Norwegian developer Apt Games, winner of the 2019 Norwegian Gameplay Awards and the first ever Norwegian ArcadeCreate your own bullet hell in this relentlessly escalating symphony of destruction. How long can you survive?\rSee how long you can survive in TERROR SQUID, the first game from Norwegian developer Apt Games, winner of the 2019 Norwegian Gameplay Awards and the first ever Norwegian Arcade title, refurbished and improved for Steam!\r An escalating symphony of destruction\r Your objective is to survive for as long as possible without getting hit by your own projectiles. Survive for long enough and you can release a primordial blast of dark energy, detonating your projectiles in gloriously satisfying chain reactions.\r Create Your Own Bullet Hell\rDozens of bullet patterns unlike anything you have ever seen. Perfect your strategy to squeeze every precious second out of each pattern.… Expand"}, {"name": "Smoke and Sacrifice", "details_link": "https://www.metacritic.com/game/pc/smoke-and-sacrifice", "publisher": "Curve Digital Games", "release_date": "May 31 2018", "developers": ["Solar Sail Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/5/b6f4402e9f483c4935fd45285ce497f6-98.jpg", "descriptions": "Smoke and Sacrifice sees Sachi, a mother forced to give up her son, adventure into a grotesque underworld on a quest that will lead her to a darker truth."}, {"name": "RIDE", "details_link": "https://www.metacritic.com/game/pc/ride", "publisher": "Bandai Namco Games", "release_date": "Mar 27 2015", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Driving", "Racing", "Simulation", "General", "Automobile"], "meta_score": 68, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/4/2426b56aa76a93e02d7624cf81fc3674-98.jpg", "descriptions": "Select from over 100 bikes from the manufacturers that have made motorcycling history, and set off on the World Tour. Challenge rivals at Motorcycle Festivals divided into three different track typologies: from the thrills of the GP Tracks, through the beautiful landscapes of the CountrySelect from over 100 bikes from the manufacturers that have made motorcycling history, and set off on the World Tour. Challenge rivals at Motorcycle Festivals divided into three different track typologies: from the thrills of the GP Tracks, through the beautiful landscapes of the Country Tracks, and all the way to the challenge of the City Tracks. Race after race, customize and improve your bike in order to work your way up the World Rankings and become the fastest biker in RIDE . As well as the World Tour, players can compete in a variety of different game modes: Quick Race, Time Trial, Split Screen, and online with up to twelve players in the Quick Race and in the Championship\r… Expand"}, {"name": "Tennis in the Face", "details_link": "https://www.metacritic.com/game/playstation-4/tennis-in-the-face", "publisher": "10tons Ltd", "release_date": "Dec  9 2014", "developers": ["10tons Ltd", "10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/0d3bf688cb9e8de6367304f4931890cf-98.jpg", "descriptions": "As you might guess from the title, Tennis in the Face isn’t a very serious game. Nor a tennis game, really. Instead it’s more about smashing furious tennis serves at creepy clowns, corrupt riot police, mad scientists and a couple of other worthy targets of some tough tennis street justice."}, {"name": "Shattered - Tale of the Forgotten King", "details_link": "https://www.metacritic.com/game/pc/shattered---tale-of-the-forgotten-king", "publisher": "Redlock Studio", "release_date": "Feb 17 2021", "developers": ["Redlock Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/58e098c86abdcbb11e67ddf36b87f3fb-98.jpg", "descriptions": "Shattered - Tale of the Forgotten King is an rpg-adventure game with challenging boss fights and a deep lore inspired by Dark Souls, Shadow of the Colossus and Legacy of Kain."}, {"name": "Azkend 2: The World Beneath", "details_link": "https://www.metacritic.com/game/switch/azkend-2-the-world-beneath", "publisher": "10tons", "release_date": "Jan 12 2018", "developers": ["10tons"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Matching"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/f48ff982d4c441802787d37f1ebfb890-98.jpg", "descriptions": "While traveling from Liverpool to New York your ship was pulled down into a massive maelstrom and you woke up in a place that may have never been gazed upon by the eyes of men. From now on your goal is to ascend from the bowels of the earth and return to civilization.\r Enjoy dozens ofWhile traveling from Liverpool to New York your ship was pulled down into a massive maelstrom and you woke up in a place that may have never been gazed upon by the eyes of men. From now on your goal is to ascend from the bowels of the earth and return to civilization.\r Enjoy dozens of exciting levels with variable gameplay in the story mode. The Jules Vernesque story of your journey will be told with gorgeous animated full screen cut scenes and professional voice overs. You'll experience awe and wonder through all the eight fantastic scenes that change constantly as you move through them.\r Azkend 2 presents you several different and exciting level styles throughout the adventure. You can also earn almost 20 unique powerups and over a dozen achievements. Choose your powerups wisely for each level to hasten your journey.\r In addition Azkend 2 has two challenge game modes called Time and Medals. The Time-challenge is a quick two minute bite-sized game where you'll try to gain as many points as possible and gain fame on the leaderboards. In the Medals-challenge you can replay all the levels from the story and try to gain a medal from each one.… Expand"}, {"name": "Slain: Back from Hell", "details_link": "https://www.metacritic.com/game/playstation-4/slain-back-from-hell", "publisher": "Wolf Brew Games", "release_date": "Sep 20 2016", "developers": ["Wolf Brew Games"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/cac46dddb9eb2e0642878483d6057c65-98.jpg", "descriptions": "You control the fate of Bathoryn, a doomed hero in a Gothic world, who seeks to liberate six cursed realms from six deadly overlords. He must battle his way through this blighted land, packed with gruesome and lethal creatures before ascending (or sometimes descending) into a stronghold, allYou control the fate of Bathoryn, a doomed hero in a Gothic world, who seeks to liberate six cursed realms from six deadly overlords. He must battle his way through this blighted land, packed with gruesome and lethal creatures before ascending (or sometimes descending) into a stronghold, all the while defeating fiendish traps and vile monsters alike. [Playstation.com]… Expand"}, {"name": "WRC: FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/playstation-3/wrc-fia-world-rally-championship", "publisher": "Black Bean Games", "release_date": "Oct  8 2010", "developers": ["Milestone S.r.l"], "platforms": ["3DS", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 68, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/4/e09313ccf45c14e1c29da2cbfe339660-98.jpg", "descriptions": "Official locations, official rally cars and official drivers - everything in WRC FIA World Rally Championship is designed to give the player the full experience of taking part in one of the most ferocious and challenging motorsports. WRC FIA World Rally Championship features \"Road toOfficial locations, official rally cars and official drivers - everything in WRC FIA World Rally Championship is designed to give the player the full experience of taking part in one of the most ferocious and challenging motorsports. WRC FIA World Rally Championship features \"Road to the WRC\", an unrivalled career mode that will allow players to hit the dirt to win the ultimate championship. With advanced car tuning, stunning car damage effects and the opportunity to race against heroes of the sport, WRC FIA World Rally Championship is the closest you can get to being one of the most skilled and fearless drivers in the world.… Expand"}, {"name": "Golden Axe", "details_link": "https://www.metacritic.com/game/xbox-360/golden-axe", "publisher": "Sega", "release_date": "Jul 11 2007", "developers": ["Backbone Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 68, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/87c7597a204df31edb674707cef30eed-98.jpg", "descriptions": "[Xbox Live Arcade]  Three mighty heroes have a score to settle with the evil Death Adder in this classic action game, now adapted for Xbox Live Arcade. As a powerful fighter, a female Amazon, or a mighty dwarf, fight through Adder's henchmen with weapon and magic attacks, or ride the[Xbox Live Arcade]  Three mighty heroes have a score to settle with the evil Death Adder in this classic action game, now adapted for Xbox Live Arcade. As a powerful fighter, a female Amazon, or a mighty dwarf, fight through Adder's henchmen with weapon and magic attacks, or ride the fearsome, fire-breathing dragon in Golden Axe. Enhanced graphics and sound: Relive all those classic arcade moments with an adaptation of one of the most important arcade games released. Leaderboards: Two high score leaderboards are used, one for Normal, and one for Hardcore play. Multiplayer capability: Now you and a friend can join in on the action. Achievements: Twelve new achievements are included to master, ranging from the easy such as playing every character, to the difficult, such as winning the game without having to use a continue. [Microsoft]… Expand"}, {"name": "The Masterplan", "details_link": "https://www.metacritic.com/game/pc/the-masterplan", "publisher": "Shark Punch", "release_date": "Jun  4 2015", "developers": ["Shark Punch"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "General"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/f57573659521c88e18a30cf7da5386b2-98.jpg", "descriptions": "The Masterplan is a tactical heist game set in the 70s. Can you achieve the greatest heist in the history of mankind?"}, {"name": "Serious Sam HD: The First Encounter", "details_link": "https://www.metacritic.com/game/pc/serious-sam-hd-the-first-encounter", "publisher": "Devolver Digital", "release_date": "Nov 24 2009", "developers": ["Croteam"], "platforms": ["Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/a2fb881b2ae645d36390e89bf208265d-98.jpg", "descriptions": "The indie sensation Serious Sam: The First Encounter is reborn in glorious high-definition for legions of long-time fans and a whole new generation of gamers around the world. Featuring dazzling visuals and revamped design, gamers take control of the legendary Sam ‘Serious’ Stone as he isThe indie sensation Serious Sam: The First Encounter is reborn in glorious high-definition for legions of long-time fans and a whole new generation of gamers around the world. Featuring dazzling visuals and revamped design, gamers take control of the legendary Sam ‘Serious’ Stone as he is sent back through time to ancient Egypt to battle the overwhelming forces of Lord Mental and the Sirian army.… Expand"}, {"name": "Munin", "details_link": "https://www.metacritic.com/game/pc/munin", "publisher": "Daedalic Entertainment", "release_date": "Jun 10 2014", "developers": ["Gojira"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/9d032f3ddc8f9ba60df993e920b15bf4-98.jpg", "descriptions": "Imagine you could move mountains - literally! With realistic physics, Norse runes, rotating platforms and a lot of gray cells you'll help Munin, Odin's messenger in her very own 2D-adventure, to reclaim her power on a journey through Yggdrasil."}, {"name": "2Dark", "details_link": "https://www.metacritic.com/game/pc/2dark", "publisher": "Gloomywood", "release_date": "Mar 10 2017", "developers": ["Gloomywood"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/db476f415a51a72bbb0aba468ced2445-98.jpg", "descriptions": "2Dark is a stealth adventure game developed by Frédérick Raynal, the pioneer of survival horror games and creator of Alone in the Dark®. Make your way through the lairs of psychopaths, unravel intrigue where madness mingles with horror, and, above all, save the kids!"}, {"name": "Skylanders Swap Force", "details_link": "https://www.metacritic.com/game/3ds/skylanders-swap-force", "publisher": "Activision", "release_date": "Oct 13 2013", "developers": ["n-Space"], "platforms": ["PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "3DS"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/00484549e42c5ec0d08ee3f50d3da7f4-98.jpg", "descriptions": "In Skylanders SWAP Force, Portal Masters embark on an adventure in the mysterious Cloudbreak Islands, where a magical volcano gives the heroes the power to swap halves, turning them into a special team known as the SWAP Force. By reassembling this team, Portal Masters must send back Kaos andIn Skylanders SWAP Force, Portal Masters embark on an adventure in the mysterious Cloudbreak Islands, where a magical volcano gives the heroes the power to swap halves, turning them into a special team known as the SWAP Force. By reassembling this team, Portal Masters must send back Kaos and his evil plan to Cloudbreak in order to save Skylands.… Expand"}, {"name": "The Solus Project", "details_link": "https://www.metacritic.com/game/pc/the-solus-project", "publisher": "Teotl Studios", "release_date": "Jun  7 2016", "developers": ["Grip Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Survival"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/c308bdfbd390b44ea3a43783e1ce0b98-98.jpg", "descriptions": "Stranded on a deserted alien planet and with your home planet of Earth on the brink of destruction, The Solus Project challenges you to survive the harsh, volatile environment and find a way to send a signal back home. Confronted with merciless weather, and danger lurking around everyStranded on a deserted alien planet and with your home planet of Earth on the brink of destruction, The Solus Project challenges you to survive the harsh, volatile environment and find a way to send a signal back home. Confronted with merciless weather, and danger lurking around every corner, the player must save the human race while unraveling the deep secrets of the seemingly deserted alien civilization. Are you alone on the planet…?… Expand"}, {"name": "Lords of the Fallen", "details_link": "https://www.metacritic.com/game/playstation-4/lords-of-the-fallen", "publisher": "Bandai Namco Games", "release_date": "Oct 28 2014", "developers": ["City Interactive", "Deck 13"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/4a2a6895c36c993c23b0d31471b464b2-98.jpg", "descriptions": "Lords of the Fallen is a hardcore action-RPG featuring an advanced combat systems and robust class skill trees. Set in a richly created fantasy world where the Gods have failed mankind, players will take on the role of a human named Harkyn who sets out on a quest to stand against anLords of the Fallen is a hardcore action-RPG featuring an advanced combat systems and robust class skill trees. Set in a richly created fantasy world where the Gods have failed mankind, players will take on the role of a human named Harkyn who sets out on a quest to stand against an apparently unstoppable supernatural force. Players travel across a world that is deeply dived by those that follow and others that resist, the Fallen God. Along their journey they will be faced with a series of decisions that will alter both the world and their character thus dramatically impacting the storyline.… Expand"}, {"name": "Ancient Space", "details_link": "https://www.metacritic.com/game/pc/ancient-space", "publisher": "Paradox Interactive", "release_date": "Sep 23 2014", "developers": ["CreativeForge Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "General"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/fc753c635b512b6713afb23d897de9a4-98.jpg", "descriptions": "Ancient Space is a single-player, real-time strategy title that puts the player in command of a fleet conducting a scientific mission on the edge of the known universe, charting what lies beyond in ‘The Black Zone.’ A rich and compelling story will guide the player as they build and upgradeAncient Space is a single-player, real-time strategy title that puts the player in command of a fleet conducting a scientific mission on the edge of the known universe, charting what lies beyond in ‘The Black Zone.’ A rich and compelling story will guide the player as they build and upgrade their fleets and then survive overwhelming odds in deadly strategic missions.… Expand"}, {"name": "Jurassic World Evolution", "details_link": "https://www.metacritic.com/game/playstation-4/jurassic-world-evolution", "publisher": "Frontier Developments", "release_date": "Jun 12 2018", "developers": ["Frontier Developments"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/000400fb9f70035522f6c17051f35cd6-98.jpg", "descriptions": "Place yourself at the heart of the Jurassic franchise and build your own Jurassic World.Take charge of operations on the legendary islands of the Muertes archipelago and bring the wonder, majesty and danger of dinosaurs to life. Build for Science, Entertainment or Security interests in anPlace yourself at the heart of the Jurassic franchise and build your own Jurassic World.Take charge of operations on the legendary islands of the Muertes archipelago and bring the wonder, majesty and danger of dinosaurs to life. Build for Science, Entertainment or Security interests in an uncertain world where life always finds a way.Bioengineer dinosaurs that think, feel and react intelligently to the world around them. Play with life itself to give your dinosaurs unique behaviours, traits and appearances, then contain and profit from them to fund your global search for lost dinosaur DNA.Control the big picture with deep management tools or go hands-on to confront challenges on the ground or in the air. Expand your islands and choose your own journey in an all-new narrative featuring iconic characters from across the franchise and decades of Jurassic lore at your fingertips.… Expand"}, {"name": "Space Empires V", "details_link": "https://www.metacritic.com/game/pc/space-empires-v", "publisher": "Strategy First", "release_date": "Oct 16 2006", "developers": ["Malfador Machinations"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/d32536203e52c9e0d4422c722402b03c-98.jpg", "descriptions": "Space Empires V is the latest edition in the Space Empires series. This latest chapter completely updates the user interface, and takes the player into a real-time rendered 3D universe. Watch space battles play out in glorious detail with realistic effects. Expand, Explore, Exploit, andSpace Empires V is the latest edition in the Space Empires series. This latest chapter completely updates the user interface, and takes the player into a real-time rendered 3D universe. Watch space battles play out in glorious detail with realistic effects. Expand, Explore, Exploit, and Exterminate in a huge, living, breathing galaxy. New features include: political alliances between multiple empires, a top-down ship design system, a hexagonal movement grid, and many more to keep players enthralled. Space Empires V is completely mod-able and even adds a scriptable AI system to the mix. [Strategy First]… Expand"}, {"name": "Gungrave: Overdose", "details_link": "https://www.metacritic.com/game/playstation-2/gungrave-overdose", "publisher": "Mastiff", "release_date": "Sep 15 2004", "developers": ["Seta Corporation"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/6bdc6defb104affcafe526a4ac85541f-98.jpg", "descriptions": "(Also known as \"Gungrave OD\") Beyond-The-Grave, our favorite undead-Mafioso-turned-almost-good-guy, is back to kick ass against the Corsione family and prevent them from using the Seed to gain control of the world. Joining Grave are two new unlockable characters: Juji Kabane, a blind,(Also known as \"Gungrave OD\") Beyond-The-Grave, our favorite undead-Mafioso-turned-almost-good-guy, is back to kick ass against the Corsione family and prevent them from using the Seed to gain control of the world. Joining Grave are two new unlockable characters: Juji Kabane, a blind, foul-mouthed, and perpetually angry swordsman who wears a shabby overcoat and carries a pair of gunblades, and Rocketbilly Redcadillac, a rock star who wears a red riding jacket and sports a slick ducktail. The designers of Gungrave: Overdose believe in the art of the kill, and to prove it they introduced Artistic Points, earned through elegant and effective destruction. Artistic Points unlock hidden moves and power-ups. [Mastiff]… Expand"}, {"name": "Digimon World: Next Order", "details_link": "https://www.metacritic.com/game/playstation-4/digimon-world-next-order", "publisher": "Bandai Namco Games", "release_date": "Jan 31 2017", "developers": ["B.B.Studio"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Trainer"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/8b021117b87aa92cf20c2d7f8aedfb2e-98.jpg", "descriptions": "The Digital World is in despair. Machinedramons are running rampant and causing utter chaos... the Digital World needs your help. Explore and traverse the Digital World to solve a digi-mystery. Recruit faithful Digimon companions and meet friends along the way to help you on this epic journey."}, {"name": "Agatha Christie: And Then There Were None", "details_link": "https://www.metacritic.com/game/pc/agatha-christie-and-then-there-were-none", "publisher": "The Adventure Company", "release_date": "Oct 30 2005", "developers": ["AWE Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "First-Person", "3D", "Point-and-Click", "Modern", "Third-Person", "Modern"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/e8777ab649ba9c7ea3fb335dba99e0cc-98.jpg", "descriptions": "In the classic story And Then There Were None, 10 people, each with something to hide and something to fear, are invited to a lonely mansion on Shipwreck Island by a host who, surprisingly, fails to appear. On the island, they are cut off from everything but each other and the inescapableIn the classic story And Then There Were None, 10 people, each with something to hide and something to fear, are invited to a lonely mansion on Shipwreck Island by a host who, surprisingly, fails to appear. On the island, they are cut off from everything but each other and the inescapable shadows of their own past lives. One by one, the guests share the darkest secrets of their wicked pasts. And one by one, they die... Agatha Christie fans, and newcomers to the genre, can look forward to a series of unexpected turns; although the storyline stays true to the original concept, players will encounter new plot twists. The first comes in the form of an 11th character, the player, a boatman who brings the others to the island and then is trapped there himself. To save the lives of the intended victims, the player must unravel the motives behind the murders and uncover the identity of the killer. If successful, he will spare not only the lives of the remaining guests, but also his own. [The Adventure Company]… Expand"}, {"name": "Blanc", "details_link": "https://www.metacritic.com/game/pc/blanc", "publisher": "Gearbox Publishing", "release_date": "Feb 14 2023", "developers": ["Casus Ludi"], "platforms": ["Switch", "PC"], "num_players": "2 ", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 68, "users_score": 2.4, "image": "https://static.metacritic.com/images/products/games/9/b76ad01b41e07711832df119704048cf-98.jpg", "descriptions": "Blanc is an artistic cooperative adventure that follows the journey of a wolf cub and a fawn stranded in a vast, snowy wilderness. They must come together in an unlikely partnership to find their families. Two players take control of either the wolf cub or the fawn. Guide them through theBlanc is an artistic cooperative adventure that follows the journey of a wolf cub and a fawn stranded in a vast, snowy wilderness. They must come together in an unlikely partnership to find their families. Two players take control of either the wolf cub or the fawn. Guide them through the environment, unforgiving weather, and obstacles that you must face together. Build a relationship together locally on the same screen or from far away with online play.… Expand"}, {"name": "Little Orpheus", "details_link": "https://www.metacritic.com/game/playstation-4/little-orpheus", "publisher": "Secret Mode", "release_date": "Sep 13 2022", "developers": ["The Chinese Room"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/e9cd1f9360a16c69cd78ae05cd14e7be-98.jpg", "descriptions": "The year is 1962 and NASA are trying to put a man on the moon. In a remote corner of Siberia, a Soviet cosmonaut is heading in the other direction. Comrade Ivan Ivanovich is dropped into an extinct volcano in his exploration capsule, Little Orpheus, to explore the center of the earth. HeThe year is 1962 and NASA are trying to put a man on the moon. In a remote corner of Siberia, a Soviet cosmonaut is heading in the other direction. Comrade Ivan Ivanovich is dropped into an extinct volcano in his exploration capsule, Little Orpheus, to explore the center of the earth. He promptly vanishes.Join our bold yet hapless hero as he explores lost civilizations, undersea kingdoms, prehistoric jungles and lands beyond imagination. Gasp as he battles the subhuman tribe of the Menkv and escapes the clutches of dreadful monsters! Cheer as he triumphs over impossible odds and brings socialism to the subterranean worlds!Little Orpheus is a technicolor side-scrolling adventure game inspired by classic movies like Flash Gordon, Sinbad and The Land that Time Forgot. Delivered in eight bite-size, commute-friendly episodes, Little Orpheus is simple enough for casual players but rich enough for seasoned adventure fans.… Expand"}, {"name": "Tunche", "details_link": "https://www.metacritic.com/game/pc/tunche", "publisher": "LEAP Game Studios", "release_date": "Nov  2 2021", "developers": ["LEAP Game Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/04d46dbfba03931bceb6c6b147647f3b-98.jpg", "descriptions": "A beautiful hand-drawn adventure awaits! With 5 playable characters (featuring Hat Kid) and a 4-player couch co-op, this beat'em up will capture your heart!Tunche is a charming, hand-drawn beat'em up with roguelike elements, co-op, and a pinch of shaman witchcraft. Choose one of the fiveA beautiful hand-drawn adventure awaits! With 5 playable characters (featuring Hat Kid) and a 4-player couch co-op, this beat'em up will capture your heart!Tunche is a charming, hand-drawn beat'em up with roguelike elements, co-op, and a pinch of shaman witchcraft. Choose one of the five characters, master their skill sets and ultimate abilities, defeat epic bosses, and unravel the secrets of the mysterious Amazonian jungle! The game is centered around high-risk, high-reward combat, and a 'stylish' grade system. Choose a hero that suits your playstyle the most and begin your journey through 4 different worlds, each filled with unique enemies.… Expand"}, {"name": "Madden NFL 22", "details_link": "https://www.metacritic.com/game/playstation-5/madden-nfl-22", "publisher": "Electronic Arts", "release_date": "Aug 17 2021", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 68, "users_score": 0.6, "image": "https://static.metacritic.com/images/products/games/9/958603d95454f06a3aa4b8290d406997-98.jpg", "descriptions": "There will be more detailed staff management and skill tree progression systems, with comprehensive weekly game strategy that integrates into your gameplan. Through the regular season and off-season, new scenarios will keep things fresh as you weigh various risks and rewards to make theThere will be more detailed staff management and skill tree progression systems, with comprehensive weekly game strategy that integrates into your gameplan. Through the regular season and off-season, new scenarios will keep things fresh as you weigh various risks and rewards to make the right decisions for your team. Plus, Franchise will see improvements throughout the year via three Live Service updates. Our first live service update targeting September to release is one of your top requested features, Player Scouting. Keep an eye out for more Gridiron Notes as each Live Service update rolls in. The Yard is back with a new challenge-based Solo campaign. You can now visit new fields located on gorgeous beaches and beautiful mountain landscapes across the world, battle boss characters with unmatched NFL talents, and unlock celebrations and items for your avatar. Plus, a new ranked mode can allow for you competitive Yard players out there to test your skills against one another and earn rewards. Face of the Franchise returns - and this time with more customization. The mode lets you shape your story as a quarterback, wide receiver, running back, or (for the first time ever) a linebacker striving to reach NFL superstardom and become more than the game. You’ll start out prepping for the NFL and experiencing flashbacks to your most pivotal college football moments. You’ll then take the stage on Draft Day and begin the once in a lifetime NFL journey, playing every game of your rookie season, rising to the top all based on the choices you make. An all-new Player Class and progression system also lets you choose your skills, ratings, and unique attributes with even more customization options to realistically craft your avatar. You can also level up this year by sharing progression between The Yard and the all-new Face of the Franchise: Unite We Rise, so you never miss a beat.  Superstar KO is back again in Madden NFL 22 with a co-op eliminator mode. You’ll be able to play quick games in unique stadiums with fan favorite house rules and icons of football culture. Authentic NFL teams, various stadiums and rosters will also be available for the first time.… Expand"}, {"name": "Haven Park", "details_link": "https://www.metacritic.com/game/switch/haven-park", "publisher": "Mooneye Studios", "release_date": "Aug  5 2021", "developers": ["Fabien Weibel", "Bubble Studio"], "platforms": ["PC", "Switch"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/baa8cb06983a4ebf0e5c720df0031e94-98.jpg", "descriptions": "Explore a tiny and peaceful open world. Meet and talk to the campers, find the resources required to build cosy little campings and keep the campers happy. You will also have plenty of side quests on your journey. But no rush, this place is your safe haven to discover. Haven Park wasExplore a tiny and peaceful open world. Meet and talk to the campers, find the resources required to build cosy little campings and keep the campers happy. You will also have plenty of side quests on your journey. But no rush, this place is your safe haven to discover. Haven Park was inspired by games like A Short Hike or Animal Crossing, so if you are a fan of those, this game is definitely for you.… Expand"}, {"name": "Stonefly", "details_link": "https://www.metacritic.com/game/playstation-4/stonefly", "publisher": "MWM Interactive", "release_date": "Jun  1 2021", "developers": ["Flight School Studio"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/4a690b210d949398700f0cfab7033704-98.jpg", "descriptions": "Harness the wind and soar through the wilderness of Stonefly, a chill and tranquil action-adventure game about self-discovery, legacy, and belonging. Glide your mech strategically among beautiful flora and dangerous fauna, confronting hungry bugs, adventures, and memorable characters."}, {"name": "Godstrike", "details_link": "https://www.metacritic.com/game/pc/godstrike", "publisher": "Freedom Games", "release_date": "Apr 15 2021", "developers": ["OverPowered Team"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/99893f115f2157226a2a31da8c94ad4e-98.jpg", "descriptions": "Godstrike is a twin-stick shooter where time is your health and currency. Face off against ruthless bosses in tense, 1v1 showdowns as Talaal, the last Herald."}, {"name": "Chronos: Before the Ashes", "details_link": "https://www.metacritic.com/game/playstation-4/chronos-before-the-ashes", "publisher": "Gunfire Games", "release_date": "Dec  1 2020", "developers": ["Gunfire Games"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/ddfd061c433830fc695dc2a8a37e0945-98.jpg", "descriptions": "An Adventure RPG with a refreshing combination of adventure game elements and RPG mechanics. Deep combat - a variety of weapons, abilities and powers are available to the player in the pursuit of their quest. Unique aging mechanic - Every time the player dies they age One year. Players mustAn Adventure RPG with a refreshing combination of adventure game elements and RPG mechanics. Deep combat - a variety of weapons, abilities and powers are available to the player in the pursuit of their quest. Unique aging mechanic - Every time the player dies they age One year. Players must adapt to their advancing age as they progress their character; starting the game young, nimble and quick, and ending wise and more attuned to magic.… Expand"}, {"name": "Port Royale 4", "details_link": "https://www.metacritic.com/game/pc/port-royale-4", "publisher": "Kalypso", "release_date": "Sep 25 2020", "developers": ["Gaming Minds Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Management", "General", "Government"], "meta_score": 68, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/3/e381c3e6edceba35bfb079f34599e650-98.jpg", "descriptions": "Set sail and join the colonial powers of Spain, England, France and the Netherlands in their fight for supremacy of the Caribbean in the 17th century. In 'Port Royale 4' you will take control of a colony as a young and ambitious governor, eager to learn what it takes to manage and grow theirSet sail and join the colonial powers of Spain, England, France and the Netherlands in their fight for supremacy of the Caribbean in the 17th century. In 'Port Royale 4' you will take control of a colony as a young and ambitious governor, eager to learn what it takes to manage and grow their small settlement into a bustling trader city. \r\rDevelop production chains connecting multiple islands and create complex trade routes across the Caribbean, covering the ever-growing needs of the respective cities. Make use of the detailed sea map to avoid stormy weather regions, cliffs or shallow waters. Fulfil tasks for your nation's viceroy, earning more fame to unlock town buildings, ships and more. Conquer the cities of rival nations or hunt down their fleets with a letter of marque while also keeping a keen eye out for pirates and other privateers. \r\rFor the first time in the series, naval battles will be turn-based, with up to 8 ships battling at one time and tactical captain maneuvers that can turn the tide in even the most hopeless of situations for a glorious victory.… Expand"}, {"name": "Ageless", "details_link": "https://www.metacritic.com/game/switch/ageless", "publisher": "Team17", "release_date": "Jul 28 2020", "developers": ["One More Dream Studios"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/282ac7e3374b45c8a4e3c0ba32173f50-98.jpg", "descriptions": "Assume the role of Kiara, a young woman who discovers a mystical bow armed with the ancient power to control ageing. Shoot animals and plants to age them backwards and forwards through their young, prime and old stages to progress, survive challenging levels, and master becoming ‘ageless’.Assume the role of Kiara, a young woman who discovers a mystical bow armed with the ancient power to control ageing. Shoot animals and plants to age them backwards and forwards through their young, prime and old stages to progress, survive challenging levels, and master becoming ‘ageless’. Kiara’s new-found power is not without consequence; the narrative follows the journey she must make to confront her inner demons and find herself along the way.… Expand"}, {"name": "The Complex", "details_link": "https://www.metacritic.com/game/xbox-one/the-complex", "publisher": "Wales Interactive", "release_date": "Mar 31 2020", "developers": ["Wales Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/be02fd8400ce758e6163c73ad13a4b34-98.jpg", "descriptions": "The Complex is an interactive sci-fi thriller movie from the publishers of Late Shift and The Bunker. After a major bio-weapon attack on London, two scientists find themselves in a locked-down laboratory with time, and air, running out. Your actions and your relationship with otherThe Complex is an interactive sci-fi thriller movie from the publishers of Late Shift and The Bunker. After a major bio-weapon attack on London, two scientists find themselves in a locked-down laboratory with time, and air, running out. Your actions and your relationship with other characters will lead you to one of eight suspenseful endings.… Expand"}, {"name": "Speaking Simulator", "details_link": "https://www.metacritic.com/game/switch/speaking-simulator", "publisher": "Affable Games", "release_date": "Jan 30 2020", "developers": ["Affable Games"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "Virtual", "Virtual Life"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/04812f18da1134e7536811411a81ea68-98.jpg", "descriptions": "THIS GAME IS ABOUT BEING A REGULAR NORMAL HUMAN. NOT A ROBOT. You will move your meat mouth to make words in social situations with other flesh humans. Gain valuable information from colleagues to climb the corporate ladder and upgrade your social skills. Definitely not a robot."}, {"name": "Argonus and the Gods of Stone", "details_link": "https://www.metacritic.com/game/pc/argonus-and-the-gods-of-stone", "publisher": "Zojoi Studios", "release_date": "Oct  8 2019", "developers": ["Zojoi Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/f723a1addbe89da7fc8be5235b80aa62-98.jpg", "descriptions": "The creators of Shadowgate present Argonus and the Gods of Stone, an epic first-person adventure set in ancient Greece. Stranded on an uncharted isle, you must use your wits to unlock legendary mysteries, barter with gods and overcome an evil that threatens to bring the world to ruin..."}, {"name": "London Detective Mysteria", "details_link": "https://www.metacritic.com/game/playstation-vita/london-detective-mysteria", "publisher": "XSEED Games", "release_date": "Dec 18 2018", "developers": ["Karin Entertainment"], "platforms": ["PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 68, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/350b036813524f7fe1482dcb4580d258-98.jpg", "descriptions": "Her Majesty’s birthday was to be the heiress of House Whiteley’s debut into high society, but an inquiring mind begs for more than parties as she stumbles into London’s darkest corners and sharpens her instincts as a detective."}, {"name": "Manual Samuel", "details_link": "https://www.metacritic.com/game/switch/manual-samuel", "publisher": "Curve Digital", "release_date": "Aug 16 2018", "developers": ["Perfectly Paranormal"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/34ba3674ba2f3fc0dc7c26a7cb6e63ee-98.jpg", "descriptions": "Meet Samuel, he’s handsome, wealthy and most importantly – dead. A deal with Death gives Samuel one last chance to live again if he can survive a whole day doing everything manually. Manual Samuel is a classic adventure game with a wild twist. After making a deal with Death, our hero, theMeet Samuel, he’s handsome, wealthy and most importantly – dead. A deal with Death gives Samuel one last chance to live again if he can survive a whole day doing everything manually. Manual Samuel is a classic adventure game with a wild twist. After making a deal with Death, our hero, the spoiled rich-kid Samuel, must survive for 24 hours controlling his entire body manually. From breathing and blinking to driving and working, all these tasks will fall to you. It won’t be easy, with Death himself tagging along for the ride, you might be in some very deep feces. Now updated to take advantage of the Nintendo Switch Joy-Con features such as motion sensors and split Joy-Con support for 2 player co-op. … Expand"}, {"name": "Pure Farming 2018", "details_link": "https://www.metacritic.com/game/playstation-4/pure-farming-2018", "publisher": "Techland", "release_date": "Mar 13 2018", "developers": ["Techland"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/1ccddb2c2a98f23156654dc572feae07-98.jpg", "descriptions": "Go global and expand your farm across four continents. Use the latest technology and state-of-the-art licensed machines to manage all aspects of modern farming, from cultivating land and growing crops to breeding livestock and producing green energy. Travel between Europe, Asia, and bothGo global and expand your farm across four continents. Use the latest technology and state-of-the-art licensed machines to manage all aspects of modern farming, from cultivating land and growing crops to breeding livestock and producing green energy. Travel between Europe, Asia, and both Americas to plant region-specific crops such as hemp, coffee beans, cherries, and olives using dedicated farming vehicles. Play the way you like best: three vastly different modes means this game is meant for you, no matter if you are a simulation veteran or an enthusiastic newcomer.… Expand"}, {"name": "Sparkle Unleashed", "details_link": "https://www.metacritic.com/game/switch/sparkle-unleashed", "publisher": "10tons", "release_date": "Dec 25 2017", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Matching"], "meta_score": 68, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/ecefecd16de6552d39fbc9d585e18612-98.jpg", "descriptions": "Experience the fabled Sparkle brand action puzzle like never before! Make your way through a secluded world of mystery, light magical braziers and discover a way to banish the darkness once and for all.\r Unlock potent powerups and use the ones you like the most to overcome Chained Orbs,Experience the fabled Sparkle brand action puzzle like never before! Make your way through a secluded world of mystery, light magical braziers and discover a way to banish the darkness once and for all.\r Unlock potent powerups and use the ones you like the most to overcome Chained Orbs, Rock Orbs, Survival levels and other exciting challenges. Can you carve a path of light through the darkness?\r Sparkle Unleashed introduces floating Orb Slinger gameplay never before seen in a Sparkle series game. The unleashed Orb Slinger floats along the bottom of the screen providing a fresh way to experience the beloved Sparkle gameplay.… Expand"}, {"name": "The Castle Game", "details_link": "https://www.metacritic.com/game/playstation-4/the-castle-game", "publisher": "Neptune Interactive Inc.", "release_date": "Aug  4 2015", "developers": ["Neptune Interactive Inc."], "platforms": "PlayStation 4", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 68, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/356a3d61e96893cd11d1c358e5148c0b-98.jpg", "descriptions": "Ever played escort missions in a tower defense setting? Imagine using the defenses and walls to keep the enemies out, but also having safe and open paths for your allies to run through. Or how about having all the structures be destroyable? Now, some enemies are pretty dumb and will followEver played escort missions in a tower defense setting? Imagine using the defenses and walls to keep the enemies out, but also having safe and open paths for your allies to run through. Or how about having all the structures be destroyable? Now, some enemies are pretty dumb and will follow the path you cleverly designed, but the smarter ones will take out any structure that can pose a threat to them. So now you have defenses that can be damaged. To balance things out, you are given a giant hammer that can quickly repair structures. Engineers are also available to auto-repair any damaged structures nearby. [Neptune Interactive]… Expand"}, {"name": "Tetris Ultimate", "details_link": "https://www.metacritic.com/game/3ds/tetris-ultimate", "publisher": "Ubisoft", "release_date": "Nov 11 2014", "developers": ["Ubisoft", "Ubisoft San Francisco"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "3DS"], "genres": ["Puzzle", "Stacking"], "meta_score": 68, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/7/296d881e66327186712271506f900773-98.jpg", "descriptions": "The world’s most-loved puzzle game arrives on next-gen consoles, and is better than ever in Tetris Ultimate. With six exciting modes, fun new features, and unique visuals, the evolution of this iconic game is the ultimate must-have on next-gen consoles."}, {"name": "Pandora: First Contact", "details_link": "https://www.metacritic.com/game/pc/pandora-first-contact", "publisher": "Slitherine", "release_date": "Nov 14 2013", "developers": ["Proxy Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/9f34d5eb6d644a9c5061084751ddc643-98.jpg", "descriptions": "Pandora: First Contact is a science fiction 4X turn-based strategy game on a planetary scale, inspired by Sid Meier's Alpha Centauri.In the future, factions have risen up from opportunities and ideologies independent of governments. Private corporations and religious movements have startedPandora: First Contact is a science fiction 4X turn-based strategy game on a planetary scale, inspired by Sid Meier's Alpha Centauri.In the future, factions have risen up from opportunities and ideologies independent of governments. Private corporations and religious movements have started wars over greed, ideology and power. Many have died and many lands lay in ruin. Planet Earth has been exhausted and colonial attempts on other planetary bodies have been in vain.Finally, after decades of exploration, an interstellar probe has brought promise of a new world many light-years away. The most powerful factions have gathered their best men and women to send on a long journey to Pandora.Far from desolate, the earth-like planet has been found to host a plethora of indigenous life forms. While the gigantic monstrosities inland and at the oceans seem relatively calm, human-sized bugs and fungus are threatening to stop mankind's expansion.As the various factions strive to take control, each will research and develop numerous new technologies, discovering new weapons and industry, whilst opening trade agreements and forging alliances with other factions to gain a foothold. As they spread, they will discover ancient ruins from alien civilizations that will grant them advantages over their rivals.… Expand"}, {"name": "Saints Row IV: Enter the Dominatrix", "details_link": "https://www.metacritic.com/game/xbox-360/saints-row-iv-enter-the-dominatrix", "publisher": "Deep Silver", "release_date": "Oct 22 2013", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/069d67423ddd3ac65485b808c08590a6-98.jpg", "descriptions": "Enter the Dominatrix reveals the wild hijinx of the original vision of the canceled SR3 expansion. Steelport has been taken over by the Dominatrix and only the Saints can stop her from trapping everyone in a virtual prison! Includes behind-the-scenes commentary and the return of someEnter the Dominatrix reveals the wild hijinx of the original vision of the canceled SR3 expansion. Steelport has been taken over by the Dominatrix and only the Saints can stop her from trapping everyone in a virtual prison! Includes behind-the-scenes commentary and the return of some fan-favorite characters.… Expand"}, {"name": "Legasista", "details_link": "https://www.metacritic.com/game/playstation-3/legasista", "publisher": "NIS America", "release_date": "Aug 21 2012", "developers": ["System Prisma"], "platforms": "PlayStation 3", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/d77306cd31b4604e535c43aae4b87f0b-98.jpg", "descriptions": "In a world in which science has become a relic, people have learned to fear the ancient form of knowledge as magic spells and curses. Now a young man named Alto ventures to the mysterious Ivy Tower, which houses ancient relics of the lost art of science."}, {"name": "Battlefield: Play4Free", "details_link": "https://www.metacritic.com/game/pc/battlefield-play4free", "publisher": "Electronic Arts", "release_date": "Mar 10 2011", "developers": ["Digital Illusions"], "platforms": "PC", "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 68, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/1/5421fa6eb5cf567d9e60a6a0fd1c59f5-98.jpg", "descriptions": "Battlefield Play4Free is a next-generation online multiplayer FPS combining the very best of the Battlefield series."}, {"name": "Roogoo Attack", "details_link": "https://www.metacritic.com/game/ds/roogoo-attack", "publisher": "SouthPeak Games", "release_date": "Jun 16 2009", "developers": ["SpiderMonk"], "platforms": "DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/f8d1945415617ff2488e5fab7ec48e64-98.jpg", "descriptions": "Roogoo tasks players with guiding meteors in the form of shaped blocks through a series of rotating disks as a means of saving planet Roo and the entire Roogoo race. If aligned correctly, the disks allow the blocks to reach the ground and scores are awarded. Various obstacles and enemiesRoogoo tasks players with guiding meteors in the form of shaped blocks through a series of rotating disks as a means of saving planet Roo and the entire Roogoo race. If aligned correctly, the disks allow the blocks to reach the ground and scores are awarded. Various obstacles and enemies will impede the blocks’ movement and with the flow of meteor blocks steadily increasing as the game progresses, players will have to think on their feet to save the Roogoo and rack up seriously high scores. The Nintendo DS version boasts the same 3D gameplay that utilizes both screens, along with new levels, backgrounds and puzzle shapes unique to the handheld. [SouthPeak Games]… Expand"}, {"name": "Riviera: The Promised Land", "details_link": "https://www.metacritic.com/game/psp/riviera-the-promised-land", "publisher": "Atlus", "release_date": "Jul 11 2007", "developers": ["Sting"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Role-Playing", "General", "General"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/1b92723471b02315a12c148568d0856e-98.jpg", "descriptions": "1000 years have passed since Ragnarok, the war between Asgard, realm of the gods, and Utgard, home of the demons. Recently, the floating island of Riviera has been showing signs of the demons’ return. With the gods no longer present, another Ragnarok would mean certain doom for Asgard. The1000 years have passed since Ragnarok, the war between Asgard, realm of the gods, and Utgard, home of the demons. Recently, the floating island of Riviera has been showing signs of the demons’ return. With the gods no longer present, another Ragnarok would mean certain doom for Asgard. The decision had been made to evoke the Retribution and destroy Riviera; the Grim Angels Ein and Ledah were appointed as the executors of this task. Now, two angels descend upon the Promised Land. [Atlus Software]… Expand"}, {"name": "Jewel Quest", "details_link": "https://www.metacritic.com/game/xbox-360/jewel-quest", "publisher": "Microsoft Game Studios", "release_date": "Mar  3 2006", "developers": ["iWin"], "platforms": ["iPhone/iPad", "PC", "Wii U", "Xbox 360"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Matching", "General"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/c36b9a5458c21741a89a64fb3bed8e91-98.jpg", "descriptions": "[Xbox Live Arcade]  Jewel Quest is a unique new take on the classic-style matching game. Explore the ancient ruins of Mayan civilization while discovering hidden treasures and priceless artifacts. Rearrange valuable relics to turn sand tiles into gold. Watch out, though ... as you venture[Xbox Live Arcade]  Jewel Quest is a unique new take on the classic-style matching game. Explore the ancient ruins of Mayan civilization while discovering hidden treasures and priceless artifacts. Rearrange valuable relics to turn sand tiles into gold. Watch out, though ... as you venture deeper into the jungle, you will encounter increasingly difficult puzzles containing secret twists, cursed items, and buried artifacts. Earn the respect of your fellow archaeologists and collect oodles of treasures and jewels. Your quest is complete when you have solved every puzzle, uncovered all the gold statues, and proven yourself a Chief Explorer. Map your progress through 180 challenging puzzles. Encounter buried relics, cursed items, and mind-boggling boards. Immerse yourself in stunning graphics, captivating music, and the wild sounds of the jungle. Earn bonus points and extra lives as you advance through the quests. Get special hints help you with your battle against time. [Xbox.com]… Expand"}, {"name": "Crash Tag Team Racing", "details_link": "https://www.metacritic.com/game/psp/crash-tag-team-racing", "publisher": "Sierra Entertainment", "release_date": "Nov 10 2005", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "PSP"], "num_players": "24  Online", "genres": ["Driving", "Racing", "Car Combat", "Arcade", "Car Combat", "Automobile"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/e2e61016bb2c1f8e0e102be05dfd0376-98.jpg", "descriptions": "For the first time ever in a racing game, players will be able to fuse two cars together on the fly to form a super vehicle with the all-new \"clashing\" technology. In Crash Tag Team Racing, players can combine their car with an opponent’s mid-race to make a super-car equipped with a powerfulFor the first time ever in a racing game, players will be able to fuse two cars together on the fly to form a super vehicle with the all-new \"clashing\" technology. In Crash Tag Team Racing, players can combine their car with an opponent’s mid-race to make a super-car equipped with a powerful turret gun. When clashed, players can either get behind the wheel and drive or fire an onboard weapon. Each character has his or her own uniquely deadly 360? rotating turret. Players can continue the action out of the car where they can explore the entire world on foot and collect upgrades for their cars and unlock bonus tracks. [Vivendi Universal]… Expand"}, {"name": "True Crime: Streets of LA", "details_link": "https://www.metacritic.com/game/pc/true-crime-streets-of-la", "publisher": "Activision", "release_date": "May 11 2004", "developers": ["Luxoflux", "Inc."], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/0434fcfb84a35694c18fa50637c890a0-98.jpg", "descriptions": "True Crime: Streets of LA is the deepest combination of driving, fighting and shooting ever burned into one game. Take the role of rogue E.O.D. operative Nick Kang, assigned to the task of taking out the merciless Russian and Chinese crime syndicates plaguing the City of Angels. The actionTrue Crime: Streets of LA is the deepest combination of driving, fighting and shooting ever burned into one game. Take the role of rogue E.O.D. operative Nick Kang, assigned to the task of taking out the merciless Russian and Chinese crime syndicates plaguing the City of Angels. The action is non-stop and you can never repeat the same mission twice as you play through a branching storyline that takes place across 250 square miles of accurately recreated Los Angeles. [Activision]… Expand"}, {"name": "Medal of Honor Rising Sun", "details_link": "https://www.metacritic.com/game/playstation-2/medal-of-honor-rising-sun", "publisher": "EA Games", "release_date": "Nov 11 2003", "developers": ["EA LA"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/26eb4852c12d647c9605b25b52b92ac0-98.jpg", "descriptions": "Step into the boots of a World War II soldier and survive Pearl Harbor. The epic saga of World War II continues with Medal of Honor Rising Sun. The war has shifted to the Pacific Theatre, and its outcome depends on you. Play as Marine Corporal Joseph Griffin in a far-reaching tale of twoStep into the boots of a World War II soldier and survive Pearl Harbor. The epic saga of World War II continues with Medal of Honor Rising Sun. The war has shifted to the Pacific Theatre, and its outcome depends on you. Play as Marine Corporal Joseph Griffin in a far-reaching tale of two brothers that weaves its storyline from this title into the next game in the award-winning MOH franchise. As Japanese forces seek to expand their dominion over the Pacific, you must use stealth, commando tactics, and sabotage to turn the tide in your favor. Featuring real-life historical battles like Pearl Harbor and Guadalcanal, over 20 authentic WWII weapons, highly intelligent enemies, and a heroic cast of characters that fight on your side from level to level, Medal of Honor Rising Sun delivers the standard-setting experience for all action games. [Electronic Arts]… Expand"}, {"name": "Kung Fu Chaos", "details_link": "https://www.metacritic.com/game/xbox/kung-fu-chaos", "publisher": "Microsoft Game Studios", "release_date": "Feb 24 2003", "developers": ["Just Add Monsters"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 68, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/0255e09b2aba13eb73cb808b984caf89-98.jpg", "descriptions": "Kung Fu Chaos is an entertaining brawler game inspired by the 70s Kung Fu movie era.  You fight as one of nine characters--three of which are unlockable--with looks, moves, and taunts based on kung-fu movie icons.  Your quest for movie stardom places you on a dynamic movie set, and when theKung Fu Chaos is an entertaining brawler game inspired by the 70s Kung Fu movie era.  You fight as one of nine characters--three of which are unlockable--with looks, moves, and taunts based on kung-fu movie icons.  Your quest for movie stardom places you on a dynamic movie set, and when the director yells \"Action!\" you fight against multiple enemies either by yourself or with three friends.  Perform over-the-top, Hong-Kong-style combat--including leaps, and flying kicks--and you'll become a star in no time. … Expand"}, {"name": "Mobile Forces", "details_link": "https://www.metacritic.com/game/pc/mobile-forces", "publisher": "Majesco Games", "release_date": "Aug 16 2002", "developers": ["Rage Software"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/07f04bd6c734f12795475afaf2f4cbd4-98.jpg", "descriptions": "Mobile Forces is a first-person shooter full of relentless foot-based action and, realistic vehicle combat. Fight through twelve massive single-player environments and plenty of multi-player modes designed specifically for vehicle warfare. Use a full arsenal of deadly weaponry from M-16's toMobile Forces is a first-person shooter full of relentless foot-based action and, realistic vehicle combat. Fight through twelve massive single-player environments and plenty of multi-player modes designed specifically for vehicle warfare. Use a full arsenal of deadly weaponry from M-16's to sniper rifles. Drive a fleet of heavily-armored vehicles or, jump in the back of someone else's and use the hard-mounted weapons to dispatch a foe. Fans of open-terrain, real-world action games will definitely want to add this one to their collection. [Majesco Sales Inc.]… Expand"}, {"name": "Shadow Man: 2econd Coming", "details_link": "https://www.metacritic.com/game/playstation-2/shadow-man-2econd-coming", "publisher": "Acclaim", "release_date": "Mar  2 2002", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/ebefd643332d2e90d42c36e2b090fc2e-98.jpg", "descriptions": "A large scale 3rd person multiple route horror adventure, featuring a combination of platform, combat, stealth and puzzle based gameplay. As Mike LeRoi, the Shadow Man, Walker Between Worlds, Lord of Deadside, you battle the Grigori, a group of sadistic demons that have been masquerading asA large scale 3rd person multiple route horror adventure, featuring a combination of platform, combat, stealth and puzzle based gameplay. As Mike LeRoi, the Shadow Man, Walker Between Worlds, Lord of Deadside, you battle the Grigori, a group of sadistic demons that have been masquerading as humans for the past 2000 years and now seek to return their monstrous leader, Asmodeus, from the Pit. [Acclaim]… Expand"}, {"name": "Vanishing Point", "details_link": "https://www.metacritic.com/game/playstation/vanishing-point", "publisher": "Acclaim", "release_date": "Feb  5 2001", "developers": ["Clockwork Games"], "platforms": "PlayStation", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/46101f176dbb0d6afe256a73bf368857-98.jpg", "descriptions": "Vanishing Point is one of the most original and enjoyable racing games to come around in a long time."}, {"name": "Senran Kagura: Estival Versus", "details_link": "https://www.metacritic.com/game/playstation-4/senran-kagura-estival-versus", "publisher": "XSEED Games", "release_date": "Mar 15 2016", "developers": ["Tamsoft", "Marvelous Inc."], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Action", "General"], "meta_score": 67, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/e899cb0e764af6b72d431b8f1f768a7e-98.jpg", "descriptions": "The high-flying ninja girls of SENRAN KAGURA return, this time with more moves, more playable characters, more story and attitude, and more destruction online with matches that can support up to 10 players (PS4 version only; PS Vita supports up to 4 players). All the previous shinobi girlsThe high-flying ninja girls of SENRAN KAGURA return, this time with more moves, more playable characters, more story and attitude, and more destruction online with matches that can support up to 10 players (PS4 version only; PS Vita supports up to 4 players). All the previous shinobi girls return with a host of upgraded moves to master, and new playable characters offer more challenges to conquer, along with a story that's equal parts sexy and shocking, serious and scandalous, busty and brawling. … Expand"}, {"name": "Castle of Shikigami III", "details_link": "https://www.metacritic.com/game/wii/castle-of-shikigami-iii", "publisher": "Aksys Games", "release_date": "May 13 2008", "developers": ["Alfa System"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 67, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/a244b087144459370dc7d9a3fd3474d3-98.jpg", "descriptions": "Castle of Shikigami III is a vertical scrolling shoot’em-up for the Wii. Tension Bonus System - Your proximity to enemy units and gunfire determines your score and firepower. 10 memorable characters - Each character has their own specialized weapons and powers, anything from chain lightningCastle of Shikigami III is a vertical scrolling shoot’em-up for the Wii. Tension Bonus System - Your proximity to enemy units and gunfire determines your score and firepower. 10 memorable characters - Each character has their own specialized weapons and powers, anything from chain lightning to psychic blades. 55 possible story combinations - Experience a wide variety of scenarios with fully voiced dialogue. 2 Player Co-op Mode - Dodge a never-ending barrage of bullets alone or with a friend. Exclusive console-only Dramatic Change Mode - Switch between two characters in the middle of the fight to improve your chances for survival! [Aksys Games]… Expand"}, {"name": "Shrek SuperSlam", "details_link": "https://www.metacritic.com/game/playstation-2/shrek-superslam", "publisher": "Activision", "release_date": "Oct 25 2005", "developers": ["Shaba Games"], "platforms": "PlayStation 2", "num_players": "24  Online", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/a0830678c83830a8f129424c3a9206a7-98.jpg", "descriptions": "Slam, smash, beat and brawl your friends in Shrek SuperSlam - the most twisted fighting game ever. Play as 20 characters from the Shrek universe, including Shrek, Donkey, Puss in Boots, and the villainous Prince Charming. SuperSlam your opponents through windows and walls in 16 fullySlam, smash, beat and brawl your friends in Shrek SuperSlam - the most twisted fighting game ever. Play as 20 characters from the Shrek universe, including Shrek, Donkey, Puss in Boots, and the villainous Prince Charming. SuperSlam your opponents through windows and walls in 16 fully destructible environments. Run for cover when characters unleash their signature fighting moves, like Shrek’s disgusting Green Storm (better plug your nose!) and Puss in Boots’ irresistible Cute Attack. And weapons like the Big Fairy Bazooka and the Hammer of Smiting give you endless ways to blast your opponents into oblivion. Up to four players. [Activision]… Expand"}, {"name": "JETT: The Far Shore", "details_link": "https://www.metacritic.com/game/pc/jett-the-far-shore", "publisher": "Superbrothers", "release_date": "Oct  5 2021", "developers": ["Superbrothers", "Pine Scented Software"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 67, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/02becf1f8af4f9ccf72d4c58c81e90df-98.jpg", "descriptions": "JETT: The Far Shore invites you on an interstellar trip to carve out a future for a people haunted by oblivion in this cinematic action-adventure. As scout Mei, be the first to deploy to a mythic ocean planet. Take the helm of a 'jett' and explore a vast unknown – skim low over waves, roarJETT: The Far Shore invites you on an interstellar trip to carve out a future for a people haunted by oblivion in this cinematic action-adventure. As scout Mei, be the first to deploy to a mythic ocean planet. Take the helm of a 'jett' and explore a vast unknown – skim low over waves, roar up pristine coastlines and carve through otherworldly woods. Adapt to an intricate, systemic open world and persevere through adversity alongside an intimate ensemble cast in this story of courage, wonder and regret.\r Embark on an exploratory single-player adventure presented in five captivating acts encompassing monumental moments, laid-back exploration, occasional white-knuckle action, moments of heartfelt companionship, and a helping of existential dread. \r… Expand"}, {"name": "SYNTHETIK: Ultimate", "details_link": "https://www.metacritic.com/game/switch/synthetik-ultimate", "publisher": "Flow Fire Games", "release_date": "Dec 16 2020", "developers": ["Flow Fire Games"], "platforms": ["Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 67, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/7/a113882eaf1f583b9a5a3654fe829d43-98.jpg", "descriptions": "SYNTHETIK is an unforgiving tactical shooter rogue-lite where freedom and experimentation is key. Fight against relentless opponents and unforgiving bosses encased in ever-changing environments. Master the uniquely deep and satisfying weapon mechanics and the unprecedented amount ofSYNTHETIK is an unforgiving tactical shooter rogue-lite where freedom and experimentation is key. Fight against relentless opponents and unforgiving bosses encased in ever-changing environments. Master the uniquely deep and satisfying weapon mechanics and the unprecedented amount of customization. Discover a seemingly unending amount of weapons, items, perks and character upgrades.… Expand"}, {"name": "Giga Wrecker Alt.", "details_link": "https://www.metacritic.com/game/playstation-4/giga-wrecker-alt", "publisher": "Rising Star Games", "release_date": "Apr 12 2019", "developers": ["Game Freak"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/9/d70db00020770270d6415a2018aaf217-98.jpg", "descriptions": "In the near future, where Earth has been ravaged by robot invaders, the fate of the planet rests of the shoulders of a young girl who becomes more than human. Saved from death and cursed with cybernetic powers beyond comprehension, it's up to Reika Rekkeiji to save humanity from the evilIn the near future, where Earth has been ravaged by robot invaders, the fate of the planet rests of the shoulders of a young girl who becomes more than human. Saved from death and cursed with cybernetic powers beyond comprehension, it's up to Reika Rekkeiji to save humanity from the evil Ajeet in this exciting new game from legendary developer Game Freak. GIGA WRECKER ALT. combines frantic platforming, intense combat and physics-based puzzle challenges into one exciting adventure. By destroying robotic enemies and the world around her, Reika can form the resulting debris into all manner of weapons and tools. Use these to overcome obstacles and solve puzzles, navigate through platform-laiden levels, then take the fight to the robot invaders and save mankind from extinction before it's too late.… Expand"}, {"name": "Record of Agarest War", "details_link": "https://www.metacritic.com/game/playstation-3/record-of-agarest-war", "publisher": "Aksys Games", "release_date": "Apr 27 2010", "developers": ["Compile Heart"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 67, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/1d8815c95e72e8481b9c2af0b3884b99-98.jpg", "descriptions": "War darkened the skies of Agarest. Not a simple war between mortals, easily ended by divine intervention, but a war that split the gods themselves. Armies such as the world had never seen before, and would never see again, clashed in the skies of Agarest, across its surface, and even in theWar darkened the skies of Agarest. Not a simple war between mortals, easily ended by divine intervention, but a war that split the gods themselves. Armies such as the world had never seen before, and would never see again, clashed in the skies of Agarest, across its surface, and even in the caverns that wound their way through its interior. As is the way in war, many died on both sides, gods and mortals alike, and the war left Agarest broken, blackened, and dead. The gods wept for their paradise, and in a final act of creation, sacrificed themselves to bring life back to its charred and twisted surface. Although the gods are long dead, the withering darkness that began and fueled their war is not. Imprisoned for millennia, its bonds have begun to weaken, and as they do, a shadow once again spreads across the surface of the world. Born into this world perched unknowingly on the brink of the apocalypse, a young man by the name of Leonhardt and his descendants are the last, best hope for Agarest. Their journey will span generations and continents as they strive to once again bring peace to their beleaguered world, even as the cost of their own souls. [Aksys Games]… Expand"}, {"name": "Milky Way Prince: The Vampire Star", "details_link": "https://www.metacritic.com/game/pc/milky-way-prince-the-vampire-star", "publisher": "Santa Ragione", "release_date": "Aug 13 2020", "developers": ["Lorenzo Redaelli", "Eyeguys"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 67, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/e6519c921a2465d9ff15ebad01277eb6-98.jpg", "descriptions": "A visual novel about an abusive relationship, idealization, and intimacy. Live a summer of dysfunctional love through branching storylines, twists, sudden changes, and an innovative mechanic where you choose which senses to use with your boyfriend."}, {"name": "Knights of Pen & Paper 2", "details_link": "https://www.metacritic.com/game/pc/knights-of-pen-paper-2", "publisher": "Paradox Interactive", "release_date": "Oct 20 2015", "developers": ["Kyy Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 67, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/975078fc0ed784592d33ed2125c73d0a-98.jpg", "descriptions": "Prepare to inhabit a world of chivalry, class warfare and off-beat pop references. Knights of Pen & Paper 2 is a turn-based, retro style, pixel-art adventure full of danger, intrigue, death, and saving throws! Players assume the role of a group of teenagers, playing a classic pen &Prepare to inhabit a world of chivalry, class warfare and off-beat pop references. Knights of Pen & Paper 2 is a turn-based, retro style, pixel-art adventure full of danger, intrigue, death, and saving throws! Players assume the role of a group of teenagers, playing a classic pen & paper RPG to overcome dicey situations. As both party and game master, they get to assemble both their characters, and the challenges they will face. Select among mighty classes like Wizard, Thief or Warrior; proud races like Dwarf or Elf; and snark-slinging players like Goth, Lab Rat or Rocker. Choose quests and combat encounters, delve dungeons, craft powerful items and watch in horror as your muscle-packed barbarian rolls a one on his body check. Together, face the greatest threat the campaign world has ever faced: The new rules edition.… Expand"}]