[{"name": "World Racing 2", "details_link": "https://www.metacritic.com/game/pc/world-racing-2", "publisher": "Playlogic", "release_date": "Aug 14 2006", "developers": ["Synetic"], "platforms": ["PlayStation 2", "PC"], "num_players": "6  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/4ffc7e9f6c3b847d9496f81b08f18c18-98.jpg", "descriptions": "World Racing 2 is the sequel to World Racing – Mercedes Benz. It puts the fun of driving at centre stage and presents a challenging racing experience featuring a revolutionary 3D landscape engine, adjustable driving characteristics, improved technology and an exciting selection of differentWorld Racing 2 is the sequel to World Racing – Mercedes Benz. It puts the fun of driving at centre stage and presents a challenging racing experience featuring a revolutionary 3D landscape engine, adjustable driving characteristics, improved technology and an exciting selection of different cars from various manufacturers. World Racing 2 is all about fun racing. Players will enjoy better physics, simplified menus, speed-optimized track layouts and livelier 3D environments. [Playlogic]… Expand"}, {"name": "Rag Doll Kung Fu: Fists of Plastic", "details_link": "https://www.metacritic.com/game/playstation-3/rag-doll-kung-fu-fists-of-plastic", "publisher": "SCEA", "release_date": "Apr  9 2009", "developers": ["Tarsier Studios"], "platforms": "PlayStation 3", "num_players": "4  Online", "genres": ["Action", "Miscellaneous", "Fighting", "Fighting", "Party / Minigame", "2D", "2D"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/bac58ae5a11e45086934517bd4eaa5d8-98.jpg", "descriptions": "[Playstation Network]  Developed by Tarsier Studios, Rag Doll Kung Fu: Fists of Plastic is a PS3 exclusive party-fighting game based on the original 2005 title, Rag Doll Kung Fu, created by Mark Healy (co-founder of Media Molecule). A fast-paced combat game with an imaginative look and feel,[Playstation Network]  Developed by Tarsier Studios, Rag Doll Kung Fu: Fists of Plastic is a PS3 exclusive party-fighting game based on the original 2005 title, Rag Doll Kung Fu, created by Mark Healy (co-founder of Media Molecule). A fast-paced combat game with an imaginative look and feel, Ragdoll Kung Fu: Fists of Plastic focuses on fun with exaggerated ragdoll physics action and charming HD visuals. Featuring accessible and intuitive controls, novice players can orchestrate impressive attacks with ninja-like precision, while offering hardcore players an intense combat system, use-of-weapons and strategy. Success depends on mastering basic Kung Fu moves while sharpening their acrobatic skills to swing off platforms and somersault through the air. This action builds up Chi Power, which can be conjured to perform spectacular SIXAXIS wireless controller-triggered special attack moves and combat sequences. Players can even taunt their opponents with the Free Pose system, ensuring the battle is infused with lighthearted fun. Perfect for any social occasion, Rag Doll Kung Fu: Fists of Plastic offers frantic multiplayer action for up to four players locally. [SCEA]… Expand"}, {"name": "Phantom Breaker: Omnia", "details_link": "https://www.metacritic.com/game/playstation-4/phantom-breaker-omnia", "publisher": "Rocket Panda Games", "release_date": "Mar 15 2022", "developers": ["Rocket Panda Games", "GameLoop"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/57bd1e27d2cd2d2af08b33bf72c04a61-98.jpg", "descriptions": "Phantom Breaker: Omnia, a massive update to Phantom Breaker: Extra, a 1-vs-1 2D anime fighter originally released by Mages in 2013. The game features 2 guest characters, Kurisu Makise from Steins;Gate and Rimi Sakihata from Chaos;Head, as well as two brand new characters created specificallyPhantom Breaker: Omnia, a massive update to Phantom Breaker: Extra, a 1-vs-1 2D anime fighter originally released by Mages in 2013. The game features 2 guest characters, Kurisu Makise from Steins;Gate and Rimi Sakihata from Chaos;Head, as well as two brand new characters created specifically for Phantom Breaker Omnia.A mysterious man, known only as 'Phantom' appeared in Tokyothe capital city of Japanand manipulated vulnerable adolescents into fighting each other, bestowing upon them mystical weapons of great strength known as 'Fu-mension Artifacts.' In exchange, he promised to grant their wish if they survive.Unbeknownst to the combatants, the fierce clashes between Fu-mension Artifacts caused distortions in space-time, which compromised the boundaries between parallel universes. The collapse of these parallel universes would ultimately break the seal, unleashing Phantom's destructive powers.… Expand"}, {"name": "Mini Motor Racing X", "details_link": "https://www.metacritic.com/game/switch/mini-motor-racing-x", "publisher": "The Binary Mill", "release_date": "Sep 17 2020", "developers": ["The Binary Mill"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 4 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/16ec376ba3d92baa7951c0cd1d02683f-98.jpg", "descriptions": "Mini Motor Racing X explodes onto Nintendo Switch™ with local split screen and online multiplayer high-octane racing action. The classic Mini Motor career mode is back, with hundreds of races, dozens of cars to unlock and upgrade, and four fiendish championships to master, but that’s notMini Motor Racing X explodes onto Nintendo Switch™ with local split screen and online multiplayer high-octane racing action. The classic Mini Motor career mode is back, with hundreds of races, dozens of cars to unlock and upgrade, and four fiendish championships to master, but that’s not all. MMRX adds some firepower to the mix in the new Type-X mode. MULTIPLAYER: Full online multiplayer with up to four friends or random player as well as local career mode co-op. LOCAL SPLITSCREEN ACTION: Race with upto 4 players on a single switch!\r MASSIVE CAREER MODE: Eight huge championships and 52 unique and vibrant environments to master, each with multiple day and night and weather variants.\r TYPE X’ BATTLE MODE: The same fast-paced racing action, but with the added chaos of weapons. Available for both career mode and multiplayer races.\r PARTY MODES: Play online or locally with friends with mini games such as Bumper Ball and Micro Motor Racing!\r… Expand"}, {"name": "Kill It With Fire", "details_link": "https://www.metacritic.com/game/pc/kill-it-with-fire", "publisher": "tinyBuild", "release_date": "Aug 13 2020", "developers": ["Casey Donnellan Games LLC"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/b27c39c5fe8b14e2404c8060490990d4-98.jpg", "descriptions": "Kill It With Fire is a first-person action game about hunting spiders and causing collateral damage."}, {"name": "WARTILE", "details_link": "https://www.metacritic.com/game/pc/wartile", "publisher": "Playwood Project", "release_date": "Feb  8 2018", "developers": ["Playwood Project"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/6d39bf2cfe55cca468f836ab97e2f6e6-98.jpg", "descriptions": "In WARTILE miniature figures battle it out in a real time strategy video game. Position your figurines, use their strengths and be mindful of their weaknesses, activate their special abilities and play your action cards to gain the upper hand on the playing field."}, {"name": "The Wizards: Enhanced Edition", "details_link": "https://www.metacritic.com/game/playstation-4/the-wizards-enhanced-edition", "publisher": "Carbon Studio", "release_date": "Mar 12 2019", "developers": ["Carbon Studio"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/793ec77ce95d160576d4635318fc3511-98.jpg", "descriptions": "Become a powerful sorcerer with a host of mighty spells at your fingertips and protect the realm of Meliora! The Wizards is an acclaimed action-adventure game with a unique gesture-based spellcasting system, designed for PS Move controllers."}, {"name": "MotoGP 10/11", "details_link": "https://www.metacritic.com/game/playstation-3/motogp-1011", "publisher": "Capcom", "release_date": "Mar 15 2011", "developers": ["Monumental Games"], "platforms": "PlayStation 3", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/f6f639ff218f2c7d4fd1c94eb9e3ac9d-98.jpg", "descriptions": "MotoGP 10/11 will deliver all the content from the 2010 MotoGP season and offer downloadable updates for the 2011 MotoGP championship shortly after the season starts."}, {"name": "The Ball", "details_link": "https://www.metacritic.com/game/pc/the-ball", "publisher": "Tripwire Interactive", "release_date": "Oct 26 2010", "developers": ["Teotl Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/0b77e1b800d022f2e483b8c079429fcb-98.jpg", "descriptions": "The Ball is a first person action-adventure game featuring a full single-player experience built on Epic's Unreal Engine 3 technology. As a swashbuckling archaeologist working on the slopes of a dormant volcano somewhere in Mexico, you get stuck in a cavern. It doesn't take long before youThe Ball is a first person action-adventure game featuring a full single-player experience built on Epic's Unreal Engine 3 technology. As a swashbuckling archaeologist working on the slopes of a dormant volcano somewhere in Mexico, you get stuck in a cavern. It doesn't take long before you realize this is more than just a cave. You reveal ancient ruins that have been hidden from outsiders for centuries and discover a mysterious artifact, a gold and metal shelled Ball. As you progress towards solving the mystery of this amazing place you must unlock the secrets of The Ball and learn to control this ancient artifact. You will also start to encounter not just puzzles and traps, but also various strange creatures - the guardians of this mystery. These creatures also have to be overcome, using only The Ball to defend you. Venturing deeper into the volcano, you reveal some of mankind's greatest secrets.… Expand"}, {"name": "The UnderGarden", "details_link": "https://www.metacritic.com/game/xbox-360/the-undergarden", "publisher": "Atari", "release_date": "Nov 10 2010", "developers": ["Vitamin G Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/c1468177b30be33a873b7a0d94cd1ba3-98.jpg", "descriptions": "Challenge your mind in the wondrous depths of The UnderGarden. Plunge into a unique new world exploring large underground caverns, encountering mysterious creatures to befriend or avoid. Solve mind-bending brainteasers and puzzles as soothing tunes accompany you on your journey through 14Challenge your mind in the wondrous depths of The UnderGarden. Plunge into a unique new world exploring large underground caverns, encountering mysterious creatures to befriend or avoid. Solve mind-bending brainteasers and puzzles as soothing tunes accompany you on your journey through 14 distinct levels of state of the art 3D graphics. The UnderGarden offers a mental challenge and aesthetic experience like nothing else. … Expand"}, {"name": "Evil Dead: Regeneration", "details_link": "https://www.metacritic.com/game/playstation-2/evil-dead-regeneration", "publisher": "THQ", "release_date": "Sep 13 2005", "developers": ["Cranky Pants Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 68, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/f86b7db9a0747bcdec91c97069972bfc-98.jpg", "descriptions": "Evil Dead Regeneration explores a \"what if...\" continuation from \"Evil Dead 2,\" one of the most unhinged films from famed director Sam Raimi. Voiced by Bruce Campbell, players control Ash, the reluctant hero of the series, as they're thrown into a masquerade of evil events, equipped with theEvil Dead Regeneration explores a \"what if...\" continuation from \"Evil Dead 2,\" one of the most unhinged films from famed director Sam Raimi. Voiced by Bruce Campbell, players control Ash, the reluctant hero of the series, as they're thrown into a masquerade of evil events, equipped with the latest in prosthetic fashion. Evil Dead Regeneration follows Ash, the lone survivor of a camp discovering the Necronomicon - the wholly evil book of the dead. Thought to have murdered his companions, Ash is arrested, convicted of the crime, and sentenced to Sunny Meadows, an institute for the criminally insane, but not for long. Ash's peaceful stay is about to end - thanks to the perverted experiments of his very own psychiatrist, Dr. Reinhard. Hell-bent on using science to harness the Necronomicon's powers, the mad doctor unleashes the book's all-powerful Evil on the world - releasing a new slew of Deadites, monsters and spirits, twisting reality into a hellish strudel and leaving mankind with that not-so-fresh apocalyptic feeling. [THQ]… Expand"}, {"name": "The Punisher", "details_link": "https://www.metacritic.com/game/playstation-2/the-punisher", "publisher": "THQ", "release_date": "Jan 17 2005", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/4434c154e67e6c0377f30bba6221b7a3-98.jpg", "descriptions": "Driven by a hatred of crime bordering on insanity, Frank Castle became The Punisher, a one-man army whose mission goes far beyond revenge. Taking on the city's high-powered crime lords, he wreaks havoc on the corrupt with methods reserved for those on the wrong side of the law. \"TheDriven by a hatred of crime bordering on insanity, Frank Castle became The Punisher, a one-man army whose mission goes far beyond revenge. Taking on the city's high-powered crime lords, he wreaks havoc on the corrupt with methods reserved for those on the wrong side of the law. \"The Punisher\" video game represents the best of over 30 years of \"Punisher\" comic books and depicts some of the grittiest storylines in the Marvel Universe. [THQ]… Expand"}, {"name": "Star Wars The Clone Wars: Jedi Alliance", "details_link": "https://www.metacritic.com/game/ds/star-wars-the-clone-wars-jedi-alliance", "publisher": "LucasArts", "release_date": "Nov 11 2008", "developers": ["LucasArts"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/f6fba4219f058ea75e86ccc19903be75-98.jpg", "descriptions": "Star Wars The Clone Wars: Jedi Alliance takes the player into the world of the all-new Star Wars animated feature film and TV series. Experience the combined power when two Jedi join forces to fight as one. Choose your favorite Jedi pair at the start of each mission and experience uniqueStar Wars The Clone Wars: Jedi Alliance takes the player into the world of the all-new Star Wars animated feature film and TV series. Experience the combined power when two Jedi join forces to fight as one. Choose your favorite Jedi pair at the start of each mission and experience unique moves and combat skills. With an innovative stylus-based input, controlling the Jedi's movement and Lightsaber combat has never felt more immersive. Play through an original story - exclusive to the Nintendo DS - that expands The Clone Wars series in exciting new directions. Create your own Jedi dream teams by pairing Jedi Masters and Padawans. For example, team up Anakin Skywalker with Obi-Wan Kenobi, or Ahsoka Tano with Mace Windu. Develop the relationship between two Jedi and generate more powerful attacks and special abilities. Replay missions with different character combinations to unlock new areas, collectibles, and other secrets. Play with a friend using wireless drop-in/drop-out coop. Control all movement, Lightsaber combat and cinematic action sequences with just the DS stylus. [LucasArts]… Expand"}, {"name": "Curious Expedition", "details_link": "https://www.metacritic.com/game/switch/curious-expedition", "publisher": "Maschinen-Mensch", "release_date": "Apr  2 2020", "developers": ["Maschinen-Mensch"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/97336ea7aed9bcb16655d797edda7ce5-98.jpg", "descriptions": "Curious Expedition is a roguelike expedition simulation set in the late 19th century. Together with famous personalities you will venture on unprecedented expeditions to regions never explored before for fame, science and treasures."}, {"name": "Resident Evil 6", "details_link": "https://www.metacritic.com/game/switch/resident-evil-6", "publisher": "Capcom", "release_date": "Oct 29 2019", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "Up to 6 ", "genres": ["Action Adventure", "Survival"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/20bd98dc6a43895894a0cb1b20cfa0b5-98.jpg", "descriptions": "Resident Evil 6 is a Survival-Horror game that continues the struggle against the series' signature zombie inducing bio-terror, while raising the bar with all new game functionality. Players enjoy a diverse play experience, highlighted by the ability to select between three scenariosResident Evil 6 is a Survival-Horror game that continues the struggle against the series' signature zombie inducing bio-terror, while raising the bar with all new game functionality. Players enjoy a diverse play experience, highlighted by the ability to select between three scenarios featuring multiple characters and intertwined storylines. Within these scenarios both stories and action cross paths. Additional features include zombies as well as new enemies, upgradable firepower and characters, vehicle based options, the mini-game based Mercenaries mode, and single-player and co-op play options.… Expand"}, {"name": "Sword of the Stars", "details_link": "https://www.metacritic.com/game/pc/sword-of-the-stars", "publisher": "Lighthouse Interactive", "release_date": "Aug 17 2006", "developers": ["Kerberos Productions"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Turn-Based", "General", "Sci-Fi", "Sci-Fi"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/d88a6894e6630d134d3e340f0cf3f241-98.jpg", "descriptions": "Sword of the Stars is a 4X Strategy game brought to you by the core team behind \"HomeWorld: Cataclysm.\" Sword of the Stars returns gamers to the action-packed roots of the 4X genre with some new twists, including a 3D starmap and real-time combat resolution in a 3D environment. Playing asSword of the Stars is a 4X Strategy game brought to you by the core team behind \"HomeWorld: Cataclysm.\" Sword of the Stars returns gamers to the action-packed roots of the 4X genre with some new twists, including a 3D starmap and real-time combat resolution in a 3D environment. Playing as one of 4 unique races, gamers will explore planets, research new technologies and create empires in a hostile Universe where weakness means extinction and only the strongest will survive. [Lighthouse Interactive]… Expand"}, {"name": "Goblin Commander: Unleash the Horde", "details_link": "https://www.metacritic.com/game/playstation-2/goblin-commander-unleash-the-horde", "publisher": "Jaleco Entertainment", "release_date": "Nov 11 2003", "developers": ["Jaleco Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Fantasy"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/00c46fd64ed5b201102fb70223ed483a-98.jpg", "descriptions": "In Goblin Commander: Unleash The Horde, you lead your goblin clans through ceaseless battle in the war-torn land of Ogriss, a world ruled by goblins. Advancing through dark subterranean caves, lush woodland cities and towering storm-swept castles; you wage war with an army of specializedIn Goblin Commander: Unleash The Horde, you lead your goblin clans through ceaseless battle in the war-torn land of Ogriss, a world ruled by goblins. Advancing through dark subterranean caves, lush woodland cities and towering storm-swept castles; you wage war with an army of specialized goblin warriors and fearsome monsters to prevent the ultimate destruction of Ogriss. Goblin Commander: Unleash The Horde sets itself apart from other Real-Time Strategy games with fast arcade-style action, richly detailed and destructible environments, and an easy-to-master control scheme designed specifically for console game pads. [Jaleco Entertainment]… Expand"}, {"name": "Harry Potter: Quidditch World Cup", "details_link": "https://www.metacritic.com/game/playstation-2/harry-potter-quidditch-world-cup", "publisher": "Electronic Arts", "release_date": "Oct 28 2003", "developers": ["Magic Pockets"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Other"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/7ebbd0c9c8a6e721789f3633885ce4a4-98.jpg", "descriptions": "Take to the air in the first game that allows players to fully experience the magical speed, power, and competition of Quidditch, the favorite sport of witches and wizards, in the Harry Potter: Quidditch World Cup game. For the first time, gamers will experience  the full complexity andTake to the air in the first game that allows players to fully experience the magical speed, power, and competition of Quidditch, the favorite sport of witches and wizards, in the Harry Potter: Quidditch World Cup game. For the first time, gamers will experience  the full complexity and exciting challenge of Quidditch, which involves two teams of seven players who fly on broomsticks, playing four balls simultaneously. Players will control every position on their team, including three Chasers who try to score with the Quaffle, two Beaters who control the dangerous Bludgers, the Keeper who protects the goal, and the Seeker who chases the elusive Golden Snitch that must be caught to end the match. [Electronic Arts]… Expand"}, {"name": "ATV Quad Power Racing 2", "details_link": "https://www.metacritic.com/game/playstation-2/atv-quad-power-racing-2", "publisher": "Acclaim", "release_date": "Jan 13 2003", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/14140425d19bce55671160167aae61f8-98.jpg", "descriptions": "ATV: Quad Power Racing 2 is all about big tricks, big boots to the face and big finishes. It's arcade ATV racing like you always wanted it to be. ATV Quad Power Racing 2 combines 10 of the top pro riders in the world (including Dana Creech, Kory Ellis and Tim Farr) and 40+ real-life sponsorsATV: Quad Power Racing 2 is all about big tricks, big boots to the face and big finishes. It's arcade ATV racing like you always wanted it to be. ATV Quad Power Racing 2 combines 10 of the top pro riders in the world (including Dana Creech, Kory Ellis and Tim Farr) and 40+ real-life sponsors with the fast, edge of your seat, arcade gameplay the fans of the original know and love. Get ready to get injured. [Acclaim]… Expand"}, {"name": "Ultimate Fighting Championship: Throwdown", "details_link": "https://www.metacritic.com/game/playstation-2/ultimate-fighting-championship-throwdown", "publisher": "Crave", "release_date": "Jun  3 2002", "developers": ["Opus"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/6b8790160c2b93e8f8b808ef1084eafc-98.jpg", "descriptions": "Features actual UFC champions and all the real, unbelievable mixed martial arts moves found in the Octagon. Using incredible deep offensive and defensive strategies, players can string limitless combos together and exploit the fighting technique that most suits their personal style. FeaturesFeatures actual UFC champions and all the real, unbelievable mixed martial arts moves found in the Octagon. Using incredible deep offensive and defensive strategies, players can string limitless combos together and exploit the fighting technique that most suits their personal style. Features the top ranked fighters in the world Tito Ortiz and Chuck Liddell. [Crave Entertainment]… Expand"}, {"name": "Hoa", "details_link": "https://www.metacritic.com/game/switch/hoa", "publisher": "PM Studios Inc.", "release_date": "Aug 24 2021", "developers": ["Skrollcat Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/6e0515e958571217737487fcef351b69-98.jpg", "descriptions": "Hoa is a beautiful puzzle-platforming game that features breathtaking hand-painted art, lovely music, and a peaceful, relaxing atmosphere. Experience the magic of nature and imagination as you play the main character, Hoa, on her journey through breathtaking environments back to where it allHoa is a beautiful puzzle-platforming game that features breathtaking hand-painted art, lovely music, and a peaceful, relaxing atmosphere. Experience the magic of nature and imagination as you play the main character, Hoa, on her journey through breathtaking environments back to where it all began.\r - Breathtaking hand-painted art\r - Originally composed & live-recorded soundtracks\r - Peaceful & relaxing atmosphere\r - Lovely & well-designed creatures\r - Light-hearted but appealing story\r… Expand"}, {"name": "Freakyforms: Your Creations, Alive!", "details_link": "https://www.metacritic.com/game/3ds/freakyforms-your-creations-alive!", "publisher": "Nintendo", "release_date": "Nov 10 2011", "developers": ["Asobism", "Co. ltd.", "Asobism.Co.,Ltd", "Asobism"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Miscellaneous", "General", "General"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/518e8f33f051c7fb8ce297b14c6c3c72-98.jpg", "descriptions": "This downloadable application, available exclusively in the Nintendo eShop, lets players easily create all kinds of creatures and objects, some beautiful, some bizarre. The program brings them to life complete with animations and personalities. The player can then take control of them andThis downloadable application, available exclusively in the Nintendo eShop, lets players easily create all kinds of creatures and objects, some beautiful, some bizarre. The program brings them to life complete with animations and personalities. The player can then take control of them and explore a whimsical game world, which can also be modified with customized creations.… Expand"}, {"name": "Gauntlet (2014)", "details_link": "https://www.metacritic.com/game/pc/gauntlet-2014", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 23 2014", "developers": ["Warner Bros. Interactive Entertainment"], "platforms": ["PlayStation 4", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "PC-style RPG", "Western-Style"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/e10c1ad01391a93559d8b679baae68c6-98.jpg", "descriptions": "The venerable Gauntlet four-player co-op action gameplay returns in a new experience. Battle the endless hordes of foes as you and your friends fight for treasure and glory via both local and online co-op multiplayer."}, {"name": "Typoman: Revised", "details_link": "https://www.metacritic.com/game/switch/typoman-revised", "publisher": "Wales Interactive", "release_date": "Feb 22 2018", "developers": ["Brainseed Factory"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/8023a6737c68251f92937d5df12a6a19-98.jpg", "descriptions": "Typoman is a 2D puzzle platformer. You slip into the role of a character made of letters, struggling to make your way through a dark and hostile world. Despite your small stature you have a powerful gift: You can craft words to alter your environment. But choose your words wisely - they canTypoman is a 2D puzzle platformer. You slip into the role of a character made of letters, struggling to make your way through a dark and hostile world. Despite your small stature you have a powerful gift: You can craft words to alter your environment. But choose your words wisely - they can either be a blessing ...or a curse!… Expand"}, {"name": "Men of War: Assault Squad 2", "details_link": "https://www.metacritic.com/game/pc/men-of-war-assault-squad-2", "publisher": "1C", "release_date": "Mar 20 2014", "developers": ["1C", "1C Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/3920b5c5f8f400d5cc24854ed5606c3f-98.jpg", "descriptions": "Men of War: Assault Squad 2 features new single player style skirmish modes that take players from extreme tank combat to deadly sniper stealth missions."}, {"name": "Batman: Arkham Origins Blackgate", "details_link": "https://www.metacritic.com/game/3ds/batman-arkham-origins-blackgate", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 25 2013", "developers": ["Armature Studio"], "platforms": ["PlayStation Vita", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Fantasy", "General", "Platformer", "Fantasy", "", "Metroidvania"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/2feb4b3ae8908d7ba580236ede032ef7-98.jpg", "descriptions": "Batman: Arkham Origins Blackgate is a 2.5-D game developed by Armature Studio that brings the Batman Arkham experience for the first time to Nintendo and Sony handheld systems. A companion game to Batman: Arkham Origins, players can continue the storyline of the console version and discoverBatman: Arkham Origins Blackgate is a 2.5-D game developed by Armature Studio that brings the Batman Arkham experience for the first time to Nintendo and Sony handheld systems. A companion game to Batman: Arkham Origins, players can continue the storyline of the console version and discover more detalis of the Dark Knight's past.… Expand"}, {"name": "Fallout: New Vegas - Dead Money", "details_link": "https://www.metacritic.com/game/playstation-3/fallout-new-vegas---dead-money", "publisher": "Bethesda Softworks", "release_date": "Feb 22 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/a63cf9fe6b10cb5d8df216cf98466551-98.jpg", "descriptions": "As the victim of a raw deal you must work alongside three other captured wastelanders to recover the legendary treasure of the Sierra Madre Casino. In Dead Money, your life hangs in the balance as you face new terrain, foes, and choices. It is up to you how you play your cards in the questAs the victim of a raw deal you must work alongside three other captured wastelanders to recover the legendary treasure of the Sierra Madre Casino. In Dead Money, your life hangs in the balance as you face new terrain, foes, and choices. It is up to you how you play your cards in the quest to survive.… Expand"}, {"name": "Switchball", "details_link": "https://www.metacritic.com/game/playstation-3/switchball", "publisher": "Sierra Online", "release_date": "Sep 18 2009", "developers": ["Atomic Elbow", "Atomic Elbow AB"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "8  Online", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 68, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/fe6d46f703a3c2c1e19a67f7829530a4-98.jpg", "descriptions": "[Playstation Network]  Have a ball with the PS3! Travel as a transformable ball through five worlds and 30 levels of stunning 3-D mazes. Journey your way through traps, puzzles and challenges suspended in the sky, earning PLAYSTATION 3 system trophies as you go! Play as a single player, or[Playstation Network]  Have a ball with the PS3! Travel as a transformable ball through five worlds and 30 levels of stunning 3-D mazes. Journey your way through traps, puzzles and challenges suspended in the sky, earning PLAYSTATION 3 system trophies as you go! Play as a single player, or try Race and Co-op multiplayer modes to compete with your friends! [SCEA]… Expand"}, {"name": "Tom Clancy's HAWX 2", "details_link": "https://www.metacritic.com/game/xbox-360/tom-clancys-hawx-2", "publisher": "Ubisoft", "release_date": "Sep  7 2010", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/2ac5f9645e83b85ddbdf9e3b826aa89d-98.jpg", "descriptions": "Tom Clancy’s H.A.W.X. 2 plunges fans into an explosive environment where they can become elite aerial soldiers in control of the world's most technologically advanced aircraft. The game will appeal to a wide array of gamers as players will have the chance to control exceptional pilotsTom Clancy’s H.A.W.X. 2 plunges fans into an explosive environment where they can become elite aerial soldiers in control of the world's most technologically advanced aircraft. The game will appeal to a wide array of gamers as players will have the chance to control exceptional pilots trained to use cutting edge technology in amazing aerial warfare missions. … Expand"}, {"name": "Viking: Battle for Asgard", "details_link": "https://www.metacritic.com/game/xbox-360/viking-battle-for-asgard", "publisher": "Sega", "release_date": "Mar 25 2008", "developers": ["Creative Assembly"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/de7b6ed5e1853991349c7f32a3cb6c9c-98.jpg", "descriptions": "Viking: Battle For Asgard takes players to the world of Norse Gods, where the Goddess Hel in all her fury, has raised an army of demonic warriors sent to enslave the mortal realm of Midgard and ultimately provoke Ragnarok - the apocalyptic battle that will destroy even the Gods themselves.Viking: Battle For Asgard takes players to the world of Norse Gods, where the Goddess Hel in all her fury, has raised an army of demonic warriors sent to enslave the mortal realm of Midgard and ultimately provoke Ragnarok - the apocalyptic battle that will destroy even the Gods themselves. Play as Skarin, a powerful yet flawed Viking warrior, filled with rage and ready to wage war on whoever stands in his way. Manipulated by the gods and fated to a destiny he has yet to understand, Skarin is the only one able to stop this ultimate clash of great wills. As Skarin, players leave behind them a bloody trail of dismembered foes using a huge array of ruthless and brutal combat moves while mastering the addictive and destructive mystical powers and abilities given to him by the Viking Gods he looks to come between. Explore vast and visually stunning open-world environments where gamers strive to free enslaved warriors and lead them into huge, epic battles featuring colossal giants, powerful shaman, deadly assassins and the Gods' own champions. Tame mighty dragons and unleash their rain of fire, laying waste to the enemy hordes that stand in your way and use Skarin's emerging skills to strategically turn the tide of conflict. Taking full advantage of the technology only next-gen consoles offer, Viking: Battle for Asgard excels at flowing seamlessly from small-scale battles to massive wars featuring multitudes of bloodthirsty warriors waiting to unleash their fury. [Sega]… Expand"}, {"name": "Kingdom Come: Deliverance", "details_link": "https://www.metacritic.com/game/xbox-one/kingdom-come-deliverance", "publisher": "Warhorse Studios", "release_date": "Feb 13 2018", "developers": ["Warhorse Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Role-Playing", "Action Adventure", "General", "Action RPG"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/b822ff22c0dab46e58c331d5c33ba6bb-98.jpg", "descriptions": "Kingdom Come: Deliverance is an open world, action-adventure, role-playing game featuring blockbuster production values, a nonlinear story and revolutionary, first-person melee combat."}, {"name": "Space Hulk: Tactics", "details_link": "https://www.metacritic.com/game/playstation-4/space-hulk-tactics", "publisher": "Focus Home Interactive", "release_date": "Oct  9 2018", "developers": ["Cyanide", "Cyanide Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/f28112632eae2c4a80cddc7b8e96e0c2-98.jpg", "descriptions": "Space Hulk: Tactics is a faithful adaptation of the board game Space Hulk, bringing a unique twist to the cult classic formula. Battle as either a squad of Terminator Space Marines or the deadly alien Genestealers."}, {"name": "Warhammer 40,000: Armageddon", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-armageddon", "publisher": "Slitherine", "release_date": "Nov 26 2014", "developers": ["The Lordz Games Studio", "Flashback Games"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/b5816f2f0285f746afc21ec6c48683fc-98.jpg", "descriptions": "Warhammer 40,000: Armageddon is set during the Second War for Armageddon. In this hex-based, turn-based game developed by Flashback Games and The Lordz Games Studio, players will lead the Imperial forces of the Armageddon Steel Legion and Space Marines from a variety of Chapters against theWarhammer 40,000: Armageddon is set during the Second War for Armageddon. In this hex-based, turn-based game developed by Flashback Games and The Lordz Games Studio, players will lead the Imperial forces of the Armageddon Steel Legion and Space Marines from a variety of Chapters against the Ork invasion through over 30 scenarios, on the hostile terrain of the planet and its gigantic Hive Cities. The game features a complex plot, involving known characters from the Warhammer 40,000 universe and while advancing through the campaign, the player will have the ability to carryover his core force from scenario to scenario.… Expand"}, {"name": "Galcon Fusion", "details_link": "https://www.metacritic.com/game/pc/galcon-fusion", "publisher": "Galcon", "release_date": "Feb 11 2010", "developers": ["Phil Hassey"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Strategy", "General", "General"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/39e833ab51666b67eb5555ab58db53c7-98.jpg", "descriptions": "Conquer the Galaxy like never before! Galcon Fusion is an awesome high-paced multi-player galactic arcade-strategy game. Send swarms of ships to defeat enemy planets and conquer the universe! [Galcon]"}, {"name": "FIFA 18", "details_link": "https://www.metacritic.com/game/switch/fifa-18", "publisher": "Electronic Arts", "release_date": "Sep 29 2017", "developers": ["EA Vancouver"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/76f5029a89553e27fd3465e03fa11397-98.jpg", "descriptions": "The game takes advantage of the console’s unique portability, allowing players to enjoy the game in docked, handheld or tabletop mode, and utilizing local multiplayer connection for Local Seasons. Multiple control schemes are also featured, so whether you prefer to play handheld, dualThe game takes advantage of the console’s unique portability, allowing players to enjoy the game in docked, handheld or tabletop mode, and utilizing local multiplayer connection for Local Seasons. Multiple control schemes are also featured, so whether you prefer to play handheld, dual Joy-Con, single Joy-Con or Pro Controller, there’s an option to fit your playstyle.… Expand"}, {"name": "Pokemon Ranger: Shadows of Almia", "details_link": "https://www.metacritic.com/game/ds/pokemon-ranger-shadows-of-almia", "publisher": "Nintendo", "release_date": "Nov 10 2008", "developers": ["HAL Labs", "Creatures Inc."], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "General", "General"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/82e6cff68fd01ff1f2c5df30d6f9e7b6-98.jpg", "descriptions": "In Pokemon Ranger: Shadows of Almia, you once again play as a Pokemon Ranger, working to help people, Pokemon and nature in a new area called the Almia Region. Starting out as a Student Ranger, you quickly earn the title of a full-fledged Pokemon Ranger. As you succeed in more and moreIn Pokemon Ranger: Shadows of Almia, you once again play as a Pokemon Ranger, working to help people, Pokemon and nature in a new area called the Almia Region. Starting out as a Student Ranger, you quickly earn the title of a full-fledged Pokemon Ranger. As you succeed in more and more missions, you will aspire to become the highest Ranger rank: Top Ranger. Along the way you meet and capture all kinds of different Pokemon. [Nintendo]… Expand"}, {"name": "Romancing SaGa: Minstrel Song Remastered", "details_link": "https://www.metacritic.com/game/switch/romancing-saga-minstrel-song-remastered", "publisher": "Square Enix", "release_date": "Dec  1 2022", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 68, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/2650b82cb98e2f0b5d24cffe9bfba64d-98.jpg", "descriptions": "In the long, long ago of 1992, Square Enix released the fantastic Romancing SaGa on the Super Famicon in Japan. The fourth 'SaGa' game, it revolutionized the series with its non-linear structure and innovative mechanics.13 years later, a remake was released for the PlayStation 2 in JapanIn the long, long ago of 1992, Square Enix released the fantastic Romancing SaGa on the Super Famicon in Japan. The fourth 'SaGa' game, it revolutionized the series with its non-linear structure and innovative mechanics.13 years later, a remake was released for the PlayStation 2 in Japan as \"Romancing SaGa: Minstrel Song\" and later in North America as \"Romancing Saga\". This new version of the game was faithful to the original but featured impressive 3D visuals and some welcome features that made the adventure more approachable for new players.Now, 17 years after that, it's back again - and it's bigger and better than ever.The game now features remastered HD graphics, new quality of life features that make it easier and more convenient to play, and you can even expect some new elements too!… Expand"}, {"name": "River City Girls Zero", "details_link": "https://www.metacritic.com/game/switch/river-city-girls-zero", "publisher": "Arc System Works", "release_date": "Feb 14 2022", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 68, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/67bfdb947dc700afbaa03518cdff850b-98.jpg", "descriptions": "River City Girls Zero is an updated English edition of Super Famicom title Shin Nekketsu Koha: Kunio-tachi no Banka. It is the first title in the Kunio-kun franchise to feature Kyoko and Misako in action."}, {"name": "Dear Esther: Landmark Edition", "details_link": "https://www.metacritic.com/game/xbox-one/dear-esther-landmark-edition", "publisher": "Curve Digital Games", "release_date": "Sep 20 2016", "developers": ["The Chinese Room"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 68, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/7/a982569e8de1e9263beb5928b29e7b45-98.jpg", "descriptions": "Dear Esther is a first-person ghost story. Rather than traditional game-play the focus here is on exploration, uncovering the mystery of a lonely island, of who you are and why you are here. Fragments of story are randomly uncovered when exploring the various locations of the island, makingDear Esther is a first-person ghost story. Rather than traditional game-play the focus here is on exploration, uncovering the mystery of a lonely island, of who you are and why you are here. Fragments of story are randomly uncovered when exploring the various locations of the island, making every each journey a unique experience.… Expand"}, {"name": "Batman: The Telltale Series", "details_link": "https://www.metacritic.com/game/playstation-4/batman-the-telltale-series", "publisher": "Telltale Games", "release_date": "Sep 13 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Adventure", "Point-and-Click"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/a2db478d30cfcb11dd133632fb36a9af-98.jpg", "descriptions": "Enter the fractured psyche of Bruce Wayne and discover the powerful and far-reaching consequences of your choices as the Dark Knight. In this gritty and violent new story from the creators of The Walking Dead – A Telltale Games Series, you'll make discoveries that will shatter Bruce Wayne'sEnter the fractured psyche of Bruce Wayne and discover the powerful and far-reaching consequences of your choices as the Dark Knight. In this gritty and violent new story from the creators of The Walking Dead – A Telltale Games Series, you'll make discoveries that will shatter Bruce Wayne's world, and the already fragile stability of a corrupt Gotham City. Decide the fate of Gotham City. Determine the fate of Bruce Wayne and his dark persona, Batman. Your choices write a new chapter in the complex and dangerous lives of the playboy industrialist and the vigilante detective. [Telltale]\r… Expand"}, {"name": "Star Wars Pinball", "details_link": "https://www.metacritic.com/game/3ds/star-wars-pinball", "publisher": "Zen Studios", "release_date": "Sep 19 2013", "developers": ["Zen Studios"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Switch", "Wii U", "3DS"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 68, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/45322b482cc2f37d483b97bfdb1dfdf3-98.jpg", "descriptions": "May the Force be with you! Use the Force to guide the silver ball! Will you choose the Light or Dark side?\r Feel the power of the Force in Star Wars Pinball! Set in a galaxy far, far away, each of the tables in this brand new pack lets you interact with the most iconic characters, andMay the Force be with you! Use the Force to guide the silver ball! Will you choose the Light or Dark side?\r Feel the power of the Force in Star Wars Pinball! Set in a galaxy far, far away, each of the tables in this brand new pack lets you interact with the most iconic characters, and relive the greatest moments of the Star Wars universe: Star Wars: Episode V The Empire Strikes Back, Star Wars: The Clone Wars, and Boba Fett. May the Force be with you!\r Influence the Balance of the Force! Join either the Light Side or Dark Side and take part in the epic struggle by simply posting scores for your chosen side!\r Full list of features:\r-Three brand new tables: Star Wars: Episode V The Empire Strikes Back, Boba Fett, and The Clone Wars\r-Compete against other players to achieve the highest ForceScore, and team up with your friends to increase your TeamScore\r-Hotseat multiplayer mode\r-New tables released regularly through the Nintendo eShop… Expand"}, {"name": "The Legend of Heroes: A Tear of Vermillion", "details_link": "https://www.metacritic.com/game/psp/the-legend-of-heroes-a-tear-of-vermillion", "publisher": "Bandai", "release_date": "Nov 15 2005", "developers": ["Microvision"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "General", "Console-style RPG", "Japanese-Style"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/f10165c8ef95686eae94cabf415e0093-98.jpg", "descriptions": "The game is a single-player turn-based role-playing game featuring more than 100 unique characters to interact with, over 50 hours of gameplay and a deeply involving story line that unfolds in one of  beautifully crafted 3D environments.  Known by the name: Eiyuu Densetsu (\"Legend ofThe game is a single-player turn-based role-playing game featuring more than 100 unique characters to interact with, over 50 hours of gameplay and a deeply involving story line that unfolds in one of  beautifully crafted 3D environments.  Known by the name: Eiyuu Densetsu (\"Legend of Heroes\") Gagharv Trilogy: Akai Shizuku (\"Crimson Tears\") in Japan, the game is developed by legendary Nihon Falcom in Tokyo. The company is well known for their RPG work on many platforms and brands, including the \"Ys\", \"Brandish\" and \"Sorcerian Series.\" While faithful to the \"Legend of Heroes\" series, players unfamiliar with the story will discover an easy-to-pick-up gameplay experience. [Bandai]… Expand"}, {"name": "Project CARS 3", "details_link": "https://www.metacritic.com/game/pc/project-cars-3", "publisher": "Bandai Namco Games", "release_date": "Aug 28 2020", "developers": ["Slightly Mad Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 68, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/4/b37a21fc24a044576975eaf6044c87f0-98.jpg", "descriptions": "Project CARS 3 is the third instalment in the best-seller racing franchise that brings all the intense thrills, emotions and fun from the vibrant world of motor racing to vivid life as players undertake a whole new exciting career journey that sees them rise from weekend warrior to racingProject CARS 3 is the third instalment in the best-seller racing franchise that brings all the intense thrills, emotions and fun from the vibrant world of motor racing to vivid life as players undertake a whole new exciting career journey that sees them rise from weekend warrior to racing legend.\r Also new to the franchise is a deeply engaging metagame that challenges players to race hard and earn in-game Credits with which to buy and own hundreds of cars from the world's most elite brands and race them all on dynamic and spectacular circuits around the globe featuring stunning all-weather, all-seasons conditions.\r Race-won Credits and XP will also entice players to buy authentic performance upgrades and customisation options for their stable of exclusive cars, including wheels, tyres, body kits, rims, as well as personalisation options to create their own racing hero personas.\r With a completely redesigned and unrivalled controller experience, an even more accurate and fun handling model, adjustable skill settings for every level of driver and every element of weather-affected races, Project CARS 3 is the biggest, most exciting and authentic evolution to the definitive racing franchise.… Expand"}, {"name": "Fallout 3: Mothership Zeta", "details_link": "https://www.metacritic.com/game/pc/fallout-3-mothership-zeta", "publisher": "Bethesda Softworks", "release_date": "Aug  3 2009", "developers": ["Bethesda Softworks"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/c5830dc981861a6efd1dabe38b171512-98.jpg", "descriptions": "Defy hostile alien abductors and fight your way off of the massive Mothership Zeta, orbiting Earth miles above the Capital Wasteland. Mothership Zeta takes Fallout 3 in an entirely new direction - outer space. Meet new characters and join with them in a desperate bid to escape the Aliens'Defy hostile alien abductors and fight your way off of the massive Mothership Zeta, orbiting Earth miles above the Capital Wasteland. Mothership Zeta takes Fallout 3 in an entirely new direction - outer space. Meet new characters and join with them in a desperate bid to escape the Aliens' clutches. To do so, you'll wield powerful new weapons, like the Alien Atomizer, Alien Disintegrator, and Drone Cannon, and deck yourself out in brand new outfits, like the Gemini-Era Spacesuit and even Samurai Armor. A strange Alien signal is being broadcast throughout the Capital Wasteland, originating from a crashed UFO. Is it a distress call, or something far more sinister? That question is answered when you find yourself beamed aboard an enormous Alien spacecraft, with only one alternative - to fight your way to the bridge of the ship and secure your escape. [Bethesda Softworks]… Expand"}, {"name": "GORN", "details_link": "https://www.metacritic.com/game/playstation-4/gorn", "publisher": "Devolver Digital", "release_date": "May 19 2020", "developers": ["Free Lives"], "platforms": ["PC", "PlayStation 5", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Beat-'Em-Up", "Fighting", "3D"], "meta_score": 68, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/afdcbe62c288004294202b98627eea57-98.jpg", "descriptions": "Gorn is a ludicrously violent VR gladiator simulator. Savagely strike down an infinite supply of poorly-animated opponents with all manner of weapons – from swords, maces, and bows to nunchuks, throwing knives, massive two-handed warhammers or even your blood-soaked bare hands."}, {"name": "NASCAR 07", "details_link": "https://www.metacritic.com/game/playstation-2/nascar-07", "publisher": "EA Sports", "release_date": "Sep  6 2006", "developers": ["EA Tiburon"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/cf11a909b7bc233008af9f4be10a293c-98.jpg", "descriptions": "Get an inside look at the incredibly fast and dangerous world of NASCAR racing with NASCAR 07.  The control is now in the hands of the player as they attempt to navigate through intense moments with drivers racing inches apart at 200 mph. Push your car to the limit and leave drivers in theGet an inside look at the incredibly fast and dangerous world of NASCAR racing with NASCAR 07.  The control is now in the hands of the player as they attempt to navigate through intense moments with drivers racing inches apart at 200 mph. Push your car to the limit and leave drivers in the dust as all-new effects from screen blurring to camera shaking highlight every detail of the action. Modify your car's handling to your exact specification with a user-friendly sliding scale that makes for ultimate control behind the wheel. Get a NASCAR 101 racing education in a one-on-one tutorial from Kenny Wallace, then select your favorite driver and invest skill points to help him reach the pinnacle of the sport: The NEXTEL Cup Series Championship. [Electronic Arts]… Expand"}, {"name": "Wii Sports Club", "details_link": "https://www.metacritic.com/game/wii-u/wii-sports-club", "publisher": "Nintendo", "release_date": "Nov  7 2013", "developers": ["Nintendo"], "platforms": "Wii U", "num_players": "Up to 4 ", "genres": ["Sports", "General", "General", "Individual", "Athletics"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/32a97a9003882b7bd83e5ba00450e1eb-98.jpg", "descriptions": "Play your favorite Wii Sports games on the Wii U console! With Wii Sports Club, you can now take the competition online with tennis, bowling and golf - baseball and boxing are coming soon. Join a club, compete against other clubs from around your region, or play online multiplayer with yourPlay your favorite Wii Sports games on the Wii U console! With Wii Sports Club, you can now take the competition online with tennis, bowling and golf - baseball and boxing are coming soon. Join a club, compete against other clubs from around your region, or play online multiplayer with your friends. You can also use all-new training modes to improve your skills and support your club.\r Wii Sports Club takes what was fun about Wii Sports - cooperative and competitive gameplay together with friends and family - and moves the experience online. Each sport uses Wii MotionPlus technology to give you more control.\r Ways to Play\r Just set up an Internet connection and the SpotPass feature on your Wii U to automatically download Wii Sports Club. First-timers can try it out a 24-hour free trial. After the free trial ends, you can purchase two different types of passes exclusively on the Nintendo eShop: a Day Pass gives you access to all of the available sports for a 24-hour period and a Club Pass gives you unlimited access to a single sport with no time limit.\r Features:\r-Play online with friends and other competitors.\r-Join a club and compete against rivals for better rankings.\r-Improve your skills with all-new training modes and help your club move up in rank.\r-Build community with fellow club members and friends online by sending tips, pep talks, and other messages via Miiverse.\r-You now have more flexibility to play the way you want to with varied purchasing options.… Expand"}, {"name": "Lost in Shadow", "details_link": "https://www.metacritic.com/game/wii/lost-in-shadow", "publisher": "Hudson Soft", "release_date": "Jan  4 2011", "developers": ["Hudson Soft"], "platforms": "Wii", "genres": ["Action", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 68, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/8ec0860de033902f0bd10342c34f45ee-98.jpg", "descriptions": "(Known as \"A Shadow's Tale\" in the UK/EU) Climb to the top of this platformer from Konami."}, {"name": "Bone: Out From Boneville", "details_link": "https://www.metacritic.com/game/pc/bone-out-from-boneville", "publisher": "Telltale Games", "release_date": "Sep 15 2005", "developers": ["Telltale Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Fantasy", "Third-Person"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/faccfb33b12f1857954322d4e7bae372-98.jpg", "descriptions": "A mysterious foe. An idyllic valley. An unlikely hero. Enter the world of Jeff Smith's Bone and a truly epic adventure will come to life. As the saga begins, three cousins - Fone, Phoney and Smiley Bone - become separated in a vast, uncharted desert. One by one, they find their way into aA mysterious foe. An idyllic valley. An unlikely hero. Enter the world of Jeff Smith's Bone and a truly epic adventure will come to life. As the saga begins, three cousins - Fone, Phoney and Smiley Bone - become separated in a vast, uncharted desert. One by one, they find their way into a deep, forested valley filled with wonderful and terrifying creatures and new mysteries that await them. Help Bone and his cousins find a way back to Boneville. Unravel curious puzzles, maneuver through mini-games and encounter un-expected surprises. Travel throughout the idyllic valley and meet the unique inhabitants. Brave and lovely Thorn, the great Red Dragon, rat creatures, talking bugs and more. Discover the hidden secrets of the valley. A curious map, a beautiful heroine with a past even she doesn't know about, a hooded creature with a grand scheme, and the power of quiche. With an in-game help system, you'll never get stuck for long. [Telltale Games]… Expand"}, {"name": "King of Seas", "details_link": "https://www.metacritic.com/game/pc/king-of-seas", "publisher": "Team17", "release_date": "May 25 2021", "developers": ["3DClouds"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "Action RPG"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/96394ca471e425a60c8f18d6af542d19-98.jpg", "descriptions": "King of Seas is an Action Role playing game set in a procedural pirate world. An epic adventure awaits you in a fantastic world, dotted with fights, lost islands and treasures. A universe that will keep you anchored as you struggle to become the king of all pirates."}, {"name": "Hatoful Boyfriend", "details_link": "https://www.metacritic.com/game/pc/hatoful-boyfriend", "publisher": "MIST[PSI]PRESS", "release_date": "Feb 15 2012", "developers": ["Hato Moa"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General", "Visual Novel"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/0f145735c08cd0640a663a904feceb6b-98.jpg", "descriptions": "Chat with birds of every feather from narcoleptic school instructors to pigeon biker gangs on your way to flirty encounters potential suitors that set your hear aflutter. Spend time with the ones that strike your fancy and ditch the birds that prove to be a bore."}, {"name": "Binary Domain", "details_link": "https://www.metacritic.com/game/pc/binary-domain", "publisher": "Sega", "release_date": "Apr 27 2012", "developers": ["Devils Details"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Shooter", "Third-Person", "Tactical", "Arcade"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/f9ccf10cbde29ea02ab64f8a78ed7b10-98.jpg", "descriptions": "Binary Domain puts players in the middle of a fast-paced and intense battle for humanity in robot-invaded 2080 Tokyo. Fighting through the derelict lower levels of the city, players control an international peace-keeping squad that soon starts to question their surroundings and the choicesBinary Domain puts players in the middle of a fast-paced and intense battle for humanity in robot-invaded 2080 Tokyo. Fighting through the derelict lower levels of the city, players control an international peace-keeping squad that soon starts to question their surroundings and the choices they are making. Are the robots becoming more human, or are humans becoming more like machines?… Expand"}, {"name": "Test Drive Unlimited 2", "details_link": "https://www.metacritic.com/game/xbox-360/test-drive-unlimited-2", "publisher": "Atari", "release_date": "Feb  8 2011", "developers": ["Eden Studios", "Eden"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "General", "General", "Automobile"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/62db21be7d4a50338ccb8630ad438d33-98.jpg", "descriptions": "Test Drive Unlimited 2 expands on the traditional racing experience providing gamers with M.O.O.R.: Massively Open Online Racing; immersing drivers in a persistent online environment and revolutionizing multiplayer racing communities as players compete, team up, and share their achievementsTest Drive Unlimited 2 expands on the traditional racing experience providing gamers with M.O.O.R.: Massively Open Online Racing; immersing drivers in a persistent online environment and revolutionizing multiplayer racing communities as players compete, team up, and share their achievements and creations online.  Unlike any other driving game, TDU2 blends the open world experience with realistic vehicles and performance dynamics and for the first time, TDU2 features vehicle damage, weather effects, day and night cycles, and a brand new island to explore.… Expand"}, {"name": "Pathway", "details_link": "https://www.metacritic.com/game/pc/pathway", "publisher": "Chucklefish", "release_date": "Apr 11 2019", "developers": ["Robotality"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/fb4bafc5c7640ef5abf08f5ed6baeb45-98.jpg", "descriptions": "Adventure into the strange unknown with Pathway, a strategy RPG set in the 1930s great desert wilderness. Outwit your enemies in daring turn-based combat, raid occult tombs and make tough choices in a procedurally generated grand pulp expedition."}, {"name": "Juiced", "details_link": "https://www.metacritic.com/game/xbox/juiced", "publisher": "THQ", "release_date": "Jun 13 2005", "developers": ["Juice Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "6  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/5716cb428a65b8c6793d5f06f9fb54cb-98.jpg", "descriptions": "Become immersed in the lifestyle, community, and risk-taking attitude of the street-modding scene with Juiced. More than just an arcade racer, Juiced pits you against a wide range of characters with enhanced driving street machines. In a series of increasingly risky challenges, you can earnBecome immersed in the lifestyle, community, and risk-taking attitude of the street-modding scene with Juiced. More than just an arcade racer, Juiced pits you against a wide range of characters with enhanced driving street machines. In a series of increasingly risky challenges, you can earn cash, cars, and pride. You'll have to work hard to get to where the real petrol-heads and money lurk, building up a collection of nitrous-burning monsters for every type of challenge.… Expand"}, {"name": "The Ascent", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-ascent", "publisher": "Curve Digital", "release_date": "Jul 29 2021", "developers": ["Neon Giant"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General", "Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/6f101b5c23ef2d67b31560b959b63639-98.jpg", "descriptions": "You belong to the corporation. Can you survive without it? The Ascent is a solo and co-op action RPG set in a cyberpunk world. The mega corporation that owns you and everyone, The Ascent Group, has just collapsed. Confusion and chaos ensue, security and order are in disarray, and withoutYou belong to the corporation. Can you survive without it? The Ascent is a solo and co-op action RPG set in a cyberpunk world. The mega corporation that owns you and everyone, The Ascent Group, has just collapsed. Confusion and chaos ensue, security and order are in disarray, and without protection, everyone is left to fend for themselves. Stop gangs and hostile corporations from taking over and discover what really happened.… Expand"}, {"name": "Mario Party: Star Rush", "details_link": "https://www.metacritic.com/game/3ds/mario-party-star-rush", "publisher": "Nintendo", "release_date": "Nov  4 2016", "developers": ["Nintendo", "Nd Cube"], "platforms": "3DS", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/16823ee58c09fa77f5dd09c5edcac188-98.jpg", "descriptions": "Think fast and engage with a variety of ways to party with Mario, Toad, and more, on-the-go or on the couch. It's always your turn as you and up to three friends roll the dice, roam the board, and recruit fan-favorite allies. The bigger your party, the faster you'll earn stars and coins inThink fast and engage with a variety of ways to party with Mario, Toad, and more, on-the-go or on the couch. It's always your turn as you and up to three friends roll the dice, roam the board, and recruit fan-favorite allies. The bigger your party, the faster you'll earn stars and coins in frantic minigames. Break free of turn order and choose your path to victory in Toad Scramble, a mode with five wild worlds filled with bite-sized, open maps to play on. Blast across them in cannons, creep around haunted houses, or get a lift from Lakitu. You may get a chance to take down Bowser's mech. Team up with Yoshi, Daisy, Waluigi and other allies along the way. Pit your skills against friends by racing along in a gauntlet of rapid-fire minigames in Coinathlon. Cannon down Goombas, take out Shy Guys pinball-style, and even surf on a leafboard…but watch for Wigglers! You may even find yourself wandering a labyrinth of Boos. Partying is tough business. [Nintendo.com]… Expand"}, {"name": "Major League Baseball 2K12", "details_link": "https://www.metacritic.com/game/xbox-360/major-league-baseball-2k12", "publisher": "Take-Two Interactive", "release_date": "Mar  6 2012", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/26697beb54e577f90031e358f4a1058d-98.jpg", "descriptions": "The longest running Major League Baseball franchise returns to the virtual diamond with MLB 2K12."}, {"name": "Wii Party", "details_link": "https://www.metacritic.com/game/wii/wii-party", "publisher": "Nintendo", "release_date": "Oct  3 2010", "developers": ["Nd Cube"], "platforms": "Wii", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/cbbb84f71266451b05e67ca229f8fbd9-98.jpg", "descriptions": "Most video games require players to focus their attention on a screen. Now Nintendo brings the action into the living room with Wii Party, a game that changes the way people interact with other players. Featuring 13 different party game modes and 70+ minigames, Wii Party can be enjoyed byMost video games require players to focus their attention on a screen. Now Nintendo brings the action into the living room with Wii Party, a game that changes the way people interact with other players. Featuring 13 different party game modes and 70+ minigames, Wii Party can be enjoyed by everyone in the family, regardless of age.… Expand"}, {"name": "Tokyo Crash Mobs", "details_link": "https://www.metacritic.com/game/3ds/tokyo-crash-mobs", "publisher": "Nintendo", "release_date": "Jan 17 2013", "developers": ["Mitchell"], "platforms": "3DS", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/9de0f1fbe94ae03285286d4a76cbc7ae-98.jpg", "descriptions": "Get ready to unleash pedestrian-tossing pandemonium! \r\rAll Grace and Savannah want is to make it in Tokyo, but what's with all the scenesters, bomb balls, flower displays, and ninjas getting in their way?! And don't even get me started on the UFO abductions, or how easy it is for a visitGet ready to unleash pedestrian-tossing pandemonium! \r\rAll Grace and Savannah want is to make it in Tokyo, but what's with all the scenesters, bomb balls, flower displays, and ninjas getting in their way?! And don't even get me started on the UFO abductions, or how easy it is for a visit to Tokyo to end with getting sucked into outer space... \r\rYou'll need lightning-fast reflexes and an eye for strategy to succeed in this fast-paced puzzle game, where live-action video blends seamlessly with wacky digital graphics. Throw and roll hapless bystanders into lines of people, trying to group three or more who wear the same color together so that they'll form a clique and disappear. Form cliques and eliminate the lines you're facing as fast as you can to progress through the game's many stages. With two different play modes-Story Mode and Challenge Mode-this game's got you covered whether you're looking for quick gaming sessions or longer endurance challenges.… Expand"}, {"name": "My Hero One's Justice 2", "details_link": "https://www.metacritic.com/game/playstation-4/my-hero-ones-justice-2", "publisher": "Bandai Namco Games", "release_date": "Mar 13 2020", "developers": ["Bandai Namco Games"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 68, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/8/3e576a0120ed28c5b5a8113f25c80957-98.jpg", "descriptions": "Fight for your justice in MY HERO ONE'S JUSTICE! The popular manga and anime series clashes head-to-head and Quirk-to-Quirk in this 3D arena fighter. Pave your path and choose between hero or villain and battle through iconic moments."}, {"name": "Buzz! Master Quiz", "details_link": "https://www.metacritic.com/game/psp/buzz!-master-quiz", "publisher": "SCEA", "release_date": "Sep 23 2008", "developers": ["Relentless Software"], "platforms": "PSP", "num_players": "4  Online", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/081e61cc57cadc4db0a95d1c222e2509-98.jpg", "descriptions": "Packing over 3000 questions on topics including music, celebrities, TV, sport, science, nature, movies and more, BUZZ! Master Quiz puts gamer's knowledge to the test at home or on the move. With six new round types specifically designed for PSP including the speed-is-of-the-essencePacking over 3000 questions on topics including music, celebrities, TV, sport, science, nature, movies and more, BUZZ! Master Quiz puts gamer's knowledge to the test at home or on the move. With six new round types specifically designed for PSP including the speed-is-of-the-essence \"Quickfire Challenge\", the picture-puzzler \"Picture This\" and the mind-boggling \"Virus Challenge\", each round also comes complete with pictures and videos. [Sony]… Expand"}, {"name": "Costume Quest 2", "details_link": "https://www.metacritic.com/game/pc/costume-quest-2", "publisher": "Midnight City", "release_date": "Oct  7 2014", "developers": ["Double Fine Productions"], "platforms": ["PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Japanese-Style"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/62e3a6cf21af43e4fcabd52c3894f3ec-98.jpg", "descriptions": "Explore spooky time-traversing landscapes, wear adorable new costumes that transform into powerful Hallo-warriors, and collect even Creepier Treat Cards to wield in combat against a legion of hygiene obsessed baddies. Only heroic siblings Wren and Reynold can save Halloween forever."}, {"name": "Juiced 2: Hot Import Nights", "details_link": "https://www.metacritic.com/game/xbox-360/juiced-2-hot-import-nights", "publisher": "THQ", "release_date": "Sep 17 2007", "developers": ["Juice Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/a0055eb81269d51b3282d1b901e5ea55-98.jpg", "descriptions": "Juiced 2: HIN evolves the current street racing scene, letting players experience the culture of the real-life HIN tour, the nation's largest lifestyle custom car show in an intense racing experience. Featuring track and drift racing at real-world locations around the globe, next-gen AI andJuiced 2: HIN evolves the current street racing scene, letting players experience the culture of the real-life HIN tour, the nation's largest lifestyle custom car show in an intense racing experience. Featuring track and drift racing at real-world locations around the globe, next-gen AI and vehicle customization, Juiced 2: HIN brings street racing to life, allowing players to test their skills at live street racing events against a back-drop of DJs, fashion, models and musicians. New features include addictive drift/ powersliding races and \"Driver DNA\" that tracks gamers' personal driving traits. These profiles, along with the profiles of select celebrities will be available for download across all online gaming systems. Racing developer Juice Games has evolved the game-play in its online racing, giving players the power to create their car, assemble their crew and put it all on the line in intense pink slip and crew races. Gamers can bet cash on each event, bringing a gambling element to the game that greatly increases the importance of each race. [THQ]… Expand"}, {"name": "Grand Theft Auto", "details_link": "https://www.metacritic.com/game/game-boy-advance/grand-theft-auto", "publisher": "Rockstar Games", "release_date": "Oct 26 2004", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/6365229ff54d3968e82045a60518294d-98.jpg", "descriptions": "The Grand Theft Auto series finally makes its way to the Game Boy Advance. You play as a member of the Mob looking for a way out of your vicious lifestyle. The murder of your mentor, however, sets you off on a search for those responsible. To track down the killers, you must complete all-newThe Grand Theft Auto series finally makes its way to the Game Boy Advance. You play as a member of the Mob looking for a way out of your vicious lifestyle. The murder of your mentor, however, sets you off on a search for those responsible. To track down the killers, you must complete all-new missions while avoiding every cop in the city. As in previous installments in the Grand Theft Auto series, you can jack cars, explore the city, and wield a variety of weapons.… Expand"}, {"name": "Deliver Us Mars", "details_link": "https://www.metacritic.com/game/playstation-5/deliver-us-mars", "publisher": "Frontier Foundry", "release_date": "Feb  2 2023", "developers": ["KeokeN Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/4ed8df11c37d7915626b55fada6884db-98.jpg", "descriptions": "Sequel to the award-winning Deliver Us The Moon, Deliver Us Mars is an atmospheric sci-fi adventure offering an immersive astronaut experience. Explore new frontiers on a suspense-fuelled, high-stakes mission to recover the ARK colony ships stolen by the mysterious Outward."}, {"name": "Gang Beasts", "details_link": "https://www.metacritic.com/game/switch/gang-beasts", "publisher": "Double Fine Productions", "release_date": "Oct 12 2021", "developers": ["Boneloaf"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/99a43494b897813afa034849e0479423-98.jpg", "descriptions": "Gang Beasts is a silly local multiplayer party game with doughy ragdoll physics and horrific environmental hazards. In the current pre-alpha players can grab, push, pull, punch, and throw their friends from wrestling rings, speeding trucks, and suspended platforms."}, {"name": "Doomsday Vault", "details_link": "https://www.metacritic.com/game/switch/doomsday-vault", "publisher": "Flightless", "release_date": "Aug  5 2021", "developers": ["Flightless"], "platforms": ["iPhone/iPad", "PC", "Switch"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/5391e29d6bd4b5560c1336d406f099fa-98.jpg", "descriptions": "You're on a lone mission in a post-climate collapse Earth. Adventure around the world in your robotic suit and use your suit's tools and abilities to explore challenging environments. Navigate desolate landscapes, flooded cities and derelict buildings to find seeds from critical plantYou're on a lone mission in a post-climate collapse Earth. Adventure around the world in your robotic suit and use your suit's tools and abilities to explore challenging environments. Navigate desolate landscapes, flooded cities and derelict buildings to find seeds from critical plant species and return them to the safety of the Doomsday Vault. Be aware, not everything is as it seems - you will need to evade the AI bots left behind to guard corporate interests.Collect nutrients, restore Carbon Eaters, collect the seeds and nurture them in the Vault to create a sustainable crop.… Expand"}, {"name": "Empire of Sin", "details_link": "https://www.metacritic.com/game/xbox-one/empire-of-sin", "publisher": "Paradox Interactive", "release_date": "Dec  1 2020", "developers": ["Romero Games Ltd."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/7af699896dd6e8c3f0e9bd99a75db147-98.jpg", "descriptions": "Empire of sin, the strategy game from romero games and Paradox interactive, puts you at the heart of the ruthless criminal underworld of 1920S prohibition-era Chicago. It's up to you to Hustle, charm and intimidate your way to the top of the pile and do whatever it takes to stay there. ThisEmpire of sin, the strategy game from romero games and Paradox interactive, puts you at the heart of the ruthless criminal underworld of 1920S prohibition-era Chicago. It's up to you to Hustle, charm and intimidate your way to the top of the pile and do whatever it takes to stay there. This character-driven, noir-inspired game puts players smack dab in the glitz and glamor of the roaring 20S, all while working behind the scenes in the gritty underbelly of organized crime. … Expand"}, {"name": "Doraemon: Story of Seasons", "details_link": "https://www.metacritic.com/game/playstation-4/doraemon-story-of-seasons", "publisher": "Bandai Namco Games", "release_date": "Sep  4 2020", "developers": ["Brownies"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/48a765253427b8e1270f160c7a44adb1-98.jpg", "descriptions": "Doraemon meets Story of Seasons in this new, fresh take on farming!Japan's adored Doraemon franchise comes to Steam in Story of Seasons, a beloved farming simulation series lasting over 20 years.\n\nThe setting is Natura, and at the center of this land is the mystical Big Tree. Doraemon andDoraemon meets Story of Seasons in this new, fresh take on farming!Japan's adored Doraemon franchise comes to Steam in Story of Seasons, a beloved farming simulation series lasting over 20 years.The setting is Natura, and at the center of this land is the mystical Big Tree. Doraemon and friends will each take on a role to help out around town!The theme of this experience is creating bonds with the town residents, and while doing so, enjoying the heart-warming interactions through each character and the part they play in the story.But building a farm and raising horses and cattle like in other Story of Seasons games isn't the only thing to do. Explore the town of Natura, go on adventures, catch bugs and much much more! Fans of the Doraemon series will also be happy to know that Doraemon's gadgets can be used to assist you in your new, everyday life!Enjoy the nostalgia of Doraemon and Story of Seasons while helping Noby live his farm life in this unique, lovable land!… Expand"}, {"name": "Edna & Harvey: The Breakout - 10th Anniversary Edition", "details_link": "https://www.metacritic.com/game/switch/edna-harvey-the-breakout---10th-anniversary-edition", "publisher": "Daedalic Entertainment", "release_date": "Jun 17 2020", "developers": ["Daedalic Entertainment", "The Knights of Unity"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/2bc4d996c5d8b190806348c70d5ecf44-98.jpg", "descriptions": "Time to go crazy! When Edna wakes up, she has no memories of her past, or why she finds herself in the padded cell of a sanatorium. Though she hasn't the slightest idea how she ended up in a cell, one thing is certain: She wants to get out of there. After all, she feels positively sane – andTime to go crazy! When Edna wakes up, she has no memories of her past, or why she finds herself in the padded cell of a sanatorium. Though she hasn't the slightest idea how she ended up in a cell, one thing is certain: She wants to get out of there. After all, she feels positively sane – and her talking plush bunny Harvey absolutely agrees.  Together they try to make their escape and meet the weirdest inmates – from a man in a bee costume to the pseudo-siamese twins Hoti and Moti. But Dr. Marcel, the head of the sanatorium, does everything in his power to stop Edna from leaving. What is his endgame? And why has her memory been wiped? Bit by bit, Edna remembers the time before the sanatorium... … Expand"}, {"name": "Star Wars Jedi Knight: Jedi Academy", "details_link": "https://www.metacritic.com/game/switch/star-wars-jedi-knight-jedi-academy", "publisher": "Aspyr", "release_date": "Mar 26 2020", "developers": ["Aspyr"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/81ea0558d5694edaf7e749c503f3cf62-98.jpg", "descriptions": "As a new student of Luke Skywalker's Jedi Academy, follow an ancient tradition and learn the powers--and dangers--of the Force.  Star Wars Jedi Knight:  Jedi Academy allows you to immerse yourself in the classic Star Wars universe as you take on the role of a student eager to learn the waysAs a new student of Luke Skywalker's Jedi Academy, follow an ancient tradition and learn the powers--and dangers--of the Force.  Star Wars Jedi Knight:  Jedi Academy allows you to immerse yourself in the classic Star Wars universe as you take on the role of a student eager to learn the ways of the Force from Master Luke Skywalker.  The game features customizable characters, all-new weapons, vehicles, and environments, and multiplayer modes.  You'll interact with famous classic Star Wars locations and characters while facing the ultimate choice: Fight for good and freedom on the light side or follow the path of power and evil to the dark side.… Expand"}, {"name": "American Fugitive", "details_link": "https://www.metacritic.com/game/xbox-one/american-fugitive", "publisher": "Curve Digital", "release_date": "May 24 2019", "developers": ["Fallen Tree Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox", "Open-World"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/7268a7c999e921fec64ce561f42e2c83-98.jpg", "descriptions": "A modern take on classic sandbox action. Framed for your father’s murder, you’ll need to do whatever it takes to unveil the real culprit. Tackle thrilling missions for the criminal underworld — just don’t let the cops track you down! Set in the deep south of the 80s, American Fugitive is aA modern take on classic sandbox action. Framed for your father’s murder, you’ll need to do whatever it takes to unveil the real culprit. Tackle thrilling missions for the criminal underworld — just don’t let the cops track you down! Set in the deep south of the 80s, American Fugitive is a love-letter to the classic movies and games of old.… Expand"}, {"name": "NASCAR Heat 3", "details_link": "https://www.metacritic.com/game/xbox-one/nascar-heat-3", "publisher": "704Games", "release_date": "Sep  7 2018", "developers": ["704Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 40 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/bc96fbd191294579486172ea1c89b735-98.jpg", "descriptions": "Jump into the enhanced Career Mode, build your own race team and compete in the Xtreme Dirt Tour. Prove that you are the best in the world in the new Online Tournaments feature. Plus, all your favorite modes are back."}, {"name": "The Council - Episode 3: Ripples", "details_link": "https://www.metacritic.com/game/playstation-4/the-council---episode-3-ripples", "publisher": "Focus Home Interactive", "release_date": "Jul 24 2018", "developers": ["Big Bad Wolf"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/2777379c63897f123e6de81c014a9bf6-98.jpg", "descriptions": "Episode 3: Ripples continues the story of Louis de Richet as plots are revealed, characters reach their breaking point, and an unexpected, terrifying truth is uncovered. It will take all of Louis’ influence to prevent the situation from growing out of hand in this third episode of theEpisode 3: Ripples continues the story of Louis de Richet as plots are revealed, characters reach their breaking point, and an unexpected, terrifying truth is uncovered. It will take all of Louis’ influence to prevent the situation from growing out of hand in this third episode of the adventure game The Council.… Expand"}, {"name": "The 25th Ward: The Silver Case", "details_link": "https://www.metacritic.com/game/playstation-4/the-25th-ward-the-silver-case", "publisher": "NIS America", "release_date": "Mar 13 2018", "developers": ["Grasshopper Manufacture"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/1412051a29fd852858bfc0567f8d84c3-98.jpg", "descriptions": "It is five years since the events of 1999's \"The Silver Case,\" set in the new 25th Ward that arose in the bayside area of Kanto. In a room of the \"Bayside Tower Land\" apartment complex, a woman is found murdered under mysterious circumstances. This sets off a series of seemingly randomIt is five years since the events of 1999's \"The Silver Case,\" set in the new 25th Ward that arose in the bayside area of Kanto. In a room of the \"Bayside Tower Land\" apartment complex, a woman is found murdered under mysterious circumstances. This sets off a series of seemingly random events throwing together multiple protagonists including The Silver Case's Tokio Morishima. With all viewpoints assembled, a truly shocking pattern emerges...\r Available for the first time outside Japan, The 25th Ward: The Silver Case is presented with new HD assets and additional content not found in the original version.\r Game Features:\r * A SUDA51 Trip -- Set in the \"Kill the Past\" universe, the series continues its bleak look into a semi-futuristic world on the edge of collapse and the misfits and antiheroes that inhabit it.\r * Brave New World -- The return of the signature \"Film Window\" system is brought to The 25th Ward for the first time! New visuals, sounds and controls capture the game in a fresh perspective.\r \r* One Story, Many Sides -- Includes all three of the original arcs released for the title, \"Correctness\", \"Placebo\", and \"Matchmaker\".… Expand"}, {"name": "One Piece: Unlimited World Red - Deluxe Edition", "details_link": "https://www.metacritic.com/game/switch/one-piece-unlimited-world-red---deluxe-edition", "publisher": "Bandai Namco Games", "release_date": "Sep 29 2017", "developers": ["Ganbarion"], "platforms": ["PC", "PlayStation 4", "Switch"], "genres": ["Action", "Action Adventure", "General"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/f65155058203d595f4ccc19676a5e05f-98.jpg", "descriptions": "Set sail on this grand One Piece adventure. A unique One Piece adventure to be enjoyed in co-op, with characters designed by Eiichiro Oda and a game-exclusive scenario.\r The Straw Hat Pirates encounter and befriend a cheerful yet mysterious raccoon named Pato who possesses a shadowy powerSet sail on this grand One Piece adventure. A unique One Piece adventure to be enjoyed in co-op, with characters designed by Eiichiro Oda and a game-exclusive scenario.\r The Straw Hat Pirates encounter and befriend a cheerful yet mysterious raccoon named Pato who possesses a shadowy power to create anything drawn onto a leaf. In order to help their new friend, the Straw Hat Pirates agree to assist Pato on an ambiguous mission to meet someone Pato then leads the crew to the Forgotten Island where all the Straw Hat Pirates except Luffy are successively kidnapped by a wicked pirate named The Red Count, who had escaped the lower depths of Impel Down two years ago. With Pato's help, Luffy must fight to recover his crew from the enemy's grasp and find out exactly what The Red Count's evil plots are...… Expand"}, {"name": "LEVEL 22, Gary's Misadventures", "details_link": "https://www.metacritic.com/game/xbox-one/level-22-garys-misadventures", "publisher": "Moving Player", "release_date": "Jan 29 2016", "developers": ["Moving Player", "Noego"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One"], "genres": ["Puzzle", "Action", "General"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/ab52d16319f92b582465c0b5b83f8d29-98.jpg", "descriptions": "Gary is an office worker who oversleeps after a drunken night out on the town. Here’s where it gets tricky, because this isn’t the first time Gary’s been late for work, and he could be fired if he’s spotted arriving at his desk after everyone else yet again. So he’ll have to prove he’s smartGary is an office worker who oversleeps after a drunken night out on the town. Here’s where it gets tricky, because this isn’t the first time Gary’s been late for work, and he could be fired if he’s spotted arriving at his desk after everyone else yet again. So he’ll have to prove he’s smart and sneaky enough to make his way up all the 22 floors between him and his office without being seen.… Expand"}, {"name": "Kromaia Omega", "details_link": "https://www.metacritic.com/game/playstation-4/kromaia-omega", "publisher": "Rising Star Games", "release_date": "Oct 16 2015", "developers": ["Kraken Empire"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Shooter", "Rail"], "meta_score": 68, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/ebef8757e0cd0ba2f88d5ab612640cfd-98.jpg", "descriptions": "Kromaia Ω is a highly-immersive shmup; a journey that is quite unlike any other that mixes technology and myth for an innovative gameplay experience. Players will explore new worlds protected by giant god-like guardians, filled with ancient temple ruins, and littered with puzzles to solveKromaia Ω is a highly-immersive shmup; a journey that is quite unlike any other that mixes technology and myth for an innovative gameplay experience. Players will explore new worlds protected by giant god-like guardians, filled with ancient temple ruins, and littered with puzzles to solve and treasures to collect.… Expand"}, {"name": "Warlocks vs Shadows", "details_link": "https://www.metacritic.com/game/pc/warlocks-vs-shadows", "publisher": "ONE MORE LEVEL", "release_date": "TBA - Early Access", "developers": ["Frozen District"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 0, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/6993a3a0f301f93fd636998ab4938699-98.jpg", "descriptions": "Kill monsters. Defeat epic bosses. Collect magical gear. Become a Warlock and save the universe."}, {"name": "Five Nights at Freddy's 3", "details_link": "https://www.metacritic.com/game/pc/five-nights-at-freddys-3", "publisher": "Scott Cawthon", "release_date": "Mar  2 2015", "developers": ["Scott Cawthon"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/b001feee261cece04e353b4e935b3a5d-98.jpg", "descriptions": "30 years after Freddy Fazbear's Pizza closed, the events that took place there have become nothing more than a rumor and a childhood memory, but the owners of \"Fazbear's Fright: The Horror Attraction\" are committed to reviving the legend and to making the experience as authentic as possible30 years after Freddy Fazbear's Pizza closed, the events that took place there have become nothing more than a rumor and a childhood memory, but the owners of \"Fazbear's Fright: The Horror Attraction\" are committed to reviving the legend and to making the experience as authentic as possible for patrons, going to great lengths to find anything that might have survived decades of neglect and ruin.… Expand"}, {"name": "Assassin's Creed Unity: Dead Kings", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-unity-dead-kings", "publisher": "Ubisoft", "release_date": "Jan 13 2015", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Historic", "Open-World"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/6788137e6cce34b983d32c113a1eff7a-98.jpg", "descriptions": "Following the incidents of Assassin’s Creed Unity, Arno’s quest for redemption leads him to the town of Saint Denis, then known as Franciade. There he is dispatched on a mission that takes him to the bowels of the city, an intricate network of catacombs and deep caves that hold the remainsFollowing the incidents of Assassin’s Creed Unity, Arno’s quest for redemption leads him to the town of Saint Denis, then known as Franciade. There he is dispatched on a mission that takes him to the bowels of the city, an intricate network of catacombs and deep caves that hold the remains and best-kept secrets of past French kings. To unearth the dark mysteries that lie beneath the Basilica, Arno is equipped with a lantern to guide his way and will gain access to the Guillotine Gun, a powerful weapon made for both long-range destruction and deadly close-quarter combat.… Expand"}, {"name": "Neverending Nightmares", "details_link": "https://www.metacritic.com/game/pc/neverending-nightmares", "publisher": "Infinitap Games", "release_date": "Sep 26 2014", "developers": ["Infinitap Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Horror", "Action Adventure", "Survival"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/0d5cb52e0a828f12adcb9e33a581cc37-98.jpg", "descriptions": "A psychological horror game inspired by the developer's battle with mental illness. Explore nightmares with a Branching narrative."}, {"name": "Major League Baseball 2K12", "details_link": "https://www.metacritic.com/game/playstation-3/major-league-baseball-2k12", "publisher": "Take-Two Interactive", "release_date": "Mar  6 2012", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 68, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/3bce7c60e94451ed612bc175b78ce8bb-98.jpg", "descriptions": "The longest running Major League Baseball franchise returns to the virtual diamond with MLB 2K12."}, {"name": "Bejeweled Blitz Live", "details_link": "https://www.metacritic.com/game/xbox-360/bejeweled-blitz-live", "publisher": "PopCap", "release_date": "Feb 23 2011", "developers": ["Torpex Games LLC"], "platforms": "Xbox 360", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/c2b71c773daf4dca32febc3c77f27f9c-98.jpg", "descriptions": "Take on friends in the brilliant gem-matching action of Bejeweled Blitz Live! Choose your favorite playing style - Classic or Twist - and rocket up the leaderboards! Battle your way to the top in the all-new 16-player Party mode over Xbox LIVE."}, {"name": "Tenchu: Shadow Assassins", "details_link": "https://www.metacritic.com/game/psp/tenchu-shadow-assassins", "publisher": "Ubisoft", "release_date": "Mar 24 2009", "developers": ["From Software", "Acquire"], "platforms": "PSP", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/4d62228dee64b96a12a2b203b32d5f9d-98.jpg", "descriptions": "Master the art of death on the PSP playing as Rikimaru and Ayame, elite ninjas who must use their lethal skills to keep the peace in feudal Japan. The accuracy of the PSP system's control buttons lets players battle enemies quickly and attack them with katanas, throwing stars, smoke bombsMaster the art of death on the PSP playing as Rikimaru and Ayame, elite ninjas who must use their lethal skills to keep the peace in feudal Japan. The accuracy of the PSP system's control buttons lets players battle enemies quickly and attack them with katanas, throwing stars, smoke bombs and more. Expect to find the original Tenchu villain Onikage wreak havoc through dangerous territories. Additional PSP game features include: Use 17 historically accurate ninja weapons and tools. Manipulate your environment to hide and to sneak in behind your targets. Unlock special artifacts including Rikamaru's original costume. Experience the epic adventures of Rikimaru and Ayame and put your true ninja skills to the test in a world of fierce combat and authentic tradition. [Ubisoft]… Expand"}, {"name": "Star Wars: The Force Unleashed", "details_link": "https://www.metacritic.com/game/playstation-2/star-wars-the-force-unleashed", "publisher": "LucasArts", "release_date": "Sep 16 2008", "developers": ["Krome Studios"], "platforms": ["iPhone/iPad", "PlayStation 3", "Switch", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/6b875b449f5c3db6a0eb9b2e3f877586-98.jpg", "descriptions": "Star Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode IIIStar Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode III Revenge of the Sith\" and \"Star Wars: Episode IV A New Hope.\" In it, players assist the iconic villain in his quest to rid the universe of Jedi - and face decisions that could change the course of their destiny. Unleash and upgrade the Secret Apprentice's four core Force powers - Force push, grip, repulse and lightning - throughout the course of the game, and combine them for ultra-destructive, never-before-seen combos. The Secret Apprentice doesn't just Force push enemies into walls - he Force pushes enemies through walls. The Secret Apprentice doesn't just Force grip foes to throw them aside - he Force grips them in midair, zapping them with lightning, then dropping them to the ground to explode like a bomb. In addition to new adversaries created just for the game, such as fugitive Jedi and Force-sensitive Felucians, players also confront and associate with familiar faces from the Star Wars films, including Darth Vader. Visit locations such as Episode III's Wookiee homeworld Kashyyyk and the floral Felucia, the junk planet Raxus Prime, plus an Imperial TIE fighter construction facility. Decisions made by players throughout the game determine the path of the story, including multiple endings that will rock Star Wars continuity as they know it. [LucasArts]… Expand"}, {"name": "Brain Challenge", "details_link": "https://www.metacritic.com/game/ds/brain-challenge", "publisher": "Ubisoft", "release_date": "Jan  8 2008", "developers": ["Ubisoft"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/186a28c8fb619ebde5a2012a6a667eda-98.jpg", "descriptions": "Brain Challenge for the Nintendo DS is an entertaining, comprehensive personal training program to improve coping skills when faced with real-life challenges and stress. Brain Challenge is a simple, entertaining solution for brain activity maintenance that goes far beyond logic tests to helpBrain Challenge for the Nintendo DS is an entertaining, comprehensive personal training program to improve coping skills when faced with real-life challenges and stress. Brain Challenge is a simple, entertaining solution for brain activity maintenance that goes far beyond logic tests to help increase your actual percentage of brain use. This Nintendo DS game makes use of the system’s unique Touch Screen and portability, allowing you to train your brain whenever and wherever you want. [Ubisoft]… Expand"}, {"name": "My Word Coach", "details_link": "https://www.metacritic.com/game/wii/my-word-coach", "publisher": "Ubisoft", "release_date": "Nov  6 2007", "developers": ["Ubisoft"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/954d64c14c92ad8ed0000bed98477d7c-98.jpg", "descriptions": "Do you ever feel at \"loss for words\"? Would you like to express yourself more clearly and with confidence? Want to improve your vocabulary in a straightforward and entertaining way? In your daily life, knowing the right word can make all the difference! My Word Coach offers a fun andDo you ever feel at \"loss for words\"? Would you like to express yourself more clearly and with confidence? Want to improve your vocabulary in a straightforward and entertaining way? In your daily life, knowing the right word can make all the difference! My Word Coach offers a fun and challenging way to improve verbal skills through a series of engaging activities and exercises. The game was inspired by ongoing vocabulary acquisition research by Thomas Cobb, University Professor in Applied Linguistics at the University of Quebec. Enjoyable activities include word recognition, spelling challenges, and vocabulary definition, including 16,800 words from the Cambridge Advanced Learner's Dictionary. When you play, My Word Coach assesses, monitors, and rewards your Expression Potential, a score that represents your ability to command and use the English language. The higher the number (out of a possible 100%), the better you are able to express yourself! While the Wii version takes advantage of the Wii Remote through lively mini-games and easy-to-use controls, the Nintendo DS version makes full use of the system’s unique, dual Touch Screen. [Ubisoft]… Expand"}, {"name": "The Legend of Spyro: A New Beginning", "details_link": "https://www.metacritic.com/game/ds/the-legend-of-spyro-a-new-beginning", "publisher": "Sierra Entertainment", "release_date": "Oct 10 2006", "developers": ["Amaze Entertainment"], "platforms": ["PlayStation 2", "DS"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 68, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/613e682fedf3d8543b04881081913821-98.jpg", "descriptions": "In The Legend of Spyro A New Beginning, players experience the awesome power of the purple dragon as they unleash devastating fury attacks, upgradeable breaths and ground-to-aerial melee combos in frenzied battles with hordes of menacing enemies and bone-chilling bosses. The action game alsoIn The Legend of Spyro A New Beginning, players experience the awesome power of the purple dragon as they unleash devastating fury attacks, upgradeable breaths and ground-to-aerial melee combos in frenzied battles with hordes of menacing enemies and bone-chilling bosses. The action game also introduces a new dragon upgrade system, giving players the freedom to increase the power and variety of attacks to their liking. [Vivendi Games]… Expand"}, {"name": "Midway Arcade Treasures 3", "details_link": "https://www.metacritic.com/game/xbox/midway-arcade-treasures-3", "publisher": "Midway", "release_date": "Sep 27 2005", "developers": ["Digital Eclipse"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/f05f1c32a5dd4f650ca8d8ba8769d0e9-98.jpg", "descriptions": "Relive eight of Midway's classic arcade games in Midway Arcade Treasures 3. The game includes both single-player and multiplayer action. You can post your high scores via Xbox Live to see if you measure up to the best in the world. The games include: Badlands, Hydro Thunder, Off RoadRelive eight of Midway's classic arcade games in Midway Arcade Treasures 3. The game includes both single-player and multiplayer action. You can post your high scores via Xbox Live to see if you measure up to the best in the world. The games include: Badlands, Hydro Thunder, Off Road Thunder: Mud, Sweat, N' Gears, Race Drivin', San Francisco Rush The Rock: Alcatraz Edition, San Francisco Rush 2049, S.T.U.N. Runner, and Super Off Road with the Bonus Tracks Pack.… Expand"}, {"name": "Terminator 3: The Redemption", "details_link": "https://www.metacritic.com/game/gamecube/terminator-3-the-redemption", "publisher": "Atari", "release_date": "Sep  6 2004", "developers": ["Paradigm Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/cc652d0c4f38cf652f55d1a322317fa8-98.jpg", "descriptions": "Step into the shoes of the Terminator in a postapocalyptic universe. With machines and vehicles straight from the Terminator films, you'll engage enemies in ground and air combat. As humanity's most powerful weapon, you can perform a variety of actions--including ripping out opposingStep into the shoes of the Terminator in a postapocalyptic universe. With machines and vehicles straight from the Terminator films, you'll engage enemies in ground and air combat. As humanity's most powerful weapon, you can perform a variety of actions--including ripping out opposing Terminators' power cells and using them as high-powered explosive devices, using dismantled Endoskeletons as shields, and smashing opponents to pieces with metal-bending hand-to-hand moves. Fight for the cause through three distinct timelines across massive worlds. … Expand"}, {"name": "Yu-Gi-Oh! World Championship Tournament 2004", "details_link": "https://www.metacritic.com/game/game-boy-advance/yu-gi-oh!-world-championship-tournament-2004", "publisher": "Konami", "release_date": "Feb 10 2004", "developers": ["KCEJ"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/ab6ff0b73b6a5944ef948863d21571b1-98.jpg", "descriptions": "Find out who's the best card-battle player in Yu-Gi-Oh! World Championship Tournament 2004.  Construct your monster cards, spell cards, trap cards, and special summon cards into three separate decks for different dueling strategies.  You can conquer the tournament solo or link up with aFind out who's the best card-battle player in Yu-Gi-Oh! World Championship Tournament 2004.  Construct your monster cards, spell cards, trap cards, and special summon cards into three separate decks for different dueling strategies.  You can conquer the tournament solo or link up with a friend in a multiplayer battle.  With over 1000 game cards and dozens of popular characters from the Yu-Gi-Oh!  TV series, the excitement and exhilaration of the Yu-Gi-Oh trading card game is captured in full force.… Expand"}, {"name": "Dark Fall: The Journal", "details_link": "https://www.metacritic.com/game/pc/dark-fall-the-journal", "publisher": "The Adventure Company", "release_date": "Jul 25 2003", "developers": ["XXV Productions"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/99f8fc33af3711e81738328092a34e8e-98.jpg", "descriptions": "Returning from work you listen to a frightened and cryptic voice message from your brother, a talented architect redeveloping the old Dowerton station in Dorset, England. Boarding a train to meet him, you travel to Dowerton alone, wondering what adventure you may be embarking on... \rWhenReturning from work you listen to a frightened and cryptic voice message from your brother, a talented architect redeveloping the old Dowerton station in Dorset, England. Boarding a train to meet him, you travel to Dowerton alone, wondering what adventure you may be embarking on... \rWhen you arrive, the train is empty and the station is deserted. You begin to explore - the train tunnels, the station, the adjoining hotel, and the grounds - and discover that although no one is there, you are not alone. Finding artifacts, ancient documents and a valuable journal, you realize that the area holds a history of disappearances and hauntings dating back centuries. [DreamCatcher Interactive]… Expand"}, {"name": "Gallop Racer 2003: A New Breed", "details_link": "https://www.metacritic.com/game/playstation-2/gallop-racer-2003-a-new-breed", "publisher": "Tecmo", "release_date": "Mar 31 2003", "developers": ["Tecmo"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Horse Racing"], "meta_score": 68, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/f25e056d448d3ec016494d03e3bb3fb3-98.jpg", "descriptions": "Experience the world of Gallop Racer with an inside look into the unique sport of thoroughbred racing! Gallop Racer 2003 is bigger and better than before with a fully interactive betting system, a horse training mode for beginner riders, 32 different track environments, and over 3000Experience the world of Gallop Racer with an inside look into the unique sport of thoroughbred racing! Gallop Racer 2003 is bigger and better than before with a fully interactive betting system, a horse training mode for beginner riders, 32 different track environments, and over 3000 unlockable horses!  [Tecmo]… Expand"}, {"name": "ATV Quad Power Racing 2", "details_link": "https://www.metacritic.com/game/xbox/atv-quad-power-racing-2", "publisher": "Acclaim", "release_date": "Jan 27 2003", "developers": ["Climax Group"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/18aab44fc27a2108a336f8257b3d899b-98.jpg", "descriptions": "ATV: Quad Power Racing 2 is all about big tricks, big boots to the face, and big finishes.  As ten of the top pro riders in the world with real-life sponsors, you can race in 15 massive tracks and two freestyle arenas full of fast, edge-of-your-seat gameplay.  Fight your way to the finishATV: Quad Power Racing 2 is all about big tricks, big boots to the face, and big finishes.  As ten of the top pro riders in the world with real-life sponsors, you can race in 15 massive tracks and two freestyle arenas full of fast, edge-of-your-seat gameplay.  Fight your way to the finish with kick attacks, huge jumps, and power slides.  Get ready for this arcade-style ATV racer.… Expand"}, {"name": "Army Men: RTS", "details_link": "https://www.metacritic.com/game/playstation-2/army-men-rts", "publisher": "3DO", "release_date": "Mar 27 2002", "developers": ["Pandemic Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Fantasy"], "meta_score": 68, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/3e0a1959ae35ef2bcaf85bfd68aa8b13-98.jpg", "descriptions": "A deep and strategic adventure without the intimidation of other Real-Time Strategy games. Army Men: RTS features an intuitive interface custom designed for the PlayStation 2, and is easy to pick up and play. This is not another plastic soldier game; the game forces players to think aboutA deep and strategic adventure without the intimidation of other Real-Time Strategy games. Army Men: RTS features an intuitive interface custom designed for the PlayStation 2, and is easy to pick up and play. This is not another plastic soldier game; the game forces players to think about how to strategically build and manage troops, vehicles and buildings while involved in an all out war! [3DO]… Expand"}, {"name": "Ultimate Ride", "details_link": "https://www.metacritic.com/game/pc/ultimate-ride", "publisher": "Disney Interactive", "release_date": "Sep 30 2001", "developers": ["Gigawatt Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Strategy", "General", "Management", "Business / Tycoon"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/6a490fb21a97c93f534fdd000ccf407b-98.jpg", "descriptions": "Custom design, test, and ride roller coasters in your own theme park. Ride them in first person mode them posting them online.  Also includes a mission mode. [Disney Interactive]"}, {"name": "Ball Breakers", "details_link": "https://www.metacritic.com/game/playstation/ball-breakers", "publisher": "Take-Two Interactive", "release_date": "Jul 26 2000", "developers": ["Lost Toys"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 68, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/47be29e0c9c98f41e40a873540a04532-98.jpg", "descriptions": "Sentenced to eternity in an ultra violent intergalactic prison for a crime you didn't commit, you only have one shot at freedom, and it's a long hard road to roll down. You will have to go head to head with the \"Best of the Worst\". The most vicious and violent humanoid prisonersSentenced to eternity in an ultra violent intergalactic prison for a crime you didn't commit, you only have one shot at freedom, and it's a long hard road to roll down. You will have to go head to head with the \"Best of the Worst\". The most vicious and violent humanoid prisoners the galaxy has to offer. Fight your way across the universe, beating any and all opponents... If you're tough enough, you can win back the freedom that is rightfully yours... if you're the last man rolling!… Expand"}, {"name": "Bang! Gunship Elite", "details_link": "https://www.metacritic.com/game/pc/bang!-gunship-elite", "publisher": "Red Storm Entertainment", "release_date": "Jul 19 2000", "developers": ["Rayland Interactive"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/2a8dc9966529f53818643b4ca2a332f8-98.jpg", "descriptions": "Incredible rendering techniques, real-time 3-D universes, aliens, asteroids, mammoth vessels, aggressive fighters, and powerful weapons will make this the action game your universe is clamoring for!  [Red Storm Entertainment]"}]