[{"name": "Two Point Hospital", "details_link": "https://www.metacritic.com/game/xbox-one/two-point-hospital", "publisher": "Sega", "release_date": "Feb 25 2020", "developers": ["Two Point Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Management", "Virtual", "Career", "Business / Tycoon"], "meta_score": 84, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/3427287f82fef1ed3a1dc49666010675-98.jpg", "descriptions": "BUILD, CURE and IMPROVE! Design stunning hospitals, decorate them as you like, cure very unusual illnesses and manage troublesome staff as you spread your budding healthcare organization across Two Point County. Design and build your own hospital."}, {"name": "Wargroove", "details_link": "https://www.metacritic.com/game/playstation-4/wargroove", "publisher": "Chucklefish", "release_date": "Jul 23 2019", "developers": ["Chucklefish"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 84, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/69dd9c05613622d8092b26783a09262a-98.jpg", "descriptions": "Take to the battlefield with Wargroove, a strategy game for up to 4 players. Choose your Commander and wage turn-based war on battling factions. Design and share maps, cut-scenes and campaigns with easy-to-use editors and in-depth customization tools."}, {"name": "Assassin's Creed IV: Black Flag", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-iv-black-flag", "publisher": "Ubisoft", "release_date": "Nov 19 2013", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "PlayStation 4", "Stadia", "Wii U", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/12684fda4b57ad657365d46828373b32-98.jpg", "descriptions": "The year is 1715. Pirates rule the waters of the Caribbean and have established a lawless Republic. Among these outlaws is a lethal young captain named Edward Kenway. His notorious exploits earn the respect of legends like Blackbeard, but draw him into an ancient war that may destroyThe year is 1715. Pirates rule the waters of the Caribbean and have established a lawless Republic. Among these outlaws is a lethal young captain named Edward Kenway. His notorious exploits earn the respect of legends like Blackbeard, but draw him into an ancient war that may destroy everything the pirates have built for themselves.… Expand"}, {"name": "SoulCalibur VI", "details_link": "https://www.metacritic.com/game/playstation-4/soulcalibur-vi", "publisher": "Namco", "release_date": "Oct 19 2018", "developers": ["Bandai Namco Games", "Project Soul"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 84, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/4eefca20e007cb3ed09a4c4f377d0d7f-98.jpg", "descriptions": "History Hides Away More Than One Truth... SOULCALIBUR VI represents the latest entry in the premier weapons-based, head-to-head fighting series and continues the epic struggle of warriors searching for the legendary Soul Swords. Taking place in the 16th century, revisit the events of theHistory Hides Away More Than One Truth... SOULCALIBUR VI represents the latest entry in the premier weapons-based, head-to-head fighting series and continues the epic struggle of warriors searching for the legendary Soul Swords. Taking place in the 16th century, revisit the events of the original SOULCALIBUR to uncover hidden truths. [Bandai Namco]… Expand"}, {"name": "Griftlands", "details_link": "https://www.metacritic.com/game/pc/griftlands", "publisher": "Klei Entertainment", "release_date": "Jun  1 2021", "developers": ["Klei Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "Card Battle"], "meta_score": 84, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/46e958b908259c4fb051de4f931c8351-98.jpg", "descriptions": "Griftlands is a deck-building rogue-like where you fight and negotiate your way through a broken-down sci-fi world."}, {"name": "Bloodstained: Ritual of the Night", "details_link": "https://www.metacritic.com/game/xbox-one/bloodstained-ritual-of-the-night", "publisher": "505 Games", "release_date": "Jun 18 2019", "developers": ["ArtPlay"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["2D", "Action", "Role-Playing", "Platformer", "Action RPG", "", "Metroidvania"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/c70d9d15986f5c4b62b9a6823cb5110d-98.jpg", "descriptions": "You are Miriam, an orphan scarred by an alchemist curse which slowly crystallizes your skin. You must battle your way through a demon-filled castle summoned by Gebel, your old friend whose body has become more crystal than flesh.\r * Exploration: Bloodstained's story unfolds as you exploreYou are Miriam, an orphan scarred by an alchemist curse which slowly crystallizes your skin. You must battle your way through a demon-filled castle summoned by Gebel, your old friend whose body has become more crystal than flesh.\r * Exploration: Bloodstained's story unfolds as you explore Gebel's hellish castle; a sprawling structure that features a variety of locations. As you explore the massive castle you'll find warp gates that will allow you to travel quickly without having to backtrack too much.\r* RPG Elements: It's not an Igavania without leveling, and Bloodstained will be no exception. In addition to the classic elements everyones come to expect, enemies in Bloodstained will drop a wide variety of items, materials, and magi-crystals necessary to create the items that will get you safely through Gebels castle.\r* Crafting: As you explore, fight enemies, and complete quests you will gain experience and become more powerful, acquiring a variety of weapons along the way. Enemies will also drop materials you can use to craft new weapons and abilities using Miriam's training in alchemy.… Expand"}, {"name": "NBA 2K6", "details_link": "https://www.metacritic.com/game/playstation-2/nba-2k6", "publisher": "2K Sports", "release_date": "Sep 26 2005", "developers": ["Visual Concepts"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "10  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/d021612ec3d758341f51484dfe869f6b-98.jpg", "descriptions": "Shot Stick -- Control the direction of your shot with the right analog stick. Pull off runners, fade-aways, finger rolls and dunks with a flick of the stick. Dual Player Control -- Set teammates into motion for alley-oops, give and gos, or to hit an open man for a 3 point play with the touchShot Stick -- Control the direction of your shot with the right analog stick. Pull off runners, fade-aways, finger rolls and dunks with a flick of the stick. Dual Player Control -- Set teammates into motion for alley-oops, give and gos, or to hit an open man for a 3 point play with the touch of the d-pad. Strip n Rip System -- Direction specific stealing controls let players anticipate passes by jumping into passing lanes to deflect or intercept a pass, as well as, strip the ball from a player driving to the hoop or a player with weak hands coming down with the rebound. V.I.P. System -- After your game, save your friends’ profiles to compete when they’re not available! Learn their tendencies, moves, & logic for more heated battles. Get the upper hand in an online tournaments by downloading other players’ VIP profiles. The Crib -- New to NBA 2K6 this year, you can now earn crib credits with every game you play to deck out your crib, buy music, or play mini-games. 24/7: Road to the EBC  -- Take to the streets of Harlem in the Entertainer's Basketball Classic to play against NBA players and Def Jam Celebrities including Red Man, Method Man, Flavor Flav, and many other special guests. [2K Games]… Expand"}, {"name": "Hyper Light Drifter", "details_link": "https://www.metacritic.com/game/pc/hyper-light-drifter", "publisher": "Heart Machine", "release_date": "Mar 31 2016", "developers": ["Heart Machine"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/e63ed908eb4f00aed87e7e1a228edbc5-98.jpg", "descriptions": "Explore a beautiful, vast and ruined world riddled with unknown dangers and lost technologies. Inspired by nightmares and dreams alike. Hyper Light Drifter is a 2D Action RPG in the vein of the best 8-bit and 16-bit classics, with modernized mechanics and designs on a much grander scale."}, {"name": "Worms 2: Armageddon", "details_link": "https://www.metacritic.com/game/xbox-360/worms-2-armageddon", "publisher": "Team17", "release_date": "Jul  1 2009", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "Fantasy", "Artillery"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/e6e9b179d831062bd371189012182b13-98.jpg", "descriptions": "[Xbox Live Arcade]  Ten years on from Worms Armageddon and the turn-based mayhem and destruction continues! Worms 2: Armageddon is the most fully-featured digital version of the game ever. With four player online and offline multiplayer, voice support, a raft of new weapons (including the[Xbox Live Arcade]  Ten years on from Worms Armageddon and the turn-based mayhem and destruction continues! Worms 2: Armageddon is the most fully-featured digital version of the game ever. With four player online and offline multiplayer, voice support, a raft of new weapons (including the return of some iconic weapons from the past), all-new high-definition landscape themes, new play modes, hats, skins, speech-banks, loads of other customization and to top it all off, a highly-involving single player experience with tutorials, deathmatches, races, fort games, and puzzles. It's a package as high on fun as it is destruction. [Team17 Software]… Expand"}, {"name": "Skate 2", "details_link": "https://www.metacritic.com/game/playstation-3/skate-2", "publisher": "EA Games", "release_date": "Jan 21 2009", "developers": ["EA Black Box"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/1749e0b969616fd5e1d6eff48a76caf6-98.jpg", "descriptions": "Skate 2 picks up five years after the original Skate, a period marred by an unspeakable disaster that left San Vanelona in ruins. Within that time, Mongocorp rebuilt the city but their zealous protection of private property has put a damper on the once thriving skate population. EquippedSkate 2 picks up five years after the original Skate, a period marred by an unspeakable disaster that left San Vanelona in ruins. Within that time, Mongocorp rebuilt the city but their zealous protection of private property has put a damper on the once thriving skate population. Equipped with double the bag of tricks, gamers are tasked to rebuild their career and revive the New San Vanelona skate scene. With their ability to get off-board to move objects around and with help from a crew of locals, players embark on a mission to take back the city, one spot at a time. Along the way, they need to get coverage, earn sponsorships, own challenges and enter contests, including a coveted invite to etnies GvR competition. [Electronic Arts]… Expand"}, {"name": "Hitman - Episode 2: Sapienza", "details_link": "https://www.metacritic.com/game/pc/hitman---episode-2-sapienza", "publisher": "Square Enix", "release_date": "Apr 26 2016", "developers": ["Io Interactive"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 84, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/6e06aa4d47c3c065fdfc25273afa318d-98.jpg", "descriptions": "The 2nd installment of HITMAN finds Agent 47 traveling to the beautiful, sun-drenched coastal town of Sapienza, Italy. This episode adds a new story mission, new challenges, new weapons and gear, the Italian suit and of course new targets, opportunities and disguises."}, {"name": "ZEN Pinball 2: Aliens Vs. Pinball", "details_link": "https://www.metacritic.com/game/playstation-4/zen-pinball-2-aliens-vs-pinball", "publisher": "Zen Studios", "release_date": "Apr 26 2016", "developers": ["Zen Studios"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "Pinball"], "meta_score": 84, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/86b2f39311c40f86cbf6cc40659a69cf-98.jpg", "descriptions": "Survive Xenomorph encounters in three thrilling pinball tables inspired by the ALIEN franchise. \r\r- Join Ellen Ripley as she confronts the Alien Queen and helps the Colonial Marines eliminate LV-426's alien infestation on the Aliens Pinball table\r\r\n- Help Amanda Ripley survive theSurvive Xenomorph encounters in three thrilling pinball tables inspired by the ALIEN franchise. \r\r- Join Ellen Ripley as she confronts the Alien Queen and helps the Colonial Marines eliminate LV-426's alien infestation on the Aliens Pinball table\r - Help Amanda Ripley survive the dangerous halls of Sevastopol Station while evading a merciless Xenomorph on the Alien: Isolation Pinball table\r - Defeat Xenomorphs, rise in the ranks of Yautja society, and choose your allies wisely on the Alien vs. Predator Pinball table\r - Listen to original voiceovers and sound effects directly pulled from the ALIEN franchise\r - Leaderboards, score tracking, exciting social features, and more… Expand"}, {"name": "Teenage Mutant Ninja Turtles: Shredder's Revenge", "details_link": "https://www.metacritic.com/game/pc/teenage-mutant-ninja-turtles-shredders-revenge", "publisher": "DotEmu", "release_date": "Jun 16 2022", "developers": ["Tribute Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 6 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/191d8f684d5d29747798e3ab95d8d2a2-98.jpg", "descriptions": "With Bebop and Rocksteady assaulting Channel 6 and stealing super gnarly devices to support Krang and Shredder's latest twisted plan, Teenage Mutant Ninja Turtles: Shredder's Revenge sees the Turtles battling across a righteous range of timeless TMNT locations. From Manhattan and ConeyWith Bebop and Rocksteady assaulting Channel 6 and stealing super gnarly devices to support Krang and Shredder's latest twisted plan, Teenage Mutant Ninja Turtles: Shredder's Revenge sees the Turtles battling across a righteous range of timeless TMNT locations. From Manhattan and Coney Island, to city rooftops and dank sewers, help the fearsome foursome trounce Foot Soldiers, Triceraton Warriors, and Rock Troops all the way to Dimension X! \r\rEnjoy stunning full-color pixel art graphics and a vintage TMNT vibe that will rock you straight back to the awesome 80s. Every character, vehicle, weapon, item, and background is directly inspired by the 1987 TV show, making you feel like you hopped into the television -- with a dope mix of killer humor and action-packed adventures!… Expand"}, {"name": "Child of Light", "details_link": "https://www.metacritic.com/game/wii-u/child-of-light", "publisher": "Ubisoft", "release_date": "Apr 29 2014", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Xbox 360", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "General", "General"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/6aabba5716c191a10888fdc68d1cc4aa-98.jpg", "descriptions": "The duke's daughter Aurora is dead; and yet, she lives. Join Aurora across the mysterious kingdom of Lemuria on her quest to return home. Helped by Igniculus the firefly, Finn the Capilli and many more, she must defeat the Queen of the Night who has stolen the sun, the moon and the stars."}, {"name": "Bit.Trip Complete", "details_link": "https://www.metacritic.com/game/wii/bittrip-complete", "publisher": "Aksys Games", "release_date": "Sep 13 2011", "developers": ["Gaijin Games"], "platforms": ["3DS", "PlayStation 4", "PlayStation Vita", "Wii"], "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/1682ea32e043ca2520c4671d468d5306-98.jpg", "descriptions": "All six BIT.TRIP games are transformed into 3D, morphing into a single entity called /BIT.TRIP SAGA/. Experience the crushing difficulty of the rhythmic galaxies and ride along the long journey with CommanderVideo as he completes his mission and returns...home."}, {"name": "Classic NES Series: Super Mario Bros.", "details_link": "https://www.metacritic.com/game/game-boy-advance/classic-nes-series-super-mario-bros", "publisher": "Nintendo", "release_date": "Jun  2 2004", "developers": ["Nintendo"], "platforms": ["Switch", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/35f9cffa26b61288049d2acb0a56a266-98.jpg", "descriptions": "Classic NES Series: Super Mario Bros. takes you back to the very first battle between Mario and Bowser. Now on the Game Boy Advance, you can relive all the mushroom-eating, Koopa-stomping action from the original game. Always strive for the high score while jumping on top of flag poles,Classic NES Series: Super Mario Bros. takes you back to the very first battle between Mario and Bowser. Now on the Game Boy Advance, you can relive all the mushroom-eating, Koopa-stomping action from the original game. Always strive for the high score while jumping on top of flag poles, pipes, and bricks. This time, two players can alternate play with a single Game Pak or with GBAs linked by a Game Boy Advance Game Link Cable. … Expand"}, {"name": "NBA Live 2004", "details_link": "https://www.metacritic.com/game/gamecube/nba-live-2004", "publisher": "EA Sports", "release_date": "Oct 15 2003", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/f7dc6e3b6d8f04b264567e8ae66e41bb-98.jpg", "descriptions": "Step up your game with NBA Live 2004.  With brand-new 10-Man Freestyle, authentic gameplay and stunning graphics, NBA Live 2004 delivers a complete basketball experience.  Whether running the point with one-button Quick Plays, spinning free in the lane for a vicious dunk or locking down onStep up your game with NBA Live 2004.  With brand-new 10-Man Freestyle, authentic gameplay and stunning graphics, NBA Live 2004 delivers a complete basketball experience.  Whether running the point with one-button Quick Plays, spinning free in the lane for a vicious dunk or locking down on \"D,\" the revamped EA Sports Freestyle Controller puts you in total control.  With a dramatically enhanced Dynasty Mode, the ability to take the court at all NBA arenas and all-new commentary from Marv Albert and Mike Fratello, NBA Live 2004 looks to step up the authenticity.… Expand"}, {"name": "Age of Mythology: The Titans", "details_link": "https://www.metacritic.com/game/pc/age-of-mythology-the-titans", "publisher": "Microsoft Game Studios", "release_date": "Sep 30 2003", "developers": ["Ensemble Studios"], "platforms": "PC", "num_players": "1-12 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 84, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/fcbfb4952d179e83078821af28bc7876-98.jpg", "descriptions": "Age of Mythology: The Titans Expansion adds a fourth mythology, the Atlanteans, to the existing Greek, Egyptian and Norse mythologies. A new single-player campaign will add yet another chapter to the franchise's expansive folklore along with the addition of new scenarios. Atlantean playersAge of Mythology: The Titans Expansion adds a fourth mythology, the Atlanteans, to the existing Greek, Egyptian and Norse mythologies. A new single-player campaign will add yet another chapter to the franchise's expansive folklore along with the addition of new scenarios. Atlantean players will be able to call upon the might of the Titan gods (such as Atlas and Cronus) multiple times throughout the game, and may also upgrade human units to heroes. The expansion pack will introduce 12 new god powers, 15 new human units and 10 formidable myth units to the game. [Microsoft]… Expand"}, {"name": "SimCity 4", "details_link": "https://www.metacritic.com/game/pc/simcity-4", "publisher": "EA Games", "release_date": "Jan 12 2003", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "City Building", "Management", "Modern", "Modern", "Government"], "meta_score": 84, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/8ed5e013566e992e8f97240a3a19a51f-98.jpg", "descriptions": "PLAY GOD - Sculpt mountains, gouge valleys, seed forests, and bring forth animals to create a world imagined only by you. Summon volcanoes, release tornadoes, and call down meteors and ligthening. PLAY MAYOR - Connect a massive region of SimCities, each sharing and competing for resources.PLAY GOD - Sculpt mountains, gouge valleys, seed forests, and bring forth animals to create a world imagined only by you. Summon volcanoes, release tornadoes, and call down meteors and ligthening. PLAY MAYOR - Connect a massive region of SimCities, each sharing and competing for resources. Deploy emergency vehicles and join in the action as they battle blazes, mobs, and more. PLAY WITH YOUR SIMS - Place your Sims in your city to get the inside scoop on what life's really like around town. Feel the rhythm of the city: mellow cruising and commuter hell, noontime crowds and nighttime calm. [Electronic Arts]… Expand"}, {"name": "Sega Soccer Slam", "details_link": "https://www.metacritic.com/game/gamecube/sega-soccer-slam", "publisher": "Sega", "release_date": "Mar 18 2002", "developers": ["Black Box"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/fca6939bce6ead89f9fee65a13f90f1f-98.jpg", "descriptions": "A host of diverse teams from across the globe unite on the green for intense three-on-three matches of soccer. Not your ordinary soccer game, Sega Soccer Slam involves violent tackles, killer kicks, and spotlight maneuvers. In Quest mode, you can take any team through a series of matches,A host of diverse teams from across the globe unite on the green for intense three-on-three matches of soccer. Not your ordinary soccer game, Sega Soccer Slam involves violent tackles, killer kicks, and spotlight maneuvers. In Quest mode, you can take any team through a series of matches, while unlocking secret stadium locations and gaining access to hidden power-ups. Alternative gameplay options include Arcade mode, Challenge mode, and a round-robin Tourney mode with multiplayer action for up to six players. … Expand"}, {"name": "Splashdown", "details_link": "https://www.metacritic.com/game/playstation-2/splashdown", "publisher": "Atari", "release_date": "Nov  5 2001", "developers": ["Rainbow Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Snow / Water"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/e4afd43b7d10174cdee5635090e921f1-98.jpg", "descriptions": "Speed through the water while busting freestyle tricks on a Sea-Doo. Splashdown is a high quality visual experience associated with realistic water physics and Sea-Doo handling. 18 lush real-world environments and 8 wild characters with their own signature tricks complete the game play. [Infogrames]"}, {"name": "Spider-Man: Mysterio's Menace", "details_link": "https://www.metacritic.com/game/game-boy-advance/spider-man-mysterios-menace", "publisher": "Activision", "release_date": "Sep 19 2001", "developers": ["Vicarious Visions"], "platforms": "Game Boy Advance", "genres": ["Action", "General"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/03bbd917004bca290a2cb00285a679d8-98.jpg", "descriptions": "Mysterio, the Master of Illusion, is using his powers to change New York City into his very own sinister amusement park. Lucky for the Big Apple, he's forgotten one thing: you're Spider-Man, and for one power-hungry super-villain, that means playtime's over."}, {"name": "Super Mario Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/super-mario-advance", "publisher": "Nintendo", "release_date": "Jun 10 2001", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/1b63013b41ad970bca845ee012753d82-98.jpg", "descriptions": "Mario's Game Boy Advance debut gives gamers two games in one: an enhanced version of Super Mario Bros. 2 and an action-packed four-player version of the original Mario Bros. arcade game.  First released for the original NES in 1988, Super Mario Bros. 2 makes its debut on the Game Boy AdvanceMario's Game Boy Advance debut gives gamers two games in one: an enhanced version of Super Mario Bros. 2 and an action-packed four-player version of the original Mario Bros. arcade game.  First released for the original NES in 1988, Super Mario Bros. 2 makes its debut on the Game Boy Advance with new enemies, improved graphics, and tougher challenges.  Mario, Luigi, Peach, and Toad adventure through seven fantasy worlds on a quest to save the day, though they have little more than vegetables for defense.  New challenges include collecting red coins and finding Yoshi's hidden eggs.  … Expand"}, {"name": "Microsoft Train Simulator", "details_link": "https://www.metacritic.com/game/pc/microsoft-train-simulator", "publisher": "Microsoft Game Studios", "release_date": "May 31 2001", "developers": ["Kuju Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Train", "Vehicle", "Train"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/6cec67bedd8f0a437d1ed2cf4a1688e2-98.jpg", "descriptions": "Take control of three engine types -- the electric-powered Acela HHP-8, the diesel Dash-9, and the steam-driven Flying Scotsman -- on a variety of real-life routes, including Japan's Kyushu and Shinjuku-Hakone lines, the US?s Northeast Corridor and Marias Pass, and Europe?s Settle & CarlisleTake control of three engine types -- the electric-powered Acela HHP-8, the diesel Dash-9, and the steam-driven Flying Scotsman -- on a variety of real-life routes, including Japan's Kyushu and Shinjuku-Hakone lines, the US?s Northeast Corridor and Marias Pass, and Europe?s Settle & Carlisle and Orient Express.… Expand"}, {"name": "San Francisco Rush 2049", "details_link": "https://www.metacritic.com/game/dreamcast/san-francisco-rush-2049", "publisher": "Midway", "release_date": "Sep  6 2000", "developers": ["Midway"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/0032a4f093e548fc9889b70a4d681231-98.jpg", "descriptions": "San Francisco Rush 2049 - the original arcade racing game with 3 action-packed games in one! Race Mode - Scream through futuristic San Francisco tracks. Stunt Mode - Insane air and gravity-defying tricks. Battle Mode - Lock and load your way through 8 killer battle arenas. Loaded with otherSan Francisco Rush 2049 - the original arcade racing game with 3 action-packed games in one! Race Mode - Scream through futuristic San Francisco tracks. Stunt Mode - Insane air and gravity-defying tricks. Battle Mode - Lock and load your way through 8 killer battle arenas. Loaded with other great features: 19 all-new tracks, 13 selectable cars, 1 - 4 player modes, all-new online competition, and no load time!… Expand"}, {"name": "WipeOut 64", "details_link": "https://www.metacritic.com/game/nintendo-64/wipeout-64", "publisher": "Midway", "release_date": "Nov  3 1998", "developers": ["Psygnosis"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/3f729ed5ff87702dec3f283bfa9c749d-98.jpg", "descriptions": "The fastest races. The deadliest weapons. The biggest name in anti-gravity racing descends on N64 with incredible new visual power and fully enhanced gameplay glory. With blistering races, challenges, time trials and a multiplay league, Wipeout 64 delivers pure racing devastation. FasterThe fastest races. The deadliest weapons. The biggest name in anti-gravity racing descends on N64 with incredible new visual power and fully enhanced gameplay glory. With blistering races, challenges, time trials and a multiplay league, Wipeout 64 delivers pure racing devastation. Faster than you can imagine.… Expand"}, {"name": "Dead or Alive", "details_link": "https://www.metacritic.com/game/playstation/dead-or-alive", "publisher": "Tecmo", "release_date": "Mar 31 1998", "developers": ["Team Ninja"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/52a1f9e6e115cf5ae11726c53daab30e-98.jpg", "descriptions": "The fighting game  you've been waiting for...Purist fighting for purist fighting fans. No lightening bolts, no magic tricks, no weapons...Your survival is all in your own hands."}, {"name": "Magic: The Gathering Arena", "details_link": "https://www.metacritic.com/game/pc/magic-the-gathering-arena", "publisher": "Wizards of the Coast", "release_date": "Sep 27 2018", "developers": ["Magic Digital Studio"], "platforms": ["iPhone/iPad", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 84, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/9/bf2c77e0028a56d680ed0c203eab3d74-98.jpg", "descriptions": "You know the name. Now download and get ready for the most colossal crossover card set in Magic: The Gathering's history. Unlock powerful decks, earn rewards by playing, and jump into action for players of all skill levels."}, {"name": "The Incredible Hulk: Ultimate Destruction", "details_link": "https://www.metacritic.com/game/gamecube/the-incredible-hulk-ultimate-destruction", "publisher": "VU Games", "release_date": "Aug 23 2005", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/ba1d7b4452fedc002d9f77dca6eed8a9-98.jpg", "descriptions": "The Incredible Hulk: Ultimate Destruction is an action game that lets you play as The Incredible Hulk, one of the most powerful Marvel superheroes. Now you can use the Hulk's strength to run, jump, and climb anywhere across landscapes from the comic series. You can increase your strength andThe Incredible Hulk: Ultimate Destruction is an action game that lets you play as The Incredible Hulk, one of the most powerful Marvel superheroes. Now you can use the Hulk's strength to run, jump, and climb anywhere across landscapes from the comic series. You can increase your strength and unlock more moves by completing more than 30 story missions and 40 side missions. The game's destructible environments can help you fight bosses, gain weapons, and destroy buildings. … Expand"}, {"name": "Split/Second", "details_link": "https://www.metacritic.com/game/playstation-3/splitsecond", "publisher": "Disney Interactive Studios", "release_date": "May 18 2010", "developers": ["Black Rock Studio"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/bae87782d04cde30c27603d86e8ffd4b-98.jpg", "descriptions": "Split/Second, an intense action racing game set within the world of a hyper-competitive reality television show. Competitors vie to be the first across the finish line in a made-for-TV city built for destruction, with the ultimate goal of becoming the season champion. Competitors inSplit/Second, an intense action racing game set within the world of a hyper-competitive reality television show. Competitors vie to be the first across the finish line in a made-for-TV city built for destruction, with the ultimate goal of becoming the season champion. Competitors in Split/Second don't just collide with other vehicles to knock them from the track -- they can also trigger explosive events that drastically alter the dynamics of the race. Players must use strategy and pinpoint timing to derail opponents, tactically alter the track or create entirely new routes. [Disney]… Expand"}, {"name": "Gordian Quest", "details_link": "https://www.metacritic.com/game/pc/gordian-quest", "publisher": "Mixed Realms Pte Ltd", "release_date": "Jun 23 2022", "developers": ["Mixed Realms Pte Ltd"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/c9686b3f827f8b9644393d2a44fc0471-98.jpg", "descriptions": "A sinister curse corrupts the land. Darkness reigns. Monsters roam. Scoundrels loot. Cowards flee. Heroes emerge.Lead heroes on an adventure to save what's left of this fallen world and destroy the root of evil abound. Will you fall at the claws of your enemies or the consequences of yourA sinister curse corrupts the land. Darkness reigns. Monsters roam. Scoundrels loot. Cowards flee. Heroes emerge.Lead heroes on an adventure to save what's left of this fallen world and destroy the root of evil abound. Will you fall at the claws of your enemies or the consequences of your poor decisions? Your Gordian Quest is about to begin.Gordian Quest is an epic roguelike / lite adventure that combines the best elements of deckbuilding, tactical combat and strategic decision-making. You will form parties of heroes whom you will have to lead and manage on grueling missions. Help them forge bonds and discover new skills among them. Be fearless and unwavering as you work to unravel the curses laid upon the lands and defeat the ultimate evil at the heart of it all.… Expand"}, {"name": "Infernax", "details_link": "https://www.metacritic.com/game/switch/infernax", "publisher": "The Arcade Crew", "release_date": "Feb 14 2022", "developers": ["Berzerk Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/579350d700bbacc600d38555998fd6e4-98.jpg", "descriptions": "Infernax is the adventures of a great knight who returns to his homeland only to find it plagued with unholy magic. Uncover the mysteries of the curse and face the consequences of your actions."}, {"name": "Lone Survivor: The Director's Cut", "details_link": "https://www.metacritic.com/game/playstation-3/lone-survivor-the-directors-cut", "publisher": "Curve Studios", "release_date": "Sep 24 2013", "developers": ["Curve Studios", "superflat games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Wii U", "PlayStation 3"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/745390ecc972d686db24f48531c35e46-98.jpg", "descriptions": "Lone Survivor is a psychological survival adventure game which has taken elements from classic adventure games and the best elements of the survival horror genre to create something you haven’t seen before. You can expect scares, scarcity of ammo and exploration of surreal and atmosphericLone Survivor is a psychological survival adventure game which has taken elements from classic adventure games and the best elements of the survival horror genre to create something you haven’t seen before. You can expect scares, scarcity of ammo and exploration of surreal and atmospheric environments to be a big part of the game, but there’s also an element of psychological horror and choice that often isn’t explored in modern survival horror titles. [Playstation.com]… Expand"}, {"name": "The Lord of the Rings: The Return of the King", "details_link": "https://www.metacritic.com/game/gamecube/the-lord-of-the-rings-the-return-of-the-king", "publisher": "EA Games", "release_date": "Nov  5 2003", "developers": ["Hypnos Entertainment"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Return to Middle-earth in a game based on the epic final chapter of the The Lord of the Rings movie trilogy.  Developed using the same digital assets as the films, The Return of the King recreates in stunning detail the final events of the War of the Ring.  Become the heroes who determineReturn to Middle-earth in a game based on the epic final chapter of the The Lord of the Rings movie trilogy.  Developed using the same digital assets as the films, The Return of the King recreates in stunning detail the final events of the War of the Ring.  Become the heroes who determine the fate of Middle-earth as you traverse the haunted Paths of the Dead, defend Minas Tirith, and even play co-op multiplayer with a friend as you march against the impenetrable Black Gates of Mordor.  The fate of Middle-earth is in your hands.… Expand"}, {"name": "Lair of the Clockwork God", "details_link": "https://www.metacritic.com/game/pc/lair-of-the-clockwork-god", "publisher": "Size Five Games", "release_date": "Feb 21 2020", "developers": ["Size Five Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/17ab89cfb05dcf9589380be3eac3a52e-98.jpg", "descriptions": "A fast-paced Point-and-Click adventure AND an indie platfomer in one! Join adventurer Ben and wannabe indie darling Dan in a race against time to stop all the Apocalypses happening at the same time."}, {"name": "Snipperclips Plus: Cut It Out, Together!", "details_link": "https://www.metacritic.com/game/switch/snipperclips-plus-cut-it-out-together!", "publisher": "Nintendo", "release_date": "Nov 10 2017", "developers": ["SFB Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/5b8cb3f3e8867d0ac97116f13b1d0e36-98.jpg", "descriptions": "Partner up with friends or family to solve puzzles, including new comic book and toy box worlds, 3 new activities, and a new stamp mode. Plus, play the original levels in new shapes. If you're new to the game, you can purchase this expanded version at retail. Owners of the original versionPartner up with friends or family to solve puzzles, including new comic book and toy box worlds, 3 new activities, and a new stamp mode. Plus, play the original levels in new shapes. If you're new to the game, you can purchase this expanded version at retail. Owners of the original version can purchase and download this additional content in Nintendo eShop on Nintendo Switch. Snip may need to cut Clip into a needle to pop balloons or maybe you’ll have to team up to form a squawking, egg-laying bird! Prove you're a cut above the rest in Blitz mode, where 2-4 players* can compete in a series of puzzlingly action-packed challenges. Make it a party with Party mode, where up to four players* can team up to solve fun puzzles. [Nintendo]… Expand"}, {"name": "The Walking Dead: Episode 1 - A New Day", "details_link": "https://www.metacritic.com/game/playstation-3/the-walking-dead-episode-1---a-new-day", "publisher": "Telltale Games", "release_date": "Apr 24 2012", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/1bc59759a2b1100a1b3a5114e7d820a3-98.jpg", "descriptions": "Episode one of a five-part game series set in the same universe as Robert Kirkman’s award-winning series. Play as Lee Everett, the convicted criminal who has been given a second chance at life in a world devastated by the undead. Experience events, meet people and visit locations thatEpisode one of a five-part game series set in the same universe as Robert Kirkman’s award-winning series. Play as Lee Everett, the convicted criminal who has been given a second chance at life in a world devastated by the undead. Experience events, meet people and visit locations that foreshadow the story of Deputy Sheriff Rick Grimes. A honed game experience in which actions, choices and decisions you make will affect how your story plays out across the entire series.… Expand"}, {"name": "Tails Of Iron", "details_link": "https://www.metacritic.com/game/xbox-series-x/tails-of-iron", "publisher": "United Label", "release_date": "Sep 17 2021", "developers": ["United Label"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/80abdc5ccb9b87cdaa1afe98347cef47-98.jpg", "descriptions": "Set in a grim land plagued by war, Tails of Iron is a hand-drawn RPG Adventure with punishingly brutal combat. As Redgi, heir to the Rat Throne, you must restore your broken Kingdom by banishing the merciless Frog Clan and their ferocious leader, Greenwart. As you explore the deceivinglySet in a grim land plagued by war, Tails of Iron is a hand-drawn RPG Adventure with punishingly brutal combat. As Redgi, heir to the Rat Throne, you must restore your broken Kingdom by banishing the merciless Frog Clan and their ferocious leader, Greenwart. As you explore the deceivingly charming world, you'll encounter a cast of unique companions, ready to aid you in your adventure. And you'll need all the help you can get, whether that's new meal recipes, blueprints to forge deadly weapons and armour, or even a land-chugging, armour-plated mole mobile! Overcome your fears. Rescue your brothers. Restore Your Kingdom. Your tail has begun. Master Brutal Combat: From frog zombies to gargantuan grubs - and everything in-between - the Kingdom is awash with danger. To overcome each perilous encounter, you'll need to study your opponent's attacks and react accordingly! Thankfully, there's a range of deadly abilities at your disposal, including parry bashes and fatal executions, not to mention ranged attacks with your nifty bow and arrow. Explore a Treacherous Kingdom: Fully accompanied by the deep, raspy narrations of Doug Cockle (voice of Geralt of Rivia from The Witcher), prepare to embark on an epic adventure across the mediaeval-fantasy Rat Kingdom. Complete side quests and faction hunts for some additional gold-on-the-side, or join forces with a sharp-eyed companion to help even the playing field. Customise your Attack: Adapt Redgi's combat style to the task at hand. Heavy armour may provide better protection but can you really afford to slow down your dodge-roll? And then there's the question of weapon; axes pack a punch, while spears are quick and nimble. Perhaps you'd prefer the all-round performance of a trusty broadsword? … Expand"}, {"name": "Tales of Arise", "details_link": "https://www.metacritic.com/game/pc/tales-of-arise", "publisher": "Bandai Namco Games", "release_date": "Sep 10 2021", "developers": ["Bandai Namco Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/beb74e5f2e141b2c348cbf8a8b2c4d1c-98.jpg", "descriptions": "Challenge the Fate That Binds YouOn the planet Dahna, reverence has always been given to Rena, the planet in the sky, as a land of the righteous and divine. Stories handed down for generations became truth and masked reality for the people of Dahna. For 300 years, Rena has ruled overChallenge the Fate That Binds YouOn the planet Dahna, reverence has always been given to Rena, the planet in the sky, as a land of the righteous and divine. Stories handed down for generations became truth and masked reality for the people of Dahna. For 300 years, Rena has ruled over Dahna, pillaging the planet of its resources and stripping people of their dignity and freedom.Our tale begins with two people, born on different worlds, each looking to change their fate and create a new future. Featuring a new cast of characters, updated combat, and classic Tales of gameplay mechanics, experience the next chapter in the world-famous Tale of series, Tales of Arise.The Next ChapterExperience the next chapter in the Tales of series, brought to life in stunning HD powered by Unreal Engine 4Dynamic ActionDynamic Action RPG featuring an updated battle system that retains classic Tales of gameplayA New Tale AwaitsRich story featuring a vibrant world and new cast of charactersStunning VisualsHigh quality animation created by Ufotable… Expand"}, {"name": "Hatsune Miku: Project Diva Future Tone - Colorful Tone", "details_link": "https://www.metacritic.com/game/playstation-4/hatsune-miku-project-diva-future-tone---colorful-tone", "publisher": "Sega", "release_date": "Jan 10 2017", "developers": ["Sega"], "platforms": "PlayStation 4", "genres": ["Action", "Rhythm", "Music"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/1fbc58f5b350144efb2f262b13078600-98.jpg", "descriptions": "Explore the infinite world of Hatsune Miku through the most comprehensive Project Diva game ever released! Hatsune Miku: Project Diva Future Tone Prelude comes with two songs and modules to customize. To unlock the full potential of Future Tone, purchase two packs bursting with 220 songs:Explore the infinite world of Hatsune Miku through the most comprehensive Project Diva game ever released! Hatsune Miku: Project Diva Future Tone Prelude comes with two songs and modules to customize. To unlock the full potential of Future Tone, purchase two packs bursting with 220 songs: Future Sound and Colorful Tone. [Playstation.com]… Expand"}, {"name": "Hatsune Miku: Project Diva Future Tone - Future Sound", "details_link": "https://www.metacritic.com/game/playstation-4/hatsune-miku-project-diva-future-tone---future-sound", "publisher": "Sega", "release_date": "Jan 10 2017", "developers": ["Sega"], "platforms": "PlayStation 4", "genres": ["Action", "Rhythm", "Music"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/80b2588bce035706e4954719f2297af1-98.jpg", "descriptions": "Explore the infinite world of Hatsune Miku through the most comprehensive Project Diva game ever released! Hatsune Miku: Project Diva Future Tone Prelude comes with two songs and modules to customize. To unlock the full potential of Future Tone, purchase two packs bursting with 220 songs:Explore the infinite world of Hatsune Miku through the most comprehensive Project Diva game ever released! Hatsune Miku: Project Diva Future Tone Prelude comes with two songs and modules to customize. To unlock the full potential of Future Tone, purchase two packs bursting with 220 songs: Future Sound and Colorful Tone. [Playstation.com]… Expand"}, {"name": "Fuga: Melodies of Steel", "details_link": "https://www.metacritic.com/game/pc/fuga-melodies-of-steel", "publisher": "CyberConnect2", "release_date": "Jul 29 2021", "developers": ["CyberConnect2"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/ee4bbd8d822d8c4991ee5c1c05d48ce7-98.jpg", "descriptions": "\"We have to fight! If we don't, everyone we love will be taken away!\" One fateful night, a peaceful village is thrown into the flames of war. Determined to save their families, a group of children boards a giant tank and begins an offensive charge! Fuga: Melodies of Steel is an RPG where you\"We have to fight! If we don't, everyone we love will be taken away!\" One fateful night, a peaceful village is thrown into the flames of war. Determined to save their families, a group of children boards a giant tank and begins an offensive charge! Fuga: Melodies of Steel is an RPG where you place children, each with their own unique characteristics and skills, at different gun turrets in a tank to fight against the enemy.\r Living inside the tank, the children show emotion and gain affinity amongst each other. Manage these both to change the outcome of their journey!\r -A mysterious ancient weapon: The Taranis\rTaranis, the giant tank sheltering the children, conceals many mysteries and somehow seems to have its own will. In situations of crisis, it can release a forbidden weapon, the dreadful Soul Cannon.\r -Your adventure. Your choices.\rWill you make sacrifices for victory? Or will you seek another path?\rIn this RPG, many choices have to be made in order to progress...but taking the safest road may not always be the best option. \r\rFaced with a desperate situation, what course of action will you choose?… Expand"}, {"name": "Dark Void Zero", "details_link": "https://www.metacritic.com/game/ds/dark-void-zero", "publisher": "Capcom", "release_date": "Jan 18 2010", "developers": ["Other Ocean Interactive"], "platforms": ["iPhone/iPad", "PC", "DS"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 84, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/d2bd88b15e1514a61ec7b10f78111ed9-98.jpg", "descriptions": "[DSiWare]  As the '80s were drawing to a close, the developers at Capcom began work on a top-secret project that aimed to set new standards for the platformer genre. That game was called Dark Void. Alas, Capcom suspended development on Dark Void as it began to evaluate the SNES. Before long,[DSiWare]  As the '80s were drawing to a close, the developers at Capcom began work on a top-secret project that aimed to set new standards for the platformer genre. That game was called Dark Void. Alas, Capcom suspended development on Dark Void as it began to evaluate the SNES. Before long, the game was shelved and drifted, unnoticed, into the annals of gaming history. Dark Void became a legendary \"lost project\" at Capcom. Now, nearly 20 years later, Dark Void is back! To commemorate the game's humble origins, Capcom has commissioned this recreation of the original 8-bit classic, now re-titled Dark Void Zero, on the Nintendo DSi system. You play as Rusty, the first human born in the Void, who must take on the Watchers in a quest to stop their domination of Earth. With the aid of Nikola Tesla and his state-of-the-art rocket pack, Rusty must take down the Watchers and their minions across three intense levels of action and intrigue. [Nintendo]… Expand"}, {"name": "Etrian Odyssey IV: Legends of the Titan", "details_link": "https://www.metacritic.com/game/3ds/etrian-odyssey-iv-legends-of-the-titan", "publisher": "Atlus", "release_date": "Feb 26 2013", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "First-Person", "General", "Western-Style"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/a3b9086fcf903bffc5ac851a606a921e-98.jpg", "descriptions": "Etrian Odyssey IV: Legends of the Titan has players board their skyship and set out into the clouds in search of treasure, glory, and the answer to Tharsis' oldest mystery."}, {"name": "Final Fantasy IX", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-ix", "publisher": "Square Enix", "release_date": "Apr 14 2016", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 84, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/1/96322dc81ab0cff554cea5246b7a46f4-98.jpg", "descriptions": "The last Final Fantasy for the PlayStation, Final Fantasy IX returns to the pure fantasy roots that spawned the series.  This latest installment features highly detailed characters, vehicles, and environments, and breathtaking cinema-graphics.  The addition of brand new features such as theThe last Final Fantasy for the PlayStation, Final Fantasy IX returns to the pure fantasy roots that spawned the series.  This latest installment features highly detailed characters, vehicles, and environments, and breathtaking cinema-graphics.  The addition of brand new features such as the story-enhancing Active Time Event system and the return of minigames that grant additional gameplay make Final Fantasy IX not only a memorable gaming experience, but also a significant step forward in the series.… Expand"}, {"name": "Resident Evil Village", "details_link": "https://www.metacritic.com/game/playstation-5/resident-evil-village", "publisher": "Capcom", "release_date": "May  7 2021", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/0bfeb6536401efce8d403ffde5b903cb-98.jpg", "descriptions": "The next generation of survival horror rises in the form of Resident Evil Village, the eighth major entry in the Resident Evil series. With ultra-realistic graphics powered by the RE Engine, fight for survival as danger lurks around every corner. Years after the tragic events of ResidentThe next generation of survival horror rises in the form of Resident Evil Village, the eighth major entry in the Resident Evil series. With ultra-realistic graphics powered by the RE Engine, fight for survival as danger lurks around every corner. Years after the tragic events of Resident Evil 7 biohazard, Ethan Winters has started over with his wife Mia, finally living in peace and putting the past behind them. However, Chris Redfield, the legendary hero from previous Resident Evil games, suddenly disrupts their life, throwing a devastated Ethan into a new and twisted nightmare in search of answers.… Expand"}, {"name": "DJ Hero", "details_link": "https://www.metacritic.com/game/xbox-360/dj-hero", "publisher": "Activision", "release_date": "Oct 27 2009", "developers": ["FreeStyleGames"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/52966fb5e6c6273b2b9356c280ac15ab-98.jpg", "descriptions": "DJ Hero drops the needle with a completely fresh experience and legendary artists including Black Eyed Peas, 50 Cent, Justice, Marvin Gaye, Beck, Beastie Boys and N.E.R.D. DJ Hero features more than 100 individual songs that have been transformed into more than 80 exclusive, original mixesDJ Hero drops the needle with a completely fresh experience and legendary artists including Black Eyed Peas, 50 Cent, Justice, Marvin Gaye, Beck, Beastie Boys and N.E.R.D. DJ Hero features more than 100 individual songs that have been transformed into more than 80 exclusive, original mixes by superstar DJs including DJ Shadow, DJ Z-Trip, DJ AM, and the legendary Grandmaster Flash. With an innovative, new turntable controller and the hottest music collection of original music, DJ Hero is a unique new social music gaming experience that excite the millions of dance club music fans who can now play along to hit songs from a range of genres including hip-hop, R&B, pop, rock and electronica allowing them to rule the party with original mixes. Joining the internationally acclaimed DJ, producer and recording artist DJ Shadow, who has been consulting and contributed several mixes for DJ Hero, and making their video game debuts, DJ Z-Trip, a founder of the mashup movement who’s known worldwide for his sold out shows and eclectic style, and DJ AM, one of the world’s premier and most in-demand DJs today, appear as in-game characters and have each created multiple exclusive mixes for DJ Hero. In DJ Hero, faces in the crowd are transformed into the life of the party as the game’s turntable controller - created exclusively for DJ Hero and featuring familiar DJ tools including a fully-rotating turntable, sample buttons, effects dial and cross fader - immerses fans into the authenticity of DJ culture and a sea of music. By utilizing and mastering various DJ techniques including scratching, blending, cross fading and sampling, while leaving room for creative expression with a variety of effects and player chosen samples and scratches, gamers rule the party performing music as only a DJ can. Social expression is heightened with euphoric multiplayer gameplay where two DJs can battle competitively or have a player join in to emcee over any track in the game with a mic. Additionally, gamers can rock together as DJ Hero features DJ-guitar exclusive mixes played with a turntable controller and Guitar Hero guitar controller. [Activision]… Expand"}, {"name": "Black Mesa", "details_link": "https://www.metacritic.com/game/pc/black-mesa", "publisher": "Black Mesa Modification Team", "release_date": "Sep 14 2012", "developers": ["Black Mesa Modification Team"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 84, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/4/f267134559cd6dba2deedc22433284b3-98.jpg", "descriptions": "Black Mesa is a re-envisioning of Valve Software's seminal game Half-Life. You will re-visit the inaugural role of Gordon Freeman and his memorable journey through the Black Mesa Research Facility. Expect detailed environments to explore, a huge cast of characters and experimental weaponry.Black Mesa is a re-envisioning of Valve Software's seminal game Half-Life. You will re-visit the inaugural role of Gordon Freeman and his memorable journey through the Black Mesa Research Facility. Expect detailed environments to explore, a huge cast of characters and experimental weaponry. All-new music, voice acting, choreography and added dialogue give way to a more expansive and immersive experience than ever before. [Valve]… Expand"}, {"name": "Rise of Nations: Rise of Legends", "details_link": "https://www.metacritic.com/game/pc/rise-of-nations-rise-of-legends", "publisher": "Microsoft Game Studios", "release_date": "May  9 2006", "developers": ["Big Huge Games"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/9386f4affe9ba712fe526fe92c64bacc-98.jpg", "descriptions": "Rise of Nations: Rise of Legends evolves the franchise's trademark features such as borders, large-scale battles and city-building in innovative ways. Players are able to transform small villages into powerful civilizations and lead vast fantasy armies into strategic battles usingRise of Nations: Rise of Legends evolves the franchise's trademark features such as borders, large-scale battles and city-building in innovative ways. Players are able to transform small villages into powerful civilizations and lead vast fantasy armies into strategic battles using formations, unit control and heroic abilities to destroy the enemy. The popular Conquer the World (CTW) Campaign returns in Rise of Nations: Rise of Legends with exciting updates. The new CTW Campaign guides players through a new world of heroes, monsters, loyalty and betrayal. Gamers follow a story through multiple campaigns with fascinating subplots and heroic characters. The campaigns immerse players in an ever-changing three-dimensional world with terrain and cities that evolve as civilizations grow. [Microsoft]… Expand"}, {"name": "Bulletstorm", "details_link": "https://www.metacritic.com/game/xbox-360/bulletstorm", "publisher": "Electronic Arts", "release_date": "Feb 22 2011", "developers": ["Epic Games", "People Can Fly"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/02963bbb1e8d1b8acf68c8ebc2968327-98.jpg", "descriptions": "Bulletstorm's array of distinct skillshots produces unprecedented levels of frantic gameplay. The skillshot system rewards players for laying waste to enemies in the most imaginative way possible. The more insane the skillshot, the more points players collect to upgrade and unlock weapons,Bulletstorm's array of distinct skillshots produces unprecedented levels of frantic gameplay. The skillshot system rewards players for laying waste to enemies in the most imaginative way possible. The more insane the skillshot, the more points players collect to upgrade and unlock weapons, which in turn allows them to execute even more inventive moves and exaggerated skillshots. … Expand"}, {"name": "Tony Hawk's American Sk8land", "details_link": "https://www.metacritic.com/game/ds/tony-hawks-american-sk8land", "publisher": "Activision", "release_date": "Nov 16 2005", "developers": ["Vicarious Visions"], "platforms": "DS", "num_players": "2  Online", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/131c96590e384dd189dbacae1973e270-98.jpg", "descriptions": "No levels. No load times. Just never-ending action that doesn't stop until you leave the game. Tony Hawk's American Wasteland gives you - for the first time ever in a Hawk game - the freedom to skate, or bike, throughout a rich, expansive open environment. Once you arrive in Los Angeles, theNo levels. No load times. Just never-ending action that doesn't stop until you leave the game. Tony Hawk's American Wasteland gives you - for the first time ever in a Hawk game - the freedom to skate, or bike, throughout a rich, expansive open environment. Once you arrive in Los Angeles, the vast city that gave birth to skate culture, the sky's the limit as you progress through the Wasteland story and choose missions that will have you immersed in the action without ever skating the same line twice. New on the board tricks include the Bert slides, Natas spins handstands, and one-footed grinds and manuals. New off the board tricks include wall runs, wall flips, and charged jumps. Choose Board Or Bike: For the first time, you can choose to ride BMX bikes throughout the entire game, with all-new physics, a BMX specific control system and several BMX-specific goals. Customize Like Crazy: Enter and explore dozens of shops in game to customize your gear and your look! Check out skate shops, barbershops, tattoo parlors, and clothing stores as you accomplish goals and earn cash. [Activision]… Expand"}, {"name": "TOCA Race Driver 3", "details_link": "https://www.metacritic.com/game/pc/toca-race-driver-3", "publisher": "Codemasters", "release_date": "Feb 22 2006", "developers": ["Codemasters"], "platforms": ["PlayStation 2", "PC"], "num_players": "12  Online", "genres": ["Driving", "Racing", "Simulation", "General", "General", "GT / Street", "Automobile"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/a7462237ba1b67f21f1209b932b5f7fb-98.jpg", "descriptions": "(Also known as \"ToCA Race Driver 2006\") TOCA Race Driver 3 takes the variety of motorsport experiences available in \"Race Driver 2\" and expanding on it even further, so no matter what your taste in racing, you'll find something to suit you. Featuring the British GT championship, series(Also known as \"ToCA Race Driver 2006\") TOCA Race Driver 3 takes the variety of motorsport experiences available in \"Race Driver 2\" and expanding on it even further, so no matter what your taste in racing, you'll find something to suit you. Featuring the British GT championship, series stalwarts the DTM and Aussie V8 Supercars, Sprint Cars, Rallying, and open wheel racing all the way from karts to the BMW Williams Grand Prix Cars, and much more TOCA Race Driver 2006 has something for everyone. Race on tracks from all over the world, take the story-driven \"world tour\" mode if you want to get straight to where the action is, or for the people wanting the nuts and bolts, take the \"Pro Career\" mode and work you way up the ladder in different disciplines of motorsport, aiming for the pinnacle of your chosen field. [Codemasters]… Expand"}, {"name": "FRU", "details_link": "https://www.metacritic.com/game/xbox-one/fru", "publisher": "Through Games", "release_date": "Jul 13 2016", "developers": ["Through Games"], "platforms": "Xbox One", "genres": ["Miscellaneous", "Puzzle", "Action"], "meta_score": 84, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/8bab2a4ef6bb2e1c4088cdbe00c757a2-98.jpg", "descriptions": "FRU is a puzzle platformer featuring an innovative use of Kinect, in which your silhouette becomes a \"portal\" between two worlds. You find yourself solving puzzles by strategically positioning your body, combining physical interaction with traditional platforming. Every level can be solvedFRU is a puzzle platformer featuring an innovative use of Kinect, in which your silhouette becomes a \"portal\" between two worlds. You find yourself solving puzzles by strategically positioning your body, combining physical interaction with traditional platforming. Every level can be solved in multiple ways, with different poses. [Xbox.com]… Expand"}, {"name": "FTL: Faster Than Light", "details_link": "https://www.metacritic.com/game/pc/ftl-faster-than-light", "publisher": "Subset Games", "release_date": "Sep 14 2012", "developers": ["Subset Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Real-Time", "Sci-Fi", "Space", "Small Spaceship", "General", "Small Spaceship", "Combat"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/fe3343b4c61c0d8a900c0382e38264f0-98.jpg", "descriptions": "You manage the Kestrel and its crew as you explore the galaxy. Strategic, real-time combat involves managing power between essential systems and choosing which enemy systems to target. Meanwhile, you control your crew to keep the ship functioning and fight off intruders. The combat isYou manage the Kestrel and its crew as you explore the galaxy. Strategic, real-time combat involves managing power between essential systems and choosing which enemy systems to target. Meanwhile, you control your crew to keep the ship functioning and fight off intruders. The combat is difficult but, being a \"roguelike-like\" game, frequent permadeath is at the core of the experience.\r While exploring the galaxy you will encounter a variety of situations requiring decision making that can result in many outcomes. Since all events are randomly generated, each play-through will be significantly different.… Expand"}, {"name": "Madden NFL 07", "details_link": "https://www.metacritic.com/game/playstation-2/madden-nfl-07", "publisher": "EA Sports", "release_date": "Aug 22 2006", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/3ad7ba8551a597a070a91756f38fb74d-98.jpg", "descriptions": "With the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback andWith the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback and smash through, overpower, or slash away from would-be tacklers as you fight for every yard. Innovative rushing controls give you a game-breaking ground attack featuring all-new jukes, cutbacks, and the distinct running styles of your favorite backs. [Electronic Arts]… Expand"}, {"name": "Fallout: New Vegas", "details_link": "https://www.metacritic.com/game/xbox-360/fallout-new-vegas", "publisher": "Bethesda Softworks", "release_date": "Oct 19 2010", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "First-Person", "First-Person", "Western-Style"], "meta_score": 84, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/6dadbfe6a18c9258d0091a0f9e060e58-98.jpg", "descriptions": "The latest game in the post-nuclear RPG series is being developed by many members of the Fallout 1 and 2  team at Obsidian Entertainment using the Fallout 3 engine."}, {"name": "Dragon Quest V: Hand of the Heavenly Bride", "details_link": "https://www.metacritic.com/game/ds/dragon-quest-v-hand-of-the-heavenly-bride", "publisher": "Square Enix", "release_date": "Feb 16 2009", "developers": ["ArtePiazza"], "platforms": ["iPhone/iPad", "DS"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/2dd4284eae43d8c50ea32b1083b3d640-98.jpg", "descriptions": "This entry in the Zenithia Trilogy follows a journey that transcends three generations. Travel alongside your father on his quest to see the world, grow to set forth on a journey of your own and face life-altering decisions as you continue your family’s legacy. [Square Enix]"}, {"name": "FIFA Soccer 09", "details_link": "https://www.metacritic.com/game/psp/fifa-soccer-09", "publisher": "EA Sports", "release_date": "Oct 13 2008", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/bed2ff4ab18969cfff6ec8b08ccb9db7-98.jpg", "descriptions": "Hundreds of new animation sequences and a new collision detection system with 360 degree coverage enable players to behave according to their physical attributes. Player speed, direction and strength now determine everything from the severity of the collision to the outcome of possession.Hundreds of new animation sequences and a new collision detection system with 360 degree coverage enable players to behave according to their physical attributes. Player speed, direction and strength now determine everything from the severity of the collision to the outcome of possession. Plus, contact occurs with shoulders, arms and legs. Stronger players possess the strength to knock down smaller players or use their body and arms to shield the ball in challenges. Changes to the animation system reward the skillful gamer during one-on-one situations between attackers and defenders. Tuned acceleration attributes enable swifter players to possess quicker first steps and gain advantage in sprints. Plus, four new skill moves -- scoop turns, rainbow flicks, heel-to-heel knocks and ball rolls – give you a total of 32 tricks in your arsenal to perform just like Ronaldinho. From the moment you step onto the pitch, FIFA 09 challenges you to think and react like a real football player through the popular feature innovation Be A Pro -- now expanded to multiple seasons and featuring the unique Be A Pro camera that tracks your player, re-creating the excitement and rush of racing in on goal. In Be A Pro: Seasons you choose a professional player and then develop his skills at a single outfield position. Complete individual challenges to develop your player attributes and win glory for the squad. Enjoy top football action at your own level of ability with new Smart Play controls. Passionate football fans new to gaming can play like a professional, controlling only the shooting and passing using a two-button control system and gradually mastering all of the controls as they become adept. With new smart play controls and an assist from the AI, gamers can learn at their own pace and still play entertaining matches with more advanced players. [Electronic Arts]… Expand"}, {"name": "Xenoblade Chronicles X", "details_link": "https://www.metacritic.com/game/wii-u/xenoblade-chronicles-x", "publisher": "Nintendo", "release_date": "Dec  4 2015", "developers": ["Monolith Soft"], "platforms": "Wii U", "num_players": "Up to 32 ", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/7/d0e4dc971eb28ad44da142895b0928b6-98.jpg", "descriptions": "Fight for survival while exploring the vast expanses of an unknown planet where anything you see is reachable in your weaponized mech, called a Skell. Customize a lethal skill set of combat and defensive skills, called Arts, to strengthen your strategies and defeat enemies efficiently.Fight for survival while exploring the vast expanses of an unknown planet where anything you see is reachable in your weaponized mech, called a Skell. Customize a lethal skill set of combat and defensive skills, called Arts, to strengthen your strategies and defeat enemies efficiently. Attack your enemies from multiple directions using melee weapons, guns, and your greatest asset—your tactical mind.… Expand"}, {"name": "Ace Combat 5: The Unsung War", "details_link": "https://www.metacritic.com/game/playstation-2/ace-combat-5-the-unsung-war", "publisher": "Namco", "release_date": "Oct 25 2004", "developers": ["Namco"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 84, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/7/47cb56e10ebebbc4de344daa058062f0-98.jpg", "descriptions": "(Also known as \"Ace Combat 5: Squadron Leader\")  With more than 50 different licensed planes and an intense storyline extending over 30 missions, players will be put to the ultimate test, including air-to-air combat, air-to-ground fighting, air-to-sea assaults, rescue, recon and much more.(Also known as \"Ace Combat 5: Squadron Leader\")  With more than 50 different licensed planes and an intense storyline extending over 30 missions, players will be put to the ultimate test, including air-to-air combat, air-to-ground fighting, air-to-sea assaults, rescue, recon and much more. Incorporating ultra-realistic beautifully rendered in-game graphics and cinematics along with unparalleled game play; ACE COMBAT 5 goes a step beyond the traditional air combat gaming experience. One of the exciting new features to the sequel includes Wingman Command, where players can issue directives to their wingmen mid-mission to carry out coordinated group attacks. Additionally, the in-game radio communications with the squadron and enemies adds to the realism and intensity of the dynamic battle sequences. In the game's premise, it is September 23, 2010 on distant Sand Island, a small island in the Ceres Ocean that divides the two superpowers, Osea and Yuktobania. An entire military base is on red alert--the 108th Tactical Fighter Squadron intercepted an unidentified aircraft and the entire squadron was decimated. You are a fighter pilot, part of the new squadron that's been called into action to protect your nation of Osea. Now, the story begins to unfold. [Namco]… Expand"}, {"name": "X-Men Legends II: Rise of Apocalypse", "details_link": "https://www.metacritic.com/game/xbox/x-men-legends-ii-rise-of-apocalypse", "publisher": "Activision", "release_date": "Sep 20 2005", "developers": ["Raven Software"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/dba22f2b40d223b8a289019575eb72f2-98.jpg", "descriptions": "In X-Men Legends II, the X-Men must join their enemy the Brotherhood to fight a greater menace--Apocalypse. The sequel to the team-based role-playing game X-Men Legends lets you play as one of many X-Men, and use and combine his or her unique abilities to defeat enemies. Rise of ApocalypseIn X-Men Legends II, the X-Men must join their enemy the Brotherhood to fight a greater menace--Apocalypse. The sequel to the team-based role-playing game X-Men Legends lets you play as one of many X-Men, and use and combine his or her unique abilities to defeat enemies. Rise of Apocalypse includes new mutant powers, playable characters, and environments. Also new to X-Men Legends II is online play, which lets you work cooperatively against other teams of mutants.… Expand"}, {"name": "Guacamelee! 2", "details_link": "https://www.metacritic.com/game/pc/guacamelee!-2", "publisher": "DrinkBox Studios", "release_date": "Aug 21 2018", "developers": ["DrinkBox Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/b313079e91ef55f94ff4bd44e20e04fa-98.jpg", "descriptions": "Head back to the Mexiverse in this sequel to Guacamelee! Uppercut your way to victory across stunning new hand-crafted levels. Featuring full 4-player co-op, fancy new wrestling moves, sassy new bosses, twice the enemies, and 300% more chickens."}, {"name": "Resogun", "details_link": "https://www.metacritic.com/game/playstation-4/resogun", "publisher": "SCEA", "release_date": "Nov 15 2013", "developers": ["Housemarque", "XDEV"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Shooter", "Scrolling", "Action", "Shooter", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/91be305a2aea6d9beadcbec578ea290a-98.jpg", "descriptions": "RESOGUN is a visceral fast-paced shoot em' up developed exclusively for the PS4 system. Unleash a varied array of devastating weapons including lasers, missiles, overdrive, and nova-bombs to blast hordes of enemies and rescue the last survivors from distant galactic colonies that are underRESOGUN is a visceral fast-paced shoot em' up developed exclusively for the PS4 system. Unleash a varied array of devastating weapons including lasers, missiles, overdrive, and nova-bombs to blast hordes of enemies and rescue the last survivors from distant galactic colonies that are under ruthless attack from an evil alien invasion force.… Expand"}, {"name": "SOMA", "details_link": "https://www.metacritic.com/game/pc/soma", "publisher": "Frictional Games", "release_date": "Sep 21 2015", "developers": ["Frictional Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Horror", "Action Adventure", "Survival"], "meta_score": 84, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/05d59885cdd8da921ed60ba5884ac1bf-98.jpg", "descriptions": "Strange occurrences are disrupting the routines of the PATHOS-2 research facility. The radio is silent. Behavioral anomalies of the machines are increasingly dangerous, if not... malevolent. The facility is devolving into chaos. No weapons, and the only escape is practically unthinkable.Strange occurrences are disrupting the routines of the PATHOS-2 research facility. The radio is silent. Behavioral anomalies of the machines are increasingly dangerous, if not... malevolent. The facility is devolving into chaos. No weapons, and the only escape is practically unthinkable. From Frictional Games, creators of the Amnesia and Penumbra series, SOMA is an aberrant tale of scientific inquiry and survival; an entropic exploration of synapse and circuit that wades through the delusions of human consciousness.… Expand"}, {"name": "DEFCON: Everybody Dies", "details_link": "https://www.metacritic.com/game/pc/defcon-everybody-dies", "publisher": "Encore Software, Inc.", "release_date": "Sep 29 2006", "developers": ["Introversion"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/8c98a177f7fbfe469b1f94c9362437a5-98.jpg", "descriptions": "Inspired by the 1983 cult classic film, \"Wargames,\" DEFCON superbly evokes the tension, paranoia and suspicion of the Cold War era, playing on the fascinating aspects of psychological gameplay that occur during strategic nuclear warfare. You play a General hidden deep within an undergroundInspired by the 1983 cult classic film, \"Wargames,\" DEFCON superbly evokes the tension, paranoia and suspicion of the Cold War era, playing on the fascinating aspects of psychological gameplay that occur during strategic nuclear warfare. You play a General hidden deep within an underground bunker. Your mission is to successfully exterminate your enemy's civilian population whilst saving your own. Points are awarded or lost depending on both the efficacy and thoroughness of your nuclear vendetta and the number of your own civilian deaths. In order to win you must wipe out the enemy population and simultaneously disable the enemy's ability to retaliate against you. This is an extremely difficult task since launching an attack on the enemy exposes the positions of your own Ground Silos, Subs and Bombers the moment they launch nuclear weapons, making you extremely vulnerable and exposed to a crushing counter-attack. Desperate attempts must be made to form fast, tactical alliances, alliances that may at any moment break-down to become the treacherous and most deadly of betrayals. Everyone looks to each other in a state of nervous suspense and paranoid accusation. In all-out nuclear Armageddon, everybody dies, everybody loses, you just have to make sure you lose the least! [Valve]… Expand"}, {"name": "Atelier Ryza: Ever Darkness & the Secret Hideout", "details_link": "https://www.metacritic.com/game/switch/atelier-ryza-ever-darkness-the-secret-hideout", "publisher": "Koei Tecmo Games", "release_date": "Oct 29 2019", "developers": ["Gust"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Japanese-Style"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/243a387448a04ea4cd132115ee912976-98.jpg", "descriptions": "Even though everyone has them,\rthe memories we create with our friends are\rspecial to each and every one of us. The story of \"Atelier Ryza\" is\rabout a girl and her friends on the\rverge of adulthood,\rdiscovering what is most important to them."}, {"name": "Tom Clancy's The Division 2", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-the-division-2", "publisher": "Ubisoft", "release_date": "Mar 15 2019", "developers": ["Massive Entertainment"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "Up to 16 ", "genres": ["First-Person", "Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 84, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/9/0d317b393d42441586993cd01e7849b8-98.jpg", "descriptions": "Set in Washington D.C., the game takes place 7 months after a deadly virus was released in New York City and the nation has become a shell of its former self. While the virus has been contained, its effects are most evident in the devastated streets of the nation's capital where survivorsSet in Washington D.C., the game takes place 7 months after a deadly virus was released in New York City and the nation has become a shell of its former self. While the virus has been contained, its effects are most evident in the devastated streets of the nation's capital where survivors cling to hope and struggle to rebuild. Enter The Division, a unit of civilian sleeper agents who now must work to stop enemy factions from completely taking over the city – and ultimately, the nation. As a universally-regarded seat of power, if D.C. falls, the nation falls. With civilians helpless and fearing for their lives, players will be the last line of defense in preventing the total collapse of society. [Ubisoft]… Expand"}, {"name": "Pinball FX 2: Marvel Pinball - Vengeance and Virtue", "details_link": "https://www.metacritic.com/game/xbox-360/pinball-fx-2-marvel-pinball---vengeance-and-virtue", "publisher": "Zen Studios", "release_date": "Dec 13 2011", "developers": ["Zen Studios"], "platforms": ["PC", "Xbox 360"], "genres": ["Pinball", "Action", "Miscellaneous", "Parlor", "Pinball"], "meta_score": 84, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/c32dc8b536eb8c092e7235b10439cf80-98.jpg", "descriptions": "Vengeance and Virtue contains four new tables for Marvel Pinball."}, {"name": "James Bond 007: Everything or Nothing", "details_link": "https://www.metacritic.com/game/gamecube/james-bond-007-everything-or-nothing", "publisher": "EA Games", "release_date": "Feb 17 2004", "developers": ["EA Redwood Shores"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/b1e5ab2be46e493f5358ea61a66c46d9-98.jpg", "descriptions": "Think like Bond, act like Bond, and experience an entirely new Bond adventure.  James Bond, the world's greatest secret agent, returns in Everything or Nothing with new guns and gadgets, combat skills, and clever tricks--and it's up to you to put them to good use.  Travel through fourThink like Bond, act like Bond, and experience an entirely new Bond adventure.  James Bond, the world's greatest secret agent, returns in Everything or Nothing with new guns and gadgets, combat skills, and clever tricks--and it's up to you to put them to good use.  Travel through four exciting continents including the Valley of the Kings in Egypt and the French Quarter in New Orleans.  The game also features two-player co-op missions and four-player multiplayer arena modes.  … Expand"}, {"name": "NASCAR: Dirt to Daytona", "details_link": "https://www.metacritic.com/game/playstation-2/nascar-dirt-to-daytona", "publisher": "Atari", "release_date": "Nov 11 2002", "developers": ["Monster Games Inc."], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 84, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/d7eaed3f55627c1a0d5f4d6fcbc0725f-98.jpg", "descriptions": "Dirt to Daytona challenges players in the ultimate NASCAR Career Mode. The only game to include 4 different NASCAR racing series. Racing to win is the key for drivers hoping to advance from small town dirt tracks to modified cars, to trucks and eventually the highly prized NASCAR Winston CupDirt to Daytona challenges players in the ultimate NASCAR Career Mode. The only game to include 4 different NASCAR racing series. Racing to win is the key for drivers hoping to advance from small town dirt tracks to modified cars, to trucks and eventually the highly prized NASCAR Winston Cup cars. Learn the harsh realities of the racing world where losing can cost drivers not only points in the standings but loss of money from a sponsor. Dirt to DAYTONA also features Single Races, Season Championships, Beat the Heat, and Pro Trainer modes for all 4 authentic NASCAR racing series. [Infogrames]… Expand"}, {"name": "NASCAR Thunder 2003", "details_link": "https://www.metacritic.com/game/playstation-2/nascar-thunder-2003", "publisher": "EA Sports", "release_date": "Sep 29 2002", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 84, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/5dd0bfb3f8eb6fa5aab2f7cc7004c8c1-98.jpg", "descriptions": "NASCAR Thunder 2003 features an all-new game engine with more realistic vehicle dynamics, including tire grip and wear patterns, handling and suspension behavior, and collision physics; fun entry-level control with progression to deeper \"simulation.\" The Career mode now includes 20NASCAR Thunder 2003 features an all-new game engine with more realistic vehicle dynamics, including tire grip and wear patterns, handling and suspension behavior, and collision physics; fun entry-level control with progression to deeper \"simulation.\" The Career mode now includes 20 successive seasons in which you will need to manage four major components while building a racing car. Compete for top sponsors, the best crewmembers, and the latest racing technology. [EA Sports]… Expand"}, {"name": "Puyo Pop", "details_link": "https://www.metacritic.com/game/game-boy-advance/puyo-pop", "publisher": "THQ", "release_date": "Feb 11 2002", "developers": ["Sonic Team"], "platforms": "Game Boy Advance", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/79a8183d99fb994fd01e1a851254d217-98.jpg", "descriptions": "Help Arle and Carbuncle make their way home! Take on all of the wacky characters you meet in challenging games of Puyo Pop so you can make your way through the land and back to safety. It's a mad scramble to erase Puyo, create chain combos, and fill up your opponent's playfield in thisHelp Arle and Carbuncle make their way home! Take on all of the wacky characters you meet in challenging games of Puyo Pop so you can make your way through the land and back to safety. It's a mad scramble to erase Puyo, create chain combos, and fill up your opponent's playfield in this fast-paced puzzle game.… Expand"}, {"name": "Rayman Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/rayman-advance", "publisher": "Ubisoft", "release_date": "Jun 10 2001", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/f9c32a5319e128bb03cb3834d19988f3-98.jpg", "descriptions": "It's a great platformer and one among many games in the Game Boy Advance launch lineup that's easy to recommend."}, {"name": "Need for Speed: Shift", "details_link": "https://www.metacritic.com/game/playstation-3/need-for-speed-shift", "publisher": "EA Games", "release_date": "Sep 15 2009", "developers": ["Slightly Mad Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 84, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/9a6247cfad10b017f5454bc1e6b88491-98.jpg", "descriptions": "Need for Speed SHIFT brings a true driver's experience to some of the world's most iconic racing tracks, including the storied Brand's Hatch in the UK. The game also features the largest roster of high-performance cars in Need for Speed history including race cars such as the Pagani Zonda F,Need for Speed SHIFT brings a true driver's experience to some of the world's most iconic racing tracks, including the storied Brand's Hatch in the UK. The game also features the largest roster of high-performance cars in Need for Speed history including race cars such as the Pagani Zonda F, Porsche 911 GT2 and Lotus Elise. Players are thrust into the loud, intense, and athletic experience of racing a car from the driver's perspective through the combination of perception based G-forces, the hyper reality of the cockpit view, and the all-new brutally disorienting crash dynamic. Need for Speed SHIFT features an accurate, accessible physics-based driving model that allows you to feel every impact, every change of track surface and every last bit of grip as you push yourself to the edge. [Electronic Arts]… Expand"}, {"name": "Saints Row: The Third", "details_link": "https://www.metacritic.com/game/xbox-360/saints-row-the-third", "publisher": "THQ", "release_date": "Nov 15 2011", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/28f6fe1518462e873d274a202d9e44df-98.jpg", "descriptions": "Years after taking Stilwater for their own, the Third Street Saints have evolved from street gang to household brand name, with Saints sneakers, Saints energy drinks and Johnny Gat bobble head dolls all available at a store near you. The Saints are kings of Stilwater, but their celebrityYears after taking Stilwater for their own, the Third Street Saints have evolved from street gang to household brand name, with Saints sneakers, Saints energy drinks and Johnny Gat bobble head dolls all available at a store near you. The Saints are kings of Stilwater, but their celebrity status has not gone unnoticed. The Syndicate, a legendary criminal fraternity with pawns in play all over the globe, has turned its eye on the Saints and demands tribute. Refusing to kneel to the Syndicate, you take the fight to a new city, playing out the most outlandish gameplay scenarios ever seen. Strap it on. … Expand"}, {"name": "Gran Turismo 5", "details_link": "https://www.metacritic.com/game/playstation-3/gran-turismo-5", "publisher": "SCEA", "release_date": "Nov 24 2010", "developers": ["Polyphony Digital"], "platforms": "PlayStation 3", "num_players": "Up to 6 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/5c714d40d3a83afd1b9919ecbd066d22-98.jpg", "descriptions": "Known for its signature beauty and precision, the highly anticipated racer showcases new jaw-dropping cars, real-life tracks, and diverse racing styles. Gran Turismo promises to deliver exciting advancements to the series in the most comprehensive racing experience ever. [Sony]"}, {"name": "Thimbleweed Park", "details_link": "https://www.metacritic.com/game/xbox-one/thimbleweed-park", "publisher": "Terrible Toybox", "release_date": "Mar 30 2017", "developers": ["Ron Gilbert and Gary Winnick"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/93ab4295a99d3e439c349e4132bc10ff-98.jpg", "descriptions": "Thimbleweed Park is a 2D point & click adventure game that cuts to the core of what made the classic games so special, and done by the actual people who spawned the genre. Lost along a dusty stretch of highway, the town of Thimbleweed Park once boasted an opulent hotel, a vibrant businessThimbleweed Park is a 2D point & click adventure game that cuts to the core of what made the classic games so special, and done by the actual people who spawned the genre. Lost along a dusty stretch of highway, the town of Thimbleweed Park once boasted an opulent hotel, a vibrant business district and the state’s largest pillow factory, but now it teeters on the edge of oblivion and continues to exist for no real reason. It’s a town that makes you itch and your skin crawl. It’s a place no one ever looks for, but everyone seems to find. Thimbleweed Park is the curious story of two washed up detectives investigating a dead body found in the river just outside of town. It’s a game where you switch between five playable characters while uncovering the dark, satirical and bizarre world of Thimbleweed Park.… Expand"}, {"name": "Tron 2.0", "details_link": "https://www.metacritic.com/game/pc/tron-20", "publisher": "Buena Vista Interactive", "release_date": "Aug 26 2003", "developers": ["Monolith Productions"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "General", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/4b6190a6120dacd598283b83ae9b787d-98.jpg", "descriptions": "TRON 2.0 is the present-day sequel to the 1982 cult film classic that wasa landmark of computerized graphical ingenuity. TRON 2.0, is a story-driven, first-person action game that propels the player into an alternate universe inside a computer. As Jet Bradley (son of the original films heroTRON 2.0 is the present-day sequel to the 1982 cult film classic that wasa landmark of computerized graphical ingenuity. TRON 2.0, is a story-driven, first-person action game that propels the player into an alternate universe inside a computer. As Jet Bradley (son of the original films hero Alan Bradley) you will combat digital opponents using guns, rods, grenades, missiles, and the iconic TRON disc. Combining the best of the genre with a truly innovative look and breakthrough game play, TRON 2.0 delivers an adventure unlike any other. It will take PC gaming to a new level with intense action, intense and deadly battles, and high-speed light cycle races. [Disney]… Expand"}, {"name": "Metro Redux", "details_link": "https://www.metacritic.com/game/xbox-one/metro-redux", "publisher": "Deep Silver", "release_date": "Aug 26 2014", "developers": ["4A Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "First-Person", "Sci-Fi"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/3c811a9dba47e7d5dc7d68f939ad98c2-98.jpg", "descriptions": "Metro Redux includes Metro 2033 and Metro: Last Light, rebuilt and remastered for Next Gen at 60FPS. Rebuilt and Remastered for Next Gen with 2 complete single player campaigns, all previous add-on content included, new modes and features, and many gameplay improvements, this is theMetro Redux includes Metro 2033 and Metro: Last Light, rebuilt and remastered for Next Gen at 60FPS. Rebuilt and Remastered for Next Gen with 2 complete single player campaigns, all previous add-on content included, new modes and features, and many gameplay improvements, this is the definitive version of the series.… Expand"}, {"name": "The Warriors", "details_link": "https://www.metacritic.com/game/playstation-2/the-warriors", "publisher": "Rockstar Games", "release_date": "Oct 17 2005", "developers": ["Rockstar Toronto"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 84, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/fce3df6fd877eb4da9773214509f8639-98.jpg", "descriptions": "A battle on the streets of New York. The armies of the night number 60,000 strong, and tonight they’re all after The Warriors - a street gang wrongly accused of killing a rival gang leader. The Warriors must make their way from one end of New York to their turf on the other side of the city.A battle on the streets of New York. The armies of the night number 60,000 strong, and tonight they’re all after The Warriors - a street gang wrongly accused of killing a rival gang leader. The Warriors must make their way from one end of New York to their turf on the other side of the city.  All that stands between The Warriors and their survival are 20 miles and thousands of street gang members. The army of gangs owns the streets and there’s no turning back, they must fight for their lives and learn the meaning of loyalty as danger and uncertainty emerge from the city night.  Based on the 1979 Paramount Pictures cult classic movie and developed by Rockstar Toronto, The Warriors expands the stylized cinematic journey of the film into a gritty interactive experience set in 1970s New York. [Rockstar Games]… Expand"}, {"name": "Skate 2", "details_link": "https://www.metacritic.com/game/xbox-360/skate-2", "publisher": "EA Games", "release_date": "Jan 21 2009", "developers": ["EA Black Box"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/f3a9bf9148675004508177953064d1e1-98.jpg", "descriptions": "Skate 2 picks up five years after the original Skate, a period marred by an unspeakable disaster that left San Vanelona in ruins. Within that time, Mongocorp rebuilt the city but their zealous protection of private property has put a damper on the once thriving skate population. EquippedSkate 2 picks up five years after the original Skate, a period marred by an unspeakable disaster that left San Vanelona in ruins. Within that time, Mongocorp rebuilt the city but their zealous protection of private property has put a damper on the once thriving skate population. Equipped with double the bag of tricks, gamers are tasked to rebuild their career and revive the New San Vanelona skate scene. With their ability to get off-board to move objects around and with help from a crew of locals, players embark on a mission to take back the city, one spot at a time. Along the way, they need to get coverage, earn sponsorships, own challenges and enter contests, including a coveted invite to etnies GvR competition. [Electronic Arts]… Expand"}, {"name": "NieR: Automata", "details_link": "https://www.metacritic.com/game/pc/nier-automata", "publisher": "Square Enix", "release_date": "Mar 17 2017", "developers": ["PlatinumGames"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/e7095e79117148fec0d2c1e6f2f509fe-98.jpg", "descriptions": "The distant future\r Invaders from another world attack without warning, unleashing a new type of threat: weapons known as machine lifeforms. In the face of this insurmountable threat, mankind is driven from Earth and takes refuge on the Moon.\r\n\r\nThe Council of Humanity organizes aThe distant future\r Invaders from another world attack without warning, unleashing a new type of threat: weapons known as machine lifeforms. In the face of this insurmountable threat, mankind is driven from Earth and takes refuge on the Moon.\r The Council of Humanity organizes a resistance of android soldiers in an effort to take back their planet. To break the deadlock, the Resistance deploys a new unit of android infantry: YoRHa.\r In the forsaken wasteland below, the war between the machines and the androids rages on. A war that is soon to unveil the long-forgotten truth of this world...… Expand"}, {"name": "The Walking Dead: Episode 2 - Starved for Help", "details_link": "https://www.metacritic.com/game/playstation-3/the-walking-dead-episode-2---starved-for-help", "publisher": "Telltale Games", "release_date": "Jun 29 2012", "developers": ["Telltale Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/268e824b5dbdcb897b37a4c1051ae52e-98.jpg", "descriptions": "Episode two of a five-part game series set in the same universe as Robert Kirkmans award-winning series. With starvation and bandit attacks becoming as much of a threat as the undead, the group finds themselves seeking help and food from strangers at a local dairy. \r\r- Feel what its likeEpisode two of a five-part game series set in the same universe as Robert Kirkmans award-winning series. With starvation and bandit attacks becoming as much of a threat as the undead, the group finds themselves seeking help and food from strangers at a local dairy. \r\r- Feel what its like to be a survivor, where choosing between necessities and whats right is a delicate matter.\r- Encounter human survivors who have gone down a truly horrific path.\r- Begin to see the pressures of Lillys responsibilities and get a glimpse of her tortured past as she starts to unravel as a leader.\r- Develop an understanding of what youre willing to resort to in order to ensure survival.\r- Live with the choices you made in Episode One as they continue to affect your experience in this episode.… Expand"}, {"name": "X-Men Legends II: Rise of Apocalypse", "details_link": "https://www.metacritic.com/game/psp/x-men-legends-ii-rise-of-apocalypse", "publisher": "Activision", "release_date": "Oct 18 2005", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/fe40189b1c53c325271add3c8136450e-98.jpg", "descriptions": "X-Men Legends II: Rise of Apocalypse introduces the epic storyline of an uneasy alliance between the X-Men and the hated Brotherhood in a fight to reclaim Earth from Apocalypse's grasp. Gameplay enhancements include more than double the superpowers and customization capabilities, the debutX-Men Legends II: Rise of Apocalypse introduces the epic storyline of an uneasy alliance between the X-Men and the hated Brotherhood in a fight to reclaim Earth from Apocalypse's grasp. Gameplay enhancements include more than double the superpowers and customization capabilities, the debut of several new playable characters, over 100 diverse types of enemies, and a breathtaking range of exotic and real-world environments—from the Madri Temple to Egypt. [Activision]… Expand"}, {"name": "Brothers in Arms: Earned in Blood", "details_link": "https://www.metacritic.com/game/pc/brothers-in-arms-earned-in-blood", "publisher": "Ubisoft", "release_date": "Oct  6 2005", "developers": ["Gearbox Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/39504495b4daf37b1adc32cbcce7c6d5-98.jpg", "descriptions": "Experience authentic WWII combat as Sergeant Joe Hartsock and lead your squad beyond Carentan to liberate all of Normandy. Taking online tactics to new heights, Brothers In Arms Earned In Blood offers more unique multiplayer missions and improved online support. (Including the bundledExperience authentic WWII combat as Sergeant Joe Hartsock and lead your squad beyond Carentan to liberate all of Normandy. Taking online tactics to new heights, Brothers In Arms Earned In Blood offers more unique multiplayer missions and improved online support. (Including the bundled addition of modification support for the PC). Earned In Blood features an all-new cooperative Skirmish mode that allows one or two players to take a tour of duty through a series of authentic and harrowing custom combat missions. Arm yourself with additional authentic weapons and command new vehicles like the M10 \"Wolverine\" Tank Destroyer. More Challenging and Dynamic Combat - the game features close quarter urban environments and a new, next generation artificial intelligence system. [Ubisoft]… Expand"}, {"name": "Lego Star Wars II: The Original Trilogy", "details_link": "https://www.metacritic.com/game/gamecube/lego-star-wars-ii-the-original-trilogy", "publisher": "LucasArts", "release_date": "Sep 12 2006", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "GameCube"], "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/6f672816722b4c9b905714df53c08527-98.jpg", "descriptions": "Lego Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you buildLego Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you build and battle your way through your favorite film moments. From Darth Vader's pursuit of Princess Leia aboard her Blockade Runner to Luke's final confrontation with Emperor Palpatine. For the first time ever, characters can get in and out of vehicles, as well as ride creatures. Because it's LEGO style, you can also mix and match the body parts of more than 50 playable characters to create one of millions of possible LEGO Star Wars heroes. And on PS2, Xbox and Windows platforms, a game save from the first LEGO Star Wars can unlock another 50-plus additional characters for Free Play mode -- that's more than 100 total characters. Other exciting additions include free-roaming vehicle levels, the ability to switch ships at will in Free Play mode, cool new character-specific attacks and maneuvers, playable mini-kit vehicles, an adaptive difficulty option and more.… Expand"}, {"name": "Marvel's Spider-Man: Miles Morales", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-spider-man-miles-morales", "publisher": "PlayStation Studios", "release_date": "Nov 12 2020", "developers": ["Insomniac Games"], "platforms": ["PC", "PlayStation 5", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/d454f269183d85d58c9f4dfa051c4009-98.jpg", "descriptions": "The latest adventure in the Spider-Man universe will build on and expand 'Marvel's Spider-Man' through an all-new story. Players will experience the rise of Miles Morales as he masters new powers to become his own Spider-Man."}, {"name": "Pokemon Ultra Moon", "details_link": "https://www.metacritic.com/game/3ds/pokemon-ultra-moon", "publisher": "Nintendo", "release_date": "Nov 17 2017", "developers": ["Game Freak"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/ffecf685e06923f4bd2a153fcea13d5c-98.jpg", "descriptions": "A new light shines on the Alola region.\r Take on the role of a Pokemon Trainer and uncover new tales, and unravel the mystery behind the two forms reminiscent of the Legendary Pokemon. With new story additions and features this earns Pokemon Ultra Sun and Pokemon Ultra Moon the nameA new light shines on the Alola region.\r Take on the role of a Pokemon Trainer and uncover new tales, and unravel the mystery behind the two forms reminiscent of the Legendary Pokemon. With new story additions and features this earns Pokemon Ultra Sun and Pokemon Ultra Moon the name \"Ultra!\" Another adventure is about to begin.\r New Pokemon forms have been discovered in the Aloha region in Pokemon Ultra Sun and Pokemon Ultra Moon. These forms are reminiscent of the Legendary Pokemon Solgaleo, Lunala, and Necrozma, first revealed in Pokemon Sun and Pokemon Moon. Head out on an epic journey as you solve the mystery behind these Pokemon. In this expanded adventure, get ready to explore more of the Alola region, catch more amazing Pokemon, and battle more formidable foes in Pokemon Ultra Sun and Pokemon Ultra Moon!… Expand"}, {"name": "Wylde Flowers", "details_link": "https://www.metacritic.com/game/pc/wylde-flowers", "publisher": "Studio Drydock Pty Ltd", "release_date": "Sep 20 2022", "developers": ["Studio Drydock Pty Ltd"], "platforms": ["iPhone/iPad", "Switch", "PC"], "genres": ["Simulation", "Adventure", "General", "Virtual", "Virtual Life"], "meta_score": 84, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/4fbaacc0a6400cf9c7854897b7cebb0a-98.jpg", "descriptions": "Wylde Flowers is a cozy life and farming sim with a witchy twist! Escape to a cute world of diverse folks, and magical spells, as you and the coven unravel a mystery!Play as Tara, as she arrives at a cozy rural island to help out her grandma and the family farm.\n\nExplore a wholesome worldWylde Flowers is a cozy life and farming sim with a witchy twist! Escape to a cute world of diverse folks, and magical spells, as you and the coven unravel a mystery!Play as Tara, as she arrives at a cozy rural island to help out her grandma and the family farm.Explore a wholesome world of magical realms, beautiful beaches, secretive forests and the friendly town of Fairhaven.Meet a charming cast of fully voice acted characters, with intriguing back stories to reveal. Find friendship or maybe even romance?Transform the Wylde family farm into a productive haven bursting with fresh vegetables, fruit trees and cute baby animals!Reveal the hidden darkness which is affecting the town and discover how to bring everyone together.… Expand"}, {"name": "The Darkside Detective: A Fumble in the Dark", "details_link": "https://www.metacritic.com/game/pc/the-darkside-detective-a-fumble-in-the-dark", "publisher": "Spooky Doorway", "release_date": "Apr 15 2021", "developers": ["Spooky Doorway"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "Text", "Point-and-Click"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/2ab19cb812e913c43ec7da6a8e23026d-98.jpg", "descriptions": "Delouse your room with sage and pack up your travel-sized ouija board, it’s time to re-enter Twin Lakes - America’s 34th most haunted city. Join Detective McQueen as he puzzles his way through 6 chilling cases, risking life and pixelated limb to solve the macabre mysteries that plague the Delouse your room with sage and pack up your travel-sized ouija board, it’s time to re-enter Twin Lakes - America’s 34th most haunted city. Join Detective McQueen as he puzzles his way through 6 chilling cases, risking life and pixelated limb to solve the macabre mysteries that plague the poor town. … Expand"}, {"name": "Moonlighter", "details_link": "https://www.metacritic.com/game/xbox-one/moonlighter", "publisher": "11 bit studios", "release_date": "May 29 2018", "developers": ["11 bit studios", "Digital Sun"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/23c8f259ee88db2c527af9431d11b7f5-98.jpg", "descriptions": "A set of ancient gates have been discovered near the small village of Rynoka that lead to different realms and dimensions providing brave and reckless adventurers with treasures beyond measure in this ARPG with rogue-lite elements. [Xbox.com]"}, {"name": "Danmaku Unlimited 3", "details_link": "https://www.metacritic.com/game/switch/danmaku-unlimited-3", "publisher": "Doragon Entertainment", "release_date": "Mar 13 2018", "developers": ["Doragon Entertainment"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/3bd865fae070a165f847cccfa4215976-98.jpg", "descriptions": "Inspired by classic Japanese shooting games, Danmaku Unlimited 3 is a lovingly crafted medley of the best aspects of Japanese bullet hell games, all in a polished, accessible package.\r An old school shoot'em up? Why is it worth my time?\r\nBullet hell style mechanics is having a kind ofInspired by classic Japanese shooting games, Danmaku Unlimited 3 is a lovingly crafted medley of the best aspects of Japanese bullet hell games, all in a polished, accessible package.\r An old school shoot'em up? Why is it worth my time?\rBullet hell style mechanics is having a kind of renaissance with its inclusion in many hit indie games. However if players want to explore more into the world of Bullet Hell a lot of traditional titles can be hard to understand in its mechanics or just plain too difficult to get into as a newcomer.\r Danmaku Unlimited 3 is designed to be intuitive and accessible to players unfamiliar with the genre, all the while without losing any of the intensity and flashiness that makes the genre so exciting to play.\r Okay, so how does the game do that?\rCORE A staple feature in Bullet Hells, only the very center of the player's craft, the core, is vulnerable to enemy fire.\r GRAZING Get the core close to bullets to just barely \"graze\" it will power up the player's craft. Once fully charged it can unleash a powerful rampage that makes you feel like a total boss.\r SPIRIT/GRAZE SYSTEM Shooting down enemies turns their shots into harmless ghost bullets that the player can safely touch while also powering up the plane.\r All of this allows the game to be at a level of challenge that is manageable for a wide range of players without reducing the game into a bullet free turkey shoot.\rI'm good at bullet hell shooters, won't I just breeze though the game then?\rThe game has two unique modes, GRAZE MODE features a differently tuned system (with conditions to trigger the ghost bullets) that offers a higher level of challenge comparable to the toughest traditional bullet hell titles.\rIs there a story?\rIt is about a guardian, entrusted with Earth, rebelling against her overseers. Shakespeare it isn't, but you are here for the bullets and explosions right?\rHow is the music? A Shmup is nothing without good music!\rMusic is by BLANKFIELD from Japan, who does awesome remixes of Touhou and many other anime/game musics!\rAnything else?\r - The campaign features 5 stages each ending with an epic multi-stage boss fight.\r- Up to 25 weapon combinations for players to unlock and experiment to find what works best for them.\r- Unique rendering technique that procedurally animate sprites on the fly.\r- TATE support for players that use vertical screens. Or if you like to play lying down on your sides, I'm not going to tell you how to live your life.\r Okay I'm sold! (Or not, if so then thanks for making it down to here!)\r TLDR List\r - Authentically crafted Japanese style shoot'em up in High Definition\r- Intuitively designed to be an accessible gateway to the world of Bullet Hell\r- 5 handcrafted stages packed with dynamically rendered sprites\r- Epic multi-phase boss battles with spellbinding bullet patterns\r- Up to 25 unique weapon combinations\r- Turn enemy attacks into your advantage with the SPIRIT/GRAZE system\r- Music by the talented Japanese indie circle BLANKFIELD\r  Multiple modes of difficulty that caters to players of all skill ranges… Expand"}, {"name": "Lara Croft and the Guardian of Light", "details_link": "https://www.metacritic.com/game/playstation-3/lara-croft-and-the-guardian-of-light", "publisher": "Square Enix", "release_date": "Sep 28 2010", "developers": ["Crystal Dynamics", "Nixxes Software"], "platforms": ["iPhone/iPad", "PC", "Stadia", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action Adventure", "Adventure", "General", "General"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/ffceeed6171614c6ace22f9d95b3d366-98.jpg", "descriptions": "Lara Croft and the Guardian of Light is the first ever downloadable, co-op action/adventure game featuring Lara Croft. This brand extension incorporates the hallmarks of the Tomb Raider franchise including exploration, discovery, platforming, and puzzle solving. Lara Croft and the GuardianLara Croft and the Guardian of Light is the first ever downloadable, co-op action/adventure game featuring Lara Croft. This brand extension incorporates the hallmarks of the Tomb Raider franchise including exploration, discovery, platforming, and puzzle solving. Lara Croft and the Guardian of Light allows players to experience Lara Croft from an isometric viewpoint, and combines new gameplay features such as character progression, fun fast-paced combat, and elements of cooperation and competition. Lara Croft and the Guardian of Light will be available to download this summer.… Expand"}, {"name": "Darksiders II", "details_link": "https://www.metacritic.com/game/playstation-3/darksiders-ii", "publisher": "THQ", "release_date": "Aug 14 2012", "developers": ["Vigil Games"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Fantasy", "Fantasy", "Open-World"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/0c4133527b3029b3d655eba7d2a3a7af-98.jpg", "descriptions": "Awakened by the End of Days, Death, the most feared of the legendary Four Horsemen, embarks upon a journey to restore mankind and redeem his brother’s name. Along the way, the Horseman discovers that there are far worse things than Apocalypse on earth and that an ancient grudge may threatenAwakened by the End of Days, Death, the most feared of the legendary Four Horsemen, embarks upon a journey to restore mankind and redeem his brother’s name. Along the way, the Horseman discovers that there are far worse things than Apocalypse on earth and that an ancient grudge may threaten all of Creation. Become the terrifying force which everyone fears but nothing can escape. Death Lives in Darksiders II.… Expand"}, {"name": "Borderlands", "details_link": "https://www.metacritic.com/game/xbox-360/borderlands", "publisher": "2K Games", "release_date": "Oct 20 2009", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/3aa827fda017917845ad865e47b4781b-98.jpg", "descriptions": "As the first title in an all-new sci-fi action franchise, Borderlands combines the best elements of Gearbox Software's first-person action titles with player customization and vehicular combat. Borderlands features a unique content generation system allowing for near-endless variety inAs the first title in an all-new sci-fi action franchise, Borderlands combines the best elements of Gearbox Software's first-person action titles with player customization and vehicular combat. Borderlands features a unique content generation system allowing for near-endless variety in missions, environments, enemies, weapons, item drops and character customization. Borderlands is a cooperative experience, allowing for multiple players to share the same game experience simultaneously online. Players can freely join or leave each other’s games at anytime, or choose to play in the full single-player mode. Borderlands features life-like character animations, impressive real-time physics, and customizable vehicles. More details to follow. [2K Games/Gearbox Software]… Expand"}, {"name": "Indigo Prophecy", "details_link": "https://www.metacritic.com/game/xbox/indigo-prophecy", "publisher": "Atari", "release_date": "Sep 26 2005", "developers": ["Quantic Dream"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Modern"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/0def7a38bd9f2c141a133cc38b8785a6-98.jpg", "descriptions": "Play both hunter and hunted in this psycho thriller. Set in New York, Indigo Prophecy gives you the chance to speak, explore, interact, fight, and confront unknown dark forces. In the story, you can play as Lucas Kane, one of the many ordinary people that suddenly begin killing totalPlay both hunter and hunted in this psycho thriller. Set in New York, Indigo Prophecy gives you the chance to speak, explore, interact, fight, and confront unknown dark forces. In the story, you can play as Lucas Kane, one of the many ordinary people that suddenly begin killing total strangers. Constantly burdened by strange visions, you must keep one step ahead of the police as you try to find out what's happening to you. Indigo Prophecy lets you control one of four characters and lets you make decisions that affect the storyline.… Expand"}, {"name": "Nioh: Complete Edition", "details_link": "https://www.metacritic.com/game/pc/nioh-complete-edition", "publisher": "Koei Tecmo Games", "release_date": "Nov  7 2017", "developers": ["Team Ninja"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/c022cfc27d86753cea5fbaa20a8254a3-98.jpg", "descriptions": "Ready to die? Experience the newest brutal action game from Team NINJA and Koei Tecmo Games. In the age of samurai, a lone traveler lands on the shores of Japan. He must fight his way through the vicious warriors and supernatural Yokai that infest the land in order to find that which he seeks."}, {"name": "Half-Minute Hero", "details_link": "https://www.metacritic.com/game/psp/half-minute-hero", "publisher": "XSEED Games", "release_date": "Oct 13 2009", "developers": ["Opus"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Role-Playing", "General", "General"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/aaeb634f6df293c2e450d36c9f20198c-98.jpg", "descriptions": "As the last wandering sage and final hope for humanity, it is up to the protagonist to somehow transcend time and death to unite these legends and their unique powers in one last battle against the ultimate evil lord. Fast-paced Action for Instant Gratification - A fresh new way to playAs the last wandering sage and final hope for humanity, it is up to the protagonist to somehow transcend time and death to unite these legends and their unique powers in one last battle against the ultimate evil lord. Fast-paced Action for Instant Gratification - A fresh new way to play games, clearing stages in 30-second intervals. Four Completely Different and Unique Game Play Modes - Four distinct storylines and modes that encompass an action RPG, a shooter, an escort mission, and a strategy game, keep the gameplay fresh and varied. [Xseed]… Expand"}, {"name": "ICEY", "details_link": "https://www.metacritic.com/game/pc/icey", "publisher": "X.D. Network Inc.", "release_date": "Nov 17 2016", "developers": ["Shanghai FantaBlade Network Technology Co.", "Ltd."], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/2ab814b630572dc63bfbcbe8bf498637-98.jpg", "descriptions": "ICEY is a 2D side-scrolling ACT and a META game in disguise. As you follow the narrator's omnipresent voice, you will see through ICEY's eyes and learn the truth about her world. The narrator will constantly urge you in one direction, but you must ask, \"Why? Why am I following his directions?"}, {"name": "Madden NFL 11", "details_link": "https://www.metacritic.com/game/xbox-360/madden-nfl-11", "publisher": "Electronic Arts", "release_date": "Aug 10 2010", "developers": ["EA Tiburon"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 84, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/92c0a31e931c3c5e0bfe40ca6b6294cd-98.jpg", "descriptions": "Madden NFL 11 promises to redefine the way you experience the game of football. SIMPLER: From 350 plays down to 1, the all-new GameFlow system puts you in the helmet of an NFL quarterback to execute an authentic, situational game plan, one play at a time. QUICKER: 60 minute game timesMadden NFL 11 promises to redefine the way you experience the game of football. SIMPLER: From 350 plays down to 1, the all-new GameFlow system puts you in the helmet of an NFL quarterback to execute an authentic, situational game plan, one play at a time. QUICKER: 60 minute game times reduced to as little as 30 minutes; spend more time on the field and less in the playbook. FULL games, HALF the time. DEEPER: Madden NFL 11 includes all-new 3-on-3 Online Team Play, improved animations, more intuitive controls, and Madden NFL Ultimate Team...all to the play-by-play of Gus Johnson. [Electronic Arts]… Expand"}]