[{"name": "Sonic the Hedgehog", "details_link": "https://www.metacritic.com/game/playstation-3/sonic-the-hedgehog", "publisher": "Sega", "release_date": "Jan 30 2007", "developers": ["Sonic Team"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 43, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/8/31a1346450a5eba38dbb0076e61393e0-98.jpg", "descriptions": "Sonic celebrates his 15th anniversary by blazing his way onto the next-generation consoles, with his first adventure set in the human world. Featuring interactive 3D environments and a large cast of returning and new characters, get ready for the reinvention of Sonic The Hedgehog, in hisSonic celebrates his 15th anniversary by blazing his way onto the next-generation consoles, with his first adventure set in the human world. Featuring interactive 3D environments and a large cast of returning and new characters, get ready for the reinvention of Sonic The Hedgehog, in his most intense, high velocity escapade to date. [Sega]… Expand"}, {"name": "Super Dungeon Bros", "details_link": "https://www.metacritic.com/game/playstation-4/super-dungeon-bros", "publisher": "Wired Productions", "release_date": "Nov  1 2016", "developers": ["React Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Role-Playing", "General", "Roguelike"], "meta_score": 43, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/7/f1f05d98a64f848baa1a9dbcb1b7d381-98.jpg", "descriptions": "In Super Dungeon Bros, teams of up to four players will control hard rocking warrior bros in the ever-changing dungeons that combine rock and fantasy with dangerous foes, deadly obstacles and hazardous puzzles. Players will take on bosses and plunder loot from the dark recesses of RökheimIn Super Dungeon Bros, teams of up to four players will control hard rocking warrior bros in the ever-changing dungeons that combine rock and fantasy with dangerous foes, deadly obstacles and hazardous puzzles. Players will take on bosses and plunder loot from the dark recesses of Rökheim where the Dungeon Bros will slay anything and everything in their path, as no challenge is too big for the Bros and their motto, “Bros B4 Foes!”… Expand"}, {"name": "Omerta: City of Gangsters", "details_link": "https://www.metacritic.com/game/xbox-360/omerta-city-of-gangsters", "publisher": "Kalypso", "release_date": "Feb 12 2013", "developers": ["Kalypso", "Haemimont Games"], "platforms": ["PC", "Xbox 360"], "num_players": "2 ", "genres": ["Simulation", "Strategy", "Turn-Based", "General", "General", "General", "Tactics"], "meta_score": 43, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/2/b85b9c8d6d2b05b1cd2e4fb9571afe43-98.jpg", "descriptions": "OMERTA - CITY OF GANGSTERS is a simulation game with tactical turn-based combat. Taking the role of a fresh-from-the-boat immigrant, with dreams of the big life, the player will work his way up the criminal hierarchy of 1920's Atlantic City. Starting with small jobs, his character recruits aOMERTA - CITY OF GANGSTERS is a simulation game with tactical turn-based combat. Taking the role of a fresh-from-the-boat immigrant, with dreams of the big life, the player will work his way up the criminal hierarchy of 1920's Atlantic City. Starting with small jobs, his character recruits a gang and expands his empire by taking territory from other gangsters. Eventually he establishes his own crime syndicate and becomes the de facto ruler of Atlantic City.… Expand"}, {"name": "MLB Slugfest 20-04", "details_link": "https://www.metacritic.com/game/game-boy-advance/mlb-slugfest-20-04", "publisher": "Midway", "release_date": "Mar 18 2003", "developers": ["Handheld Games"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/74254da10d3a70c8e2415e68ac83e234-98.jpg", "descriptions": "MLB SlugFest is back with more aggressive-style baseball than ever.  MLB Slugfest 20-04 delivers a blend of hardcore, lightning-fast gameplay combined with key baseball features that will please even the most diehard sports fan.  Turbo running, fielding, batting, and throwing are essentialMLB SlugFest is back with more aggressive-style baseball than ever.  MLB Slugfest 20-04 delivers a blend of hardcore, lightning-fast gameplay combined with key baseball features that will please even the most diehard sports fan.  Turbo running, fielding, batting, and throwing are essential skills in this game, which makes every play a highlight.  Among your favorite MLB players from around the league, you can create your own team of superstars, and then work your way up to a World Series championship.  With new moves, rosters, and the addition of the new Home Run Derby mode, this year's SlugFest hits home with awesome power.… Expand"}, {"name": "ECW Anarchy Rulz", "details_link": "https://www.metacritic.com/game/playstation/ecw-anarchy-rulz", "publisher": "Acclaim", "release_date": "Aug 18 2000", "developers": ["Acclaim"], "platforms": "PlayStation", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 43, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/363a47b49d6eaaea7c3b1fb27caecd41-98.jpg", "descriptions": "While Anarchy Rulz bears the ECW logo, the wrestling action is simply too low impact and refined for the likes of this brutal organization."}, {"name": "Star Wars The Clone Wars: Republic Heroes", "details_link": "https://www.metacritic.com/game/xbox-360/star-wars-the-clone-wars-republic-heroes", "publisher": "LucasArts", "release_date": "Oct  6 2009", "developers": ["Krome Studios"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 43, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/0656f4ac05cb6009c493847dfea61dc7-98.jpg", "descriptions": "Star Wars The Clone Wars: Republic Heroes lets Star Wars fans young and old live out the sweeping galactic adventures of the Clone Wars. For the first time ever, players can fight as their favorite Jedi and clone troopers from the preeminent animated television series - from familiar facesStar Wars The Clone Wars: Republic Heroes lets Star Wars fans young and old live out the sweeping galactic adventures of the Clone Wars. For the first time ever, players can fight as their favorite Jedi and clone troopers from the preeminent animated television series - from familiar faces like Anakin Skywalker to new heroes like Clone Captain Rex. A brand-new storyline, which bridges the gap between season one and two, takes the player on a multi-faceted adventure to stop a mysterious techno assassin's destructive plot. Built around two-player cooperative action, the accessible controls and family-friendly gameplay bring Star Wars fans across generations together like never before to fight the evil Separatists and restore peace to the galaxy. Play as your favorite Jedi heroes including Anakin Skywalker, Obi-Wan Kenobi, Ahsoka Tano, Mace Windu, and Kit Fisto. Slice and dice your way through Separatist droids with your lightsaber and Force powers and use your agility to perform amazing leaps and navigate levels filled with interactivity. Turn your enemies into weapons as you commandeer droids and use their unique abilities to blast enemies and solve puzzles as a Jedi. Be part of an elite clone trooper squad with unique gameplay that puts firepower at your fingertips. Blast droids and unleash devastation with heavy weapons like rocket launchers and thermal detonators as Commander Cody, Captain Rex and all of your favorite clone troopers. Compete against a friend with in-level challenges for rewards and points to be spent to upgrade your character and unlock bonus items. [LucasArts]… Expand"}, {"name": "Yaiba: Ninja Gaiden Z", "details_link": "https://www.metacritic.com/game/playstation-3/yaiba-ninja-gaiden-z", "publisher": "Team Ninja", "release_date": "Mar 18 2014", "developers": ["Spark Unlimited", "comcept"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "General", "Horror", "Survival", "Linear"], "meta_score": 43, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/0/1cefcb1ace80069de9dcadf66d05eefb-98.jpg", "descriptions": "The ninja are the most elite of warriors, exercising unparalleled skill, precision, and lethality for centuries. Only the most deadly candidates are given the rare and coveted opportunity to join the clan. The final test of a ninja"}, {"name": "America's Army: True Soldiers", "details_link": "https://www.metacritic.com/game/xbox-360/americas-army-true-soldiers", "publisher": "Ubisoft", "release_date": "Nov 15 2007", "developers": ["Red Storm Entertainment"], "platforms": "Xbox 360", "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 43, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/1dd8fcd28d90bfa2d3cf7d959e788e20-98.jpg", "descriptions": "The multiplayer mode is a key feature of America’s Army: True Soldiers with eight maps developed by Red Storm Entertainment and full Xbox LIVE online gaming service Clan support, so teams will be able to quickly jump online and compete. Players immerse themselves within the true infantryThe multiplayer mode is a key feature of America’s Army: True Soldiers with eight maps developed by Red Storm Entertainment and full Xbox LIVE online gaming service Clan support, so teams will be able to quickly jump online and compete. Players immerse themselves within the true infantry experience of a modern Soldier. As a Soldier in single-player mode, advance through your career and take on roles such as Rifleman, Grenadier, Automatic Rifleman and Sniper. Red Storm and the Army have worked together to make sure that the America’s Army: True Soldiers gameplay experience is an authentic Army experience. The America’s Army: True Soldiers game accurately portrays the values that guide Soldiers in the U.S. Army, by specifically incorporating gameplay based on mission accomplishment, teamwork, leadership, rules of engagement and respect for life and property. Just like in real combat, honor and respect must be earned, and in the game, the Play-Lead-Recruit feature allows players to earn respect as they move up through the ranks and become true leaders. Teammates can award points to other team members who play honorably and jump in when the mission is on the line. As the most realistic U.S. Army experience on a console, America’s Army: True Soldiers features high-tech equipment, including a Blue Force Tracker that improves recognition of targets while increasing information to the player. Additional Intel will be gathered by the Raven UAV and displayed on their Blue Force Tracker. AI teammates can share Intel via in-game voice-over. [Ubisoft]… Expand"}, {"name": "Harry Potter and the Deathly Hallows, Part 2", "details_link": "https://www.metacritic.com/game/playstation-3/harry-potter-and-the-deathly-hallows-part-2", "publisher": "Electronic Arts", "release_date": "Jul 12 2011", "developers": ["EA Bright Light"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 43, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/55e8821ed86164039717dff2ea24f7ba-98.jpg", "descriptions": "Harry Potter takes a dark turn in this third-person shooter as he battles death eaters and dementors while fleeing for his life across the wilds of England."}, {"name": "The Golden Compass", "details_link": "https://www.metacritic.com/game/ds/the-golden-compass", "publisher": "Sega", "release_date": "Dec  4 2007", "developers": ["Artificial Mind and Movement"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "2  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 43, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/7cb22ef779025e71a5ad20909ca82020-98.jpg", "descriptions": "The Golden Compass follows the screenplay adaptation of the first book in the acclaimed trilogy, capturing the fantasy adventure set in a parallel world where giant armored bears rule a kingdom, beautiful witches fly through the frozen skies, and human beings' deepest essence is manifest asThe Golden Compass follows the screenplay adaptation of the first book in the acclaimed trilogy, capturing the fantasy adventure set in a parallel world where giant armored bears rule a kingdom, beautiful witches fly through the frozen skies, and human beings' deepest essence is manifest as talking animals that remain their faithful companion for life – their daemon. Players can assume the role of Lyra, a young girl, along with her daemon Pantalaimon (Pan), as she journeys through the frozen wastes of the North to rescue a friend kidnapped by a mysterious organization known as The Gobblers and winds up on an epic quest to save not only her world, but ours as well. Gamers can also take on the character of Iorek Byrnison, a great armoured polar bear who joins the quest. As Lyra, players use their daemon and collaborate with in-game characters, collecting special items in order to explore, evade, and deceive their way through confrontations with the Gobblers, the Magisterium, and the horribly dangerous spy fly to find her friend. They can also do battle as Iorek with special attacks and a riding mechanic as he protects Lyra during the journey. Gamers can unlock secrets and mini-games using a mysterious, truth-telling golden compass device called an alethiometer. Players can explore 13 vast locations, including all-new breath-taking environments not seen in the film, on this massive journey of collaboration, exploration and the eternal struggle between good and evil. [Sega]… Expand"}, {"name": "Myst", "details_link": "https://www.metacritic.com/game/ds/myst", "publisher": "Empire Interactive", "release_date": "May 13 2008", "developers": ["Hoplite Research"], "platforms": ["3DS", "iPhone/iPad", "DS"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "First-Person", "Fantasy", "Fantasy"], "meta_score": 43, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/4/c8b4f45f7d359d25523a20fb38098958-98.jpg", "descriptions": "Myst is an immersive experience that draws you in and won't let you go. You enter a unique setting, venturing alone to varied times and places, the worlds that compose Myst. There are no instructions, and you encounter no living beings but soon realize your actions may help individuals whoMyst is an immersive experience that draws you in and won't let you go. You enter a unique setting, venturing alone to varied times and places, the worlds that compose Myst. There are no instructions, and you encounter no living beings but soon realize your actions may help individuals who are somehow trapped in a parallel dimension. You don't so much play Myst, as experience it. Of course you must solve a multitude of puzzles, mazes, and problems, but Myst's principal attractions are its environment and the underlying intrafamily drama that unfolds as you explore. Unlike most adventure games, Myst offers no inventory, no death, and no dialogue. Although puzzles don't seem to have much direct connection to the game, they share a commonality. They take on many forms but follow a consistent thread. Some puzzles are very challenging, even obtuse, creating an odd paradox: many buy Myst, but few complete it. It is immensely popular, but most nonadventurers quit in frustration. Fortunately, Myst's popularity has spawned several online sites for hints, walk-throughs, and even saved games . The nonlinear gameplay of Myst lets players go anywhere at any time. Unlike other adventure games, Myst has no inventory, and players never die. Incredibly detailed, Myst offers more depth than any other CD-ROM game to date. [Midway]… Expand"}, {"name": "Dead or Alive Xtreme 3: Fortune", "details_link": "https://www.metacritic.com/game/playstation-4/dead-or-alive-xtreme-3-fortune", "publisher": "Koei Tecmo Games", "release_date": "Mar 24 2016", "developers": ["Team Ninja"], "platforms": "PlayStation 4", "genres": ["Sports", "Volleyball", "Team"], "meta_score": 43, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/7281d102120ec8c1c09635a36d1e35c1-98.jpg", "descriptions": "(Available in Japan and Asian territories only) The nine playable characters in the game were selected based on the total PlayStation Store purchases of dashboard themes from Dead or Alive 5 Last Round between August 20 and September 7, 2015."}, {"name": "Surgeon Simulator: Experience Reality", "details_link": "https://www.metacritic.com/game/playstation-4/surgeon-simulator-experience-reality", "publisher": "Bossa Studios", "release_date": "Dec  3 2016", "developers": ["Bossa Studios"], "platforms": ["PC", "PlayStation 4"], "genres": ["Simulation", "Virtual", "Career"], "meta_score": 43, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/6/0b1e53476d86a5cfceb3d3617d465567-98.jpg", "descriptions": null}, {"name": "Cruis'n  Exotica", "details_link": "https://www.metacritic.com/game/nintendo-64/cruisn-exotica", "publisher": "Midway", "release_date": "Oct 16 2000", "developers": ["Gratuitous Games"], "platforms": "Nintendo 64", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 43, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/2c89a67596281b6498d47d67e1ab0f2c-98.jpg", "descriptions": "Race in style! Cruis'n Exotica takes you to fantastic locales in even more fantastic vehicles. Race through steamy Jurassic jungles or on the ocean floor. Midair stunts keep the action nonstop! Valuable short-cuts and nitro boosts speed up the already fast-paced action! Fantastic drivingRace in style! Cruis'n Exotica takes you to fantastic locales in even more fantastic vehicles. Race through steamy Jurassic jungles or on the ocean floor. Midair stunts keep the action nonstop! Valuable short-cuts and nitro boosts speed up the already fast-paced action! Fantastic driving action straight from the arcade! 60 tracks from around the world. One to four player nonstop racing action. Three modes of gameplay to choose from.… Expand"}, {"name": "Backyard Wrestling 2: There Goes the Neighborhood", "details_link": "https://www.metacritic.com/game/xbox/backyard-wrestling-2-there-goes-the-neighborhood", "publisher": "Eidos Interactive", "release_date": "Nov 16 2004", "developers": ["Paradox Development"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/ea842c9f3381b2c72375b7ea35ef83a3-98.jpg", "descriptions": "Delve deep into the heart of Small Town America, USA, with Backyard Wrestling 2. Backyard Wrestling Inc. has put a million-dollar cash prize on the line for the wrestler who can win the unified BYW championship. Defeating the most hardcore backyard wrestlers is not enough, however, as theDelve deep into the heart of Small Town America, USA, with Backyard Wrestling 2. Backyard Wrestling Inc. has put a million-dollar cash prize on the line for the wrestler who can win the unified BYW championship. Defeating the most hardcore backyard wrestlers is not enough, however, as the lure of \"easy money\" has attracted the attention of professional wrestlers as well. With new submission holds, body damage, and defensive moves, you must prove you have what it takes to destroy every obstacle in your path.… Expand"}, {"name": "Of Bird and Cage", "details_link": "https://www.metacritic.com/game/pc/of-bird-and-cage", "publisher": "All in! Games", "release_date": "May 20 2021", "developers": ["Capricia Productions"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 43, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/d3d1e4ad27b713bced23ed69b1d25ba0-98.jpg", "descriptions": "Of Bird and Cage is a unique metal album presented through a two-hour-long story-driven game. Play music in a brand-new way. Featuring famous artists like Ron \"Bumblefoot\" Thal (ex-Guns N' Roses), Rob van der Loo (Epica), Ruud Jolie (Within Temptation), and many others!"}, {"name": "Dead Alliance", "details_link": "https://www.metacritic.com/game/xbox-one/dead-alliance", "publisher": "Maximum Games", "release_date": "Aug 29 2017", "developers": ["IllFonic", "Maximum Games", "Psyop"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "General", "Shooter", "First-Person", "Tactical"], "meta_score": 43, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/7/905d4fd2cbef6213018eb325b6a620b3-98.jpg", "descriptions": "Dead Alliance is a multiplayer first-person zombie shooter set in a post-apocalyptic world, where former military bases stand intact and are the only remaining city-states. Players will shape teams to strategically take control of bases across maps infected with walkers. Using variedDead Alliance is a multiplayer first-person zombie shooter set in a post-apocalyptic world, where former military bases stand intact and are the only remaining city-states. Players will shape teams to strategically take control of bases across maps infected with walkers. Using varied loadouts from guns to pheromone grenades, players will also use the zombies themselves as weapons against opposing factions, turning them into undead allies. To stay alive, you must face off against enemy armies and gruesome, man-eating killers -- all while attempting to capture and control as many bases as possible. The world is a wasteland and your only hope for survival is to use the dead... or join them.… Expand"}, {"name": "Will of Steel", "details_link": "https://www.metacritic.com/game/pc/will-of-steel", "publisher": "GMX Media", "release_date": "Feb  4 2005", "developers": ["Gameyus Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 43, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/6526e8727edd34b76da5f5135506f3ca-98.jpg", "descriptions": "Will of Steel is a modern warfare tactical 3D Real Time Strategy game set in the early 1990s. As a young Marine officer, William Steel is the son of the highly decorated USMC General Thomas Steel. Players must assume command and responsibility of the battalion at his control and defeat yourWill of Steel is a modern warfare tactical 3D Real Time Strategy game set in the early 1990s. As a young Marine officer, William Steel is the son of the highly decorated USMC General Thomas Steel. Players must assume command and responsibility of the battalion at his control and defeat your opposing in forces in hostile locations around the globe. At the players disposal will be infantry, battle tanks, armoured personnel carriers, recon units and many other types of military hardware. The player must make wise military choices and decide how to adjust his/her actions to counteract the strategy employed by the enemy forces in Afghanistan and Iraq. Through the use of dynamic Sun, missions unfold from dawn to dusk with a number of climate conditions, such as rain and fog, that may help or hinder your battle progress. Throughout the game, the player also strives to improve his/her career. By winning medals and being promoted, various special options are revealed that he/she can use in battle. [GMX Media]… Expand"}, {"name": "Aliens: Colonial Marines", "details_link": "https://www.metacritic.com/game/playstation-3/aliens-colonial-marines", "publisher": "Sega", "release_date": "Feb 12 2013", "developers": ["Gearbox Software"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 43, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/5/104aed30d64588d38ee9ca9a9d8605d2-98.jpg", "descriptions": "In Aliens: Colonial Marines, players are part of a United States Colonial Marine squad and must prepare to face an Aliens assault more intense and horrific than ever before. Driven by an original story penned by renowned writers Bradley Thompson and David Weddle, Aliens: Colonial MarinesIn Aliens: Colonial Marines, players are part of a United States Colonial Marine squad and must prepare to face an Aliens assault more intense and horrific than ever before. Driven by an original story penned by renowned writers Bradley Thompson and David Weddle, Aliens: Colonial Marines retains the atmospheric look and feel of the original films while leveraging next-generation technology to create an entirely new interactive Aliens experience. Packing classic Aliens weaponry ranging from pulse rifles to flamethrowers as well as brand-new equipment and skills all within a squad-based combat system, players become an elite United States Colonial Marine. Featuring claustrophobic environments, a brooding soundtrack, and a multitude of surprises and shocks, players battle against menacing alien hordes in levels that include the stark interiors of the abandoned Sulaco and unique environments created specifically for the game. Aliens: Colonial Marines features a story driven single-player mode and an all-new four player co-op mode allowing players to share the chilling experience with three friends. In co-op mode, each player assumes the persona of a United States Colonial Marine and have a distinct role to play in the completion of every mission. [Sega]… Expand"}, {"name": "Rise of the Guardians", "details_link": "https://www.metacritic.com/game/xbox-360/rise-of-the-guardians", "publisher": "D3Publisher", "release_date": "Nov 20 2012", "developers": ["Torus Games", "D3Publisher"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Adventure", "General", "General"], "meta_score": 43, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/9/b7773bdd6f024f236537e90096ed6e37-98.jpg", "descriptions": "Let your imagination soar in Rise of the Guardians: The Video Game as you play in an action-packed adventure game as one of the classic childhood legends, including: North (aka Santa Claus), Tooth (aka the Tooth Fairy), Bunnymund (aka the Easter Bunny), Sandman, and Jack Frost.  Each playerLet your imagination soar in Rise of the Guardians: The Video Game as you play in an action-packed adventure game as one of the classic childhood legends, including: North (aka Santa Claus), Tooth (aka the Tooth Fairy), Bunnymund (aka the Easter Bunny), Sandman, and Jack Frost.  Each player has their own set of upgradable and never-before-seen extraordinary abilities to help you take on the evil spirit \"Pitch\" and his infectious nightmares.  With drop-in-and-out multiplayer and up to four players on consoles, cool team attacks, and an arsenal of spellbinding moves, you and your team of Guardians will protect the hopes, beliefs and imaginations of children all over the world!… Expand"}, {"name": "Star Wars The Clone Wars: Republic Heroes", "details_link": "https://www.metacritic.com/game/playstation-3/star-wars-the-clone-wars-republic-heroes", "publisher": "LucasArts", "release_date": "Oct  6 2009", "developers": ["LucasArts", "Krome Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 43, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/ce546ad85dc105c502fa1a5e34e814b5-98.jpg", "descriptions": "Star Wars The Clone Wars: Republic Heroes lets Star Wars fans young and old live out the sweeping galactic adventures of the Clone Wars. For the first time ever, players can fight as their favorite Jedi and clone troopers from the preeminent animated television series - from familiar facesStar Wars The Clone Wars: Republic Heroes lets Star Wars fans young and old live out the sweeping galactic adventures of the Clone Wars. For the first time ever, players can fight as their favorite Jedi and clone troopers from the preeminent animated television series - from familiar faces like Anakin Skywalker to new heroes like Clone Captain Rex. A brand-new storyline, which bridges the gap between season one and two, takes the player on a multi-faceted adventure to stop a mysterious techno assassin's destructive plot. Built around two-player cooperative action, the accessible controls and family-friendly gameplay bring Star Wars fans across generations together like never before to fight the evil Separatists and restore peace to the galaxy. Play as your favorite Jedi heroes including Anakin Skywalker, Obi-Wan Kenobi, Ahsoka Tano, Mace Windu, and Kit Fisto. Slice and dice your way through Separatist droids with your lightsaber and Force powers and use your agility to perform amazing leaps and navigate levels filled with interactivity. Turn your enemies into weapons as you commandeer droids and use their unique abilities to blast enemies and solve puzzles as a Jedi. Be part of an elite clone trooper squad with unique gameplay that puts firepower at your fingertips. Blast droids and unleash devastation with heavy weapons like rocket launchers and thermal detonators as Commander Cody, Captain Rex and all of your favorite clone troopers. Compete against a friend with in-level challenges for rewards and points to be spent to upgrade your character and unlock bonus items. [LucasArts]… Expand"}, {"name": "Tron", "details_link": "https://www.metacritic.com/game/xbox-360/tron", "publisher": "Disney Interactive Studios", "release_date": "Jan  9 2008", "developers": ["Backbone Entertainment"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Miscellaneous", "General", "General", "Party / Minigame"], "meta_score": 43, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/1cf36bf88b41d948f448fa149152389f-98.jpg", "descriptions": "[Xbox Live Arcade]  Battle as mighty video warrior Tron against the insidious Master Control Program and his ruthless right-hand man, Sark. Tron offers a retro-futuristic test of gaming ability. Race life cycles, demolish tanks, dodge grid bugs, and even face off against the MCP himself to[Xbox Live Arcade]  Battle as mighty video warrior Tron against the insidious Master Control Program and his ruthless right-hand man, Sark. Tron offers a retro-futuristic test of gaming ability. Race life cycles, demolish tanks, dodge grid bugs, and even face off against the MCP himself to find out who truly rules the computer world! Tron is a perfect recreation of the classic arcade game based on the pioneering computer animated Disney film. Authentic graphics, gameplay and audio have all been upgraded to take advantage of the high-definition graphics and CD bit rate quality of Xbox 360. Now you can be a part of the most famous scene from the movie. Ride your blue cycle and battle the enemy yellow cycles in a gridline battle royale. Exterminate the Grid Bugs and escape into the I/O Tower before time runs out. Demolish all enemy tanks and Recognizers to clear the board. Smash the blocks and move your character into the MCP cone to clear the level. A bonus is awarded if you destroy all the blocks. The original arcade game was single player only. Now, Xbox LIVE Arcade brings you the first version of the game with two-person multiplayer functionality. Multiplayer modes: Split screen and online, co-op and versus, there are lots of ways to playTron. In Versus mode, the players race to achieve the highest score. Try Versus Speed mode, where the first player to reach a host-defined score wins. In Co-op, both players' scores are added together to achieve a high score. And beware the Pressure Cooker where players race to achieve the highest score, but taking the lead after a sub-stage causes the other player's game speed to increase. [Midway]… Expand"}, {"name": "Farscape: The Game", "details_link": "https://www.metacritic.com/game/pc/farscape-the-game", "publisher": "Simon & Schuster", "release_date": "Aug  8 2002", "developers": ["Red Lemon Studios"], "platforms": "PC", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/38f756ac5e8657f38e1df75fb927a8ef-98.jpg", "descriptions": "John Crichton is an American astronaut, catapulted by an experiment-gone-wrong into a distant corner of space. He's been taken in by a motley band of escaped alien prisoners on a living ship called Moya. They travel around the galaxy, constantly staying one step ahead of the evil,John Crichton is an American astronaut, catapulted by an experiment-gone-wrong into a distant corner of space. He's been taken in by a motley band of escaped alien prisoners on a living ship called Moya. They travel around the galaxy, constantly staying one step ahead of the evil, militaristic Peacekeepers. In this adventure (set during the show's smash first season), Moya is in orbit around an isolated desert planet, recovering from damage. She is suddenly attacked and boarded by a Peacekeeper strike wing. Moya's crew scatters. Some hide aboard the ship; others are captured; a few escape. Crichton, with the alluring Chiana, makes it off the ship in Aeryn's Prowler. They are shot down, and crash-land in the trackless desert. Stranded, unaware of their friends' fates, Crichton and Chiana must find a way to fix their spacecraft and get back to Moya to free their friends. In the meantime, they become mixed up with warring alien factions, and uncover heinous conspiracies and terrible crimes that threaten the stability of the entire galaxy. [Simon & Schuster]… Expand"}, {"name": "Justice League Heroes", "details_link": "https://www.metacritic.com/game/ds/justice-league-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 17 2006", "developers": ["Sensory Sweep"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 43, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/c4acb531b7eee0bf8ab7f53ccfea1950-98.jpg", "descriptions": "Justice League Heroes for the Nintendo DS, developed by Sensory Sweep Studios as a prequel to the console title, lets gamers use the stylus to control and unleash the superpowers of Batman, Superman, The Flash and Wonder Woman. Gamers use objects within the destructible environment againstJustice League Heroes for the Nintendo DS, developed by Sensory Sweep Studios as a prequel to the console title, lets gamers use the stylus to control and unleash the superpowers of Batman, Superman, The Flash and Wonder Woman. Gamers use objects within the destructible environment against enemies at will and also call in devastating attacks from other DC Comics super heroes, like Aquaman and Green Arrow, to help save the world from certain destruction. [Warner Bros. Interactive]… Expand"}, {"name": "Gardening Mama 2: Forest Friends", "details_link": "https://www.metacritic.com/game/3ds/gardening-mama-2-forest-friends", "publisher": "Majesco Games", "release_date": "Apr 29 2014", "developers": ["Racjin"], "platforms": "3DS", "genres": ["Simulation", "Strategy", "General", "Virtual", "Career"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/0aa23d6d5e39a6d0bfd8e2efc46c1215-98.jpg", "descriptions": "Plant the Seeds of Friendship!\r Mama is back in her gardening gloves planting the seeds of friendship! Make your animal friends happy by growing flowers, fruits and vegetables they can sell in their forest shops. With intuitive, stylus based-activities, customization and tons of funPlant the Seeds of Friendship!\r Mama is back in her gardening gloves planting the seeds of friendship! Make your animal friends happy by growing flowers, fruits and vegetables they can sell in their forest shops. With intuitive, stylus based-activities, customization and tons of fun rewards, Garden Mama 2: Forest Friends will get you growing in no time!… Expand"}, {"name": "Ben 10: Omniverse", "details_link": "https://www.metacritic.com/game/wii-u/ben-10-omniverse", "publisher": "D3Publisher", "release_date": "Nov 18 2012", "developers": ["Vicious Cycle"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Fantasy", "Action", "Action Adventure", "General", "General"], "meta_score": 43, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/94a3cd714859d9e82e4b6cf49e3a4326-98.jpg", "descriptions": "BEN 10 Omniverse is a free-to-play, browser-based massively multiplayer online game divided into episodes that involve you in the adventures of the famous boy hero."}, {"name": "Hot Wheels: Beat That!", "details_link": "https://www.metacritic.com/game/xbox-360/hot-wheels-beat-that!", "publisher": "Activision", "release_date": "Sep 26 2007", "developers": ["Eutechnyx"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 43, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/adc8243e63f03bf8136c801d6b555744-98.jpg", "descriptions": "Put the pedal to the metal and show off your racing skills in \"Hot Wheels: Beat That!\" Speed, Power, Performance, and Attitude are what determines success here. Choose your car, grab the wheel, and let her rip! Then challenge your friends to \"BEAT THAT!\" 30 cars authentically modeledPut the pedal to the metal and show off your racing skills in \"Hot Wheels: Beat That!\" Speed, Power, Performance, and Attitude are what determines success here. Choose your car, grab the wheel, and let her rip! Then challenge your friends to \"BEAT THAT!\" 30 cars authentically modeled directly from Hot Wheels design specs. 12 pulse-pounding tracks and 4 battle arenas. Stunt action with high-flying jumps and high-speed drifting. 5 competitive modes: Race, Eliminator, Rampage, Tournament, and Battle. Collect competitive weaponry as power-ups. Physics-based racing with visible vehicle damage and amazing wipe-outs. [Activision]… Expand"}, {"name": "TMNT: Mutant Melee", "details_link": "https://www.metacritic.com/game/xbox/tmnt-mutant-melee", "publisher": "Konami", "release_date": "Mar 15 2005", "developers": ["Konami Computer Entertainment Hawaii"], "platforms": ["PC", "Xbox"], "num_players": "2  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 43, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/170e65664660fd9c56c43928569ba494-98.jpg", "descriptions": "The Teenage Mutant Ninja Turtles return in their first party game experience. Gather your friends to join you in a variety of minigames and adventures that feature more than 20 playable characters, including all four turtles, Casey Jones, April O'Neil, Master Splinter, and even the evilThe Teenage Mutant Ninja Turtles return in their first party game experience. Gather your friends to join you in a variety of minigames and adventures that feature more than 20 playable characters, including all four turtles, Casey Jones, April O'Neil, Master Splinter, and even the evil Shredder. TMNT Mutant Melee features two modes--adventure story and melee match--which are playable either solo or with up to three other players. In each mode, you can collect tokens to unlock additional content.… Expand"}, {"name": "Naughty Bear", "details_link": "https://www.metacritic.com/game/playstation-3/naughty-bear", "publisher": "505 Games", "release_date": "Jun 25 2010", "developers": ["Artificial Mind and Movement"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General"], "meta_score": 43, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/6d7971981b8bb4dcce3223b0fd1c7fa3-98.jpg", "descriptions": "Naughty Bear tells the tale of one demented teddy bear's ruthless efforts to torment and harass the inhabitants of the Island of Perfection."}, {"name": "Bliss Island", "details_link": "https://www.metacritic.com/game/xbox-360/bliss-island", "publisher": "Codemasters", "release_date": "Mar 12 2008", "developers": ["Pompom Software"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 43, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/69b994691549e4a5b07ddd0d5657a1ac-98.jpg", "descriptions": "[Xbox Live Arcade]  Bliss Island is a pick-up-and-play game in which you delve into the world of Bliss Island and help Hoshi win a day off as you take on over 25 unique challenges, spread across nine crazy levels. Mastered single player mode? Challenge your friends online and see who really[Xbox Live Arcade]  Bliss Island is a pick-up-and-play game in which you delve into the world of Bliss Island and help Hoshi win a day off as you take on over 25 unique challenges, spread across nine crazy levels. Mastered single player mode? Challenge your friends online and see who really is the Bliss Island champion. Experience more than 25 unique challenges across nine crazy levels. [PomPom]… Expand"}, {"name": "Jeremy McGrath Supercross 2000", "details_link": "https://www.metacritic.com/game/playstation/jeremy-mcgrath-supercross-2000", "publisher": "Acclaim", "release_date": "Jul 14 2000", "developers": ["Acclaim"], "platforms": "PlayStation", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/0c2e37acfcc67d1a2c8460ce92c1afad-98.jpg", "descriptions": "Jeremy McGrath is an unfortunate example of what happens when sports games fall into a rut."}, {"name": "Transformers: Rise of the Dark Spark", "details_link": "https://www.metacritic.com/game/playstation-4/transformers-rise-of-the-dark-spark", "publisher": "Activision", "release_date": "Jun 24 2014", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Sci-Fi", "General"], "meta_score": 43, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/6/1fa4b1e74524f18206bfddadb57227e3-98.jpg", "descriptions": "Fight your way through both Earth and Cybertron universes in an unforgettable battle to secure the Dark Spark. Play the expanded four-player co-op online escalation mode with new upgradeable defenses and challenging Power Foes. The new leveling system spans campaign and escalation, allowingFight your way through both Earth and Cybertron universes in an unforgettable battle to secure the Dark Spark. Play the expanded four-player co-op online escalation mode with new upgradeable defenses and challenging Power Foes. The new leveling system spans campaign and escalation, allowing players to unlock rewards that will aid progression in both modes.… Expand"}, {"name": "Funk of Titans", "details_link": "https://www.metacritic.com/game/xbox-one/funk-of-titans", "publisher": "A Crowd of Monsters", "release_date": "Jan  9 2015", "developers": ["A Crowd of Monsters"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 43, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/4/e0d55b6c23cc5e052d5ce76b6c0499d9-98.jpg", "descriptions": "Funk of Titans was developed by the indie developer A Crowd of Monsters, and is a fast-paced side-scrolling platformer in which you are tasked to defeat the Music Titans in the name of funk by Zeus himself.  As Perseus (wielder of Funk-Fu) you will accomplish this difficult task via 40+Funk of Titans was developed by the indie developer A Crowd of Monsters, and is a fast-paced side-scrolling platformer in which you are tasked to defeat the Music Titans in the name of funk by Zeus himself.  As Perseus (wielder of Funk-Fu) you will accomplish this difficult task via 40+ levels through 3 different worlds of music: Pop, Rap, and Rock. The Pagan Titans and Music Gods stand in your way, so grab your knife, steel your heart, and let's get funky.… Expand"}, {"name": "RollerCoaster Tycoon World", "details_link": "https://www.metacritic.com/game/pc/rollercoaster-tycoon-world", "publisher": "Atari", "release_date": "Nov 16 2016", "developers": ["Nvizzio Creations"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Tycoon", "Strategy", "Management", "Business / Tycoon"], "meta_score": 43, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/7/5a10b17b4a85f08a05407de6e284ac39-98.jpg", "descriptions": "RCTW includes new innovations including an intuitive 3D track builder, deformable terrain, realistic coaster physics, and the ability to share your park creations. Players can also team-up with friends from around the globe to form a theme park company and compete with others worldwide.RCTW includes new innovations including an intuitive 3D track builder, deformable terrain, realistic coaster physics, and the ability to share your park creations. Players can also team-up with friends from around the globe to form a theme park company and compete with others worldwide. Experience the ride of your life as you customize incredible coasters, entertain your park guests, create stomach-churning corkscrews and become the world’s next RollerCoaster Tycoon.… Expand"}, {"name": "Air Conflicts: Vietnam", "details_link": "https://www.metacritic.com/game/pc/air-conflicts-vietnam", "publisher": "Kalypso", "release_date": "Oct  2 2013", "developers": ["bitComposer Games", "bitComposer"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 43, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/6/4f60006d951602dc716da884d2eee68e-98.jpg", "descriptions": "Air Conflicts: Vietnam offers the popular combination of flight simulation and arcade gameplay. In the course of the game, the player controls over 20 accurately simulated fighter jets and helicopters from the Vietnam War era. In certain missions, the player has to leave the pilots seatAir Conflicts: Vietnam offers the popular combination of flight simulation and arcade gameplay. In the course of the game, the player controls over 20 accurately simulated fighter jets and helicopters from the Vietnam War era. In certain missions, the player has to leave the pilots seat temporarily to operate the guns and defend against attacks. If several fighter jets take part in a mission, the player can equip and upgrade them individually, as well as control the entire squadron. Air Conflicts: Vietnam offers a variety of missions and a compelling story set against the background of one of the best-known and most controversial wars in modern history.… Expand"}, {"name": "Asphalt 3D", "details_link": "https://www.metacritic.com/game/3ds/asphalt-3d", "publisher": "Ubisoft", "release_date": "Mar 22 2011", "developers": ["Gameloft"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 43, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/55626d5e9f6922ef3fe764249e971950-98.jpg", "descriptions": "Asphalt 3D brings all the excitement and speed of the Asphalt franchise to stereoscopic 3D, featuring more than 40 licensed vehicles, 17 exotic track locations and complete StreetPass functionality."}, {"name": "Fast Draw Showdown", "details_link": "https://www.metacritic.com/game/wii/fast-draw-showdown", "publisher": "Digital Leisure Inc.", "release_date": "Jan  4 2010", "developers": ["Digital Leisure Inc.", "Digital Leisure"], "platforms": ["PlayStation 3", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Light Gun", "Light Gun", "Modern"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/0f598eb6d4b208324990518a28d213bf-98.jpg", "descriptions": "[WiiWare]  When it comes to fast draw there're only two types of people: the quick ... and the dead! Now you have the chance to find out where you stand, or lie, as the case may be. You'll go up against the best quick draws in the business, including one of the world's fastest, Wes Flowers.[WiiWare]  When it comes to fast draw there're only two types of people: the quick ... and the dead! Now you have the chance to find out where you stand, or lie, as the case may be. You'll go up against the best quick draws in the business, including one of the world's fastest, Wes Flowers. Unholster your Wii Remote controller and show 'em who the fastest draw really is, in this live-action shooter. You can even take on a friend in multiplayer modes, and see which of you has the quickest draw. You'll need some serious speed and awesome accuracy to take on these gunslingers ... so get ready for some real fast draw action. [Nintendo]… Expand"}, {"name": "NBA Live 14", "details_link": "https://www.metacritic.com/game/playstation-4/nba-live-14", "publisher": "Electronic Arts", "release_date": "Nov 19 2013", "developers": ["EA Sports"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Arcade", "Sports", "Traditional", "Team", "Basketball", "Arcade"], "meta_score": 43, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/8/0d9879be73f948e0578d6ce89159c5a0-98.jpg", "descriptions": "BounceTek -- Revolutionary physics-based dribbling allows for complete, organic control and authentic responsiveness. Utilize a full suite of dribble moves to unleash ankle-breaking crossovers, hesitations and more. CourtQ Delivers Real Time NBA -- Leveraging live synergy Sports TechnologyBounceTek -- Revolutionary physics-based dribbling allows for complete, organic control and authentic responsiveness. Utilize a full suite of dribble moves to unleash ankle-breaking crossovers, hesitations and more. CourtQ Delivers Real Time NBA -- Leveraging live synergy Sports Technology data, NBA LIVE 14 is driven by over 70 player ratings, tendencies, and team stats updated every NBA game, ensuring that your game is always in-sync with the real NBA. With fresh content and challenges updated on a daily basis, NBA LIVE 14 delivers a new experience each and every time you pick up the controller, delivering the pulse of the NBA 24/7/365.… Expand"}, {"name": "Dynasty Warriors 6", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-6", "publisher": "Koei", "release_date": "Nov 18 2008", "developers": ["Koei", "Omega Force"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 43, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/97a77c9f8e49741a39b185500fb363e7-98.jpg", "descriptions": "Set in Ancient China during the 3rd century, Dynasty Warriors 6 immerses gamers in a truly cinematic kung-fu action experience. Celebrated characters have been completely re-imagined with new weapons and fighting techniques motion-captured from some of today’s leading stuntmen and women inSet in Ancient China during the 3rd century, Dynasty Warriors 6 immerses gamers in a truly cinematic kung-fu action experience. Celebrated characters have been completely re-imagined with new weapons and fighting techniques motion-captured from some of today’s leading stuntmen and women in Asia. With the game’s new “Renbu” attack system and game controls, players can execute lightning-fast combos and the most dazzling fighting moves with ease. Developed from the ground up exclusively for next-generation platforms, the game's proprietary engine delivers the most chaotic and challenging Tactical Action experience to date. Players can use the landscape to elude the thousands of soldiers swarming the battlefield. But as players move and attack, adaptable enemy A.I. devises offensive and defensive combat tactics, and can retaliate with packs of fierce hunting dogs and patrol boats. All of the explosive action comes to life in high definition, 60 frames per second graphics. [KOEI]… Expand"}, {"name": "Justice League: Chronicles", "details_link": "https://www.metacritic.com/game/game-boy-advance/justice-league-chronicles", "publisher": "Midway", "release_date": "Nov 12 2003", "developers": ["Full-Fat"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/695dfd3338c55f5318df9cc054837dfc-98.jpg", "descriptions": "In Justice League: Chronicles, it's up to the greatest superheroes of all time to save the world from danger.  Super villains have unleashed a triple threat for global domination and the Justice League must join forces to combat the evil menace.  You'll take control of your favorite DCIn Justice League: Chronicles, it's up to the greatest superheroes of all time to save the world from danger.  Super villains have unleashed a triple threat for global domination and the Justice League must join forces to combat the evil menace.  You'll take control of your favorite DC Comics Super Heroes including Batman, Superman, The Flash, Wonder Woman, Green Lantern, Hawkgirl, and Martian Manhunter, using each character's superpowers, skills, and special weapons to battle the combined forces of their greatest foes.  … Expand"}, {"name": "Ice Age: Continental Drift - Arctic Games", "details_link": "https://www.metacritic.com/game/xbox-360/ice-age-continental-drift---arctic-games", "publisher": "Activision", "release_date": "Jul 10 2012", "developers": ["Activision"], "platforms": ["3DS", "PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 43, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/05d37a25f5c988f1751fc968bbbbee7b-98.jpg", "descriptions": "When their island is set adrift in the midst of continental upheaval, Manny and the herd encounter a ragtag menagerie of seafaring pirates with a secret treasure.  Having trouble deciding on how to split the treasure evenly, they collectively decide to settle the problem through a series ofWhen their island is set adrift in the midst of continental upheaval, Manny and the herd encounter a ragtag menagerie of seafaring pirates with a secret treasure.  Having trouble deciding on how to split the treasure evenly, they collectively decide to settle the problem through a series of off-the-wall sporting events including ski jumping, ice smashing, and glacial hopping.  Ultimately, the winner of the most events will be entitled to the prize.  As the prehistoric games begin, players must side with Manny and the herd, or the seafaring pirates to determine the fate of the riches.… Expand"}, {"name": "Naughty Bear", "details_link": "https://www.metacritic.com/game/xbox-360/naughty-bear", "publisher": "505 Games", "release_date": "Jun 25 2010", "developers": ["Artificial Mind and Movement"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General"], "meta_score": 43, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/8aca7afa97f2c9166369293ce0b42ac7-98.jpg", "descriptions": "Naughty Bear tells the tale of one demented teddy bear's ruthless efforts to torment and harass the inhabitants of the Island of Perfection."}, {"name": "Deadfall Adventures", "details_link": "https://www.metacritic.com/game/xbox-360/deadfall-adventures", "publisher": "Nordic Games Publishing", "release_date": "Nov 15 2013", "developers": ["The Farm 51"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 43, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/65cf0f0b684f0ca31ba6a0c6b637a770-98.jpg", "descriptions": "Deadfall Adventures takes the classic adventure genre and combines it with fast paced action associated with First Person Shooters. Set in exotic locations such as ancient Mayan ruins, forbiden cities, frozen wastelands and lush, tropical jungles - Deadfall Adventures takes the player on aDeadfall Adventures takes the classic adventure genre and combines it with fast paced action associated with First Person Shooters. Set in exotic locations such as ancient Mayan ruins, forbiden cities, frozen wastelands and lush, tropical jungles - Deadfall Adventures takes the player on a whirlwind adventure set in the late 1930's… Expand"}, {"name": "Furu Furu Park", "details_link": "https://www.metacritic.com/game/wii/furu-furu-park", "publisher": "Majesco Games", "release_date": "Jan 17 2008", "developers": ["Taito Corporation", "505 Games"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 43, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/ebe969444831fd647376d2f7d63058c1-98.jpg", "descriptions": "Furu Furu Park is a collection of 30 arcade-style games that take advantage of the Wii Remote’s range of motion to engage and entertain players of all skill levels and ages. Arkanoid: an arcade classic pitting paddle and ball against a wall of blocks; Pinch Hitter: step up to the plate andFuru Furu Park is a collection of 30 arcade-style games that take advantage of the Wii Remote’s range of motion to engage and entertain players of all skill levels and ages. Arkanoid: an arcade classic pitting paddle and ball against a wall of blocks; Pinch Hitter: step up to the plate and take a few swings with the Wii Remote; Bubble Bobble: hold the Wii Remote like an NES controller to burst all of the bubbles in this retro arcade puzzler; Safe Cracker: Memorize the combination then enter the code by tilting your Wii Remote left and right to crack the safe; Sonic Blastman 20XX: Clutch your Wii Remote and punch at the screen to destroy asteroids heading for earth; Super Karate: Execute offensive and defensive maneuvers with your Wii Remote to defeat your opponent. Players can also face off against a friend in three multiplayer modes: Free Battle, Panel Attack and Love Challenge where players will have to compete to win female affection. [Majesco]… Expand"}, {"name": "Battle: Los Angeles", "details_link": "https://www.metacritic.com/game/playstation-3/battle-los-angeles", "publisher": "Konami", "release_date": "Mar 22 2011", "developers": ["Saber Interactive"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 43, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/2/e7074a3ca569230a8b2dd3adc3062535-98.jpg", "descriptions": "Players will have the opportunity to relive the thrill of the movie as they assume the role of Corporal Lee Imlay and fight alongside characters from the film and defend the city of Los Angeles from attacks from unknown forces."}, {"name": "Rengoku: The Tower of Purgatory", "details_link": "https://www.metacritic.com/game/psp/rengoku-the-tower-of-purgatory", "publisher": "Konami", "release_date": "Apr 26 2005", "developers": ["Neverland"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 43, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/0197945b158d8f05e1fd12e8168d1064-98.jpg", "descriptions": "Rengoku: The Tower of Purgatory is a third-person action game that places players in a dark and distant future. Modeled in a compelling blend of Eastern and Western sci-fi/fantasy, Rengoku puts gamers in the role of a well-armed battle android that must fight its way to the pinnacle of aRengoku: The Tower of Purgatory is a third-person action game that places players in a dark and distant future. Modeled in a compelling blend of Eastern and Western sci-fi/fantasy, Rengoku puts gamers in the role of a well-armed battle android that must fight its way to the pinnacle of a great tower to confront a mysterious foe. Rengoku also features immense replay value thanks to the PSP handheld system's wireless multiplayer technology. Gamers can trade equipment and items with other players or battle up to three other opponents in the multiplayer mode. [Konami]… Expand"}, {"name": "WWE 2K20", "details_link": "https://www.metacritic.com/game/playstation-4/wwe-2k20", "publisher": "2K Games", "release_date": "Oct 22 2019", "developers": ["Visual Concepts"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 43, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/8/e11a661f3f94874e379307e2c557b32a-98.jpg", "descriptions": "For the first time ever in WWE 2K, play as both a male and female MyPLAYER in MyCAREER as you journey through the twists, turns and storylines on the path to WWE excellence - featuring cutscenes and voiceovers from your favorite Superstars."}, {"name": "Mindjack", "details_link": "https://www.metacritic.com/game/xbox-360/mindjack", "publisher": "Square Enix", "release_date": "Jan 18 2011", "developers": ["FeelPlus"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Modern", "Arcade"], "meta_score": 43, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/4/106caf160410e39dd6494beec115bce9-98.jpg", "descriptions": "With this unique action shooter set in 2031, Square Enix continues to expand its portfolio of video games across a wide variety of genres. Drawing upon the graphics and storytelling mastery of both Square Enix and feelplus, MINDJACK offers a distinctive experience that throws players into aWith this unique action shooter set in 2031, Square Enix continues to expand its portfolio of video games across a wide variety of genres. Drawing upon the graphics and storytelling mastery of both Square Enix and feelplus, MINDJACK offers a distinctive experience that throws players into a revolutionary playing field where an engaging solo campaign transitions seamlessly to thrilling, cooperative multiplayer gameplay.… Expand"}, {"name": "Enki", "details_link": "https://www.metacritic.com/game/pc/enki", "publisher": "Soedesco", "release_date": "Jul 31 2015", "developers": ["Storm in a Teacup"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 43, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/5/bd944c7f349e12a8e5af231f08838bc5-98.jpg", "descriptions": "ENKI is a repeatable horror experience about escape. With multiple endings and an extensive randomization system that promises that every playthrough will always be different from the previous one, whether you as a player succeeded in escaping or not."}, {"name": "The Legend of Alon D'ar", "details_link": "https://www.metacritic.com/game/playstation-2/the-legend-of-alon-dar", "publisher": "Ubisoft", "release_date": "Dec  4 2001", "developers": ["Stormfront Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 43, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/382d0819037f02f85a6859daf48c6411-98.jpg", "descriptions": "A cataclysmic evil is tearing the magical world of Chandar in two. Control a young warrior and assemble a party of heroes, engaging in desperate battle and labyrinthine mystery as you explore this shattered realm. Discover the dark mysteries of the past and become the savior of a world soA cataclysmic evil is tearing the magical world of Chandar in two. Control a young warrior and assemble a party of heroes, engaging in desperate battle and labyrinthine mystery as you explore this shattered realm. Discover the dark mysteries of the past and become the savior of a world so big, the adventure is boundless... [Ubi Soft]… Expand"}, {"name": "Jeremy McGrath Supercross 2000", "details_link": "https://www.metacritic.com/game/dreamcast/jeremy-mcgrath-supercross-2000", "publisher": "Acclaim", "release_date": "Sep 29 1999", "developers": ["Acclaim"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 43, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/b5ae0c149b234678699934011e467363-98.jpg", "descriptions": "Race as or against 11-time Supercross Champ Jeremy McGrath and other superstar riders including Button, pastrana, Windham, Tortelli, Dowd, Ramsey and Albertyn!"}, {"name": "Venetica", "details_link": "https://www.metacritic.com/game/xbox-360/venetica", "publisher": "Atari", "release_date": "Jan 11 2011", "developers": ["Deck 13"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Third-Person", "Third-Person", "General"], "meta_score": 42, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/d1712611d76f8959730ef6a71d71a88b-98.jpg", "descriptions": "Take on the roll of Scarlett as you develop and use her powers to save her father and curse the necromancer."}, {"name": "One Piece: Romance Dawn", "details_link": "https://www.metacritic.com/game/3ds/one-piece-romance-dawn", "publisher": "Namco Bandai Games", "release_date": "Feb 11 2014", "developers": ["Three Rings", "Bandai Namco Games"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 42, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/649e6e601bc57705f3c49b04d6891809-98.jpg", "descriptions": "In ONE PIECE: ROMANCE DAWN, eager fans will have the opportunity to live all of ONE PIECE epic battles against the most famous bosses such as Buggy, Arlong, Crocodile, Rob Lucci and much more. This new game opens doors to sail through the amazingly 3D drawn ONE PIECE world with Luffy, Zoro,In ONE PIECE: ROMANCE DAWN, eager fans will have the opportunity to live all of ONE PIECE epic battles against the most famous bosses such as Buggy, Arlong, Crocodile, Rob Lucci and much more. This new game opens doors to sail through the amazingly 3D drawn ONE PIECE world with Luffy, Zoro, Sanji, Nami and other nakama, and run through famous stages such as Baratie, Arlong Park and more.… Expand"}, {"name": "Game Tycoon", "details_link": "https://www.metacritic.com/game/pc/game-tycoon", "publisher": "Tri Synergy", "release_date": "Mar 22 2006", "developers": ["Tri Synergy"], "platforms": "PC", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 42, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/7/5cca82dc71bf51cf3d6401c956b88a22-98.jpg", "descriptions": "Game Tycoon welcomes you to the ground floor of a massive new industry. It's 1982 and you & some friends are discovering the wonders of the personal computer. When you realize the potential for creating a new kind of game for them - \"video games\" - you decide to start a new businessGame Tycoon welcomes you to the ground floor of a massive new industry. It's 1982 and you & some friends are discovering the wonders of the personal computer. When you realize the potential for creating a new kind of game for them - \"video games\" - you decide to start a new business dedicated to it. You picked the right time -- the gaming revolution is about to begin. Can you become the biggest player in the industry, or will your little company fade out and disappear?… Expand"}, {"name": "Iron Man", "details_link": "https://www.metacritic.com/game/playstation-3/iron-man", "publisher": "Sega", "release_date": "May  2 2008", "developers": ["Secret Level"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 42, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/3b8eae9d4cdf6d6c910d62284aaa439d-98.jpg", "descriptions": "Iron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in IronIron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in Iron Man's suits of armour, gamers can take advantage of the wide array of high-impact weapons to strategically annihilate any enemy force standing in their way. Before tackling stunning and immense open battlefields, players can customise their armour suit as they encounter progressively more vicious enemies, and fight in epic battles that could challenge even the toughest Super Heroes. [Sega]… Expand"}, {"name": "Ghostbusters: Sanctum of Slime", "details_link": "https://www.metacritic.com/game/playstation-3/ghostbusters-sanctum-of-slime", "publisher": "Atari", "release_date": "Mar 22 2011", "developers": ["Behavior Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Modern", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 42, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/6/f3ab4c02a1e3119f21ff1c05c7a81c79-98.jpg", "descriptions": "Sanctum of Slime is a top-down action adventure following the star of 2009's Ghostbusters revamp."}, {"name": "Stormrise", "details_link": "https://www.metacritic.com/game/pc/stormrise", "publisher": "Sega", "release_date": "Mar 24 2009", "developers": ["Creative Assembly"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 42, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/2644ef9b7fa4e27e7ec972100a9cde7e-98.jpg", "descriptions": "Stormrise offers fans of the classic RTS genre an immersive and dramatic twist while challenging the conscience of the gamer. Experience the heat of the battlefield by leading your troops from the front line, instead of the traditional way of controlling the units from a detached view point.Stormrise offers fans of the classic RTS genre an immersive and dramatic twist while challenging the conscience of the gamer. Experience the heat of the battlefield by leading your troops from the front line, instead of the traditional way of controlling the units from a detached view point. Stormrise also allows units to be commanded in the air, across rooftops, on the earth's surface and even underground, this unique idea of \"verticality\" introduces multiple layers of gameplay that must be mastered for strategic advantage. The experience is heightened by a simple yet effective control system tailored specifically for consoles, which allows easy unit selection, rapid navigation and precise deployment. Set on a bleak and barren earth, devastated by a catastrophic event centuries ago, Stormrise sees the Echelon and the Sai battling to survive in a hostile and uninhabitable wasteland. Remnants of a superior technological people the Echelon survived the event through self-educed hibernation, while the Sai, a more tribal faction, still exist having learned to adapt to their surroundings and the new environment. Having evolved in vastly different ways, the differences between the two factions have spurred much animosity and hatred between the two races and the future of the planet is now hanging by a thread. [Sega]… Expand"}, {"name": "Star Trek The Video Game", "details_link": "https://www.metacritic.com/game/xbox-360/star-trek-the-video-game", "publisher": "Namco Bandai Games America", "release_date": "Apr 23 2013", "developers": ["Digital Extremes"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 42, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/9/5dcea0abb97b2c78298516a33048462c-98.jpg", "descriptions": "Players have the opportunity to play as two of the greatest science-fiction heroes ever -- Kirk and Spock – in STAR TREK, an original co-op experience that expands the Star Trek universe. Set in the 23rd Century world of the Star Trek reboot, this cover-based shooter immerses players in anPlayers have the opportunity to play as two of the greatest science-fiction heroes ever -- Kirk and Spock – in STAR TREK, an original co-op experience that expands the Star Trek universe. Set in the 23rd Century world of the Star Trek reboot, this cover-based shooter immerses players in an original story and action-packed combat.… Expand"}, {"name": "Touhou Kobuto V: Burst Battle", "details_link": "https://www.metacritic.com/game/playstation-4/touhou-kobuto-v-burst-battle", "publisher": "NIS America", "release_date": "Oct 10 2017", "developers": ["CUBETYPE"], "platforms": ["PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 42, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/1/068c39765429d7ba766eedfb608d561e-98.jpg", "descriptions": "Touhou Kobuto V: Burst Battle is a bullet-hell battle game that takes place in the Touhou universe. Take control of one of nine Touhou characters and eliminate your opponent using bullet-hell patterns, melee attacks, or spell cards! Featuring ear-tingling beats for each character, you mightTouhou Kobuto V: Burst Battle is a bullet-hell battle game that takes place in the Touhou universe. Take control of one of nine Touhou characters and eliminate your opponent using bullet-hell patterns, melee attacks, or spell cards! Featuring ear-tingling beats for each character, you might just find yourself dancing while you play!… Expand"}, {"name": "Mission: Impossible: Operation Surma", "details_link": "https://www.metacritic.com/game/game-boy-advance/mission-impossible-operation-surma", "publisher": "Atari", "release_date": "Dec  2 2003", "developers": ["M4 Limited"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 42, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/c4d78cc223f84dc7bf9b6f016c4063de-98.jpg", "descriptions": "Your mission, should you choose to accept it, is to save the free world from certain doom.  Ethan Hunt is back in Mission: Impossible Operation Surma, a stealth action adventure featuring an incredible arsenal of the latest weaponry, hi-tech gadgets, and mind-blowing disguises.  Ethan andYour mission, should you choose to accept it, is to save the free world from certain doom.  Ethan Hunt is back in Mission: Impossible Operation Surma, a stealth action adventure featuring an incredible arsenal of the latest weaponry, hi-tech gadgets, and mind-blowing disguises.  Ethan and his IMF team travel to exotic international locations in an effort to thwart the Surma Corporation's diabolical plans for global domination.  Throughout your mission, you'll be called upon to use your brains and brawn to get the job done.  … Expand"}, {"name": "Dino Island", "details_link": "https://www.metacritic.com/game/pc/dino-island", "publisher": "Strategy First", "release_date": "Aug 24 2002", "developers": ["Monte Cristo Multimedia", "Monte Cristo"], "platforms": "PC", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 42, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/5b1f79e3cf225564d9ca60ded41e9a2f-98.jpg", "descriptions": "This is one theme park that will never be extinct, letting you mix and match a kind-hearted stegosaurus with a terrifying T-Rex, give him horns and some teeth, and create a custom-made Dino Island resident. But be careful! One or two dinosaurs and a couple of rides don't necessarily meanThis is one theme park that will never be extinct, letting you mix and match a kind-hearted stegosaurus with a terrifying T-Rex, give him horns and some teeth, and create a custom-made Dino Island resident. But be careful! One or two dinosaurs and a couple of rides don't necessarily mean colossal success. You have to manage the entire park, building and maintaining the dino enclosures, feeding them, and ensuring they are safe and comfortable. You also need to make sure your visitors are getting their money's worth, offering food, shelter and plenty of rest areas and finally, you have to take control of all the details, overseeing the budgets, planning the shows and making sure your restaurants and gift shops are frequent shopping stops. It's up to you to keep the crowds coming in... and the dinosaurs happy! [Strategy First]… Expand"}, {"name": "Jazz and Faust", "details_link": "https://www.metacritic.com/game/pc/jazz-and-faust", "publisher": "1C", "release_date": "Jun 13 2002", "developers": ["Saturn+"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "First-Person", "Modern"], "meta_score": 42, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/e875a24908f0576f140bb9991e374834-98.jpg", "descriptions": "An epic adventure game where players assume the role of either sea captain Faust or smuggler Jazz and embark on a quest for lost treasure and riches in a beautifully rendered Ancient Eastern environment. Traveling through three picturesque worlds, players communicate with the various 3DAn epic adventure game where players assume the role of either sea captain Faust or smuggler Jazz and embark on a quest for lost treasure and riches in a beautifully rendered Ancient Eastern environment. Traveling through three picturesque worlds, players communicate with the various 3D inhabitants, thus revealing the game's story, objectives, quests and puzzles. In each of the three worlds, many marvelously rendered scenes give the feeling of playing inside a living painting, creating a rich and impressive world for players to enjoy. [1C]… Expand"}, {"name": "The Sopranos: Road to Respect", "details_link": "https://www.metacritic.com/game/playstation-2/the-sopranos-road-to-respect", "publisher": "THQ", "release_date": "Nov  7 2006", "developers": ["7 Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 42, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/3e3a51562d3ee6ce099d89b1f5684ae2-98.jpg", "descriptions": "A mob war is brewing as Philadelphia's and New Jersey's most powerful families are about to collide. As the illegitimate son of \"Big Pussy,\" the gamer has been born into the organization and is now being given an opportunity to demonstrate loyalty to Tony Soprano. As a soldier, players mustA mob war is brewing as Philadelphia's and New Jersey's most powerful families are about to collide. As the illegitimate son of \"Big Pussy,\" the gamer has been born into the organization and is now being given an opportunity to demonstrate loyalty to Tony Soprano. As a soldier, players must earn money on collections, protect turf through intimidation and gain admiration within their own family to move up in the ranks of the organization. Carry out orders from Paulie, Silvio, Christopher and Tony in familiar locations such as the Bada Bing!, Nuovo Vesuvio's and Satriale's.  The storyline was created in collaboration with show creator David Chase, and the show's key cast members provide the voices. [THQ]… Expand"}, {"name": "Final Fight: Streetwise", "details_link": "https://www.metacritic.com/game/xbox/final-fight-streetwise", "publisher": "Capcom", "release_date": "Feb 28 2006", "developers": ["Secret Level"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 42, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/732a26c4d93b57e59b1ff3bfa03f806f-98.jpg", "descriptions": "The long-running Final Fight series returns for another go with Final Fight: Streetwise. You can play as Kyle, the brother of Cody from the original series. When you find that Cody is in trouble, you must roam the streets of Metro City until the mystery is solved. Final Fight: Streetwise isThe long-running Final Fight series returns for another go with Final Fight: Streetwise. You can play as Kyle, the brother of Cody from the original series. When you find that Cody is in trouble, you must roam the streets of Metro City until the mystery is solved. Final Fight: Streetwise is a third-person game that stays true to its beat-'em-up roots but adds light role-playing elements and minigames to the fray as well. A respect system has been added so that your decisions affect how characters in the world react and relate to you.… Expand"}, {"name": "G.I. Joe: The Rise of Cobra", "details_link": "https://www.metacritic.com/game/xbox-360/gi-joe-the-rise-of-cobra", "publisher": "Electronic Arts", "release_date": "Aug  4 2009", "developers": ["Double Helix Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 42, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/17df19903eb19228030d2a40918a6bac-98.jpg", "descriptions": "As COBRA unleashes its deadliest plot yet, the G.I. JOE Team is counting on you and your hand-picked team of heroes to lead the counterattack. Every mission is critical and so is every G.I. JOE character. Picking up where the Paramount Pictures live action film leaves off, G.I. JOE The RiseAs COBRA unleashes its deadliest plot yet, the G.I. JOE Team is counting on you and your hand-picked team of heroes to lead the counterattack. Every mission is critical and so is every G.I. JOE character. Picking up where the Paramount Pictures live action film leaves off, G.I. JOE The Rise of Cobra is an accessible third person action-arcade shooter that allows players to recreate and relive the greatest moments from the film, cartoon series and action toy line. Exclusive all-new storyline that picks up where the film ends and is inspired by 45 years of rich G.I.JOE history. Two player co-op lets players choose an elite team and call in support from other G.I. JOE characters. Choose from 16 playable characters (four of which are unlockable COBRA characters) - each with a unique set of abilities and weapons. G.I. JOE characters include Snake Eyes, Duke, Heavy Duty, Ripcord, Scarlett, Shipwreck and Gung Ho. Storm Shadow has been revealed as an unlockable playable COBRA character. Characters are classified into one of three units: Commandos who do well at close range, Heavys who possess extraordinary shooting skills but do it best from a distance and Combat Soldiers who are a balance between the two. Gear up with the latest in high-tech gadgets like the film-inspired Accelerator Suit which makes you invincible and gives you short bursts of additional fire power. Drivable G.I. JOE and COBRA vehicles designed for two-player co-op. Three difficulty levels - appealing to players of all ages and skill levels (Casual, Advanced and Hardcore). 20 levels - each with 3-5 areas to explore - across four environments. 75 file cards and various intelligence items hidden throughout the game which can be used to unlock additional playable characters, special missions, 4 PSAs and other bonus content. [Electronic Arts]… Expand"}, {"name": "Fear Effect Sedna", "details_link": "https://www.metacritic.com/game/pc/fear-effect-sedna", "publisher": "Square Enix", "release_date": "Mar  6 2018", "developers": ["Sushee"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 42, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/0c0406e740fc24b270e1a84393d86d43-98.jpg", "descriptions": "Be part of a new Fear Effect adventure with Fear Effect Sedna, a new game in the classic series made popular on the original PlayStation console. With a whole new story, and shifting to a pausable real-time tactical action style, players will be able to control the team strategically andBe part of a new Fear Effect adventure with Fear Effect Sedna, a new game in the classic series made popular on the original PlayStation console. With a whole new story, and shifting to a pausable real-time tactical action style, players will be able to control the team strategically and tackle enemies and puzzles alike.\r Fear Effect Sedna is set four years after the events of the original Fear Effect game, and things have changed for the team. Hana, freed from the Triad, lives with Rain in Hong Kong and works as an occasional mercenary, while Deke has grown apart from them since Glas returned to the US.\r Hana accepts a small mission for a shadowy organization asking for her services. Her target: a mysterious ancient statuette held by the Chinese ambassador in France. She sees it as a good opportunity to visit her birthplace... But this 'easy' mission is about to lead Hana to something way bigger than she expected.\r Meanwhile Glas is approached by a client who catches his attention enough that he soon sets out for Greenland.\r How will these events bring the old team back together?\r Fear Effect Sedna is dedicated to recreating the atmosphere and characters from the original Fear Effect. However, while there are familiar aspects of the game to previous incarnations of the franchise, you'll find yourself immersed in a completely unique and new world with Fear Effect Sedna - one that will appeal to fans both old and new. \r\rFeatures:\r *    New environments in isometric view: Explore the deep caves of Greenland, abandoned scientific complexes, underwater stations and ethereal realms based on Inuit mythology.\r*    A real-time tactical action game: Exploit your heroes' special abilities and combine them to maximize your team's effectiveness in attacks.\r*    A deep and mature story: Learn more about Fear Effect's iconic characters' past as they delve into this new mystery.\r*    Explore a whole new culture: Myths from the Inuit people are imbued with power of the elements and the cold sea. Meet and fight unexpected creatures from the spirit realm!… Expand"}, {"name": "Block Factory", "details_link": "https://www.metacritic.com/game/3ds/block-factory", "publisher": "Enjoy Gaming", "release_date": "Apr 26 2012", "developers": ["Enjoy Gaming"], "platforms": "3DS", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 42, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/3/a7a4e1ffdb1ed3cfbe901532e578a7a5-98.jpg", "descriptions": "Welcome to Block Factory! Block Factory is the place where Falling Block Puzzle Games are created. The game starts in the main hub. From this main hub you can play the four predefined games or any other games you create or acquire. The aim of the games is to avoid filling the playfield tillWelcome to Block Factory! Block Factory is the place where Falling Block Puzzle Games are created. The game starts in the main hub. From this main hub you can play the four predefined games or any other games you create or acquire. The aim of the games is to avoid filling the playfield till the top. When a block hits the top of the playfield, the game will be over. Sharing and importing games permits unlocking of locked backgrounds and block types.… Expand"}, {"name": "Time and Eternity", "details_link": "https://www.metacritic.com/game/playstation-3/time-and-eternity", "publisher": "NIS America", "release_date": "Jul 16 2013", "developers": ["Image Epoch", "Imageepoch"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 42, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/6eede37ba04771bf144626cdb85d689b-98.jpg", "descriptions": "Kamza, a vibrant kingdom located on a lush ocean island, is in the midst of a national event celebrating the upcoming marriage of their princess to a valiant knight. But when a group of assassins appears during the ceremony, this dream come true transforms into their worst nightmare. As theKamza, a vibrant kingdom located on a lush ocean island, is in the midst of a national event celebrating the upcoming marriage of their princess to a valiant knight. But when a group of assassins appears during the ceremony, this dream come true transforms into their worst nightmare. As the knight lays mortally wounded, the princess reveals her longhidden secret - there is a second soul living within her, and together they control the power to travel through time. But can they act quickly enough to reverse the course of history and find out what happened that fateful day? Only time will tell...… Expand"}, {"name": "The Elder Scrolls: Blades", "details_link": "https://www.metacritic.com/game/switch/the-elder-scrolls-blades", "publisher": "Bethesda Softworks", "release_date": "May 14 2020", "developers": ["Bethesda Game Studios"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 42, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/3/cf950d8c1d0a5afeb2b5db84b87eeb13-98.jpg", "descriptions": "A classic dungeon crawler reimagined.\r • Experience dungeon adventures.\r\n• Create and customize your city, restoring it to greatness.\r\n• Conquer your rivals in epic one-on-one Arena battles.\r\n• Create any character you want and discover unique weapons, armor, and abilities.\r\n• Master theA classic dungeon crawler reimagined.\r • Experience dungeon adventures.\r• Create and customize your city, restoring it to greatness.\r• Conquer your rivals in epic one-on-one Arena battles.\r• Create any character you want and discover unique weapons, armor, and abilities.\r• Master the never-ending Abyss with a cutting-edge combat system.\r The Elder Scrolls: Blades enables cross-play so you can battle your friends on other platforms. You can also use cross-save to maintain your progression across multiple devices.\rStart a new character, or continue your previous journey, today.… Expand"}, {"name": "MC Groovz Dance Craze", "details_link": "https://www.metacritic.com/game/gamecube/mc-groovz-dance-craze", "publisher": "Mad Catz", "release_date": "Nov 22 2004", "developers": ["Mad Catz"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 42, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/27fa3c40f9c7e120e0e80b38121aa07a-98.jpg", "descriptions": "This game lets you show off your dance moves on the included Mad Catz Beat Pad. Arrows passing across the screen indicate when and where you must step on the pad, but you'll need quick thinking and footwork to achieve success. Become a better dancer, exercise, or just show off your talent inThis game lets you show off your dance moves on the included Mad Catz Beat Pad. Arrows passing across the screen indicate when and where you must step on the pad, but you'll need quick thinking and footwork to achieve success. Become a better dancer, exercise, or just show off your talent in both single-player and multiplayer modes. MC Groovz Dance Craze features songs by a variety of artists, including Jessica Simpson, DJ Jazzy Jeff & the Fresh Prince, and KC and the Sunshine Band.… Expand"}, {"name": "Bloodforge", "details_link": "https://www.metacritic.com/game/xbox-360/bloodforge", "publisher": "Microsoft Game Studios", "release_date": "Apr 25 2012", "developers": ["Climax Group", "Climax Studios"], "platforms": "Xbox 360", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 42, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/70e32802e0847c8a040a3eeb8c174c1b-98.jpg", "descriptions": "Bloodforge is a dark and brutal action combat game set in an ancient Celtic world. The fate of the ruling gods will be decided at the hands of one man - our hero, Crom. With an empowering brutal combat system, stunning standout art style, driven by a deep and compelling story, BloodforgeBloodforge is a dark and brutal action combat game set in an ancient Celtic world. The fate of the ruling gods will be decided at the hands of one man - our hero, Crom. With an empowering brutal combat system, stunning standout art style, driven by a deep and compelling story, Bloodforge thrusts the player into a viciously dark world where Crom must fight his way through hordes of twisted servants and evil followers of the gods to seal his fate.… Expand"}, {"name": "Taxi Chaos", "details_link": "https://www.metacritic.com/game/playstation-4/taxi-chaos", "publisher": "GS2 Games", "release_date": "Feb 23 2021", "developers": ["Team6 Game Studios", "Lion Castle"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Racing", "Arcade", "Vehicle", "Automobile", "Civilian"], "meta_score": 42, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/d53232d48915065cfe5d202ecccf91e2-98.jpg", "descriptions": "Taxi Chaos  is a casual arcade racing game where you select one of a wide range of unlockable cabs, each of whom has different attributes: the strong muscle car, the superfast exotic supercar, the corner-drifting Japanese tuner, an American classic from the ‘60s and more: Taxi Mayhem hasTaxi Chaos  is a casual arcade racing game where you select one of a wide range of unlockable cabs, each of whom has different attributes: the strong muscle car, the superfast exotic supercar, the corner-drifting Japanese tuner, an American classic from the ‘60s and more: Taxi Mayhem has them all. Your goal is to try and earn big cab fares, by picking up any customers and dropping them off at their destination spots as fast as possible before you run out of time! However, beware: most customers are a little crazy.… Expand"}, {"name": "ArchLord", "details_link": "https://www.metacritic.com/game/pc/archlord", "publisher": "Codemasters", "release_date": "Oct  3 2006", "developers": ["NHN Corporation"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 42, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/592200af3da919dd89b85695bda5e4c6-98.jpg", "descriptions": "ArchLord is the creation of NHN Games, one of the biggest Korean MMO developers and publishers. ArchLord delivers a unique competitive premise to MMO gamers: the opportunity to rise to become the game world’s supreme ruler. Every month, one player takes control of the world and with it theArchLord is the creation of NHN Games, one of the biggest Korean MMO developers and publishers. ArchLord delivers a unique competitive premise to MMO gamers: the opportunity to rise to become the game world’s supreme ruler. Every month, one player takes control of the world and with it the opportunity to wreak havoc on their cowering enemies as the player gains control of supreme global Archlord powers. The game's world, Kantra, is fantastically realised with stunning visuals, created using Renderware, and the game features incredibly atmospheric in-game audio recorded by the world famous London Symphony Orchestra. ArchLord also introduces one of the most advanced and complex PVP combat systems ever in any MMO, which utilises sprawling free battle areas and special guild battlefields that enables players to battle in fearsome guild versus guild battles. With an ever-evolving storyline of conquest and betrayal, ArchLord presents an epic adventure in which players band together as they quest for the ancient relics of the Archons. Each relic bestows incredible power on those who possess it and when relics are combined they deliver ultimate mastery over the fundamental forces of creation for there can only be one Archlord! [Codemasters]… Expand"}, {"name": "Contra: Rogue Corps", "details_link": "https://www.metacritic.com/game/switch/contra-rogue-corps", "publisher": "Konami", "release_date": "Sep 24 2019", "developers": ["Konami", "Toylogic Inc.", "Toylogic"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 42, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/5/a03e6256a93a07177de1efaa7e532456-98.jpg", "descriptions": "ROGUE CORPS, You know the Drill!CONTRA ROGUE CORPS is an over the top run and gun game with fast paced ultra-violent combat. Offering both single and multiplayer options, CONTRA ROGUE CORPS is an incredible gameplay experience alone or with your friends."}, {"name": "Nickelodeon Kart Racers", "details_link": "https://www.metacritic.com/game/playstation-4/nickelodeon-kart-racers", "publisher": "GameMill Entertainment", "release_date": "Oct 23 2018", "developers": ["Bamtang", "GameMill Entertainment"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 42, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/73064c0844e4735c68f791a5620b3605-98.jpg", "descriptions": "A new multi-player console racing game, Nickelodeon Kart Racers! Select a racer from one of your favorite Nickelodeon series, including SpongeBob, Patrick, and Sandy from SpongeBob SquarePants, Leonardo, Raphael, Michelangelo, and Donatello from Teenage Mutant Ninja Turtles, Arnold and HelgaA new multi-player console racing game, Nickelodeon Kart Racers! Select a racer from one of your favorite Nickelodeon series, including SpongeBob, Patrick, and Sandy from SpongeBob SquarePants, Leonardo, Raphael, Michelangelo, and Donatello from Teenage Mutant Ninja Turtles, Arnold and Helga from Hey Arnold!, & Angelica, Tommy and Reptar from Rugrats. Race your friends in up to 4-player local multiplayer or check out the Battle Arena for a variety of challenges.Features:* Choose a racer from 12 of the most iconic Nickelodeon series: SpongeBob SquarePants, Teenage Mutant Ninja Turtles, Hey Arnold!, Rugrats and MORE!!!* Race on 24 different Slimed-filled tracks including Bikini Bottom, NYC sewers, Tommy Pickle's house, Arnold's school and more!* Awesome Co-Op and Local Multi-Player for non-stop action the entire family will love!* Customizable Karts with multiple power-ups and special attacks!* Team-based co-op multiplayer, players can perform devastating fused attack for TONS of FUN!* Slime overload will have you turning you Karts into jet-ski racers!… Expand"}, {"name": "Coraline", "details_link": "https://www.metacritic.com/game/wii/coraline", "publisher": "D3Publisher", "release_date": "Jan 27 2009", "developers": ["Papaya Studios", "Papaya Studio"], "platforms": ["PlayStation 2", "Wii"], "genres": ["Adventure", "General", "General"], "meta_score": 42, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/d26b4bd38721a5e9793e27304ae0ce59-98.jpg", "descriptions": "The surrealistic adventure game with a moody atmosphere, you'll encounter engaging narrative and a cast of colorful characters. It features a young girl who discovers a mysterious door in her home that introduces her to an alternate reality. She must rely on her wit, perseverance and courageThe surrealistic adventure game with a moody atmosphere, you'll encounter engaging narrative and a cast of colorful characters. It features a young girl who discovers a mysterious door in her home that introduces her to an alternate reality. She must rely on her wit, perseverance and courage to find her way back home. Join her on her fantastical journey for a memorable adventure. Play as Coraline and interact with all of the colorful characters in this fantastical interactive adventure. Explore two distinct, fully interactive worlds like never before - the brooding Normal World and mesmerizing Other World. Graphic style and tone inspired by the amazing stop-motion animated film and the eerie storyline. Earn buttons as currency through unique and engaging mini-games. Collectible items galore: find unique outfits to customize Coraline's look, fill your scrapbook with photos, and unlock artwork and stills from the movie.… Expand"}, {"name": "Beyond the Law: The Third Wave", "details_link": "https://www.metacritic.com/game/pc/beyond-the-law-the-third-wave", "publisher": "Magnum Games", "release_date": "Apr  2 2004", "developers": ["Magnum Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 42, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/5/5d750c0ef38595e3a8cecf597b55a927-98.jpg", "descriptions": "Ruthless mobsters gather in New York City to orchestrate and initiate the first of three waves of crime and corruption designed to paralyze our nation. First they strike with bribery, blackmail and blood tinged corruption. Debts are recalled in the shadows of abandoned shipyards whileRuthless mobsters gather in New York City to orchestrate and initiate the first of three waves of crime and corruption designed to paralyze our nation. First they strike with bribery, blackmail and blood tinged corruption. Debts are recalled in the shadows of abandoned shipyards while unsuspecting citizens suddenly become victims of human trafficking. Using prostitution, money laundering and drug cartels the second wave is only a subtle prelude of what's to come. The most deadly of all, the Third Wave is the ultimate threat that could annihilate our Nation's capital. Our police force is under their control.  Intervention beyond the law is the only way to fight back to save our country.  As commander, you must choose from 50 members of an elite group of paramilitary specialists and lead them on a series of 20 missions. Deploy your squad and direct each of them independently.  Utilizing sniper, ballistic, tactical, and technical experts, you will operate in total secrecy to stop the mob dead in it's tracks. [Magnum Games]… Expand"}, {"name": "Clash of the Titans: The Videogame", "details_link": "https://www.metacritic.com/game/xbox-360/clash-of-the-titans-the-videogame", "publisher": "Namco Bandai Games", "release_date": "Jul 27 2010", "developers": ["Game Republic"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 42, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/6/0d4e83ebe2bf5942c24c044d01e01916-98.jpg", "descriptions": "Set in the timeless grandeur of Greek mythology, Clash of the Titans immerses players into the epic battle for dominance between the human race and the powerful gods Hades and Zeus. Through vast landscapes of swamps, mountains and the underworld, two modes of play let players embody Perseus’Set in the timeless grandeur of Greek mythology, Clash of the Titans immerses players into the epic battle for dominance between the human race and the powerful gods Hades and Zeus. Through vast landscapes of swamps, mountains and the underworld, two modes of play let players embody Perseus’ adventure from the film, or take on original new bosses in fresh, dynamic adaptations of one of the greatest mythological stories ever told. This action-adventure game play arms players with an ever-changing arsenal of weapons and powers. Players can journey solo or team up with friends to complete quests as they encounter a roster of legendary villains including Medusa and the sea monster known as The Kraken. [Namco Bandai Games]… Expand"}, {"name": "Brave: A Warrior's Tale", "details_link": "https://www.metacritic.com/game/xbox-360/brave-a-warriors-tale", "publisher": "Evolved Games", "release_date": "Aug  4 2009", "developers": ["Collision Studios"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Platformer", "General", "Historic", "3D"], "meta_score": 42, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/0f6bdb5c73a799a22635bc9f55c2c77d-98.jpg", "descriptions": "Brave: A Warrior’s Tale brings players expansive exploration and in-game interactivity on their quest to protect their tribe from the sources of evil, continuously offering a significant challenge to players as they advance through a world of untamed wilderness. Embracing his inner spirit,Brave: A Warrior’s Tale brings players expansive exploration and in-game interactivity on their quest to protect their tribe from the sources of evil, continuously offering a significant challenge to players as they advance through a world of untamed wilderness. Embracing his inner spirit, Brave is able to communicate as well as embody various animals and battle enemies that stand in his way. [SouthPeak Games]… Expand"}, {"name": "Gleamlight", "details_link": "https://www.metacritic.com/game/switch/gleamlight", "publisher": "D3Publisher", "release_date": "Aug 20 2020", "developers": ["DICO"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 42, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/8/b0270e2db35382c38b0a86288570b387-98.jpg", "descriptions": "This is a story of light - of Gleam, in a world of glass stained in darkness.\r Welcome to Gleamlight – a 2D action game that will take you through an adventure traversing a beautiful, transient world.\r\n\r\nImmerse yourself amid the beautiful stained glass artistry as you navigate without theThis is a story of light - of Gleam, in a world of glass stained in darkness.\r Welcome to Gleamlight – a 2D action game that will take you through an adventure traversing a beautiful, transient world.\r Immerse yourself amid the beautiful stained glass artistry as you navigate without the reliance of any standard game UI, while tracing the world’s mysterious unspoken story.\rWhat will you, as Gleam, sense and feel through your travels across this beautiful, yet fearsome world of glass?\r ◆A World Made of Glass\rThe world beautifully unfurls before you with lush trees, boulders of all sizes, and various paraphernalia, all in the form and shape of glass. Prepare to explore this fantastical world where light warms the glass and darkness stains it with bitter cold.\r ◆A Game Without UI\rThe game has been designed to immerse players into the world and story without being obstructed by any standard game UI, allowing players to organically enjoy the action and tension of defeating enemies and traversing the world.\r ◆An Unspoken Story\rThe story behind what happened in this world, and what is to come is up to you as the player. Discover and piece together the story through your adventure, and save this beautiful, transient world of glass.\r… Expand"}, {"name": "Zumba Fitness: Join the Party", "details_link": "https://www.metacritic.com/game/xbox-360/zumba-fitness-join-the-party", "publisher": "Majesco Games", "release_date": "Nov 18 2010", "developers": ["Pipeworks Software", "Inc."], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 42, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/b2a4329f600ff84fc39259eafdfef2f4-98.jpg", "descriptions": "Join the party with Zumba Fitness, a one-of-a-kind, dance fitness workout set to sexy, high-energy Latin and international music! Find your rhythm and let go as Zumba instructor fan favorites Gina Grant, Tanya Beardsley, and Zumba creator Beto guide you through 30 routines that will work youJoin the party with Zumba Fitness, a one-of-a-kind, dance fitness workout set to sexy, high-energy Latin and international music! Find your rhythm and let go as Zumba instructor fan favorites Gina Grant, Tanya Beardsley, and Zumba creator Beto guide you through 30 routines that will work you into a sweat and make you forget you're even exercising. Featuring exclusive music and choreography, Zumba Fitness for Kinect lets you see yourself on screen and naturally dance controller-free in an ultra fun interactive fitness party that's focused on the joy of movement!… Expand"}, {"name": "Turning Point: Fall of Liberty", "details_link": "https://www.metacritic.com/game/playstation-3/turning-point-fall-of-liberty", "publisher": "Codemasters", "release_date": "Feb 26 2008", "developers": ["Spark Unlimited"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 42, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/2/3123b6355f4e74ad43325b9a79e27952-98.jpg", "descriptions": "The game supposes that the incident in which a car struck Winston Churchill in New York on December 13th 1931 actually proved fatal – and that without his inspirational speeches to galvanise the Allies, the course of the Second World War took a very different route, with the Axis Powers evenThe game supposes that the incident in which a car struck Winston Churchill in New York on December 13th 1931 actually proved fatal – and that without his inspirational speeches to galvanise the Allies, the course of the Second World War took a very different route, with the Axis Powers even invading America.… Expand"}, {"name": "Family Party: 30 Great Games", "details_link": "https://www.metacritic.com/game/wii/family-party-30-great-games", "publisher": "The Game Factory", "release_date": "Dec  2 2008", "developers": ["Tamsoft"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 42, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/8/35cba259ab3f4b8a3150eb8b19af95bd-98.jpg", "descriptions": "Fun for kids of all ages, Family Party: 30 Great Games lets up to 4 players participate in wide variety of fun and addictive party games. It features everything from track and field, to playground games, to shooting games. Customized for the Wii Remote, it showcases the variety of gameplayFun for kids of all ages, Family Party: 30 Great Games lets up to 4 players participate in wide variety of fun and addictive party games. It features everything from track and field, to playground games, to shooting games. Customized for the Wii Remote, it showcases the variety of gameplay and madcap action possible on the Wii.… Expand"}, {"name": "SPRay", "details_link": "https://www.metacritic.com/game/wii/spray", "publisher": "Tecmo", "release_date": "Dec  3 2008", "developers": ["EKO Software"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 42, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/b863076a9a3ff63b5e02062d5c53a7a0-98.jpg", "descriptions": "Players soak in the action in SPRay by playing a spirited Prince named Ray who must save his village from a banished evil Queen who’s returned to capture and enslave the villagers. After donning a magic crown which summons two liquid spraying spirits, he sets out to defeat the evil Queen andPlayers soak in the action in SPRay by playing a spirited Prince named Ray who must save his village from a banished evil Queen who’s returned to capture and enslave the villagers. After donning a magic crown which summons two liquid spraying spirits, he sets out to defeat the evil Queen and her army of anti-matter soldiers. Skillfully use the \"angelic\" and \"wicked\" spirits to spray water, oil, goo, and other liquids on enemies and surfaces to solve puzzles and wipe out evil! Perform gravity-defying moves as you spray, stick, and slide your way through challenging puzzles. Creatively fight enemies by blasting various liquids on them and finishing them with a flurry of sword slashes. Use the Wii Remote and Nunchuk to take hold of Ray’s angelic and wicked spirits. Get together with friends to play crazy multiplayer games like \"Paint It!\" and \"Sticky Chewing Gum.\" [Tecmo]… Expand"}, {"name": "Werewolf: The Apocalypse - Earthblood", "details_link": "https://www.metacritic.com/game/playstation-4/werewolf-the-apocalypse---earthblood", "publisher": "Bigben Interactive", "release_date": "Feb  4 2021", "developers": ["Cyanide"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 42, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/2/d1d791274275627d66cb485345734a29-98.jpg", "descriptions": "A unique experience full of savage combat and mystical adventures, inspired by the famous role-playing game. You are Cahal, a powerful Garou who chose to go into exile after losing control of his destructive rage. On his quest for redemption and blood, Cahal plays a crucial role in the greatA unique experience full of savage combat and mystical adventures, inspired by the famous role-playing game. You are Cahal, a powerful Garou who chose to go into exile after losing control of his destructive rage. On his quest for redemption and blood, Cahal plays a crucial role in the great war between the Garous and Endron, a powerful oil company that serves the Wyrm, whose destruction is ravaging the planet.\rHe can transform into a wolf and a Crinos, a huge ferocious beast. Each form has its advantages: the wolf can sneak around undetected, Cahal as a human can interact with other people, and the Werewolf can unleash its rage to tear enemies apart.… Expand"}, {"name": "KURSK", "details_link": "https://www.metacritic.com/game/pc/kursk", "publisher": "Jujubee", "release_date": "Nov  7 2018", "developers": ["Jujubee", "Jujubee S.A."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "First-Person"], "meta_score": 42, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/0/8b99d7ef50883cd3d7cc8375441f08c7-98.jpg", "descriptions": "KURSK is the first ever adventure and documentary video game inspired by real events. You assume the role of a spy who finds way on the Russian nuclear submarine K-141 Kursk. Your task is to collect secret information about the revolutionary Shkval supercavitating torpedoes."}, {"name": "Hello Neighbor", "details_link": "https://www.metacritic.com/game/xbox-one/hello-neighbor", "publisher": "tinyBuild", "release_date": "Dec  8 2017", "developers": ["tinyBuild"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "First-Person"], "meta_score": 42, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/0a61c665510014a97ead922206fa3473-98.jpg", "descriptions": "Hello Neighbor is a stealth-horror game about breaking into your neighbor’s house. Play against an advanced AI that learns from your actions, and counters them. Find out what horrible secrets your neighbor is hiding inside his basement."}, {"name": "Steel Horizon", "details_link": "https://www.metacritic.com/game/ds/steel-horizon", "publisher": "Konami", "release_date": "Mar 20 2007", "developers": ["Climax Group", "Climax Studios"], "platforms": "DS", "num_players": "2  Online", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "General"], "meta_score": 42, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/e9850b1ac3afae04e7e4993c62074d05-98.jpg", "descriptions": "Steel Horizon delivers both turn-based and real-time strategy gameplay, offering players complete control of a naval armada outfitted with battleships, submarines, fighter planes and artillery. As the American captain of one of three super-secret navy vessels, the player fights the AxisSteel Horizon delivers both turn-based and real-time strategy gameplay, offering players complete control of a naval armada outfitted with battleships, submarines, fighter planes and artillery. As the American captain of one of three super-secret navy vessels, the player fights the Axis powers and a sinister organization operating in the shadows of the great powers in 20 compelling missions, in both the Atlantic and Pacific theatres. Build and command a powerful WW2 naval fleet, comprised of battleships, submarines, aircraft carriers and many other types of ships. Customize one of three unique flagships and decide how you want to play. Each weapon has its own effects, from the mighty 18\" main batteries of a battleship to a submarine's torpedos. Dynamic camera angles, damage states and impressive effects highlight the action. Combine the best of turn-based strategy and real-time action games: strategically position your fleets and engage in real-time 3D combat. Fight the Axis powers and a sinister organization operating in the shadows of the great powers in 20 compelling missions, in both the Atlantic and Pacific theatres. Challenge your friend wirelessly in a variety of multiplayer battles. [Konami]… Expand"}, {"name": "Stranger (2007)", "details_link": "https://www.metacritic.com/game/pc/stranger-2007", "publisher": "cdv Software", "release_date": "Mar 26 2008", "developers": ["Fireglow"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 42, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/6/4a3d752956c4ba7b25a6a99079a50e49-98.jpg", "descriptions": "Become a stranger in the magical world, lead armies of mysterious creatures, and fight for your immortal soul. Every fantasy world has its epic story; Stranger's is of no exception. But it is not just the usual conflict between light and darkness, there are much more nuances to explore.Become a stranger in the magical world, lead armies of mysterious creatures, and fight for your immortal soul. Every fantasy world has its epic story; Stranger's is of no exception. But it is not just the usual conflict between light and darkness, there are much more nuances to explore. Choose your side, gain experience to extend your abilities, unravel secrets of magic world, and crush your enemies either by skills or by using brute force, if you have any. Some of the best heroes are at your service, hordes of land and underground creatures want you to lead them to victory. Proper battle tactics and planning strategy, using of diplomacy, gaining benefits of trading, using of magic - all of these components will help you to win in just one case: you should find out what the goal is. [Fireglow]… Expand"}, {"name": "Rock Revolution", "details_link": "https://www.metacritic.com/game/playstation-3/rock-revolution", "publisher": "Konami", "release_date": "Oct 15 2008", "developers": ["Zoe Mode", "HB Studios Multimedia"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "6  Online", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 42, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/ca135d543c00d3e87e93ea6f19425655-98.jpg", "descriptions": "Release your inner rockstar or allow your friends the privilege of picking up guitar, bass, drums, and microphone peripherals to 40 rock and roll tracks. Online and offline multiplayer, versus, coop and band battle with rehearsal mode and career mode."}, {"name": "MX vs. ATV Supercross Encore", "details_link": "https://www.metacritic.com/game/playstation-4/mx-vs-atv-supercross-encore", "publisher": "CokeM Interactive", "release_date": "Oct 27 2015", "developers": ["Rainbow Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "General", "Arcade", "Automobile"], "meta_score": 42, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/366e4e4619cb10bd80caf8f81fc609c9-98.jpg", "descriptions": "Rip, jump and scrub your way to victory with over 35 tracks in this vastly extended version. Only the Encore edition features the brand new Rhythm Racing mode, extra outdoor Nationals tracks, and exclusive Waypoint races in open world maps."}, {"name": "CSI: Crime Scene Investigation: Fatal Conspiracy", "details_link": "https://www.metacritic.com/game/xbox-360/csi-crime-scene-investigation-fatal-conspiracy", "publisher": "Ubisoft", "release_date": "Oct 26 2010", "developers": ["Telltale Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 42, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/6dac472c25bba77ffb56ab7eee2e0d3d-98.jpg", "descriptions": "CSI: Fatal Conspiracy features five new connected cases written by the same writers from the television series CSI: Crime Scene Investigation. Players will experience an authentic crime-solving video game with real CSI characters, heart-pounding interrogations and enhanced graphics.  ACSI: Fatal Conspiracy features five new connected cases written by the same writers from the television series CSI: Crime Scene Investigation. Players will experience an authentic crime-solving video game with real CSI characters, heart-pounding interrogations and enhanced graphics.  A unique story structure that unveils the truth piece by piece brings a new level of suspense and intrigue to the top-selling franchise.… Expand"}, {"name": "Go! Sports Skydiving", "details_link": "https://www.metacritic.com/game/playstation-3/go!-sports-skydiving", "publisher": "SCEA", "release_date": "Feb  7 2008", "developers": ["Light Weight"], "platforms": "PlayStation 3", "num_players": "4  Online", "genres": ["Sports", "Alternative", "Individual", "Other", "Other"], "meta_score": 42, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/e2ffce395da0f34debe8c7712a3fd495-98.jpg", "descriptions": "[Downloadable Game]  Go! Sports Skydiving is a skydiving simulator that uses the SIXAXIS wireless controller to twist, turn and pull off tricks. The easy and intuitive motion control allows you to move through the skies into various skydiving team formations or solo tricks with the greatest[Downloadable Game]  Go! Sports Skydiving is a skydiving simulator that uses the SIXAXIS wireless controller to twist, turn and pull off tricks. The easy and intuitive motion control allows you to move through the skies into various skydiving team formations or solo tricks with the greatest of ease. Supports several single player modes, including formation, team match, landing and several online battle modes. Other online features include competing against other players in formation and team matches, as well a global ranking system for the formation and landing modes. Includes 4 offline modes, a license mode, and 2 online modes with up to 4 players. [SCEA]… Expand"}, {"name": "Prison Break: The Conspiracy", "details_link": "https://www.metacritic.com/game/playstation-3/prison-break-the-conspiracy", "publisher": "Deep Silver", "release_date": "Mar 30 2010", "developers": ["ZootFly"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 42, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/9/0dd0c3de7c5404473c18a3c1945bc03a-98.jpg", "descriptions": "Prison Break - The Conspiracy takes you inside the Prison Break world like never before. You are Tom Paxton, a Company agent sent inside Fox River Penitentiary to observe and report on a prisoner named Michael Scofield... What you will find will change your Prison Break experience forever.Prison Break - The Conspiracy takes you inside the Prison Break world like never before. You are Tom Paxton, a Company agent sent inside Fox River Penitentiary to observe and report on a prisoner named Michael Scofield... What you will find will change your Prison Break experience forever. [Deep Silver]… Expand"}, {"name": "Smashing Drive", "details_link": "https://www.metacritic.com/game/xbox/smashing-drive", "publisher": "Namco", "release_date": "May 13 2002", "developers": ["Namco"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 42, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/0e96ca6e33e9be3e553c1a7c3df114b6-98.jpg", "descriptions": "Good driving isn't enough!!! When lookin' for a little extra green, a cabbie relies on his knowledge of every neighborhood, streets, and alley shortcut. Navigating a serpentine course of oncoming traffic, cart vendors, newsstands, and pedestrians in order to beat the competing hack to theGood driving isn't enough!!! When lookin' for a little extra green, a cabbie relies on his knowledge of every neighborhood, streets, and alley shortcut. Navigating a serpentine course of oncoming traffic, cart vendors, newsstands, and pedestrians in order to beat the competing hack to the fare's final destination is the challenge. But we've got you covered. Get into the habit of collection power-ups and finding shortcuts or your only tip will be advice to invest in driving lessons.… Expand"}, {"name": "ATV: Quad Power Racing", "details_link": "https://www.metacritic.com/game/playstation/atv-quad-power-racing", "publisher": "Acclaim", "release_date": "Aug 23 2000", "developers": ["Climax Group"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 42, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/0/1dac6884d071c1d691dcab1db8b5904a-98.jpg", "descriptions": "Hit the dirt with the only quad racing game available! Power slide, roll over, crash and take on the competition in rough terrain with ATV: Quad Power Racing!"}, {"name": "TMNT", "details_link": "https://www.metacritic.com/game/ds/tmnt", "publisher": "Ubisoft", "release_date": "Mar 20 2007", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "Xbox 360", "DS"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 42, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/7/891625fe9ba8e8bed2b64b43912a420f-98.jpg", "descriptions": "Based on the all-new CGI TMNT movie, Ubisoft's TMNT video game takes place in New York City, a city plagued with fast-moving shadows and attacks from strange creatures. Could the wealthy and mysterious Max Winters be involved? New York City needs the Turtles now more than ever but they faceBased on the all-new CGI TMNT movie, Ubisoft's TMNT video game takes place in New York City, a city plagued with fast-moving shadows and attacks from strange creatures. Could the wealthy and mysterious Max Winters be involved? New York City needs the Turtles now more than ever but they face their most trying time both as heroes and as brothers. With the fate of the City and their family at stake, it's up to Leonardo with Zen Master Splinter to restore unity and ninja discipline to the Turtles. In this highly immersive experience, join the Ninja Turtles team and experience intense acrobatic navigation, collaborative combat and powerful fighting moves. Engage in over-the-top Ninja action to reunite the Turtles and save New York City. Leonardo, Raphael, Donatello and Michelangelo are playable, each with unique acrobatic moves, weapons and combat skills, such as Michelangelo’s fast nunchuk face slap and Raphael’s powerful Sai throw. [Ubisoft]… Expand"}, {"name": "Arcania: The Complete Tale", "details_link": "https://www.metacritic.com/game/playstation-3/arcania-the-complete-tale", "publisher": "Nordic Games Publishing", "release_date": "Aug 30 2013", "developers": ["Spellbound"], "platforms": ["PlayStation 4", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["PC-style RPG", "Western-Style", "Role-Playing", "General", "Action RPG"], "meta_score": 42, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/3c3b37efb022bf557c572abacc67615a-98.jpg", "descriptions": "The empire of Myrtana is in upheaval. The power-hungry king is on a mission to conquer the southern islands - no matter the cost. In these difficult times you find yourself in the middle of civil unrest and war - caused by a mysterious ancient power. In the add-on \"Fall of Setarrif\",The empire of Myrtana is in upheaval. The power-hungry king is on a mission to conquer the southern islands - no matter the cost. In these difficult times you find yourself in the middle of civil unrest and war - caused by a mysterious ancient power. In the add-on \"Fall of Setarrif\", Argaan's fate, once more, teeters on the edge of your sword. Face your destiny and make a path to Setarrif blocked by monsters, churning streams of lava, deadly dungeons and a frantic population in desperate need of help.… Expand"}, {"name": "Xiaolin Showdown", "details_link": "https://www.metacritic.com/game/playstation-2/xiaolin-showdown", "publisher": "Konami", "release_date": "Nov 14 2006", "developers": ["BottleRocket Entertainment"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 42, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/3278414149199c1908abdd0ee9da2055-98.jpg", "descriptions": "Lead a kung fu monk and his three martial arts warriors on an action packed quest to search and protect the Shen Gong Wu. Omi, a Kung Fu monk leads three young dragons-in-training on their globetrotting adventures to search and protect the Shen Gong Wu, mystical power objects that gives itsLead a kung fu monk and his three martial arts warriors on an action packed quest to search and protect the Shen Gong Wu. Omi, a Kung Fu monk leads three young dragons-in-training on their globetrotting adventures to search and protect the Shen Gong Wu, mystical power objects that gives its possessor super powers, from a band of villains led by Evil Boy Genius Jack Spicer, his army of robots and an ancient witch Wuya. They fight for the Shen Gong Wu one showdown at a time, where the universe transforms itself into a mystical, hyper-reality world. Our heroes have to rely on their superb martial arts skills, wits, and the mystical powers of the Shen Gong Wu to fight evil. Based on the WB Kids animated series players control 4 warriors, working closely to together to combine their mystical powers, as they advance on their quest. Find and collect Shen Wong Gu while progressing thru an environment filled with hazards, enemies, and collectables. Compete in \"Showdowns\" that transport your warriors and test your martial arts skills. Battle epic bosses in winner-take all arena style combat. Six playable characters with mystical kung-fu powers. [Konami]… Expand"}, {"name": "Tennis World Tour", "details_link": "https://www.metacritic.com/game/xbox-one/tennis-world-tour", "publisher": "Bigben Interactive", "release_date": "May 22 2018", "developers": ["Bigben Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 42, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/9/581e1c3acc2a68b61106f3db306b6f42-98.jpg", "descriptions": "The new standard developed by veterans of tennis simulations: play as one of 30 professional tennis players, learn all the shots, master each type of surface and experience a realistic career mode. Define your style of play and tactics to become n°1 in the world!"}]