[{"name": "Mutazione", "details_link": "https://www.metacritic.com/game/playstation-4/mutazione", "publisher": "Die Gute Fabrik", "release_date": "Sep 19 2019", "developers": ["Die Gute Fabrik"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/f87a7c271defb8eb23303b308bb3d40d-98.jpg", "descriptions": "A mutant soap opera where small-town gossip meets the supernatural. Join Kai as she arrives in the mysterious community of Mutazione to care for her ailing grandfather. Discover scenic hangouts, magical gardens, new friends, and old secrets… They can survive an apocalyptic meteor strike, butA mutant soap opera where small-town gossip meets the supernatural. Join Kai as she arrives in the mysterious community of Mutazione to care for her ailing grandfather. Discover scenic hangouts, magical gardens, new friends, and old secrets… They can survive an apocalyptic meteor strike, but can they survive their small-town drama?… Expand"}, {"name": "Friday the 13th: Killer Puzzle", "details_link": "https://www.metacritic.com/game/switch/friday-the-13th-killer-puzzle", "publisher": "Blue Wizard Digital", "release_date": "Oct 25 2018", "developers": ["Blue Wizard Digital"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/05974f11dd7d12cd6339aebee4ed2930-98.jpg", "descriptions": "Jason is Back in the Goriest. Puzzle Game Ever Made. Become horror icon Jason Voorhees and stalk campers across 150+ levels in the most gruesome puzzle game ever! Solve murderlicious puzzles to rank-up and unlock new weapons and special attacks. Help Jason terrorize victims from theJason is Back in the Goriest. Puzzle Game Ever Made. Become horror icon Jason Voorhees and stalk campers across 150+ levels in the most gruesome puzzle game ever! Solve murderlicious puzzles to rank-up and unlock new weapons and special attacks. Help Jason terrorize victims from the campgrounds of Crystal Lake to the high-rises of Manhattan, from supermax prisons to space stations... and beyond. Friday the 13th: Killer Puzzle is developed by the twisted minds behind the darkly hilarious indie hit SLAYAWAY CAMP. … Expand"}, {"name": "Life is Strange: Episode 4 - Dark Room", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-episode-4---dark-room", "publisher": "Square Enix", "release_date": "Jul 28 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/c0a545b3ba93f16fcddd77e2ff9757fc-98.jpg", "descriptions": "Darkroom follows the antics of series protagonist, Max, as she attempts to uncover the mystery behind the disappearance of Rachel Amber and get to the bottom of the bizarre happenings in Arcadia Bay. With the ‘End of the World’ party on the horizon, time is running out for Max to become theDarkroom follows the antics of series protagonist, Max, as she attempts to uncover the mystery behind the disappearance of Rachel Amber and get to the bottom of the bizarre happenings in Arcadia Bay. With the ‘End of the World’ party on the horizon, time is running out for Max to become the saviour of the town.… Expand"}, {"name": "Clustertruck", "details_link": "https://www.metacritic.com/game/pc/clustertruck", "publisher": "tinyBuild", "release_date": "Sep 27 2016", "developers": ["LandFall Games", "LandFall"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/912c37da017400aa516242c62c062cc6-98.jpg", "descriptions": "ClusterTruck is a chaotic physics based truckformer. Jump your way through insane levels in a game of \"the floor is lava\" on top of speeding trucks driven by terrible drivers."}, {"name": "Contra ReBirth", "details_link": "https://www.metacritic.com/game/wii/contra-rebirth", "publisher": "Konami", "release_date": "Sep  7 2009", "developers": ["M2"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Platformer", "Shooter", "Scrolling", "2D", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/291120fc404ee0d8a0e532fc9bfd9cac-98.jpg", "descriptions": "[WiiWare]  In Contra Rebirth, Chief Salamander and his Neo-Salamander Force travel back to 1973 AD to invade Earth. They land in Central America and take control of the Shizuoka ruins on the Yucatan Peninsula. There, the aliens plan the destruction of all the \"Contra\" on Earth. The Galactic[WiiWare]  In Contra Rebirth, Chief Salamander and his Neo-Salamander Force travel back to 1973 AD to invade Earth. They land in Central America and take control of the Shizuoka ruins on the Yucatan Peninsula. There, the aliens plan the destruction of all the \"Contra\" on Earth. The Galactic President calls on Lance Bean, a member of the elite \"Contra\" warriors to save the Earth, but his sudden disappearance jeopardizes the safety of the planet. Now, Bill Rizer and the samurai, Genbei Yagyu are the last hope for Earth and must pick up their weapons and defeat the evil Neo-Salamander Army before all is lost. Experience the fast paced action packed 2D side scrolling adventure that pioneered the Run'N Gun Genre. [Konami]… Expand"}, {"name": "FIFA World Cup: Germany 2006", "details_link": "https://www.metacritic.com/game/gamecube/fifa-world-cup-germany-2006", "publisher": "Electronic Arts", "release_date": "Apr 24 2006", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 76, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/faa60af30a7bfd480d15a4abbf8c814a-98.jpg", "descriptions": "2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA SPORTS has emulated close to 100 of the world's superstars, capturing their playing styles and individual likenesses. In addition to enabling gamers to participate in the 2006 FIFA World Cup Germany by taking control of one of 127 national teams, the game features new compelling modes of play, including the groundbreaking Global Challenge that tests even the most hardcore soccer fan by recreating classic moments in FIFA World Cup history. Furthermore, the game supports up to eight-way multiplayer matches and features a plethora of in-game unlockable content such as legendary players and exclusive apparel.… Expand"}, {"name": "Harvest Moon: Animal Parade", "details_link": "https://www.metacritic.com/game/wii/harvest-moon-animal-parade", "publisher": "Natsume", "release_date": "Nov 12 2009", "developers": ["Natsume", "Marvelous Entertainment"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Breeding/Constructing", "General", "Management", "Breeding/Constructing", "Business / Tycoon"], "meta_score": 76, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/48309de85b67f95084d57fc5b43e7a58-98.jpg", "descriptions": "In Harvest Moon: Animal Parade, the divine tree which once stood in the middle of the Harvest Goddess' pond is weakening, the creatures are beginning to leave the land, and the five bells have lost their power. The Harvest Goddess believes that only the strength of the Harvest King can helpIn Harvest Moon: Animal Parade, the divine tree which once stood in the middle of the Harvest Goddess' pond is weakening, the creatures are beginning to leave the land, and the five bells have lost their power. The Harvest Goddess believes that only the strength of the Harvest King can help revive the earth and bring the tree back to life. It's up to the player to help the Harvest Sprites ring the five mystical bells, summon the Harvest King, and revive the Harvest Goddess' tree and the land. Players find plenty of activities in Harvest Moon: Animal Parade, including cultivating crops and caring for wild and exotic animals such as penguins, pandas, and monkeys. Players can take their exotic animals out for walks, teach them tricks, and even ride some of them around town! When the circus rolls into town, players also need to help the ringmaster find the escaped animals. Befriend the lion, giraffe, and hippopotamus to save the show! The game also lets players take and share pictures over WiiConnect24. Players can take pictures of their farm, their family, or their village and show them off online. [Natsume]… Expand"}, {"name": "Ratchet & Clank Future: Quest for Booty", "details_link": "https://www.metacritic.com/game/playstation-3/ratchet-clank-future-quest-for-booty", "publisher": "SCEA", "release_date": "Aug 21 2008", "developers": ["Insomniac Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/56d3718eb51d6ba07ad22243aae204d1-98.jpg", "descriptions": "[Playstation Network]  The swashbuckling action in Ratchet & Clank Future: Quest for Booty begins one year following the intense ending in Ratchet & Clank Future: Tools of Destruction. Ratchet's desperate search for Clank resumes with a bang as he finds himself engulfed in ship-board combat[Playstation Network]  The swashbuckling action in Ratchet & Clank Future: Quest for Booty begins one year following the intense ending in Ratchet & Clank Future: Tools of Destruction. Ratchet's desperate search for Clank resumes with a bang as he finds himself engulfed in ship-board combat -- only to be cast adrift and washed up on the shores of a remote island on the planet Merdegraw. Our Lombax hero must overcome life-threatening challenges, encounter hostile new alien races and even form an allegiance with dreaded Captain Slag’s first mate, Rusty Pete. All in the pursuit of clues that lead Ratchet to the treasure of Captain Angstrom Darkwater, Slag's former commander and keeper of the only known link to the mysterious Zoni: the Fulcrum Star. Push, pull, and manipulate objects as you solve various puzzles using Ratchet's new wrench. New Light/Dark gameplay: Illuminate dark areas and use your wits to survive encounters with enemies that live in the dark. New Pirate Puzzles: Mix brew, manipulate shadows, and play tunes to find hidden booty. [SCEA]… Expand"}, {"name": "L.A. Noire", "details_link": "https://www.metacritic.com/game/playstation-4/la-noire", "publisher": "Rockstar Games", "release_date": "Nov 14 2017", "developers": ["Team Bondi"], "platforms": ["PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Third-Person"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/fdfbe577f8841c6f2ae8f780a76be294-98.jpg", "descriptions": "Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right,Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right, Phelps must unravel the truth behind a string of arson attacks, racketeering conspiracies and brutal murders, battling the L.A. underworld and even members of his own department to uncover a secret that could shake the city to its rotten core. Using groundbreaking new animation technology that captures every nuance of an actor's facial performance in astonishing detail, L.A. Noire is a violent crime thriller that blends breathtaking action with true detective work to deliver an unprecedented interactive experience. Search for clues, chase down suspects and interrogate witnesses as you struggle to find the truth in a city where everyone has something to hide.… Expand"}, {"name": "Resident Evil 5: Desperate Escape", "details_link": "https://www.metacritic.com/game/xbox-360/resident-evil-5-desperate-escape", "publisher": "Capcom", "release_date": "Mar  3 2010", "developers": ["Capcom"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/3cfcbaa4b608e47fc2720aa510ee1267-98.jpg", "descriptions": "[Xbox Live Arcade]  This is the second installment of new content for Resident Evil 5. After Jill Valentine is rescued by Chris Redfield, he leaves her to finish his mission. Find out how she made it out on her own, and what role Josh Stone played in her escape. This package also allows you[Xbox Live Arcade]  This is the second installment of new content for Resident Evil 5. After Jill Valentine is rescued by Chris Redfield, he leaves her to finish his mission. Find out how she made it out on her own, and what role Josh Stone played in her escape. This package also allows you to unlock two new characters in the all-new The Mercenaries Reunion. Play as one of the stars of Resident Evil 0, Rebecca Chambers, or take on the role of Delta Team's commander, Josh Stone. There are also additional figures available in Extra Figures to round out this action-packed package.… Expand"}, {"name": "Scarface: The World Is Yours", "details_link": "https://www.metacritic.com/game/xbox/scarface-the-world-is-yours", "publisher": "Vivendi Games", "release_date": "Oct  8 2006", "developers": ["Radical Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 76, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/3f45ca4c9cb102b6d4e719cb818d5b3f-98.jpg", "descriptions": "In a complex world filled with excess and greed, players can take the role of Tony Montana, one of the most ruthless gangsters ever depicted on film. Highly acclaimed screenwriter, David McKenna, has written an original event-driven storyline for the interactive game that leads the playerIn a complex world filled with excess and greed, players can take the role of Tony Montana, one of the most ruthless gangsters ever depicted on film. Highly acclaimed screenwriter, David McKenna, has written an original event-driven storyline for the interactive game that leads the player through a sordid underworld. The Scarface video game creates a gameplay environment that authentically recreates the historical time period of the film, touching on politics, news items and events of the day. Players travel through the steamy, often violent streets of Miami, the irie islands of the Florida Keys, the Bahamas and various other locales and interact with a world full of seedy and dangerous characters to procure information, negotiate business deals, smuggle contraband and avoid rivals and DEA on a mission to rebuild their fallen empire.… Expand"}, {"name": "Call of Duty: Modern Warfare - Reflex Edition", "details_link": "https://www.metacritic.com/game/wii/call-of-duty-modern-warfare---reflex-edition", "publisher": "Activision", "release_date": "Nov 10 2009", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "10  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/fe11e262dc4775ddf92bfd311aba924f-98.jpg", "descriptions": "Call of Duty: Modern Warfare - Reflex for Wii arms you with an arsenal of advanced and powerful weaponry and transports you to the most dangerous hotspots around the globe to take on a rogue enemy threatening the world. As both a U.S. Marine and British S.A.S soldier fighting through anCall of Duty: Modern Warfare - Reflex for Wii arms you with an arsenal of advanced and powerful weaponry and transports you to the most dangerous hotspots around the globe to take on a rogue enemy threatening the world. As both a U.S. Marine and British S.A.S soldier fighting through an unfolding story full of twists and turns, use sophisticated technology, superior firepower, and coordinated land and air strikes on a battlefield where speed, accuracy, and communication are essential to victory. Continue the fight online over the Nintendo Wi-Fi Connection for unrivaled multiplayer gameplay.… Expand"}, {"name": "Persona 5 Strikers", "details_link": "https://www.metacritic.com/game/pc/persona-5-strikers", "publisher": "Atlus", "release_date": "Feb 23 2021", "developers": ["Omega Force"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/5ecab99fb73fed832b23a8490a0afca9-98.jpg", "descriptions": "The sequel to the international smash-hit Persona 5 (3.2 million copies world-wide) is now available as the series' first action RPG! Featuring an all-new story set up half a year after the events of P5! \r\rTravel Japan! \rFollowing the events of P5, the Phantom Thieves of Hearts gatherThe sequel to the international smash-hit Persona 5 (3.2 million copies world-wide) is now available as the series' first action RPG! Featuring an all-new story set up half a year after the events of P5! \r\rTravel Japan! \rFollowing the events of P5, the Phantom Thieves of Hearts gather once more during their summer break to solve the mystery behind new change of heart cases that are occurring all over Japan! \r\rPersona 5 is now an action RPG!\rThe new action battle system makes hitting enemy weak points to activate a 1 More or All-Out Attack, which fans have come to love, even easier!\r You can even use Baton Pass to play as other characters!\rIn the newly introduced Jails, you can switch controls between characters at any time! Clear the game with style by using different characters in unique situations!\r \rNew character! \rWho is this new mysterious girl you meet in the Shibuya of the other world? Find out as she fights alongside you as the newest member of the Phantom Thieves of Hearts!… Expand"}, {"name": "Mafia: Definitive Edition", "details_link": "https://www.metacritic.com/game/playstation-4/mafia-definitive-edition", "publisher": "2K Games", "release_date": "Sep 25 2020", "developers": ["Hangar 13"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/3184592b1c1d78e923fffdfe4f813f7b-98.jpg", "descriptions": "Part one of the Mafia crime saga - 1930s, Lost Heaven, IL Re-made from the ground up, rise through the ranks of the Mafia during the Prohibition era of organized crime. After a run-in with the mob, cab driver Tommy Angelo is thrust into a deadly underworld. Initially uneasy about falling inPart one of the Mafia crime saga - 1930s, Lost Heaven, IL Re-made from the ground up, rise through the ranks of the Mafia during the Prohibition era of organized crime. After a run-in with the mob, cab driver Tommy Angelo is thrust into a deadly underworld. Initially uneasy about falling in with the Salieri crime family, Tommy soon finds that the rewards are too big to ignore.  Play a Mob Movie:\rLive the life of a Prohibition-era gangster and rise through the ranks of the Mafia.  \rLost Heaven, IL:\rRecreated 1930's cityscape, filled with interwar architecture, cars and culture to see, hear and interact with. \rRe-Made Classic:\rFaithfully recreated, with expanded story, gameplay and original score. This is the Mafia you remembered and much more.… Expand"}, {"name": "Axiom Verge 2", "details_link": "https://www.metacritic.com/game/switch/axiom-verge-2", "publisher": "Tom Happ", "release_date": "Aug 11 2021", "developers": ["Tom Happ"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/e5c3d661da3049cd67741fe8847dbbf6-98.jpg", "descriptions": "Life. Afterlife. Real. Virtual. Dream. Nightmare. It’s a thin line. It’s Axiom Verge 2. The sequel to Axiom Verge, Axiom Verge 2 expands on the universe with completely new characters, abilities, and gameplay."}, {"name": "Call of Duty: Black Ops II - Uprising", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops-ii---uprising", "publisher": "Activision", "release_date": "Apr 16 2013", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Arcade"], "meta_score": 76, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/61159b89f82bbd4f67d56fadce3f33ab-98.jpg", "descriptions": "The most anticipated game of the year and the most ambitious Call of Duty game ever, Call of Duty: Black Ops II is coming to Wii U. Launching this November 18th, Call of Duty: Black Ops II delivers the most groundbreaking and viscerally immersive Call of duty experience yet. Rooted inThe most anticipated game of the year and the most ambitious Call of Duty game ever, Call of Duty: Black Ops II is coming to Wii U. Launching this November 18th, Call of Duty: Black Ops II delivers the most groundbreaking and viscerally immersive Call of duty experience yet. Rooted in near-future fiction, the title propels players into a visual landscape in an epic single player campaign highlighted by branching storylines and non-linear missions; a re-imagined multiplayer that introduces players to some of the most cutting-edge weaponry and equipment that 2025 will have to offer; and punctuated with an all-new Zombies experience running in the multiplayer engine.… Expand"}, {"name": "Miasmata", "details_link": "https://www.metacritic.com/game/pc/miasmata", "publisher": "IonFX", "release_date": "Nov 28 2012", "developers": ["IonFX"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Sci-Fi"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/ff492c229d4433340700354d9b5dc638-98.jpg", "descriptions": "Miasmata is a first-person survival/adventure game, developed from the ground-up by brothers Joe and Bob Johnson. You play as Robert Hughes, a plague-stricken scientist on a journey to discover a cure. Your adventure begins on the shores of a remote and mysterious island."}, {"name": "Madden NFL 20", "details_link": "https://www.metacritic.com/game/playstation-4/madden-nfl-20", "publisher": "Electronic Arts", "release_date": "Jul 30 2019", "developers": ["Electronic Arts"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Sports", "General", "Team", "Football", "Sim"], "meta_score": 76, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/4/e581fadaae09a1cd92585729c5db98f8-98.jpg", "descriptions": "Take the journey of an NFL superstar. Create a college quarterback and dominate the College Football Playoff, then impress the scouts at the NFL Combine. Find out where your story begins at the NFL Draft, and then fight to prove you belong in the league. Last long enough and you just mightTake the journey of an NFL superstar. Create a college quarterback and dominate the College Football Playoff, then impress the scouts at the NFL Combine. Find out where your story begins at the NFL Draft, and then fight to prove you belong in the league. Last long enough and you just might leave a legacy and even play in a few Pro Bowls. This new and customizable career campaign is all about you, with personalized playable scenarios, events, and dynamic challenges. The choices you make early on will affect how your career pans out.… Expand"}, {"name": "Burnout Dominator", "details_link": "https://www.metacritic.com/game/playstation-2/burnout-dominator", "publisher": "Electronic Arts", "release_date": "Mar  6 2007", "developers": ["Criterion Games"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/a4f8ed7c773bc6a579b0966d77dd10b3-98.jpg", "descriptions": "Burnout Dominator is the next installment in the legendary Burnout series, loaded with intense racing action and dozens of retina-searing World Tour events. Burnout Dominator challenges gamers to face off against a series of hot-blooded rivals in brutal tests of aggressive driving techniquesBurnout Dominator is the next installment in the legendary Burnout series, loaded with intense racing action and dozens of retina-searing World Tour events. Burnout Dominator challenges gamers to face off against a series of hot-blooded rivals in brutal tests of aggressive driving techniques where performing burnouts gives you the advantage and multiplies your score potential. For the ultimate nerve-wracking experience, Burnout Dominator takes you to the very edge of control, punishing the smallest mistakes and rewarding drivers for taking outrageous risks. [Electronic Arts]… Expand"}, {"name": "Gun", "details_link": "https://www.metacritic.com/game/pc/gun", "publisher": "Activision", "release_date": "Nov  8 2005", "developers": ["Neversoft Entertainment", "Beenox"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/aad9119ee5ed9b1363a89b20f04650ac-98.jpg", "descriptions": "Set in the untamed West of the late-1800s, GUN is a free-roaming action-adventure game that takes players to a world without laws where greed, lust and murder are rampant. As Colton White, a vengeful gunslinger, players must straddle the line between good and evil as they showdown againstSet in the untamed West of the late-1800s, GUN is a free-roaming action-adventure game that takes players to a world without laws where greed, lust and murder are rampant. As Colton White, a vengeful gunslinger, players must straddle the line between good and evil as they showdown against corrupt lawmen, a murderous preacher, renegade army psychopaths, merciless outlaws and unforgiving Native Americans, while waging war on horseback, collecting bounties, and commandeering trains. Players travel through an action-packed landscape of high mountain wilderness, deserts and bustling territorial towns in an epic story of betrayal, greed, and revenge. Multiple gameplay styles include: strategic gunplay and precision shooting, stealth tactics, and use of explosives. Embark on numerous side missions to master gun slinging and horse riding. Players can unlock secret weapons and upgrade skills and abilities to improve their weapon and equipment performance. [Activision]… Expand"}, {"name": "FIFA 23", "details_link": "https://www.metacritic.com/game/playstation-5/fifa-23", "publisher": "Electronic Arts", "release_date": "Sep 27 2022", "developers": ["EA Sports", "EA Canada"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 76, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/3/7ab27ffe2eea120270e65bfb2c967927-98.jpg", "descriptions": "In FIFA 23, cross-play will be available at launch in FUT Division Rivals (except Co-Op), FUT Champions, FUT Ultimate Online Draft, FUT Online Friendlies (except Co-Op), FUT Play a Friend, Online Friendlies, Online Seasons (except Co-Op Seasons) and the Virtual Bundesliga competitive gameIn FIFA 23, cross-play will be available at launch in FUT Division Rivals (except Co-Op), FUT Champions, FUT Ultimate Online Draft, FUT Online Friendlies (except Co-Op), FUT Play a Friend, Online Friendlies, Online Seasons (except Co-Op Seasons) and the Virtual Bundesliga competitive game mode that is available to players based in Germany. Cross-play is initially enabled for all players when launching FIFA 23 for the first time, provided the platform level settings allow for it, and it can be opted out of at any time (more on that later in this article).… Expand"}, {"name": "Puzzle Quest: Galactrix", "details_link": "https://www.metacritic.com/game/xbox-360/puzzle-quest-galactrix", "publisher": "D3Publisher", "release_date": "Apr  8 2009", "developers": ["Infinite Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/1dff7ac172be96595bb95f67565b5b9e-98.jpg", "descriptions": "[Xbox Live Arcade]  The puzzle game of the future has arrived with Puzzle Quest: Galactrix. The original best-selling Puzzle Quest franchise is back in an all-new dimension with its signature match-3, turn-based battles in a masterful hybrid of the RPG and puzzle genres. Take on the role of[Xbox Live Arcade]  The puzzle game of the future has arrived with Puzzle Quest: Galactrix. The original best-selling Puzzle Quest franchise is back in an all-new dimension with its signature match-3, turn-based battles in a masterful hybrid of the RPG and puzzle genres. Take on the role of a rogue pilot scouring the galaxy to uncover clues in an intergalactic mystery that affects the fate of the entire universe. Build up a fleet of ships, discover hundreds of different weapons, and master the new puzzle board. A new dimension: Customize and build a fleet of ships to master the galaxy, with an all-new redesigned puzzle board. New weapons: Use over 150 different weapons to control the board. New quests: Play hundreds of missions within a single-player game. Multiplayer: Battle across the universe in one-on-one ranked online multiplayer matches. [Infinite Interactive]… Expand"}, {"name": "Multiwinia: Survival of the Flattest", "details_link": "https://www.metacritic.com/game/pc/multiwinia-survival-of-the-flattest", "publisher": "Introversion", "release_date": "Sep 19 2008", "developers": ["Introversion"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/0785c710a68001f1e090121d857d5094-98.jpg", "descriptions": "Long ago a computer scientist called Dr Sepulveda created a beautiful digital world existing entirely within a computer network of his own invention. This world was called Darwinia and it was inhabited by a peaceful, law-abiding digital life-form called the Darwinians. As the years wore onLong ago a computer scientist called Dr Sepulveda created a beautiful digital world existing entirely within a computer network of his own invention. This world was called Darwinia and it was inhabited by a peaceful, law-abiding digital life-form called the Darwinians. As the years wore on however the Darwinians became ever more aggressive and autonomous. They divided into factions, squabbling over Darwinia’s limited natural resources. Tribes began to roam the fractal voids hell bent on each other’s destruction, drunk on power and unswerving in the pursuit of world supremacy. Far and wide, they became known as the Multiwinians. Welcome to Multiwinia: Survival of the Flattest - the ultimate retro-arcade multiplayer experience. Choose from a selection of six hilariously fun, action-packed game modes, set in one of the most beautiful game environs you will ever set eyes on. Challenge your opponent to a game of stick-man slaughter, and watch digital-war unfold, as your Multiwinian army struggles to complete a chosen task faster and better than your rival’s. It's fast, it’s furious, and only the flattest will survive. [Introversion]… Expand"}, {"name": "The Beginner's Guide", "details_link": "https://www.metacritic.com/game/pc/the-beginners-guide", "publisher": "Davey Wreden", "release_date": "Oct  1 2015", "developers": ["Davey Wreden"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/4743eed8d7107bf01e0c31453343cceb-98.jpg", "descriptions": "The Beginner's Guide is a narrative video game from Davey Wreden, the creator of The Stanley Parable. It lasts about an hour and a half and has no traditional mechanics, no goals or objectives. Instead, it tells the story of a person struggling to deal with something they do not understand."}, {"name": "Pokken Tournament", "details_link": "https://www.metacritic.com/game/wii-u/pokken-tournament", "publisher": "Nintendo", "release_date": "Mar 18 2016", "developers": ["Bandai Namco Games"], "platforms": "Wii U", "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/bba80a1450c85e6f017eb0a9f68dd0c6-98.jpg", "descriptions": "(Also known as \"Pokemon Tekken\") Battle Pokémon in all-new, action-packed arena fights. Perform vivid Pokémon moves in all their glory with button combinations through an intuitive fighting system to unleash devastating attacks upon your opponent to become the Pokkén Tournament champion.(Also known as \"Pokemon Tekken\") Battle Pokémon in all-new, action-packed arena fights. Perform vivid Pokémon moves in all their glory with button combinations through an intuitive fighting system to unleash devastating attacks upon your opponent to become the Pokkén Tournament champion. Learn various fighting styles of Pokémon such as Pikachu, Charizard, Lucario, and more. Any fan will be able to learn and execute signature Pokémon moves with a press of a button. Turn the tide of battle by calling upon support Pokémon to assist, and unleash devastating attacks to KO your opponent. Battles await, and it’s up to you to claim the title of Pokkén Tournament champion. [Nintendo]… Expand"}, {"name": "Potion Craft: Alchemist Simulator", "details_link": "https://www.metacritic.com/game/pc/potion-craft-alchemist-simulator", "publisher": "niceplay games", "release_date": "Dec 13 2022", "developers": ["niceplay games"], "platforms": ["Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "General", "Virtual", "Career"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/b1b59486b3ece5d9ccec63d0ff80ac1b-98.jpg", "descriptions": "Potion Craft is an alchemist simulator where you physically interact with your tools and ingredients to brew potions. You're in full control of the whole shop: invent new recipes, attract customers and experiment to your heart's content. Just remember: the whole town is counting on you.Potion Craft is an alchemist simulator where you physically interact with your tools and ingredients to brew potions. You're in full control of the whole shop: invent new recipes, attract customers and experiment to your heart's content. Just remember: the whole town is counting on you. Every day customers will come to your store looking for solutions to their problems. You will face consequences depending on what you decide to sell them. Attract guilds, befriend notable figures (or feud with them), gain riches and influence - and one day, you may even decide the fate of the whole town.… Expand"}, {"name": "Trolley Problem, Inc.", "details_link": "https://www.metacritic.com/game/pc/trolley-problem-inc", "publisher": "Yogscast", "release_date": "Apr 21 2022", "developers": ["Yogscast"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/c68d077d73e9ba1fb04663cc37e86d19-98.jpg", "descriptions": "There is a runaway trolley careering down the railway tracks. On the tracks are five people unable to move. You are next to a lever. If you pull this lever the trolley will switch to a different set of tracks. However, you notice that there is a person on the other track.Watch theThere is a runaway trolley careering down the railway tracks. On the tracks are five people unable to move. You are next to a lever. If you pull this lever the trolley will switch to a different set of tracks. However, you notice that there is a person on the other track.Watch the situation play out and five people die. Choose to pull the lever and only one person gets killed - but by you.What will you do?Trolley Problem, Inc. is a darkly comedic narrative game based on real world philosophical papers, in which you are asked to make a series of impossible choices from two awful answers. Wrestle with your moral compass, decide the fate of millions - and compare your choices with the rest of the world.… Expand"}, {"name": "Shadow Warrior 3", "details_link": "https://www.metacritic.com/game/xbox-series-x/shadow-warrior-3", "publisher": "Devolver Digital", "release_date": "Mar  1 2022", "developers": ["Flying Wild Hog"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X"], "genres": ["Action", "First-Person", "Shooter", "Arcade"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/75311a6fcd879bc770aa6b7567c45247-98.jpg", "descriptions": "Shadow Warrior 3 launches the offbeat first-person shooter series to the next level with a seamless blend of fast-paced gunplay, razor-sharp melee combat, and a spectacular free-running movement system. Fallen corporate shogun Lo Wang and his former employer turned nemesis turned sidekickShadow Warrior 3 launches the offbeat first-person shooter series to the next level with a seamless blend of fast-paced gunplay, razor-sharp melee combat, and a spectacular free-running movement system. Fallen corporate shogun Lo Wang and his former employer turned nemesis turned sidekick Orochi Zilla embark on an improbable mission to recapture an ancient dragon they unwillingly unleashed from its eternal prison. Armed with a punishing mix of blades and bullets, Lo Wang must traverse uncharted parts of the world to track down the dark beast and push the apocalypse back yet again. All it will take is the mask of a dead god, a dragon's egg, a touch of magic, and enough firepower to hold off the impending cataclysm. Bring a Katana to a Gunfight. Conduct a symphony of death with each encounter by mixing overwhelming firepower with devastatingly precise katana strikes as you dash in and around the demonic hordes.\r Fancy Footwork\rFlow between nimble movement techniques including air dashes, wall running, double jumps, and the fancy new grappling hook busts your combat and movement options wide open in every battle.\r Execute Then Annihilate\rExecute spectacular finishing moves to claim a piece of your conquered foe and unleash its powers back on the horde in a burst of unstoppable fury and powerful magic.\r Dynamic Combat Arenas\rEach environment is lined with hazardous structures and devices that can be activated to add another layer of creative choice to the offensive strategy.\r Neo Feudal Japan\rTrek across a mythic Asian land infused with the magic and technology of ancient samurai, now overrun by the demonic yokai from Japanese folklore.\r Funny Business\rBrace for expertly delivered one-liners from Lo Wang, pointed banter with Zilla, and an intense thrill ride of absurd predicaments on the way to turning doomsday into a new day.… Expand"}, {"name": "TENS!", "details_link": "https://www.metacritic.com/game/switch/tens!", "publisher": "Kwalee Ltd", "release_date": "Nov  5 2020", "developers": ["Kwalee Ltd"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/8fa082539626a34184ffccda5d61a1ca-98.jpg", "descriptions": "The ultimate dice puzzle. Combining sudoku-style number puzzles and block-dropping gameplay, the aim of TENS! is simple: place dice on the board, make ‘tens’ in any row or column and clear the board to win. TENS! is a relaxing puzzle game which offers tons of gameplay styles for you toThe ultimate dice puzzle. Combining sudoku-style number puzzles and block-dropping gameplay, the aim of TENS! is simple: place dice on the board, make ‘tens’ in any row or column and clear the board to win. TENS! is a relaxing puzzle game which offers tons of gameplay styles for you to choose from including: an immersive single-player Adventure mode, a local Multiplayer mode where you can challenge your friends and family, and an Endless mode which challenges your skill level.\r In TENS! there’s something for everyone to enjoy!\r TENS! Features:\r- Explore your way through Adventure Mode and experience the world of TENS!\r- Keep beating your high score and learning new skills in Endless Mode\r- Challenge your friends with local multiplayer to see who has the top TENS! talent\r- Add dice skins to your collection by playing through the game your way\r- Battle bosses through your adventure and unlock new characters\r- Relaxing gameplay for everyone to enjoy!\r… Expand"}, {"name": "Noita", "details_link": "https://www.metacritic.com/game/pc/noita", "publisher": "Nolla Games", "release_date": "Oct 15 2020", "developers": ["Nolla Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Action Adventure", "Open-World"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/e0e3791f31389a34f975ea6a79bc048d-98.jpg", "descriptions": "Noita is a magical action roguelite set in a world where every pixel is physically simulated. Fight, explore, melt, burn, freeze and evaporate your way through the procedurally generated world using spells you've created yourself."}, {"name": "Minoria", "details_link": "https://www.metacritic.com/game/playstation-4/minoria", "publisher": "DANGEN Entertainment", "release_date": "Sep 10 2020", "developers": ["Bombservice"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Open-World"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/e4736a51407fdd1473e188c4298331ad-98.jpg", "descriptions": "Ink and blood stain the streets of Ramezia. Witches must burn and sins must be judged. Venture forth as Sister Semilla to burn down the pillars of heresy in Minoria, an action-platformer by Bombservice, creators of Momodora."}, {"name": "Brigandine: The Legend of Runersia", "details_link": "https://www.metacritic.com/game/switch/brigandine-the-legend-of-runersia", "publisher": "Happinet Corporation", "release_date": "Jun 25 2020", "developers": ["Matrix Software", "Happinet Corporation"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/5d86c6ea3c1fc4a2a68b99f93fccd683-98.jpg", "descriptions": "An Endless Fantasy WarGrand Strategy Simulation. Conquer the continent in this grand strategy simulation game\rThe continent of Runersia is home to six major powers with more than 40 bases, 100 knights, and 50 types of monsters.\rSelect a ruler, compose your platoons of knights and monsters,An Endless Fantasy WarGrand Strategy Simulation. Conquer the continent in this grand strategy simulation game\rThe continent of Runersia is home to six major powers with more than 40 bases, 100 knights, and 50 types of monsters.\rSelect a ruler, compose your platoons of knights and monsters, and march to claim enemy bases.\rThe player chooses how they will battle, so devise the best strategy to lead your nation toward continental conquest. How will your legend unfold?\r Simple yet deep war simulation game with unit growth and map-based platoon battles\rTime passes on Runersia in seasons, each one consisting of an Organization Phase and an Attack phase.\rDuring the Organization Phase, knights and monsters with various classes and skills are organized into platoons in preparation for the upcoming battles.\r During the Attack Phase, turn-based platoon battles take place on a map made up of hexagonal spaces. Make use of unit skills, elements, enclosure effects, terrain advantages, and other battle tactics to lead your side to victory!\rAll nations, knights, and monsters in the game will continue to battle and grow as you do.\rThe game is also packed with other ways to grow your armies such as class changes, equipment, and various items.… Expand"}, {"name": "The Surge 2", "details_link": "https://www.metacritic.com/game/pc/the-surge-2", "publisher": "Focus Home Interactive", "release_date": "Sep 23 2019", "developers": ["Deck 13"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/6b8ea26402732296c3bb7f6e35fa9df3-98.jpg", "descriptions": "[OVERCOME]\rOn the way to Jericho City, your plane is shot down by a mysterious storm and crash-lands in the outskirts. You wake up weeks later in a derelict detention facility inside the city. Armor-clad soldiers enforce Martial Law, robots are on a rampage, and a dark, expanding nanostorm[OVERCOME]\rOn the way to Jericho City, your plane is shot down by a mysterious storm and crash-lands in the outskirts. You wake up weeks later in a derelict detention facility inside the city. Armor-clad soldiers enforce Martial Law, robots are on a rampage, and a dark, expanding nanostorm looms over the cityscape...\r [SURVIVE]\rIn a bid to survive, explore the sprawling, devastated city of Jericho. Fight its numerous, ferocious threats in brutal, unforgiving combat, slashing and tearing the limbs off your opponents to steal valuable equipment that will make you stronger - strong enough to face the most fearsome, imposing foes lurking in the city.\r [UPGRADE]\rWith an expanded arsenal of weapons, armors, abilities, implants, and drones to build your character, and a bigger, more varied and more ambitious world, The Surge 2 challenges you to survive and unravel its hidden secrets.\r * Hardcore, brutal melee combat\r* Face deadly foes and colossal bosses\r* Cut off parts of the enemy you want to loot\r* Rich character progression and customization… Expand"}, {"name": "Old School Musical", "details_link": "https://www.metacritic.com/game/switch/old-school-musical", "publisher": "Playdius", "release_date": "Sep 13 2018", "developers": ["La Moutarde"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Rhythm", "Music"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/7023ee933eb928d52caf03b265b05058-98.jpg", "descriptions": "What has 50 amazing chiptune tracks, a loony story mode, 32 different chicken types to fight, and takes you on a tour of all your favorite retro games? It's Old School Musical of course. Tib and Rob are the heroes of a wacky adventure that will teach them where all of the bugs in ourWhat has 50 amazing chiptune tracks, a loony story mode, 32 different chicken types to fight, and takes you on a tour of all your favorite retro games? It's Old School Musical of course. Tib and Rob are the heroes of a wacky adventure that will teach them where all of the bugs in our favorite games come from. Have you ever played a rhythm game before? Well, this is like that, but much better. With each note, you are responsible for the success of our two heroes' quest. Swing your sword and shoot with your spacecraft to the beat of chiptune tracks from Dubmood, Zabutom, Hello World, Yponeko and Le Plancton. … Expand"}, {"name": "Crash Bandicoot N. Sane Trilogy", "details_link": "https://www.metacritic.com/game/pc/crash-bandicoot-n-sane-trilogy", "publisher": "Activision", "release_date": "Jun 29 2018", "developers": ["Vicarious Visions", "Iron Galaxy Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/73cdd5a87df216d29904e808efe3319a-98.jpg", "descriptions": "Your favorite marsupial, Crash Bandicoot, is back! He's enhanced, entranced & ready-to-dance with the N. Sane Trilogy game collection. Now you can experience Crash Bandicoot like never before in Fur-K. Spin, jump, wump and repeat as you take on the epic challenges and adventures through theYour favorite marsupial, Crash Bandicoot, is back! He's enhanced, entranced & ready-to-dance with the N. Sane Trilogy game collection. Now you can experience Crash Bandicoot like never before in Fur-K. Spin, jump, wump and repeat as you take on the epic challenges and adventures through the three games that started it all, Crash Bandicoot, Crash Bandicoot 2: Cortex Strikes Back and Crash Bandicoot: Warped. Relive all your favorite Crash moments in their fully-remastered HD graphical glory and get ready to put some UMPH in your WUMP!… Expand"}, {"name": "The Elder Scrolls Online: Summerset", "details_link": "https://www.metacritic.com/game/playstation-4/the-elder-scrolls-online-summerset", "publisher": "Bethesda Softworks", "release_date": "Jun  5 2018", "developers": ["ZeniMax Media"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 76, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/d93c1a0866599f05d9fbcc2f9ad9053e-98.jpg", "descriptions": "The Elder Scrolls Online: Summerset is the next Chapter of ZeniMax Online Studios' award-winning online RPG, The Elder Scrolls Online (ESO). This new adventure in the ESO saga will send adventurers and their friends to the Summerset Isle, to visit and explore the ancestral home of the highThe Elder Scrolls Online: Summerset is the next Chapter of ZeniMax Online Studios' award-winning online RPG, The Elder Scrolls Online (ESO). This new adventure in the ESO saga will send adventurers and their friends to the Summerset Isle, to visit and explore the ancestral home of the high elves for the first time since 1994's The Elder Scrolls: Arena. Players will also be able to explore the island of Artaeum, home to the mysterious Psijic Order, a group of sages that predate the Mages Guild. Tamriel's fate hangs in the balance and the heroes of ESO are called upon to save the world once more. This year's Chapter introduces an enormous and stunning new zone unlike any other, a fresh skill line with new magical powers to master, an expanded crafting system to forge powerful gear, and the continuation of the epic and award-winning ESO story. With more than 30 hours of new story content to experience, The Elder Scrolls Online: Summerset expands The Elder Scrolls Online in exciting and innovative ways, offering incredible adventures for both ESO veterans and those new to the game.… Expand"}, {"name": "Horizon Chase Turbo", "details_link": "https://www.metacritic.com/game/pc/horizon-chase-turbo", "publisher": "Aquiris Game Studio", "release_date": "May 15 2018", "developers": ["Aquiris Game Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/2e4c094649d849a792d2af2c6468f2f3-98.jpg", "descriptions": "Thrilling arcade racing game, inspired by the super-fun-straight-to-the-point classic racing games from the 90s."}, {"name": "Masters of Anima", "details_link": "https://www.metacritic.com/game/switch/masters-of-anima", "publisher": "Focus Home Interactive", "release_date": "Apr 10 2018", "developers": ["Passtech Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/b31231e5ef1c81a7b3e8a5261cbcf07e-98.jpg", "descriptions": "Dive into an original adventure and defy the forces of evil in strategic, action-packed battles. Summon and control large armies of up to 100 Guardians thanks to intuitive and innovative gameplay and make quick tactical decisions to prevail."}, {"name": "Wulverblade", "details_link": "https://www.metacritic.com/game/playstation-4/wulverblade", "publisher": "Darkwind Media", "release_date": "Jan 30 2018", "developers": ["Darkwind Media"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/2fd66ff2b34b66793f5bcfbc753455ae-98.jpg", "descriptions": "Help Britannia defeat the Romans in Wulverblade — a hardcore side-scrolling beat ’em up inspired by classics such as Golden Axe, Sengoku, and Knights of the Round."}, {"name": "Syberia", "details_link": "https://www.metacritic.com/game/switch/syberia", "publisher": "Microids", "release_date": "Oct 20 2017", "developers": ["Koalabs Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/588ebc538fb111b08e7ed3b028476e60-98.jpg", "descriptions": "For the young Kate Walker, an ambitious lawyer, the Voralberg toy company acquisition seemed like a textbook case--a quick stopover to a small alpine village in France to buy-out an old automaton factory, then straight back home to New York.  But her journey across land and time throws allFor the young Kate Walker, an ambitious lawyer, the Voralberg toy company acquisition seemed like a textbook case--a quick stopover to a small alpine village in France to buy-out an old automaton factory, then straight back home to New York.  But her journey across land and time throws all she values into question, and the deal she set out to sign turns into a pact with destiny.  Follow Kate through a magical world of automatons, amazing characters, and mysterious environments.  This puzzle-driven adventure blends logical problem-solving with a complex and involving storyline.… Expand"}, {"name": "Chaos;Child", "details_link": "https://www.metacritic.com/game/playstation-4/chaoschild", "publisher": "5pb", "release_date": "Oct 17 2017", "developers": ["5pb"], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 76, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/bdebdccd90f27fd30db897c388bbe19e-98.jpg", "descriptions": "Discover A Darker Japan - Explore Shibuya in 2015, after an earthquake nearly levelled the city six years prior, and try to outsmart the puppet-master behind this New Generation Madness. Track Down A Serial Killer - Play as Takuru, an arrogant senior and the newspaper club president, andDiscover A Darker Japan - Explore Shibuya in 2015, after an earthquake nearly levelled the city six years prior, and try to outsmart the puppet-master behind this New Generation Madness. Track Down A Serial Killer - Play as Takuru, an arrogant senior and the newspaper club president, and discover the pattern in a series of bizarre deaths around you that the police can't seem to crack.… Expand"}, {"name": "Piczle Lines DX", "details_link": "https://www.metacritic.com/game/switch/piczle-lines-dx", "publisher": "Rainy Frog", "release_date": "Aug 24 2017", "developers": ["Score Studios"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/51b490d22b51f6ee14618307adb99e71-98.jpg", "descriptions": "Draw lines between two numbers to reveal a hidden picture and complete the puzzle. Hundreds of puzzles with free updates. Draw lines to connect pairs of numbers to complete a hidden picture in this feverishly addictive PICture puzZLE game. Connect numbers of the same color, using the sameDraw lines between two numbers to reveal a hidden picture and complete the puzzle. Hundreds of puzzles with free updates. Draw lines to connect pairs of numbers to complete a hidden picture in this feverishly addictive PICture puzZLE game. Connect numbers of the same color, using the same number of blocks as the number. Easy controls lets you draw line after line as you gradually reveal the picture.  Play through 100 levels in Story Mode as you follow the adventure of a professor and his mysterious Piczle-Matic camera. Each puzzle solved unlocks the next step in the story. Continue the fun in Puzzle Mode with 200+ more puzzles. Solve picture puzzles in of all sorts, including sports, pets, vehicles, food and many more! Select them in any order or have multiple puzzles on the go, resuming any one at any time. [Nintendo]… Expand"}, {"name": "The Long Dark", "details_link": "https://www.metacritic.com/game/xbox-one/the-long-dark", "publisher": "Hinterland", "release_date": "Aug  1 2017", "developers": ["Hinterland"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Simulation", "Action Adventure", "General", "Survival"], "meta_score": 76, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/bbb808c60472e6d890ff9ffba17f958b-98.jpg", "descriptions": "The Long Dark is a thoughtful, exploration-survival experience that challenges solo players to think for themselves as they explore an expansive frozen wilderness. Monitor your Condition, search for life-saving supplies, and master survival skills like fire-building, maintaining your gear,The Long Dark is a thoughtful, exploration-survival experience that challenges solo players to think for themselves as they explore an expansive frozen wilderness. Monitor your Condition, search for life-saving supplies, and master survival skills like fire-building, maintaining your gear, hunting, fishing, and landmark-based navigation. There are no zombies -- only you, the cold, and everything Mother Nature can throw at you. The hit Steam Early Access sandbox becomes the first survival game available on Xbox One!… Expand"}, {"name": "Battlefield 1: They Shall Not Pass", "details_link": "https://www.metacritic.com/game/pc/battlefield-1-they-shall-not-pass", "publisher": "Electronic Arts", "release_date": "Mar 14 2017", "developers": ["EA DICE"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 76, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/5bf2b70abc169c72c488d753a362d1b6-98.jpg", "descriptions": "NEW MAP: VERDUN HEIGHTS - The opening barrage of the Battle of Verdun created massive forest fires in which players will fight for domination. This is an uphill battle towards the massive fortresses of Verdun. A constant grinding struggle where the artillery never stops. Where the forge andNEW MAP: VERDUN HEIGHTS - The opening barrage of the Battle of Verdun created massive forest fires in which players will fight for domination. This is an uphill battle towards the massive fortresses of Verdun. A constant grinding struggle where the artillery never stops. Where the forge and “the Devil’s Anvil” continues to consume even the bravest combatants. NEW MAP: FORT DE VAUX - The first big engagement inside a fort during World War 1 takes place in the dark underworld of Fort de Vaux. Down in the maze of dark galleries and wet stone corridors, French and Germans fight ferociously with grenades, guns, bayonets, and flamethrowers. Watch your corners. NEW MAP: SOISSONS - Take part in one of the biggest tank assaults of World War 1. The French 10th Army moves to take back Soissons using their powerful Saint Chamond tanks. Planes, tanks, and infantry clash in the beautiful French countryside in the early hours of a hot summer day. Only the thunderstorm is louder than the war. NEW MAP: RUPTURE - In dire need to capture key bridges across the Aisne river, the French find themselves back into battlefields where poppies grow over a rusty wreck from previous tank battles. It might seem calm but this maze of steel beasts provides an excellent place for those who plan an ambush. As the sun sets over Fontenoy, the battle wakes up. [Electronic Arts] … Expand"}, {"name": "ACA NeoGeo: Metal Slug 3", "details_link": "https://www.metacritic.com/game/switch/aca-neogeo-metal-slug-3", "publisher": "Hamster", "release_date": "Mar  9 2017", "developers": ["SNK Playmore", "Hamster"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "Shoot-'Em-Up", "Horizontal"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/e9297ac197682e34480de6c64cd5bee2-98.jpg", "descriptions": "Marco, Tarma, Eri, and Fio, the four veterans of the elite Sparrows Unit are back in METAL SLUG 3! The popular action shooting series is in its glory, with gorgeous graphics and all the run-and-gun action you can handle. There is no time for indecision. General Morden is on the warpath andMarco, Tarma, Eri, and Fio, the four veterans of the elite Sparrows Unit are back in METAL SLUG 3! The popular action shooting series is in its glory, with gorgeous graphics and all the run-and-gun action you can handle. There is no time for indecision. General Morden is on the warpath and you must prevent him from creating the New World Order. Stop the Rebel Army!… Expand"}, {"name": "Call of Duty: Infinite Warfare - Sabotage", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-infinite-warfare---sabotage", "publisher": "Activision", "release_date": "Jan 31 2017", "developers": ["Infinity Ward"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 76, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/7/acfaf2ae7460e0d8017e268bb7ee22dd-98.jpg", "descriptions": "Sabotage, the first DLC pack for Call of Duty: Infinite Warfare, includes the next terrifying Zombies installment: Rave in the Redwoods plus four unique multiplayer environments. Play DLC map packs 30 days early on PS4."}, {"name": "Werewolves Within", "details_link": "https://www.metacritic.com/game/playstation-4/werewolves-within", "publisher": "Ubisoft", "release_date": "Dec  6 2016", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/cfe189791cde117376920cfe42db4caa-98.jpg", "descriptions": "A game of social deduction that brings the fun of game night with friends to virtual reality."}, {"name": "Trackmania Turbo", "details_link": "https://www.metacritic.com/game/xbox-one/trackmania-turbo", "publisher": "Ubisoft", "release_date": "Mar 22 2016", "developers": ["Nadeo"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to more than 64 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/84d61342c22914267d0d2ced59e61865-98.jpg", "descriptions": "Trackmania Turbo features an easy to learn, hard to master gameplay style that relies on time attack racing in which racers set their own limits and challenges. The gameplay centers on the perfect combination of matchbox car fantasy on a massive scale, focusing on the pursuit of the perfectTrackmania Turbo features an easy to learn, hard to master gameplay style that relies on time attack racing in which racers set their own limits and challenges. The gameplay centers on the perfect combination of matchbox car fantasy on a massive scale, focusing on the pursuit of the perfect run around the track. Players test their skills in the campaign mode which includes more than 200 tracks set in four beautiful environments each with their own gameplay style. [Ubisoft]… Expand"}, {"name": "Far Cry 4: Valley of the Yetis", "details_link": "https://www.metacritic.com/game/xbox-one/far-cry-4-valley-of-the-yetis", "publisher": "Ubisoft", "release_date": "Mar 10 2015", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/9c0df8846584574e0e4f7f4690e1de22-98.jpg", "descriptions": "Players must explore and survive a valley at the top of the Himalayas in Kyrat after Ajay’s helicopter crashes and leaves him stranded on a dangerous ridge. In order to stay alive, players must capture a camp for shelter and guard it from a mysterious cult. But even if successful against thePlayers must explore and survive a valley at the top of the Himalayas in Kyrat after Ajay’s helicopter crashes and leaves him stranded on a dangerous ridge. In order to stay alive, players must capture a camp for shelter and guard it from a mysterious cult. But even if successful against the cult, they must keep a lookout for the fabled and extremely dangerous yetis that populate the territory. [Ubisoft]… Expand"}, {"name": "Castle In The Darkness", "details_link": "https://www.metacritic.com/game/pc/castle-in-the-darkness", "publisher": "Nicalis", "release_date": "Feb  5 2015", "developers": ["Matt Kap"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Metroidvania"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/3481f83884ab024ccc0f89be1a997d08-98.jpg", "descriptions": "One dark and gloomy night, the kingdom of Alexandria is attacked by an evil sorcerer and his army of darkness! Despite their best efforts to protect their king and their princess, the royal guard falls, one-by-one, to the forces of evil.One knight, unconscious but still alive, awakens onOne dark and gloomy night, the kingdom of Alexandria is attacked by an evil sorcerer and his army of darkness! Despite their best efforts to protect their king and their princess, the royal guard falls, one-by-one, to the forces of evil.One knight, unconscious but still alive, awakens on the throne room floor to find that the princess is nowhere to be seen! What's more, the entire city had been overrun by monsters! With sword in hand, he embarks on a death-defying mission to find his princess and to restore peace to the kingdom!Castle In The Darkness is a fun and challenging shout out to the early days of video games! It's an action exploration platformer with some RPG elements, much like games from the Castlevania or Metroid series. It's super fast-paced, challenging, and full of secrets!… Expand"}, {"name": "Assassin's Creed IV: Black Flag - Freedom Cry", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-iv-black-flag---freedom-cry", "publisher": "Ubisoft", "release_date": "Dec 17 2013", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "Historic", "Open-World"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/736ed44688ec27a15a1595c91af5a11f-98.jpg", "descriptions": "Born a slave, Adewale found freedom aboard the Jackdaw where he became Edward Kenwayâ€™s second-in-command. 15 years later, Adewale has become an Assassin who finds himself shipwrecked in Saint-Domingue without weapons or crew. He meets locals in an effort to assemble a crew & steal a ship.Born a slave, Adewale found freedom aboard the Jackdaw where he became Edward Kenwayâ€™s second-in-command. 15 years later, Adewale has become an Assassin who finds himself shipwrecked in Saint-Domingue without weapons or crew. He meets locals in an effort to assemble a crew & steal a ship. The more he helps, the more he is drawn into the Maroon slave community. Forced to face his past, he sets out to free the slaves & bring death to their captors. Over 3 hours of new single-player game play!… Expand"}, {"name": "BioShock Infinite: Burial at Sea - Episode One", "details_link": "https://www.metacritic.com/game/playstation-3/bioshock-infinite-burial-at-sea---episode-one", "publisher": "2K Games", "release_date": "Nov 12 2013", "developers": ["Irrational Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/8162f4ee1913a12db4957a3a8e01e5fe-98.jpg", "descriptions": "Come back to Rapture in a story that finds Booker and Elizabeth on the eve of the underwater city's fall from grace. Developed by Irrational Games, the developer of the original BioShock and BioShock Infinite, this DLC features Rapture as you've never seen it before-a shining jewel at theCome back to Rapture in a story that finds Booker and Elizabeth on the eve of the underwater city's fall from grace. Developed by Irrational Games, the developer of the original BioShock and BioShock Infinite, this DLC features Rapture as you've never seen it before-a shining jewel at the bottom of the ocean, built almost entirely from scratch in the BioShock Infinite engine. Gameplay has been modified to give the player an original BioShock combat experience that merges the best parts of BioShock and BioShock Infinite: new weapons, new Plasmids/Vigors, Tears, Sky-Lines, and Big Daddies.… Expand"}, {"name": "Volgarr the Viking", "details_link": "https://www.metacritic.com/game/pc/volgarr-the-viking", "publisher": "Adult Swim", "release_date": "Sep 13 2013", "developers": ["Crazy Viking Studios"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/6035eb4f50d3a78a6bd30ac41062be40-98.jpg", "descriptions": "Remember when games were tough? Return to the Golden Age of arcades with a hardcore action experience that pulls no punches. Volgarr the Viking features simple controls, high challenge, and meticulous design - combined with hand-made pixel animation, an epic soundtrack, and buckets of blood.Remember when games were tough? Return to the Golden Age of arcades with a hardcore action experience that pulls no punches. Volgarr the Viking features simple controls, high challenge, and meticulous design - combined with hand-made pixel animation, an epic soundtrack, and buckets of blood. Flex your gaming muscles and step into the arena with Volgarr the Viking.… Expand"}, {"name": "Deus Ex: Human Revolution - The Missing Link", "details_link": "https://www.metacritic.com/game/xbox-360/deus-ex-human-revolution---the-missing-link", "publisher": "Square Enix", "release_date": "Oct 18 2011", "developers": ["Eidos Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/24d2eae8ebe4bb80fe8da92b6a2abf3b-98.jpg", "descriptions": "The DEUS EX: HUMAN REVOLUTION conspiracy grows deeper in The Missing Link. During lead character Adam Jensen’s quest for the truth in DEUS EX: HUMAN REVOLUTION, he mysteriously vanishes for three days. Where was he? What did he find out? The Missing Link reveals it all."}, {"name": "LEGO Star Wars III: The Clone Wars", "details_link": "https://www.metacritic.com/game/wii/lego-star-wars-iii-the-clone-wars", "publisher": "LucasArts", "release_date": "Mar 22 2011", "developers": ["Traveller's Tales"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/e52a90acec0e3c001953d692d79bc526-98.jpg", "descriptions": "LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes,LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes, giving players unique, head-to-head combat and an upgraded level builder, allowing the creation of customized bases and in-game battlefields. Play either as a Jedi or Separatist with all-new character abilities, such as Squad command, Lightsaber slicing, Lightsaber jumps, long distance Jedi attacks and Grapple Tie-Ups, all within a new, easy-to-navigate hub.… Expand"}, {"name": "Deathsmiles", "details_link": "https://www.metacritic.com/game/xbox-360/deathsmiles", "publisher": "Aksys Games", "release_date": "Jun 29 2010", "developers": ["Cave"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/98bc2ff3c79590805f91e89e5d64f2b4-98.jpg", "descriptions": "Enter the world of Gilverado, a kingdom plagued by hideous monsters and tortured souls. Choose from four angels with unique demonic familiars and battle against a storm of enemies pouring out of Hell’s gates! Fight your way out of tight spots as you are surrounded by enemy units and bulletsEnter the world of Gilverado, a kingdom plagued by hideous monsters and tortured souls. Choose from four angels with unique demonic familiars and battle against a storm of enemies pouring out of Hell’s gates! Fight your way out of tight spots as you are surrounded by enemy units and bullets from both sides of the screen. The unique left/right shooting mechanic of Deathsmiles will keep you on your toes as you dodge and weave through complex enemy fire, beautifully crafted by the modern masters of shmups, CAVE. [Aksys]… Expand"}, {"name": "Mario & Sonic at the Olympic Winter Games", "details_link": "https://www.metacritic.com/game/ds/mario-sonic-at-the-olympic-winter-games", "publisher": "Sega", "release_date": "Oct 13 2009", "developers": ["Sega", "Sega Sports R&D"], "platforms": "DS", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/486a8380c52f12215215e7e531551520-98.jpg", "descriptions": "Mario & Sonic at the Olympic Winter Games takes players to Vancouver, Canada, host city of the official 2010 Olympic Winter Games. This gaming experience invites players of all ages and skill sets to face-off in some of the most intense winter competitions available for the NintendoMario & Sonic at the Olympic Winter Games takes players to Vancouver, Canada, host city of the official 2010 Olympic Winter Games. This gaming experience invites players of all ages and skill sets to face-off in some of the most intense winter competitions available for the Nintendo platforms. Developed by SEGA of Japan, under the guidance of Shigeru Miyamoto, Mario & Sonic at the Olympic Winter Games takes players to lifelike Olympic venues where they can choose from a legendary cast of playable characters, including new faces to the series. This fresh gaming experience features completely new Olympic Winter Games events from the official competition schedule including Alpine Skiing and Speed Skating. Tailored to the specific system controls, Nintendo DS and Wii gamers enjoy completely unique experiences thanks to each platform having its own specific gameplay features and modes. Players of all skill levels enjoy the intuitive controls of both the Wii and Nintendo DS systems, in both single and multiplayer gaming modes. The Wii game offers an even richer multiplayer experience offering co-op and competitive gameplay where the Nintendo DS brings an intense competitive element using the Nintendo DS wireless capabilities. Additionally, one of the new features to be found in Mario & Sonic at the Olympic Winter Games is the inclusion of the Wii Balance Board which can be used in some events featured in the Wii version, allowing for a more interactive and realistic gaming experience. [Sega]… Expand"}, {"name": "Bubble Bobble Plus!", "details_link": "https://www.metacritic.com/game/wii/bubble-bobble-plus!", "publisher": "Square Enix", "release_date": "May 25 2009", "developers": ["Taito Corporation"], "platforms": ["Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 76, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/23d1b501b792b93dd3b0df42b7dd8231-98.jpg", "descriptions": "[WiiWare]  A simple yet exhilarating action game where you control the bubble blowing dragons Bub and Bob, trapping enemies in bubbles and then popping them. You can play all 100 of the Standard Mode rounds, which faithfully recreate the nostalgic arcade game, or try 100 new Arrange Mode[WiiWare]  A simple yet exhilarating action game where you control the bubble blowing dragons Bub and Bob, trapping enemies in bubbles and then popping them. You can play all 100 of the Standard Mode rounds, which faithfully recreate the nostalgic arcade game, or try 100 new Arrange Mode rounds, which allow up to four players to play on stages with exciting new features such as new enemies and stage layouts. There are also Super Mode rounds for you to enjoy. Obtain the true ending by solving puzzles hidden on each stage to defeat the final boss. You can also play Ranking Mode where you compete with players from around the world to get the highest score by registering your scores via Nintendo WFC for each game mode. On top of all that, you can enjoy a further 100 rounds, facing off against new boss characters by purchasing the \"Expert Mode 1\" and \"Expert Mode 2\" add-on content. [Nintendo]… Expand"}, {"name": "Brothers in Arms: Hell's Highway", "details_link": "https://www.metacritic.com/game/xbox-360/brothers-in-arms-hells-highway", "publisher": "Ubisoft", "release_date": "Sep 23 2008", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 20 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/d9c5ba2c25e2e7fd5f853f3babfafd31-98.jpg", "descriptions": "Brothers In Arms: Hell's Highway brings the critically acclaimed squad-based WWII shooter into the next generation of gaming with amazing graphics and sound, new cutting-edge gameplay features and a completely redesigned online component. Delivering on the franchise's compelling story,Brothers In Arms: Hell's Highway brings the critically acclaimed squad-based WWII shooter into the next generation of gaming with amazing graphics and sound, new cutting-edge gameplay features and a completely redesigned online component. Delivering on the franchise's compelling story, unrivaled authenticity and intense squad-based action, Brothers In Arms Hell's Highway drops you into Operation Market-Garden, the largest airborne operation of World War II. Lead Matt Baker, Joe Hartsock and the rest of the 101st Airborne Division as they fight to open \"Hell's Highway\" in a daring bid for a quick end to the war. [Ubisoft]… Expand"}, {"name": "Chessmaster LIVE", "details_link": "https://www.metacritic.com/game/xbox-360/chessmaster-live", "publisher": "Ubisoft", "release_date": "Jan 30 2008", "developers": ["Ubisoft Bulgaria"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/242650646e5b22a2aebc5e6198ce631d-98.jpg", "descriptions": "[Xbox Live Arcade]  Enjoy playing as a real strategist with the Xbox Live version of the most-acclaimed chess franchise. Chessmaster Live allows you to challenge friends and players all over the world in thrilling contests and determine who's the real champ. Choose among several 3-D (or 2-D)[Xbox Live Arcade]  Enjoy playing as a real strategist with the Xbox Live version of the most-acclaimed chess franchise. Chessmaster Live allows you to challenge friends and players all over the world in thrilling contests and determine who's the real champ. Choose among several 3-D (or 2-D) sets and play against virtual characters or real opponents over Xbox Live. Solve puzzles and discover exciting variations of this classic board game. Beginners can learn the basics of chess, and veteran players can improve their mastery of the game with the advanced scenario. The game is yours ... it's your move! Compete against advanced A.I. characters or challenge other Xbox Live members to a match. New message chess system: Start a game without any time limit, and play the game at your leisure over the course of days or even weeks. Puzzle over a series of classic challenges such as \"find the fork\" or \"mate in one,\" and experience new ways of playing chess including Dark Chess, Losing Chess, Extinction Chess, and Progressive Chess. Customizable environments: Choose from six 3-D chess sets and three traditional sets, each with their own distinct sound effects, piece and board design. Interact with opponents: Video options allow you to see your challenger during the course of the game. [Ubisoft]… Expand"}, {"name": "MVP 07 NCAA Baseball", "details_link": "https://www.metacritic.com/game/playstation-2/mvp-07-ncaa-baseball", "publisher": "Electronic Arts", "release_date": "Feb  6 2007", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/9bf5af6ad872bfd43eb71942d470cf61-98.jpg", "descriptions": "EA continues to innovate on its gameplay engine by introducing Rock and Fire Pitching, a pitching mechanic that will forever change the way you deliver that blistering pitch past the batter. Rock and Fire pitching gives you ultimate control and increased feel to more realistically emulateEA continues to innovate on its gameplay engine by introducing Rock and Fire Pitching, a pitching mechanic that will forever change the way you deliver that blistering pitch past the batter. Rock and Fire pitching gives you ultimate control and increased feel to more realistically emulate the real life presence of stepping onto the mound, winding up and delivering the ultimate pitch. ESPN announcers Mike Patrick and two-time All-American Kyle Peterson  are back behind the microphone calling the action. Continuing to deliver on its partnership with ESPN, MVP 07 NCAA includes ESPN real-time features such as an ESPN ticker and live ESPN Sportscenter radio updates. Cheerleaders, crowd chants, and team fight songs are additional elements that add to the atmosphere and realism of this year's title. Plus, there are now an increased number of conferences, teams and authentic stadiums, creating a true-to-life NCAA baseball experience. [Electronic Arts]… Expand"}, {"name": "UEFA Euro 2004: Portugal", "details_link": "https://www.metacritic.com/game/pc/uefa-euro-2004-portugal", "publisher": "Electronic Arts", "release_date": "May  4 2004", "developers": ["EA Canada"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/3c90246e103c940a3004fe3064aa6f12-98.jpg", "descriptions": "In EURO 2004 mode players can play as any of the 51 European nations. Players can arrange and play friendly matches against other nations or play through the tournament going from qualifying, to playoffs and into the finals. In addition to tracking injuries and suspensions, a new dynamicIn EURO 2004 mode players can play as any of the 51 European nations. Players can arrange and play friendly matches against other nations or play through the tournament going from qualifying, to playoffs and into the finals. In addition to tracking injuries and suspensions, a new dynamic morale system will track players' morale, which will fluctuate based on individual and team performances and affect player abilities on the field. [Electronic Arts]… Expand"}, {"name": "Dominions II: The Ascension Wars", "details_link": "https://www.metacritic.com/game/pc/dominions-ii-the-ascension-wars", "publisher": "Shrapnel Games", "release_date": "Nov 14 2003", "developers": ["Illwinter Design Group"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/b5e53a9887dcc014e13cdefd73fa3315-98.jpg", "descriptions": "Too long have you been confined to this mortal realm. Too long have you been denied what should rightfully be yours. Are you not a god? Should you not be the One True God of this miserable dirtball? Yet there are others that dare challenge your authority. Pretenders to the throne, with theirToo long have you been confined to this mortal realm. Too long have you been denied what should rightfully be yours. Are you not a god? Should you not be the One True God of this miserable dirtball? Yet there are others that dare challenge your authority. Pretenders to the throne, with their false priests and prophets. These miserable creatures that have the audacity to impugn your rightful place in the cosmos! But you will show them, won't you? Gather your armies, raise your fortifications, and let loose the dogs of war! The time has come to assume your proper position, to crush your enemies beneath your boots and take what is meant for you. [Shrapnel Games]… Expand"}, {"name": "Spyro 2: Season of Flame", "details_link": "https://www.metacritic.com/game/game-boy-advance/spyro-2-season-of-flame", "publisher": "VU Games", "release_date": "Sep 25 2002", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/e9757c72b1177d72242a84f3cc6885a7-98.jpg", "descriptions": "Magic fireflies are the source of fiery dragon breath, and someone has stolen them all! Spyro and his friends must capture all the fireflies and stop Ripto from activating a sleeping volcano and destroying the Dragon Realms!"}, {"name": "Dave Mirra Freestyle BMX 2", "details_link": "https://www.metacritic.com/game/xbox/dave-mirra-freestyle-bmx-2", "publisher": "Acclaim", "release_date": "Nov 28 2001", "developers": ["Z-Axis", "Ltd."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/066277b0389a4ee6db57c91089190b12-98.jpg", "descriptions": "10-Time World Champion Dave Mirra is back in this sequel to the original hit game. Win enough respect from the other pro riders to get invited to Comps and embark on a ProQuest to be the top rider around - even better than the Miracle Boy himself."}, {"name": "Harvest Moon: Save the Homeland", "details_link": "https://www.metacritic.com/game/playstation-2/harvest-moon-save-the-homeland", "publisher": "Natsume", "release_date": "Nov 22 2001", "developers": ["Victor Interactive Software"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Strategy", "Breeding/Constructing"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/b1f39e9184e1108c50a86927c433253c-98.jpg", "descriptions": "Perhaps best described as a \"Life Simulation,\" Save the Homeland's object is to successfully save the village from being turned into a resort. Construction begins in a year, so you must find a way to save your homeland before that. The game features nine possible successful endings.  [Natsume]"}, {"name": "Boxing Fever", "details_link": "https://www.metacritic.com/game/game-boy-advance/boxing-fever", "publisher": "Majesco Games", "release_date": "Oct 11 2001", "developers": ["Digital Fiction"], "platforms": "Game Boy Advance", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/a1004e4a2f7ad672a47f7af212859665-98.jpg", "descriptions": "BOXING FEVER is the ultimate fighting challenge for the Nintendo Game Boy Advance system. Take on over eight of the fastest, strongest, and most brutal boxers from all over the world, or challenge your friends in a head to head knock down battle to prove who's the biggest, baddest boxer of all time."}, {"name": "Sega Bass Fishing 2", "details_link": "https://www.metacritic.com/game/dreamcast/sega-bass-fishing-2", "publisher": "Sega", "release_date": "Aug 21 2001", "developers": ["Wow Entertainment"], "platforms": "Dreamcast", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/9d06a53e2fc7f067562baa127d3182e9-98.jpg", "descriptions": "Sega Bass Fishing 2 totally redefines the virtual fishing experience with realistic lakes and life-like ecologies. Watch out-the fish are even smarter this time around! Even with over 100 lures and the freedom to cast anywhere, you'll need every ounce of skill that you have if you want toSega Bass Fishing 2 totally redefines the virtual fishing experience with realistic lakes and life-like ecologies. Watch out-the fish are even smarter this time around! Even with over 100 lures and the freedom to cast anywhere, you'll need every ounce of skill that you have if you want to fill your boat.… Expand"}, {"name": "Toy Story Racer", "details_link": "https://www.metacritic.com/game/playstation/toy-story-racer", "publisher": "Activision", "release_date": "Mar  5 2001", "developers": ["Traveller's Tales"], "platforms": "PlayStation", "genres": ["Driving", "Racing", "Kart"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/cc395c829c30d4ffb7e8c408b70ed700-98.jpg", "descriptions": "It's no Crash Team Racing, but Toy Story Racer provides plenty of challenge for young and old alike."}, {"name": "Star Wars Episode I: Jedi Power Battles", "details_link": "https://www.metacritic.com/game/dreamcast/star-wars-episode-i-jedi-power-battles", "publisher": "LucasArts", "release_date": "Oct 18 2000", "developers": ["LucasArts"], "platforms": "Dreamcast", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/e2783994185dc82a8fa4241861308a19-98.jpg", "descriptions": "Take back the Theed palace in fast and furious lightsaber assaults. You will have the power of the Force and your trusty Jedi saber as you ward off legions of battle droids, destroyer droids, assassins and other creatures from the Star Wars: Episode I worlds."}, {"name": "Star Trek: Invasion", "details_link": "https://www.metacritic.com/game/playstation/star-trek-invasion", "publisher": "Activision", "release_date": "Jun 29 2000", "developers": ["Warthog"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/82300a8f01c39aac02ffa0f4a6e6e029-98.jpg", "descriptions": "Stardate 54101.02\rIt's the 24th Century: Borg vessels are rapidly approaching near space, Romulans are suddenly attacking Federation vessels and a respected Starfleet Captian has turned renagade, taking his ship with him! As a hotshot pilot in the elite Red Squad tactical strike force,Stardate 54101.02\rIt's the 24th Century: Borg vessels are rapidly approaching near space, Romulans are suddenly attacking Federation vessels and a respected Starfleet Captian has turned renagade, taking his ship with him! As a hotshot pilot in the elite Red Squad tactical strike force, under the command of Lt. Commander Worf, you must uncover the plot behind this deadly pattern of events and fight back to save the universe from a doomsday scenario. Flying a prototype single seat combat fighter, codenamed \"Valkyre\", you and your squad members are in for the fight of your lives...… Expand"}, {"name": "Call of Duty: Finest Hour", "details_link": "https://www.metacritic.com/game/playstation-2/call-of-duty-finest-hour", "publisher": "Activision", "release_date": "Nov 16 2004", "developers": ["Spark Unlimited"], "platforms": "PlayStation 2", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/b47f7512600101e0fc565757be51f5ac-98.jpg", "descriptions": "Developed by Spark Unlimited, a newly formed studio comprised of 27 of the individuals who developed titles in the \"Medal of Honor\" series, Call of Duty: Finest Hour is a separate and distinct game from the PC first-person shooter. It features a unique storyline, missions and battlefieldDeveloped by Spark Unlimited, a newly formed studio comprised of 27 of the individuals who developed titles in the \"Medal of Honor\" series, Call of Duty: Finest Hour is a separate and distinct game from the PC first-person shooter. It features a unique storyline, missions and battlefield environments; intense battlefield conflicts; unsung heroes fighting as part of a crack squad through the chaos of battle; playable perspectives from three different allied sides -- American, British, and Russian; authentic weapons, vehicles, environments, combat missions and the real sounds of war. [Activision]… Expand"}, {"name": "Assassin's Creed Syndicate", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-syndicate", "publisher": "Ubisoft", "release_date": "Oct 23 2015", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Action Adventure", "Open-World"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/38762a44c3ccf353d9d1a78e532f4fdd-98.jpg", "descriptions": "1868 London. The Industrial Revolution. An age of invention and wealth, built on the backs of the working class. As gangster killer Jacob Frye, you recruit a gang to fight for justice on behalf of the oppressed working class. Lead the underworld to reclaim London in an adventure filled with1868 London. The Industrial Revolution. An age of invention and wealth, built on the backs of the working class. As gangster killer Jacob Frye, you recruit a gang to fight for justice on behalf of the oppressed working class. Lead the underworld to reclaim London in an adventure filled with action, intrigue and brutal combat. With Jacob as the leader, players can establish UK's fiercest gang, the only force that can challenge the elite and defeat rival gangs to bring freedom to the oppressed folks. Enemy strongholds can be infiltrated by using an arsenal to dominate London’s underworld. From robbing trains to rescuing child workers, players will do everything they can to bring justice to London’s lawless streets. [Ubisoft]… Expand"}, {"name": "Twisted Metal", "details_link": "https://www.metacritic.com/game/playstation-3/twisted-metal", "publisher": "SCEA", "release_date": "Feb 14 2012", "developers": ["Eat Sleep Play"], "platforms": "PlayStation 3", "num_players": "Up to 16 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/fd37ba89e49022a446fd194cee7f55e2-98.jpg", "descriptions": "With four factions battling for control, players step into the combat boots of a twisted disciple in a high octane, highly destructible world. Players fight for the prize of one wish fulfilled by the stylishly evil Calypso, the mastermind behind the Twisted Metal tournament. DisciplesWith four factions battling for control, players step into the combat boots of a twisted disciple in a high octane, highly destructible world. Players fight for the prize of one wish fulfilled by the stylishly evil Calypso, the mastermind behind the Twisted Metal tournament. Disciples strategically dismantle opponents in vehicles loaded with weapons of Twisted destruction.… Expand"}, {"name": "NBA 2K22", "details_link": "https://www.metacritic.com/game/playstation-5/nba-2k22", "publisher": "2K Games", "release_date": "Sep 10 2021", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 76, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/1/7e1c8e0d7cadee624d33bdaa3af36ac2-98.jpg", "descriptions": "Enjoy competitive gameplay, online features, and a variety of game modes, including myCAREER, as you put together your dream team in this  basketball video game. A WORLD OF BASKETBALL. NBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environmentsEnjoy competitive gameplay, online features, and a variety of game modes, including myCAREER, as you put together your dream team in this  basketball video game. A WORLD OF BASKETBALL. NBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environments against authentic teams and players. Build your own dream team in MyTEAM with today’s stars and yesterday’s legends. Live out your own pro journey in MyCAREER and experience your personal rise to the NBA. Flex your management skills as a powerful Executive in MyGM and MyLEAGUE. Anyone, anywhere can hoop in NBA 2K22.… Expand"}, {"name": "Yo-kai Watch", "details_link": "https://www.metacritic.com/game/3ds/yo-kai-watch", "publisher": "Nintendo", "release_date": "Nov  6 2015", "developers": ["Level 5"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Japanese-Style", "Role-Playing", "Trainer"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/bc36ef689d7c4b014d6b923be4ffa90d-98.jpg", "descriptions": "The YO-KAI WATCH game is about hundreds of sometimes cute, sometimes spooky, and usually mischievous Yo-kai that inhabit our world. Yo-kai are not ghosts, monsters or creatures. Yo-kai are, quite simply, Yo-kai. They cannot be seen by the human eye, but they are everywhere. Whether born fromThe YO-KAI WATCH game is about hundreds of sometimes cute, sometimes spooky, and usually mischievous Yo-kai that inhabit our world. Yo-kai are not ghosts, monsters or creatures. Yo-kai are, quite simply, Yo-kai. They cannot be seen by the human eye, but they are everywhere. Whether born from the soul of a deceased human, or an everyday object discovering its higher purpose, their personalities are distinctly humanlike.… Expand"}, {"name": "WindJammers", "details_link": "https://www.metacritic.com/game/playstation-4/windjammers", "publisher": "DotEmu", "release_date": "Aug 29 2017", "developers": ["DotEmu"], "platforms": ["PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Individual", "Other"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/e0a1be6b99b8e3c957d0af3a98a565c6-98.jpg", "descriptions": "A dazzling new game combining the thrills of tennis, the dangers of the discus, and the heart-stopping competition of competition sports. Six of the world's toughest and most clever athletes take court in the most thrilling new sport of the fin-de-seicle! WINDJAMMERS - It will blow you away!"}, {"name": "Super Mario Party", "details_link": "https://www.metacritic.com/game/switch/super-mario-party", "publisher": "Nintendo", "release_date": "Oct  5 2018", "developers": ["Nintendo", "Nd Cube"], "platforms": "Switch", "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/bff689918631e657e2af88cf2e623e02-98.jpg", "descriptions": "The party comes to Nintendo Switch in this complete refresh of the Mario Party series. The Mario Party series is coming to the Nintendo Switch system with super-charged fun for everyone. The original board game style has been kicked up a notch with deeper strategic elements, like specifcThe party comes to Nintendo Switch in this complete refresh of the Mario Party series. The Mario Party series is coming to the Nintendo Switch system with super-charged fun for everyone. The original board game style has been kicked up a notch with deeper strategic elements, like specifc Dice Blocks for each character. The game also introduces all-new ways to play, including Joy-Con controller enabled minigames, and new modes to enjoy with family and friends. Board game play goes back to the four-player basics as you take turns and race across the board searching for Stars. You can also pair up two Nintendo Switch systems and delight in this dynamic play style, such as in the new Toad's Rec Room mode. With new modes and new minigames coupled with original board game play, the party starts anywhere, anytime, and with all kinds of players.\r Features a variety of modes, including:\r* Mario Party: Enjoy the original Mario Party board game experience with new element like character dice blocks, a party system, and new boards to explore\r* Toad's Rec Room: A dynamic new play style that pairs up two Nintendo Switch systems for Table top mode\r* Go head-to-head in 80 new minigames with many ways to play: Fast and fun skill-based mini-games that use the Joy-Con controllers in all sorts of different ways… Expand"}, {"name": "Mario & Luigi: Paper Jam", "details_link": "https://www.metacritic.com/game/3ds/mario-luigi-paper-jam", "publisher": "Nintendo", "release_date": "Jan 22 2016", "developers": ["Nintendo", "Alphadream Corporation"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/f08d5172deab5c24e5637d6e1ad2e362-98.jpg", "descriptions": "Paper Mario jumps out of a book and into the bizarre adventures of Mario & Luigi, resulting in hijinks. Become the superstar team of Mario, Luigi and Paper Mario to take on quests, take down enemies, and untangle these two unique universes in this playful new entry in the Mario & Luigi series."}, {"name": "Weird West", "details_link": "https://www.metacritic.com/game/pc/weird-west", "publisher": "Devolver Digital", "release_date": "Mar 31 2022", "developers": ["Wolfeye Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/2dde4f436067a6d01fb917c31b3e6824-98.jpg", "descriptions": "Survive and unveil the mysteries of the Weird West through the intertwined destinies of its unusual heroes in an immersive sim from the co-creators of Dishonored and Prey. Discover a dark fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantasticalSurvive and unveil the mysteries of the Weird West through the intertwined destinies of its unusual heroes in an immersive sim from the co-creators of Dishonored and Prey. Discover a dark fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantastical creatures. Journey through the origin stories of a group of atypical heroes, written into legend by the decisions you make in an unforgiving land. Each journey is unique and tailored to the actions taken - a series of high stakes stories where everything counts and the world reacts to the choices you make. Form a posse or venture forth alone into an otherworldly confines of the Weird West and make each legend your own.… Expand"}, {"name": "Divinity: Dragon Commander", "details_link": "https://www.metacritic.com/game/pc/divinity-dragon-commander", "publisher": "Larian Studios Games", "release_date": "Aug  6 2013", "developers": ["Larian Studios Games"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/7fcbbc56c8c49d9d3bd7ed6cd5cebdc4-98.jpg", "descriptions": "Set in the time when both magic and technology were at their peak in the Divinity universe, Dragon Commander tells the story of a young dragon knight who fights for the survival of Rivellon when his father, the king, is brutally murdered for opposing the teachings of a new religion. SixSet in the time when both magic and technology were at their peak in the Divinity universe, Dragon Commander tells the story of a young dragon knight who fights for the survival of Rivellon when his father, the king, is brutally murdered for opposing the teachings of a new religion. Six nations - the elves, the dwarves, the imps, the undead, the lizards and the humans - must set aside their differences and unite to stop empress Aurora from taking over the world.… Expand"}, {"name": "Penny Arcade Adventures: Episode One", "details_link": "https://www.metacritic.com/game/xbox-360/penny-arcade-adventures-episode-one", "publisher": "Hothead Games", "release_date": "May 21 2008", "developers": ["Hothead Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Adventure", "General", "General"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/d06eb09334526e27ae1e1a3540ca73b4-98.jpg", "descriptions": "[Xbox Live Arcade]  This first installment of the episodic role-playing adventure game series is set in the highly stylized 1920s universe of New Arcadia filled with bizarre characters, outrageous combat, and adult humor. Create and develop your very own character to participate in the[Xbox Live Arcade]  This first installment of the episodic role-playing adventure game series is set in the highly stylized 1920s universe of New Arcadia filled with bizarre characters, outrageous combat, and adult humor. Create and develop your very own character to participate in the adventure. Penny Arcade Adventures keeps the fun going with new material released regularly, with pick up and play capabilities from any episode, and the ability to carry over your character's appearance, stats, and inventory from episode to episode. The turn-based combat system features over-the-top animations and team-up moves during enemy battles. The classic adventure-style gameplay combines with RPG elements for a mysterious and puzzling good time. The crazed geniuses behind Penny Arcade promise a thrilling and wild ride, with story and dialogue written by written by Jerry \"Tycho\" Holkins and art by Mike \"Gabe\" Krahulik. Working with Gabe and Tycho of the Startling Developments Detective Agency, it will be your job to resolve the chaos and solve the mysteries of New Arcadia. [Hothead Games]… Expand"}, {"name": "Sonic Generations", "details_link": "https://www.metacritic.com/game/playstation-3/sonic-generations", "publisher": "Sega", "release_date": "Nov  1 2011", "developers": ["Sega", "Sonic Team"], "platforms": ["3DS", "PC", "PC", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/4cdba3b69252fac4949a85605d5ed070-98.jpg", "descriptions": "Set across three defining eras from 20 years of Sonic the Hedgehog video game history, the instantly recognisable environments of Sonic Generations have been re-built in stunning HD and are now playable in both classic side scrolling 2D from 1991, as well as modern 3D style found in Sonic'sSet across three defining eras from 20 years of Sonic the Hedgehog video game history, the instantly recognisable environments of Sonic Generations have been re-built in stunning HD and are now playable in both classic side scrolling 2D from 1991, as well as modern 3D style found in Sonic's most recent adventures. Each incarnation of Sonic in Sonic Generations comes complete with his trademark special move, Spin Dash and Spin Attack for Classic Sonic, and Homing Attack and Sonic Boost for Modern Sonic. An innovative new interactive menu system allows for complete immersion in Sonic's universe with favourite characters and hidden treasures gradually being revealed throughout the game. … Expand"}, {"name": "The Suffering: Ties That Bind", "details_link": "https://www.metacritic.com/game/xbox/the-suffering-ties-that-bind", "publisher": "Midway", "release_date": "Sep 26 2005", "developers": ["Surreal Software"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/7b4f22e899d10c4577c31077fc2f9bd7-98.jpg", "descriptions": "The Suffering: Ties That Bind is the sequel to the action horror game The Suffering. This time, you must defeat a host of abominable creatures through spooky 3D environments set in a prison in Baltimore. The game lets you choose to be good or evil, and your choice affects your abilities asThe Suffering: Ties That Bind is the sequel to the action horror game The Suffering. This time, you must defeat a host of abominable creatures through spooky 3D environments set in a prison in Baltimore. The game lets you choose to be good or evil, and your choice affects your abilities as well as the storyline. Ties that Bind also features vehicle combat and more combat controls. … Expand"}, {"name": "Sushi Striker: The Way of Sushido", "details_link": "https://www.metacritic.com/game/switch/sushi-striker-the-way-of-sushido", "publisher": "Nintendo", "release_date": "Jun  8 2018", "developers": ["indieszero"], "platforms": ["3DS", "Switch"], "num_players": "2 ", "genres": ["Puzzle", "Matching"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/e772ab61516e527f432adfc2c91db2c9-98.jpg", "descriptions": "Help Musashi end the Empire's tyrannical monopoly of the world's sushi supply by becoming a Sushi Striker! Devour conveyor-belt sushi, matching plates and sushi types to defeat any enemy or boss who stands between you and victory. Befriend Sushi Sprites and use their powerful skills inHelp Musashi end the Empire's tyrannical monopoly of the world's sushi supply by becoming a Sushi Striker! Devour conveyor-belt sushi, matching plates and sushi types to defeat any enemy or boss who stands between you and victory. Befriend Sushi Sprites and use their powerful skills in battle. Deliciously strategic action-RPG-puzzle battles await!… Expand"}, {"name": "Donkey Konga", "details_link": "https://www.metacritic.com/game/gamecube/donkey-konga", "publisher": "Nintendo", "release_date": "Sep 27 2004", "developers": ["Namco"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/b1bb902182402e2e4e05ea867cc26b46-98.jpg", "descriptions": "Join Donkey and Diddy Kong as they drum their way through both old and new hits. With the new DK Bongo drum controller, you can drum and clap through this musical adventure. The game features songs that range from kids' medleys to classical and pop music. Connect up to four DK BongoJoin Donkey and Diddy Kong as they drum their way through both old and new hits. With the new DK Bongo drum controller, you can drum and clap through this musical adventure. The game features songs that range from kids' medleys to classical and pop music. Connect up to four DK Bongo controllers for single-player jam sessions or multiplayer matches. Only you can help Donkey and Diddy realize their dream of becoming famous, earning money, and buying all the bananas they could ever want.… Expand"}, {"name": "Zuma's Revenge!", "details_link": "https://www.metacritic.com/game/xbox-360/zumas-revenge!", "publisher": "PopCap", "release_date": "Jul 11 2012", "developers": ["PopCap"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/32b62b7fab6b7ec8f8e53ced45e4cf08-98.jpg", "descriptions": "In Zuma the player takes the role of a fearless ball-shooting frog, exploring ancient temples and ruins."}, {"name": "MLB 12: The Show", "details_link": "https://www.metacritic.com/game/playstation-vita/mlb-12-the-show", "publisher": "SCEA", "release_date": "Mar  6 2012", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 3", "PlayStation Vita"], "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/2a3ce32bf2868fc20114a7c53a7799fc-98.jpg", "descriptions": "MLB 12 The Show builds on what has been delivered in previous franchise releases, adding compelling features that bring unparalleled innovation."}, {"name": "World of Tanks", "details_link": "https://www.metacritic.com/game/xbox-one/world-of-tanks", "publisher": "Wargaming.net", "release_date": "Jul 28 2015", "developers": ["Wargaming.net"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox 360", "Xbox One"], "genres": ["Action", "Simulation", "Shooter", "Vehicle", "Third-Person", "Combat", "Tactical"], "meta_score": 76, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/84930e887d223ead2d079d702ffc71ff-98.jpg", "descriptions": "World of Tanks on Xbox One features hundreds of tanks recreated in realistic detail, presented in high-definition. The title also features a number of firsts, including cross-platform gameplay-bridging battles between Xbox 360 and Xbox One players, shared progress and content between the twoWorld of Tanks on Xbox One features hundreds of tanks recreated in realistic detail, presented in high-definition. The title also features a number of firsts, including cross-platform gameplay-bridging battles between Xbox 360 and Xbox One players, shared progress and content between the two platforms through a single Xbox Live account, an all-new “Proving Grounds” Player versus Environment (PvE) mode, full social and streaming support offered by the Xbox One platform, and more.… Expand"}, {"name": "NHL 07", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-07", "publisher": "EA Sports", "release_date": "Sep 12 2006", "developers": ["EA Sports"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 76, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/4b7fa197998d8710200082f9917c6110-98.jpg", "descriptions": "The golden age of console hockey returns with NHL 07, featuring gameplay innovations that make players feel like they are actually on the ice. Featuring an unmatched level of freedom and control, NHL 07 allows hockey purists and casual fans alike to feel like they can play like a pro.The golden age of console hockey returns with NHL 07, featuring gameplay innovations that make players feel like they are actually on the ice. Featuring an unmatched level of freedom and control, NHL 07 allows hockey purists and casual fans alike to feel like they can play like a pro. [Electronic Arts]… Expand"}, {"name": "The Denpa Men 2: Beyond the Waves", "details_link": "https://www.metacritic.com/game/3ds/the-denpa-men-2-beyond-the-waves", "publisher": "Genius Sonority Inc.", "release_date": "May 30 2013", "developers": ["Genius Sonority Inc."], "platforms": "3DS", "genres": ["Role-Playing", "General", "General"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/124c48f2ccbd5a53e11157b75e230232-98.jpg", "descriptions": "The Denpa Men are mysterious little creatures that float around radio waves. They all have their own territory. You can't see them with the naked eye, but you can use your 3DS to find them and catch them.\r In this RPG, you can form a team of the Denpa Men you caught and take them on anThe Denpa Men are mysterious little creatures that float around radio waves. They all have their own territory. You can't see them with the naked eye, but you can use your 3DS to find them and catch them.\r In this RPG, you can form a team of the Denpa Men you caught and take them on an exciting adventure across the world, in order to save the hero's family. Many wonders and strong enemies await you on your journey!\rThis game supports StreetPass as well. By passing other players, you can exchange your party information and increase the amount of time you have to explore special dungeons.\r You can even battle online now! All you have to do is register for battle, and you'll be able to fight other players at any time you want. Keep winning to earn phenomenal prizes!\r If you played the previous game, \"THE 'DENPA' MEN: They Came By Wave,\" you'll be able to transfer your hero and you'll even be able to bring all of your friends from the previous game into this one!… Expand"}, {"name": "Singularity", "details_link": "https://www.metacritic.com/game/xbox-360/singularity", "publisher": "Activision", "release_date": "Jun 29 2010", "developers": ["Raven Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/1e40e0c538637e48c77eb76bf5a12649-98.jpg", "descriptions": "On a clandestine mission deep into Russian territory, an American black ops team crash lands on an island research base that was mysteriously abandoned in the 1950’s. Cut off from the outside and under attack by an army of nightmarish creatures, Captain Nathaniel Renko is forced to battleOn a clandestine mission deep into Russian territory, an American black ops team crash lands on an island research base that was mysteriously abandoned in the 1950’s. Cut off from the outside and under attack by an army of nightmarish creatures, Captain Nathaniel Renko is forced to battle his way through the hostile territory armed with the TMD (Time Manipulation Device) – a time altering weapon created over 50 years ago. Who created the TMD and why is just one of the many Cold War secrets Renko must uncover as he is thrown back and forth across time, making choices that will alter the course of world history. [Raven Software]… Expand"}, {"name": "Rush for Berlin", "details_link": "https://www.metacritic.com/game/pc/rush-for-berlin", "publisher": "Paradox Interactive", "release_date": "Jun 12 2006", "developers": ["Stormregion"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/818929d23792cb30f703e2fa12ca64cf-98.jpg", "descriptions": "From the creators of \"Codename: Panzers\", Rush for Berlin is a tactical real time strategy game, set on the European battlefields of World War II, during 1944-45. The player’s goal; to capture the German capital, as either the British/US/French alliance or the Red army of the Soviet Union.From the creators of \"Codename: Panzers\", Rush for Berlin is a tactical real time strategy game, set on the European battlefields of World War II, during 1944-45. The player’s goal; to capture the German capital, as either the British/US/French alliance or the Red army of the Soviet Union. The act symbolizes the total defeat of the Third Reich and means the end of the war on the European continent. Players face more and more challenges, as they get closer to the capital. The game is based on historical facts and gives wide possibilities for changing history and playing an alternative reality. [Deep Silver]… Expand"}, {"name": "Evil Dead: The Game", "details_link": "https://www.metacritic.com/game/pc/evil-dead-the-game", "publisher": "Saber Interactive", "release_date": "May 13 2022", "developers": ["Saber Interactive"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Survival"], "meta_score": 76, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/7/8f71f8ceb1903dcee37df68bfcda4d39-98.jpg", "descriptions": "Step into the shoes of Ash Williams or his friends from the iconic Evil Dead franchise and work together in a game loaded with over-the-top co-op and PVP multiplayer action! Play as a team of four survivors, exploring, looting, crafting, managing your fear, and finding key items to seal theStep into the shoes of Ash Williams or his friends from the iconic Evil Dead franchise and work together in a game loaded with over-the-top co-op and PVP multiplayer action! Play as a team of four survivors, exploring, looting, crafting, managing your fear, and finding key items to seal the breach between worlds in a game inspired by all three original Evil Dead films as well as the Starz original Ash vs Evil Dead television series.\r ICONIC CHARACTERS\rPlay as characters from throughout the Evil Dead universe, including Ash, Scotty, Lord Arthur, Kelly Maxwell, Pablo Simon Bolivar, and more, with new dialogue performed by Bruce Campbell and others!\r PLAY AS GOOD OR EVIL...\rFight for the forces of good or take control of the powerful Kandarian Demon to hunt Ash and other players while possessing Deadites, the environment, and even the survivors themselves as you seek to swallow their souls!\r OVER THE TOP VISUALS\rWhether you're tearing a Deadite in two with Ash's famous chainsaw hand or flying through the map as the Kandarian Demon in spirit form, the game captures the look and feel of the Evil Dead franchise in all its glory, with realistic visuals and a physics-based gore system that brings the horror to life! \r\rTHIS...IS MY BROOMSTICK!\rBrandish your short barrel shotgun, chainsaw, cleavers and more to do some delightfully gruesome violence against the armies of darkness.\r Evil Dead: The Game features multiplayer co-op and PvP for PC, Xbox One, Xbox X|S, PlayStation 4, PlayStation 5, and Nintendo Switch.… Expand"}, {"name": "Control: AWE", "details_link": "https://www.metacritic.com/game/playstation-4/control-awe", "publisher": "505 Games", "release_date": "Aug 27 2020", "developers": ["Remedy Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/ab75e6cb0967dba9bd6a09e9f1b58237-98.jpg", "descriptions": "The Bureau studied its most dangerous Altered World Events in this lost sector. The records were sealed, the objects contained, and their powers abandoned. Now, the sector is breached and the objects are loose…\rAWE brings new story content and side missions as well as new weapons and modsThe Bureau studied its most dangerous Altered World Events in this lost sector. The records were sealed, the objects contained, and their powers abandoned. Now, the sector is breached and the objects are loose…\rAWE brings new story content and side missions as well as new weapons and mods to the world of Control.… Expand"}, {"name": "Masquerada: Songs and Shadows", "details_link": "https://www.metacritic.com/game/playstation-4/masquerada-songs-and-shadows", "publisher": "Ysbryd Games", "release_date": "Aug  8 2017", "developers": ["Witching Hour Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/807533708a04cc7b01ab4d9b0336338e-98.jpg", "descriptions": "Masquerada is a single-player tactical RPG adventure where real-time combat can be paused for tactics with Venetian-styled masks that grant deadly magic."}, {"name": "Strong Bad's Cool Game for Attractive People Episode 1: Homestar Ruiner", "details_link": "https://www.metacritic.com/game/wii/strong-bads-cool-game-for-attractive-people-episode-1-homestar-ruiner", "publisher": "Telltale Games", "release_date": "Aug 11 2008", "developers": ["Telltale Games"], "platforms": ["PC", "PlayStation 3", "Wii"], "num_players": "1 Player", "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/7a81c311051d77813ad1a1896c05ae43-98.jpg", "descriptions": "[WiiWare] Charming. Suave. Awesome. These are the words Strong Bad would use to describe himself. In a world gone mad, only one man can be trusted to save the day. A man with an attitude. A man called Strong Bad. As the star of the Homestar Runner Web cartoons, Strong Bad has been answering[WiiWare] Charming. Suave. Awesome. These are the words Strong Bad would use to describe himself. In a world gone mad, only one man can be trusted to save the day. A man with an attitude. A man called Strong Bad. As the star of the Homestar Runner Web cartoons, Strong Bad has been answering e-mails (in boxing gloves), pranking his friends, pummeling his enemies, and making people with questionable taste snort milk out of their noses for years now. And he's branched out to star in Strong Bad's Cool Game for Attractive People, a monthly five-episode series. In Episode 1: Homestar Ruiner, Strong Bad's plans to beat the snot out of Homestar backfire, and he ends up with an unwanted houseguest cramping his style. Now he needs to get life back to normal by any means possible. But wait, there's more: Teen Girl Squad comics, achievements, funny costumes and arcade games. You can even send pictures and messages to Wii Friends using Strong Bad's computer. So how about it? Can you handle Strong Bad's style? [Nintendo]… Expand"}, {"name": "Wolfenstein: The Old Blood", "details_link": "https://www.metacritic.com/game/playstation-4/wolfenstein-the-old-blood", "publisher": "Bethesda Softworks", "release_date": "May  5 2015", "developers": ["MachineGames"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/09227e0cceb35656a34f063dfdee3da1-98.jpg", "descriptions": "It's 1946 and the Nazis are on the verge of winning WWII. In attmepting to turn the tide in the allies’ favor, B.J. Blazkowicz has to embark on an epic, two-part mission deep within Bavaria… Part one of Wolfenstein: The Old Blood - Rudi Jäger and the Den of Wolves - pits BJ BlazkowiczIt's 1946 and the Nazis are on the verge of winning WWII. In attmepting to turn the tide in the allies’ favor, B.J. Blazkowicz has to embark on an epic, two-part mission deep within Bavaria… Part one of Wolfenstein: The Old Blood - Rudi Jäger and the Den of Wolves - pits BJ Blazkowicz against a notorious prison warden as he breaks into Castle Wolfenstein in an attempt to steal the coordinates to General Deathshead’s compound. In the second part – The Dark Secrets of Helga Von Schabbs – our hero's search for the coordinates leads him to the city of Wulfburg where an obsessed Nazi archaeologist is exhuming enigmatic artifacts that threaten to unleash a dark and ancient power.… Expand"}, {"name": "Tales From Space: About a Blob", "details_link": "https://www.metacritic.com/game/playstation-3/tales-from-space-about-a-blob", "publisher": "DrinkBox Studios", "release_date": "Feb  8 2011", "developers": ["DrinkBox Studios"], "platforms": "PlayStation 3", "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/38838b70fdd1c2b2ad033ca2a679abd7-98.jpg", "descriptions": "Tales from Space: About a Blob is a game about a race of alien blobs that land on an Earth-like planet and start eating everything around them. Eating is just what Blobs do - they can't really help themselves. Although the Blobs aren't really out to hurt anyone, mistrustful humans greet themTales from Space: About a Blob is a game about a race of alien blobs that land on an Earth-like planet and start eating everything around them. Eating is just what Blobs do - they can't really help themselves. Although the Blobs aren't really out to hurt anyone, mistrustful humans greet them with hostility.… Expand"}, {"name": "NBA 2K22", "details_link": "https://www.metacritic.com/game/xbox-series-x/nba-2k22", "publisher": "2K Games", "release_date": "Sep 10 2021", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 76, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/2/23ee4fdfb79c67cb002a1a139d530e99-98.jpg", "descriptions": "Enjoy competitive gameplay, online features, and a variety of game modes, including myCAREER, as you put together your dream team in this  basketball video game. A WORLD OF BASKETBALL. NBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environmentsEnjoy competitive gameplay, online features, and a variety of game modes, including myCAREER, as you put together your dream team in this  basketball video game. A WORLD OF BASKETBALL. NBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environments against authentic teams and players. Build your own dream team in MyTEAM with today’s stars and yesterday’s legends. Live out your own pro journey in MyCAREER and experience your personal rise to the NBA. Flex your management skills as a powerful Executive in MyGM and MyLEAGUE. Anyone, anywhere can hoop in NBA 2K22.… Expand"}][{"name": "Mutazione", "details_link": "https://www.metacritic.com/game/playstation-4/mutazione", "publisher": "Die Gute Fabrik", "release_date": "Sep 19 2019", "developers": ["Die Gute Fabrik"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/f87a7c271defb8eb23303b308bb3d40d-98.jpg", "descriptions": "A mutant soap opera where small-town gossip meets the supernatural. Join Kai as she arrives in the mysterious community of Mutazione to care for her ailing grandfather. Discover scenic hangouts, magical gardens, new friends, and old secrets… They can survive an apocalyptic meteor strike, butA mutant soap opera where small-town gossip meets the supernatural. Join Kai as she arrives in the mysterious community of Mutazione to care for her ailing grandfather. Discover scenic hangouts, magical gardens, new friends, and old secrets… They can survive an apocalyptic meteor strike, but can they survive their small-town drama?… Expand"}, {"name": "Friday the 13th: Killer Puzzle", "details_link": "https://www.metacritic.com/game/switch/friday-the-13th-killer-puzzle", "publisher": "Blue Wizard Digital", "release_date": "Oct 25 2018", "developers": ["Blue Wizard Digital"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/05974f11dd7d12cd6339aebee4ed2930-98.jpg", "descriptions": "Jason is Back in the Goriest. Puzzle Game Ever Made. Become horror icon Jason Voorhees and stalk campers across 150+ levels in the most gruesome puzzle game ever! Solve murderlicious puzzles to rank-up and unlock new weapons and special attacks. Help Jason terrorize victims from theJason is Back in the Goriest. Puzzle Game Ever Made. Become horror icon Jason Voorhees and stalk campers across 150+ levels in the most gruesome puzzle game ever! Solve murderlicious puzzles to rank-up and unlock new weapons and special attacks. Help Jason terrorize victims from the campgrounds of Crystal Lake to the high-rises of Manhattan, from supermax prisons to space stations... and beyond. Friday the 13th: Killer Puzzle is developed by the twisted minds behind the darkly hilarious indie hit SLAYAWAY CAMP. … Expand"}, {"name": "Life is Strange: Episode 4 - Dark Room", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-episode-4---dark-room", "publisher": "Square Enix", "release_date": "Jul 28 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/c0a545b3ba93f16fcddd77e2ff9757fc-98.jpg", "descriptions": "Darkroom follows the antics of series protagonist, Max, as she attempts to uncover the mystery behind the disappearance of Rachel Amber and get to the bottom of the bizarre happenings in Arcadia Bay. With the ‘End of the World’ party on the horizon, time is running out for Max to become theDarkroom follows the antics of series protagonist, Max, as she attempts to uncover the mystery behind the disappearance of Rachel Amber and get to the bottom of the bizarre happenings in Arcadia Bay. With the ‘End of the World’ party on the horizon, time is running out for Max to become the saviour of the town.… Expand"}, {"name": "Clustertruck", "details_link": "https://www.metacritic.com/game/pc/clustertruck", "publisher": "tinyBuild", "release_date": "Sep 27 2016", "developers": ["LandFall Games", "LandFall"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/912c37da017400aa516242c62c062cc6-98.jpg", "descriptions": "ClusterTruck is a chaotic physics based truckformer. Jump your way through insane levels in a game of \"the floor is lava\" on top of speeding trucks driven by terrible drivers."}, {"name": "Contra ReBirth", "details_link": "https://www.metacritic.com/game/wii/contra-rebirth", "publisher": "Konami", "release_date": "Sep  7 2009", "developers": ["M2"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Platformer", "Shooter", "Scrolling", "2D", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/291120fc404ee0d8a0e532fc9bfd9cac-98.jpg", "descriptions": "[WiiWare]  In Contra Rebirth, Chief Salamander and his Neo-Salamander Force travel back to 1973 AD to invade Earth. They land in Central America and take control of the Shizuoka ruins on the Yucatan Peninsula. There, the aliens plan the destruction of all the \"Contra\" on Earth. The Galactic[WiiWare]  In Contra Rebirth, Chief Salamander and his Neo-Salamander Force travel back to 1973 AD to invade Earth. They land in Central America and take control of the Shizuoka ruins on the Yucatan Peninsula. There, the aliens plan the destruction of all the \"Contra\" on Earth. The Galactic President calls on Lance Bean, a member of the elite \"Contra\" warriors to save the Earth, but his sudden disappearance jeopardizes the safety of the planet. Now, Bill Rizer and the samurai, Genbei Yagyu are the last hope for Earth and must pick up their weapons and defeat the evil Neo-Salamander Army before all is lost. Experience the fast paced action packed 2D side scrolling adventure that pioneered the Run'N Gun Genre. [Konami]… Expand"}, {"name": "FIFA World Cup: Germany 2006", "details_link": "https://www.metacritic.com/game/gamecube/fifa-world-cup-germany-2006", "publisher": "Electronic Arts", "release_date": "Apr 24 2006", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 76, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/faa60af30a7bfd480d15a4abbf8c814a-98.jpg", "descriptions": "2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA SPORTS has emulated close to 100 of the world's superstars, capturing their playing styles and individual likenesses. In addition to enabling gamers to participate in the 2006 FIFA World Cup Germany by taking control of one of 127 national teams, the game features new compelling modes of play, including the groundbreaking Global Challenge that tests even the most hardcore soccer fan by recreating classic moments in FIFA World Cup history. Furthermore, the game supports up to eight-way multiplayer matches and features a plethora of in-game unlockable content such as legendary players and exclusive apparel.… Expand"}, {"name": "Harvest Moon: Animal Parade", "details_link": "https://www.metacritic.com/game/wii/harvest-moon-animal-parade", "publisher": "Natsume", "release_date": "Nov 12 2009", "developers": ["Natsume", "Marvelous Entertainment"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Breeding/Constructing", "General", "Management", "Breeding/Constructing", "Business / Tycoon"], "meta_score": 76, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/48309de85b67f95084d57fc5b43e7a58-98.jpg", "descriptions": "In Harvest Moon: Animal Parade, the divine tree which once stood in the middle of the Harvest Goddess' pond is weakening, the creatures are beginning to leave the land, and the five bells have lost their power. The Harvest Goddess believes that only the strength of the Harvest King can helpIn Harvest Moon: Animal Parade, the divine tree which once stood in the middle of the Harvest Goddess' pond is weakening, the creatures are beginning to leave the land, and the five bells have lost their power. The Harvest Goddess believes that only the strength of the Harvest King can help revive the earth and bring the tree back to life. It's up to the player to help the Harvest Sprites ring the five mystical bells, summon the Harvest King, and revive the Harvest Goddess' tree and the land. Players find plenty of activities in Harvest Moon: Animal Parade, including cultivating crops and caring for wild and exotic animals such as penguins, pandas, and monkeys. Players can take their exotic animals out for walks, teach them tricks, and even ride some of them around town! When the circus rolls into town, players also need to help the ringmaster find the escaped animals. Befriend the lion, giraffe, and hippopotamus to save the show! The game also lets players take and share pictures over WiiConnect24. Players can take pictures of their farm, their family, or their village and show them off online. [Natsume]… Expand"}, {"name": "Ratchet & Clank Future: Quest for Booty", "details_link": "https://www.metacritic.com/game/playstation-3/ratchet-clank-future-quest-for-booty", "publisher": "SCEA", "release_date": "Aug 21 2008", "developers": ["Insomniac Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/56d3718eb51d6ba07ad22243aae204d1-98.jpg", "descriptions": "[Playstation Network]  The swashbuckling action in Ratchet & Clank Future: Quest for Booty begins one year following the intense ending in Ratchet & Clank Future: Tools of Destruction. Ratchet's desperate search for Clank resumes with a bang as he finds himself engulfed in ship-board combat[Playstation Network]  The swashbuckling action in Ratchet & Clank Future: Quest for Booty begins one year following the intense ending in Ratchet & Clank Future: Tools of Destruction. Ratchet's desperate search for Clank resumes with a bang as he finds himself engulfed in ship-board combat -- only to be cast adrift and washed up on the shores of a remote island on the planet Merdegraw. Our Lombax hero must overcome life-threatening challenges, encounter hostile new alien races and even form an allegiance with dreaded Captain Slag’s first mate, Rusty Pete. All in the pursuit of clues that lead Ratchet to the treasure of Captain Angstrom Darkwater, Slag's former commander and keeper of the only known link to the mysterious Zoni: the Fulcrum Star. Push, pull, and manipulate objects as you solve various puzzles using Ratchet's new wrench. New Light/Dark gameplay: Illuminate dark areas and use your wits to survive encounters with enemies that live in the dark. New Pirate Puzzles: Mix brew, manipulate shadows, and play tunes to find hidden booty. [SCEA]… Expand"}, {"name": "L.A. Noire", "details_link": "https://www.metacritic.com/game/playstation-4/la-noire", "publisher": "Rockstar Games", "release_date": "Nov 14 2017", "developers": ["Team Bondi"], "platforms": ["PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Third-Person"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/fdfbe577f8841c6f2ae8f780a76be294-98.jpg", "descriptions": "Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right,Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right, Phelps must unravel the truth behind a string of arson attacks, racketeering conspiracies and brutal murders, battling the L.A. underworld and even members of his own department to uncover a secret that could shake the city to its rotten core. Using groundbreaking new animation technology that captures every nuance of an actor's facial performance in astonishing detail, L.A. Noire is a violent crime thriller that blends breathtaking action with true detective work to deliver an unprecedented interactive experience. Search for clues, chase down suspects and interrogate witnesses as you struggle to find the truth in a city where everyone has something to hide.… Expand"}, {"name": "Resident Evil 5: Desperate Escape", "details_link": "https://www.metacritic.com/game/xbox-360/resident-evil-5-desperate-escape", "publisher": "Capcom", "release_date": "Mar  3 2010", "developers": ["Capcom"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/3cfcbaa4b608e47fc2720aa510ee1267-98.jpg", "descriptions": "[Xbox Live Arcade]  This is the second installment of new content for Resident Evil 5. After Jill Valentine is rescued by Chris Redfield, he leaves her to finish his mission. Find out how she made it out on her own, and what role Josh Stone played in her escape. This package also allows you[Xbox Live Arcade]  This is the second installment of new content for Resident Evil 5. After Jill Valentine is rescued by Chris Redfield, he leaves her to finish his mission. Find out how she made it out on her own, and what role Josh Stone played in her escape. This package also allows you to unlock two new characters in the all-new The Mercenaries Reunion. Play as one of the stars of Resident Evil 0, Rebecca Chambers, or take on the role of Delta Team's commander, Josh Stone. There are also additional figures available in Extra Figures to round out this action-packed package.… Expand"}, {"name": "Scarface: The World Is Yours", "details_link": "https://www.metacritic.com/game/xbox/scarface-the-world-is-yours", "publisher": "Vivendi Games", "release_date": "Oct  8 2006", "developers": ["Radical Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 76, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/3f45ca4c9cb102b6d4e719cb818d5b3f-98.jpg", "descriptions": "In a complex world filled with excess and greed, players can take the role of Tony Montana, one of the most ruthless gangsters ever depicted on film. Highly acclaimed screenwriter, David McKenna, has written an original event-driven storyline for the interactive game that leads the playerIn a complex world filled with excess and greed, players can take the role of Tony Montana, one of the most ruthless gangsters ever depicted on film. Highly acclaimed screenwriter, David McKenna, has written an original event-driven storyline for the interactive game that leads the player through a sordid underworld. The Scarface video game creates a gameplay environment that authentically recreates the historical time period of the film, touching on politics, news items and events of the day. Players travel through the steamy, often violent streets of Miami, the irie islands of the Florida Keys, the Bahamas and various other locales and interact with a world full of seedy and dangerous characters to procure information, negotiate business deals, smuggle contraband and avoid rivals and DEA on a mission to rebuild their fallen empire.… Expand"}, {"name": "Call of Duty: Modern Warfare - Reflex Edition", "details_link": "https://www.metacritic.com/game/wii/call-of-duty-modern-warfare---reflex-edition", "publisher": "Activision", "release_date": "Nov 10 2009", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "10  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/fe11e262dc4775ddf92bfd311aba924f-98.jpg", "descriptions": "Call of Duty: Modern Warfare - Reflex for Wii arms you with an arsenal of advanced and powerful weaponry and transports you to the most dangerous hotspots around the globe to take on a rogue enemy threatening the world. As both a U.S. Marine and British S.A.S soldier fighting through anCall of Duty: Modern Warfare - Reflex for Wii arms you with an arsenal of advanced and powerful weaponry and transports you to the most dangerous hotspots around the globe to take on a rogue enemy threatening the world. As both a U.S. Marine and British S.A.S soldier fighting through an unfolding story full of twists and turns, use sophisticated technology, superior firepower, and coordinated land and air strikes on a battlefield where speed, accuracy, and communication are essential to victory. Continue the fight online over the Nintendo Wi-Fi Connection for unrivaled multiplayer gameplay.… Expand"}, {"name": "Persona 5 Strikers", "details_link": "https://www.metacritic.com/game/pc/persona-5-strikers", "publisher": "Atlus", "release_date": "Feb 23 2021", "developers": ["Omega Force"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/5ecab99fb73fed832b23a8490a0afca9-98.jpg", "descriptions": "The sequel to the international smash-hit Persona 5 (3.2 million copies world-wide) is now available as the series' first action RPG! Featuring an all-new story set up half a year after the events of P5! \r\rTravel Japan! \rFollowing the events of P5, the Phantom Thieves of Hearts gatherThe sequel to the international smash-hit Persona 5 (3.2 million copies world-wide) is now available as the series' first action RPG! Featuring an all-new story set up half a year after the events of P5! \r\rTravel Japan! \rFollowing the events of P5, the Phantom Thieves of Hearts gather once more during their summer break to solve the mystery behind new change of heart cases that are occurring all over Japan! \r\rPersona 5 is now an action RPG!\rThe new action battle system makes hitting enemy weak points to activate a 1 More or All-Out Attack, which fans have come to love, even easier!\r You can even use Baton Pass to play as other characters!\rIn the newly introduced Jails, you can switch controls between characters at any time! Clear the game with style by using different characters in unique situations!\r \rNew character! \rWho is this new mysterious girl you meet in the Shibuya of the other world? Find out as she fights alongside you as the newest member of the Phantom Thieves of Hearts!… Expand"}, {"name": "Mafia: Definitive Edition", "details_link": "https://www.metacritic.com/game/playstation-4/mafia-definitive-edition", "publisher": "2K Games", "release_date": "Sep 25 2020", "developers": ["Hangar 13"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/3184592b1c1d78e923fffdfe4f813f7b-98.jpg", "descriptions": "Part one of the Mafia crime saga - 1930s, Lost Heaven, IL Re-made from the ground up, rise through the ranks of the Mafia during the Prohibition era of organized crime. After a run-in with the mob, cab driver Tommy Angelo is thrust into a deadly underworld. Initially uneasy about falling inPart one of the Mafia crime saga - 1930s, Lost Heaven, IL Re-made from the ground up, rise through the ranks of the Mafia during the Prohibition era of organized crime. After a run-in with the mob, cab driver Tommy Angelo is thrust into a deadly underworld. Initially uneasy about falling in with the Salieri crime family, Tommy soon finds that the rewards are too big to ignore.  Play a Mob Movie:\rLive the life of a Prohibition-era gangster and rise through the ranks of the Mafia.  \rLost Heaven, IL:\rRecreated 1930's cityscape, filled with interwar architecture, cars and culture to see, hear and interact with. \rRe-Made Classic:\rFaithfully recreated, with expanded story, gameplay and original score. This is the Mafia you remembered and much more.… Expand"}, {"name": "Axiom Verge 2", "details_link": "https://www.metacritic.com/game/switch/axiom-verge-2", "publisher": "Tom Happ", "release_date": "Aug 11 2021", "developers": ["Tom Happ"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/e5c3d661da3049cd67741fe8847dbbf6-98.jpg", "descriptions": "Life. Afterlife. Real. Virtual. Dream. Nightmare. It’s a thin line. It’s Axiom Verge 2. The sequel to Axiom Verge, Axiom Verge 2 expands on the universe with completely new characters, abilities, and gameplay."}, {"name": "Call of Duty: Black Ops II - Uprising", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops-ii---uprising", "publisher": "Activision", "release_date": "Apr 16 2013", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Arcade"], "meta_score": 76, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/61159b89f82bbd4f67d56fadce3f33ab-98.jpg", "descriptions": "The most anticipated game of the year and the most ambitious Call of Duty game ever, Call of Duty: Black Ops II is coming to Wii U. Launching this November 18th, Call of Duty: Black Ops II delivers the most groundbreaking and viscerally immersive Call of duty experience yet. Rooted inThe most anticipated game of the year and the most ambitious Call of Duty game ever, Call of Duty: Black Ops II is coming to Wii U. Launching this November 18th, Call of Duty: Black Ops II delivers the most groundbreaking and viscerally immersive Call of duty experience yet. Rooted in near-future fiction, the title propels players into a visual landscape in an epic single player campaign highlighted by branching storylines and non-linear missions; a re-imagined multiplayer that introduces players to some of the most cutting-edge weaponry and equipment that 2025 will have to offer; and punctuated with an all-new Zombies experience running in the multiplayer engine.… Expand"}, {"name": "Miasmata", "details_link": "https://www.metacritic.com/game/pc/miasmata", "publisher": "IonFX", "release_date": "Nov 28 2012", "developers": ["IonFX"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Sci-Fi"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/ff492c229d4433340700354d9b5dc638-98.jpg", "descriptions": "Miasmata is a first-person survival/adventure game, developed from the ground-up by brothers Joe and Bob Johnson. You play as Robert Hughes, a plague-stricken scientist on a journey to discover a cure. Your adventure begins on the shores of a remote and mysterious island."}, {"name": "Madden NFL 20", "details_link": "https://www.metacritic.com/game/playstation-4/madden-nfl-20", "publisher": "Electronic Arts", "release_date": "Jul 30 2019", "developers": ["Electronic Arts"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Sports", "General", "Team", "Football", "Sim"], "meta_score": 76, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/4/e581fadaae09a1cd92585729c5db98f8-98.jpg", "descriptions": "Take the journey of an NFL superstar. Create a college quarterback and dominate the College Football Playoff, then impress the scouts at the NFL Combine. Find out where your story begins at the NFL Draft, and then fight to prove you belong in the league. Last long enough and you just mightTake the journey of an NFL superstar. Create a college quarterback and dominate the College Football Playoff, then impress the scouts at the NFL Combine. Find out where your story begins at the NFL Draft, and then fight to prove you belong in the league. Last long enough and you just might leave a legacy and even play in a few Pro Bowls. This new and customizable career campaign is all about you, with personalized playable scenarios, events, and dynamic challenges. The choices you make early on will affect how your career pans out.… Expand"}, {"name": "Burnout Dominator", "details_link": "https://www.metacritic.com/game/playstation-2/burnout-dominator", "publisher": "Electronic Arts", "release_date": "Mar  6 2007", "developers": ["Criterion Games"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/a4f8ed7c773bc6a579b0966d77dd10b3-98.jpg", "descriptions": "Burnout Dominator is the next installment in the legendary Burnout series, loaded with intense racing action and dozens of retina-searing World Tour events. Burnout Dominator challenges gamers to face off against a series of hot-blooded rivals in brutal tests of aggressive driving techniquesBurnout Dominator is the next installment in the legendary Burnout series, loaded with intense racing action and dozens of retina-searing World Tour events. Burnout Dominator challenges gamers to face off against a series of hot-blooded rivals in brutal tests of aggressive driving techniques where performing burnouts gives you the advantage and multiplies your score potential. For the ultimate nerve-wracking experience, Burnout Dominator takes you to the very edge of control, punishing the smallest mistakes and rewarding drivers for taking outrageous risks. [Electronic Arts]… Expand"}, {"name": "Gun", "details_link": "https://www.metacritic.com/game/pc/gun", "publisher": "Activision", "release_date": "Nov  8 2005", "developers": ["Neversoft Entertainment", "Beenox"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/aad9119ee5ed9b1363a89b20f04650ac-98.jpg", "descriptions": "Set in the untamed West of the late-1800s, GUN is a free-roaming action-adventure game that takes players to a world without laws where greed, lust and murder are rampant. As Colton White, a vengeful gunslinger, players must straddle the line between good and evil as they showdown againstSet in the untamed West of the late-1800s, GUN is a free-roaming action-adventure game that takes players to a world without laws where greed, lust and murder are rampant. As Colton White, a vengeful gunslinger, players must straddle the line between good and evil as they showdown against corrupt lawmen, a murderous preacher, renegade army psychopaths, merciless outlaws and unforgiving Native Americans, while waging war on horseback, collecting bounties, and commandeering trains. Players travel through an action-packed landscape of high mountain wilderness, deserts and bustling territorial towns in an epic story of betrayal, greed, and revenge. Multiple gameplay styles include: strategic gunplay and precision shooting, stealth tactics, and use of explosives. Embark on numerous side missions to master gun slinging and horse riding. Players can unlock secret weapons and upgrade skills and abilities to improve their weapon and equipment performance. [Activision]… Expand"}, {"name": "FIFA 23", "details_link": "https://www.metacritic.com/game/playstation-5/fifa-23", "publisher": "Electronic Arts", "release_date": "Sep 27 2022", "developers": ["EA Sports", "EA Canada"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 76, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/3/7ab27ffe2eea120270e65bfb2c967927-98.jpg", "descriptions": "In FIFA 23, cross-play will be available at launch in FUT Division Rivals (except Co-Op), FUT Champions, FUT Ultimate Online Draft, FUT Online Friendlies (except Co-Op), FUT Play a Friend, Online Friendlies, Online Seasons (except Co-Op Seasons) and the Virtual Bundesliga competitive gameIn FIFA 23, cross-play will be available at launch in FUT Division Rivals (except Co-Op), FUT Champions, FUT Ultimate Online Draft, FUT Online Friendlies (except Co-Op), FUT Play a Friend, Online Friendlies, Online Seasons (except Co-Op Seasons) and the Virtual Bundesliga competitive game mode that is available to players based in Germany. Cross-play is initially enabled for all players when launching FIFA 23 for the first time, provided the platform level settings allow for it, and it can be opted out of at any time (more on that later in this article).… Expand"}, {"name": "Puzzle Quest: Galactrix", "details_link": "https://www.metacritic.com/game/xbox-360/puzzle-quest-galactrix", "publisher": "D3Publisher", "release_date": "Apr  8 2009", "developers": ["Infinite Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/1dff7ac172be96595bb95f67565b5b9e-98.jpg", "descriptions": "[Xbox Live Arcade]  The puzzle game of the future has arrived with Puzzle Quest: Galactrix. The original best-selling Puzzle Quest franchise is back in an all-new dimension with its signature match-3, turn-based battles in a masterful hybrid of the RPG and puzzle genres. Take on the role of[Xbox Live Arcade]  The puzzle game of the future has arrived with Puzzle Quest: Galactrix. The original best-selling Puzzle Quest franchise is back in an all-new dimension with its signature match-3, turn-based battles in a masterful hybrid of the RPG and puzzle genres. Take on the role of a rogue pilot scouring the galaxy to uncover clues in an intergalactic mystery that affects the fate of the entire universe. Build up a fleet of ships, discover hundreds of different weapons, and master the new puzzle board. A new dimension: Customize and build a fleet of ships to master the galaxy, with an all-new redesigned puzzle board. New weapons: Use over 150 different weapons to control the board. New quests: Play hundreds of missions within a single-player game. Multiplayer: Battle across the universe in one-on-one ranked online multiplayer matches. [Infinite Interactive]… Expand"}, {"name": "Multiwinia: Survival of the Flattest", "details_link": "https://www.metacritic.com/game/pc/multiwinia-survival-of-the-flattest", "publisher": "Introversion", "release_date": "Sep 19 2008", "developers": ["Introversion"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/0785c710a68001f1e090121d857d5094-98.jpg", "descriptions": "Long ago a computer scientist called Dr Sepulveda created a beautiful digital world existing entirely within a computer network of his own invention. This world was called Darwinia and it was inhabited by a peaceful, law-abiding digital life-form called the Darwinians. As the years wore onLong ago a computer scientist called Dr Sepulveda created a beautiful digital world existing entirely within a computer network of his own invention. This world was called Darwinia and it was inhabited by a peaceful, law-abiding digital life-form called the Darwinians. As the years wore on however the Darwinians became ever more aggressive and autonomous. They divided into factions, squabbling over Darwinia’s limited natural resources. Tribes began to roam the fractal voids hell bent on each other’s destruction, drunk on power and unswerving in the pursuit of world supremacy. Far and wide, they became known as the Multiwinians. Welcome to Multiwinia: Survival of the Flattest - the ultimate retro-arcade multiplayer experience. Choose from a selection of six hilariously fun, action-packed game modes, set in one of the most beautiful game environs you will ever set eyes on. Challenge your opponent to a game of stick-man slaughter, and watch digital-war unfold, as your Multiwinian army struggles to complete a chosen task faster and better than your rival’s. It's fast, it’s furious, and only the flattest will survive. [Introversion]… Expand"}, {"name": "The Beginner's Guide", "details_link": "https://www.metacritic.com/game/pc/the-beginners-guide", "publisher": "Davey Wreden", "release_date": "Oct  1 2015", "developers": ["Davey Wreden"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/4743eed8d7107bf01e0c31453343cceb-98.jpg", "descriptions": "The Beginner's Guide is a narrative video game from Davey Wreden, the creator of The Stanley Parable. It lasts about an hour and a half and has no traditional mechanics, no goals or objectives. Instead, it tells the story of a person struggling to deal with something they do not understand."}, {"name": "Pokken Tournament", "details_link": "https://www.metacritic.com/game/wii-u/pokken-tournament", "publisher": "Nintendo", "release_date": "Mar 18 2016", "developers": ["Bandai Namco Games"], "platforms": "Wii U", "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/bba80a1450c85e6f017eb0a9f68dd0c6-98.jpg", "descriptions": "(Also known as \"Pokemon Tekken\") Battle Pokémon in all-new, action-packed arena fights. Perform vivid Pokémon moves in all their glory with button combinations through an intuitive fighting system to unleash devastating attacks upon your opponent to become the Pokkén Tournament champion.(Also known as \"Pokemon Tekken\") Battle Pokémon in all-new, action-packed arena fights. Perform vivid Pokémon moves in all their glory with button combinations through an intuitive fighting system to unleash devastating attacks upon your opponent to become the Pokkén Tournament champion. Learn various fighting styles of Pokémon such as Pikachu, Charizard, Lucario, and more. Any fan will be able to learn and execute signature Pokémon moves with a press of a button. Turn the tide of battle by calling upon support Pokémon to assist, and unleash devastating attacks to KO your opponent. Battles await, and it’s up to you to claim the title of Pokkén Tournament champion. [Nintendo]… Expand"}, {"name": "Potion Craft: Alchemist Simulator", "details_link": "https://www.metacritic.com/game/pc/potion-craft-alchemist-simulator", "publisher": "niceplay games", "release_date": "Dec 13 2022", "developers": ["niceplay games"], "platforms": ["Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "General", "Virtual", "Career"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/b1b59486b3ece5d9ccec63d0ff80ac1b-98.jpg", "descriptions": "Potion Craft is an alchemist simulator where you physically interact with your tools and ingredients to brew potions. You're in full control of the whole shop: invent new recipes, attract customers and experiment to your heart's content. Just remember: the whole town is counting on you.Potion Craft is an alchemist simulator where you physically interact with your tools and ingredients to brew potions. You're in full control of the whole shop: invent new recipes, attract customers and experiment to your heart's content. Just remember: the whole town is counting on you. Every day customers will come to your store looking for solutions to their problems. You will face consequences depending on what you decide to sell them. Attract guilds, befriend notable figures (or feud with them), gain riches and influence - and one day, you may even decide the fate of the whole town.… Expand"}, {"name": "Trolley Problem, Inc.", "details_link": "https://www.metacritic.com/game/pc/trolley-problem-inc", "publisher": "Yogscast", "release_date": "Apr 21 2022", "developers": ["Yogscast"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/c68d077d73e9ba1fb04663cc37e86d19-98.jpg", "descriptions": "There is a runaway trolley careering down the railway tracks. On the tracks are five people unable to move. You are next to a lever. If you pull this lever the trolley will switch to a different set of tracks. However, you notice that there is a person on the other track.Watch theThere is a runaway trolley careering down the railway tracks. On the tracks are five people unable to move. You are next to a lever. If you pull this lever the trolley will switch to a different set of tracks. However, you notice that there is a person on the other track.Watch the situation play out and five people die. Choose to pull the lever and only one person gets killed - but by you.What will you do?Trolley Problem, Inc. is a darkly comedic narrative game based on real world philosophical papers, in which you are asked to make a series of impossible choices from two awful answers. Wrestle with your moral compass, decide the fate of millions - and compare your choices with the rest of the world.… Expand"}, {"name": "Shadow Warrior 3", "details_link": "https://www.metacritic.com/game/xbox-series-x/shadow-warrior-3", "publisher": "Devolver Digital", "release_date": "Mar  1 2022", "developers": ["Flying Wild Hog"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X"], "genres": ["Action", "First-Person", "Shooter", "Arcade"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/75311a6fcd879bc770aa6b7567c45247-98.jpg", "descriptions": "Shadow Warrior 3 launches the offbeat first-person shooter series to the next level with a seamless blend of fast-paced gunplay, razor-sharp melee combat, and a spectacular free-running movement system. Fallen corporate shogun Lo Wang and his former employer turned nemesis turned sidekickShadow Warrior 3 launches the offbeat first-person shooter series to the next level with a seamless blend of fast-paced gunplay, razor-sharp melee combat, and a spectacular free-running movement system. Fallen corporate shogun Lo Wang and his former employer turned nemesis turned sidekick Orochi Zilla embark on an improbable mission to recapture an ancient dragon they unwillingly unleashed from its eternal prison. Armed with a punishing mix of blades and bullets, Lo Wang must traverse uncharted parts of the world to track down the dark beast and push the apocalypse back yet again. All it will take is the mask of a dead god, a dragon's egg, a touch of magic, and enough firepower to hold off the impending cataclysm. Bring a Katana to a Gunfight. Conduct a symphony of death with each encounter by mixing overwhelming firepower with devastatingly precise katana strikes as you dash in and around the demonic hordes.\r Fancy Footwork\rFlow between nimble movement techniques including air dashes, wall running, double jumps, and the fancy new grappling hook busts your combat and movement options wide open in every battle.\r Execute Then Annihilate\rExecute spectacular finishing moves to claim a piece of your conquered foe and unleash its powers back on the horde in a burst of unstoppable fury and powerful magic.\r Dynamic Combat Arenas\rEach environment is lined with hazardous structures and devices that can be activated to add another layer of creative choice to the offensive strategy.\r Neo Feudal Japan\rTrek across a mythic Asian land infused with the magic and technology of ancient samurai, now overrun by the demonic yokai from Japanese folklore.\r Funny Business\rBrace for expertly delivered one-liners from Lo Wang, pointed banter with Zilla, and an intense thrill ride of absurd predicaments on the way to turning doomsday into a new day.… Expand"}, {"name": "TENS!", "details_link": "https://www.metacritic.com/game/switch/tens!", "publisher": "Kwalee Ltd", "release_date": "Nov  5 2020", "developers": ["Kwalee Ltd"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/8fa082539626a34184ffccda5d61a1ca-98.jpg", "descriptions": "The ultimate dice puzzle. Combining sudoku-style number puzzles and block-dropping gameplay, the aim of TENS! is simple: place dice on the board, make ‘tens’ in any row or column and clear the board to win. TENS! is a relaxing puzzle game which offers tons of gameplay styles for you toThe ultimate dice puzzle. Combining sudoku-style number puzzles and block-dropping gameplay, the aim of TENS! is simple: place dice on the board, make ‘tens’ in any row or column and clear the board to win. TENS! is a relaxing puzzle game which offers tons of gameplay styles for you to choose from including: an immersive single-player Adventure mode, a local Multiplayer mode where you can challenge your friends and family, and an Endless mode which challenges your skill level.\r In TENS! there’s something for everyone to enjoy!\r TENS! Features:\r- Explore your way through Adventure Mode and experience the world of TENS!\r- Keep beating your high score and learning new skills in Endless Mode\r- Challenge your friends with local multiplayer to see who has the top TENS! talent\r- Add dice skins to your collection by playing through the game your way\r- Battle bosses through your adventure and unlock new characters\r- Relaxing gameplay for everyone to enjoy!\r… Expand"}, {"name": "Noita", "details_link": "https://www.metacritic.com/game/pc/noita", "publisher": "Nolla Games", "release_date": "Oct 15 2020", "developers": ["Nolla Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Action Adventure", "Open-World"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/e0e3791f31389a34f975ea6a79bc048d-98.jpg", "descriptions": "Noita is a magical action roguelite set in a world where every pixel is physically simulated. Fight, explore, melt, burn, freeze and evaporate your way through the procedurally generated world using spells you've created yourself."}, {"name": "Minoria", "details_link": "https://www.metacritic.com/game/playstation-4/minoria", "publisher": "DANGEN Entertainment", "release_date": "Sep 10 2020", "developers": ["Bombservice"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Open-World"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/e4736a51407fdd1473e188c4298331ad-98.jpg", "descriptions": "Ink and blood stain the streets of Ramezia. Witches must burn and sins must be judged. Venture forth as Sister Semilla to burn down the pillars of heresy in Minoria, an action-platformer by Bombservice, creators of Momodora."}, {"name": "Brigandine: The Legend of Runersia", "details_link": "https://www.metacritic.com/game/switch/brigandine-the-legend-of-runersia", "publisher": "Happinet Corporation", "release_date": "Jun 25 2020", "developers": ["Matrix Software", "Happinet Corporation"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/5d86c6ea3c1fc4a2a68b99f93fccd683-98.jpg", "descriptions": "An Endless Fantasy WarGrand Strategy Simulation. Conquer the continent in this grand strategy simulation game\rThe continent of Runersia is home to six major powers with more than 40 bases, 100 knights, and 50 types of monsters.\rSelect a ruler, compose your platoons of knights and monsters,An Endless Fantasy WarGrand Strategy Simulation. Conquer the continent in this grand strategy simulation game\rThe continent of Runersia is home to six major powers with more than 40 bases, 100 knights, and 50 types of monsters.\rSelect a ruler, compose your platoons of knights and monsters, and march to claim enemy bases.\rThe player chooses how they will battle, so devise the best strategy to lead your nation toward continental conquest. How will your legend unfold?\r Simple yet deep war simulation game with unit growth and map-based platoon battles\rTime passes on Runersia in seasons, each one consisting of an Organization Phase and an Attack phase.\rDuring the Organization Phase, knights and monsters with various classes and skills are organized into platoons in preparation for the upcoming battles.\r During the Attack Phase, turn-based platoon battles take place on a map made up of hexagonal spaces. Make use of unit skills, elements, enclosure effects, terrain advantages, and other battle tactics to lead your side to victory!\rAll nations, knights, and monsters in the game will continue to battle and grow as you do.\rThe game is also packed with other ways to grow your armies such as class changes, equipment, and various items.… Expand"}, {"name": "The Surge 2", "details_link": "https://www.metacritic.com/game/pc/the-surge-2", "publisher": "Focus Home Interactive", "release_date": "Sep 23 2019", "developers": ["Deck 13"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/6b8ea26402732296c3bb7f6e35fa9df3-98.jpg", "descriptions": "[OVERCOME]\rOn the way to Jericho City, your plane is shot down by a mysterious storm and crash-lands in the outskirts. You wake up weeks later in a derelict detention facility inside the city. Armor-clad soldiers enforce Martial Law, robots are on a rampage, and a dark, expanding nanostorm[OVERCOME]\rOn the way to Jericho City, your plane is shot down by a mysterious storm and crash-lands in the outskirts. You wake up weeks later in a derelict detention facility inside the city. Armor-clad soldiers enforce Martial Law, robots are on a rampage, and a dark, expanding nanostorm looms over the cityscape...\r [SURVIVE]\rIn a bid to survive, explore the sprawling, devastated city of Jericho. Fight its numerous, ferocious threats in brutal, unforgiving combat, slashing and tearing the limbs off your opponents to steal valuable equipment that will make you stronger - strong enough to face the most fearsome, imposing foes lurking in the city.\r [UPGRADE]\rWith an expanded arsenal of weapons, armors, abilities, implants, and drones to build your character, and a bigger, more varied and more ambitious world, The Surge 2 challenges you to survive and unravel its hidden secrets.\r * Hardcore, brutal melee combat\r* Face deadly foes and colossal bosses\r* Cut off parts of the enemy you want to loot\r* Rich character progression and customization… Expand"}, {"name": "Old School Musical", "details_link": "https://www.metacritic.com/game/switch/old-school-musical", "publisher": "Playdius", "release_date": "Sep 13 2018", "developers": ["La Moutarde"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Rhythm", "Music"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/7023ee933eb928d52caf03b265b05058-98.jpg", "descriptions": "What has 50 amazing chiptune tracks, a loony story mode, 32 different chicken types to fight, and takes you on a tour of all your favorite retro games? It's Old School Musical of course. Tib and Rob are the heroes of a wacky adventure that will teach them where all of the bugs in ourWhat has 50 amazing chiptune tracks, a loony story mode, 32 different chicken types to fight, and takes you on a tour of all your favorite retro games? It's Old School Musical of course. Tib and Rob are the heroes of a wacky adventure that will teach them where all of the bugs in our favorite games come from. Have you ever played a rhythm game before? Well, this is like that, but much better. With each note, you are responsible for the success of our two heroes' quest. Swing your sword and shoot with your spacecraft to the beat of chiptune tracks from Dubmood, Zabutom, Hello World, Yponeko and Le Plancton. … Expand"}, {"name": "Crash Bandicoot N. Sane Trilogy", "details_link": "https://www.metacritic.com/game/pc/crash-bandicoot-n-sane-trilogy", "publisher": "Activision", "release_date": "Jun 29 2018", "developers": ["Vicarious Visions", "Iron Galaxy Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/73cdd5a87df216d29904e808efe3319a-98.jpg", "descriptions": "Your favorite marsupial, Crash Bandicoot, is back! He's enhanced, entranced & ready-to-dance with the N. Sane Trilogy game collection. Now you can experience Crash Bandicoot like never before in Fur-K. Spin, jump, wump and repeat as you take on the epic challenges and adventures through theYour favorite marsupial, Crash Bandicoot, is back! He's enhanced, entranced & ready-to-dance with the N. Sane Trilogy game collection. Now you can experience Crash Bandicoot like never before in Fur-K. Spin, jump, wump and repeat as you take on the epic challenges and adventures through the three games that started it all, Crash Bandicoot, Crash Bandicoot 2: Cortex Strikes Back and Crash Bandicoot: Warped. Relive all your favorite Crash moments in their fully-remastered HD graphical glory and get ready to put some UMPH in your WUMP!… Expand"}, {"name": "The Elder Scrolls Online: Summerset", "details_link": "https://www.metacritic.com/game/playstation-4/the-elder-scrolls-online-summerset", "publisher": "Bethesda Softworks", "release_date": "Jun  5 2018", "developers": ["ZeniMax Media"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 76, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/d93c1a0866599f05d9fbcc2f9ad9053e-98.jpg", "descriptions": "The Elder Scrolls Online: Summerset is the next Chapter of ZeniMax Online Studios' award-winning online RPG, The Elder Scrolls Online (ESO). This new adventure in the ESO saga will send adventurers and their friends to the Summerset Isle, to visit and explore the ancestral home of the highThe Elder Scrolls Online: Summerset is the next Chapter of ZeniMax Online Studios' award-winning online RPG, The Elder Scrolls Online (ESO). This new adventure in the ESO saga will send adventurers and their friends to the Summerset Isle, to visit and explore the ancestral home of the high elves for the first time since 1994's The Elder Scrolls: Arena. Players will also be able to explore the island of Artaeum, home to the mysterious Psijic Order, a group of sages that predate the Mages Guild. Tamriel's fate hangs in the balance and the heroes of ESO are called upon to save the world once more. This year's Chapter introduces an enormous and stunning new zone unlike any other, a fresh skill line with new magical powers to master, an expanded crafting system to forge powerful gear, and the continuation of the epic and award-winning ESO story. With more than 30 hours of new story content to experience, The Elder Scrolls Online: Summerset expands The Elder Scrolls Online in exciting and innovative ways, offering incredible adventures for both ESO veterans and those new to the game.… Expand"}, {"name": "Horizon Chase Turbo", "details_link": "https://www.metacritic.com/game/pc/horizon-chase-turbo", "publisher": "Aquiris Game Studio", "release_date": "May 15 2018", "developers": ["Aquiris Game Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/2e4c094649d849a792d2af2c6468f2f3-98.jpg", "descriptions": "Thrilling arcade racing game, inspired by the super-fun-straight-to-the-point classic racing games from the 90s."}, {"name": "Masters of Anima", "details_link": "https://www.metacritic.com/game/switch/masters-of-anima", "publisher": "Focus Home Interactive", "release_date": "Apr 10 2018", "developers": ["Passtech Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/b31231e5ef1c81a7b3e8a5261cbcf07e-98.jpg", "descriptions": "Dive into an original adventure and defy the forces of evil in strategic, action-packed battles. Summon and control large armies of up to 100 Guardians thanks to intuitive and innovative gameplay and make quick tactical decisions to prevail."}, {"name": "Wulverblade", "details_link": "https://www.metacritic.com/game/playstation-4/wulverblade", "publisher": "Darkwind Media", "release_date": "Jan 30 2018", "developers": ["Darkwind Media"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/2fd66ff2b34b66793f5bcfbc753455ae-98.jpg", "descriptions": "Help Britannia defeat the Romans in Wulverblade — a hardcore side-scrolling beat ’em up inspired by classics such as Golden Axe, Sengoku, and Knights of the Round."}, {"name": "Syberia", "details_link": "https://www.metacritic.com/game/switch/syberia", "publisher": "Microids", "release_date": "Oct 20 2017", "developers": ["Koalabs Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/588ebc538fb111b08e7ed3b028476e60-98.jpg", "descriptions": "For the young Kate Walker, an ambitious lawyer, the Voralberg toy company acquisition seemed like a textbook case--a quick stopover to a small alpine village in France to buy-out an old automaton factory, then straight back home to New York.  But her journey across land and time throws allFor the young Kate Walker, an ambitious lawyer, the Voralberg toy company acquisition seemed like a textbook case--a quick stopover to a small alpine village in France to buy-out an old automaton factory, then straight back home to New York.  But her journey across land and time throws all she values into question, and the deal she set out to sign turns into a pact with destiny.  Follow Kate through a magical world of automatons, amazing characters, and mysterious environments.  This puzzle-driven adventure blends logical problem-solving with a complex and involving storyline.… Expand"}, {"name": "Chaos;Child", "details_link": "https://www.metacritic.com/game/playstation-4/chaoschild", "publisher": "5pb", "release_date": "Oct 17 2017", "developers": ["5pb"], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 76, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/bdebdccd90f27fd30db897c388bbe19e-98.jpg", "descriptions": "Discover A Darker Japan - Explore Shibuya in 2015, after an earthquake nearly levelled the city six years prior, and try to outsmart the puppet-master behind this New Generation Madness. Track Down A Serial Killer - Play as Takuru, an arrogant senior and the newspaper club president, andDiscover A Darker Japan - Explore Shibuya in 2015, after an earthquake nearly levelled the city six years prior, and try to outsmart the puppet-master behind this New Generation Madness. Track Down A Serial Killer - Play as Takuru, an arrogant senior and the newspaper club president, and discover the pattern in a series of bizarre deaths around you that the police can't seem to crack.… Expand"}, {"name": "Piczle Lines DX", "details_link": "https://www.metacritic.com/game/switch/piczle-lines-dx", "publisher": "Rainy Frog", "release_date": "Aug 24 2017", "developers": ["Score Studios"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/51b490d22b51f6ee14618307adb99e71-98.jpg", "descriptions": "Draw lines between two numbers to reveal a hidden picture and complete the puzzle. Hundreds of puzzles with free updates. Draw lines to connect pairs of numbers to complete a hidden picture in this feverishly addictive PICture puzZLE game. Connect numbers of the same color, using the sameDraw lines between two numbers to reveal a hidden picture and complete the puzzle. Hundreds of puzzles with free updates. Draw lines to connect pairs of numbers to complete a hidden picture in this feverishly addictive PICture puzZLE game. Connect numbers of the same color, using the same number of blocks as the number. Easy controls lets you draw line after line as you gradually reveal the picture.  Play through 100 levels in Story Mode as you follow the adventure of a professor and his mysterious Piczle-Matic camera. Each puzzle solved unlocks the next step in the story. Continue the fun in Puzzle Mode with 200+ more puzzles. Solve picture puzzles in of all sorts, including sports, pets, vehicles, food and many more! Select them in any order or have multiple puzzles on the go, resuming any one at any time. [Nintendo]… Expand"}, {"name": "The Long Dark", "details_link": "https://www.metacritic.com/game/xbox-one/the-long-dark", "publisher": "Hinterland", "release_date": "Aug  1 2017", "developers": ["Hinterland"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Simulation", "Action Adventure", "General", "Survival"], "meta_score": 76, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/bbb808c60472e6d890ff9ffba17f958b-98.jpg", "descriptions": "The Long Dark is a thoughtful, exploration-survival experience that challenges solo players to think for themselves as they explore an expansive frozen wilderness. Monitor your Condition, search for life-saving supplies, and master survival skills like fire-building, maintaining your gear,The Long Dark is a thoughtful, exploration-survival experience that challenges solo players to think for themselves as they explore an expansive frozen wilderness. Monitor your Condition, search for life-saving supplies, and master survival skills like fire-building, maintaining your gear, hunting, fishing, and landmark-based navigation. There are no zombies -- only you, the cold, and everything Mother Nature can throw at you. The hit Steam Early Access sandbox becomes the first survival game available on Xbox One!… Expand"}, {"name": "Battlefield 1: They Shall Not Pass", "details_link": "https://www.metacritic.com/game/pc/battlefield-1-they-shall-not-pass", "publisher": "Electronic Arts", "release_date": "Mar 14 2017", "developers": ["EA DICE"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 76, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/5bf2b70abc169c72c488d753a362d1b6-98.jpg", "descriptions": "NEW MAP: VERDUN HEIGHTS - The opening barrage of the Battle of Verdun created massive forest fires in which players will fight for domination. This is an uphill battle towards the massive fortresses of Verdun. A constant grinding struggle where the artillery never stops. Where the forge andNEW MAP: VERDUN HEIGHTS - The opening barrage of the Battle of Verdun created massive forest fires in which players will fight for domination. This is an uphill battle towards the massive fortresses of Verdun. A constant grinding struggle where the artillery never stops. Where the forge and “the Devil’s Anvil” continues to consume even the bravest combatants. NEW MAP: FORT DE VAUX - The first big engagement inside a fort during World War 1 takes place in the dark underworld of Fort de Vaux. Down in the maze of dark galleries and wet stone corridors, French and Germans fight ferociously with grenades, guns, bayonets, and flamethrowers. Watch your corners. NEW MAP: SOISSONS - Take part in one of the biggest tank assaults of World War 1. The French 10th Army moves to take back Soissons using their powerful Saint Chamond tanks. Planes, tanks, and infantry clash in the beautiful French countryside in the early hours of a hot summer day. Only the thunderstorm is louder than the war. NEW MAP: RUPTURE - In dire need to capture key bridges across the Aisne river, the French find themselves back into battlefields where poppies grow over a rusty wreck from previous tank battles. It might seem calm but this maze of steel beasts provides an excellent place for those who plan an ambush. As the sun sets over Fontenoy, the battle wakes up. [Electronic Arts] … Expand"}, {"name": "ACA NeoGeo: Metal Slug 3", "details_link": "https://www.metacritic.com/game/switch/aca-neogeo-metal-slug-3", "publisher": "Hamster", "release_date": "Mar  9 2017", "developers": ["SNK Playmore", "Hamster"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "Shoot-'Em-Up", "Horizontal"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/e9297ac197682e34480de6c64cd5bee2-98.jpg", "descriptions": "Marco, Tarma, Eri, and Fio, the four veterans of the elite Sparrows Unit are back in METAL SLUG 3! The popular action shooting series is in its glory, with gorgeous graphics and all the run-and-gun action you can handle. There is no time for indecision. General Morden is on the warpath andMarco, Tarma, Eri, and Fio, the four veterans of the elite Sparrows Unit are back in METAL SLUG 3! The popular action shooting series is in its glory, with gorgeous graphics and all the run-and-gun action you can handle. There is no time for indecision. General Morden is on the warpath and you must prevent him from creating the New World Order. Stop the Rebel Army!… Expand"}, {"name": "Call of Duty: Infinite Warfare - Sabotage", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-infinite-warfare---sabotage", "publisher": "Activision", "release_date": "Jan 31 2017", "developers": ["Infinity Ward"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 76, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/7/acfaf2ae7460e0d8017e268bb7ee22dd-98.jpg", "descriptions": "Sabotage, the first DLC pack for Call of Duty: Infinite Warfare, includes the next terrifying Zombies installment: Rave in the Redwoods plus four unique multiplayer environments. Play DLC map packs 30 days early on PS4."}, {"name": "Werewolves Within", "details_link": "https://www.metacritic.com/game/playstation-4/werewolves-within", "publisher": "Ubisoft", "release_date": "Dec  6 2016", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/cfe189791cde117376920cfe42db4caa-98.jpg", "descriptions": "A game of social deduction that brings the fun of game night with friends to virtual reality."}, {"name": "Trackmania Turbo", "details_link": "https://www.metacritic.com/game/xbox-one/trackmania-turbo", "publisher": "Ubisoft", "release_date": "Mar 22 2016", "developers": ["Nadeo"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to more than 64 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/84d61342c22914267d0d2ced59e61865-98.jpg", "descriptions": "Trackmania Turbo features an easy to learn, hard to master gameplay style that relies on time attack racing in which racers set their own limits and challenges. The gameplay centers on the perfect combination of matchbox car fantasy on a massive scale, focusing on the pursuit of the perfectTrackmania Turbo features an easy to learn, hard to master gameplay style that relies on time attack racing in which racers set their own limits and challenges. The gameplay centers on the perfect combination of matchbox car fantasy on a massive scale, focusing on the pursuit of the perfect run around the track. Players test their skills in the campaign mode which includes more than 200 tracks set in four beautiful environments each with their own gameplay style. [Ubisoft]… Expand"}, {"name": "Far Cry 4: Valley of the Yetis", "details_link": "https://www.metacritic.com/game/xbox-one/far-cry-4-valley-of-the-yetis", "publisher": "Ubisoft", "release_date": "Mar 10 2015", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/9c0df8846584574e0e4f7f4690e1de22-98.jpg", "descriptions": "Players must explore and survive a valley at the top of the Himalayas in Kyrat after Ajay’s helicopter crashes and leaves him stranded on a dangerous ridge. In order to stay alive, players must capture a camp for shelter and guard it from a mysterious cult. But even if successful against thePlayers must explore and survive a valley at the top of the Himalayas in Kyrat after Ajay’s helicopter crashes and leaves him stranded on a dangerous ridge. In order to stay alive, players must capture a camp for shelter and guard it from a mysterious cult. But even if successful against the cult, they must keep a lookout for the fabled and extremely dangerous yetis that populate the territory. [Ubisoft]… Expand"}, {"name": "Castle In The Darkness", "details_link": "https://www.metacritic.com/game/pc/castle-in-the-darkness", "publisher": "Nicalis", "release_date": "Feb  5 2015", "developers": ["Matt Kap"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Metroidvania"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/3481f83884ab024ccc0f89be1a997d08-98.jpg", "descriptions": "One dark and gloomy night, the kingdom of Alexandria is attacked by an evil sorcerer and his army of darkness! Despite their best efforts to protect their king and their princess, the royal guard falls, one-by-one, to the forces of evil.One knight, unconscious but still alive, awakens onOne dark and gloomy night, the kingdom of Alexandria is attacked by an evil sorcerer and his army of darkness! Despite their best efforts to protect their king and their princess, the royal guard falls, one-by-one, to the forces of evil.One knight, unconscious but still alive, awakens on the throne room floor to find that the princess is nowhere to be seen! What's more, the entire city had been overrun by monsters! With sword in hand, he embarks on a death-defying mission to find his princess and to restore peace to the kingdom!Castle In The Darkness is a fun and challenging shout out to the early days of video games! It's an action exploration platformer with some RPG elements, much like games from the Castlevania or Metroid series. It's super fast-paced, challenging, and full of secrets!… Expand"}, {"name": "Assassin's Creed IV: Black Flag - Freedom Cry", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-iv-black-flag---freedom-cry", "publisher": "Ubisoft", "release_date": "Dec 17 2013", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "Historic", "Open-World"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/736ed44688ec27a15a1595c91af5a11f-98.jpg", "descriptions": "Born a slave, Adewale found freedom aboard the Jackdaw where he became Edward Kenwayâ€™s second-in-command. 15 years later, Adewale has become an Assassin who finds himself shipwrecked in Saint-Domingue without weapons or crew. He meets locals in an effort to assemble a crew & steal a ship.Born a slave, Adewale found freedom aboard the Jackdaw where he became Edward Kenwayâ€™s second-in-command. 15 years later, Adewale has become an Assassin who finds himself shipwrecked in Saint-Domingue without weapons or crew. He meets locals in an effort to assemble a crew & steal a ship. The more he helps, the more he is drawn into the Maroon slave community. Forced to face his past, he sets out to free the slaves & bring death to their captors. Over 3 hours of new single-player game play!… Expand"}, {"name": "BioShock Infinite: Burial at Sea - Episode One", "details_link": "https://www.metacritic.com/game/playstation-3/bioshock-infinite-burial-at-sea---episode-one", "publisher": "2K Games", "release_date": "Nov 12 2013", "developers": ["Irrational Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/8162f4ee1913a12db4957a3a8e01e5fe-98.jpg", "descriptions": "Come back to Rapture in a story that finds Booker and Elizabeth on the eve of the underwater city's fall from grace. Developed by Irrational Games, the developer of the original BioShock and BioShock Infinite, this DLC features Rapture as you've never seen it before-a shining jewel at theCome back to Rapture in a story that finds Booker and Elizabeth on the eve of the underwater city's fall from grace. Developed by Irrational Games, the developer of the original BioShock and BioShock Infinite, this DLC features Rapture as you've never seen it before-a shining jewel at the bottom of the ocean, built almost entirely from scratch in the BioShock Infinite engine. Gameplay has been modified to give the player an original BioShock combat experience that merges the best parts of BioShock and BioShock Infinite: new weapons, new Plasmids/Vigors, Tears, Sky-Lines, and Big Daddies.… Expand"}, {"name": "Volgarr the Viking", "details_link": "https://www.metacritic.com/game/pc/volgarr-the-viking", "publisher": "Adult Swim", "release_date": "Sep 13 2013", "developers": ["Crazy Viking Studios"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/6035eb4f50d3a78a6bd30ac41062be40-98.jpg", "descriptions": "Remember when games were tough? Return to the Golden Age of arcades with a hardcore action experience that pulls no punches. Volgarr the Viking features simple controls, high challenge, and meticulous design - combined with hand-made pixel animation, an epic soundtrack, and buckets of blood.Remember when games were tough? Return to the Golden Age of arcades with a hardcore action experience that pulls no punches. Volgarr the Viking features simple controls, high challenge, and meticulous design - combined with hand-made pixel animation, an epic soundtrack, and buckets of blood. Flex your gaming muscles and step into the arena with Volgarr the Viking.… Expand"}, {"name": "Deus Ex: Human Revolution - The Missing Link", "details_link": "https://www.metacritic.com/game/xbox-360/deus-ex-human-revolution---the-missing-link", "publisher": "Square Enix", "release_date": "Oct 18 2011", "developers": ["Eidos Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/24d2eae8ebe4bb80fe8da92b6a2abf3b-98.jpg", "descriptions": "The DEUS EX: HUMAN REVOLUTION conspiracy grows deeper in The Missing Link. During lead character Adam Jensen’s quest for the truth in DEUS EX: HUMAN REVOLUTION, he mysteriously vanishes for three days. Where was he? What did he find out? The Missing Link reveals it all."}, {"name": "LEGO Star Wars III: The Clone Wars", "details_link": "https://www.metacritic.com/game/wii/lego-star-wars-iii-the-clone-wars", "publisher": "LucasArts", "release_date": "Mar 22 2011", "developers": ["Traveller's Tales"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/e52a90acec0e3c001953d692d79bc526-98.jpg", "descriptions": "LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes,LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes, giving players unique, head-to-head combat and an upgraded level builder, allowing the creation of customized bases and in-game battlefields. Play either as a Jedi or Separatist with all-new character abilities, such as Squad command, Lightsaber slicing, Lightsaber jumps, long distance Jedi attacks and Grapple Tie-Ups, all within a new, easy-to-navigate hub.… Expand"}, {"name": "Deathsmiles", "details_link": "https://www.metacritic.com/game/xbox-360/deathsmiles", "publisher": "Aksys Games", "release_date": "Jun 29 2010", "developers": ["Cave"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/98bc2ff3c79590805f91e89e5d64f2b4-98.jpg", "descriptions": "Enter the world of Gilverado, a kingdom plagued by hideous monsters and tortured souls. Choose from four angels with unique demonic familiars and battle against a storm of enemies pouring out of Hell’s gates! Fight your way out of tight spots as you are surrounded by enemy units and bulletsEnter the world of Gilverado, a kingdom plagued by hideous monsters and tortured souls. Choose from four angels with unique demonic familiars and battle against a storm of enemies pouring out of Hell’s gates! Fight your way out of tight spots as you are surrounded by enemy units and bullets from both sides of the screen. The unique left/right shooting mechanic of Deathsmiles will keep you on your toes as you dodge and weave through complex enemy fire, beautifully crafted by the modern masters of shmups, CAVE. [Aksys]… Expand"}, {"name": "Mario & Sonic at the Olympic Winter Games", "details_link": "https://www.metacritic.com/game/ds/mario-sonic-at-the-olympic-winter-games", "publisher": "Sega", "release_date": "Oct 13 2009", "developers": ["Sega", "Sega Sports R&D"], "platforms": "DS", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/486a8380c52f12215215e7e531551520-98.jpg", "descriptions": "Mario & Sonic at the Olympic Winter Games takes players to Vancouver, Canada, host city of the official 2010 Olympic Winter Games. This gaming experience invites players of all ages and skill sets to face-off in some of the most intense winter competitions available for the NintendoMario & Sonic at the Olympic Winter Games takes players to Vancouver, Canada, host city of the official 2010 Olympic Winter Games. This gaming experience invites players of all ages and skill sets to face-off in some of the most intense winter competitions available for the Nintendo platforms. Developed by SEGA of Japan, under the guidance of Shigeru Miyamoto, Mario & Sonic at the Olympic Winter Games takes players to lifelike Olympic venues where they can choose from a legendary cast of playable characters, including new faces to the series. This fresh gaming experience features completely new Olympic Winter Games events from the official competition schedule including Alpine Skiing and Speed Skating. Tailored to the specific system controls, Nintendo DS and Wii gamers enjoy completely unique experiences thanks to each platform having its own specific gameplay features and modes. Players of all skill levels enjoy the intuitive controls of both the Wii and Nintendo DS systems, in both single and multiplayer gaming modes. The Wii game offers an even richer multiplayer experience offering co-op and competitive gameplay where the Nintendo DS brings an intense competitive element using the Nintendo DS wireless capabilities. Additionally, one of the new features to be found in Mario & Sonic at the Olympic Winter Games is the inclusion of the Wii Balance Board which can be used in some events featured in the Wii version, allowing for a more interactive and realistic gaming experience. [Sega]… Expand"}, {"name": "Bubble Bobble Plus!", "details_link": "https://www.metacritic.com/game/wii/bubble-bobble-plus!", "publisher": "Square Enix", "release_date": "May 25 2009", "developers": ["Taito Corporation"], "platforms": ["Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 76, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/23d1b501b792b93dd3b0df42b7dd8231-98.jpg", "descriptions": "[WiiWare]  A simple yet exhilarating action game where you control the bubble blowing dragons Bub and Bob, trapping enemies in bubbles and then popping them. You can play all 100 of the Standard Mode rounds, which faithfully recreate the nostalgic arcade game, or try 100 new Arrange Mode[WiiWare]  A simple yet exhilarating action game where you control the bubble blowing dragons Bub and Bob, trapping enemies in bubbles and then popping them. You can play all 100 of the Standard Mode rounds, which faithfully recreate the nostalgic arcade game, or try 100 new Arrange Mode rounds, which allow up to four players to play on stages with exciting new features such as new enemies and stage layouts. There are also Super Mode rounds for you to enjoy. Obtain the true ending by solving puzzles hidden on each stage to defeat the final boss. You can also play Ranking Mode where you compete with players from around the world to get the highest score by registering your scores via Nintendo WFC for each game mode. On top of all that, you can enjoy a further 100 rounds, facing off against new boss characters by purchasing the \"Expert Mode 1\" and \"Expert Mode 2\" add-on content. [Nintendo]… Expand"}, {"name": "Brothers in Arms: Hell's Highway", "details_link": "https://www.metacritic.com/game/xbox-360/brothers-in-arms-hells-highway", "publisher": "Ubisoft", "release_date": "Sep 23 2008", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 20 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/d9c5ba2c25e2e7fd5f853f3babfafd31-98.jpg", "descriptions": "Brothers In Arms: Hell's Highway brings the critically acclaimed squad-based WWII shooter into the next generation of gaming with amazing graphics and sound, new cutting-edge gameplay features and a completely redesigned online component. Delivering on the franchise's compelling story,Brothers In Arms: Hell's Highway brings the critically acclaimed squad-based WWII shooter into the next generation of gaming with amazing graphics and sound, new cutting-edge gameplay features and a completely redesigned online component. Delivering on the franchise's compelling story, unrivaled authenticity and intense squad-based action, Brothers In Arms Hell's Highway drops you into Operation Market-Garden, the largest airborne operation of World War II. Lead Matt Baker, Joe Hartsock and the rest of the 101st Airborne Division as they fight to open \"Hell's Highway\" in a daring bid for a quick end to the war. [Ubisoft]… Expand"}, {"name": "Chessmaster LIVE", "details_link": "https://www.metacritic.com/game/xbox-360/chessmaster-live", "publisher": "Ubisoft", "release_date": "Jan 30 2008", "developers": ["Ubisoft Bulgaria"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/242650646e5b22a2aebc5e6198ce631d-98.jpg", "descriptions": "[Xbox Live Arcade]  Enjoy playing as a real strategist with the Xbox Live version of the most-acclaimed chess franchise. Chessmaster Live allows you to challenge friends and players all over the world in thrilling contests and determine who's the real champ. Choose among several 3-D (or 2-D)[Xbox Live Arcade]  Enjoy playing as a real strategist with the Xbox Live version of the most-acclaimed chess franchise. Chessmaster Live allows you to challenge friends and players all over the world in thrilling contests and determine who's the real champ. Choose among several 3-D (or 2-D) sets and play against virtual characters or real opponents over Xbox Live. Solve puzzles and discover exciting variations of this classic board game. Beginners can learn the basics of chess, and veteran players can improve their mastery of the game with the advanced scenario. The game is yours ... it's your move! Compete against advanced A.I. characters or challenge other Xbox Live members to a match. New message chess system: Start a game without any time limit, and play the game at your leisure over the course of days or even weeks. Puzzle over a series of classic challenges such as \"find the fork\" or \"mate in one,\" and experience new ways of playing chess including Dark Chess, Losing Chess, Extinction Chess, and Progressive Chess. Customizable environments: Choose from six 3-D chess sets and three traditional sets, each with their own distinct sound effects, piece and board design. Interact with opponents: Video options allow you to see your challenger during the course of the game. [Ubisoft]… Expand"}, {"name": "MVP 07 NCAA Baseball", "details_link": "https://www.metacritic.com/game/playstation-2/mvp-07-ncaa-baseball", "publisher": "Electronic Arts", "release_date": "Feb  6 2007", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/9bf5af6ad872bfd43eb71942d470cf61-98.jpg", "descriptions": "EA continues to innovate on its gameplay engine by introducing Rock and Fire Pitching, a pitching mechanic that will forever change the way you deliver that blistering pitch past the batter. Rock and Fire pitching gives you ultimate control and increased feel to more realistically emulateEA continues to innovate on its gameplay engine by introducing Rock and Fire Pitching, a pitching mechanic that will forever change the way you deliver that blistering pitch past the batter. Rock and Fire pitching gives you ultimate control and increased feel to more realistically emulate the real life presence of stepping onto the mound, winding up and delivering the ultimate pitch. ESPN announcers Mike Patrick and two-time All-American Kyle Peterson  are back behind the microphone calling the action. Continuing to deliver on its partnership with ESPN, MVP 07 NCAA includes ESPN real-time features such as an ESPN ticker and live ESPN Sportscenter radio updates. Cheerleaders, crowd chants, and team fight songs are additional elements that add to the atmosphere and realism of this year's title. Plus, there are now an increased number of conferences, teams and authentic stadiums, creating a true-to-life NCAA baseball experience. [Electronic Arts]… Expand"}, {"name": "UEFA Euro 2004: Portugal", "details_link": "https://www.metacritic.com/game/pc/uefa-euro-2004-portugal", "publisher": "Electronic Arts", "release_date": "May  4 2004", "developers": ["EA Canada"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/3c90246e103c940a3004fe3064aa6f12-98.jpg", "descriptions": "In EURO 2004 mode players can play as any of the 51 European nations. Players can arrange and play friendly matches against other nations or play through the tournament going from qualifying, to playoffs and into the finals. In addition to tracking injuries and suspensions, a new dynamicIn EURO 2004 mode players can play as any of the 51 European nations. Players can arrange and play friendly matches against other nations or play through the tournament going from qualifying, to playoffs and into the finals. In addition to tracking injuries and suspensions, a new dynamic morale system will track players' morale, which will fluctuate based on individual and team performances and affect player abilities on the field. [Electronic Arts]… Expand"}, {"name": "Dominions II: The Ascension Wars", "details_link": "https://www.metacritic.com/game/pc/dominions-ii-the-ascension-wars", "publisher": "Shrapnel Games", "release_date": "Nov 14 2003", "developers": ["Illwinter Design Group"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/b5e53a9887dcc014e13cdefd73fa3315-98.jpg", "descriptions": "Too long have you been confined to this mortal realm. Too long have you been denied what should rightfully be yours. Are you not a god? Should you not be the One True God of this miserable dirtball? Yet there are others that dare challenge your authority. Pretenders to the throne, with theirToo long have you been confined to this mortal realm. Too long have you been denied what should rightfully be yours. Are you not a god? Should you not be the One True God of this miserable dirtball? Yet there are others that dare challenge your authority. Pretenders to the throne, with their false priests and prophets. These miserable creatures that have the audacity to impugn your rightful place in the cosmos! But you will show them, won't you? Gather your armies, raise your fortifications, and let loose the dogs of war! The time has come to assume your proper position, to crush your enemies beneath your boots and take what is meant for you. [Shrapnel Games]… Expand"}, {"name": "Spyro 2: Season of Flame", "details_link": "https://www.metacritic.com/game/game-boy-advance/spyro-2-season-of-flame", "publisher": "VU Games", "release_date": "Sep 25 2002", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/e9757c72b1177d72242a84f3cc6885a7-98.jpg", "descriptions": "Magic fireflies are the source of fiery dragon breath, and someone has stolen them all! Spyro and his friends must capture all the fireflies and stop Ripto from activating a sleeping volcano and destroying the Dragon Realms!"}, {"name": "Dave Mirra Freestyle BMX 2", "details_link": "https://www.metacritic.com/game/xbox/dave-mirra-freestyle-bmx-2", "publisher": "Acclaim", "release_date": "Nov 28 2001", "developers": ["Z-Axis", "Ltd."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/066277b0389a4ee6db57c91089190b12-98.jpg", "descriptions": "10-Time World Champion Dave Mirra is back in this sequel to the original hit game. Win enough respect from the other pro riders to get invited to Comps and embark on a ProQuest to be the top rider around - even better than the Miracle Boy himself."}, {"name": "Harvest Moon: Save the Homeland", "details_link": "https://www.metacritic.com/game/playstation-2/harvest-moon-save-the-homeland", "publisher": "Natsume", "release_date": "Nov 22 2001", "developers": ["Victor Interactive Software"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Strategy", "Breeding/Constructing"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/b1f39e9184e1108c50a86927c433253c-98.jpg", "descriptions": "Perhaps best described as a \"Life Simulation,\" Save the Homeland's object is to successfully save the village from being turned into a resort. Construction begins in a year, so you must find a way to save your homeland before that. The game features nine possible successful endings.  [Natsume]"}, {"name": "Boxing Fever", "details_link": "https://www.metacritic.com/game/game-boy-advance/boxing-fever", "publisher": "Majesco Games", "release_date": "Oct 11 2001", "developers": ["Digital Fiction"], "platforms": "Game Boy Advance", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/a1004e4a2f7ad672a47f7af212859665-98.jpg", "descriptions": "BOXING FEVER is the ultimate fighting challenge for the Nintendo Game Boy Advance system. Take on over eight of the fastest, strongest, and most brutal boxers from all over the world, or challenge your friends in a head to head knock down battle to prove who's the biggest, baddest boxer of all time."}, {"name": "Sega Bass Fishing 2", "details_link": "https://www.metacritic.com/game/dreamcast/sega-bass-fishing-2", "publisher": "Sega", "release_date": "Aug 21 2001", "developers": ["Wow Entertainment"], "platforms": "Dreamcast", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/9d06a53e2fc7f067562baa127d3182e9-98.jpg", "descriptions": "Sega Bass Fishing 2 totally redefines the virtual fishing experience with realistic lakes and life-like ecologies. Watch out-the fish are even smarter this time around! Even with over 100 lures and the freedom to cast anywhere, you'll need every ounce of skill that you have if you want toSega Bass Fishing 2 totally redefines the virtual fishing experience with realistic lakes and life-like ecologies. Watch out-the fish are even smarter this time around! Even with over 100 lures and the freedom to cast anywhere, you'll need every ounce of skill that you have if you want to fill your boat.… Expand"}, {"name": "Toy Story Racer", "details_link": "https://www.metacritic.com/game/playstation/toy-story-racer", "publisher": "Activision", "release_date": "Mar  5 2001", "developers": ["Traveller's Tales"], "platforms": "PlayStation", "genres": ["Driving", "Racing", "Kart"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/cc395c829c30d4ffb7e8c408b70ed700-98.jpg", "descriptions": "It's no Crash Team Racing, but Toy Story Racer provides plenty of challenge for young and old alike."}, {"name": "Star Wars Episode I: Jedi Power Battles", "details_link": "https://www.metacritic.com/game/dreamcast/star-wars-episode-i-jedi-power-battles", "publisher": "LucasArts", "release_date": "Oct 18 2000", "developers": ["LucasArts"], "platforms": "Dreamcast", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/e2783994185dc82a8fa4241861308a19-98.jpg", "descriptions": "Take back the Theed palace in fast and furious lightsaber assaults. You will have the power of the Force and your trusty Jedi saber as you ward off legions of battle droids, destroyer droids, assassins and other creatures from the Star Wars: Episode I worlds."}, {"name": "Star Trek: Invasion", "details_link": "https://www.metacritic.com/game/playstation/star-trek-invasion", "publisher": "Activision", "release_date": "Jun 29 2000", "developers": ["Warthog"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/82300a8f01c39aac02ffa0f4a6e6e029-98.jpg", "descriptions": "Stardate 54101.02\rIt's the 24th Century: Borg vessels are rapidly approaching near space, Romulans are suddenly attacking Federation vessels and a respected Starfleet Captian has turned renagade, taking his ship with him! As a hotshot pilot in the elite Red Squad tactical strike force,Stardate 54101.02\rIt's the 24th Century: Borg vessels are rapidly approaching near space, Romulans are suddenly attacking Federation vessels and a respected Starfleet Captian has turned renagade, taking his ship with him! As a hotshot pilot in the elite Red Squad tactical strike force, under the command of Lt. Commander Worf, you must uncover the plot behind this deadly pattern of events and fight back to save the universe from a doomsday scenario. Flying a prototype single seat combat fighter, codenamed \"Valkyre\", you and your squad members are in for the fight of your lives...… Expand"}, {"name": "Call of Duty: Finest Hour", "details_link": "https://www.metacritic.com/game/playstation-2/call-of-duty-finest-hour", "publisher": "Activision", "release_date": "Nov 16 2004", "developers": ["Spark Unlimited"], "platforms": "PlayStation 2", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/b47f7512600101e0fc565757be51f5ac-98.jpg", "descriptions": "Developed by Spark Unlimited, a newly formed studio comprised of 27 of the individuals who developed titles in the \"Medal of Honor\" series, Call of Duty: Finest Hour is a separate and distinct game from the PC first-person shooter. It features a unique storyline, missions and battlefieldDeveloped by Spark Unlimited, a newly formed studio comprised of 27 of the individuals who developed titles in the \"Medal of Honor\" series, Call of Duty: Finest Hour is a separate and distinct game from the PC first-person shooter. It features a unique storyline, missions and battlefield environments; intense battlefield conflicts; unsung heroes fighting as part of a crack squad through the chaos of battle; playable perspectives from three different allied sides -- American, British, and Russian; authentic weapons, vehicles, environments, combat missions and the real sounds of war. [Activision]… Expand"}, {"name": "Assassin's Creed Syndicate", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-syndicate", "publisher": "Ubisoft", "release_date": "Oct 23 2015", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Action Adventure", "Open-World"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/38762a44c3ccf353d9d1a78e532f4fdd-98.jpg", "descriptions": "1868 London. The Industrial Revolution. An age of invention and wealth, built on the backs of the working class. As gangster killer Jacob Frye, you recruit a gang to fight for justice on behalf of the oppressed working class. Lead the underworld to reclaim London in an adventure filled with1868 London. The Industrial Revolution. An age of invention and wealth, built on the backs of the working class. As gangster killer Jacob Frye, you recruit a gang to fight for justice on behalf of the oppressed working class. Lead the underworld to reclaim London in an adventure filled with action, intrigue and brutal combat. With Jacob as the leader, players can establish UK's fiercest gang, the only force that can challenge the elite and defeat rival gangs to bring freedom to the oppressed folks. Enemy strongholds can be infiltrated by using an arsenal to dominate London’s underworld. From robbing trains to rescuing child workers, players will do everything they can to bring justice to London’s lawless streets. [Ubisoft]… Expand"}, {"name": "Twisted Metal", "details_link": "https://www.metacritic.com/game/playstation-3/twisted-metal", "publisher": "SCEA", "release_date": "Feb 14 2012", "developers": ["Eat Sleep Play"], "platforms": "PlayStation 3", "num_players": "Up to 16 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/fd37ba89e49022a446fd194cee7f55e2-98.jpg", "descriptions": "With four factions battling for control, players step into the combat boots of a twisted disciple in a high octane, highly destructible world. Players fight for the prize of one wish fulfilled by the stylishly evil Calypso, the mastermind behind the Twisted Metal tournament. DisciplesWith four factions battling for control, players step into the combat boots of a twisted disciple in a high octane, highly destructible world. Players fight for the prize of one wish fulfilled by the stylishly evil Calypso, the mastermind behind the Twisted Metal tournament. Disciples strategically dismantle opponents in vehicles loaded with weapons of Twisted destruction.… Expand"}, {"name": "NBA 2K22", "details_link": "https://www.metacritic.com/game/playstation-5/nba-2k22", "publisher": "2K Games", "release_date": "Sep 10 2021", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 76, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/1/7e1c8e0d7cadee624d33bdaa3af36ac2-98.jpg", "descriptions": "Enjoy competitive gameplay, online features, and a variety of game modes, including myCAREER, as you put together your dream team in this  basketball video game. A WORLD OF BASKETBALL. NBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environmentsEnjoy competitive gameplay, online features, and a variety of game modes, including myCAREER, as you put together your dream team in this  basketball video game. A WORLD OF BASKETBALL. NBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environments against authentic teams and players. Build your own dream team in MyTEAM with today’s stars and yesterday’s legends. Live out your own pro journey in MyCAREER and experience your personal rise to the NBA. Flex your management skills as a powerful Executive in MyGM and MyLEAGUE. Anyone, anywhere can hoop in NBA 2K22.… Expand"}, {"name": "Yo-kai Watch", "details_link": "https://www.metacritic.com/game/3ds/yo-kai-watch", "publisher": "Nintendo", "release_date": "Nov  6 2015", "developers": ["Level 5"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Japanese-Style", "Role-Playing", "Trainer"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/bc36ef689d7c4b014d6b923be4ffa90d-98.jpg", "descriptions": "The YO-KAI WATCH game is about hundreds of sometimes cute, sometimes spooky, and usually mischievous Yo-kai that inhabit our world. Yo-kai are not ghosts, monsters or creatures. Yo-kai are, quite simply, Yo-kai. They cannot be seen by the human eye, but they are everywhere. Whether born fromThe YO-KAI WATCH game is about hundreds of sometimes cute, sometimes spooky, and usually mischievous Yo-kai that inhabit our world. Yo-kai are not ghosts, monsters or creatures. Yo-kai are, quite simply, Yo-kai. They cannot be seen by the human eye, but they are everywhere. Whether born from the soul of a deceased human, or an everyday object discovering its higher purpose, their personalities are distinctly humanlike.… Expand"}, {"name": "WindJammers", "details_link": "https://www.metacritic.com/game/playstation-4/windjammers", "publisher": "DotEmu", "release_date": "Aug 29 2017", "developers": ["DotEmu"], "platforms": ["PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Individual", "Other"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/e0a1be6b99b8e3c957d0af3a98a565c6-98.jpg", "descriptions": "A dazzling new game combining the thrills of tennis, the dangers of the discus, and the heart-stopping competition of competition sports. Six of the world's toughest and most clever athletes take court in the most thrilling new sport of the fin-de-seicle! WINDJAMMERS - It will blow you away!"}, {"name": "Super Mario Party", "details_link": "https://www.metacritic.com/game/switch/super-mario-party", "publisher": "Nintendo", "release_date": "Oct  5 2018", "developers": ["Nintendo", "Nd Cube"], "platforms": "Switch", "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/bff689918631e657e2af88cf2e623e02-98.jpg", "descriptions": "The party comes to Nintendo Switch in this complete refresh of the Mario Party series. The Mario Party series is coming to the Nintendo Switch system with super-charged fun for everyone. The original board game style has been kicked up a notch with deeper strategic elements, like specifcThe party comes to Nintendo Switch in this complete refresh of the Mario Party series. The Mario Party series is coming to the Nintendo Switch system with super-charged fun for everyone. The original board game style has been kicked up a notch with deeper strategic elements, like specifc Dice Blocks for each character. The game also introduces all-new ways to play, including Joy-Con controller enabled minigames, and new modes to enjoy with family and friends. Board game play goes back to the four-player basics as you take turns and race across the board searching for Stars. You can also pair up two Nintendo Switch systems and delight in this dynamic play style, such as in the new Toad's Rec Room mode. With new modes and new minigames coupled with original board game play, the party starts anywhere, anytime, and with all kinds of players.\r Features a variety of modes, including:\r* Mario Party: Enjoy the original Mario Party board game experience with new element like character dice blocks, a party system, and new boards to explore\r* Toad's Rec Room: A dynamic new play style that pairs up two Nintendo Switch systems for Table top mode\r* Go head-to-head in 80 new minigames with many ways to play: Fast and fun skill-based mini-games that use the Joy-Con controllers in all sorts of different ways… Expand"}, {"name": "Mario & Luigi: Paper Jam", "details_link": "https://www.metacritic.com/game/3ds/mario-luigi-paper-jam", "publisher": "Nintendo", "release_date": "Jan 22 2016", "developers": ["Nintendo", "Alphadream Corporation"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/f08d5172deab5c24e5637d6e1ad2e362-98.jpg", "descriptions": "Paper Mario jumps out of a book and into the bizarre adventures of Mario & Luigi, resulting in hijinks. Become the superstar team of Mario, Luigi and Paper Mario to take on quests, take down enemies, and untangle these two unique universes in this playful new entry in the Mario & Luigi series."}, {"name": "Weird West", "details_link": "https://www.metacritic.com/game/pc/weird-west", "publisher": "Devolver Digital", "release_date": "Mar 31 2022", "developers": ["Wolfeye Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/2dde4f436067a6d01fb917c31b3e6824-98.jpg", "descriptions": "Survive and unveil the mysteries of the Weird West through the intertwined destinies of its unusual heroes in an immersive sim from the co-creators of Dishonored and Prey. Discover a dark fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantasticalSurvive and unveil the mysteries of the Weird West through the intertwined destinies of its unusual heroes in an immersive sim from the co-creators of Dishonored and Prey. Discover a dark fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantastical creatures. Journey through the origin stories of a group of atypical heroes, written into legend by the decisions you make in an unforgiving land. Each journey is unique and tailored to the actions taken - a series of high stakes stories where everything counts and the world reacts to the choices you make. Form a posse or venture forth alone into an otherworldly confines of the Weird West and make each legend your own.… Expand"}, {"name": "Divinity: Dragon Commander", "details_link": "https://www.metacritic.com/game/pc/divinity-dragon-commander", "publisher": "Larian Studios Games", "release_date": "Aug  6 2013", "developers": ["Larian Studios Games"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/7fcbbc56c8c49d9d3bd7ed6cd5cebdc4-98.jpg", "descriptions": "Set in the time when both magic and technology were at their peak in the Divinity universe, Dragon Commander tells the story of a young dragon knight who fights for the survival of Rivellon when his father, the king, is brutally murdered for opposing the teachings of a new religion. SixSet in the time when both magic and technology were at their peak in the Divinity universe, Dragon Commander tells the story of a young dragon knight who fights for the survival of Rivellon when his father, the king, is brutally murdered for opposing the teachings of a new religion. Six nations - the elves, the dwarves, the imps, the undead, the lizards and the humans - must set aside their differences and unite to stop empress Aurora from taking over the world.… Expand"}, {"name": "Penny Arcade Adventures: Episode One", "details_link": "https://www.metacritic.com/game/xbox-360/penny-arcade-adventures-episode-one", "publisher": "Hothead Games", "release_date": "May 21 2008", "developers": ["Hothead Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Adventure", "General", "General"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/d06eb09334526e27ae1e1a3540ca73b4-98.jpg", "descriptions": "[Xbox Live Arcade]  This first installment of the episodic role-playing adventure game series is set in the highly stylized 1920s universe of New Arcadia filled with bizarre characters, outrageous combat, and adult humor. Create and develop your very own character to participate in the[Xbox Live Arcade]  This first installment of the episodic role-playing adventure game series is set in the highly stylized 1920s universe of New Arcadia filled with bizarre characters, outrageous combat, and adult humor. Create and develop your very own character to participate in the adventure. Penny Arcade Adventures keeps the fun going with new material released regularly, with pick up and play capabilities from any episode, and the ability to carry over your character's appearance, stats, and inventory from episode to episode. The turn-based combat system features over-the-top animations and team-up moves during enemy battles. The classic adventure-style gameplay combines with RPG elements for a mysterious and puzzling good time. The crazed geniuses behind Penny Arcade promise a thrilling and wild ride, with story and dialogue written by written by Jerry \"Tycho\" Holkins and art by Mike \"Gabe\" Krahulik. Working with Gabe and Tycho of the Startling Developments Detective Agency, it will be your job to resolve the chaos and solve the mysteries of New Arcadia. [Hothead Games]… Expand"}, {"name": "Sonic Generations", "details_link": "https://www.metacritic.com/game/playstation-3/sonic-generations", "publisher": "Sega", "release_date": "Nov  1 2011", "developers": ["Sega", "Sonic Team"], "platforms": ["3DS", "PC", "PC", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/4cdba3b69252fac4949a85605d5ed070-98.jpg", "descriptions": "Set across three defining eras from 20 years of Sonic the Hedgehog video game history, the instantly recognisable environments of Sonic Generations have been re-built in stunning HD and are now playable in both classic side scrolling 2D from 1991, as well as modern 3D style found in Sonic'sSet across three defining eras from 20 years of Sonic the Hedgehog video game history, the instantly recognisable environments of Sonic Generations have been re-built in stunning HD and are now playable in both classic side scrolling 2D from 1991, as well as modern 3D style found in Sonic's most recent adventures. Each incarnation of Sonic in Sonic Generations comes complete with his trademark special move, Spin Dash and Spin Attack for Classic Sonic, and Homing Attack and Sonic Boost for Modern Sonic. An innovative new interactive menu system allows for complete immersion in Sonic's universe with favourite characters and hidden treasures gradually being revealed throughout the game. … Expand"}, {"name": "The Suffering: Ties That Bind", "details_link": "https://www.metacritic.com/game/xbox/the-suffering-ties-that-bind", "publisher": "Midway", "release_date": "Sep 26 2005", "developers": ["Surreal Software"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/7b4f22e899d10c4577c31077fc2f9bd7-98.jpg", "descriptions": "The Suffering: Ties That Bind is the sequel to the action horror game The Suffering. This time, you must defeat a host of abominable creatures through spooky 3D environments set in a prison in Baltimore. The game lets you choose to be good or evil, and your choice affects your abilities asThe Suffering: Ties That Bind is the sequel to the action horror game The Suffering. This time, you must defeat a host of abominable creatures through spooky 3D environments set in a prison in Baltimore. The game lets you choose to be good or evil, and your choice affects your abilities as well as the storyline. Ties that Bind also features vehicle combat and more combat controls. … Expand"}, {"name": "Sushi Striker: The Way of Sushido", "details_link": "https://www.metacritic.com/game/switch/sushi-striker-the-way-of-sushido", "publisher": "Nintendo", "release_date": "Jun  8 2018", "developers": ["indieszero"], "platforms": ["3DS", "Switch"], "num_players": "2 ", "genres": ["Puzzle", "Matching"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/e772ab61516e527f432adfc2c91db2c9-98.jpg", "descriptions": "Help Musashi end the Empire's tyrannical monopoly of the world's sushi supply by becoming a Sushi Striker! Devour conveyor-belt sushi, matching plates and sushi types to defeat any enemy or boss who stands between you and victory. Befriend Sushi Sprites and use their powerful skills inHelp Musashi end the Empire's tyrannical monopoly of the world's sushi supply by becoming a Sushi Striker! Devour conveyor-belt sushi, matching plates and sushi types to defeat any enemy or boss who stands between you and victory. Befriend Sushi Sprites and use their powerful skills in battle. Deliciously strategic action-RPG-puzzle battles await!… Expand"}, {"name": "Donkey Konga", "details_link": "https://www.metacritic.com/game/gamecube/donkey-konga", "publisher": "Nintendo", "release_date": "Sep 27 2004", "developers": ["Namco"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/b1bb902182402e2e4e05ea867cc26b46-98.jpg", "descriptions": "Join Donkey and Diddy Kong as they drum their way through both old and new hits. With the new DK Bongo drum controller, you can drum and clap through this musical adventure. The game features songs that range from kids' medleys to classical and pop music. Connect up to four DK BongoJoin Donkey and Diddy Kong as they drum their way through both old and new hits. With the new DK Bongo drum controller, you can drum and clap through this musical adventure. The game features songs that range from kids' medleys to classical and pop music. Connect up to four DK Bongo controllers for single-player jam sessions or multiplayer matches. Only you can help Donkey and Diddy realize their dream of becoming famous, earning money, and buying all the bananas they could ever want.… Expand"}, {"name": "Zuma's Revenge!", "details_link": "https://www.metacritic.com/game/xbox-360/zumas-revenge!", "publisher": "PopCap", "release_date": "Jul 11 2012", "developers": ["PopCap"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/32b62b7fab6b7ec8f8e53ced45e4cf08-98.jpg", "descriptions": "In Zuma the player takes the role of a fearless ball-shooting frog, exploring ancient temples and ruins."}, {"name": "MLB 12: The Show", "details_link": "https://www.metacritic.com/game/playstation-vita/mlb-12-the-show", "publisher": "SCEA", "release_date": "Mar  6 2012", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 3", "PlayStation Vita"], "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/2a3ce32bf2868fc20114a7c53a7799fc-98.jpg", "descriptions": "MLB 12 The Show builds on what has been delivered in previous franchise releases, adding compelling features that bring unparalleled innovation."}, {"name": "World of Tanks", "details_link": "https://www.metacritic.com/game/xbox-one/world-of-tanks", "publisher": "Wargaming.net", "release_date": "Jul 28 2015", "developers": ["Wargaming.net"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox 360", "Xbox One"], "genres": ["Action", "Simulation", "Shooter", "Vehicle", "Third-Person", "Combat", "Tactical"], "meta_score": 76, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/84930e887d223ead2d079d702ffc71ff-98.jpg", "descriptions": "World of Tanks on Xbox One features hundreds of tanks recreated in realistic detail, presented in high-definition. The title also features a number of firsts, including cross-platform gameplay-bridging battles between Xbox 360 and Xbox One players, shared progress and content between the twoWorld of Tanks on Xbox One features hundreds of tanks recreated in realistic detail, presented in high-definition. The title also features a number of firsts, including cross-platform gameplay-bridging battles between Xbox 360 and Xbox One players, shared progress and content between the two platforms through a single Xbox Live account, an all-new “Proving Grounds” Player versus Environment (PvE) mode, full social and streaming support offered by the Xbox One platform, and more.… Expand"}, {"name": "NHL 07", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-07", "publisher": "EA Sports", "release_date": "Sep 12 2006", "developers": ["EA Sports"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 76, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/4b7fa197998d8710200082f9917c6110-98.jpg", "descriptions": "The golden age of console hockey returns with NHL 07, featuring gameplay innovations that make players feel like they are actually on the ice. Featuring an unmatched level of freedom and control, NHL 07 allows hockey purists and casual fans alike to feel like they can play like a pro.The golden age of console hockey returns with NHL 07, featuring gameplay innovations that make players feel like they are actually on the ice. Featuring an unmatched level of freedom and control, NHL 07 allows hockey purists and casual fans alike to feel like they can play like a pro. [Electronic Arts]… Expand"}, {"name": "The Denpa Men 2: Beyond the Waves", "details_link": "https://www.metacritic.com/game/3ds/the-denpa-men-2-beyond-the-waves", "publisher": "Genius Sonority Inc.", "release_date": "May 30 2013", "developers": ["Genius Sonority Inc."], "platforms": "3DS", "genres": ["Role-Playing", "General", "General"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/124c48f2ccbd5a53e11157b75e230232-98.jpg", "descriptions": "The Denpa Men are mysterious little creatures that float around radio waves. They all have their own territory. You can't see them with the naked eye, but you can use your 3DS to find them and catch them.\r In this RPG, you can form a team of the Denpa Men you caught and take them on anThe Denpa Men are mysterious little creatures that float around radio waves. They all have their own territory. You can't see them with the naked eye, but you can use your 3DS to find them and catch them.\r In this RPG, you can form a team of the Denpa Men you caught and take them on an exciting adventure across the world, in order to save the hero's family. Many wonders and strong enemies await you on your journey!\rThis game supports StreetPass as well. By passing other players, you can exchange your party information and increase the amount of time you have to explore special dungeons.\r You can even battle online now! All you have to do is register for battle, and you'll be able to fight other players at any time you want. Keep winning to earn phenomenal prizes!\r If you played the previous game, \"THE 'DENPA' MEN: They Came By Wave,\" you'll be able to transfer your hero and you'll even be able to bring all of your friends from the previous game into this one!… Expand"}, {"name": "Singularity", "details_link": "https://www.metacritic.com/game/xbox-360/singularity", "publisher": "Activision", "release_date": "Jun 29 2010", "developers": ["Raven Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/1e40e0c538637e48c77eb76bf5a12649-98.jpg", "descriptions": "On a clandestine mission deep into Russian territory, an American black ops team crash lands on an island research base that was mysteriously abandoned in the 1950’s. Cut off from the outside and under attack by an army of nightmarish creatures, Captain Nathaniel Renko is forced to battleOn a clandestine mission deep into Russian territory, an American black ops team crash lands on an island research base that was mysteriously abandoned in the 1950’s. Cut off from the outside and under attack by an army of nightmarish creatures, Captain Nathaniel Renko is forced to battle his way through the hostile territory armed with the TMD (Time Manipulation Device) – a time altering weapon created over 50 years ago. Who created the TMD and why is just one of the many Cold War secrets Renko must uncover as he is thrown back and forth across time, making choices that will alter the course of world history. [Raven Software]… Expand"}, {"name": "Rush for Berlin", "details_link": "https://www.metacritic.com/game/pc/rush-for-berlin", "publisher": "Paradox Interactive", "release_date": "Jun 12 2006", "developers": ["Stormregion"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/818929d23792cb30f703e2fa12ca64cf-98.jpg", "descriptions": "From the creators of \"Codename: Panzers\", Rush for Berlin is a tactical real time strategy game, set on the European battlefields of World War II, during 1944-45. The player’s goal; to capture the German capital, as either the British/US/French alliance or the Red army of the Soviet Union.From the creators of \"Codename: Panzers\", Rush for Berlin is a tactical real time strategy game, set on the European battlefields of World War II, during 1944-45. The player’s goal; to capture the German capital, as either the British/US/French alliance or the Red army of the Soviet Union. The act symbolizes the total defeat of the Third Reich and means the end of the war on the European continent. Players face more and more challenges, as they get closer to the capital. The game is based on historical facts and gives wide possibilities for changing history and playing an alternative reality. [Deep Silver]… Expand"}, {"name": "Evil Dead: The Game", "details_link": "https://www.metacritic.com/game/pc/evil-dead-the-game", "publisher": "Saber Interactive", "release_date": "May 13 2022", "developers": ["Saber Interactive"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Survival"], "meta_score": 76, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/7/8f71f8ceb1903dcee37df68bfcda4d39-98.jpg", "descriptions": "Step into the shoes of Ash Williams or his friends from the iconic Evil Dead franchise and work together in a game loaded with over-the-top co-op and PVP multiplayer action! Play as a team of four survivors, exploring, looting, crafting, managing your fear, and finding key items to seal theStep into the shoes of Ash Williams or his friends from the iconic Evil Dead franchise and work together in a game loaded with over-the-top co-op and PVP multiplayer action! Play as a team of four survivors, exploring, looting, crafting, managing your fear, and finding key items to seal the breach between worlds in a game inspired by all three original Evil Dead films as well as the Starz original Ash vs Evil Dead television series.\r ICONIC CHARACTERS\rPlay as characters from throughout the Evil Dead universe, including Ash, Scotty, Lord Arthur, Kelly Maxwell, Pablo Simon Bolivar, and more, with new dialogue performed by Bruce Campbell and others!\r PLAY AS GOOD OR EVIL...\rFight for the forces of good or take control of the powerful Kandarian Demon to hunt Ash and other players while possessing Deadites, the environment, and even the survivors themselves as you seek to swallow their souls!\r OVER THE TOP VISUALS\rWhether you're tearing a Deadite in two with Ash's famous chainsaw hand or flying through the map as the Kandarian Demon in spirit form, the game captures the look and feel of the Evil Dead franchise in all its glory, with realistic visuals and a physics-based gore system that brings the horror to life! \r\rTHIS...IS MY BROOMSTICK!\rBrandish your short barrel shotgun, chainsaw, cleavers and more to do some delightfully gruesome violence against the armies of darkness.\r Evil Dead: The Game features multiplayer co-op and PvP for PC, Xbox One, Xbox X|S, PlayStation 4, PlayStation 5, and Nintendo Switch.… Expand"}, {"name": "Control: AWE", "details_link": "https://www.metacritic.com/game/playstation-4/control-awe", "publisher": "505 Games", "release_date": "Aug 27 2020", "developers": ["Remedy Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/ab75e6cb0967dba9bd6a09e9f1b58237-98.jpg", "descriptions": "The Bureau studied its most dangerous Altered World Events in this lost sector. The records were sealed, the objects contained, and their powers abandoned. Now, the sector is breached and the objects are loose…\rAWE brings new story content and side missions as well as new weapons and modsThe Bureau studied its most dangerous Altered World Events in this lost sector. The records were sealed, the objects contained, and their powers abandoned. Now, the sector is breached and the objects are loose…\rAWE brings new story content and side missions as well as new weapons and mods to the world of Control.… Expand"}, {"name": "Masquerada: Songs and Shadows", "details_link": "https://www.metacritic.com/game/playstation-4/masquerada-songs-and-shadows", "publisher": "Ysbryd Games", "release_date": "Aug  8 2017", "developers": ["Witching Hour Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/807533708a04cc7b01ab4d9b0336338e-98.jpg", "descriptions": "Masquerada is a single-player tactical RPG adventure where real-time combat can be paused for tactics with Venetian-styled masks that grant deadly magic."}, {"name": "Strong Bad's Cool Game for Attractive People Episode 1: Homestar Ruiner", "details_link": "https://www.metacritic.com/game/wii/strong-bads-cool-game-for-attractive-people-episode-1-homestar-ruiner", "publisher": "Telltale Games", "release_date": "Aug 11 2008", "developers": ["Telltale Games"], "platforms": ["PC", "PlayStation 3", "Wii"], "num_players": "1 Player", "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/7a81c311051d77813ad1a1896c05ae43-98.jpg", "descriptions": "[WiiWare] Charming. Suave. Awesome. These are the words Strong Bad would use to describe himself. In a world gone mad, only one man can be trusted to save the day. A man with an attitude. A man called Strong Bad. As the star of the Homestar Runner Web cartoons, Strong Bad has been answering[WiiWare] Charming. Suave. Awesome. These are the words Strong Bad would use to describe himself. In a world gone mad, only one man can be trusted to save the day. A man with an attitude. A man called Strong Bad. As the star of the Homestar Runner Web cartoons, Strong Bad has been answering e-mails (in boxing gloves), pranking his friends, pummeling his enemies, and making people with questionable taste snort milk out of their noses for years now. And he's branched out to star in Strong Bad's Cool Game for Attractive People, a monthly five-episode series. In Episode 1: Homestar Ruiner, Strong Bad's plans to beat the snot out of Homestar backfire, and he ends up with an unwanted houseguest cramping his style. Now he needs to get life back to normal by any means possible. But wait, there's more: Teen Girl Squad comics, achievements, funny costumes and arcade games. You can even send pictures and messages to Wii Friends using Strong Bad's computer. So how about it? Can you handle Strong Bad's style? [Nintendo]… Expand"}, {"name": "Wolfenstein: The Old Blood", "details_link": "https://www.metacritic.com/game/playstation-4/wolfenstein-the-old-blood", "publisher": "Bethesda Softworks", "release_date": "May  5 2015", "developers": ["MachineGames"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/09227e0cceb35656a34f063dfdee3da1-98.jpg", "descriptions": "It's 1946 and the Nazis are on the verge of winning WWII. In attmepting to turn the tide in the allies’ favor, B.J. Blazkowicz has to embark on an epic, two-part mission deep within Bavaria… Part one of Wolfenstein: The Old Blood - Rudi Jäger and the Den of Wolves - pits BJ BlazkowiczIt's 1946 and the Nazis are on the verge of winning WWII. In attmepting to turn the tide in the allies’ favor, B.J. Blazkowicz has to embark on an epic, two-part mission deep within Bavaria… Part one of Wolfenstein: The Old Blood - Rudi Jäger and the Den of Wolves - pits BJ Blazkowicz against a notorious prison warden as he breaks into Castle Wolfenstein in an attempt to steal the coordinates to General Deathshead’s compound. In the second part – The Dark Secrets of Helga Von Schabbs – our hero's search for the coordinates leads him to the city of Wulfburg where an obsessed Nazi archaeologist is exhuming enigmatic artifacts that threaten to unleash a dark and ancient power.… Expand"}, {"name": "Tales From Space: About a Blob", "details_link": "https://www.metacritic.com/game/playstation-3/tales-from-space-about-a-blob", "publisher": "DrinkBox Studios", "release_date": "Feb  8 2011", "developers": ["DrinkBox Studios"], "platforms": "PlayStation 3", "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/38838b70fdd1c2b2ad033ca2a679abd7-98.jpg", "descriptions": "Tales from Space: About a Blob is a game about a race of alien blobs that land on an Earth-like planet and start eating everything around them. Eating is just what Blobs do - they can't really help themselves. Although the Blobs aren't really out to hurt anyone, mistrustful humans greet themTales from Space: About a Blob is a game about a race of alien blobs that land on an Earth-like planet and start eating everything around them. Eating is just what Blobs do - they can't really help themselves. Although the Blobs aren't really out to hurt anyone, mistrustful humans greet them with hostility.… Expand"}, {"name": "NBA 2K22", "details_link": "https://www.metacritic.com/game/xbox-series-x/nba-2k22", "publisher": "2K Games", "release_date": "Sep 10 2021", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 76, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/2/23ee4fdfb79c67cb002a1a139d530e99-98.jpg", "descriptions": "Enjoy competitive gameplay, online features, and a variety of game modes, including myCAREER, as you put together your dream team in this  basketball video game. A WORLD OF BASKETBALL. NBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environmentsEnjoy competitive gameplay, online features, and a variety of game modes, including myCAREER, as you put together your dream team in this  basketball video game. A WORLD OF BASKETBALL. NBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environments against authentic teams and players. Build your own dream team in MyTEAM with today’s stars and yesterday’s legends. Live out your own pro journey in MyCAREER and experience your personal rise to the NBA. Flex your management skills as a powerful Executive in MyGM and MyLEAGUE. Anyone, anywhere can hoop in NBA 2K22.… Expand"}]