[
  {
    "name": "Strider",
    "details_link": "https://www.metacritic.com/game/pc/strider",
    "publisher": "Capcom",
    "release_date": "Feb 19 2014",
    "developers": [
      "Double Helix Games"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 78,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/4/134360cbfa7cf044d32cf41de7bc76c1-98.jpg",
    "descriptions": "Originally released in 1989, Strider remains one of Capcom's most enduring franchises.  The game tells the story of Hiryu, the youngest ever \"Super A\" ranked agent of an elite corps known as the Striders.  Strider Hiryu receives orders to assassinate Grandmaster Meio, supremeOriginally released in 1989, Strider remains one of Capcom's most enduring franchises.  The game tells the story of Hiryu, the youngest ever \"Super A\" ranked agent of an elite corps known as the Striders.  Strider Hiryu receives orders to assassinate Grandmaster Meio, supreme dictator of Earth, who has plunged humanity into a dystopian dark age.… Expand"
  },
  {
    "name": "Dead Space 3",
    "details_link": "https://www.metacritic.com/game/pc/dead-space-3",
    "publisher": "Electronic Arts",
    "release_date": "Feb  5 2013",
    "developers": [
      "Visceral Games"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Action",
      "Action Adventure",
      "Shooter",
      "Shooter",
      "Linear",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi"
    ],
    "meta_score": 78,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/8/4149d91657176b530a38f25078849f17-98.jpg",
    "descriptions": "Dead Space 3 embodies deep space terror. Players embark on a ride through space that takes them to a hostile new planet, Tau Volantis. Fortunately, they are not alone this time around. The fully integrated drop-in/drop-out co-op feature gives players the option to play alone or team-up withDead Space 3 embodies deep space terror. Players embark on a ride through space that takes them to a hostile new planet, Tau Volantis. Fortunately, they are not alone this time around. The fully integrated drop-in/drop-out co-op feature gives players the option to play alone or team-up with a friend anytime. Players that choose to take down the terror together experience additional story details, side missions and gameplay mechanics only found when playing as John Carver. … Expand"
  },
  {
    "name": "Anno 1701: Dawn of Discovery",
    "details_link": "https://www.metacritic.com/game/ds/anno-1701-dawn-of-discovery",
    "publisher": "Ubisoft",
    "release_date": "Mar  4 2008",
    "developers": [
      "Sunflowers Interactive"
    ],
    "platforms": [
      "PC",
      "DS"
    ],
    "num_players": "4  Online",
    "genres": [
      "Simulation",
      "General",
      "General"
    ],
    "meta_score": 78,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/2/ebe800391156d0dfa9a077371b03263c-98.jpg",
    "descriptions": "(Also known as \"Anno 1701: Dawn of Discovery\")  In Anno 1701 you can experience the adventurous world of the 18th century with up to three friends, mobile and wireless. Explore, settle and expand in a completely new world. Prove yourself as adventurer and embark on the journey of your(Also known as \"Anno 1701: Dawn of Discovery\")  In Anno 1701 you can experience the adventurous world of the 18th century with up to three friends, mobile and wireless. Explore, settle and expand in a completely new world. Prove yourself as adventurer and embark on the journey of your lifetime. Set sail to explore nameless islands and strange cultures, prove yourself as strategist, trader and town planner. Develop a new, powerful colony – it's up to you. Based on Germany's successful PC-Game-Franchise, ANNO 1701 for Nintendo DS is original development utilizing the unique options offered by the Nintendo DS. The island worlds of ANNO 1701 can be explored, developed and controlled solely by using the stylus. The upper screen provides all relevant game play information while the game takes its course on the touchscreen below. Three different game modes offer endless fun: a full-fledged campaign including dramatic cut scenes, a versatile endless-game-mode for free exploration and development of the island world, as well as a multiplayer mode offering competitive fun for up to four players via Nintendo WFC.… Expand"
  },
  {
    "name": "Tomb Raider: Anniversary",
    "details_link": "https://www.metacritic.com/game/psp/tomb-raider-anniversary",
    "publisher": "Eidos Interactive",
    "release_date": "Aug  9 2007",
    "developers": [
      "Crystal Dynamics"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox 360",
      "PSP"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Linear"
    ],
    "meta_score": 78,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/90fdbf92efceb0a999c077a8031c7545-98.jpg",
    "descriptions": "Inspired by the first Tomb Raider videogame, originally released in 1996, Lara Croft Tomb Raider: Anniversary is a totally new 2006 adventure for Lara, faithfully preserving the elements which made the original Tomb Raider such a classic. Using an enhanced \"Tomb Raider Legend\" game engine,Inspired by the first Tomb Raider videogame, originally released in 1996, Lara Croft Tomb Raider: Anniversary is a totally new 2006 adventure for Lara, faithfully preserving the elements which made the original Tomb Raider such a classic. Using an enhanced \"Tomb Raider Legend\" game engine, the graphics, technology and physics bring Lara's adventure and pursuit of a mystical artefact known only as the Scion up to today’s technology standards and offer gamers a completely new gameplay experience. The puzzles are now more in depth and incorporate environmental interaction and physics driven solutions. The level design and flow of gameplay are inspired by the original videogame making Lara Croft Tomb Raider: Anniversary a brand new experience in gaming, while still invoking the nostalgia of the first adventure in Tomb Raiding. [Eidos Interactive]… Expand"
  },
  {
    "name": "Metal Gear Solid: Digital Graphic Novel",
    "details_link": "https://www.metacritic.com/game/psp/metal-gear-solid-digital-graphic-novel",
    "publisher": "Konami",
    "release_date": "Jun 13 2006",
    "developers": [
      "Kojima Productions"
    ],
    "platforms": "PSP",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "General",
      "General"
    ],
    "meta_score": 78,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/7/1b9e3aabb3653ed022a052d90055857f-98.jpg",
    "descriptions": "Metal Gear Solid Digital Graphic Novel brings the renowned Metal Gear Solid comic book series to life on the PSP, complete with stylized animation, thrilling music and explosive sound effects. Experience Metal Gear Solid in a whole new way through animated digital comics with a dynamic scoreMetal Gear Solid Digital Graphic Novel brings the renowned Metal Gear Solid comic book series to life on the PSP, complete with stylized animation, thrilling music and explosive sound effects. Experience Metal Gear Solid in a whole new way through animated digital comics with a dynamic score and exhilarating sound effects. Story based on comics from IDW Publishing - written by Kris Oprisko and artwork by acclaimed artist Ashley Wood. Memory Building Simulation Mode - Highlight different items, characters, and plot points during comic viewing to unlock a history and library of all things Metal Gear Solid. [Konami]… Expand"
  },
  {
    "name": "Condemned: Criminal Origins",
    "details_link": "https://www.metacritic.com/game/pc/condemned-criminal-origins",
    "publisher": "Sega",
    "release_date": "Apr 11 2006",
    "developers": [
      "Monolith Productions"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Survival"
    ],
    "meta_score": 78,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/8/4087d0b62dbea37f9beeb869bf71c229-98.jpg",
    "descriptions": "Developed by  Monolith Productions for the Xbox 360, Condemned: Criminal Origins allows players to experience a heightened level of psychological tension as they use their instincts, forensic tools, and melee combat to track serial killers and bring them to justice. Gamers will play as AgentDeveloped by  Monolith Productions for the Xbox 360, Condemned: Criminal Origins allows players to experience a heightened level of psychological tension as they use their instincts, forensic tools, and melee combat to track serial killers and bring them to justice. Gamers will play as Agent Thomas, an investigator in the FBI’s Serial Crimes Unit (SCU), whose pursuit of relentless serial killers leads him through urban environments filled with sociopaths lurking on the periphery of humanity. Weapons and ammunition are scarce, leaving the player vulnerable to a gallery of mentally deranged criminals. Careful detective work and precision reflexes are a player’s primary means of survival. [Sega]… Expand"
  },
  {
    "name": "Blitz: The League",
    "details_link": "https://www.metacritic.com/game/xbox/blitz-the-league",
    "publisher": "Midway",
    "release_date": "Oct 17 2005",
    "developers": [
      "Midway"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360",
      "Xbox"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/7/c4818d4bb751470e130903dd7e436965-98.jpg",
    "descriptions": "Blitz: The League brings you more Blitz-style play, but with more content and harder hits. The League includes on-field injuries, ranging from snapping bones to bloody, career-ending hits. Now you can control the entire franchise, dealing with personnel decisions and front-office politics.Blitz: The League brings you more Blitz-style play, but with more content and harder hits. The League includes on-field injuries, ranging from snapping bones to bloody, career-ending hits. Now you can control the entire franchise, dealing with personnel decisions and front-office politics. New visual game modes let you view crucial game moments and moves in slow motion. In addition to traditional multiplayer, you can also play the no-holds-barred style of Blitz football online.… Expand"
  },
  {
    "name": "Capcom Classics Collection",
    "details_link": "https://www.metacritic.com/game/playstation-2/capcom-classics-collection",
    "publisher": "Capcom",
    "release_date": "Sep 27 2005",
    "developers": [
      "Digital Eclipse"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-3 ",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 78,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/f207352b3b94252b456a8214da6979be-98.jpg",
    "descriptions": "Capcom Classics Collection takes players back to the days of break dancing and waiting in endless arcade lines to see how long they can make their coveted quarter last. Spanning over 10 years of Capcom history, this anthology contains hundreds of hours of gameplay with treasured favoritesCapcom Classics Collection takes players back to the days of break dancing and waiting in endless arcade lines to see how long they can make their coveted quarter last. Spanning over 10 years of Capcom history, this anthology contains hundreds of hours of gameplay with treasured favorites including the WWII-style plane assault of '1942', defeating Metro City street gangs in 'Final Fight', rescuing Princess Guinevere against zombies and demons in 'Ghosts 'n Goblins', the unforgettable title 'Commando', plus 18 other classics that everyone grew up with! All of these titles can be played in either single or two player modes while experiencing a bountiful of bonus features such as remixed soundtracks, original art and playing tips, just to name a few. Experience more than 20 groundbreaking and revolutionary games of their time on one disk. [Capcom]… Expand"
  },
  {
    "name": "Shin Megami Tensei: Digital Devil Saga",
    "details_link": "https://www.metacritic.com/game/playstation-2/shin-megami-tensei-digital-devil-saga",
    "publisher": "Atlus Co.",
    "release_date": "Apr  5 2005",
    "developers": [
      "Atlus Co."
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 78,
    "users_score": 5.2,
    "image": "https://static.metacritic.com/images/products/games/3/5a821bc0874d18f49e0b6ce0ad76e53a-98.jpg",
    "descriptions": "(Known in Japan as \"Digital Devil Saga: Avatar Tuner\")  Junkyard, a town of endless rain. With his four companions, Serf, the main character and a member of a tribe called Embryon, sets out for Nirvana, a land that can only be reached by the champions of Junkyard. They devote themselves to(Known in Japan as \"Digital Devil Saga: Avatar Tuner\")  Junkyard, a town of endless rain. With his four companions, Serf, the main character and a member of a tribe called Embryon, sets out for Nirvana, a land that can only be reached by the champions of Junkyard. They devote themselves to fighting against the never-ending resistance mustered by other tribes. In the midst of chaos, a mysterious object, the Pod, suddenly appears. Countless spheres of light are emitted by the Pod and infect Serf and his comrades, awakening their demonic powers. An unimaginable battle unfolds within their faint conscience. They develop a desire to tear the flesh and shatter the bones of their enemies, who have also been transformed. Their instincts tell them to devour every being in their path. Until then, Serf and his comrades only knew of battle, but for the first time, they experience new emotions. At that time, a dark-haired girl, Sera, comes to their rescue. Although she does not know where she came from, she holds a strange power - the power to control the party's demonic transformation. They receive orders from the Church of Karma to head for Nirvana, and they are accompanied by the dark-haired girl. \"They who reach Nirvana first shall be recognized as the champions of Junkyard.\" The struggle intensifies, and they discover that the girl holds a key to the mystery. But, true fear still awaits Serf's party. Including Embryon, the tribe that the main character leads, several groups are at war with each other in order to survive. \"Devour\" your enemies and absorb their devastating powers and special abilities! [Atlus]… Expand"
  },
  {
    "name": "Culdcept",
    "details_link": "https://www.metacritic.com/game/playstation-2/culdcept",
    "publisher": "NEC Interchannel",
    "release_date": "Dec  4 2003",
    "developers": [
      "NEC Interchannel"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Miscellaneous",
      "Board Games"
    ],
    "meta_score": 78,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/5/346adf3e2c53e5b37978916f54720d54-98.jpg",
    "descriptions": "\"Culdcept\", the book of creation and destruction made by the absolute Goddess, Culdra. Those who control the power can acquire the power of God. \"Cepters\", individuals with the capability to summon from within the book fights for total control over Culdcept. Those who control the book become\"Culdcept\", the book of creation and destruction made by the absolute Goddess, Culdra. Those who control the power can acquire the power of God. \"Cepters\", individuals with the capability to summon from within the book fights for total control over Culdcept. Those who control the book become Gods, and many worlds were created or destroyed by those who took over this power. But, Culdra has forseen the future... There wold be one Cepter who will stop this chain and use the power to destroy the entire universe... Now... The Fight for the fate of the universe is about to begin. [NEC Games]… Expand"
  },
  {
    "name": "MVP Baseball 2003",
    "details_link": "https://www.metacritic.com/game/pc/mvp-baseball-2003",
    "publisher": "EA Sports",
    "release_date": "Mar 24 2003",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Baseball",
      "Sim",
      "Sim"
    ],
    "meta_score": 78,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/0/00c75568db768aadb98defec72b1c091-98.jpg",
    "descriptions": "New Pitcher/Batter Interface: Players must be strategic with their pitches. Throw a nasty curve to a batter's \"cold zone\" or risk a possible home run by throwing some heat to their \"hot zone.\" Each pitcher will have more effective pitches depending on how accurate those pitches are in realNew Pitcher/Batter Interface: Players must be strategic with their pitches. Throw a nasty curve to a batter's \"cold zone\" or risk a possible home run by throwing some heat to their \"hot zone.\" Each pitcher will have more effective pitches depending on how accurate those pitches are in real life. Batting: Quality of the hit will depend on each batter's real life \"hot and cold zones,\" hitter ratings, swing timing and swing type. New AI and Gameplay System: Real-time scouting reports provide accurate player ratings and attributes. CPU opponents react like their real-life counterparts, incorporating strategy and decision-making based on outs, score, inning, pitch count, etc. First Ever Picture-in-Picture Baserunning. Robust Franchise Mode includes rookie drafts, player development, career-ending injuries, contracts and hirings/firings. All-New Throw Meter. Major League Baseball Player Council: Expert advice and design input from leading MLB players Torii Hunter, Trot Nixon, Todd Pratt, Eric Chavez and Tim Hudson. [EA Sports]… Expand"
  },
  {
    "name": "Midtown Madness 2",
    "details_link": "https://www.metacritic.com/game/pc/midtown-madness-2",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep 21 2000",
    "developers": [
      "Angel Studios",
      "Rockstar San Diego"
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Driving",
      "Racing",
      "Mission-based",
      "Arcade",
      "Mission-based",
      "Automobile"
    ],
    "meta_score": 78,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/5/8ff612518aaf2887b3c2a5616708721e-98.jpg",
    "descriptions": "Delivers even more madcap excitement with all the hair-raising racing challenges you've come to expect -- plus two all-new locations (London & San Francisco), nine hip new urban roadsters, and the new single-player Crash Course mission mode where budding drivers can learn and master theDelivers even more madcap excitement with all the hair-raising racing challenges you've come to expect -- plus two all-new locations (London & San Francisco), nine hip new urban roadsters, and the new single-player Crash Course mission mode where budding drivers can learn and master the tricks of Madness racing.  [Microsoft]… Expand"
  },
  {
    "name": "Need for Speed: Porsche Unleashed",
    "details_link": "https://www.metacritic.com/game/playstation/need-for-speed-porsche-unleashed",
    "publisher": "Electronic Arts",
    "release_date": "Feb 29 2000",
    "developers": [
      "Eden Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/2/8ba080d6ae3cd504b2e6bc8a5f51ccf7-98.jpg",
    "descriptions": "Need for Speed: Porsche Unleashed tests your driving skills while you test-drive some of Porsche's most popular cars. In the game, you'll compete in levels that feature twists, turns, and various driving conditions. You can participate in different types of races, including circuit,Need for Speed: Porsche Unleashed tests your driving skills while you test-drive some of Porsche's most popular cars. In the game, you'll compete in levels that feature twists, turns, and various driving conditions. You can participate in different types of races, including circuit, streetcar, open road, and more. Survive all the crashes, police, and track challenges to earn prizes and respect. With enough money, you can purchase different custom parts for your vehicle.… Expand"
  },
  {
    "name": "The Wonderful 101",
    "details_link": "https://www.metacritic.com/game/wii-u/the-wonderful-101",
    "publisher": "Nintendo",
    "release_date": "Sep 15 2013",
    "developers": [
      "PlatinumGames"
    ],
    "platforms": "Wii U",
    "num_players": "Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "General"
    ],
    "meta_score": 78,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/7/3741dcb517b64c288c9393ecbc1c24b9-98.jpg",
    "descriptions": "Earth is under attack from an invasion of enormous aliens, and the only thing that can protect the planet is a group of unlikely, yet mighty, heroes with special abilities. Unfortunately, the aliens are too powerful for the heroes to fight individually. They must join forces and workEarth is under attack from an invasion of enormous aliens, and the only thing that can protect the planet is a group of unlikely, yet mighty, heroes with special abilities. Unfortunately, the aliens are too powerful for the heroes to fight individually. They must join forces and work together to defeat their common enemy. These uniquely different heroes can morph into powerful weapons to crush the invaders or turn into objects like a giant fist or bridge to interact with and traverse the environments.… Expand"
  },
  {
    "name": "Kingdom Under Fire: Heroes",
    "details_link": "https://www.metacritic.com/game/xbox/kingdom-under-fire-heroes",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep 20 2005",
    "developers": [
      "Phantagram"
    ],
    "platforms": "Xbox",
    "num_players": "6  Online",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy"
    ],
    "meta_score": 78,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/5/ea6a82f768ddba54ef724df1122d2185-98.jpg",
    "descriptions": "Kingdom Under Fire: Heroes is an action strategy game where you can command hundreds of soldiers. You also have spells, golems, and catapults at your disposal as you play through more than 50 campaign missions. The experience and gold that you earn during each battle can be used to train andKingdom Under Fire: Heroes is an action strategy game where you can command hundreds of soldiers. You also have spells, golems, and catapults at your disposal as you play through more than 50 campaign missions. The experience and gold that you earn during each battle can be used to train and equip your troops. You can also challenge other gamers online.… Expand"
  },
  {
    "name": "Fatal Frame III: The Tormented",
    "details_link": "https://www.metacritic.com/game/playstation-2/fatal-frame-iii-the-tormented",
    "publisher": "Tecmo",
    "release_date": "Nov  8 2005",
    "developers": [
      "Tecmo"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Horror"
    ],
    "meta_score": 78,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/5/1f4c102ac8774f370bd9fdfc4e938982-98.jpg",
    "descriptions": "(Project Zero 3: The Tormented)  Taking the popular Japanese Horror theme to a whole new terrifying level, Fatal Frame III: The Tormented is a complete Japanese Horror interactive experience as the player takes on the role of Rei, a cursed young woman whose overwhelming guilt and tormented(Project Zero 3: The Tormented)  Taking the popular Japanese Horror theme to a whole new terrifying level, Fatal Frame III: The Tormented is a complete Japanese Horror interactive experience as the player takes on the role of Rei, a cursed young woman whose overwhelming guilt and tormented dreams lead her into a formidable world where the lines between reality and nightmares are blurred and the only way out is to solve the mystery of the tattoo. What the player will see in Rei’s dreams is only the beginning of the nightmare, making Fatal Frame III: The Tormented the most terrifying virtual experience to date. [Tecmo]… Expand"
  },
  {
    "name": "WWE SmackDown vs. Raw 2009",
    "details_link": "https://www.metacritic.com/game/playstation-3/wwe-smackdown-vs-raw-2009",
    "publisher": "THQ",
    "release_date": "Nov  9 2008",
    "developers": [
      "Yuke's"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Sports",
      "Fighting",
      "Fighting",
      "Individual",
      "Wrestling",
      "Combat",
      "Wrestling"
    ],
    "meta_score": 78,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/0/abb31e7b314d0b66e834670de3efbc1a-98.jpg",
    "descriptions": "WWE SmackDown vs. Raw 2009 upholds the franchise’s commitment to delivering the definitive videogame simulation of live WWE programming. The Xbox 360, PLAYSTATION 3 system, PlayStation 2 system and PSP system versions of the game unleash a brand new tag team experience, allowing players toWWE SmackDown vs. Raw 2009 upholds the franchise’s commitment to delivering the definitive videogame simulation of live WWE programming. The Xbox 360, PLAYSTATION 3 system, PlayStation 2 system and PSP system versions of the game unleash a brand new tag team experience, allowing players to build momentum and attributes, eliminate opponents with high impact double teams and finishers, as well as get the “hot tag” for the win. The franchise's renowned creation system offers a brand new Create-A-Finisher option, while a new Road to WrestleMania Mode paves the way to WWE’s biggest event of the year and lets players experience co-op storylines for the first time. WWE SmackDown vs. Raw 2009 also extends the virtual WWE gameplay experience with robust online capabilities, including the highly anticipated debut of downloadable content. [THQ]… Expand"
  },
  {
    "name": "Mario Golf: World Tour",
    "details_link": "https://www.metacritic.com/game/3ds/mario-golf-world-tour",
    "publisher": "Nintendo",
    "release_date": "May  2 2014",
    "developers": [
      "Camelot Software Planning"
    ],
    "platforms": "3DS",
    "num_players": "Up to 4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Golf",
      "Arcade",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/9/3496f5d12a11f49bac3b2673d701f2ae-98.jpg",
    "descriptions": "Luigi and his Mushroom Kingdom neighbors are teeing up once again in Mario Golf: World Tour. The Nintendo 3DS game includes both simple controls and a deeper experience for golf fans, plus courses that range from traditional to those inspired by the Mushroom Kingdom. The game launches this summer."
  },
  {
    "name": "Street Fighter Anniversary Collection",
    "details_link": "https://www.metacritic.com/game/playstation-2/street-fighter-anniversary-collection",
    "publisher": "Capcom",
    "release_date": "Aug 31 2004",
    "developers": [
      "Capcom"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 78,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/8/3c1504763963a87d85a387985bdfc032-98.jpg",
    "descriptions": "Bringing together an all encompassing fighting title, this collection is comprised of \"Hyper Street Fighter II,\" a blend of the previous Street Fighter II editions which will incorporate the character variations and features found throughout the series, and the arcadesmash hit \"StreetBringing together an all encompassing fighting title, this collection is comprised of \"Hyper Street Fighter II,\" a blend of the previous Street Fighter II editions which will incorporate the character variations and features found throughout the series, and the arcadesmash hit \"Street Fighter III: 3rd Strike.\" Rather than simply including conversions of the five entries in the series: Street Fighter II, Street Fighter II Champion Edition, Street Fighter II Hyper Fighting, Super Street Fighter II: The New Challengers, and Super Street Fighter II Turbo, \"Hyper Street Fighter II\" lets you mix and match characters from the different versions for a plethora of different match-ups and replayability. \"Street Fighter III: 3rd Strike\" offers a total of 19 different playable characters, each with their own special ability including Makoto, a Karate expert from Japan; Q, a mysterious entity with no explanation of his existence; Twelve, a humanoid weapon developed to follow orders and destroy upon command; and Remy, a Frenchman who is seeking to ease his grief through revenge. Chun Li, the famous martial arts expert, is selectable at the beginning. [Capcom]… Expand"
  },
  {
    "name": "New Play Control! Donkey Kong Jungle Beat",
    "details_link": "https://www.metacritic.com/game/wii/new-play-control!-donkey-kong-jungle-beat",
    "publisher": "Nintendo",
    "release_date": "May  4 2009",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Wii",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 78,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/6/8e04fcfbca21ce8c2837881a5ccbe05a-98.jpg",
    "descriptions": "Donkey Kong Jungle Beat originally debuted on the Nintendo GameCube system. This new version has been remastered with motion controls, new enemies and obstacles, and a new final boss battle. Nintendo also has added special monkeys to each stage that give tips or let players save theirDonkey Kong Jungle Beat originally debuted on the Nintendo GameCube system. This new version has been remastered with motion controls, new enemies and obstacles, and a new final boss battle. Nintendo also has added special monkeys to each stage that give tips or let players save their progress. The new controls make this well-reviewed game accessible to new players while giving those who played the original new challenges. The goal of the game is to guide Donkey Kong through beautifully rendered stages like lava caves, tempestuous oceans and even a ninja-chimp fortress. Racing through the game will get players to the goal, but the real skill comes from helping Donkey Kong perform multiple mid-air acrobatic moves as he collects bananas in each stage. The more sweet moves he does in a row, the more bonus bananas he gets at the end of the stage. To become the king of the jungle, he must team up with animal friends and defeat multiple contenders in boxing matches. [Nintendo]… Expand"
  },
  {
    "name": "NHL 16",
    "details_link": "https://www.metacritic.com/game/playstation-4/nhl-16",
    "publisher": "Electronic Arts",
    "release_date": "Sep 15 2015",
    "developers": [
      "EA Sports",
      "EA Canada"
    ],
    "platforms": [
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Sports",
      "Team",
      "Ice Hockey",
      "Sim"
    ],
    "meta_score": 78,
    "users_score": 5.5,
    "image": "https://static.metacritic.com/images/products/games/2/6a8ef15e2ba0031ec1398253a3e138be-98.jpg",
    "descriptions": "Players who are drawn to team experiences can jump into either 6 v. 6 Online Team Play, Online Couch Co-op, or the EA SPORTS Hockey League, that’s been re-formulated to deliver a new player class system for a more competitive and balanced experience. Players who want to build their ownPlayers who are drawn to team experiences can jump into either 6 v. 6 Online Team Play, Online Couch Co-op, or the EA SPORTS Hockey League, that’s been re-formulated to deliver a new player class system for a more competitive and balanced experience. Players who want to build their own legacy can dive into Be-A-Pro, which allows them to start their career in the minors and takes them through a new progression system where how they play on the ice shapes who they become in the NHL. And if players are more akin to armchair GMs, not only can they navigate the machinations of draft day and manage their AHL affiliate team, they can now also manage the morale of individual players on their team.… Expand"
  },
  {
    "name": "Rock Band 4",
    "details_link": "https://www.metacritic.com/game/playstation-4/rock-band-4",
    "publisher": "Harmonix Music Systems",
    "release_date": "Oct  6 2015",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Rhythm",
      "Music"
    ],
    "meta_score": 78,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/8/9f3c3e506cf227e162b1fcf54726fa33-98.jpg",
    "descriptions": "Rock Band 4 offers the unique social play of a full band experience—featuring a next-gen microphone, wireless drums and guitar, and a revamped world tour campaign mode.  Add your personal signature to every performance. With Freestyle Guitar Solo, you can string together blistering licks andRock Band 4 offers the unique social play of a full band experience—featuring a next-gen microphone, wireless drums and guitar, and a revamped world tour campaign mode.  Add your personal signature to every performance. With Freestyle Guitar Solo, you can string together blistering licks and wow the crowd with your own incendiary solos.  With a soundtrack featuring some of the world's biggest acts, plus an ever-expanding catalog of over 1,500 playable songs, it’s easy to put together a keen set list.… Expand"
  },
  {
    "name": "Karaoke Revolution Presents: American Idol",
    "details_link": "https://www.metacritic.com/game/playstation-2/karaoke-revolution-presents-american-idol",
    "publisher": "Konami",
    "release_date": "Jan  2 2007",
    "developers": [
      "Blitz Games"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Miscellaneous",
      "Rhythm",
      "Music"
    ],
    "meta_score": 78,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/2/c449698188c1c349abe8ceaeec825c88-98.jpg",
    "descriptions": "Karaoke Revolution: American Idol combines the  Karaoke Revolution game engine with America’s most popular television show to deliver an authentic Idol experience for the PlayStation 2. Sing along to 40 new songs, including hits from the show, and compete from auditions to performances onKaraoke Revolution: American Idol combines the  Karaoke Revolution game engine with America’s most popular television show to deliver an authentic Idol experience for the PlayStation 2. Sing along to 40 new songs, including hits from the show, and compete from auditions to performances on center stage in your quest to become the next American Idol. [Konami]… Expand"
  },
  {
    "name": "Crash Commando",
    "details_link": "https://www.metacritic.com/game/playstation-3/crash-commando",
    "publisher": "SCEA",
    "release_date": "Dec 18 2008",
    "developers": [
      "Epos"
    ],
    "platforms": "PlayStation 3",
    "num_players": "12  Online",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Scrolling",
      "Scrolling",
      "Shoot-'Em-Up",
      "Vertical"
    ],
    "meta_score": 78,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/6/65d629f4f9e7e132db8f57ecad5f8725-98.jpg",
    "descriptions": "[Playstation Network]  Crash Commando is a fast-paced, side-scrolling humorous multiplayer action game with over-the-top, slap-stick action that features exaggerated gore and effects. Combining the thrill of frenzied multiplayer combat with the straightforward nature of a classic[Playstation Network]  Crash Commando is a fast-paced, side-scrolling humorous multiplayer action game with over-the-top, slap-stick action that features exaggerated gore and effects. Combining the thrill of frenzied multiplayer combat with the straightforward nature of a classic side-scrolling platform title, Crash Commando is a combination of modern, sophisticated technology and traditional arcade gameplay. The player controls a commando soldier and navigates through the maps on foot and with a high-powered jet pack. Each map consists of two gameplay layers the player can seamlessly move between via portals in the environment. Enemies will attack from the sides, as well as from above and below. With a host of both multiplayer and single player modes included, players can enjoy Crash Commando either on or offline. [Sony]… Expand"
  },
  {
    "name": "Dragon's Dogma: Dark Arisen",
    "details_link": "https://www.metacritic.com/game/playstation-4/dragons-dogma-dark-arisen",
    "publisher": "Capcom",
    "release_date": "Oct  3 2017",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 78,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/f8260119bc649293a91693b37d223813-98.jpg",
    "descriptions": "An epitaph speaks of another's demise...\r A mysterious island known as Bitterblack Isle appears off the coast of Gransys. Its depths have claimed the lives of many Arisen their voices still haunt the labyrinth that lies deep beneath its surface--a labyrinth ripe with secrets waiting to beAn epitaph speaks of another's demise...\r A mysterious island known as Bitterblack Isle appears off the coast of Gransys. Its depths have claimed the lives of many Arisen their voices still haunt the labyrinth that lies deep beneath its surface--a labyrinth ripe with secrets waiting to be discovered.\r The time to take up arms has come once again. Delve into the isle's depths and uncover its dark secret!… Expand"
  },
  {
    "name": "Mushroom 11",
    "details_link": "https://www.metacritic.com/game/pc/mushroom-11",
    "publisher": "Untame",
    "release_date": "Oct 15 2015",
    "developers": [
      "Untame"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 78,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/4/c650a332d6aec9b3159c144342813b28-98.jpg",
    "descriptions": "Guide an amorphous organism across brain-twisting obstacles by destroying it. Overcome swarms of bizarre mutated creatures, and understand the true nature of the devastation from which you emerged."
  },
  {
    "name": "A Way Out",
    "details_link": "https://www.metacritic.com/game/pc/a-way-out",
    "publisher": "Electronic Arts",
    "release_date": "Mar 23 2018",
    "developers": [
      "Hazelight"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "Linear"
    ],
    "meta_score": 78,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/7/08cd69d0c852089778ef10bf072e1f2d-98.jpg",
    "descriptions": "The story of A Way Out begins in prison with two separate inmates, Leo and Vincent, who don’t know each other. While their individual stories progress, players have to build a relationship based on trust as they break both men out of prison into the world beyond. This co-op only experienceThe story of A Way Out begins in prison with two separate inmates, Leo and Vincent, who don’t know each other. While their individual stories progress, players have to build a relationship based on trust as they break both men out of prison into the world beyond. This co-op only experience is meant to be played together with a friend on a couch or online. A Way Out is a game uniquely tailored for two players to work together no matter the situation. Through a compelling narrative, Leo and Vincent will embark on an emotional adventure, where they live some memorable action moments that they face together including car chases, stealth passages, melee fights, shootouts and many more. [Electronic Arts]… Expand"
  },
  {
    "name": "Dragon's Dogma: Dark Arisen",
    "details_link": "https://www.metacritic.com/game/switch/dragons-dogma-dark-arisen",
    "publisher": "Capcom",
    "release_date": "Apr 23 2019",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 78,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/8/3f5ca2ce2f447c16c007a7dd3e803bb4-98.jpg",
    "descriptions": "An epitaph speaks of another's demise...\r A mysterious island known as Bitterblack Isle appears off the coast of Gransys. Its depths have claimed the lives of many Arisen their voices still haunt the labyrinth that lies deep beneath its surface--a labyrinth ripe with secrets waiting to beAn epitaph speaks of another's demise...\r A mysterious island known as Bitterblack Isle appears off the coast of Gransys. Its depths have claimed the lives of many Arisen their voices still haunt the labyrinth that lies deep beneath its surface--a labyrinth ripe with secrets waiting to be discovered.\r The time to take up arms has come once again. Delve into the isle's depths and uncover its dark secret!… Expand"
  },
  {
    "name": "MLB The Show 21",
    "details_link": "https://www.metacritic.com/game/playstation-5/mlb-the-show-21",
    "publisher": "Sony Interactive Entertainment",
    "release_date": "Apr 16 2021",
    "developers": [
      "Sony Interactive Entertainment San Diego Studio"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Sports",
      "Team",
      "Baseball",
      "Sim"
    ],
    "meta_score": 78,
    "users_score": 4.2,
    "image": "https://static.metacritic.com/images/products/games/0/963651e8a22c35d54b7e5a4aa83cf6d7-98.jpg",
    "descriptions": "Be a 2-way star. For the first time, take your Ball Player from Road To The Show and use him in other game modes. Now your Ball Player can be a 2-way star. Enjoy Franchise improvements and updates to March To October which empower you to better make decisions on the future of your club. LiveBe a 2-way star. For the first time, take your Ball Player from Road To The Show and use him in other game modes. Now your Ball Player can be a 2-way star. Enjoy Franchise improvements and updates to March To October which empower you to better make decisions on the future of your club. Live content now streamlines programs to provide clearer goals, faster paths to rewards based on how you play, and welcomes a new class of Legends to build your dream squad. New to MLB The Show this year is gameplay styles alongside new gameplay onboarding tutorials to expand gameplay for all playstyles and skill levels. Casual: An easier, fun, pick-up and play experience with an emphasis on learning the game. Simulation: Authentic MLB experience that plays true to player and team ratings. A balance between stick skills and player attributes.  Competitive: User stick skills reign supreme, greater emphasis on user input over player ratings. Our new online H2H default. \r… Expand"
  },
  {
    "name": "Killzone: Mercenary",
    "details_link": "https://www.metacritic.com/game/playstation-vita/killzone-mercenary",
    "publisher": "SCEA",
    "release_date": "Sep 10 2013",
    "developers": [
      "Guerilla Cambridge"
    ],
    "platforms": "PlayStation Vita",
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/0/5b93d3e35703228bb120710f719afd10-98.jpg",
    "descriptions": "Killzone: Mercenary proides a new perspective on the Killzone Universe. You’re not simply an Army grunt folling orders -  you’re freelance gun for hire, a merc -  a soldier of fortune - someone who doesn't play by the rules or fight for any particular flag. They’re in it for the cheddar. TheKillzone: Mercenary proides a new perspective on the Killzone Universe. You’re not simply an Army grunt folling orders -  you’re freelance gun for hire, a merc -  a soldier of fortune - someone who doesn't play by the rules or fight for any particular flag. They’re in it for the cheddar. The client might enumerate the objective, but he won't tell you how to do your job. You formulate your own tactics and choose your own weapons; so long as you get the job done. The game provides a full single player Campaign, spread over 9 missions. In addition to the primary missions, there is a new Contracts mode, offering an additional 27 sets of objectives. You select from three difficulty settings; Recruit Trooper and Veteran. The harder the difficulty selected the higher the rewards earned.… Expand"
  },
  {
    "name": "Chorus",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/chorus",
    "publisher": "Deep Silver",
    "release_date": "Dec  3 2021",
    "developers": [
      "Fishlabs"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Xbox One",
      "Xbox Series X"
    ],
    "genres": [
      "Simulation",
      "Space",
      "Combat"
    ],
    "meta_score": 78,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/2/cbc3af250b7062c93e9e2dc6b873b605-98.jpg",
    "descriptions": "Take control of Nara, once the Circle’s deadliest warrior, now their most wanted fugitive, on a quest to destroy the dark cult that created her. Unlock devastating weapons and mind-bending abilities in a true evolution of the space-combat shooter. Along with Forsaken, her sentientTake control of Nara, once the Circle’s deadliest warrior, now their most wanted fugitive, on a quest to destroy the dark cult that created her. Unlock devastating weapons and mind-bending abilities in a true evolution of the space-combat shooter. Along with Forsaken, her sentient starfighter, explore ancient temples, engage in exhilarating zero-g combat, and venture beyond our waking reality. Lead Nara and Forsaken, her sentient ship, as their quest for redemption takes them across the galaxy and beyond the boundaries of reality. Enter a dark new universe, teeming with mystery and rife with conflict. Explore epic locations such as sprawling space stations and strange planes of existence beyond our own. Attain powerful weapons and combat upgrades. Master your ship’s unique drift mechanic and deadly mind-bending abilities, including extra-sensory perception, teleportation, and telekinesis. Chain your powers together to become the ultimate living weapon.… Expand"
  },
  {
    "name": "My Friend Pedro",
    "details_link": "https://www.metacritic.com/game/switch/my-friend-pedro",
    "publisher": "Devolver Digital",
    "release_date": "Jun 20 2019",
    "developers": [
      "DeadToast Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 78,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/bb5449d9902b720be266a0e6e6b44ae8-98.jpg",
    "descriptions": "My Friend Pedro is a violent ballet about friendship, imagination, and one man’s struggle to obliterate anyone in his path at the behest of a sentient banana. The strategic use of split aiming, slow motion, and the ol’ stylish window breach create one sensational action sequence afterMy Friend Pedro is a violent ballet about friendship, imagination, and one man’s struggle to obliterate anyone in his path at the behest of a sentient banana. The strategic use of split aiming, slow motion, and the ol’ stylish window breach create one sensational action sequence after another in an explosive battle through the violent underworld.\r Unleash a torrent of destruction with an incredible level of control over both your weapons and your body. Twist and turn through the air while aiming both hands at priority threats or line up a perfect ricochet to drop an unsuspecting gangster from behind.\r Break up the high octane running and gunning a bit with dynamic sequences like a thrilling motorcycle chase or slow it all down and take a moment to think through a series of clever (and possibly fatal) physics-based puzzles.… Expand"
  },
  {
    "name": "WarioWare Gold",
    "details_link": "https://www.metacritic.com/game/3ds/warioware-gold",
    "publisher": "Nintendo",
    "release_date": "Aug  3 2018",
    "developers": [
      "Nintendo"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Party / Minigame"
    ],
    "meta_score": 78,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/0/b986729e1b4385073821c1e87ed73b9f-98.jpg",
    "descriptions": "The infamous schemer, Wario, is back!\r Play his brand-new microgame collection, where you'll have seconds to complete 300 different microgames. Better think fast to succeed! You'll use the touchscreen, tilt the system, push buttons, and rock the mic as you laugh through fully voicedThe infamous schemer, Wario, is back!\r Play his brand-new microgame collection, where you'll have seconds to complete 300 different microgames. Better think fast to succeed! You'll use the touchscreen, tilt the system, push buttons, and rock the mic as you laugh through fully voiced stories featuring new and classic characters!… Expand"
  },
  {
    "name": "Dragon's Dogma",
    "details_link": "https://www.metacritic.com/game/playstation-3/dragons-dogma",
    "publisher": "Capcom",
    "release_date": "May 22 2012",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Role-Playing",
      "General",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 78,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/3/53fe6c4bdd5bc8cd65a7a5ee05018b6a-98.jpg",
    "descriptions": "A legend is born in this open-world adventure. Assume the role of the Arisen, a legendary hero in a land haunted by a feared, omnipotent dragon. As you fight to protect your homeland, you will pick up companions, make enemies, and find yourself embroiled in an even deeper mystery."
  },
  {
    "name": "Remnant: From the Ashes",
    "details_link": "https://www.metacritic.com/game/pc/remnant-from-the-ashes",
    "publisher": "Perfect World Entertainment",
    "release_date": "Aug 19 2019",
    "developers": [
      "Gunfire Games"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Up to 3 ",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/3/c84371469509ca7007510ea969df26f3-98.jpg",
    "descriptions": "The world has been thrown into chaos by an ancient evil from another dimension. As one of the last remnants of humanity, you must set out alone or alongside up to two other survivors to face down hordes of deadly enemies to try to carve a foothold, rebuild, and retake what was lost."
  },
  {
    "name": "Tropico 4: Modern Times",
    "details_link": "https://www.metacritic.com/game/pc/tropico-4-modern-times",
    "publisher": "Kalypso",
    "release_date": "Mar 29 2012",
    "developers": [
      "Haemimont",
      "Haemimont Games"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Strategy",
      "Tycoon",
      "Management",
      "Tycoon",
      "Government"
    ],
    "meta_score": 78,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/8/6f017bc07f00d084fb4fe8aa30818051-98.jpg",
    "descriptions": "The times are changing and the island nation of Tropico is evolving. The Internet, a New World Order, terrorists, global financial markets and space exploration are on the rise and pose new challenges to El Presidente and his regime in Tropico 4: Modern Times."
  },
  {
    "name": "Don't Starve: Console Edition",
    "details_link": "https://www.metacritic.com/game/playstation-4/dont-starve-console-edition",
    "publisher": "Klei Entertainment",
    "release_date": "Jan  7 2014",
    "developers": [
      "Klei Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy",
      "Sandbox"
    ],
    "meta_score": 78,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/8/8ab8c19f885145ead02b4ffd8fc701a8-98.jpg",
    "descriptions": "Don't Starve is an uncompromising wilderness survival game full of science and magic.\r You play as Wilson, an intrepid Gentleman Scientist who has been trapped by a demon and transported to a mysterious wilderness world. Wilson must learn to exploit his environment and its inhabitants ifDon't Starve is an uncompromising wilderness survival game full of science and magic.\r You play as Wilson, an intrepid Gentleman Scientist who has been trapped by a demon and transported to a mysterious wilderness world. Wilson must learn to exploit his environment and its inhabitants if he ever hopes to escape and find his way back home.\r Enter a strange and unexplored world full of strange creatures, dangers, and surprises. Gather resources to craft items and structures that match your survival style. Play your way as you unravel the mysteries of this strange land.… Expand"
  },
  {
    "name": "NFL Blitz",
    "details_link": "https://www.metacritic.com/game/xbox-360/nfl-blitz",
    "publisher": "Electronic Arts",
    "release_date": "Jan  4 2012",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Football",
      "Arcade",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/7/5940045f138e157300bd599e92035f7c-98.jpg",
    "descriptions": "Featuring the twitch gameplay and ultra-responsive controls of the original game, combined with all-new single-player and cooperative game modes, NFL Blitz hits the virtual gridiron in HD for the first time with blazing 60fps/60Hz gameplay.    Battle your rivals 7-on-7, fight your wayFeaturing the twitch gameplay and ultra-responsive controls of the original game, combined with all-new single-player and cooperative game modes, NFL Blitz hits the virtual gridiron in HD for the first time with blazing 60fps/60Hz gameplay.    Battle your rivals 7-on-7, fight your way through a season of the Blitz Gauntlet, take over the online leaderboards in Blitz Battles, or create a true dream team by collecting player cards in Elite League.  Challenging to master, yet easy to pick up and play, NFL Blitz is reborn as the ultimate HD arcade football experience for a new generation.… Expand"
  },
  {
    "name": "Call of Duty 2: Big Red One",
    "details_link": "https://www.metacritic.com/game/xbox/call-of-duty-2-big-red-one",
    "publisher": "Activision",
    "release_date": "Nov  1 2005",
    "developers": [
      "Treyarch"
    ],
    "platforms": "Xbox",
    "num_players": "16  Online",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Historic"
    ],
    "meta_score": 78,
    "users_score": 5.2,
    "image": "https://static.metacritic.com/images/products/games/1/06eab0de9f5355b255e2affccc915085-98.jpg",
    "descriptions": "Experience the adrenaline rush and harsh realities of war as never before, get to know your squadmates, and fight alongside them through an epic story during the most harrowing moments of World War II. As a part of America's most decorated and heroic fighting unit, The Big Red One, you workExperience the adrenaline rush and harsh realities of war as never before, get to know your squadmates, and fight alongside them through an epic story during the most harrowing moments of World War II. As a part of America's most decorated and heroic fighting unit, The Big Red One, you work together with your squad to accomplish a variety of combat missions spanning North Africa, Italy, and Nazi-occupied Western Europe.… Expand"
  },
  {
    "name": "Unbound: Worlds Apart",
    "details_link": "https://www.metacritic.com/game/pc/unbound-worlds-apart",
    "publisher": "Digerati Distribution",
    "release_date": "Jul 28 2021",
    "developers": [
      "Alien Pixel Studios"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "Platformer",
      "Open-World",
      "Metroidvania"
    ],
    "meta_score": 78,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/1/76c937c628c1a7c8cc1f1518d16d9e45-98.jpg",
    "descriptions": "Summon portals to overcome vicious beasts, devious puzzles and fiendish platforming challenges. Master the unique powers of each portal to stop the collapse of reality, while exploring lush, hand-drawn worlds and unraveling a deep narrative full of mysteries."
  },
  {
    "name": "Shady Part of Me",
    "details_link": "https://www.metacritic.com/game/pc/shady-part-of-me",
    "publisher": "Focus Home Interactive",
    "release_date": "Dec 10 2020",
    "developers": [
      "Douze Dixiemes"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 78,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/0/2c11737eaa0e80be62658e75f55847eb-98.jpg",
    "descriptions": "Overcome emotional struggles across a touching narrative filled with twists and surprises. Embark on a dream-like journey, with breathtaking artistic direction and the enthralling voice of Hannah Murray (Game of Thrones, Skins)."
  },
  {
    "name": "Super Monkey Ball Deluxe",
    "details_link": "https://www.metacritic.com/game/playstation-2/super-monkey-ball-deluxe",
    "publisher": "Sega",
    "release_date": "Mar 15 2005",
    "developers": [
      "Sega"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Miscellaneous",
      "Party"
    ],
    "meta_score": 78,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/2/4c0080567c763236a37f300a58ef9d33-98.jpg",
    "descriptions": "Super Monkey Ball Deluxe features 300 stages (114 from \"Super Monkey Ball,\" 140 from \"Super Monkey Ball 2,\" and 46 Deluxe-exclusive boards. In addition to new stages, Super Monkey Ball Deluxe offers a new Challenge mode, integrating varying skill settings (Beginner, Advanced, and Expert)Super Monkey Ball Deluxe features 300 stages (114 from \"Super Monkey Ball,\" 140 from \"Super Monkey Ball 2,\" and 46 Deluxe-exclusive boards. In addition to new stages, Super Monkey Ball Deluxe offers a new Challenge mode, integrating varying skill settings (Beginner, Advanced, and Expert) into one fluid ramp up, rather than breaking them out as independent gameplay sections. There will also be additional stages in the story mode. All twelve of the party games from Super Monkey Ball 1 & 2 are also included. [Sega]… Expand"
  },
  {
    "name": "Mega Man ZX Advent",
    "details_link": "https://www.metacritic.com/game/ds/mega-man-zx-advent",
    "publisher": "Capcom",
    "release_date": "Oct 23 2007",
    "developers": [
      "Inti Creates"
    ],
    "platforms": "DS",
    "num_players": "2  Online",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 78,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/7/cf5c266b8049f9d9b6289cc7f48b04e8-98.jpg",
    "descriptions": "Mega Man ZX Advent follows two heroes, Grey and Ashe, on two separate but intertwining adventures as they search for answers amidst a chaotic war between humans and robots. They fight against a menacing, evil force in a battle unprecedented in the Mega Man series. The title takes fullMega Man ZX Advent follows two heroes, Grey and Ashe, on two separate but intertwining adventures as they search for answers amidst a chaotic war between humans and robots. They fight against a menacing, evil force in a battle unprecedented in the Mega Man series. The title takes full advantage of the Nintendo DS features to enhance the action-packed gameplay and story line of the popular series. A dynamic \"Biometal\" system is central to gameplay, allowing players the ability to change into several forms, including eight bosses, each with a variety of unique abilities and powers. With a touch of the Nintendo DS screen, players can easily switch back and forth between the Biometal and Map navigation screens. Bosses can be fought in several different ways, testing players' skills and rewarding them with nearly 24 different items depending on how they take on a boss. Co-op and head-to-head two player wireless play (two cartridges required). Two-player downloadable mini-game (one cartridge required). [Capcom]… Expand"
  },
  {
    "name": "Taiko no Tatsujin: Drum 'n' Fun!",
    "details_link": "https://www.metacritic.com/game/switch/taiko-no-tatsujin-drum-n-fun!",
    "publisher": "Bandai Namco Games",
    "release_date": "Nov  2 2018",
    "developers": [
      "Bandai Namco Games"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Rhythm",
      "Music"
    ],
    "meta_score": 78,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/8/07bca38164fd6d09f93891b56419ba79-98.jpg",
    "descriptions": "Enjoy the cult classic arcade rhythm game from Japan in the comfort of your own home! Play to the beat using your own drum with wide variety of new songs and challenge your friends to prove who has the best taiko skills. Use motion controls to enjoy Taiko like never before! Unlock belovedEnjoy the cult classic arcade rhythm game from Japan in the comfort of your own home! Play to the beat using your own drum with wide variety of new songs and challenge your friends to prove who has the best taiko skills. Use motion controls to enjoy Taiko like never before! Unlock beloved characters to help you on your journey to become a legendary taiko drummer! Utilize the interactive features of the Nintendo Switch to connect, share, and play with family and friends.… Expand"
  },
  {
    "name": "Redout 2",
    "details_link": "https://www.metacritic.com/game/pc/redout-2",
    "publisher": "Saber Interactive",
    "release_date": "Jun 16 2022",
    "developers": [
      "34BigThings"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Racing",
      "Arcade",
      "Futuristic"
    ],
    "meta_score": 78,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/1/279de84c31205e355b7fd5922a83f167-98.jpg",
    "descriptions": "The fastest racing game in the universe. Redout 2 is a tribute to classic arcade racing games and the sequel to the critically acclaimed Redout. Reach impossible speeds in exhilarating futuristic races across an extensive single-player campaign and competitive multiplayer."
  },
  {
    "name": "Shinsekai: Into the Depths",
    "details_link": "https://www.metacritic.com/game/switch/shinsekai-into-the-depths",
    "publisher": "Capcom",
    "release_date": "Mar 26 2020",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "iPhone/iPad",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 78,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/9/3dcf66686a500a0a92671ce9c4f33808-98.jpg",
    "descriptions": "Capcom presents a fresh and original undersea exploration game, filled with unique visual and audio experiences for you to discover. The land has slowly but steadily been covered with ice, forcing mankind to take refuge in the ocean. Even the sea cannot protect them forever. The iceCapcom presents a fresh and original undersea exploration game, filled with unique visual and audio experiences for you to discover. The land has slowly but steadily been covered with ice, forcing mankind to take refuge in the ocean. Even the sea cannot protect them forever. The ice overtakes the undersea home of a lone aquanaut, forcing an unplanned journey of exploration and discovery. Take control and follow a mysterious mechanical creature ever deeper... Could there be others still living on so far beneath the surface?… Expand"
  },
  {
    "name": "Sega Ages: Shinobi",
    "details_link": "https://www.metacritic.com/game/switch/sega-ages-shinobi",
    "publisher": "Sega",
    "release_date": "Jan 23 2020",
    "developers": [
      "Sega",
      "M2"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 78,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/9/3b68c25f2fb6b6470fece0931ce01472-98.jpg",
    "descriptions": "Shinobi. It's Japanese for stealth, the perfect description of a Master Ninja. And that's exactly what you are! Armed with throwing stars and finely-honed battle skills, you must defeat the Ring of Five. Fight your way past mercenaries and karate thugs. Take out the meanest martial artistsShinobi. It's Japanese for stealth, the perfect description of a Master Ninja. And that's exactly what you are! Armed with throwing stars and finely-honed battle skills, you must defeat the Ring of Five. Fight your way past mercenaries and karate thugs. Take out the meanest martial artists and rescue hostages. But these dangers pale in comparison to your ultimate challenge: A fight to the death against five evil Ninja Assassins whose mastery of the deadly ancient arts may well surpass your own!… Expand"
  },
  {
    "name": "Soul of Darkness",
    "details_link": "https://www.metacritic.com/game/ds/soul-of-darkness",
    "publisher": "Gameloft",
    "release_date": "Jul  5 2010",
    "developers": [
      "Gameloft"
    ],
    "platforms": "DS",
    "num_players": "1 Player",
    "genres": [
      "Adventure",
      "General",
      "General"
    ],
    "meta_score": 78,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/1/059ffeb0fbac1d5cf0c3ec9e1a619e74-98.jpg",
    "descriptions": "[DSiWare]   Enter a gothic world as the mysterious and powerful Kale. Try to save your beloved's life and soul by freeing her from an evil vampire's clutches. Explore dark woods, caves, huge castles and impressive cathedrals under the full moon's light. Master and upgrade your sword and[DSiWare]   Enter a gothic world as the mysterious and powerful Kale. Try to save your beloved's life and soul by freeing her from an evil vampire's clutches. Explore dark woods, caves, huge castles and impressive cathedrals under the full moon's light. Master and upgrade your sword and spear, and learn how to control your powers. Use the Fire and the Ice or transform into your enemies to overcome the numerous obstacles in your way. Face and defeat foes such as werewolves, succubae, gargoyles and zombies. Exclusive camera features let you use your environment to gain power-ups and upgrades. Good or evil - be the sole master of your destiny.… Expand"
  },
  {
    "name": "Teenage Mutant Ninja Turtles: The Cowabunga Collection",
    "details_link": "https://www.metacritic.com/game/pc/teenage-mutant-ninja-turtles-the-cowabunga-collection",
    "publisher": "Konami",
    "release_date": "Aug 30 2022",
    "developers": [
      "Konami",
      "Digital Eclipse"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 78,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/9/5466310cd67e31e57b3c0f11406003b6-98.jpg",
    "descriptions": "Teenage Mutant Ninja Turtles: The Cowabunga Collection assembles thirteen classic TMNT games by KONAMI in one incredible package. This collection provides a unique opportunity for gamers to experience these immensely popular and very influential games on modern consoles and includes aTeenage Mutant Ninja Turtles: The Cowabunga Collection assembles thirteen classic TMNT games by KONAMI in one incredible package. This collection provides a unique opportunity for gamers to experience these immensely popular and very influential games on modern consoles and includes a fantastic set of new quality of life features:\r * Added Online Play for certain games and Local Couch Play\r* Save Anytime and Rewind\r* Eleven Japanese Regional Versions\r* Button Mapping\r* Unique Development Art & Sketches\r* Historic TMNT Media Content\r The games are based on the characters and themes based on the 80's children's cartoon and comic book series, The Teenage Mutant Ninja Turtles. The game often takes place in a fictionalized New York City, in the sewers, inside futuristic enemy bases and even across time itself!… Expand"
  },
  {
    "name": "Atelier Lulua: The Scion of Arland",
    "details_link": "https://www.metacritic.com/game/playstation-4/atelier-lulua-the-scion-of-arland",
    "publisher": "Koei Tecmo Games",
    "release_date": "May 21 2019",
    "developers": [
      "Koei Tecmo Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 78,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/9/55871a0a97a721bb8dc6ec5d7de68269-98.jpg",
    "descriptions": "Time is ticking in the world of Arland. The future of Arland is entrusted to this young girl. Lulua discovers a mysterious book and uncovers the hidden truth of Arland. Learn alchemy while discovering the mysteries of Lulua's homeland. Fan-favorite characters rejoin the fun. An enjoyableTime is ticking in the world of Arland. The future of Arland is entrusted to this young girl. Lulua discovers a mysterious book and uncovers the hidden truth of Arland. Learn alchemy while discovering the mysteries of Lulua's homeland. Fan-favorite characters rejoin the fun. An enjoyable story and easy-to-learn mechanics welcome new and returning fans alike.… Expand"
  },
  {
    "name": "Cosmic Star Heroine",
    "details_link": "https://www.metacritic.com/game/switch/cosmic-star-heroine",
    "publisher": "Limited Run Games",
    "release_date": "Aug 14 2018",
    "developers": [
      "Zeboyd Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Stadia",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 78,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/3/c16f97b5f5181e26dfc90686b494c095-98.jpg",
    "descriptions": "Why can't the galaxy just stay saved? 3 exotic planets to explore. Aliens. Robots. Magic. Forbidden technology. Conspiracies. A galactic threat. And one brave heroine to make things right. Cosmic Star Heroine is an exciting RPG from the creators of Cthulhu Saves the World."
  },
  {
    "name": "Ken Follett's The Pillars of the Earth",
    "details_link": "https://www.metacritic.com/game/xbox-one/ken-folletts-the-pillars-of-the-earth",
    "publisher": "Daedalic Entertainment",
    "release_date": "Aug 15 2017",
    "developers": [
      "Kalypso"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "genres": [
      "Adventure",
      "Visual Novel"
    ],
    "meta_score": 78,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/7/8d8f5ee1b6569e7e99d5b019656fa921-98.jpg",
    "descriptions": "Based on Ken Follett’s world-bestseller, The Pillars of the Earth retells the story of the village of Kingsbridge in a whole new way. Play as Jack, Aliena, and Philip and change the events of the book through exploration, decision-making and dialogues."
  },
  {
    "name": "Skullgirls",
    "details_link": "https://www.metacritic.com/game/xbox-360/skullgirls",
    "publisher": "Autumn Games",
    "release_date": "Apr 11 2012",
    "developers": [
      "Reverge Labs"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "2D",
      "2D"
    ],
    "meta_score": 78,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/0/9e4acd003fc69849be59dcec39a1c5ce-98.jpg",
    "descriptions": "Skullgirls is a fast 2-D fighting game that puts you in control of fierce warriors in a Dark Deco world. New game systems test the skills of veteran fighting game fans while also making the genre enjoyable and accessible to newcomers. A modern take on classic arcade fighters with aSkullgirls is a fast 2-D fighting game that puts you in control of fierce warriors in a Dark Deco world. New game systems test the skills of veteran fighting game fans while also making the genre enjoyable and accessible to newcomers. A modern take on classic arcade fighters with a hand-drawn high-definition twist, Skullgirls is an action-packed competition complete with complex combos and an intriguing backstory.… Expand"
  },
  {
    "name": "NCAA March Madness 06",
    "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-march-madness-06",
    "publisher": "EA Sports",
    "release_date": "Oct 11 2005",
    "developers": [
      "EA Canada"
    ],
    "platforms": "PlayStation 2",
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Sim"
    ],
    "meta_score": 78,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/5/81222e6cb28cb917cf5e3e8861014d9b-98.jpg",
    "descriptions": "Featuring a deeper playbook that covers both ends of the court, NCAA March Madness 06 delivers the ultimate strategic basketball experience. Players can dominate rivals with an authentic brand of defense and push the ball on offense with an enhanced Floor General Playcalling system thatFeaturing a deeper playbook that covers both ends of the court, NCAA March Madness 06 delivers the ultimate strategic basketball experience. Players can dominate rivals with an authentic brand of defense and push the ball on offense with an enhanced Floor General Playcalling system that features more sets than before. With the all-new EA SPORTS Lockdown Stick, defense creates offense by allowing players to pressure the ball, force turnovers and harass opponents on the court. [Electronic Arts]… Expand"
  },
  {
    "name": "Ultimate Spider-Man",
    "details_link": "https://www.metacritic.com/game/ds/ultimate-spider-man",
    "publisher": "Activision",
    "release_date": "Sep 19 2005",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": "DS",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Action Adventure",
      "Beat-'Em-Up",
      "General",
      "Platformer",
      "Beat-'Em-Up",
      "2D"
    ],
    "meta_score": 78,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/9/8e3c46e229eadc5a3b95aecad361f399-98.jpg",
    "descriptions": "Play both sides as Ultimate Spider-Man allows players to take on the role of super hero Spider-Man AND super villain Venom. Penned and illustrated by famed comic book creators Brian Michael Bendis and Mark Bagley, the game picks up right where the story left off. Dive into an immersivePlay both sides as Ultimate Spider-Man allows players to take on the role of super hero Spider-Man AND super villain Venom. Penned and illustrated by famed comic book creators Brian Michael Bendis and Mark Bagley, the game picks up right where the story left off. Dive into an immersive adventure as you experience a living comic book illustrated with 3D Comic Inking Technology that literally brings the comic to life in every action-packed frame. The game's expanded, free-roaming environments deliver a deep adventure with a variety of challenging missions, diverse game play and an improved combat system that allows players to face off against the largest number of characters from the Spider-Man universe ever assembled in one video game. [Activision]… Expand"
  },
  {
    "name": "Pit People",
    "details_link": "https://www.metacritic.com/game/pc/pit-people",
    "publisher": "The Behemoth",
    "release_date": "Mar  2 2018",
    "developers": [
      "The Behemoth"
    ],
    "platforms": [
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "Strategy",
      "Turn-Based",
      "Tactics"
    ],
    "meta_score": 78,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/7e7396227f653bb0db4cbc54a2ad16d3-98.jpg",
    "descriptions": "In this fast-paced, turn-based, co-op adventure you'll quest and explore, find awesome loot, customize your fighters, and recruit strange species. Come master your destiny in this strategic game of positioning."
  },
  {
    "name": "Super Cloudbuilt",
    "details_link": "https://www.metacritic.com/game/playstation-4/super-cloudbuilt",
    "publisher": "Double Eleven",
    "release_date": "Jul 25 2017",
    "developers": [
      "Coilworks",
      "Double Eleven"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 78,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/2/92559e5342791139f045b8c0e087ca00-98.jpg",
    "descriptions": "Assme the role of Demi, a young soldier who wakes up in the empty shell of a ruined building, in a strange new world, disconnected from her old life and physical body. With each new challenge she overcomes, Demi slowly pieces together the future now laid out before her."
  },
  {
    "name": "Brandish: The Dark Revenant",
    "details_link": "https://www.metacritic.com/game/psp/brandish-the-dark-revenant",
    "publisher": "XSEED Games",
    "release_date": "Jan 13 2015",
    "developers": [
      "Falcom"
    ],
    "platforms": "PSP",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 78,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/7/e4b0871a4b952959f0df0beaa56a2a56-98.jpg",
    "descriptions": null
  },
  {
    "name": "Burnout",
    "details_link": "https://www.metacritic.com/game/gamecube/burnout",
    "publisher": "Acclaim",
    "release_date": "Apr 29 2002",
    "developers": [
      "Criterion Games"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/5/c807bd54560a13c0eda174ab72b394bb-98.jpg",
    "descriptions": "Burnout brings high-energy, arcade-style street racing to your gaming console.  Drive more than 300 realistic vehicles, and then crash them in spectacular, slow-motion fashion.  Burnout monitors your driver's heart rate: You're rewarded for near-misses and the more risks you take.   CruiseBurnout brings high-energy, arcade-style street racing to your gaming console.  Drive more than 300 realistic vehicles, and then crash them in spectacular, slow-motion fashion.  Burnout monitors your driver's heart rate: You're rewarded for near-misses and the more risks you take.   Cruise the United States and Europe on 14 awesome, traffic-filled courses, through cities and into the countryside. Instant replays allow you to relive your handiwork from multiple angles, in all of its cringe-inducing, metal-bashing glory.… Expand"
  },
  {
    "name": "Drakan: The Ancients' Gates",
    "details_link": "https://www.metacritic.com/game/playstation-2/drakan-the-ancients-gates",
    "publisher": "SCEA",
    "release_date": "Jan 28 2002",
    "developers": [
      "Surreal Software"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 78,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/7/d98d2b1b54f8bd3c55154a2d64f08a30-98.jpg",
    "descriptions": "In the ancient, decaying world of Drakan, the immortal Spirit Dragons are held captive. Rynn, a brave female warrior, and Arokh, a fearless dragon, are called to save these spiritual leaders, as well as the last remnants of mankind. Embarking on an enchanted journey through eight vast,In the ancient, decaying world of Drakan, the immortal Spirit Dragons are held captive. Rynn, a brave female warrior, and Arokh, a fearless dragon, are called to save these spiritual leaders, as well as the last remnants of mankind. Embarking on an enchanted journey through eight vast, foreign environments, Rynn and Arokh utilize magic spells, resourcefulness and more that 50 powerful weapons in their quest to save civilization. [SCEA]… Expand"
  },
  {
    "name": "KUNAI",
    "details_link": "https://www.metacritic.com/game/pc/kunai",
    "publisher": "TurtleBlaze",
    "release_date": "Feb  6 2020",
    "developers": [
      "TurtleBlaze"
    ],
    "platforms": [
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "Platformer",
      "Open-World",
      "2D"
    ],
    "meta_score": 78,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/b09c71c5eb5a05a9196b715bcca6735c-98.jpg",
    "descriptions": "A traumatic event has shaken the balance of the world. Human life has been almost wiped out by the evil A.I. Lemonkus. Robots roam free across the earth. You take control of Tabby, a killer robot infused with the soul of an ancient warrior. A NINJA METROIDVANIA. Start out with nothing,A traumatic event has shaken the balance of the world. Human life has been almost wiped out by the evil A.I. Lemonkus. Robots roam free across the earth. You take control of Tabby, a killer robot infused with the soul of an ancient warrior. A NINJA METROIDVANIA. Start out with nothing, progress and increase in strength by killing enemy robots to unlock abilities, weapons and ninja tricks. Explore a world filled with secrets, hidden passages and mysterious characters. KUNAI is all about movement and agility. Use your ninja mobility to reach places where no normal robot could ever go.… Expand"
  },
  {
    "name": "Madden NFL 06",
    "details_link": "https://www.metacritic.com/game/pc/madden-nfl-06",
    "publisher": "EA Sports",
    "release_date": "Aug 17 2005",
    "developers": [
      "BudCat"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360",
      "PC"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Football",
      "Sim",
      "Sim"
    ],
    "meta_score": 78,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/0/00a62861253283a21a99a65532cf917b-98.jpg",
    "descriptions": "With enhancements to the passing game, defensive improvements, and expanded online options, Madden NFL 06 takes you onto the field and into the locker room like never before. The new \"QB Vision Control\" lets you scan the field, look off defenders, and make perfect throws withing yourWith enhancements to the passing game, defensive improvements, and expanded online options, Madden NFL 06 takes you onto the field and into the locker room like never before. The new \"QB Vision Control\" lets you scan the field, look off defenders, and make perfect throws withing your quarterbacks unique field of vision. \"QB Precision Placement\" allows you to put the ball exactly where you want it. Lead the receiver to an open area, throw it behind him so he can come back to it or throw a jump ball and let him go get it. [Electronic Arts]… Expand"
  },
  {
    "name": "Hearts of Iron: Platinum",
    "details_link": "https://www.metacritic.com/game/pc/hearts-of-iron-platinum",
    "publisher": "Atari",
    "release_date": "Sep 21 2004",
    "developers": [
      "Paradox Development Studio"
    ],
    "platforms": "PC",
    "num_players": "1-2 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "General",
      "Historic"
    ],
    "meta_score": 78,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/1/573958301ff04f3f0542749a14a4cbf5-98.jpg",
    "descriptions": "The game's map spans the entire world and allows players to take the War to any new front of their choosing. Any nation in the world is playable, but the game focuses on the struggle between the great alliances of the new world orders: Fascism, Communism and Democracy. Hearts of Iron isThe game's map spans the entire world and allows players to take the War to any new front of their choosing. Any nation in the world is playable, but the game focuses on the struggle between the great alliances of the new world orders: Fascism, Communism and Democracy. Hearts of Iron is developed by the team behind the award-winning sales success \"Europa Universalis I\" and \"II\" and brings the same depth of gameplay and historical accuracy to a modern day gaming experience. Hearts of Iron aims to be no less than the definitive World War II strategic experience.… Expand"
  },
  {
    "name": "Armed and Dangerous",
    "details_link": "https://www.metacritic.com/game/pc/armed-and-dangerous",
    "publisher": "LucasArts",
    "release_date": "Dec  2 2003",
    "developers": [
      "Planet Moon Studios"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/7/d89baf159c2c4ea800f2bc0be4c27bba-98.jpg",
    "descriptions": "Take a band of gun-toting rebels - a robot, a madman, a mole and a criminal mastermind. Put them in a vividly stunning fantasy realm. Then give them an impossible mission - pulling off the biggest heist of all time in the middle of a war. All you have to do is battle your way throughTake a band of gun-toting rebels - a robot, a madman, a mole and a criminal mastermind. Put them in a vividly stunning fantasy realm. Then give them an impossible mission - pulling off the biggest heist of all time in the middle of a war. All you have to do is battle your way through dastardly enemies, giant war machines and an army of psychopathic robots. But don't worry; you have plenty of ammo and absolutely no common sense. Victory is yours in 12,000 bullets or less! Fight your way through 21 action-packed missions. Brandish over 17 outlandish weapons like the Cyclops Sniper Rifle, the Vindaloo Rocket Launcher, or the Topsy-Turvy and Sticky bomb. Explore five diverse environments including icy and snowy regions, mountains with breathtaking vistas, deep and foreboding woods, and rain-spattered cliffs. Take down wicked enemies like half-man, half-animal Grunts, eliminator droids, wall-smashing Goliaths, evil monks and wild twiglets. Navigate through a richly entertaining story with two smack-talkin' partners in crime. [LucasArts]… Expand"
  },
  {
    "name": "Gladius",
    "details_link": "https://www.metacritic.com/game/playstation-2/gladius",
    "publisher": "LucasArts",
    "release_date": "Oct 28 2003",
    "developers": [
      "LucasArts"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy"
    ],
    "meta_score": 78,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/6/e49b887a920ce134ed1f9bb5943ba5f1-98.jpg",
    "descriptions": "An Epic Gladiatorial Saga Comes to Life. The darkness of the Great War has passed and the lands of Gladius are peaceful once more. Now combat takes place only in the gladiator arenas, where schools from around the world compete for the title of Imperial Champions. Follow the grand saga ofAn Epic Gladiatorial Saga Comes to Life. The darkness of the Great War has passed and the lands of Gladius are peaceful once more. Now combat takes place only in the gladiator arenas, where schools from around the world compete for the title of Imperial Champions. Follow the grand saga of two young heroes, Ursula and Valens, as they recruit and train a team of warriors and compete in the gladiator games. Battle with deadly weapons and powerful magic as you learn vital combat tactics while you enhance and customize your own characters. Strategies are nearly endless, with 16 character classes and over 100 unique character types from which to choose. But be warned. Evil is on the rise again. And a new hero must step forward to vanquish the threat. So train well, for the dark must not prevail. [LucasArts]… Expand"
  },
  {
    "name": "MLB Slugfest 20-04",
    "details_link": "https://www.metacritic.com/game/playstation-2/mlb-slugfest-20-04",
    "publisher": "Midway",
    "release_date": "Mar 16 2003",
    "developers": [
      "Midway"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Baseball",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/a56153da58fb74c5bbda132546e86afc-98.jpg",
    "descriptions": "Features Exclusive Challenging Adrenaline-Style Gameplay: Turbo running, fielding, batting and throwing. Midway Sports kicks the level up a notch with hard-hitting, gas-throwing, plays-of-the-week caliber fielding to give the player the best possible baseball videogame experience. NEWFeatures Exclusive Challenging Adrenaline-Style Gameplay: Turbo running, fielding, batting and throwing. Midway Sports kicks the level up a notch with hard-hitting, gas-throwing, plays-of-the-week caliber fielding to give the player the best possible baseball videogame experience. NEW Create-A-Team: Create your own All-Star team by combining your favorite players from both leagues into one powerhouse ball club, then work your way to a World Series championship. NEW Customizable Instant Replay: Relive your towering home runs or diving catches with instant replay. You take control of the camera and can view your highlight-quality plays from any angle you desire. NEW Home Run Derby: Pit your favorite MLB players in a home run derby and square off against the most feared long ball hitters in the league. NEW Pitching \"On Fire\": Pitchers in both leagues have the opportunity to get \"on fire\" by constantly shutting down the offensive team. [Midway]… Expand"
  },
  {
    "name": "Star Trek: Starfleet Command III",
    "details_link": "https://www.metacritic.com/game/pc/star-trek-starfleet-command-iii",
    "publisher": "Activision",
    "release_date": "Nov  6 2002",
    "developers": [
      "Taldren"
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Simulation",
      "Sci-Fi",
      "Space",
      "Large Spaceship",
      "Large Spaceship",
      "Civilian"
    ],
    "meta_score": 78,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/5/77fac76116a178018a531c5d740bdae3-98.jpg",
    "descriptions": "Similar to the earlier games in the SFC franchise Star Trek Starfleet Command III allows gamers to optimize their ship and allocate power to their ship's systems for different types of strategies such as hit-and-run maneuvers, ambushes or direct assaults.  However, this installmentSimilar to the earlier games in the SFC franchise Star Trek Starfleet Command III allows gamers to optimize their ship and allocate power to their ship's systems for different types of strategies such as hit-and-run maneuvers, ambushes or direct assaults.  However, this installment simplifies the process by introducing a new interface for system management that reduces the \"micromanagement\" of starship control, and allows players to focus on combat.  Additionally, for the first time in any Star Trek game players can significantly customize their vessel's weapons, engines, shields and other systems.  As players progress through the game, they can acquire better phasers and disruptors, stronger shields and outfit their ship with new special weapons.  Star Trek Starfleet Command III also pushes the boundary of the genre by incorporating  RPG elements into the  experience.  Over the course of the game, officers under the player's command will gain experience and acquire unique skills which increases the ships overall efficiency and enable the player to employ advanced attacks.  Players can also choose to recruit new and more experienced officers to maximize the overall effectiveness of their ship. [Activision]… Expand"
  },
  {
    "name": "Splashdown",
    "details_link": "https://www.metacritic.com/game/xbox/splashdown",
    "publisher": "Atari",
    "release_date": "Jun 25 2002",
    "developers": [
      "Rainbow Studios"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "Snow / Water"
    ],
    "meta_score": 78,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/2/f98a5e7cf9436f328e7b394101ee5116-98.jpg",
    "descriptions": "Become one of 8 rebellious riders as you throttle a Sea-Doo® over water that looks so real you'll need a wetsuit! Just throw Splashdown into your Xbox video game system and you'll instantly start blasting through the waters of Bali, tearing over the Great Barrier Reef, or stirring up theBecome one of 8 rebellious riders as you throttle a Sea-Doo® over water that looks so real you'll need a wetsuit! Just throw Splashdown into your Xbox video game system and you'll instantly start blasting through the waters of Bali, tearing over the Great Barrier Reef, or stirring up the Venice Canals. Catch massive air as you jump wakes and launch off of ramps -- and pull insane stunts like the Metronome and the Cyclone.… Expand"
  },
  {
    "name": "Star Wars: Jedi Starfighter",
    "details_link": "https://www.metacritic.com/game/xbox/star-wars-jedi-starfighter",
    "publisher": "LucasArts",
    "release_date": "May 13 2002",
    "developers": [
      "Secret Level"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 4",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Simulation",
      "Sci-Fi",
      "Small Spaceship"
    ],
    "meta_score": 78,
    "users_score": 4.6,
    "image": "https://static.metacritic.com/images/products/games/5/6f7b7ce1d3ae1ad4dc9a018a5ac4b8e5-98.jpg",
    "descriptions": "Star Wars: Jedi Starfighter reveals the events that lead into the Star Wars: Episode II film. As a secessionist movement threatens to expand, Mace Windu dispatches one of the Council's top Jedi--Adi Gallia--to investigate disturbances in the Karthakk system. Take the role of Adi as sheStar Wars: Jedi Starfighter reveals the events that lead into the Star Wars: Episode II film. As a secessionist movement threatens to expand, Mace Windu dispatches one of the Council's top Jedi--Adi Gallia--to investigate disturbances in the Karthakk system. Take the role of Adi as she maneuvers a prototype Jedi starfighter through the evil Captain Toth's massive fleet. Either solo or with a friend, you must use your Force powers against enemies that threaten the very foundation of the Galactic Republic. … Expand"
  },
  {
    "name": "NCAA College Football 2K2",
    "details_link": "https://www.metacritic.com/game/dreamcast/ncaa-college-football-2k2",
    "publisher": "Sega",
    "release_date": "Aug 29 2001",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 78,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/cb27e6b6a674fc1103dddeb75bdc5358-98.jpg",
    "descriptions": "The game capably competes against any other college football product on the market."
  },
  {
    "name": "FIFA 07 Soccer",
    "details_link": "https://www.metacritic.com/game/pc/fifa-07-soccer",
    "publisher": "EA Sports",
    "release_date": "Oct  3 2006",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "4  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 78,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/0/dcd7587507f7b045b0d93b23d5fc7334-98.jpg",
    "descriptions": "FIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new onlineFIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new online mode that enables you to pit your club against supporters of your real-world opponents. The online interactive leagues feature the F.A. Premier League, Bundesliga, French League and the Mexican 1st Division. Experience the future of online gaming as you play your games according to the real-world schedule. When they play, you play. Track your team's progress as the aggregate results determine your club's position in the league table. This year, new intelligent A.I. ensures that your 11 men on the pitch make realistic decisions, finding space and passing like professionals. A complete overhaul of the game engine now means that you have to employ real world tactics, make split-second decisions and think like a player in order to win matches.  Watch as your players jostle and collide realistically while trying to win balls. Experience the realism of the world's superstars, who come to life with signature moves and authentic playing styles and a more sophisticated shooting mechanic that gives you greater control to produce finesse shots.  Plus you now have the ability to apply topspin or backspin to the ball for more creative set-pieces. [Electronic Arts]… Expand"
  },
  {
    "name": "Fortnite",
    "details_link": "https://www.metacritic.com/game/playstation-4/fortnite",
    "publisher": "Epic Games",
    "release_date": "Jul 21 2017",
    "developers": [
      "Epic Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 5",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "Massively Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Tactical"
    ],
    "meta_score": 78,
    "users_score": 4.0,
    "image": "https://static.metacritic.com/images/products/games/3/616a45e66ba3d61057e26376d140aafc-98.jpg",
    "descriptions": "The Storm came without warning and wiped out 98 percent of the world's population in a flash. Poof. Adios. Sayonara. Then came the monsters, wave after wave, night after night. Destroying everything in their path. But it's not all doom and gloom. In an abandoned missile silo, we've found oneThe Storm came without warning and wiped out 98 percent of the world's population in a flash. Poof. Adios. Sayonara. Then came the monsters, wave after wave, night after night. Destroying everything in their path. But it's not all doom and gloom. In an abandoned missile silo, we've found one of our first weapons against the Storm  you. We're looking for a few good commanders like you to help make a difference, push back the storm and protect those among us who are unable to protect themselves. Explore the world. Rescue survivors. Make hundreds of guns, swords, and things that go boom. Make impregnable forts. Tastefully decorate with sniper perches, poison gas traps, and jump pads. Take back the world. You know, the usual. And be sure to invite your friends. Welcome to Fortnite.… Expand"
  },
  {
    "name": "Hand of Fate",
    "details_link": "https://www.metacritic.com/game/pc/hand-of-fate",
    "publisher": "Defiant Development",
    "release_date": "Feb 17 2015",
    "developers": [
      "Defiant Development"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Miscellaneous",
      "General",
      "Board / Card Game"
    ],
    "meta_score": 78,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/3/66fcbecddf42193538d32aeb3ec80286-98.jpg",
    "descriptions": "In Hand of Fate, players collect equipment, items, artifacts and enemies as in-game collectible cards in a card based RPG; then play their deck, bringing to video game life a beautiful 3D world in which gamers make difficult decisions.  Sometimes their choices have unexpected consequencesIn Hand of Fate, players collect equipment, items, artifacts and enemies as in-game collectible cards in a card based RPG; then play their deck, bringing to video game life a beautiful 3D world in which gamers make difficult decisions.  Sometimes their choices have unexpected consequences and players must crush their foes utilizing a third person action-adventure combat system. The more bosses a player defeats, the more cards they obtain.… Expand"
  },
  {
    "name": "Mortal Kombat: Shaolin Monks",
    "details_link": "https://www.metacritic.com/game/xbox/mortal-kombat-shaolin-monks",
    "publisher": "Midway",
    "release_date": "Sep 16 2005",
    "developers": [
      "Midway Studios - Los Angeles"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 78,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/3/a4ac763af4eac56f8c960abdb94efd5b-98.jpg",
    "descriptions": "Mortal Kombat: Shaolin Monks is an action adventure game set in the world of Mortal Kombat. As either Liu Kang or Kung Lao, you must battle enemies to gain experience and customize your player. Combat features include air combat, juggling, weapons, interactive environments, and an increasedMortal Kombat: Shaolin Monks is an action adventure game set in the world of Mortal Kombat. As either Liu Kang or Kung Lao, you must battle enemies to gain experience and customize your player. Combat features include air combat, juggling, weapons, interactive environments, and an increased number of fatalities, \"mutalities,\" and brutalities. As you progress through the Outworld, you can unlock additional classic Mortal Kombat characters.… Expand"
  },
  {
    "name": "PGA Tour 2K23",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/pga-tour-2k23",
    "publisher": "2K Games",
    "release_date": "Oct 11 2022",
    "developers": [
      "HB Studios Multimedia"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Sports",
      "Individual",
      "Golf",
      "Sim"
    ],
    "meta_score": 78,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/3/e41360481cd2fc7718092aaf87fd9df9-98.jpg",
    "descriptions": "Tiger Woods leads a roster of more than 14 male and female pros at launch, including Justin Thomas, Lexi Thompson, Tony Finau, Lydia Ko, Collin Morikawa, Will Zalatoris, Brooke Henderson and more. Players can step into the tee box as one of the pros in Exhibition, multiplayer and Divot DerbyTiger Woods leads a roster of more than 14 male and female pros at launch, including Justin Thomas, Lexi Thompson, Tony Finau, Lydia Ko, Collin Morikawa, Will Zalatoris, Brooke Henderson and more. Players can step into the tee box as one of the pros in Exhibition, multiplayer and Divot Derby play, or go head-to-head with them in a battle to climb the leaderboard and claim the FedExCup in PGA TOUR MyCAREER mode. In addition to the pros, the broadcast-style presentation and commentary team of Rich Beem and Luke Elvy also return, with the addition of English golf pro and broadcaster Henni Koyack. PGA TOUR 2K23 includes 20 licensed courses at launch. New additions include the South Course of Wilmington Country Club, The Renaissance Club, St. George’s Golf and Country Club and more. The industry-leading Course Designer also returns, offering players the opportunity to build their dream courses and share them with a global online community. MyPLAYER personalization returns and players can equip their MyPLAYERS just like Tiger with Nike Golf, TaylorMade and Bridgestone Golf apparel and gear. Even more apparel options are available from licensed brands, including Callaway Golf, FootJoy, Malbon Golf, Nike Golf, PUMA, Titleist, TravisMathew and more***. Clubs and balls from brands including Bridgestone Golf, Callaway Golf, COBRA, Mizuno, Odyssey Golf, Scotty Cameron, TaylorMade, Titleist and Wilson are available to deck out players’ golf bags and keep them swinging with swag. In addition to the returning analog stick swing, a three-click swing option is also available for an added level of customization so players can play the way they like. [PGA Tour]… Expand"
  },
  {
    "name": "Blue Reflection: Second Light",
    "details_link": "https://www.metacritic.com/game/pc/blue-reflection-second-light",
    "publisher": "Koei Tecmo Games",
    "release_date": "Nov  8 2021",
    "developers": [
      "Gust"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 78,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/11d92223240d14594c9eef4f5cb531c0-98.jpg",
    "descriptions": "Blue Reflection: Second Light follows the adventures of three students – Ao Hoshizaki, Kokoro Utsubo, and Yuki Kinjou – who find themselves transported to a mysterious floating academy, searching for clues to find their way back home, with only their names as memories. One day, a pathBlue Reflection: Second Light follows the adventures of three students – Ao Hoshizaki, Kokoro Utsubo, and Yuki Kinjou – who find themselves transported to a mysterious floating academy, searching for clues to find their way back home, with only their names as memories. One day, a path leading to a new land appears, but when the three protagonists set off to unravel the mystery, they’re met by a series of deadly monsters. By battling the fiendish creatures, they unlock unknown powers that only seem to deepen the cryptic nature of their surroundings. Throughout the adventure, the three friends cooperate and struggle to make their everyday-life as rich and as fun as possible. While spending every day trapped in this unknown world, the characters’ true feelings and personalities will be revealed, and as their bonds grow deeper, they will acquire new strengths and abilities. … Expand"
  },
  {
    "name": "Yakuza 4 Remastered",
    "details_link": "https://www.metacritic.com/game/playstation-4/yakuza-4-remastered",
    "publisher": "Sega",
    "release_date": "Oct 29 2019",
    "developers": [
      "Ryu ga Gotoku Studios"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 78,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/5/560623cd6bfd4942d07f709a3c1f08cf-98.jpg",
    "descriptions": "As part of The Yakuza Remastered Collection, experience Yakuza 4 in 1080p and 60fps. A murder in Tojo Clan territory soon sets off an investigation by a small Tojo branch. Follow the four playable protagonists as they unravel a battle over money, power, status, and honor and a mysteriousAs part of The Yakuza Remastered Collection, experience Yakuza 4 in 1080p and 60fps. A murder in Tojo Clan territory soon sets off an investigation by a small Tojo branch. Follow the four playable protagonists as they unravel a battle over money, power, status, and honor and a mysterious woman at the center of it all.… Expand"
  },
  {
    "name": "Q.U.B.E. 2",
    "details_link": "https://www.metacritic.com/game/xbox-one/qube-2",
    "publisher": "Toxic Games",
    "release_date": "Mar 13 2018",
    "developers": [
      "Toxic Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/4/8c5638963e19badf0a0e784238819e9c-98.jpg",
    "descriptions": "Assume the role of Amelia Cross, a stranded archaeologist who has mysteriously awaken among the sand swept ruins of an ancient alien landscape. Together with the distant help of another survivor, Commander Emma Sutcliffe, you must traverse and manipulate the structure of this forgotten worldAssume the role of Amelia Cross, a stranded archaeologist who has mysteriously awaken among the sand swept ruins of an ancient alien landscape. Together with the distant help of another survivor, Commander Emma Sutcliffe, you must traverse and manipulate the structure of this forgotten world to find a way back home.… Expand"
  },
  {
    "name": "Brass Tactics",
    "details_link": "https://www.metacritic.com/game/pc/brass-tactics",
    "publisher": "Hidden Path Entertainment",
    "release_date": "Feb 22 2018",
    "developers": [
      "Hidden Path Entertainment"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "Tactics"
    ],
    "meta_score": 78,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/8/2811ed4787cdcce42cc276ec9745818e-98.jpg",
    "descriptions": "The scions have fallen - master the table, or lose the war. Experience real-time strategy as it was meant to be: in full VR. From the lead designer of Age of Empires II comes a living tabletop battlefield, where your forces are always at your fingertips. Solo or with a friend, it all comesThe scions have fallen - master the table, or lose the war. Experience real-time strategy as it was meant to be: in full VR. From the lead designer of Age of Empires II comes a living tabletop battlefield, where your forces are always at your fingertips. Solo or with a friend, it all comes down to Brass Tactics.… Expand"
  },
  {
    "name": "Heavy Rain & Beyond: Two Souls Collection",
    "details_link": "https://www.metacritic.com/game/playstation-4/heavy-rain-beyond-two-souls-collection",
    "publisher": "SCEA",
    "release_date": "Mar  1 2016",
    "developers": [
      "Quantic Dream"
    ],
    "platforms": "PlayStation 4",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 78,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/8/65ef0d0d7ec1edda2132f6bef5812999-98.jpg",
    "descriptions": "Popular on PlayStation 3, these two titles have now been visually upgraded and brought together for fans to relive, and newcomers to enjoy for the first time."
  },
  {
    "name": "Call of Duty: Modern Warfare 3",
    "details_link": "https://www.metacritic.com/game/pc/call-of-duty-modern-warfare-3",
    "publisher": "Activision",
    "release_date": "Nov  8 2011",
    "developers": [
      "Infinity Ward",
      "Sledgehammer Games"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "Up to 18 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 3.0,
    "image": "https://static.metacritic.com/images/products/games/4/7265601a82a0c30ed861f51ed0988198-98.jpg",
    "descriptions": "Call of Duty: Modern Warfare 3 is a direct sequel to the previous game in the series, Call of Duty: Modern Warfare 2, with a campaign storyline continuing the struggle of U.S. forces against an invasion by the Russian Federation following the framing of an undercover U.S. agent in aCall of Duty: Modern Warfare 3 is a direct sequel to the previous game in the series, Call of Duty: Modern Warfare 2, with a campaign storyline continuing the struggle of U.S. forces against an invasion by the Russian Federation following the framing of an undercover U.S. agent in a terrorist attack on Moscow. Together with classic Call of Duty multi-character control, Modern Warfare 3 contains deep multiplayer support, including two-player Co-op Survival mode. The game also contains all-new Kill Streak categories and customizable strike packages that offer more options for player combat styles and strategies. … Expand"
  },
  {
    "name": "NHL 06",
    "details_link": "https://www.metacritic.com/game/gamecube/nhl-06",
    "publisher": "EA Sports",
    "release_date": "Sep  6 2005",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Ice Hockey",
      "Sim"
    ],
    "meta_score": 78,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/6/696ac3a6dd7d3bdcf619084cbd2e7a9e-98.jpg",
    "descriptions": "The EA Sports hockey franchise returns with a host of new features in NHL 06. You can carefully place your shots and time your dekes with the new \"skill stick\" system. More-realistic physics have you adjust to a player's speed and size as you navigate the ice. In addition to NHLThe EA Sports hockey franchise returns with a host of new features in NHL 06. You can carefully place your shots and time your dekes with the new \"skill stick\" system. More-realistic physics have you adjust to a player's speed and size as you navigate the ice. In addition to NHL stars, you can create your own player or team from the ground up and lead them through an NHL season. NHL 06 also includes both online and offline multiplayer game modes.… Expand"
  },
  {
    "name": "RIGS: Mechanized Combat League",
    "details_link": "https://www.metacritic.com/game/playstation-4/rigs-mechanized-combat-league",
    "publisher": "SCEA",
    "release_date": "Oct 13 2016",
    "developers": [
      "Guerilla Cambridge"
    ],
    "platforms": "PlayStation 4",
    "num_players": "Up to 6 ",
    "genres": [
      "Simulation",
      "Vehicle",
      "Combat"
    ],
    "meta_score": 78,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/1/98ecfb0ae8e1b0359213ceaaac359fcd-98.jpg",
    "descriptions": "Launching exclusively for PlayStation VR, RIGS throws you into explosive battle arenas where mechanised combat and futuristic sports collide head-on. Immerse yourself into a single player experience that will push your skills to the limit and sharpen your team tactics. Unlock new and moreLaunching exclusively for PlayStation VR, RIGS throws you into explosive battle arenas where mechanised combat and futuristic sports collide head-on. Immerse yourself into a single player experience that will push your skills to the limit and sharpen your team tactics. Unlock new and more powerful RIGS to then take online against the world. Compete in a series of sporting events in the Mechanized Combat League – a near future sports league which pits teams of pilots against each other in real world locations. Face off against other teams from around the globe and enjoy an unprecedented sense of spatial awareness in multiple game modes with hero RIGS at your disposal.\r… Expand"
  },
  {
    "name": "Star Wars: Republic Commando",
    "details_link": "https://www.metacritic.com/game/pc/star-wars-republic-commando",
    "publisher": "LucasArts",
    "release_date": "Mar  1 2005",
    "developers": [
      "LucasArts"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "PC"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/deac477cda21a22bdafc49658ac5686a-98.jpg",
    "descriptions": "Enter the dark military side of the Star Wars universe as a squad leader of a Republic Special Operations unit. You are a Republic Commando. You must infiltrate deep behind enemy lines and lead your elite team on precision operations – lurking in the shadows, striking at will...ExploreEnter the dark military side of the Star Wars universe as a squad leader of a Republic Special Operations unit. You are a Republic Commando. You must infiltrate deep behind enemy lines and lead your elite team on precision operations – lurking in the shadows, striking at will...Explore the military side of the Star Wars universe like never before.Explore eight diverse environments including the hostile surface and subterranean setting of the planet Geonosis, the massive machine-like interiors of a Separatist Core Ship, a disabled and overrun Republic Assault Ship and the lower jungles and tree cities of the Wookiee home planet of Kashyyyk, while you take on special operations that feature hostage rescue, infiltration/data retrieval, assassination, assault, sabotage and reconnaissance objectives. Access to more than twelve authentic weapons including the primary Republic Commando firearm, the DC-17m and secondary weapon the DC-15s Blaster Pistol, as well as enemy weapons such as the Trandoshan Slaver Shotgun and Geonosian Elite Beam Weapon. Innovative squad combat utilizing intuitive and accessible \"smart squad\" command system featuring squad markers and stances. Challenging combat with enemies that include Trade Federation Super Battle Droids and Droidekas, Geonosian Warriors and Elites, and Trandoshan Slavers and Mercenaries. Multi-player capabilities including deathmatch, team deathmatch and capture the flag. [LucasArts]… Expand"
  },
  {
    "name": "Penumbra: Black Plague",
    "details_link": "https://www.metacritic.com/game/pc/penumbra-black-plague",
    "publisher": "Paradox Interactive",
    "release_date": "Feb 12 2008",
    "developers": [
      "Frictional Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Survival"
    ],
    "meta_score": 78,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/9/c3494ddb76c83a5250cb9891ae544417-98.jpg",
    "descriptions": "Penumbra: Black Plague is a creepy and dark psychological horror experience featuring the adventures of Philip as he sets of in search of his dead father. Trapped in a shadowy, underground complex, intrepid explorer Philip is determined to discover the truth behind his father'sPenumbra: Black Plague is a creepy and dark psychological horror experience featuring the adventures of Philip as he sets of in search of his dead father. Trapped in a shadowy, underground complex, intrepid explorer Philip is determined to discover the truth behind his father's disappearance. Surrounded by enemies and assaulted by terror from all sides, Philip must collect clues and solve vexing puzzles while combating the gnawing psychological terrors that assail his mind and threaten to strip him of his sanity. Can Philip master his fear and finally uncover the truth behind a mystery that has haunted him for a lifetime? Only you can decide. [Paradox Interactive]… Expand"
  },
  {
    "name": "Moving Out",
    "details_link": "https://www.metacritic.com/game/xbox-one/moving-out",
    "publisher": "Team17",
    "release_date": "Apr 28 2020",
    "developers": [
      "SMG Studio",
      "Sold Out"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Simulation",
      "Puzzle",
      "Action",
      "Virtual",
      "Career"
    ],
    "meta_score": 78,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/7/1ed9bf06abf4d7e64eed808304a380dd-98.jpg",
    "descriptions": "Moving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!Are you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. SmoothMoving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!Are you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. Smooth Moves may not be the biggest moving company, but there's no task too dangerous or strange for this busy team of go-getters. Grow your business to brave new heights, recruit colourful customizable characters, and save your town from furniture peril!… Expand"
  },
  {
    "name": "Puzzle Quest: The Legend Returns",
    "details_link": "https://www.metacritic.com/game/switch/puzzle-quest-the-legend-returns",
    "publisher": "D3 Go!",
    "release_date": "Sep 19 2019",
    "developers": [
      "Infinity Plus 2"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "Matching"
    ],
    "meta_score": 78,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/3/e1da4d1fddc744fd356985ebff132218-98.jpg",
    "descriptions": "The Original Match 3 RPG is back and better than ever before! Experience the game that started it all, now for the first time on Nintendo Switch™! The totally remastered Puzzle Quest: The Legend Returns features the original Puzzle Quest: Challenge of the Warlords, the expansion Revenge ofThe Original Match 3 RPG is back and better than ever before! Experience the game that started it all, now for the first time on Nintendo Switch™! The totally remastered Puzzle Quest: The Legend Returns features the original Puzzle Quest: Challenge of the Warlords, the expansion Revenge of the Plague Lord, and a whole bundle of new quests, spells, classes and items created exclusively for this version.… Expand"
  },
  {
    "name": "World Soccer Winning Eleven 9",
    "details_link": "https://www.metacritic.com/game/psp/world-soccer-winning-eleven-9",
    "publisher": "Konami",
    "release_date": "Feb  7 2006",
    "developers": [
      "KCET"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PSP"
    ],
    "num_players": "2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 78,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/4/bfa2978ba70bf9f587e8caa77877dfa1-98.jpg",
    "descriptions": "Winning Eleven 9 features the realism, intuitive play and fast-paced action of the ever-popular series. The handheld version is almost identical in terms of available clubs and international sides, with 57 national sides lining up alongside 136 club teams. The game also benefits from aWinning Eleven 9 features the realism, intuitive play and fast-paced action of the ever-popular series. The handheld version is almost identical in terms of available clubs and international sides, with 57 national sides lining up alongside 136 club teams. The game also benefits from a number of exclusive features designed to showcase the PSP's capabilities. The highly-competitive multi-player aspects of the game are highlighted using the hardware's wireless systems. Using this, players within a certain network radius can challenge rival Winning Eleven 9 fans to games, with all data related to match results goals for, goals against, wins, etc retained in a running tally. Solo players can also hone their skills within six different leagues and a host of cup tournaments, and the PSP game can also be linked to the PlayStation 2 version of Winning Eleven 9 for data exchange. Using this, players can import teams they have created within the PlayStation 2 game for use against friends on their PSP, or swap teams with other PSP users.… Expand"
  },
  {
    "name": "Fashion Police Squad",
    "details_link": "https://www.metacritic.com/game/playstation-5/fashion-police-squad",
    "publisher": "No More Robots",
    "release_date": "Feb  2 2023",
    "developers": [
      "Mopeful Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 78,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/8/6b3766b52a7dd6db36bcd59299f9d876-98.jpg",
    "descriptions": "Calling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!Fashion Police Squad is a humorous Retro FPS where you fight againstCalling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!Fashion Police Squad is a humorous Retro FPS where you fight against fashion crime using attire enhancing weaponry. Clean the streets of socks in sandals as Sergeant Des, and experience a single-player story full of fabulous characters, dazzling encounters, and fierce runway shows!… Expand"
  },
  {
    "name": "Please, Touch The Artwork",
    "details_link": "https://www.metacritic.com/game/switch/please-touch-the-artwork",
    "publisher": "Nakana.io",
    "release_date": "Sep  3 2022",
    "developers": [
      "Studio Waterzooi"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "General"
    ],
    "meta_score": 78,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/1/d477edd74bc96ac3dcd4b5ab99cb3a6b-98.jpg",
    "descriptions": "What happens when you DO touch the artwork? Part Zen-puzzle, part narrative-adventure, you'll explore the secret world behind iconic abstract paintings through over 160 puzzles spread over 3 unique games. An aesthetic journey to the origins of modern art, set to a soothing jazzy soundtrack.What happens when you DO touch the artwork? Part Zen-puzzle, part narrative-adventure, you'll explore the secret world behind iconic abstract paintings through over 160 puzzles spread over 3 unique games. An aesthetic journey to the origins of modern art, set to a soothing jazzy soundtrack. + FUN ART FACTS!The first game tells the origin story of pure abstract art. It's a challenging puzzle where you'll add colors and lines to a canvas to recreate paintings.The second game is about Boogie & Woogie, two squares who just want to be together, but a rapidly growing world is making this harder and harder. You'll help Woogie reach Boogie by figuring out how the obstacles influence Woogie's path.In the third game you'll move to the big city, only to be overwhelmed with mixed emotions. From joy and excitement to feeling homesick and missing your friends and family. You'll be maneuvering through the craziness of the Big Apple while collecting letters to form a poem.… Expand"
  },
  {
    "name": "Dying Light: Platinum Edition",
    "details_link": "https://www.metacritic.com/game/switch/dying-light-platinum-edition",
    "publisher": "Techland",
    "release_date": "Oct 19 2021",
    "developers": [
      "Techland"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Up to 5 ",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 78,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/4cecafc43db949011fa3d2ffec60b702-98.jpg",
    "descriptions": "Features:Dying Light - the full award-winning game.\n\nDying Light: The Following - a huge expansion complete with a new story, vast original map, and a customizable buggy to drive.\n\nDying Light: Bozak Horde - a challenging game mode with its own side story.\n\nCuisine & Cargo - two additionalFeatures:Dying Light - the full award-winning game.Dying Light: The Following - a huge expansion complete with a new story, vast original map, and a customizable buggy to drive.Dying Light: Bozak Horde - a challenging game mode with its own side story.Cuisine & Cargo - two additional quarantine zones.Ultimate Survivor Bundle - exclusive weapons and outfits.Crash Test Skin Pack - a madcap cosmetic pack.Hellraid - a new game mode in a dark-fantasy setting.A large collection of skins and weapons that will make slaughtering zombies even more fun.… Expand"
  },
  {
    "name": "DiRT 4",
    "details_link": "https://www.metacritic.com/game/pc/dirt-4",
    "publisher": "Codemasters",
    "release_date": "Jun  8 2017",
    "developers": [
      "Codemasters"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Racing",
      "Simulation",
      "Automobile"
    ],
    "meta_score": 78,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/4/5dbc2276b485ef6619daea7e90b0f751-98.jpg",
    "descriptions": "Dirt 4 puts you at the wheel of the most powerful machines ever made as you face the toughest roads and circuits on the planet in rally, rallycross, and landrush."
  },
  {
    "name": "Marvel's Guardians of the Galaxy: The Telltale Series",
    "details_link": "https://www.metacritic.com/game/pc/marvels-guardians-of-the-galaxy-the-telltale-series",
    "publisher": "Telltale Games",
    "release_date": "Apr 18 2017",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Adventure",
      "General",
      "3D",
      "Third-Person"
    ],
    "meta_score": 78,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/0/bdbb29b1f84271081eb387bcfe4c58c3-98.jpg",
    "descriptions": "A brand new story of the universe’s unlikeliest heroes: Star-Lord, Gamora, Drax, Rocket, and Groot. Marvel’s Guardians of the Galaxy: The Telltale Series is a five-part episodic series. Players take on multiple roles within the ragtag band of heroes, and take the pilot's seat in directingA brand new story of the universe’s unlikeliest heroes: Star-Lord, Gamora, Drax, Rocket, and Groot. Marvel’s Guardians of the Galaxy: The Telltale Series is a five-part episodic series. Players take on multiple roles within the ragtag band of heroes, and take the pilot's seat in directing their escapades around the universe.… Expand"
  },
  {
    "name": "Avernum 2: Crystal Souls",
    "details_link": "https://www.metacritic.com/game/pc/avernum-2-crystal-souls",
    "publisher": "Spiderweb Software",
    "release_date": "Jan 14 2015",
    "developers": [
      "Spiderweb Software"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "PC-style RPG",
      "Role-Playing",
      "Western-Style"
    ],
    "meta_score": 78,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/5/40de3d80e72901beac9bb910f5a2fc6e-98.jpg",
    "descriptions": "An indie fantasy role-playing adventure in a massive, underground land. Chock full of over 100 towns and dungeons and an epic story. Fight to complete up to three distinct game-winning quests. Master over sixty spells and abilities. Hunt for hundreds of magical artifacts."
  },
  {
    "name": "Watch Dogs",
    "details_link": "https://www.metacritic.com/game/xbox-one/watch-dogs",
    "publisher": "Ubisoft",
    "release_date": "May 27 2014",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Wii U",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern",
      "Open-World"
    ],
    "meta_score": 78,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/5/09185bb49f2732cbef03ee485c2d0d41-98.jpg",
    "descriptions": "In the modern uber-connected world, Chicago has the nation's most advanced and integrated computer system – one which controls almost every facet of city technology and maintains critical information on all of the city's residents. You assume the role of Aiden Pearce, a notorious hacker andIn the modern uber-connected world, Chicago has the nation's most advanced and integrated computer system – one which controls almost every facet of city technology and maintains critical information on all of the city's residents. You assume the role of Aiden Pearce, a notorious hacker and former thug, whose criminal past lead to a violent family tragedy. Now on the hunt for those people who have hurt your family, you will be able to monitor and hack all who surround you while manipulating the city's systems to stop traffic lights, download personal information, manipulate the electrical grid and more. Use the entire city of Chicago as your personal weapon and exact your signature brand of revenge.… Expand"
  },
  {
    "name": "Grand Theft Auto: Liberty City Stories",
    "details_link": "https://www.metacritic.com/game/playstation-2/grand-theft-auto-liberty-city-stories",
    "publisher": "Rockstar Games",
    "release_date": "Jun  6 2006",
    "developers": [
      "Rockstar Leeds"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 78,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/2/adb44215c195453511fa64ef48507650-98.jpg",
    "descriptions": "Grand Theft Auto: Liberty City Stories is an entirely new game in the Grand Theft Auto series and brings a mobile dimension to this epic experience. The original storyline and all new missions take place in Liberty City, featuring the interactive, open environment, voice talent and diverseGrand Theft Auto: Liberty City Stories is an entirely new game in the Grand Theft Auto series and brings a mobile dimension to this epic experience. The original storyline and all new missions take place in Liberty City, featuring the interactive, open environment, voice talent and diverse music that have become pioneering trademarks of the series. [Rockstar]… Expand"
  },
  {
    "name": "Resident Evil: Revelations",
    "details_link": "https://www.metacritic.com/game/switch/resident-evil-revelations",
    "publisher": "Capcom",
    "release_date": "Nov 28 2017",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Wii U",
      "Xbox 360",
      "Xbox One",
      "Switch"
    ],
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 78,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/6/11178e0d0f27a716a8764f3b09288206-98.jpg",
    "descriptions": "The fear that was originally brought to players in Resident Evil Revelations on the Nintendo 3DS system returns redefined for home consoles complete with high quality HD visuals, enhanced lighting effects and an immersive sound experience. Furthermore, the home console version will deliverThe fear that was originally brought to players in Resident Evil Revelations on the Nintendo 3DS system returns redefined for home consoles complete with high quality HD visuals, enhanced lighting effects and an immersive sound experience. Furthermore, the home console version will deliver additional content including a terrifying new enemy, extra difficulty mode and improvements to Raid Mode such as new weapons, skill sets and the opportunity to play as Hunk and other characters from the series. Raid Mode, which was first introduced to the series in the original version of Resident Evil Revelations, sees gamers play online in co-op mode or alone in single player taking on the hordes of enemies across a variety of missions whilst leveling up characters and earning weapon upgrades. The critically acclaimed survival horror title takes players back to the events that took place between Resident Evil 4 and Resident Evil 5, revealing the truth about the T-Abyss virus. Resident Evil Revelations features series favorites Jill Valentine and Chris Redfield, plus their respective BSAA partners - Parker Luciani and Jessica Sherawat. The action begins on board a supposedly abandoned cruise ship, the 'Queen Zenobia', where horrors lurk around every corner before players head for the mainland and the devastated city of Terragrigia. With limited ammo and weapons available, the race is on to survive the horror of Resident Evil Revelations.… Expand"
  },
  {
    "name": "Elemental: Fallen Enchantress",
    "details_link": "https://www.metacritic.com/game/pc/elemental-fallen-enchantress",
    "publisher": "Stardock",
    "release_date": "Oct 23 2012",
    "developers": [
      "Stardock"
    ],
    "platforms": "PC",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy",
      "General"
    ],
    "meta_score": 78,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/9/34fa0d05fa02322d57d2c3d5a5c21b40-98.jpg",
    "descriptions": "In Fallen Enchantress players will be able to explore the world of Elemental and discover a wide range of unique locations, including dangerous wild lands that can't be settled until they are conquered."
  },
  {
    "name": "Crimson Gem Saga",
    "details_link": "https://www.metacritic.com/game/psp/crimson-gem-saga",
    "publisher": "Atlus",
    "release_date": "May 26 2009",
    "developers": [
      "IronNos Co.,Ltd."
    ],
    "platforms": [
      "iPhone/iPad",
      "PSP"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Console-style RPG",
      "Console-style RPG",
      "Japanese-Style"
    ],
    "meta_score": 78,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/5/516771ac31cf7e24eb8346600e218a07-98.jpg",
    "descriptions": "The game, a lovingly crafted exploration into the fundamentals of RPG fun, delivers lush hand-drawn visuals, an engaging fantasy tale, and an easy-to-use interface. [Atlus USA]"
  },
  {
    "name": "Heavy Rain",
    "details_link": "https://www.metacritic.com/game/playstation-4/heavy-rain",
    "publisher": "SCEA",
    "release_date": "Mar  1 2016",
    "developers": [
      "Quantic Dream",
      "Virtuos"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4"
    ],
    "genres": [
      "Adventure",
      "3D",
      "Third-Person"
    ],
    "meta_score": 78,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/9/e786b195ed92de346247598b76f4a589-98.jpg",
    "descriptions": "Experience a gripping psychological crime thriller filled with innumerable twists and turns, where even the smallest actions and choices can cause dramatic consequences. The hunt is on for the Origami Killer, named after his calling card of leaving folded paper shapes on victims. FourExperience a gripping psychological crime thriller filled with innumerable twists and turns, where even the smallest actions and choices can cause dramatic consequences. The hunt is on for the Origami Killer, named after his calling card of leaving folded paper shapes on victims. Four characters, each with their own motives, take part in a desperate attempt to stop the killer from claiming a new victim.… Expand"
  }
]