[{"name": "NCAA GameBreaker 2003", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-gamebreaker-2003", "publisher": "SCEA", "release_date": "Aug 14 2002", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/daa05ab71937e7b240bb072b2e097180-98.jpg", "descriptions": "Features 117 Division 1-A teams, 60 classic teams from the past, the Heisman Trophy, and numerous other awards, including All-American and All-Conference teams. Specific players on each team, known as GameBreakers, allow gamers to attack their opponents on both the offensive and defensiveFeatures 117 Division 1-A teams, 60 classic teams from the past, the Heisman Trophy, and numerous other awards, including All-American and All-Conference teams. Specific players on each team, known as GameBreakers, allow gamers to attack their opponents on both the offensive and defensive side of the football. Blue-chip recruiting lets you assume the role of a coach by selectively recruiting players at multiple positions in pursuit of college football's most coveted prize, the national championship.… Expand"}, {"name": "The Three Stooges", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-three-stooges", "publisher": "Metro3D", "release_date": "Mar 31 2002", "developers": ["Cinemaware"], "platforms": "Game Boy Advance", "genres": ["Action", "General"], "meta_score": 53, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/501db875be72b5ce1b936ae5eb984b6e-98.jpg", "descriptions": "Moe, Larry & Curly star in their own Cinemaware Interactive Movie! Join those zany masters of mirth as they try to save an old lady and her 3 beautiful daughters from the clutches of an evil banker. You'll hear the real Stooges' voices as you maneuver them through a variety of antics,Moe, Larry & Curly star in their own Cinemaware Interactive Movie! Join those zany masters of mirth as they try to save an old lady and her 3 beautiful daughters from the clutches of an evil banker. You'll hear the real Stooges' voices as you maneuver them through a variety of antics, including prizefighting, pie throwing and medical madness in the famous \"Calling Dr. Howard, Dr. Fine, Dr. Howard\" scene.… Expand"}, {"name": "Britney's Dance Beat", "details_link": "https://www.metacritic.com/game/game-boy-advance/britneys-dance-beat", "publisher": "THQ", "release_date": "Mar 25 2002", "developers": ["Art"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 53, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/0ce806d152e025be6ed50d9572161747-98.jpg", "descriptions": "Singer Britney Spears is looking for backup dancers for her next world tour, and she wants you to audition. Show Britney your hottest moves by keeping to the beat of her most popular songs, including \"Oops! I Did It Again\" and \"I'm a Slave 4 U.\" Then, answer triviaSinger Britney Spears is looking for backup dancers for her next world tour, and she wants you to audition. Show Britney your hottest moves by keeping to the beat of her most popular songs, including \"Oops! I Did It Again\" and \"I'm a Slave 4 U.\" Then, answer trivia questions to prove your Britney knowledge. The game rewards true fans with exclusive video footage, access to more songs, and the chance to dance alongside Britney.… Expand"}, {"name": "Sydney 2000", "details_link": "https://www.metacritic.com/game/dreamcast/sydney-2000", "publisher": "Eidos Interactive", "release_date": "Aug 31 2000", "developers": ["Attention To Detail"], "platforms": ["PC", "Dreamcast"], "genres": ["Sports", "Olympic Sports"], "meta_score": 53, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/f114dc089b45c617d5eba74eedce973c-98.jpg", "descriptions": "Experience the Sydney 2000 Olympic Games. Train your mind and body for competition in the Virtual Gym. 4 modes of play: Olympic, Arcade, Head-to-Head, or Coaching. Compete in intese multiplayer action for up to 4 players. TV-style presentation with Olympic champion commentators Dwight StonesExperience the Sydney 2000 Olympic Games. Train your mind and body for competition in the Virtual Gym. 4 modes of play: Olympic, Arcade, Head-to-Head, or Coaching. Compete in intese multiplayer action for up to 4 players. TV-style presentation with Olympic champion commentators Dwight Stones and Marty Liquori. 32 countries represented in 12 events of power, stamina, accuracy and skill.… Expand"}, {"name": "Akaneiro: Demon Hunters", "details_link": "https://www.metacritic.com/game/pc/akaneiro-demon-hunters", "publisher": "Spicy Horse", "release_date": "Jan 24 2013", "developers": ["Spicy Horse"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 53, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/9964baac4c1601df28c6849c87f6630b-98.jpg", "descriptions": "Akaneiro: Demon Hunters is a fantasy action RPG which takes you back to feudal Japan and pits you against the Yokai, demonic creatures inspired by Japanese myth and folklore."}, {"name": "Full Auto 2: Battlelines", "details_link": "https://www.metacritic.com/game/psp/full-auto-2-battlelines", "publisher": "Sega", "release_date": "Mar 20 2007", "developers": ["Deep Fried Entertainment"], "platforms": ["PlayStation 3", "PSP"], "num_players": "Up to 4 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 53, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/37bf4dfb8be8ac22a6667513936d3b29-98.jpg", "descriptions": "Full Auto 2: Battlelines blasts onto the PSP with a constant barrage of high-octane demolition. While the player races full-throttle through the city, their strategically timed missiles will bring down buildings and other elements on opponents and set off fiery chain reactions. Players wreakFull Auto 2: Battlelines blasts onto the PSP with a constant barrage of high-octane demolition. While the player races full-throttle through the city, their strategically timed missiles will bring down buildings and other elements on opponents and set off fiery chain reactions. Players wreak vehicular mayhem in both arena-combat and racing-combat modes with 15 customizable vehicles stocked with explosive weapons of their choice. A whole new career storyline awaits with challenging new pick-up-and-play modes, goals, and rivals all bent on mass destruction. Strategically targeted destruction opens up invaluable new routes and blocks opponents. New career storyline: A 50+ event single-player career path with multiple modes, objectives, destructive weapons, areas, and rivals to unlock. Numerous single-player and multiplayer races via ad hoc, such as Head-On, Down & Back, as well as Arena Deathmatch modes challenge players with a variety of objectives. Players obliterate and wreak havoc in 15 cars - nine brand new to the PSP version. All-new weapons: Customize vehicles with light, medium and heavy weapons including the M16, Grenade, M60, M203 Launcher, Aircraft Gun, Mortar, Fire & Forget Missile, and Heat-Seeking Missiles. Over 15 original tracks: Three unique new districts on the PSP system, each offering six tracks including Point-to-Point, Circuit, and Arena levels. AAA licensed soundtrack: Obliterate the city while listening to popular tracks by Stone Sour, Sum 41, We Are Scientists, Wolfmother and others. [Sega]… Expand"}, {"name": "Dragon Ball Z: Battle of Z", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-ball-z-battle-of-z", "publisher": "Namco Bandai Games", "release_date": "Jan 28 2014", "developers": ["Artdink"], "platforms": ["PlayStation 3", "PlayStation Vita", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 53, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/14000150dc586333c77d568a9f465725-98.jpg", "descriptions": "Developed by Tokyo based game developer ARTDINK; Dragon Ball Z Battle of Z will feature a large cast of playable characters including Goku, Piccolo, Vegeta, and a variety of melee and famous attacks including the Kamehameha, Special Beam Cannon, and Spirit Bomb. The epic battles in DragonDeveloped by Tokyo based game developer ARTDINK; Dragon Ball Z Battle of Z will feature a large cast of playable characters including Goku, Piccolo, Vegeta, and a variety of melee and famous attacks including the Kamehameha, Special Beam Cannon, and Spirit Bomb. The epic battles in Dragon Ball Z Battle of Z derive their style from the original anime series and will take place in rich environments on both land and in the air. Dragon Ball Z Battle of Z will let players form teams with up to four characters to participate in group melee action, take on massive boss battles, or challenge other players around the world for brawls featuring up to eight characters on screen at the same time.… Expand"}, {"name": "Destroy All Humans! Big Willy Unleashed", "details_link": "https://www.metacritic.com/game/wii/destroy-all-humans!-big-willy-unleashed", "publisher": "THQ", "release_date": "Feb 25 2008", "developers": ["Locomotive Games"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 53, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/d13a84f18c17b2933f9c90be5fc87cf3-98.jpg", "descriptions": "The prequel to Destroy All Humans! Path of the Furon. Control Crypto as he travels the world in the Funked Out 1970's, unleashing massive destruction on foot, in his UFO and, for the first time, in the Big Willy mech. Set within an original storyline, Destroy All Humans! Big Willy UnleashedThe prequel to Destroy All Humans! Path of the Furon. Control Crypto as he travels the world in the Funked Out 1970's, unleashing massive destruction on foot, in his UFO and, for the first time, in the Big Willy mech. Set within an original storyline, Destroy All Humans! Big Willy Unleashed takes players around the world, lampooning hallmarks of the funkiest decade—the '70's. Take on humans and other enemies with a devastating arsenal of weapons and mental abilities—or take to the sky in your UFO to unleash massive destruction from above. Freely demolish 5 invasion sites as you take on over 30 story missions and 30 sandbox missions through three modes of play—Crypto, UFO, and BIG WILLY Mech. Explore 5 open world game environments and play through a variety of story missions and side-missions, or destroy everything and anything in sight via open-world sandbox gameplay. DAH! Big Willy Unleashed features all new multiplayer modes. [THQ]… Expand"}, {"name": "SX Superstar", "details_link": "https://www.metacritic.com/game/xbox/sx-superstar", "publisher": "Acclaim", "release_date": "Jun 26 2003", "developers": ["Acclaim"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/ab9100488a097d25236049f8037af16c-98.jpg", "descriptions": "In SX Superstar, you can become the star of Supercross racing. Take one of 24 riders from the poorhouse to the penthouse on 20 tracks around the world. On each track, you can grab big air and combo your way to glory against seven other riders. The cash you earn from each race can buy youIn SX Superstar, you can become the star of Supercross racing. Take one of 24 riders from the poorhouse to the penthouse on 20 tracks around the world. On each track, you can grab big air and combo your way to glory against seven other riders. The cash you earn from each race can buy you better bikes, bigger houses, and other rewards. Showcase your new stuff and talent when you race your friends in multiplayer modes.… Expand"}, {"name": "Painkiller: Hell & Damnation", "details_link": "https://www.metacritic.com/game/xbox-360/painkiller-hell-damnation", "publisher": "Nordic Games Publishing", "release_date": "Nov 30 2013", "developers": ["The Farm 51"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 53, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/926ecbb62fe5b2a6710832e1f1114cd2-98.jpg", "descriptions": "Powered by Epic's world-renowned and highly-respected Unreal Engine 3, Painkiller Hell & Damnation recreates the sensations and hardcore gameplay of the original Painkiller. Released in 2004, Painkiller won high praise and many accolades and fans for its fast and unique gameplay. KeepingPowered by Epic's world-renowned and highly-respected Unreal Engine 3, Painkiller Hell & Damnation recreates the sensations and hardcore gameplay of the original Painkiller. Released in 2004, Painkiller won high praise and many accolades and fans for its fast and unique gameplay. Keeping true to the old-school FPS ideology, lightning-fast movement enables skillful players to get into the heart of the fast-paced gameplay, topped off with stunning enormo-boss fights requiring sneaky tactics. … Expand"}, {"name": "Death Track: Resurrection", "details_link": "https://www.metacritic.com/game/pc/death-track-resurrection", "publisher": "Aspyr", "release_date": "Mar 31 2009", "developers": ["Sky Fallen"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Driving", "Racing", "Car Combat", "Arcade", "Car Combat", "Vehicle", "Automobile", "Combat"], "meta_score": 53, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/3/115c9ab124ccc288faddaf9080ad42b5-98.jpg", "descriptions": "Death Track: Resurrection is a racing/action title that takes players into a post-apocalyptic, not-too-distant future where traditional sports have been replaced by far more violent entertainment. The main event, The Survival Race, is a deadly combat racing tournament that draws the world’sDeath Track: Resurrection is a racing/action title that takes players into a post-apocalyptic, not-too-distant future where traditional sports have been replaced by far more violent entertainment. The main event, The Survival Race, is a deadly combat racing tournament that draws the world’s best drivers to compete in spectacular road battles with powerful, weapons-laden hot rods. Gamers will drive, battle and try to survive in races that take place in twisted future versions of the planet’s biggest cities. Combat racing across post apocalyptic versions of 10 major cities: Bangkok, Vatican City, London, Moscow, New York, Paris, Prague, San Diego, Istanbul and Tokyo. Destructible environments add to the chaotic destruction surrounding each race. 10 powerful car models, customizable with multiple weapons, upgrades and paint jobs. Thrilling suspense story drives the single-player narrative. [Aspyr Media]… Expand"}, {"name": "Star Trek: D-A-C", "details_link": "https://www.metacritic.com/game/xbox-360/star-trek-d-a-c", "publisher": "Paramount Digital Entertainment", "release_date": "May 13 2009", "developers": ["Naked Sky Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Simulation", "General", "General", "Space", "Combat"], "meta_score": 53, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/f9176353ea0babe331e03ef2ebeaf956-98.jpg", "descriptions": "[Xbox Live Arcade]  Star Trek: D-A-C is a fast-paced, top-down space shooter inspired by the new motion picture. This pick-up and play game allows you and your friends to choose starships (from a list that includes the all-new U.S.S. Enterprise) and battle it out online. Enlist in Starfleet[Xbox Live Arcade]  Star Trek: D-A-C is a fast-paced, top-down space shooter inspired by the new motion picture. This pick-up and play game allows you and your friends to choose starships (from a list that includes the all-new U.S.S. Enterprise) and battle it out online. Enlist in Starfleet or join the Romulan Empire as you battle with up to 11 friends in game play modes including Solo Play, Online Versus, and Online Co-op. Command the powerful Flagship, the nimble Fighter or the devastating Bomber, each with their own unique capabilities. Choose your side, fire your weapons, boldly go where no man has gone before. Three game play modes: In single-player, practice against A.I. bots to become an expert captain. Jump into online multiplayer, where twelve players (six per team) compete in intense online battles. Team up with friends to combat in space in online co-op. Three game types: Team Deathmatch lets teams go head-to-head in a winner-takes-all fight to the finish. In Assault, teams must protect and conquer control points in space. In Conquest, teams take turns trying to dominate or defend a sector of space. Three ship classes: Each faction has the powerful Flagship, the nimble Fighter, and the devastating Bomber, each providing unique capabilities in combat. [Paramount]… Expand"}, {"name": "Dead or Alive Xtreme 2", "details_link": "https://www.metacritic.com/game/xbox-360/dead-or-alive-xtreme-2", "publisher": "Tecmo", "release_date": "Nov 13 2006", "developers": ["Team Ninja"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Sports", "General", "General"], "meta_score": 53, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/f035e0bc40097cb34408c260042255ec-98.jpg", "descriptions": "Join the DOA girls at the beach--frolic at your own pace, compete in new beach games and see all their curves up close and personal. Play as Kasumi, Christie or any of the nine female characters that appear in the DEAD OR ALIVE series. This is the way resort life was meant to be enjoyed.Join the DOA girls at the beach--frolic at your own pace, compete in new beach games and see all their curves up close and personal. Play as Kasumi, Christie or any of the nine female characters that appear in the DEAD OR ALIVE series. This is the way resort life was meant to be enjoyed. Admire the girls of DOA like never before... The gorgeous women of the award winning DOA franchise come to life in a fun, beautiful, island environment complete with all new cinematics. What would a tropical vacation be without some beach blanket games? Play games from the original DOAXBV including Beach Volleyball and the fan-favorite Hopping Game or try out the all-new additions, the innovative Hip Wrestling or experience an adrenaline rush in the personal watercraft\" racing mode. Do you feel lucky? Gamble the night away as the Casino feature is back with even more games to test your luck. A DOA game without a little competition? Never! Play by yourself or challenge others in versus mode or through Xbox Live. [Tecmo]… Expand"}, {"name": "Brain Assist", "details_link": "https://www.metacritic.com/game/ds/brain-assist", "publisher": "Sega", "release_date": "Feb 26 2008", "developers": ["Sega", "Japan Art Media (JAM)"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board Games", "Edutainment", "Board Games", "Board / Card Game"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/5ae335ce26339d9dc38d4fead8810b88-98.jpg", "descriptions": "Re-energize your brain with 10 colorful mind-teasing mini-games that stimulate your concentration, memory, analysis, instincts and reflexes. Six nurses with widely varying personalities will guide you through the games and keep track of your best results. A unique new test even allows youRe-energize your brain with 10 colorful mind-teasing mini-games that stimulate your concentration, memory, analysis, instincts and reflexes. Six nurses with widely varying personalities will guide you through the games and keep track of your best results. A unique new test even allows you and a friend to examine the compatibility of your right brains. Get more friends in on the action with the Nintendo Wi-Fi Connection and race through a variety of fast-paced four-player mini-games to see who the true brainiac is. Multiplayer battles for up to four gamers. The action ramps up quickly for a fun challenge using the Nintendo Wi-Fi Connection. Ability Tracker. A report is generated at the end of each test and high scores and Compatibility Reports can be saved and overridden as players improve. Touch Screen and stylus technology. With the clock running, get the competitive edge with the stylus and Touch Screen technology. Unlockable Icons. As you clear rounds, unlock 14 icons to personalize your game. [Sega]… Expand"}, {"name": "Flip Wars", "details_link": "https://www.metacritic.com/game/switch/flip-wars", "publisher": "Nintendo", "release_date": "Jul  6 2017", "developers": ["OVER FENCE CO.,LTD.", "Over Fence"], "platforms": "Switch", "genres": ["Puzzle", "General"], "meta_score": 53, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/3d898e298b24b9d7580836b1c1de6607-98.jpg", "descriptions": "Leap into the air and Hip Drop onto the board below to flip adjacent panels around where you land and change them to your colour. Knock Out your opponent by flipping any panels they’re standing on, and watch them fly off the board – be careful where you stand, though, as they can send youLeap into the air and Hip Drop onto the board below to flip adjacent panels around where you land and change them to your colour. Knock Out your opponent by flipping any panels they’re standing on, and watch them fly off the board – be careful where you stand, though, as they can send you flying, too! Prevent your rivals from reclaiming nearby panels and catch them off guard by adjusting your landing zone in mid-air, or by performing a Hip Drop feint. [Nintendo]… Expand"}, {"name": "Dreamcast Collection", "details_link": "https://www.metacritic.com/game/xbox-360/dreamcast-collection", "publisher": "Sega", "release_date": "Feb 22 2011", "developers": ["Sega"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 53, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/4e69af3556c0d8c7a93dd2a621dafee0-98.jpg", "descriptions": "The Dreamcast Collection includes the fan favorites Sonic Adventure, Crazy Taxi, SEGA Bass Fishing and Space Channel 5: Part 2."}, {"name": "Samurai Warriors 2 Empires", "details_link": "https://www.metacritic.com/game/xbox-360/samurai-warriors-2-empires", "publisher": "Koei", "release_date": "Feb 27 2007", "developers": ["Omega Force"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 53, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/16e8750a0ce837a8c1d8a3d2ea9c5595-98.jpg", "descriptions": "Samurai Warriors 2 Empires, the follow-up to the Tactical Action game Samurai Warriors 2, combines aspects of Action, Fighting and Strategy games. Japan is divided into 25 warring states and it is up to you to resurrect a nation using equal amounts of strategy and strength. Before eachSamurai Warriors 2 Empires, the follow-up to the Tactical Action game Samurai Warriors 2, combines aspects of Action, Fighting and Strategy games. Japan is divided into 25 warring states and it is up to you to resurrect a nation using equal amounts of strategy and strength. Before each battle, you meet with their war council to discuss military and political affairs; then it's time for combat. Samurai Warriors 2 Empires is a unique blend of strategy and true warrior action. An account of Japan's Warring States era. A must-have for anyone fascinated by Samurai culture. Vicious multi-Musou attacks with up to four officers. 6 Regional scenarios, plus 5 Unification scenarios. 50 new policy cards based on Japanese history. 30 different tactics cards allow you to hire wind ninjas, set an ambush or form a blockade. – 90 policies in all. Create your own warrior in New Officer mode or choose from among 400 playable characters. 2-player co-op play. Forge alliances with rival clans and hire captured officers. Includes Empire mode, Free mode, and an extensive Archive section with rare art and information on Samurai history and tactics. [Koei]… Expand"}, {"name": "Five Nights at Freddy's: Help Wanted", "details_link": "https://www.metacritic.com/game/switch/five-nights-at-freddys-help-wanted", "publisher": "Scott Games", "release_date": "May 21 2020", "developers": ["Steel Wool Games", "Inc.", "Steel Wool Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 53, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/f73c31aa022359a4322509d84aa50351-98.jpg", "descriptions": "Five Nights at Freddy's VR: Help Wanted is a virtual reality experience for the HTC Vive and Oculus Rift. FNaF VR: HW is a collection of classic and original mini-games set in the Five Nights universe. Survive terrifying encounters with your favorite killer animatronics in a collection ofFive Nights at Freddy's VR: Help Wanted is a virtual reality experience for the HTC Vive and Oculus Rift. FNaF VR: HW is a collection of classic and original mini-games set in the Five Nights universe. Survive terrifying encounters with your favorite killer animatronics in a collection of new and classic FIVE NIGHTS AT FREDDY'S experiences. \"Where fantasy and fun come to life!\"* YOU'RE HIRED - Time to get your hands dirty. Repair claustrophobic ventilation systems, troubleshoot broken animatronics that could activate at any moment, or spend your evenings cowering in the nighttime security guard office.* CELEBRATE - Confront your favorite killer animatronics including; Freddy, Bonnie, Chica, Foxy, Springtrap, The Mangle, Funtime Foxy, and Circus Baby.* FUN FUN PRIZES - Toys, Plushies, Bobbleheads, and candy candy candy! Earn super fun prizes you can play with at the interactive Prize Counter! Collect well hidden Faz-Tokens to unlock even more rare collectibles for more SUPER FUN FUN FUN.* PIZZA PARTY - Scenes from classic titles have been updated and remade for a fully immersive VR experience including; Five Nights at Freddy's, Five Nights at Freddy's 2, Five Nights at Freddy's 3, Five Nights at Freddy's 4, and Five Nights at Freddy's: Sister Location.… Expand"}, {"name": "Black Clover: Quartet Knights", "details_link": "https://www.metacritic.com/game/playstation-4/black-clover-quartet-knights", "publisher": "Bandai Namco Games", "release_date": "Sep 14 2018", "developers": ["Bandai Namco Games", "ilinx inc."], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Shooter", "Third-Person", "Tactical"], "meta_score": 53, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/7de3714fbe31330fab33ae0efb48c444-98.jpg", "descriptions": "Humanity at one time came close to being decimated by demons. It was only one mage who saved humanity, known thereafter as the Wizard King, and regarded as a legend. For generations, the Wizard King has protected the people of this magical world. Based on the hit manga and anime series,Humanity at one time came close to being decimated by demons. It was only one mage who saved humanity, known thereafter as the Wizard King, and regarded as a legend. For generations, the Wizard King has protected the people of this magical world. Based on the hit manga and anime series, prepare for a new legend to enter the fray in Quartet Knights.… Expand"}, {"name": "Gemini Wars", "details_link": "https://www.metacritic.com/game/pc/gemini-wars", "publisher": "Camel 101", "release_date": "Jun  8 2012", "developers": ["Camel 101"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 53, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/34e557e8be2e2e423301d7330d8e8c51-98.jpg", "descriptions": "Gemini Wars is a Real Time Strategy Game set in space, featuring an epic campaign controlling fleets of ships in massive battles."}, {"name": "Ecco the Dolphin", "details_link": "https://www.metacritic.com/game/xbox-360/ecco-the-dolphin", "publisher": "Sega", "release_date": "Aug 15 2007", "developers": ["Backbone Entertainment"], "platforms": ["3DS", "iPhone/iPad", "PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 53, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/aed45e411a99f630699c6eb6027f9a00-98.jpg", "descriptions": "[Xbox Live Arcade]  A terrible storm has swept the family of Ecco the Dolphin from their watery home. Now, Ecco must search for them through a vast underwater world. Danger and adventure awaits you in Ecco the Dolphin. Use Ecco's sonar to discover hidden caverns and unlock the secrets of the[Xbox Live Arcade]  A terrible storm has swept the family of Ecco the Dolphin from their watery home. Now, Ecco must search for them through a vast underwater world. Danger and adventure awaits you in Ecco the Dolphin. Use Ecco's sonar to discover hidden caverns and unlock the secrets of the crystal glyphs. Take on schools of ravenous sharks. Discover the mysteries of the deep, save your dolphin family, and protect the world from the Vortex. The fate of the whole world rests on your fins. Over 25 giant underwater levels of fighting action and puzzle-solving. Solve the mystery of the Vortex and the fate of your dolphin family. Knife through the waters and flip above the waves with animated motions created from real dolphins. All the classic gameplay from the original console game now brought to the next-gen world of Xbox 360. [Microsoft]… Expand"}, {"name": "Nicktoons Unite!", "details_link": "https://www.metacritic.com/game/ds/nicktoons-unite!", "publisher": "THQ", "release_date": "Jan 10 2006", "developers": ["Climax Group", "Climax Studios"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Adventure", "General", "General", "General", "Platformer", "3D"], "meta_score": 53, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/0a784de5fa6bd8e1295ff97b47538133-98.jpg", "descriptions": "For the first time ever the greatest Nicktoons villains face off against your favorite characters including SpongeBob SquarePants, Timmy Turner, Jimmy Neutron, and Danny Phantom. Combine their powers to take out the Evil Syndicate, along with the devastating Doomsday device! It’s good vs.For the first time ever the greatest Nicktoons villains face off against your favorite characters including SpongeBob SquarePants, Timmy Turner, Jimmy Neutron, and Danny Phantom. Combine their powers to take out the Evil Syndicate, along with the devastating Doomsday device! It’s good vs. evil where only one set of Nicktoons will prevail. 1-4 player cooperative play featuring SpongeBob SquarePants, Timmy Turner, Jimmy Neutron or Danny Phantom. More than 15 explorable Nicktoons levels, including: Retroville, Dimmsdale, Amity Park and Bikini Bottom. Choose from over 16 upgradeable gadgets and powers. [THQ]… Expand"}, {"name": "Two Thrones", "details_link": "https://www.metacritic.com/game/pc/two-thrones", "publisher": "Strategy First", "release_date": "Feb 10 2004", "developers": ["Paradox Interactive", "Paradox Development Studio"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/37726cd81cddadd0f983a85a61bca34d-98.jpg", "descriptions": "Two Thrones: From Jean D'Arc to Richard III. Two Thrones takes place in the years between 1337 and 1490, in a time where nobility and the church held the power. Noble families in France and England are engaged in an epic war for the control of the Two Thrones of the kingdoms, a battle thatTwo Thrones: From Jean D'Arc to Richard III. Two Thrones takes place in the years between 1337 and 1490, in a time where nobility and the church held the power. Noble families in France and England are engaged in an epic war for the control of the Two Thrones of the kingdoms, a battle that will define the future of the medieval Europe. Play through LAN or the Internet against your friends. Choose between several large nations, including England, France and Burgundy; or control one of the fractions in the War of the Roses. Survive the treacherous political intrigues of medieval politics. Develop your kingdom into an economic, political and military power, but be careful not to alienate the church, nobility, peasants or the merchant class on your way to supremacy. Recruit noble knights with mighty castles, raise large hosts of spearmen to defend your realms and ignore the papal ban on crossbows. Rely upon English longbowmen, or pay silver to recruit Swiss pikers. Experience detailed historical events, which will guide your nation through the dark ages of history towards the renaissance. [Paradox Entertainment]… Expand"}, {"name": "Gorasul: Legacy of the Dragon", "details_link": "https://www.metacritic.com/game/pc/gorasul-legacy-of-the-dragon", "publisher": "JoWooD Entertainment AG", "release_date": "Nov 26 2001", "developers": ["Silver Style"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "General", "General"], "meta_score": 53, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/87f2ec5f4987236426b0117c499f4aea-98.jpg", "descriptions": "The tale, in short, deals with the life of Roszondas. Roszondas was raised by a magical dragon. As he grew up, he obtained the magic and characteristics of his adoptive father. The world of the adolescent Roszondas is about to collapse as it is at war with a demon of another level ofThe tale, in short, deals with the life of Roszondas. Roszondas was raised by a magical dragon. As he grew up, he obtained the magic and characteristics of his adoptive father. The world of the adolescent Roszondas is about to collapse as it is at war with a demon of another level of dimension. [JoWood Productions]… Expand"}, {"name": "Iridion 3D", "details_link": "https://www.metacritic.com/game/game-boy-advance/iridion-3d", "publisher": "Majesco Games", "release_date": "May 29 2001", "developers": ["Shin'en"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 53, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/7118766a9bff2cca603ae075d321cee8-98.jpg", "descriptions": "In the distant regions of our galaxy far beyond the dark limits of the Orion Nebula, a deadly force has been unleashed upon the universe, and is heading straight for Earth. Your Mission - to travel across light-years of uncharted space, to defend the destiny of mankind. With IRIDION 3D,In the distant regions of our galaxy far beyond the dark limits of the Orion Nebula, a deadly force has been unleashed upon the universe, and is heading straight for Earth. Your Mission - to travel across light-years of uncharted space, to defend the destiny of mankind. With IRIDION 3D, battle against legions of Iridion star cruisers high above the Earth's stratosphere, and travel half a universe away to the heart of the IRIDION Star System, where only you can eliminate the Iridion menace.… Expand"}, {"name": "The Last Oricru", "details_link": "https://www.metacritic.com/game/pc/the-last-oricru", "publisher": "Prime Matter", "release_date": "Oct 13 2022", "developers": ["GoldKnights Studio"], "platforms": ["PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 53, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/c6be4b6bdf54093e3ae4c15aa29677c6-98.jpg", "descriptions": "The Last Oricru is a story-driven action RPG, that puts you in the middle of an ongoing conflict between two races, on a partly terraformed planet, isolated from outer space by a protective barrier. Your decisions will bring interesting twists into the gameplay, as you can heavily influenceThe Last Oricru is a story-driven action RPG, that puts you in the middle of an ongoing conflict between two races, on a partly terraformed planet, isolated from outer space by a protective barrier. Your decisions will bring interesting twists into the gameplay, as you can heavily influence the conflict and its outcome. You will experience hundreds of intense fights in a brutal medieval meets sci-fi world, where every decision has its consequences.Level up your hero, improve your skills before facing one of many boss fights and get ready for an unprecedented amount of possibilities.… Expand"}, {"name": "War Rock", "details_link": "https://www.metacritic.com/game/pc/war-rock", "publisher": "Elephant Entertainment", "release_date": "Feb  7 2007", "developers": ["Dream Execution"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 53, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/60b5cca129d201f1053e8c8a1f990046-98.jpg", "descriptions": "War Rock is an online, military, tactical, first-person-shooter featuring state of the art weapons, team or solo based play and unbelievable missions and maps. With five different character classes to master, gamers can play individually or in a team. Players can participate in three modesWar Rock is an online, military, tactical, first-person-shooter featuring state of the art weapons, team or solo based play and unbelievable missions and maps. With five different character classes to master, gamers can play individually or in a team. Players can participate in three modes of gameplay including Close Quarters Combat, Urban Ops and Battlegroup. [K2 Network]… Expand"}, {"name": "Inversion", "details_link": "https://www.metacritic.com/game/xbox-360/inversion", "publisher": "Namco Bandai Games", "release_date": "Jun  5 2012", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 53, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/18e288c570e7f1b06a7da2e40808928c-98.jpg", "descriptions": "Inversion is a third-person co-op shooter that combines hard-hitting, adrenaline-pumping action with a revolutionary gravity manipulation engine. Featuring the Grappler weapon, players manipulate gravity for their own purposes. The Grappler can be used in countless combat situations byInversion is a third-person co-op shooter that combines hard-hitting, adrenaline-pumping action with a revolutionary gravity manipulation engine. Featuring the Grappler weapon, players manipulate gravity for their own purposes. The Grappler can be used in countless combat situations by maneuvering massive objects as shields or projectiles, and moving camped enemies out of concealed cover so they can be blasted away. The Grappler is also a key tool for tactical situations and puzzle solving as players can lift, move, or create cover objects at their whim. The awesome power of gravity is right at players’ fingertips. Additionally, Inversion is one of the first games to feature Havok Destruction which bestows Inversion with massively destructible environments including an elaborate cover system. Set in the near future, the tranquil peace enjoyed by mankind shatters with an unforeseen invasion by an unknown enemy called the Lutadore. Armed to the teeth with futuristic gravity-controlling weapons, the Lutadore easily overrun the city’s defenses. Unbeknownst to all, mysterious anomalies have surfaced in conjunction with the invasion. Random regions in the city have entered zero gravity or have suffered vector changes, throwing the world into topsy-turvy chaos. Assuming the role of Davis Russel, a hotheaded 28-year-old cop, or Leo Delgado, Davis’ neighbor, players embark on a journey through the disorienting war-ravaged, gravity twisted streets of their home town and beyond, to find Davis' missing child. [Namco Bandai Games]… Expand"}, {"name": "Friday the 13th: The Game", "details_link": "https://www.metacritic.com/game/xbox-one/friday-the-13th-the-game", "publisher": "Gun Media", "release_date": "May 26 2017", "developers": ["IllFonic", "Gun Media"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Survival"], "meta_score": 53, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/e7ab1cc2e561e48872201059716b08a9-98.jpg", "descriptions": "Friday the 13th: The Game is a third-person horror, survival game in which players assume the role of a teen counselor, or for the first time ever, Jason Voorhees. You and six other unlucky souls will do everything possible to escape and survive while the most well-known killer in the worldFriday the 13th: The Game is a third-person horror, survival game in which players assume the role of a teen counselor, or for the first time ever, Jason Voorhees. You and six other unlucky souls will do everything possible to escape and survive while the most well-known killer in the world tracks you down and brutally slaughters you. Friday the 13th: The Game will strive to give every single player the tools to survive, escape or even try to take down the man who cannot be killed. Each and every gameplay session will give you an entirely new chance to prove if you have what it takes not only to survive, but to best the most prolific killer in cinema history, a slasher with more kills than any of his rivals. Meanwhile, Jason will be given an array of abilities to track, hunt and kill his prey. Stalk from the shadows, scare your targets and kill them when the time is right in as brutal a fashion as you can imagine. Take control of the legendary killer that is Jason Voorhees and terrify those unfortunate enough to cross your path.… Expand"}, {"name": "PlayStation Move Heroes", "details_link": "https://www.metacritic.com/game/playstation-3/playstation-move-heroes", "publisher": "SCEA", "release_date": "Mar 22 2011", "developers": ["Nihilistic"], "platforms": "PlayStation 3", "genres": ["Action", "Platformer", "General", "Platformer", "3D", "3D"], "meta_score": 53, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/0c5be464f838b641503c1e37f3ef451b-98.jpg", "descriptions": "Heroes On The Move brings together a cast of some of PlayStation's most beloved characters from three of its most iconic franchises - Ratchet & Clank, Jak & Daxter, and Sly Cooper. Together for the first time, PlayStation's legendary heroes Ratchet, Clank, Jak, Daxter, Sly andHeroes On The Move brings together a cast of some of PlayStation's most beloved characters from three of its most iconic franchises - Ratchet & Clank, Jak & Daxter, and Sly Cooper. Together for the first time, PlayStation's legendary heroes Ratchet, Clank, Jak, Daxter, Sly and Bentley, ban together to defeat a villainous duo in this wildly humorous adventure for the PlayStation Move. By using the PlayStation Move motion controller and The PlayStation Move navigation controller, players now have the unique experience of becoming one of their favorite PlayStation characters as they control their every move throughout the game. Players will smash, hurl and shoot their way through imaginative puzzles and challenges as the heroes team up against their new enemies. … Expand"}, {"name": "Knight's Apprentice, Memorick's Adventures", "details_link": "https://www.metacritic.com/game/xbox/knights-apprentice-memoricks-adventures", "publisher": "XS Games", "release_date": "Jun 15 2004", "developers": ["Microids"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 53, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/1/ca50e8cb978c0a40a92427ca4cae2ca3-98.jpg", "descriptions": "Based on famous Arthurian legends, Knight's Apprentice, Memorick's Adventures, tells a story of war, magic, and evil forces. You can explore the game's 19 different levels in four different ways--riding a horse, flying a gryphon, sliding down on a shield, and walking or running. Your hero'sBased on famous Arthurian legends, Knight's Apprentice, Memorick's Adventures, tells a story of war, magic, and evil forces. You can explore the game's 19 different levels in four different ways--riding a horse, flying a gryphon, sliding down on a shield, and walking or running. Your hero's skills evolve constantly as you progress through a variety of environments. Use your battle skills to defeat all 26 types of monsters that await you.… Expand"}, {"name": "BattleBots: Beyond the BattleBox", "details_link": "https://www.metacritic.com/game/game-boy-advance/battlebots-beyond-the-battlebox", "publisher": "Majesco Games", "release_date": "Dec 10 2002", "developers": ["Cave Barn"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/004741cadeebb021c97f73895391332b-98.jpg", "descriptions": "Welcome to BattleBots, the sport of remote-controlled robotic combat. Based on the popular television series, you build your own customized, radio-controlled robots that employ an array of destructive weaponry such as hammers, saws and spikes. Watch the sparks fly as you duke it out inWelcome to BattleBots, the sport of remote-controlled robotic combat. Based on the popular television series, you build your own customized, radio-controlled robots that employ an array of destructive weaponry such as hammers, saws and spikes. Watch the sparks fly as you duke it out in deadly arenas against your friends or one of the 16 actual BattleBots from the T.V. show. This is the ultimate contest of strategy and creativity where the goal is survival.… Expand"}, {"name": "Dragon Ball Z: The Legacy of Goku", "details_link": "https://www.metacritic.com/game/game-boy-advance/dragon-ball-z-the-legacy-of-goku", "publisher": "Infogrames", "release_date": "May 14 2002", "developers": ["Webfoot Technologies"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 53, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/9f1dd4e81a73769a32c43733de2ba076-98.jpg", "descriptions": "Dragon Ball Z: The Legacy of Goku takes you on an incredible journey to protect the universe from the evil Frieza once and for all.  Goku's son has been kidnapped and it's up to you to save him.  Vegeta, Krillin, Piccolo, and King Kai are some of the characters you'll encounter along yourDragon Ball Z: The Legacy of Goku takes you on an incredible journey to protect the universe from the evil Frieza once and for all.  Goku's son has been kidnapped and it's up to you to save him.  Vegeta, Krillin, Piccolo, and King Kai are some of the characters you'll encounter along your quest.  You'll need your melee and ki combat strategies to defeat your enemies.  The future depends on your ability to use your ki blasts, solar flare, and kamehameha attacks.… Expand"}, {"name": "A Game of Thrones: Genesis", "details_link": "https://www.metacritic.com/game/pc/a-game-of-thrones-genesis", "publisher": "Focus Home Interactive", "release_date": "Sep 28 2011", "developers": ["Cyanide"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General", "Historic", "Fantasy", "General"], "meta_score": 53, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/4/45020a4d5d1397992635215d1b33c15f-98.jpg", "descriptions": "A Game of Thrones: Genesis is a new PC strategy game that is adapted from George R.R. Martin's series of best-seller novels \"A Song of Ice and Fire.\""}, {"name": "Bust-A-Move Bash!", "details_link": "https://www.metacritic.com/game/wii/bust-a-move-bash!", "publisher": "Majesco Games", "release_date": "Apr 17 2007", "developers": ["Happy Happening"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 53, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/3/6cef4bc64f626233803de2b37177e8bf-98.jpg", "descriptions": "Bust-A-Move Bash utilizes the unique interactivity of the Wii Remote to bring Bust-A-Move franchise fans a completely new way to experience its puzzle-based game play. Puzzle Mode: play 500 levels across five different puzzle areas. Endless Mode: a challenging test of bubble-bursting skillBust-A-Move Bash utilizes the unique interactivity of the Wii Remote to bring Bust-A-Move franchise fans a completely new way to experience its puzzle-based game play. Puzzle Mode: play 500 levels across five different puzzle areas. Endless Mode: a challenging test of bubble-bursting skill and endurance. Vs. Mode: allows up to 8 players to go head-to-head simultaneously; Shooting Mode: an all-new mode where bubbles come at players from all angles; to handle the non-stop assault, players can use the Wii Remote and Nunchuk Controller together. Bust-A-Move Bash! features 10 different characters, including franchise favorites Bub and Bob as well as many new additions. Players will experience a variety of game modes and options. In addition, a new Hyper option speeds up game play while the Slip feature allows players to connect fired bubbles to similar colors even though their aim may be off. [Nintendo]… Expand"}, {"name": "Spare Parts", "details_link": "https://www.metacritic.com/game/playstation-3/spare-parts", "publisher": "Electronic Arts", "release_date": "Jan 18 2011", "developers": ["EA Bright Light"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "General", "General", "Platformer", "3D"], "meta_score": 53, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/be41de6e81de89103f2c195ba7a9c890-98.jpg", "descriptions": "Spare Parts tells the story of courageous robots Mar-T and Chip, who find themselves dumped out with the trash on a strange planet. Working together in co-op mode (either local or online), the mechanical duo must find a way to repair an abandoned space ship and escape the planet before evilSpare Parts tells the story of courageous robots Mar-T and Chip, who find themselves dumped out with the trash on a strange planet. Working together in co-op mode (either local or online), the mechanical duo must find a way to repair an abandoned space ship and escape the planet before evil Lord Krung can dispatch his henchmen to destroy them. Searching the hostile environments for ship parts and currency, Mar-T and Chip will also collect upgradable action parts – such as Rocket Boots -  to unlock new abilities that will aid them as they rescue other stranded robots, and battle countless enemies including the relentless Krofax troopers, hostile spider monkeys and even a Super Huge Mega Laser!… Expand"}, {"name": "Adam's Venture: Origins", "details_link": "https://www.metacritic.com/game/playstation-4/adams-venture-origins", "publisher": "Soedesco", "release_date": "Apr  1 2016", "developers": ["Engine Software", "Vertigo Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Point-and-Click", "Linear"], "meta_score": 53, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/0395f532200fe77c0fd67d77fa9309fb-98.jpg", "descriptions": "Head out on a bold adventure in Adam’s Venture: Origins. Set in the roaring 20’s, in Adam’s Venture: Origins you will explore ancient ruins, and recover mysterious artifacts. Together with your trusted accomplice Evelyn, you will have to outsmart the evil Clairvaux company."}, {"name": "Tom Clancy's Splinter Cell 3D", "details_link": "https://www.metacritic.com/game/3ds/tom-clancys-splinter-cell-3d", "publisher": "Ubisoft", "release_date": "Apr 10 2011", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 53, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/33383273c20b0596a73c25f3eaeaafd9-98.jpg", "descriptions": "As Sam Fisher, Third Echelon's most skilled Splinter Cell operative, you are assigned to execute a hazardous series of operations to investigate and eliminate a new source of information attacks originating in North Korea. At your disposal is a lethal array of tactics ranging from CombatAs Sam Fisher, Third Echelon's most skilled Splinter Cell operative, you are assigned to execute a hazardous series of operations to investigate and eliminate a new source of information attacks originating in North Korea. At your disposal is a lethal array of tactics ranging from Combat Knife techniques to experimental prototype weapons skills and more-radical hand-to-hand techniques such as the Inverted Chokehold. Experience the intensity of acting as a lone operative fighting tomorrow's threats in the field and of cooperating online with a partner to accomplish crucial missions.… Expand"}, {"name": "Minecraft: Story Mode - Episode 2: Assembly Required", "details_link": "https://www.metacritic.com/game/playstation-4/minecraft-story-mode---episode-2-assembly-required", "publisher": "Telltale Games", "release_date": "Oct 27 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Adventure", "General", "Point-and-Click", "Linear"], "meta_score": 53, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/5/0ffebbc026b51c11077a5e8abd47a65d-98.jpg", "descriptions": "Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon,Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your crew stumbles on something dreadful. Terror is unleashed, and your only hope is to track down the “Order of the Stone”, a fabled group of adventurers who slew the legendary Ender Dragon. But where are they? In a race against time, you will travel across the over-world, through the Nether, to The End, and beyond. [Telltale Games]… Expand"}, {"name": "Dungeon Fighter Live: Fall of Hendon Myre", "details_link": "https://www.metacritic.com/game/xbox-360/dungeon-fighter-live-fall-of-hendon-myre", "publisher": "Microsoft Game Studios", "release_date": "Jul 13 2012", "developers": ["Nexon"], "platforms": "Xbox 360", "genres": ["Role-Playing", "Massively Multiplayer Online", "Action RPG", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 53, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/cb39c3cd75284f8d0fac54582640888a-98.jpg", "descriptions": "Dungeon Fighter Online is a side-scrolling action fighting game featuring role-playing elements, five unique character classes, and player versus player."}, {"name": "Bound by Flame", "details_link": "https://www.metacritic.com/game/playstation-4/bound-by-flame", "publisher": "Focus Home Interactive", "release_date": "May  6 2014", "developers": ["Spiders"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 53, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/0c3f07c7fc4e08e80722451457e7d27c-98.jpg", "descriptions": "You are a mercenary possessed by a flame demon in a desperate world ravaged by seven Ice Lords and their Dead-Army. In this RPG where all your choices lead to consequences, you will have to choose between unleashing the powers of the beast within and rejecting the demonic influence thatYou are a mercenary possessed by a flame demon in a desperate world ravaged by seven Ice Lords and their Dead-Army. In this RPG where all your choices lead to consequences, you will have to choose between unleashing the powers of the beast within and rejecting the demonic influence that wants to claim your humanity. … Expand"}, {"name": "Pokemon Battle Revolution", "details_link": "https://www.metacritic.com/game/wii/pokemon-battle-revolution", "publisher": "Nintendo", "release_date": "Jun 25 2007", "developers": ["Genius Sonority Inc."], "platforms": "Wii", "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 53, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/e5d46f618e81a0a560262969816410d6-98.jpg", "descriptions": "Using the wireless connection between the DS and Wii, owners of Pokemon Diamond or Pokemon Pearl can use their handheld as a controller in playing Pokemon Battle Revolution. Players can give orders to their Pokemons using the DS, and then watch the result of the battle on the TV screen.Using the wireless connection between the DS and Wii, owners of Pokemon Diamond or Pokemon Pearl can use their handheld as a controller in playing Pokemon Battle Revolution. Players can give orders to their Pokemons using the DS, and then watch the result of the battle on the TV screen. Having a DS isn't mandatory in playing Pokémon Battle Revolution, although it broadens the range of strategy when challenging other players. Using the DS lets you set up your Pokemon on the handheld's dual LCD rather than the TV screen, making it somewhat of a guessing game to figure out what the opponent player is up to. Aside from being the first Wii game to make use of the DS-Wii connectivity, Pokemon Battle Revolution is the first Wii game to be playable online through Nintendo's Wi-Fi connection service. [GameSpot]… Expand"}, {"name": "Speedball 2 HD", "details_link": "https://www.metacritic.com/game/pc/speedball-2-hd", "publisher": "Mastertronic", "release_date": "Dec  5 2013", "developers": ["Vivid Games"], "platforms": "PC", "genres": ["Sports", "General", "General", "Team", "Futuristic"], "meta_score": 53, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/8/6a31d7ad8dbf081d1f82b2650bb72aa8-98.jpg", "descriptions": "Speedball 2 HD is a modern reincarnation on the classic, futuristic cyberpunk sports game Speedball, originally developed by the Bitmap Brothers and first released for the Atari ST in 1990. A brutal mix of handball and ice hockey placed at break-neck pace. Now Tower Studios, Vivid Games andSpeedball 2 HD is a modern reincarnation on the classic, futuristic cyberpunk sports game Speedball, originally developed by the Bitmap Brothers and first released for the Atari ST in 1990. A brutal mix of handball and ice hockey placed at break-neck pace. Now Tower Studios, Vivid Games and The Bitmap Brothers have created a glorious fusion of classic gameplay and modern technology to launch this game into the 21st century.… Expand"}, {"name": "Disney Sing It", "details_link": "https://www.metacritic.com/game/xbox-360/disney-sing-it", "publisher": "Disney Interactive Studios", "release_date": "Oct 21 2008", "developers": ["Zoe Mode"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 53, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/0ee91d67bf568d7e05129a5b677d72d0-98.jpg", "descriptions": "Best out to some of today's hippest tunes and have a blast with your friends and favorite Disney stars. Sing to 35 chart-topping tunes including hits from Camp Rock, High School Musical, Hanna Montana, Cheetah Girls, as well as hits from Aly & AJ, Corbin Blue, Everlife, Jordan Pruitt, andBest out to some of today's hippest tunes and have a blast with your friends and favorite Disney stars. Sing to 35 chart-topping tunes including hits from Camp Rock, High School Musical, Hanna Montana, Cheetah Girls, as well as hits from Aly & AJ, Corbin Blue, Everlife, Jordan Pruitt, and more. Compete with and against friends in numerous multiplayer modes, including Duet, Versus, and Team Play. [Disney]… Expand"}, {"name": "Nicktoons Unite!", "details_link": "https://www.metacritic.com/game/playstation-2/nicktoons-unite!", "publisher": "THQ", "release_date": "Oct 26 2005", "developers": ["THQ"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Adventure", "General"], "meta_score": 53, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/c2a2872aebcaa107970a246770a848d5-98.jpg", "descriptions": "For the first time ever the greatest Nicktoons villains face off against your favorite characters including SpongeBob SquarePants, Timmy Turner, Jimmy Neutron, and Danny Phantom. Combine their powers to take out the Evil Syndicate, along with the devastating Doomsday device. It’s good vs.For the first time ever the greatest Nicktoons villains face off against your favorite characters including SpongeBob SquarePants, Timmy Turner, Jimmy Neutron, and Danny Phantom. Combine their powers to take out the Evil Syndicate, along with the devastating Doomsday device. It’s good vs. evil where only one set of Nicktoons will prevail. 1-4 player cooperative play featuring SpongeBob SquarePants, Timmy Turner, Jimmy Neutron or Danny Phantom. More than 15 explorable Nicktoons levels, including: Retroville, Dimmsdale, Amity Park and Bikini Bottom. Choose from over 16 upgradeable gadgets and powers. [THQ]… Expand"}, {"name": "Natural Doctrine", "details_link": "https://www.metacritic.com/game/playstation-4/natural-doctrine", "publisher": "NIS America", "release_date": "Sep 30 2014", "developers": ["Kadokawa"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General", "Fantasy", "Tactics"], "meta_score": 53, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/3154b7cafee53b7143656e696bf4b22b-98.jpg", "descriptions": "Natural Doctrine a challenging strategy title which features cross-play and cross-save. The games sets out to test your ability to conquer the evils that lurk in the sprawling networks of mines and ruins in the areas surrounding the fortress city of Feste."}, {"name": "The Assembly", "details_link": "https://www.metacritic.com/game/playstation-4/the-assembly", "publisher": "nDreams", "release_date": "Oct 13 2016", "developers": ["nDreams"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Miscellaneous", "General"], "meta_score": 53, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/52542a29dbffef0c7eb123bac94c58bf-98.jpg", "descriptions": "The Assembly is a first-person interactive drama for mature audiences, created from the ground up for virtual reality headsets.  An experience with two sides to everything, where the truth is never clear, and a question is always left open: When does the end justify the means?"}, {"name": "Tony Hawk: Shred", "details_link": "https://www.metacritic.com/game/xbox-360/tony-hawk-shred", "publisher": "Activision", "release_date": "Oct 26 2010", "developers": ["Robomodo"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skating", "Skateboarding", "Skate / Skateboard"], "meta_score": 53, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/866895a53fea7147c7670c10cbb53bd4-98.jpg", "descriptions": "Tony Hawk and Robomodo are reuniting on a second game to use the Tony Hawk: Ride skateboard."}, {"name": "Carmen Sandiego: The Secret of the Stolen Drums", "details_link": "https://www.metacritic.com/game/playstation-2/carmen-sandiego-the-secret-of-the-stolen-drums", "publisher": "Bam Entertainment", "release_date": "Sep  8 2004", "developers": ["Artificial Mind and Movement"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/7a744b14bec659afdfd24a8cf0820555-98.jpg", "descriptions": "The last descendant of an African King reveals an ancient secret with his dying words: Deep in the jungles of Rwanda lies a hidden temple containing a great diamond which possesses the knowledge of all nations. The map to the temple has been etched onto the skins of eight drums scatteredThe last descendant of an African King reveals an ancient secret with his dying words: Deep in the jungles of Rwanda lies a hidden temple containing a great diamond which possesses the knowledge of all nations. The map to the temple has been etched onto the skins of eight drums scattered throughout the world. All eight drums must be re-united to open the temple. But beware, the drums are protected by mysterious powers, and legend has it that elemental spirits guard the treasure! Meanwhile, priceless African antiquities are turning up missing from museums all over the world. Missing or stolen? The M.O. looks hauntingly familiar? The A.C.M.E. team recognizes Carmen Sandiego?s infamous signature. Now, join A.C.M.E. agent-in-training, Cole Gannon, along with Jules Argent and Shadow Hawkins, in an all-new action-adventure on the trail of Carmen Sandiego, the world?s greatest thief. This case will take Cole around the world; from a museum in New York, to the beaches of New Zealand, to the Incan ruins of Machu Picchu, and that's just the beginning. While on the case, Cole will have to use acrobatics, stealth, martial arts, and most of all, his wit, to stop Carmen from unearthing the drums and making off with the lost treasure! [BAM! Entertainment]… Expand"}, {"name": "Classic NES Series: Pac-Man", "details_link": "https://www.metacritic.com/game/game-boy-advance/classic-nes-series-pac-man", "publisher": "Nintendo", "release_date": "Jun  2 2004", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 53, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Now you can find out what made Pac-Man an icon of the 1980s and an icon of video game culture. In this NES Classics game, Pac-Man gets to do what he does best: chomp pellets and ghosts. You'll maneuver Pac-Man through a maze filled with pellets, fruit, power pellets, and ghosts. YourNow you can find out what made Pac-Man an icon of the 1980s and an icon of video game culture. In this NES Classics game, Pac-Man gets to do what he does best: chomp pellets and ghosts. You'll maneuver Pac-Man through a maze filled with pellets, fruit, power pellets, and ghosts. Your enemies--Blinky, Pinky, Clyde, and Inky--aren't very smart, but they move faster as the game progresses. Two players can take turns mastering the maze, either on the same Game Pak or through the Game Boy Advance Game Link Cable.… Expand"}, {"name": "Purge", "details_link": "https://www.metacritic.com/game/pc/purge", "publisher": "Freeform Interactive LLC", "release_date": "Apr 15 2003", "developers": ["Freeform Interactive LLC"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy"], "meta_score": 53, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/c0de04158658f7b68773cebd7fc3d083-98.jpg", "descriptions": "Purge is an online-only computer game. It is a hybrid First-Person-Shooter / Role-Playing-Game set in the near future accounting a war between the diametrically opposed forces of science-fiction (the Order) and fantasy (the Chosen). Technology versus magic. Science versus religion. [FreeformPurge is an online-only computer game. It is a hybrid First-Person-Shooter / Role-Playing-Game set in the near future accounting a war between the diametrically opposed forces of science-fiction (the Order) and fantasy (the Chosen). Technology versus magic. Science versus religion. [Freeform Interactive]… Expand"}, {"name": "Blade II", "details_link": "https://www.metacritic.com/game/xbox/blade-ii", "publisher": "Activision", "release_date": "Sep  2 2002", "developers": ["Mucky Foot Productions"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 53, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/0074e3b11cc7c0261979a048fb03d318-98.jpg", "descriptions": "For countless generations there was very little to stand between vampires and their human prey--until now. In Blade II, you are a vampire hunter who possesses all the strengths of a vampire, and none of its weaknesses. Skilled in martial arts, guns, and swordplay, you must protect humansFor countless generations there was very little to stand between vampires and their human prey--until now. In Blade II, you are a vampire hunter who possesses all the strengths of a vampire, and none of its weaknesses. Skilled in martial arts, guns, and swordplay, you must protect humans from the hungering darkness. Keep the evil forces at bay with your 360-degree combat system and unstoppable rage powers. High-tech weaponry, destructive rage abilities, and over-the-top finishing moves turn every enemy encounter into an action-packed bloodbath.… Expand"}, {"name": "Cruis'n Velocity", "details_link": "https://www.metacritic.com/game/game-boy-advance/cruisn-velocity", "publisher": "Midway", "release_date": "Nov 30 2001", "developers": ["Graphic State"], "platforms": "Game Boy Advance", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 53, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/494195814ca9382c6b64eb8412343185-98.jpg", "descriptions": "Grab the steering wheel of 11 different speed machine. Race through 14 tracks including Las Vegas and Mars. Choose from three modes of gameplay - Cruis'n Cup, Championship and Freestyle mode. Challenge up to four of your friends using the Game Boy Advance Game Link Cable."}, {"name": "Rune: Viking Warlord", "details_link": "https://www.metacritic.com/game/playstation-2/rune-viking-warlord", "publisher": "Take-Two Interactive", "release_date": "Jul 28 2001", "developers": ["Human Head Studios"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 53, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/b8c25f4416f150e24ee0452af010663a-98.jpg", "descriptions": "Feel like making a bloody Viking mess?  Utilizing the Unreal engine, R:VW casts you as Ragnar, the Viking warrior who wields his massive battle axe for justice against several defecting rogue members of his clan."}, {"name": "Dark Angel:  Vampire Apocalypse", "details_link": "https://www.metacritic.com/game/playstation-2/dark-angel-vampire-apocalypse", "publisher": "Metro3D", "release_date": "Jul  8 2001", "developers": ["Metro3D"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 53, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/5ed7d518a5eafc4ad6214294d42e435f-98.jpg", "descriptions": "In this action RPG with a reported 400 hours of gameplay, assume the role of Anna, an Avatar, who must protect three towns against the Shadow Lord and his three armies of monsters: The Undead, The Forgotten, and The Mutants."}, {"name": "FaceBreaker", "details_link": "https://www.metacritic.com/game/playstation-3/facebreaker", "publisher": "EA Sports", "release_date": "Sep  3 2008", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 53, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/8/45ca61bc1b6a2175fe6a9e775705070e-98.jpg", "descriptions": "Created by the same team that developed Fight Night Round 3, FaceBreaker offers irreverent fun, immersive gameplay and eye-popping stylized graphics. In this in-your-face, arcade world full of ego-wielding characters, each boxer comes to life with unique attributes and distinct personalCreated by the same team that developed Fight Night Round 3, FaceBreaker offers irreverent fun, immersive gameplay and eye-popping stylized graphics. In this in-your-face, arcade world full of ego-wielding characters, each boxer comes to life with unique attributes and distinct personal style, including Romeo, a Latin lover known for his pelvic thrusts, and Molotov, an oversized Russian demolitions expert with a penchant for fighting dirty. Add a little personal motivation to your fight by uploading a photo of your face to create a realistic likeness using Photo Game Face, and go toe-to-toe with a real-life friend or foe. Laugh out loud as you pummel your opponent with a barrage of blows to the face and watch in satisfaction as your progress is illustrated by real-time facial deformation. With haymakers, face shots and body blows, wait for the right moment to drop a super punch to make your presence known. Taunt your adversaries and flaunt your talent, by tying one hand behind your back to add ultimate humiliation to your bout. In FaceBreaker, it just feels good to rearrange your opponent's face. [Electronic Arts]… Expand"}, {"name": "Loading Human: Chapter 1", "details_link": "https://www.metacritic.com/game/playstation-4/loading-human-chapter-1", "publisher": "Maximum Games", "release_date": "Oct 13 2016", "developers": ["Untold Games"], "platforms": ["PC", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 53, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/87317ccc63da98d45d1e1dba8ad80646-98.jpg", "descriptions": "Engage with each aspect of your environment and develop complex relationships. Travel to otherworldly and futuristic locations on the South Pole. Hear your character's thoughts, see his hands, and move your head to view your surroundings from his point of view for a highly immersiveEngage with each aspect of your environment and develop complex relationships. Travel to otherworldly and futuristic locations on the South Pole. Hear your character's thoughts, see his hands, and move your head to view your surroundings from his point of view for a highly immersive experience. Make difficult decisions and solve dilemmas that will move the story forward.… Expand"}, {"name": "Fairytale Fights", "details_link": "https://www.metacritic.com/game/playstation-3/fairytale-fights", "publisher": "Playlogic", "release_date": "Oct 27 2009", "developers": ["Playlogic", "The Game Factory"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General", "Platformer", "3D"], "meta_score": 53, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/66ea8a2de07d8c41eab6d3201ad3deaf-98.jpg", "descriptions": "Play your favorite fairytale character, regain your lost fame and save the fairytale world from certain doom! Luckily, a vast variety of deadly weapons lie around, which you can use to shoot and carve up evil villains, bloodthirsty rabbits and many more terribly cutesy characters roaming thePlay your favorite fairytale character, regain your lost fame and save the fairytale world from certain doom! Luckily, a vast variety of deadly weapons lie around, which you can use to shoot and carve up evil villains, bloodthirsty rabbits and many more terribly cutesy characters roaming the lands - and this is where the fun begins! Fight your opponents to the death and fulfill challenging quests while leaving behind a big trail of blood! With Playlogic's unique \"Dynamic Slicing\" technology, players have the ability to slice up an enemy in any way they like, using intuitive controls. In addition, the game uses the tested powers of the Unreal 3 engine. [Playlogic]… Expand"}, {"name": "Obscure: The Aftermath", "details_link": "https://www.metacritic.com/game/wii/obscure-the-aftermath", "publisher": "Ignition Entertainment", "release_date": "Mar 25 2008", "developers": ["Hydravision"], "platforms": ["PC", "Wii"], "num_players": "1-2 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 53, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/4976209071bd004f55521d8943834e94-98.jpg", "descriptions": "(Also known as \"Obscure II\")  Two years ago, at Leafmore High, a group of young teenagers were trapped inside their school and hunted by monsters that had been released by the maniac headmaster. Some of them survived that terrible night, while others perished. Now, the survivors have picked(Also known as \"Obscure II\")  Two years ago, at Leafmore High, a group of young teenagers were trapped inside their school and hunted by monsters that had been released by the maniac headmaster. Some of them survived that terrible night, while others perished. Now, the survivors have picked up their lives and joined college. But all is not right on Fallcreek University; strange black flowers have suddenly sprung up everywhere on the campus. While experimenting with these flowers in class, a dangerous substance is discovered that induces strange but vivid dreams. But a handful of students find out that there is more to the flowers than anyone could have expected; when the seeds finally germinate, a bad trip suddenly turns into a horrible reality... Features 6 charismatic characters with unique skills; unique coop mode: second player can join in at any time; highly detailed and rich 3D environment; find clues and solve various rddles and mysteries; and a vast variety of weapons and horrifying monsters. [Playlogic]… Expand"}, {"name": "Buildings Have Feelings Too!", "details_link": "https://www.metacritic.com/game/pc/buildings-have-feelings-too!", "publisher": "Merge Games", "release_date": "Apr 22 2021", "developers": ["Blackstaff Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/eb284135242b144ca999e0852067c960-98.jpg", "descriptions": "An exciting new city-management/puzzle game about buildings and the city they inhabit. You must grow your city to a bustling metropolitan centre with an array of shops, offices, entertainment facilities and amenities, to help your buildings thrive; or risk them being demolished forever."}, {"name": "Necromunda: Underhive Wars", "details_link": "https://www.metacritic.com/game/pc/necromunda-underhive-wars", "publisher": "Focus Home Interactive", "release_date": "Sep  7 2020", "developers": ["Rogue Factor"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 53, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/6e3eaf5b321b1068f1393553a6ab7d56-98.jpg", "descriptions": "Deep below the nightmarish, polluted hive cities of Necromunda, in the twisted, vertiginous, dark tunnels of the Underhive, rival gangs fight to the bitter end for personal power, wealth, survival and the honour of their Houses. Only the strongest survive. Lead, customize, and grow yourDeep below the nightmarish, polluted hive cities of Necromunda, in the twisted, vertiginous, dark tunnels of the Underhive, rival gangs fight to the bitter end for personal power, wealth, survival and the honour of their Houses. Only the strongest survive. Lead, customize, and grow your gangs of Escher, Goliath, and Orlock. Specialize each member and send them to battle in hazardous dystopian environments. Exploit the terrain in tactical gunfights: climb raised walkways to take advantage, set traps, and ambush foes to force them into bloody melee engagements. Learn new skills, loot equipment and bring your evolved gang to 4-player online gang fights.… Expand"}, {"name": "Monopoly for Nintendo Switch", "details_link": "https://www.metacritic.com/game/switch/monopoly-for-nintendo-switch", "publisher": "Ubisoft", "release_date": "Oct 31 2017", "developers": ["Asobo Studio", "Engine Software"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Stadia", "Xbox 360", "Xbox One", "Switch"], "num_players": "Up to 6 ", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 53, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/9b00ad3d64ba1e2640791f1fe4f4ddf8-98.jpg", "descriptions": "Its MONOPOLY for a new era! Play the classic game and watch the board come to life! A full 3D city at the center of the board lives and evolves as you play. You own a miniature world that will interact with your progression throughout the game and celebrate your achievements. Play the wayIts MONOPOLY for a new era! Play the classic game and watch the board come to life! A full 3D city at the center of the board lives and evolves as you play. You own a miniature world that will interact with your progression throughout the game and celebrate your achievements. Play the way you want - you can change the rules and adapt them to your playing style. Take and display photos at key moments for an amplified social gaming experience. Monopoly PLUS raises the classic game to a new level! The downloadable version of this game supports English, French, Italian, German, Spanish, Danish, Dutch, Finnish, Norwegian, Polish, Portuguese, Russian, Swedish, Turkish, Korean, Chinese.… Expand"}, {"name": "Kill Strain", "details_link": "https://www.metacritic.com/game/playstation-4/kill-strain", "publisher": "SCEA", "release_date": "Jul 12 2016", "developers": ["SCEA San Diego Studios"], "platforms": "PlayStation 4", "genres": ["Action", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 53, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/338448d10c9d2ff8c2b2ca1519a8887a-98.jpg", "descriptions": "Kill Strain is a top-down, competitive twin-stick action shooter with a monumental twist where three teams are pitted against each other for domination. Featuring innovative 5v5v2 gameplay, two teams of five players battle to contain-and-control a mysterious and powerful energy sourceKill Strain is a top-down, competitive twin-stick action shooter with a monumental twist where three teams are pitted against each other for domination. Featuring innovative 5v5v2 gameplay, two teams of five players battle to contain-and-control a mysterious and powerful energy source codenamed 'The Strain' that has been discovered in research facilities. The humans are not alone in these remote locations, as two additional players take on the roles of mutants. Endowed with additional abilities when in contact with 'TheStrain', the mutant team wreaks havoc on the humans to spread 'The Strain' further on the field; turning humans into mutants along the way and creating a more powerful force.… Expand"}, {"name": "Ragnarok DS", "details_link": "https://www.metacritic.com/game/ds/ragnarok-ds", "publisher": "XSEED Games", "release_date": "Feb 16 2010", "developers": ["TOSE", "GungHo"], "platforms": "DS", "num_players": "Up to 3 ", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 53, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/e1dcc0b5246fb294a2b45ce69338e375-98.jpg", "descriptions": "Players step into the roll of young Ales as he steps into the world in search of adventure with the goal of eventually starting his own Guild. It is not long before this young rookie adventurer is propelled down a path toward danger, excitement, and a heroine in distress. Throughout hisPlayers step into the roll of young Ales as he steps into the world in search of adventure with the goal of eventually starting his own Guild. It is not long before this young rookie adventurer is propelled down a path toward danger, excitement, and a heroine in distress. Throughout his travels Ales encounters individuals who help in his quest for fortune and fame, as these friends will become invaluable new allies as they join his party. [XSEED Games]… Expand"}, {"name": "Super Monkey Ball Adventure", "details_link": "https://www.metacritic.com/game/playstation-2/super-monkey-ball-adventure", "publisher": "Sega", "release_date": "Aug  1 2006", "developers": ["TT Games"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 53, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/686e117b6ce5db311c4923aced1c7371-98.jpg", "descriptions": "Adventurers discover that in Super Monkey Ball Adventure their monkey balls now have a whole host of new abilities, including sticking to walls, hovering and the ability to become invisible. Super Monkey Ball Adventure also contains 50 new puzzle levels and six new party games to challengeAdventurers discover that in Super Monkey Ball Adventure their monkey balls now have a whole host of new abilities, including sticking to walls, hovering and the ability to become invisible. Super Monkey Ball Adventure also contains 50 new puzzle levels and six new party games to challenge gamers of all ages. Players can select Aiai, Meemee, Gongon, or Baby to adventure their way through five different Monkey Ball Kingdoms to complete quests by solving puzzles and ultimately uniting the feuding Monkey Kingdoms. The original Monkey Ball characters of Aiai, Meemee, Gongon & Baby are back. They are joined by a host of new characters, including a Prince and Princess, who are being kept apart by a feud between their kingdoms. The couple run away to Jungle Island where they enlist the help of the Super Monkey Ball gang, to unite the feuding Monkey Kingdoms and defeat the Naysayers who have sucked all the joy from the Monkey Ball world. [Sega]… Expand"}, {"name": "Pirates: The Key of Dreams", "details_link": "https://www.metacritic.com/game/wii/pirates-the-key-of-dreams", "publisher": "Oxygen Interactive", "release_date": "Jul 21 2008", "developers": ["Oxygen Interactive"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "General", "General"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/ca60c8d21bbfc27141b39c6080433f1a-98.jpg", "descriptions": "[WiiWare]  Pirates: The Key of Dreams is a frantic nautical shoot-’em-up. Sail your way across the Caribbean, cannons blazing, looting booty, running blockades and ultimately battling Blackbeard himself. The player takes control of a navy captain sent deep undercover as a ruthless pirate in[WiiWare]  Pirates: The Key of Dreams is a frantic nautical shoot-’em-up. Sail your way across the Caribbean, cannons blazing, looting booty, running blockades and ultimately battling Blackbeard himself. The player takes control of a navy captain sent deep undercover as a ruthless pirate in order to seek out and retrieve the Key of Dreams, a valuable and dangerous cursed artifact. Rescue castaways to bolster your ship’s crew, gaining performance increases to your navigation, weaponry, structural integrity and cartography skills. Play against three of your scurvy friends or A.I. opponents in pitched multiplayer battles over 35 levels, set in seven themed environments. [Oxygen Games]… Expand"}, {"name": "Dragon Ball: The Breakers", "details_link": "https://www.metacritic.com/game/pc/dragon-ball-the-breakers", "publisher": "Bandai Namco Games", "release_date": "Oct 14 2022", "developers": ["Dimps Corporation"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "General"], "meta_score": 53, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/17a4c4b46622df93d49c44c491bc0124-98.jpg", "descriptions": "Caught out by an unexpected temporal phenomenon, seven ordinary citizens find themselves stranded in a Temporal Seam; they share their imprisonment with a Raider, a menacing enemy from another timeline with overwhelming power.Their only hope for survival is to break out of the TemporalCaught out by an unexpected temporal phenomenon, seven ordinary citizens find themselves stranded in a Temporal Seam; they share their imprisonment with a Raider, a menacing enemy from another timeline with overwhelming power.Their only hope for survival is to break out of the Temporal Seam with the Super Time Machine but the Raider is on their backs and getting stronger minute-by-minute.DRAGON BALL: THE BREAKERS is a 1-on-7 online asymmetrical action game in which a band of seven everyday humans tries to survive the Raider (a classic DRAGON BALL rival such as Cell and Frieza) who will hunt and evolve into an unstoppable force.… Expand"}, {"name": "Toribash: Violence Perfected", "details_link": "https://www.metacritic.com/game/wii/toribash-violence-perfected", "publisher": "Nabi Studios", "release_date": "Jul 12 2010", "developers": ["Nabi Studios"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 53, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/da4570071030add9ab7e28ba655268b6-98.jpg", "descriptions": "[WiiWare]  Toribash is an online fighting game where you make all the moves. Use precision motion controls to create any move you want – the only limit is your imagination. Manipulate your fighter's joints for maximum impact and take out your opponents with precise hits. Boost your joints[WiiWare]  Toribash is an online fighting game where you make all the moves. Use precision motion controls to create any move you want – the only limit is your imagination. Manipulate your fighter's joints for maximum impact and take out your opponents with precise hits. Boost your joints for added speed and strength to hit harder, then grab your opponents and slam them to the ground. Fight online and challenge players around the world using Nintendo Wi-Fi Connection (broadband Internet access required). Want to make your own fight movies? Just jump into the replay editor. You can enter replays at any point in time and review your fight to catch that move you missed. When you're done, share with your buddies through WiiConnect24.… Expand"}, {"name": "X-Men: The Official Game", "details_link": "https://www.metacritic.com/game/xbox/x-men-the-official-game", "publisher": "Activision", "release_date": "May 16 2006", "developers": ["Z-Axis", "Ltd."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 53, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/a2dae7dc3027e66a5009b386ac6d8208-98.jpg", "descriptions": "Master the power of the X-Men--Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms asMaster the power of the X-Men--Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms as lightning-fast Iceman. For even more power, utilize fury and adrenaline modes. Become a part of the X-Men movie universe--Embark on a globe-spanning conflict featuring every element of the X-Men universe--from favorite villains to famous locations such as Alkali Lake, plus the voices and likenesses of key actors from the films. Battle fierce enemies, join forces with comrades--Face off against movie villains such as Pyro, Magneto and Sabretooth, plus added foes like legions of Sentinels. Storm, Colossus and Cyclops join forces with you in gameplay that includes melee fighting, stealth-style action and time-based missions.… Expand"}, {"name": "Has-Been Heroes", "details_link": "https://www.metacritic.com/game/switch/has-been-heroes", "publisher": "GameTrust", "release_date": "Mar 28 2017", "developers": ["Frozenbyte", "Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 53, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/71e67b45ffe81322a5f8bc27df1285de-98.jpg", "descriptions": "Embark on an epic journey with the Has-Been Heroes, a group of legendary champions once celebrated throughout the kingdom - almost forgotten until the King has one more quest, the most epic of them all:\r TO TAKE THE TWIN PRINCESSES TO SCHOOL!\r\n\r\nKey features:\r\n\r\n* Meet the epic band ofEmbark on an epic journey with the Has-Been Heroes, a group of legendary champions once celebrated throughout the kingdom - almost forgotten until the King has one more quest, the most epic of them all:\r TO TAKE THE TWIN PRINCESSES TO SCHOOL!\r Key features:\r * Meet the epic band of heroes as the young and eager Rogue, joining the company of the wise monk Metacles, the giant-wrestling warrior Crux... wait until you meet the others, incl. the Anthropologist turned Mexican Wrestler, the ever-vigilant and paranoid Bodyguard, and many more!\r * Unlock and collect hundreds of game-changing items and spells, boosting the heroes' powers and making each run unique!\r * Combine spells for devastating effects, learning the power of magic as you gain more elements.\r * Face countless monsters, each bigger and more menacing than the next. Can you wipe out the army of evil led by the Great Ghoul?\r * In roguelike fashion, die and try again - choose your heroes wisely and prepare for battle!… Expand"}, {"name": "Teenage Mutant Ninja Turtles 3: Mutant Nightmare", "details_link": "https://www.metacritic.com/game/playstation-2/teenage-mutant-ninja-turtles-3-mutant-nightmare", "publisher": "Konami", "release_date": "Nov  1 2005", "developers": ["KCE Studios"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 53, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/951139a08c751201b925e47751c957db-98.jpg", "descriptions": "TMNT3 puts more of a focus on teamwork, character development and control than any other console Turtles game to date. Gamers can play as their favorite Turtle alone or with up to three friends, earning experience points along the way as they slash and bash Foot Ninjas and powerful,TMNT3 puts more of a focus on teamwork, character development and control than any other console Turtles game to date. Gamers can play as their favorite Turtle alone or with up to three friends, earning experience points along the way as they slash and bash Foot Ninjas and powerful, well-known bosses from the TMNT universe. These experience points allow players to improve and evolve their Turtles’ traits and abilities for more varied, powerful attacks and moves. The Ninja Scroll System is another new feature on TMMT3. Being able to select which ninja scrolls to use allows the Turtles to use various special abilities strategically. Cooperative play lies at the heart of TMNT3 and gamers who team up with friends for multiplayer action are rewarded with exclusive features such as Cooperative Attack for even more shell shocking damage to enemies. The effect of this attack changes depending on the number of players working together (between 2-4 players). For even greater control, TMNT3 features a new combat system called the Target Attack system that lets gamers play more instinctively and strategically. With the Target Attack system, players will be able to lock onto specific enemies and block, dodge or counter attack accordingly for smoother and more maneuverable combat. Story Mode can be played with 1-4 players. Even when you have less than 4 players to play, the other Turtles will be at your side, controlled through AI. All the Turtles can participate in Cooperative Attack to beat enemies and players can give commands to the AI. [Konami]… Expand"}, {"name": "Hover", "details_link": "https://www.metacritic.com/game/switch/hover", "publisher": "Fusty Game", "release_date": "Sep 20 2018", "developers": ["Fusty Game"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 16 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 53, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/14d8e8e9fe13c7df5033d79976687d30-98.jpg", "descriptions": "Hover is a fast-paced single and multiplayer Parkour game in a futuristic 3D Open World.The game takes place in ECP17, a high-tech city also called Hover City by its inhabitants and located on a distant planet. The Great Admin cut the communication with the Galactic Union and established aHover is a fast-paced single and multiplayer Parkour game in a futuristic 3D Open World.The game takes place in ECP17, a high-tech city also called Hover City by its inhabitants and located on a distant planet. The Great Admin cut the communication with the Galactic Union and established a strong dictatorship. Having fun has become illegal and entertainment is banished.You're in charge of a team of young rebels, the Gamers, fighting against the new anti-leisure laws oppressing the city. Equipped with high-tech gears allowing amazing jumps and speed, they roam the city to sabotage the propaganda, help citizens, and find a way to reach the Orbital Station. This way they could warn the Galactic Union and put an end to the oppression.Hover is both a single and multiplayer experience. At any time you can instantly switch from offline to online mode and join your friends or players from around the world and progress through the adventure by cooperating or playing against them. No matter where you are and what you're doing, you'll be able to connect. Hover is also a community-driven game offering many tools to players to create missions or mini games.… Expand"}, {"name": "Bit Boy!! Arcade", "details_link": "https://www.metacritic.com/game/3ds/bit-boy!!-arcade", "publisher": "Bplus", "release_date": "Apr 17 2014", "developers": ["Bplus"], "platforms": "3DS", "genres": ["Action", "General", "General"], "meta_score": 53, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/1/75f2b529f92789e57786e2acb3eb7d3a-98.jpg", "descriptions": "Witness what happens when the time travelling pixel hero Kubi finds out that he is only a part of a game. Behold his emotions and get excited about the impact this will have on the game. How will the battle between the game designer and his hero turn out?"}, {"name": "Hysteria Hospital: Emergency Ward", "details_link": "https://www.metacritic.com/game/wii/hysteria-hospital-emergency-ward", "publisher": "O-Games", "release_date": "Jun 16 2009", "developers": ["Gameinvest"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "General", "General", "Management", "Business / Tycoon"], "meta_score": 53, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/8d198dfeb2bd083d6faa484dc287ad5a-98.jpg", "descriptions": "Reach for your stethoscope and grab your nurse's outfit as Oxygen Games announces the arrival of Hysteria Hospital: Emergency Ward. At Hysteria Hospital, life proves to be a manic challenge. Players have several levels of the hospital to navigate, and they have to reach desperate patientsReach for your stethoscope and grab your nurse's outfit as Oxygen Games announces the arrival of Hysteria Hospital: Emergency Ward. At Hysteria Hospital, life proves to be a manic challenge. Players have several levels of the hospital to navigate, and they have to reach desperate patients and demanding doctors within a set period of time. The frenzy inside the hospital increases as the game progresses with more and more demanding patients desperate to be cured. You play as a female or male nurse and organise the ward and direct the patients to treat their conditions as quickly as possible. You can design and improve your ward for life-saving efficiency to be the best head nurse in America and save the Hospital from being overrun. Each of the patients have many humorous conditions, all with cures using the latest, bleeding-edge treatment machines ranging from basic X-Ray's to steam therapy to the hilarious De-Stress machine. There are 7 different wards to run, from a local Maryville clinic through to New York Central Hospital; over 60 levels including the 'Endless' mode that steadily increases in challenge as you progress. [Oxygen Interactive]… Expand"}, {"name": "Cy Girls", "details_link": "https://www.metacritic.com/game/playstation-2/cy-girls", "publisher": "Konami", "release_date": "Mar 23 2004", "developers": ["KCEJ"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 53, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/26a165f0857cb5aed467fb392df979e0-98.jpg", "descriptions": "Dive into the futuristic cyber-world of the Cy Girls, an all-new action thriller starring the sexiest duo in video games, Ice and Aska. Combining strength and style, this pair of spy-divas takes on the nastiest of cyber-terrorists in a world where the real and the virtual co-exist. UsingDive into the futuristic cyber-world of the Cy Girls, an all-new action thriller starring the sexiest duo in video games, Ice and Aska. Combining strength and style, this pair of spy-divas takes on the nastiest of cyber-terrorists in a world where the real and the virtual co-exist. Using their beauty, brains and brawn, these hot new heroines deliver twice the action! Play as two unique characters, Ice and Aska on parallel story paths. Fight cyber-terrorists with weapons skills of Ice or Ninja abilities of Aska. Acquire new skills for each character while in the cyber-world. Efficient targeting system that caters to beginners and experts alike. [Konami]… Expand"}, {"name": "Blade & Sword", "details_link": "https://www.metacritic.com/game/pc/blade-sword", "publisher": "Whiptail Interactive", "release_date": "Dec 22 2003", "developers": ["Pixel Multimedia"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 53, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/f1e8e70c753c59261a51b33598bd91b5-98.jpg", "descriptions": "Blade and Sword, the first PC Game title which combines Diablo-like action elements and Street Fighter arcade combat together, ushers in a new era in computer Role-Playing, that of the Action-RPG with amazing action and breath-taking martial arts from ancient China. [Whiptail Interactive]"}, {"name": "Minority Report: Everybody Runs", "details_link": "https://www.metacritic.com/game/gamecube/minority-report-everybody-runs", "publisher": "Activision", "release_date": "Nov 19 2002", "developers": ["Treyarch"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 53, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/e118121f8587323fa281b844d995dcc0-98.jpg", "descriptions": "The year is 2054 and you are Precrime Officer John Anderton, head of an elite police force division that can apprehend murderers before the crime can be committed. Everyone thought the system was perfect, until a precrime report lists you as the prime suspect. Now, you're on the run throughThe year is 2054 and you are Precrime Officer John Anderton, head of an elite police force division that can apprehend murderers before the crime can be committed. Everyone thought the system was perfect, until a precrime report lists you as the prime suspect. Now, you're on the run through 40 futuristic levels filled with both human and robot enemies in a mission to clear your name. With an arsenal of weapons, hand-to-hand combat skills, and a Jetpack that allows you to fly through levels, it's up to you to stop an evil conspiracy before it's too late. … Expand"}, {"name": "The Terminator: Dawn of Fate", "details_link": "https://www.metacritic.com/game/xbox/the-terminator-dawn-of-fate", "publisher": "Atari", "release_date": "Sep 18 2002", "developers": ["Paradigm Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 53, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/350cf0c07842bc5ba278d2b336e9a7d6-98.jpg", "descriptions": "The machines of Skynet have risen, reaping a bloody harvest of human flesh across the globe. You are a soldier of Tech Com--a ragged team of human-resistance fighters intent upon stopping the cybernetic onslaught in postapocalyptic Los Angeles. The prequel to The Terminator film lets youThe machines of Skynet have risen, reaping a bloody harvest of human flesh across the globe. You are a soldier of Tech Com--a ragged team of human-resistance fighters intent upon stopping the cybernetic onslaught in postapocalyptic Los Angeles. The prequel to The Terminator film lets you play as three characters--each with specialized skills and abilities. Your ultimate goal is to travel back in time to 1984, with the hope of preventing a relentless Terminator model T-800 from murdering Sarah Connor--mother of resistance leader John Connor. Armies of cyborgs stand in your way, but you'll have plenty of new weapons and melee moves to clear the path.… Expand"}, {"name": "Harvester", "details_link": "https://www.metacritic.com/game/pc/harvester", "publisher": "Merit Studios", "release_date": "Oct  1 1996", "developers": ["DigiFX Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 53, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/8845133aa02235ca36822bf4465a2c3a-98.jpg", "descriptions": "You wake up one morning to a town full of strangers and inexplicable sights. You share your home with your not so perfect family and your supposed fiance lives next door. The you are plunged into a nightmare. Your fiancee is missing and you find a hideous bloody skull and spinal chordYou wake up one morning to a town full of strangers and inexplicable sights. You share your home with your not so perfect family and your supposed fiance lives next door. The you are plunged into a nightmare. Your fiancee is missing and you find a hideous bloody skull and spinal chord drapped across her bed! Is it hers? What is going on? The only clue left behind is an engraved MOON\", a mysterious organisation that controls the town in ways you don't (or can't) understand. Is the order behind this gruesome execution? What invitation to enter, \"THE ORDER OF THE HARVEST are their motives? One thing is certain. You're going to get to the bottom of this killing or die trying. [Merit]… Expand"}, {"name": "World Championship Poker: Featuring Howard Lederer - All In", "details_link": "https://www.metacritic.com/game/playstation-2/world-championship-poker-featuring-howard-lederer---all-in", "publisher": "Crave", "release_date": "Aug 29 2006", "developers": ["Point of View"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/c60708fa97af9b4ce377997999abf0b9-98.jpg", "descriptions": "All In features some of the most recognizable and successful poker stars in the world, including Howard Lederer, his sister Annie Duke, Greg Raymer, Amir Vahidi, Paul Darden, and Robert Williamson III. Joining the roster for this year's edition are noted international poker superstars MarcelAll In features some of the most recognizable and successful poker stars in the world, including Howard Lederer, his sister Annie Duke, Greg Raymer, Amir Vahidi, Paul Darden, and Robert Williamson III. Joining the roster for this year's edition are noted international poker superstars Marcel Luske, Thomas Bihl, and Erin Ness, who parlayed a victory at a Maxim Magazine office tournament into a seat at the 2004 World Series of Poker. Features 18 types of poker, including Texas Hold'em, Five Card Draw, Seven Card Stud Omaha and More. Multi-Table Online Tournaments. Scenario Mode: Players are presented with a series of poker \"puzzle\" challenges that gradually increase in difficulty. Lucky Charms: Players can improve their luck through this Career Mode skill. Mixed Games: Play two or more variations of poker during a single game, with the game changing every time the dealer button makes it around the table. [Crave Entertainment]… Expand"}, {"name": "Rabbids Invasion", "details_link": "https://www.metacritic.com/game/xbox-one/rabbids-invasion", "publisher": "Ubisoft", "release_date": "Nov 18 2014", "developers": ["Ubisoft"], "platforms": ["PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "Miscellaneous", "General", "General", "Party / Minigame"], "meta_score": 53, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/e6ee34b79d1c0ffd84fc108c0aee1aa4-98.jpg", "descriptions": "Rabbids Invasion is an interactive television show airing on Nickelodeon that will utilize the Xbox One to have players interact with actions on the show."}, {"name": "Professor Heinz Wolff's Gravity", "details_link": "https://www.metacritic.com/game/ds/professor-heinz-wolffs-gravity", "publisher": "Deep Silver", "release_date": "Apr  6 2009", "developers": ["Deep Silver"], "platforms": ["PC", "DS"], "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "General"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/f9f891f8cba69db68f59d0f3e2468658-98.jpg", "descriptions": "It contains 100 levels packed with physical puzzles. The player needs to place elements in the correct order to reach the next level. Many levels offer different ways of completing, sometimes with surprising results. The game does not contain the dry subject matter of a physic lesson inIt contains 100 levels packed with physical puzzles. The player needs to place elements in the correct order to reach the next level. Many levels offer different ways of completing, sometimes with surprising results. The game does not contain the dry subject matter of a physic lesson in school, instead the fun aspect dominates. The game becomes accomplished with dozens of high quality hand painted background arts and an atmospheric soundtrack.… Expand"}, {"name": "Fallout 76", "details_link": "https://www.metacritic.com/game/playstation-4/fallout-76", "publisher": "Bethesda Softworks", "release_date": "Nov 14 2018", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 24 ", "genres": ["Role-Playing", "Western-Style"], "meta_score": 53, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/1/71dcdbd2bad3597bb2e48fe3afbec0e9-98.jpg", "descriptions": "Fallout 76 is the online prequel where every surviving human is a real person. Work together – or not – to survive. Under the threat of nuclear annihilation, you’ll experience the largest, most dynamic world ever created in the legendary Fallout universe. Reclamation Day, 2102. 25 yearsFallout 76 is the online prequel where every surviving human is a real person. Work together – or not – to survive. Under the threat of nuclear annihilation, you’ll experience the largest, most dynamic world ever created in the legendary Fallout universe. Reclamation Day, 2102. 25 years after the bombs fall, you and your fellow Vault Dwellers – chosen from the nation’s best and brightest – emerge into post-nuclear America. Play alone or band together as you explore, quest, build and triumph against the wasteland’s greatest threats. Multiplayer finally comes to the epic open-world RPGs of Bethesda Game Studios. Create your character with the S.P.E.C.I.A.L. system and forge your own path in a new and untamed wasteland with hundreds of locations. Whether you journey alone or with friends, a new and unique Fallout adventure awaits. Use the all-new Construction and Assembly Mobile Platform (C.A.M.P.) to build and craft anywhere in the world. Your C.A.M.P. will provide much-needed shelter, supplies and safety. You can even set up shop to trade goods with other survivors. But beware, not everyone will be quite so neighborly. [Bethesda]\r… Expand"}, {"name": "Dakar 18", "details_link": "https://www.metacritic.com/game/playstation-4/dakar-18", "publisher": "Deep Silver", "release_date": "Sep 25 2018", "developers": ["Bigmoon Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 53, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/ffdcfaeaebbbaebe4653a7beeeb0d22d-98.jpg", "descriptions": "Dakar 18 is a simulation of the world-famous annual rally raid organized by Amaury Sport Organisation (A.S.O.) in South America, and features visuals and many vehicles including motorcycles, cars, trucks, quads and SxS."}, {"name": "Alien Havoc", "details_link": "https://www.metacritic.com/game/psp/alien-havoc", "publisher": "Creat Studios", "release_date": "Oct  1 2009", "developers": ["Creat Studios"], "platforms": "PSP", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 53, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/5/ad94fec9d410c49051592bb59ae357c3-98.jpg", "descriptions": "[PSP Minis]  Alien Havoc throws back to the classic games era, putting gamers in command of an alien who must pluck cows from farms, load them onto his spaceship, and bring them back to his planet.  The farmers, however, won't let their cows go easily.  Players must tackle wrapping level[PSP Minis]  Alien Havoc throws back to the classic games era, putting gamers in command of an alien who must pluck cows from farms, load them onto his spaceship, and bring them back to his planet.  The farmers, however, won't let their cows go easily.  Players must tackle wrapping level layouts, hide and sneak in the cover of tall grass, and throw veggies, rocks or anything else they can at farmers so they can bring the livestock back to their space ship. [Creat Studios]… Expand"}, {"name": "Knights of the Temple II", "details_link": "https://www.metacritic.com/game/pc/knights-of-the-temple-ii", "publisher": "Take-Two Interactive", "release_date": "Feb 23 2007", "developers": ["Cauldron Ltd."], "platforms": "PC", "num_players": "8  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 53, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/07a83792c87c57eb1648c13833dec51a-98.jpg", "descriptions": "Knights of the Temple II is a 3rd Person Action-Adventure with non-linear game play, interactive dialog system, trade mode, side quests, RPG elements, alternative endings and multiplayer. KOTT2 is a game showing the player the ultimate fight of Paul de Raque, grandmaster of the Order of theKnights of the Temple II is a 3rd Person Action-Adventure with non-linear game play, interactive dialog system, trade mode, side quests, RPG elements, alternative endings and multiplayer. KOTT2 is a game showing the player the ultimate fight of Paul de Raque, grandmaster of the Order of the Temple and hero of the first game, with the forces of Hell. Traveling the lands and kingdoms of Europe of the 13th century, he must reveal the secret of the three ancient artifacts and fight the demon armies attacking our world. As a grandmaster of the Order of the Temple has Paul de Raque fought many battles in the eternal war between good and evil. But now he stands before his greatest challenge. Visions of evil forces invading our world, undead beings ravaging the lands of northern Europe and a dark menace opening a portal closed millennia ago. Fight your way through the forgotten Roman city, deadly dungeons of the Saracen Empire; discover long forgotten islands, ruins and catacombs on a search for a secret hidden on the ground of an ancient Underwater fortress. Test your fighting skills to overcome the hordes of darkness and to discover that the victory must be paid with blood, pain and maybe your own soul. [Cauldron]… Expand"}, {"name": "Stranger Things 3: The Game", "details_link": "https://www.metacritic.com/game/switch/stranger-things-3-the-game", "publisher": "Netflix", "release_date": "Jul  4 2019", "developers": ["BonusXP"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 53, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/8add13c0e910fee8b87da251b2d5f7e1-98.jpg", "descriptions": "Developed and published by BonusXP in collaboration with Netflix, Stranger Things 3: The Game is the official companion game to Season 3 of the hit original series. This adventure game blends a distinctively retro 16-bit art style with modern gameplay mechanics to deliver nostalgic fun withDeveloped and published by BonusXP in collaboration with Netflix, Stranger Things 3: The Game is the official companion game to Season 3 of the hit original series. This adventure game blends a distinctively retro 16-bit art style with modern gameplay mechanics to deliver nostalgic fun with a fresh new twist. Fans will be able to experience their favorite show through a mix of exploration, puzzles, and combat.Just like in the show, teamwork is at the heart Stranger Things 3: The Game. Fans can team up in two player local co-op or in single player mode alongside an AI partner, in the role of one of twelve characters from the show, each with unique abilities and attributes. Together, they'll play through familiar events from the series while also uncovering never-before-seen Stranger Things secrets, ensuring a fun experience for those new to the world of Stranger Things and series super fans alike!Key Features:* Experience the show in a new way, exploring the eerie world of Hawkins to uncover new mysteries beyond what's seen in Season 3.* Jump right into the action of this pick-up-and-play adventure: simple gameplay mechanics allow fans of all skill levels to get in on the fun.* Take your game to the next level by trying out different character combinations and collecting all the secrets the expansive world of Hawkins has to offer.* Team up with a friend, leveraging drop-in/drop-out local co-op to take on the mysterious monsters of Hawkins together. While playing solo, use a collection of \"buddy commands\" to control both characters and still experience all the fun.* Choose from 12 playable characters, each with their own unique talents and stats.… Expand"}, {"name": "Samurai Warriors: Katana", "details_link": "https://www.metacritic.com/game/wii/samurai-warriors-katana", "publisher": "Koei", "release_date": "Jan 16 2008", "developers": ["Koei", "Omega Force"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Historic", "Historic"], "meta_score": 53, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/0743735e3b0f0d558fe2f1a8ab1bdba2-98.jpg", "descriptions": "Using a first-person perspective, Samurai Warriors: KATANA is based on the Samurai Warriors series and delivers total arcade-style action right into your own home. Armed with your motion-sensitive Wii Remote, you’ll journey back in time to do battle as a lethal samurai warrior. On eachUsing a first-person perspective, Samurai Warriors: KATANA is based on the Samurai Warriors series and delivers total arcade-style action right into your own home. Armed with your motion-sensitive Wii Remote, you’ll journey back in time to do battle as a lethal samurai warrior. On each mission, legendary samurai and allies serve as your guide. Prevent pirates from invading your ships, rescue maidens from a burning castle, and explore mysterious caverns stalked by ninjas. These and many more challenging missions require quick reflexes, fast thinking, and precision marksmanship. Enjoy explosive martial arts excitement with three fun game modes. Go on an adventure through Feudal Japan in Musou Mode. Prepare for battle with a multitude of challenges in Trial Mode. Then, Go head-to-head with a friend in eight exciting mini games. Fight to stop endless waves of enemy samurai and ninja. Strike with sword or spear, fire volleys with your bow or thunderous rifle. Test your horseback riding skills, and explore the majestic castles of Feudal Japan. But be prepared to run and dodge your way past harrowing traps. Save your score and battle record with your Mii. [Koei]… Expand"}, {"name": "Youtubers Life: OMG Edition", "details_link": "https://www.metacritic.com/game/switch/youtubers-life-omg-edition", "publisher": "Raiser Games", "release_date": "Nov 20 2018", "developers": ["U-Play Online"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 53, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/e7a740b268ce8d55385232a2835870c2-98.jpg", "descriptions": "Become the world’s greatest content creator. Create your character focusing on gaming, music, or cooking, and start broadcasting your life from your parent’s house, then continue to increase your popularity through social networks and manage fans, friends, and family to move on up in theBecome the world’s greatest content creator. Create your character focusing on gaming, music, or cooking, and start broadcasting your life from your parent’s house, then continue to increase your popularity through social networks and manage fans, friends, and family to move on up in the world and become the biggest start in the world.… Expand"}, {"name": "EyeToy: Operation Spy", "details_link": "https://www.metacritic.com/game/playstation-2/eyetoy-operation-spy", "publisher": "SCEA", "release_date": "Nov 15 2005", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/a0b8539d58b407d833c98cce4cd463d5-98.jpg", "descriptions": "(Also known as \"SpyToy\" in the UK/EU) EyeToy: Operation Spy is the ultimate spy training that sends players into a world of international espionage and undercover surveillance.  Presented with a strong narrative, players join the SIA [Strategic Intelligence Agency] and are tasked with(Also known as \"SpyToy\" in the UK/EU) EyeToy: Operation Spy is the ultimate spy training that sends players into a world of international espionage and undercover surveillance.  Presented with a strong narrative, players join the SIA [Strategic Intelligence Agency] and are tasked with bringing to justice a global network of master criminals. EyeToy: Operation Spy offers two unique modes: Gameplay and Surveillance.  Gameplay mode allows players to enroll at the SIA and train to master the art of espionage.  Your secret agent skills are put to the test by undertaking a range of assignments such as code breaking, sky diving, device disposal, criminal profiling, and using high-tech equipment to zoom into locations via satellite to uncover criminal masterminds bent on taking over the world. Surveillance mode is a robust security system that uses the EyeToy USB camera to secretly capture footage of unwanted intruders. It can be used to passively monitor a room, triggering playback of a pre-recorded warning message on the TV screen, it can secretly record the person from the moment they enter the area, or allow players to establish a perimeter system, protecting specific areas or objects within a room. [SCEA]… Expand"}, {"name": "The Three Musketeers: One for All!", "details_link": "https://www.metacritic.com/game/wii/the-three-musketeers-one-for-all!", "publisher": "Legendo Entertainment", "release_date": "Jul 27 2009", "developers": ["Legendo Entertainment"], "platforms": "Wii", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 53, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/2d3a43f743b4667af7f25521d5bfb8bf-98.jpg", "descriptions": "[WiiWare]  The Three Musketeers have been imprisoned by the treacherous Count Xavier and his sinister lieutenant, Count Orsini! Well, almost - take on the role of Porthos, famed member of the Musketeers, to save the day in this swashbuckling platform adventure inspired by the classic novel.[WiiWare]  The Three Musketeers have been imprisoned by the treacherous Count Xavier and his sinister lieutenant, Count Orsini! Well, almost - take on the role of Porthos, famed member of the Musketeers, to save the day in this swashbuckling platform adventure inspired by the classic novel. Swing the Wii Remote to launch blistering sword attacks on your foes, avoid fiendish traps and discover hidden collectables. Packed with frenetic fencing, heroic leaps and fun puzzles, this is one adventure no aspiring hero will want to miss. [Nintendo]… Expand"}, {"name": "Game of Thrones", "details_link": "https://www.metacritic.com/game/playstation-3/game-of-thrones", "publisher": "Atlus", "release_date": "May 15 2012", "developers": ["Cyanide", "Cyanide Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Role-Playing", "General", "General", "Western-Style"], "meta_score": 53, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/76a0e178322ddf1a4bf059166487f5ef-98.jpg", "descriptions": "Written in conjunction with author George R. R. Martin, the famed A Song of Ice and Fire universe opens further to reveal a new chapter of the story! Play as two former soldiers of Robert’s Rebellion who, despite divergent paths, must reunite to face a new and deadly threat to the SevenWritten in conjunction with author George R. R. Martin, the famed A Song of Ice and Fire universe opens further to reveal a new chapter of the story! Play as two former soldiers of Robert’s Rebellion who, despite divergent paths, must reunite to face a new and deadly threat to the Seven Kingdoms. Travel a parallel course with the original series, interacting with familiar faces along the way, including Cersei Lannister, Lord Commander Mormont, and Varys the Spider.… Expand"}, {"name": "Deadfall Adventures", "details_link": "https://www.metacritic.com/game/pc/deadfall-adventures", "publisher": "Nordic Games Publishing", "release_date": "Nov 15 2013", "developers": ["The Farm 51"], "platforms": ["Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 53, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/6ba331ab953a376167a31f276285d6bf-98.jpg", "descriptions": "Deadfall Adventures takes the classic adventure genre and combines it with fast paced action associated with First Person Shooters. Set in exotic locations such as ancient Mayan ruins, forbiden cities, frozen wastelands and lush, tropical jungles - Deadfall Adventures takes the player on aDeadfall Adventures takes the classic adventure genre and combines it with fast paced action associated with First Person Shooters. Set in exotic locations such as ancient Mayan ruins, forbiden cities, frozen wastelands and lush, tropical jungles - Deadfall Adventures takes the player on a whirlwind adventure set in the late 1930's… Expand"}, {"name": "Agatha Christie: The ABC Murders", "details_link": "https://www.metacritic.com/game/ds/agatha-christie-the-abc-murders", "publisher": "DreamCatcher Interactive", "release_date": "Nov  9 2009", "developers": ["Dreamcatcher", "Black Lantern Studios"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 53, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/7d71b2cf0f45bf3be766e90219a8f4fb-98.jpg", "descriptions": "As easy as A...B...C? Agatha Christie’s A.B.C Murders tells the story of Captain Hastings and Hercule Poirot as they attempt to solve a series of bizarre murders committed by an elusive madman. [DreamCatcher]"}, {"name": "NBA Starting Five", "details_link": "https://www.metacritic.com/game/playstation-2/nba-starting-five", "publisher": "Konami", "release_date": "Oct 27 2002", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 53, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/02753195273b3116e6a40cc7b25388e9-98.jpg", "descriptions": "Get off the bench and get inside the ultimate NBA Experience. Tracy McGrady and the rest of the NBA bring an All-Star performance that is so life-like you'll be hitting the showers after you play. A newly designed intuitive control system allows instant playability but offers advancedGet off the bench and get inside the ultimate NBA Experience. Tracy McGrady and the rest of the NBA bring an All-Star performance that is so life-like you'll be hitting the showers after you play. A newly designed intuitive control system allows instant playability but offers advanced players a reason to come back. Smarter AI, improved graphics and smooth play put you on the floor with the Starting Five.… Expand"}, {"name": "Pac-Man All-Stars", "details_link": "https://www.metacritic.com/game/pc/pac-man-all-stars", "publisher": "Atari", "release_date": "May 14 2002", "developers": ["Creature Labs"], "platforms": "PC", "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/58cf62e2a04f17ffa39d0c8caed63b5a-98.jpg", "descriptions": "Four intrepid heroes traveling through a dangerous Ghost Realm on an all-out quest to save the Queen of Pac-Land. Choose your favorite Pac character and head out to an exciting, all-you-can-eat pellet extravaganza. Roam free through an interactive 3D world avoiding ghosts, grabbing power-upsFour intrepid heroes traveling through a dangerous Ghost Realm on an all-out quest to save the Queen of Pac-Land. Choose your favorite Pac character and head out to an exciting, all-you-can-eat pellet extravaganza. Roam free through an interactive 3D world avoiding ghosts, grabbing power-ups and doing whatever it takes to keep the other Pacs from eating those pellets! The Pac with the most pellets will free the Queen and be known as the mightiest hero of all! Play alone or with friends -  once you start, you won't want to stop! [Infogrames]… Expand"}, {"name": "Portal Runner", "details_link": "https://www.metacritic.com/game/playstation-2/portal-runner", "publisher": "3DO", "release_date": "Sep 10 2001", "developers": ["3DO"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 53, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/e6841ba9ad4a835906bd1e0dfbae4d48-98.jpg", "descriptions": "The latest game set in the Army Men universe is a 3D action/adventure which finds photojournalist Vikki G. and sidekick Leo the lion in a quest to rescue her boyfriend Sarge from the clutches of the notorious Blue spy Bridget Bleu."}, {"name": "Lord of Arcana", "details_link": "https://www.metacritic.com/game/psp/lord-of-arcana", "publisher": "Square Enix", "release_date": "Jan 25 2011", "developers": ["Access Games"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Action", "Role-Playing", "General", "Action RPG", "Action RPG"], "meta_score": 53, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/b727be2e55d33ae146f20fd5087cd783-98.jpg", "descriptions": "Lord of Arcana has the player on a quest for the power of Arcana and live out the destiny of the one bound to it."}, {"name": "The Chosen - Well of Souls", "details_link": "https://www.metacritic.com/game/pc/the-chosen---well-of-souls", "publisher": "Meridian4", "release_date": "Oct  1 2007", "developers": ["Rebelmind"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 53, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/115ab9d2e6b40edf95817aaa913203fc-98.jpg", "descriptions": "Choose your hero and journey forth in the ultimate action role-playing quest that pits you against an army of demons and devils like no other. Hell-bent and determined to take over the world, the powerful sorcerer Marcus Dominus Ingens has recruited the souls of ancient alchemists to aid inChoose your hero and journey forth in the ultimate action role-playing quest that pits you against an army of demons and devils like no other. Hell-bent and determined to take over the world, the powerful sorcerer Marcus Dominus Ingens has recruited the souls of ancient alchemists to aid in his destruction. Get ready for an unparalleled action role-playing experience that combines gruesome, action-packed battles with a deep, involving storyline set in the turn of the 19th century. 3 original playable characters, each with their own distinct skills and abilities. Over 200 different types of armour, weapons and magic items. Over 12 blood-curdling quests with hordes of werewolves, zombies, vampires and demons. Modify skills and allocate experience to develop your hero. Seizing demons during battle allows you to use them to fight for you. Improve weapons strength and effectiveness through ancient magic. Call upon mystical creatures to help battle the forces of evil. Join forces with interactive NPC characters who assist you in your battle against the undead. [Meridian4]… Expand"}, {"name": "Dash of Destruction", "details_link": "https://www.metacritic.com/game/xbox-360/dash-of-destruction", "publisher": "Microsoft Game Studios", "release_date": "Dec 17 2008", "developers": ["NinjaBee"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Driving", "Racing", "Arcade", "Other", "Other"], "meta_score": 53, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/9550df337fcb1471112cfc9b27b87727-98.jpg", "descriptions": "[Xbox Live Arcade]  Doritos' Dash of Destruction is a fun and fast-paced racing game. Blast your way through cities as a hungry Tyrannosaurus Rex, as you chase a speeding Delivery Truck full of tasty Doritos. Or, try zooming in and out of the T-Rex's path of destruction as the speedy[Xbox Live Arcade]  Doritos' Dash of Destruction is a fun and fast-paced racing game. Blast your way through cities as a hungry Tyrannosaurus Rex, as you chase a speeding Delivery Truck full of tasty Doritos. Or, try zooming in and out of the T-Rex's path of destruction as the speedy Delivery Truck in search of your Doritos drop-off points. For even more racing madness, Chaos mode lets you and three friends charge through cities eating Trucks or trying not to be eaten. In Zen mode, eat the Truck to become the Truck. [Microsoft]… Expand"}]