[{"name": "The Walking Dead: Season Two Episode 5 - No Going Back", "details_link": "https://www.metacritic.com/game/playstation-3/the-walking-dead-season-two-episode-5---no-going-back", "publisher": "Telltale Games", "release_date": "Aug 26 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Adventure", "General", "General", "Point-and-Click"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/ffc070445c4fbeab00687c04a73ecbf2-98.jpg", "descriptions": "The final episode of a five-part game series set in Robert Kirkmans award-winning zombie apocalypse."}, {"name": "Ikaruga", "details_link": "https://www.metacritic.com/game/xbox-360/ikaruga", "publisher": "Microsoft Game Studios", "release_date": "Apr  9 2008", "developers": ["Treasure"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/aa0f4112db7613d67ef47066fd90584e-98.jpg", "descriptions": "[Xbox Live Arcade]  Treasure's award-winning scrolling shooter brings a tactical twist to the genre with its yin-and-yang gameplay: the color of your ship determines your effect on enemies. In this polarized system, enemy ships and their bullets are one of two colors. Attack an enemy of the[Xbox Live Arcade]  Treasure's award-winning scrolling shooter brings a tactical twist to the genre with its yin-and-yang gameplay: the color of your ship determines your effect on enemies. In this polarized system, enemy ships and their bullets are one of two colors. Attack an enemy of the opposite color for extra damage. Absorb enemy fire of the same color as your ship, and use the energy for a special attack. Destroy multiple enemies of the same color to score a chaining bonus. Play solo or cooperatively, and use your polarity to achieve victory. Multiplayer support for two-player co-op offline or over Xbox LIVE allows you to clear the levels with a friend. [Treasure]… Expand"}, {"name": "Heavy Rain", "details_link": "https://www.metacritic.com/game/playstation-3/heavy-rain", "publisher": "SCEA", "release_date": "Feb 23 2010", "developers": ["Quantic Dream"], "platforms": ["PC", "PlayStation 4", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/941ac2513898ac6cc681333db971ba3a-98.jpg", "descriptions": "How Far Will You Go To Save Someone You Love? Experience a gripping psychological thriller filled with innumerable twists and turns, where choices and actions can result in dramatic consequences. Spanning four days of mystery and suspense, the hunt is on for a murderer known only as theHow Far Will You Go To Save Someone You Love? Experience a gripping psychological thriller filled with innumerable twists and turns, where choices and actions can result in dramatic consequences. Spanning four days of mystery and suspense, the hunt is on for a murderer known only as the Origami Killer - named after his macabre calling card of leaving behind folded paper shapes at crime scenes. Four characters, each following their own leads and with their own motives, must take part in a desperate attempt to prevent the killer from claiming a new victim. [Sony]… Expand"}, {"name": "Super Monkey Ball 2", "details_link": "https://www.metacritic.com/game/gamecube/super-monkey-ball-2", "publisher": "Sega", "release_date": "Aug 25 2002", "developers": ["Amusement Vision"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/189579ef87ceda56a4a9e74f8184dc5e-98.jpg", "descriptions": "AiAi, MeeMee, Baby, and GonGon are on a roll again.  Super Monkey Ball 2 brings the party to a whole new level with six brand new party games, six revamped party games, a new Story mode, and 150 new main game stages.  In the new Story mode, you'll fight as AiAi to stop the evil plans of theAiAi, MeeMee, Baby, and GonGon are on a roll again.  Super Monkey Ball 2 brings the party to a whole new level with six brand new party games, six revamped party games, a new Story mode, and 150 new main game stages.  In the new Story mode, you'll fight as AiAi to stop the evil plans of the deranged scientist, Dr. Bad-Boon and his mysterious sidekick.  But Story mode is just the beginning--you'll want to grab some friends and get groovin' with the 12 new party games.  With its new modes, enhanced graphics, and exciting multiplayer features, Super Monkey Ball 2 is keeps your party guests going bananas for hours.… Expand"}, {"name": "MechWarrior 4: Vengeance", "details_link": "https://www.metacritic.com/game/pc/mechwarrior-4-vengeance", "publisher": "Microsoft Game Studios", "release_date": "Nov 23 2000", "developers": ["FASA Studio"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Combat"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/6389aebe561f5039136014b0a917112a-98.jpg", "descriptions": "MechWarrior 4: Vengeance weaves heart-pounding BattleMech action with the continuing drama and unfolding storyline of the perpetual BattleTech universe, now in its 16th year. [Microsoft]"}, {"name": "Thief II: The Metal Age", "details_link": "https://www.metacritic.com/game/pc/thief-ii-the-metal-age", "publisher": "Eidos Interactive", "release_date": "Mar 23 2000", "developers": ["Looking Glass Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 87, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/0/4c18e3b046dedf589c24c2fc01a6c9ab-98.jpg", "descriptions": "On the streets and rooftops of a darkened city, where the forces of a corrupt sheriff loom, it takes someone with a soft touch and even softer step to stay ahead of the law. For a master thief like Garrett, the choices are clear: profit or perish. Thief II: The Metal Age expands on theOn the streets and rooftops of a darkened city, where the forces of a corrupt sheriff loom, it takes someone with a soft touch and even softer step to stay ahead of the law. For a master thief like Garrett, the choices are clear: profit or perish. Thief II: The Metal Age expands on the smash-hit \"first-person sneaker\", Thief: The Dark Project, demanding a whole new level of stealth, strategy, and skill to survive. [Eidos Interactive]… Expand"}, {"name": "Tactics Ogre: Let Us Cling Together", "details_link": "https://www.metacritic.com/game/psp/tactics-ogre-let-us-cling-together", "publisher": "Square Enix", "release_date": "Feb 14 2011", "developers": ["Square Enix"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/5c959df19a7157f8e85d27e25f9e20f4-98.jpg", "descriptions": "Warring clans struggle for supremacy over the Valerian Isles in this tactical role-playing game."}, {"name": "Tom Clancy's Splinter Cell Chaos Theory", "details_link": "https://www.metacritic.com/game/playstation-2/tom-clancys-splinter-cell-chaos-theory", "publisher": "Ubisoft", "release_date": "Mar 28 2005", "developers": ["Ubisoft Montreal"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Action Adventure", "Modern"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/353fd7fe7cf44ff8023cc8f30d5077d9-98.jpg", "descriptions": "The year is 2008. Information Warfare has evolved into the most dangerous threat to global stability. You are Sam Fisher, Third Echelon's most skilled Splinter Cell operative. You are assigned to execute a hazardous series of operations to investigate and eliminate a new source ofThe year is 2008. Information Warfare has evolved into the most dangerous threat to global stability. You are Sam Fisher, Third Echelon's most skilled Splinter Cell operative. You are assigned to execute a hazardous series of operations to investigate and eliminate a new source of information attacks, originating in North Korea. To succeed, you will employ a host of unconventional counterintelligence activities to gather intel, disrupt enemy operations and neutralize adversary targets. As Information Warfare evolves, so must the Splinter Cell. You must penetrate deeper into hostile territory and operate undetected, closer to the enemy than ever before. At your disposal is a lethal array of tactics ranging from Combat Knife techniques, experimental prototype weapons skills, and more radical hand-to-hand techniques such as the Inverted Chokehold. Experience the thrill of acting as a lone operative fighting tomorrow's threats in the field, and of cooperating online with a partner to accomplish crucial missions. Die in action, and the free world dies with you. Never-before-seen graphics technology offers the best visuals ever to appear on any platform. Advanced physics engine allows rag doll physics, particle effects and perfect interaction with the environment. The most complete arsenal of weapons and gadgets, from the combat knife to experimental prototype combat systems. Totally open level design with multipaths and optional secondary objectives. [Ubisoft]… Expand"}, {"name": "Diablo II: Lord of Destruction", "details_link": "https://www.metacritic.com/game/pc/diablo-ii-lord-of-destruction", "publisher": "Blizzard Entertainment", "release_date": "Jun 27 2001", "developers": ["Blizzard North"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 87, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/8/915ee7a814ac556c5690ee51d8b8167a-98.jpg", "descriptions": "With a stash that's double the size of the \"Diablo II's,\" hundreds of new types of items and magical properties, two new powerful character classes -- the Assassin and the Druid -- , and an improved enemy A.I., this expansion pack should reinforce the staying power of an already legendary RPG."}, {"name": "Kentucky Route Zero: TV Edition", "details_link": "https://www.metacritic.com/game/switch/kentucky-route-zero-tv-edition", "publisher": "Annapurna Interactive", "release_date": "Jan 28 2020", "developers": ["Cardboard Computer"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 87, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/7d0615c4d2f2fba071b2eccad165a34c-98.jpg", "descriptions": "Kentucky Route Zero is a magical realist adventure game about a secret highway in the caves beneath Kentucky. An antique furniture delivery man trying to make his small shop's last delivery gets lost along the way and meets a haunted TV repairwoman, a young boy and his giant eagle brother, aKentucky Route Zero is a magical realist adventure game about a secret highway in the caves beneath Kentucky. An antique furniture delivery man trying to make his small shop's last delivery gets lost along the way and meets a haunted TV repairwoman, a young boy and his giant eagle brother, a pair of robot musicians, and dozens of other characters. Together, they explore the nocturnal highways and country roads of Kentucky, the storied Echo River by ferry, and the mysterious Route Zero, the secret highway that runs through Mammoth Cave.… Expand"}, {"name": "Monkey Island 2 Special Edition: LeChuck's Revenge", "details_link": "https://www.metacritic.com/game/pc/monkey-island-2-special-edition-lechucks-revenge", "publisher": "LucasArts", "release_date": "Jul  7 2010", "developers": ["LucasArts"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/4/32c0f3d1dcac4ceb080906943d685996-98.jpg", "descriptions": "More Pirates! More Adventure! More Monkeys! Relive the second swashbuckling misadventure of the wannabe pirate Guybrush Threepwood as he searches for the lost treasure of Big Whoop, attempts to win back the beautiful Elaine Marley and takes on the now evil zombie pirate, LeChuck! MonkeyMore Pirates! More Adventure! More Monkeys! Relive the second swashbuckling misadventure of the wannabe pirate Guybrush Threepwood as he searches for the lost treasure of Big Whoop, attempts to win back the beautiful Elaine Marley and takes on the now evil zombie pirate, LeChuck! Monkey Island 2 Special Edition: LeChuck’s Revenge faithfully re-imagines the original classic in signature Special Edition detail. Plus, interact with the world of Monkey Island like never before with new direct-character controls, an interactive object highlight system, behind the scenes art viewer and creator commentary featuring the original developers of Monkey Island 2: LeChuck’s Revenge! Play it again for the first time with signature Special Edition features. [LucasArts]… Expand"}, {"name": "Half-Life 2: Episode One", "details_link": "https://www.metacritic.com/game/pc/half-life-2-episode-one", "publisher": "EA Games", "release_date": "Jun  1 2006", "developers": ["Valve Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/00151c671adeabe1a8cf575e08a35830-98.jpg", "descriptions": "Half-Life 2: Episode One is an all-new episode created by Valve that extends the Half-Life 2 single player adventure. The player reprises his role of Dr. Gordon Freeman, who must immediately face the repercussions of his actions in City 17 and the Citadel. Freeman reconnects with Alyx VanceHalf-Life 2: Episode One is an all-new episode created by Valve that extends the Half-Life 2 single player adventure. The player reprises his role of Dr. Gordon Freeman, who must immediately face the repercussions of his actions in City 17 and the Citadel. Freeman reconnects with Alyx Vance and her robot, Dog, as they continue their support of the resistance's battle against the Combine forces. [Valve]… Expand"}, {"name": "Uncharted: Legacy of Thieves Collection", "details_link": "https://www.metacritic.com/game/playstation-5/uncharted-legacy-of-thieves-collection", "publisher": "SCEE", "release_date": "Jan 28 2022", "developers": ["Naughty Dog", "Iron Galaxy Studios"], "platforms": ["PC", "PlayStation 5"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/cc80ae9984fed15d4a299abe94912286-98.jpg", "descriptions": "UNCHARTED: Legacy of Thieves Collection includes UNCHARTED 4: A Thief’s End and UNCHARTED: The Lost Legacy remastered for PS5™. Play as Nathan Drake and Chloe Frazer in their own standalone adventures as they are forced to confront their pasts and forge their own legacies."}, {"name": "Devil May Cry 3: Special Edition", "details_link": "https://www.metacritic.com/game/playstation-2/devil-may-cry-3-special-edition", "publisher": "Capcom", "release_date": "Jan 24 2006", "developers": ["Capcom"], "platforms": ["PC", "Switch", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 87, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/0/ea7b02d8644b2cab24b68cb0b16f7b30-98.jpg", "descriptions": "Devil May Cry 3 marks the return of the world’s toughest demon slayer, Dante, in a riveting new game marked by complex storylines, striking graphics and unadulterated stylistic action. As a prequel to the first Devil May Cry, the story unfolds an earlier chapter in Dante’s history, to aDevil May Cry 3 marks the return of the world’s toughest demon slayer, Dante, in a riveting new game marked by complex storylines, striking graphics and unadulterated stylistic action. As a prequel to the first Devil May Cry, the story unfolds an earlier chapter in Dante’s history, to a fateful clash with his evil twin brother. In addition to its characteristic fast paced action, the game increases the intensity with a new \"style\" system. It adds more depth to gameplay and allows players to choose between short-range, long-range, defensive or evasive play styles. Each system has its own range of features and players can power up their favorite style for increased special attack abilities. Special Edition feature: Now play as Dante’s twin Vergil! [Capcom]… Expand"}, {"name": "Guacamelee! 2", "details_link": "https://www.metacritic.com/game/switch/guacamelee!-2", "publisher": "DrinkBox Studios", "release_date": "Dec 10 2018", "developers": ["DrinkBox Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/5c8e7d712d2dc5821d5e2c4bf4d78c03-98.jpg", "descriptions": "Brawling has never been more beautiful! The long-awaited sequel to the smash hit action-platformer is here: Guacamelee! 2 brings luchador Juan Aguacate out of retirement for a stunning new Metroidvania-style adventure, where he must face his greatest challenge yet - one that threatens toBrawling has never been more beautiful! The long-awaited sequel to the smash hit action-platformer is here: Guacamelee! 2 brings luchador Juan Aguacate out of retirement for a stunning new Metroidvania-style adventure, where he must face his greatest challenge yet - one that threatens to tear apart the very fabric of the Mexiverse!Explore a huge, hand-crafted world inspired by Mexican culture and folklore, filled with sassy new villains and weirdos (and a few old friends!). Learn a deep repertoire of bone-crunching wrestling moves to fend off the skeletal hordes and overcome skillful platforming challenges... and who said anything about a Chicken Illuminati? Certainly not us!Check out these features:* An epic adventure spanning time and space, featuring drop-in 4-player local co-op for you and your best amigos!* A brand new upgrade system: discover \"trainers\" around the world, defeat their challenges, and develop your skill sets for movement, combat, and more!* A vibrant, colorful adventure that takes you from the Mangrove Swamp to Hell itself, featuring twice as many enemy types as the first game and a roster of eccentric new bosses!* An absolutely fuego electro-Mexican soundtrack, and more gorgeous visuals than ever thanks to a fancy new rendering engine!* Definitely no secret society of chickens that teaches you ancient chicken abilities previously lost to the ages!… Expand"}, {"name": "Mass Effect 2: Lair of the Shadow Broker", "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-2-lair-of-the-shadow-broker", "publisher": "Electronic Arts", "release_date": "Sep  7 2010", "developers": ["BioWare"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/2146c7e7f34cf6ac03f7c7460855c49d-98.jpg", "descriptions": "Liara T'Soni is tracking down the mysterious Shadow Broker, and no one is safe. She'll do anything to recover the man the Broker kidnapped... and the Shadow Broker's agents will do anything to stop her. Team up with Liara and chase clues from the luxurious heights of Illium to the ShadowLiara T'Soni is tracking down the mysterious Shadow Broker, and no one is safe. She'll do anything to recover the man the Broker kidnapped... and the Shadow Broker's agents will do anything to stop her. Team up with Liara and chase clues from the luxurious heights of Illium to the Shadow Broker's own secret lair. Adds the Shadow Broker intel center, new research, and five new achievements and the chance to continue a relationship with Liara.… Expand"}, {"name": "DiRT 3", "details_link": "https://www.metacritic.com/game/xbox-360/dirt-3", "publisher": "Codemasters", "release_date": "May 24 2011", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 87, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/f510c385a98d797f31b7ae014e24f94a-98.jpg", "descriptions": "Dirt 3 takes Codemasters' off-road series back to its rallying roots."}, {"name": "Enter the Gungeon", "details_link": "https://www.metacritic.com/game/switch/enter-the-gungeon", "publisher": "Devolver Digital", "release_date": "Dec 14 2017", "developers": ["Dodge Roll"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/163de0cd93062dc341da7bad56bfe1de-98.jpg", "descriptions": "Enter the Gungeon is a gunfight dungeon crawler following a band of misfits seeking to shoot, loot, dodge roll and table-flip their way to personal absolution by reaching the legendary Gungeon’s ultimate treasure: the gun that can kill the past."}, {"name": "Syphon Filter: Dark Mirror", "details_link": "https://www.metacritic.com/game/psp/syphon-filter-dark-mirror", "publisher": "SCEA", "release_date": "Mar 14 2006", "developers": ["Sony Bend"], "platforms": ["PlayStation 2", "PlayStation 4", "PlayStation 5", "PSP"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/005ec1fd29244492034ad704790c6fb9-98.jpg", "descriptions": "Assume the role of Gabe Logan, a highly-trained Precision Strike Operative, commanding a black box United States Agency that legally doesn't exist. Gabe finds himself dealing with a beautiful woman from his past who harbors a shocking secret while he battles the Red Section, a para-militaryAssume the role of Gabe Logan, a highly-trained Precision Strike Operative, commanding a black box United States Agency that legally doesn't exist. Gabe finds himself dealing with a beautiful woman from his past who harbors a shocking secret while he battles the Red Section, a para-military group in possession of Project Dark Mirror, a next-generation weapon of mass destruction. Using Precision Strike Tactics, advanced vision technology, and the latest in high-tech weaponry, Logan and his team perform surgical strike missions - too sensitive for a military response, too dangerous for civilian intelligence forces. Through the role of Gabe, players will have to be quick to strategize, as he is responsible to infiltrate, recon and execute decisively. Once inserted, Logan is his own authority - he must make life and death decisions, quickly choosing which course of action to take.… Expand"}, {"name": "The Elder Scrolls III: Morrowind", "details_link": "https://www.metacritic.com/game/xbox/the-elder-scrolls-iii-morrowind", "publisher": "Bethesda Softworks", "release_date": "Jun  6 2002", "developers": ["Bethesda Softworks"], "platforms": ["PC", "Xbox 360", "Xbox"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/107cb7ee5dddf3fcf3501d837d32fce9-98.jpg", "descriptions": "The third chapter of the Elder Scrolls series lets you play any kind of character you can imagine.  Be the noble hero embarking on an epic quest or an insidious thief rising to leadership of his guild.  Be a malevolent sorcerer developing the ultimate spell of destruction or a reverentThe third chapter of the Elder Scrolls series lets you play any kind of character you can imagine.  Be the noble hero embarking on an epic quest or an insidious thief rising to leadership of his guild.  Be a malevolent sorcerer developing the ultimate spell of destruction or a reverent healer searching for the cure to a plague.  Your actions define your character, and your gameplay changes and evolves in response to your actions.  Confront the assassins' guild, and they'll take out a contract on you.  Impress them, and they try to recruit you instead.  No two sagas are the same in the world of Morrowind.… Expand"}, {"name": "Quake Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/quake-remastered", "publisher": "Bethesda Softworks", "release_date": "Aug 19 2021", "developers": ["id Software", "MachineGames"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/203f4e714f1fc776c6425369e47e1057-98.jpg", "descriptions": "The remastered version of Quake is here."}, {"name": "The Swapper", "details_link": "https://www.metacritic.com/game/pc/the-swapper", "publisher": "Facepalm Games", "release_date": "May 30 2013", "developers": ["Facepalm Games"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/662a6e0cfede524c2dbb2c2284c40705-98.jpg", "descriptions": "The Swapper features a unique art style that uses real-world clay-models and found objects to create an explorable space station realised in unique detail; gameplay sees players swap between different bodies to achieve otherwise impossible tasks."}, {"name": "Baba Is You", "details_link": "https://www.metacritic.com/game/pc/baba-is-you", "publisher": "Hempuli Oy", "release_date": "Mar 13 2019", "developers": ["Hempuli Oy"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Puzzle", "Action", "General"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/df9803c304c580954041ab169e4eacde-98.jpg", "descriptions": "Baba Is You is a puzzle game where the rules you have to follow are present as blocks you can interact with. By manipulating them, you can change how the game works, repurpose things you find in the levels and cause surprising interactions."}, {"name": "Pokemon SoulSilver Version", "details_link": "https://www.metacritic.com/game/ds/pokemon-soulsilver-version", "publisher": "Nintendo", "release_date": "Mar 14 2010", "developers": ["Game Freak"], "platforms": "DS", "num_players": "2 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 87, "users_score": 9.2, "image": "https://static.metacritic.com/images/products/games/2/017852cdb9d3dad165f16e548aa2882c-98.jpg", "descriptions": "Return to the beloved Johto region first introduced in the Pokémon Gold and Silver Version games for the portable Game Boy system. Several new enhancements for the series, such as updated graphics and touch screen features, enrich these timeless adventures, and the new Pokéwalker accessoryReturn to the beloved Johto region first introduced in the Pokémon Gold and Silver Version games for the portable Game Boy system. Several new enhancements for the series, such as updated graphics and touch screen features, enrich these timeless adventures, and the new Pokéwalker accessory allows players to take their favorite Pokémon with them wherever they go. Both games feature detailed graphics that spotlight the unique environments and hundreds of Pokémon that players can encounter and catch. Players can even see and interact with their favorite Pokémon outside of battle, selecting one from their team to follow behind them as they travel through the Johto region. [Nintendo]… Expand"}, {"name": "Monster Hunter Rise", "details_link": "https://www.metacritic.com/game/playstation-5/monster-hunter-rise", "publisher": "Capcom", "release_date": "Jan 20 2023", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/7/afd09f2fbc7048ec114d23bf86df91b8-98.jpg", "descriptions": "Rise to the challenge and join the hunt! Set in the ninja-inspired land of Kamura Village, explore lush ecosystems and battle fearsome monsters to become the ultimate hunter. It's been half a century since the last calamity struck, but a terrifying new monster has reared its head andRise to the challenge and join the hunt! Set in the ninja-inspired land of Kamura Village, explore lush ecosystems and battle fearsome monsters to become the ultimate hunter. It's been half a century since the last calamity struck, but a terrifying new monster has reared its head and threatens to plunge the land into chaos once again.\r Hunt solo or in a party with friends to earn rewards that you can use to craft a huge variety of weapons and armor. Brand new gameplay systems such as the high-flying 'Wire Action' and your canine companion 'Palamute' will add exciting new layers to the already robust combat that Monster Hunter is known for.… Expand"}, {"name": "Castlevania: Harmony of Dissonance", "details_link": "https://www.metacritic.com/game/game-boy-advance/castlevania-harmony-of-dissonance", "publisher": "Konami", "release_date": "Sep 16 2002", "developers": ["KCET"], "platforms": "Game Boy Advance", "genres": ["Action", "Platformer", "2D"], "meta_score": 87, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/1d085d512621464ad0780aa24aa0bf53-98.jpg", "descriptions": "Nearly fifty years has past since Simon Belmont rescued the land from the curse of Dracula. Now, Simon's descendant Juste Belmont, must acquire the relics of Dracula to unravel the disappearance of his childhood friend Lydie. The castle's enchanting mysteries and danger await all those whoNearly fifty years has past since Simon Belmont rescued the land from the curse of Dracula. Now, Simon's descendant Juste Belmont, must acquire the relics of Dracula to unravel the disappearance of his childhood friend Lydie. The castle's enchanting mysteries and danger await all those who dare enter.… Expand"}, {"name": "Dragon Ball FighterZ", "details_link": "https://www.metacritic.com/game/playstation-4/dragon-ball-fighterz", "publisher": "Bandai Namco Games", "release_date": "Jan 26 2018", "developers": ["Arc System Works"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/88e3aed5814ef0e900d27af955a65bc6-98.jpg", "descriptions": "After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters.After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters. Partnering with Arc System Works, DRAGON BALL FighterZ maximizes high end Anime graphics and brings easy to learn but difficult to master fighting gameplay to audiences worldwide. \r\rKey Features:\r * 3vs3 TAG/SUPPORT\rAllows players to train and master more than one fighter/style which brings deeper gameplay\r * HIGH-END ANIME GRAPHICS\rUsing the power of the Unreal engine and the talented team at Arc System Works, DRAGON BALL FighterZ is a visual tour-de-force \r\r* SPECTACULAR FIGHTS\rExperience aerial combos, destructible stages, famous scenes from the DRAGON BALL anime reproduced in 60FPS and 1080p resolution (Higher resolution will be supported on PS4 Pro and Xbox Scorpio)… Expand"}, {"name": "The Legend of Zelda: Link's Awakening", "details_link": "https://www.metacritic.com/game/switch/the-legend-of-zelda-links-awakening", "publisher": "Nintendo", "release_date": "Sep 20 2019", "developers": ["Nintendo", "GREZZO"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/4be9f81bf6aefa2aa81865ff1b309358-98.jpg", "descriptions": "[*Reviews will go up on September 19 at 5am Pacific] 26 years after its original release on Game Boy, The Legend of Zelda: Link's Awakening will be reborn as a new experience on Nintendo Switch. Buffeted by a storm, Link washes ashore on the mysterious Koholint Island. In order to return[*Reviews will go up on September 19 at 5am Pacific] 26 years after its original release on Game Boy, The Legend of Zelda: Link's Awakening will be reborn as a new experience on Nintendo Switch. Buffeted by a storm, Link washes ashore on the mysterious Koholint Island. In order to return home, Link must overcome challenging dungeons and battle against fearsome monsters. This new version of the classic adventure includes many unique elements that appeared in the original Game Boy release, such as 2D platformer-style rooms and appearances from characters outside of The Legend of Zelda series.… Expand"}, {"name": "Mini Motorways", "details_link": "https://www.metacritic.com/game/pc/mini-motorways", "publisher": "Dinosaur Polo Club", "release_date": "Jul 20 2021", "developers": ["Dinosaur Polo Club"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "Management", "Government"], "meta_score": 87, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/d275bdc957db53be2d6c7fe6a0452692-98.jpg", "descriptions": "Have you ever been stuck in traffic and wished you could do something to fix it?In Mini Motorways, the city's traffic problems are in your hands.\n\nFrom the makers of Mini Metro, Mini Motorways is a game about drawing the roads that drive a growing city. Build a road network, one road at aHave you ever been stuck in traffic and wished you could do something to fix it?In Mini Motorways, the city's traffic problems are in your hands.From the makers of Mini Metro, Mini Motorways is a game about drawing the roads that drive a growing city. Build a road network, one road at a time, to create a bustling metropolis. Redesign your city to keep the traffic flowing, and carefully manage upgrades to meet the changing demands. How long can you keep the cities of the world moving?… Expand"}, {"name": "Super Mega Baseball 3", "details_link": "https://www.metacritic.com/game/switch/super-mega-baseball-3", "publisher": "Metalhead Software", "release_date": "May 13 2020", "developers": ["Metalhead Software"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Baseball", "Arcade"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/f72fb2c81962daefabcdcfd2c6fe9102-98.jpg", "descriptions": "Run up the score in a relaxed slugfest or push the limits of your reflexes in this refined baseball simulator. Super Mega Baseball 3 features an all-new Franchise mode, major graphical enhancements, and on-field additions including pickoffs and situational player traits."}, {"name": "Hitman 2: Silent Assassin", "details_link": "https://www.metacritic.com/game/pc/hitman-2-silent-assassin", "publisher": "Eidos Interactive", "release_date": "Oct  1 2002", "developers": ["Io Interactive"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/1991847434ee19c6db74705edcdf5053-98.jpg", "descriptions": "As a retired assassin, forced back into action by treason, pick up contracts in exotic locations around the globe: Sicily, St. Petersburg, Japan, Malaysia, and India. Operate in a non-linear world where the outcome of your actions and proficiency as a hitman are measured on a balance betweenAs a retired assassin, forced back into action by treason, pick up contracts in exotic locations around the globe: Sicily, St. Petersburg, Japan, Malaysia, and India. Operate in a non-linear world where the outcome of your actions and proficiency as a hitman are measured on a balance between stealth and aggression. Stalk and eliminate your targets up close and personal, in either 1st or 3rd person perspectives. Execute your assignments with a diverse arsenal of equipment, from armor-piercing sniper rifles and explosives to chloroform and poison darts. Acquire and carry weapons and tools from mission to mission through an enhanced inventory and save-game system. [Eidos Interactive]… Expand"}, {"name": "Assassin's Creed Odyssey", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-odyssey", "publisher": "Ubisoft", "release_date": "Oct  2 2018", "developers": ["Ubisoft", "Ubisoft Quebec"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 87, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/a482ef1d5578b034141a141198a058ec-98.jpg", "descriptions": "Write your own epic odyssey and become a legendary Spartan hero. Forge your destiny in a world on the brink of tearing itself apart. Influence how history unfolds in an ever-changing world shaped by your choices.\r Features:\r\n\r\n* LEGENDARY SPARTAN HERO - Embark on your journey from outcastWrite your own epic odyssey and become a legendary Spartan hero. Forge your destiny in a world on the brink of tearing itself apart. Influence how history unfolds in an ever-changing world shaped by your choices.\r Features:\r * LEGENDARY SPARTAN HERO - Embark on your journey from outcast to legendary Spartan hero.\r* ANCIENT GREECE AWAITS - Explore an entire country full of unexpected encounters in untamed environments and bustling ancient cities.\r* CHOOSE YOUR PATH - Your choices shape the world around you. Play in a living world that constantly reacts to your every decision.\r* FIGHT EPIC BATTLES - Charge into epic clashes between Sparta and Athens in battles pitting 150v150 soldiers against each other.\r* SAIL THE AEGEAN SEA - Recruit crewmembers and customize your ship as you explore and battle your way on the open seas.… Expand"}, {"name": "Hogwarts Legacy", "details_link": "https://www.metacritic.com/game/xbox-series-x/hogwarts-legacy", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb  7 2023", "developers": ["Avalanche Software", "Portkey Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World", "Role-Playing", "Western-Style"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/a7851b5c6504cc468b62e203fc0cd606-98.jpg", "descriptions": "LIVE THE UNWRITTEN - Hogwarts Legacy is an immersive, open-world action RPG set in the world first introduced in the Harry Potter books. Now you can take control of the action and be at the center of your own adventure in the wizarding world. Embark on a journey through familiar and newLIVE THE UNWRITTEN - Hogwarts Legacy is an immersive, open-world action RPG set in the world first introduced in the Harry Potter books. Now you can take control of the action and be at the center of your own adventure in the wizarding world. Embark on a journey through familiar and new locations as you explore and discover fantastic beasts, customize your character and craft potions, master spell casting, upgrade talents, and become the wizard you want to be.\r Experience Hogwarts in the 1800s. Your character is a student who holds the key to an ancient secret that threatens to tear the wizarding world apart. You have received a late acceptance to the Hogwarts School of Witchcraft and Wizardry and soon discover that you are no ordinary student: you possess an unusual ability to perceive and master Ancient Magic. Only you can decide if you will protect this secret for the good of all, or yield to the temptation of more sinister magic.\r Discover the feeling of living at Hogwarts as you make allies, battle Dark wizards, and ultimately decide the fate of the wizarding world. Your legacy is what you make of it.… Expand"}, {"name": "Year Walk", "details_link": "https://www.metacritic.com/game/pc/year-walk", "publisher": "Simogo", "release_date": "Mar  6 2014", "developers": ["Simogo"], "platforms": ["iPhone/iPad", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "3D", "First-Person", "Modern"], "meta_score": 87, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/0b1abc8333bbfa9d0eec8f3e3f7ce3bb-98.jpg", "descriptions": "In the old days man tried to catch a glimpse of the future in the strangest of ways. Experience the ancient Swedish phenomena of year walking through a different kind of first person adventure that blurs the line between two and three dimensions, as well as reality and the supernatural."}, {"name": "Batman: Arkham Knight", "details_link": "https://www.metacritic.com/game/playstation-4/batman-arkham-knight", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 23 2015", "developers": ["Rocksteady Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["General", "Fantasy", "Action Adventure", "Open-World"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/3748c5ef059e99cad03237ba33949409-98.jpg", "descriptions": "Batman confronts the ultimate threat against the city he has been sworn to protect. The Scarecrow returns to congeal an imposing array of super villains, including The Penguin, Two-Face and Harley Quinn, to summarily destroy The Dark Knight. The game introduces Rocksteady's uniquely-designedBatman confronts the ultimate threat against the city he has been sworn to protect. The Scarecrow returns to congeal an imposing array of super villains, including The Penguin, Two-Face and Harley Quinn, to summarily destroy The Dark Knight. The game introduces Rocksteady's uniquely-designed imagining of the Batmobile drivable for the first time in the franchise. Batman: Arkham Knight offers gamers a complete Batman experience as they rip through the streets and soar across the skyline of the iconic Gotham City.… Expand"}, {"name": "Dead or Alive 3", "details_link": "https://www.metacritic.com/game/xbox/dead-or-alive-3", "publisher": "Tecmo", "release_date": "Nov 14 2001", "developers": ["Team Ninja"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/0f6df12fd2b934d68b6ad4d328743e2e-98.jpg", "descriptions": "Dead or Alive returns to take fighters to the next level.  The third installment of the series features new characters, interactive environments, and all-new lighting effects.  Explore the many expansive levels in single-player mode or battle against up to four players in multiplayer mode.Dead or Alive returns to take fighters to the next level.  The third installment of the series features new characters, interactive environments, and all-new lighting effects.  Explore the many expansive levels in single-player mode or battle against up to four players in multiplayer mode.  The destructible environments, kinetic tag-battle feature, and all-new fighters make Dead or Alive 3 a worthy entry in the series.… Expand"}, {"name": "Jak II", "details_link": "https://www.metacritic.com/game/playstation-2/jak-ii", "publisher": "SCEA", "release_date": "Oct 14 2003", "developers": ["Naughty Dog"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/6008ddf0f023c3ee0360c9829de0126c-98.jpg", "descriptions": "In Jak II, Jak has an entirely new move set (Dark Jak) to augment his previous move set. He has more moves with his new toys as well - gun moves (including kick/shooting combos), and entire Jet Board move set and tricks. Daxter has some special surprises as well. There are escort missionsIn Jak II, Jak has an entirely new move set (Dark Jak) to augment his previous move set. He has more moves with his new toys as well - gun moves (including kick/shooting combos), and entire Jet Board move set and tricks. Daxter has some special surprises as well. There are escort missions where Jak goes into a level area with another character and the player must work with them to complete a task. Jak II enemies have more A.I. and respond to Jak with intelligent intent. [Daniel Arey]… Expand"}, {"name": "Two Point Campus", "details_link": "https://www.metacritic.com/game/switch/two-point-campus", "publisher": "Sega", "release_date": "Aug  9 2022", "developers": ["Two Point Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 87, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/85ddf06fd339b71fbb24ede7d57c6fa8-98.jpg", "descriptions": "Welcome to the University of U. Build your university, your way.\rIt’s time to spin academia on its head! Got a yearning for learning? Or just keen to build an educational masterpiece? Campus is jam-packed with new creative tools to help you build the university of your dreams. \r\rFor theWelcome to the University of U. Build your university, your way.\rIt’s time to spin academia on its head! Got a yearning for learning? Or just keen to build an educational masterpiece? Campus is jam-packed with new creative tools to help you build the university of your dreams. \r\rFor the first time, build in the great outdoors as you develop your own delightfully educational campus environment, housing the top teaching facilities in the land. Whether you prefer building on simple foundations, or placing every tree, you can build the university you want.\r Lay down pathways with new easy-to-use tools. Plant glorious collections of outdoor flora. Place benches, fountains, sculptures, hedgerows – even picket fences. The only limit is your imagination (and your in-game bank balance). … Expand"}, {"name": "Mario Kart 8 DLC Pack 1", "details_link": "https://www.metacritic.com/game/wii-u/mario-kart-8-dlc-pack-1", "publisher": "Nintendo", "release_date": "Nov 13 2014", "developers": ["Nintendo"], "platforms": "Wii U", "genres": ["Driving", "Racing", "Arcade", "Kart", "Automobile"], "meta_score": 87, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/5/118b5bb07f769a378f79b7adffe335d1-98.jpg", "descriptions": "The DLC pack adds Link, Cat Peach, and Tanooki Mario to the roster of playable characters along with 8 new tracks."}, {"name": "Final Fantasy Tactics Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/final-fantasy-tactics-advance", "publisher": "Nintendo", "release_date": "Sep  8 2003", "developers": ["Square Enix"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 87, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/0/8e08ee2f6b8615985213c73040f711d0-98.jpg", "descriptions": "The world of Final Fantasy returns to Game Boy Advance.  Final Fantasy Tactics Advance is a deeply diverse strategy and tactics game with battles, missions, swords, and magic.  Players assume the role of young Marche Radiuju in the humble burg of St. Ivalice.  Alone in a foreign world,The world of Final Fantasy returns to Game Boy Advance.  Final Fantasy Tactics Advance is a deeply diverse strategy and tactics game with battles, missions, swords, and magic.  Players assume the role of young Marche Radiuju in the humble burg of St. Ivalice.  Alone in a foreign world, Marche befriends a motley crew of low-level monks, mages, archers, and soldiers.  The only hope you have of finding your way home is to turn your ragtag group of misfits into a finely tuned fighting force.  As you gain experience and reputation, your job options grow as well as the rewards.… Expand"}, {"name": "NCAA Football 06", "details_link": "https://www.metacritic.com/game/xbox/ncaa-football-06", "publisher": "EA Sports", "release_date": "Jul 11 2005", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/d2c3f978c76aa1c50dc53a836326e0e5-98.jpg", "descriptions": "Your quest for the Heisman Trophy begins with NCAA® Football 06. Create an Impact Player and lead him from high school summer camp all the way to bowl victories as a collegiate legend.\rWith all-new Impact Player Controls, in-game analysis, and studio commentary, this is college footballYour quest for the Heisman Trophy begins with NCAA® Football 06. Create an Impact Player and lead him from high school summer camp all the way to bowl victories as a collegiate legend.\rWith all-new Impact Player Controls, in-game analysis, and studio commentary, this is college football like you've never seen or heard it before!… Expand"}, {"name": "Red Dead Redemption: Undead Nightmare Pack", "details_link": "https://www.metacritic.com/game/xbox-360/red-dead-redemption-undead-nightmare-pack", "publisher": "Rockstar Games", "release_date": "Oct 26 2010", "developers": ["Rockstar San Diego"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/d2043ddc343780ad5dec7f2ee5496d94-98.jpg", "descriptions": "Red Dead Redemption: Undead Nightmare Pack brings more adventures and challenges to the Red Dead universe."}, {"name": "Max Payne 3", "details_link": "https://www.metacritic.com/game/pc/max-payne-3", "publisher": "Rockstar Games", "release_date": "May 31 2012", "developers": ["Rockstar Games", "Rockstar Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/ea545564caa41b7ac6d707057e203587-98.jpg", "descriptions": "The gritty Max Payne series returns for a third iteration. From automatics to handguns to rifles and explosives, Max wields (and dual-wields) a wide array of high-powered weaponry in both single player and multiplayer. Max Payne 3 provides devastating firepower for any and all situationsThe gritty Max Payne series returns for a third iteration. From automatics to handguns to rifles and explosives, Max wields (and dual-wields) a wide array of high-powered weaponry in both single player and multiplayer. Max Payne 3 provides devastating firepower for any and all situations that call for kinetic and punishing action.… Expand"}, {"name": "Marvel's Spider-Man", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-spider-man", "publisher": "Sony Interactive Entertainment", "release_date": "Sep  7 2018", "developers": ["Insomniac Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/ed190baf9e24c7373ba6b5533ed31eda-98.jpg", "descriptions": "This isn't the Spider-Man you've known before, or seen in a movie. This is an experienced Peter Parker who is more masterful in fighting major crimes in New York City. At the same time he is struggling to balance his tumultuous personal life and career while the fate of nine million NewThis isn't the Spider-Man you've known before, or seen in a movie. This is an experienced Peter Parker who is more masterful in fighting major crimes in New York City. At the same time he is struggling to balance his tumultuous personal life and career while the fate of nine million New Yorkers rests upon his shoulders.… Expand"}, {"name": "Okami HD", "details_link": "https://www.metacritic.com/game/playstation-4/okami-hd", "publisher": "Capcom", "release_date": "Dec 12 2017", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/9a15c8d244ba9272fea0034cd196a248-98.jpg", "descriptions": "In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't.In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't. The more people who worship her (as a result of her restoring color and doing other good deeds for them), the more powerful she becomes.… Expand"}, {"name": "Pokemon Moon", "details_link": "https://www.metacritic.com/game/3ds/pokemon-moon", "publisher": "Nintendo", "release_date": "Nov 18 2016", "developers": ["Game Freak"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/63e96fe91d3b6f5bdadc311bcaff474a-98.jpg", "descriptions": "Using Pokemon Bank, you'll be able to transfer Pokemon you've caught in the Nintendo 3DS Virtual Console versions of Pokemon Red, Pokemon Blue, and Pokemon Yellow into your copy of Pokemon Sun or Pokemon Moon. Pokemon from Pokemon Omega Ruby, Pokemon Alpha Sapphire, Pokemon X, and Pokemon YUsing Pokemon Bank, you'll be able to transfer Pokemon you've caught in the Nintendo 3DS Virtual Console versions of Pokemon Red, Pokemon Blue, and Pokemon Yellow into your copy of Pokemon Sun or Pokemon Moon. Pokemon from Pokemon Omega Ruby, Pokemon Alpha Sapphire, Pokemon X, and Pokemon Y can also be brought into Pokemon Sun and Pokemon Moon in the same way.… Expand"}, {"name": "New Super Mario Bros. Wii", "details_link": "https://www.metacritic.com/game/wii/new-super-mario-bros-wii", "publisher": "Nintendo", "release_date": "Nov 15 2009", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/d543c3ea211b5132fae5a06ad1bf33d2-98.jpg", "descriptions": "New Super Mario Bros. Wii offers a combination of cooperation and competition. Players can pick each other up to save them from danger or toss them into it. Mario, Luigi and two Toads are all playable characters, while many others from the Mushroom Kingdom make appearances throughout theNew Super Mario Bros. Wii offers a combination of cooperation and competition. Players can pick each other up to save them from danger or toss them into it. Mario, Luigi and two Toads are all playable characters, while many others from the Mushroom Kingdom make appearances throughout the game. Players can even ride different Yoshi characters and use their tongues to swallow enemies, items and even balls of fire. In some areas, players use the motion abilities of the Wii Remote controller. The first player to reach a seesaw might make it tilt to help his or her character reach a higher platform - or might maike it tilt incorrectly just to mess with other players. New items include the propeller suit, which will shoot players high into the sky with just a shake of the Wii Remote, and Mario’s new ability to transform into Penguin Mario. At the end of each stage during the coin battle multiplayer mode, players are ranked based on the number of coins they have collected. [Nintendo]… Expand"}, {"name": "Elite Beat Agents", "details_link": "https://www.metacritic.com/game/ds/elite-beat-agents", "publisher": "Nintendo", "release_date": "Nov  6 2006", "developers": ["iNiS"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/27f1dcc4d332c200a6222a5645d01a94-98.jpg", "descriptions": "In a jam? Well, all these guys DO is jam! Prepare to rock as these beat masters use their groovy moves to save the day. As the music plays, players tap the screen, trace rhythmic patterns and keep the beat as the story unfolds on the top screen. Every scene is accompanied by rump-shakingIn a jam? Well, all these guys DO is jam! Prepare to rock as these beat masters use their groovy moves to save the day. As the music plays, players tap the screen, trace rhythmic patterns and keep the beat as the story unfolds on the top screen. Every scene is accompanied by rump-shaking tunes, but players have to keep the Elite Beat Agents grooving. The worse players do, the worse the story might end up. Whether they’re helping a lost dog find its way home or helping a babysitter charm a hunky football player, no crisis is too weird. The public knows of government agencies like the FBI and CIA, but little is known of this super-secret agency. Code-named Elite Beat Agents, these men in black are heroes' heroes and the coolest group of guys this world has ever known. Of course, according to official records, they do not exist. Their leader, an ex-CIA agent named Commander Kahn, scans the world for cries of help. When he finds one, he dispatches the agents, who assist their targets by performing a song and dance. The hypnotic nature of their rocking revives the targets with \"Groovy\" energy that boosts their willpower and helps them overcome their obstacles. Every stage is presented in a storyline fashion. All stages share similar basic elements and game flow: The player gets introduced to the target’s problem in a comical intro. Commander Kahn dispatches the agents to the scene. The agents arrive in a special \"Beat Transport\" that is tailor-made for the situation. The song starts as the agents and player meet the target. By tapping and tracing patterns that appear on-screen, players play along with the song’s rhythm. The animated story changes depending on how well the player performs. After each section, the player gets judged. Depending on the Elite-o-meter's judgment, the story will go well or poorly. If the player makes it though the whole song, he or she will be judged on the whole thing and get one of three endings. [Nintendo]… Expand"}, {"name": "Beyond Good & Evil", "details_link": "https://www.metacritic.com/game/gamecube/beyond-good-evil", "publisher": "Ubisoft", "release_date": "Dec 11 2003", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/074f2b72e31a2df2e22e875b9f6f4ebe-98.jpg", "descriptions": "For centuries, the planet Hillys has been bombarded by a relentless alien race.  In Beyond Good and Evil, a rebellious action reporter named Jade sets out to capture the truth behind the invasion.  Armed with her camera, dai-jo staff, and fierce determination, you must guide Jade as sheFor centuries, the planet Hillys has been bombarded by a relentless alien race.  In Beyond Good and Evil, a rebellious action reporter named Jade sets out to capture the truth behind the invasion.  Armed with her camera, dai-jo staff, and fierce determination, you must guide Jade as she discovers shocking evidence leading to a horrific government conspiracy and is forced to battle an evil she cannot possibly fathom.  With the ability to perform stealth techniques, dai-jo staff moves, and tag-team fighting combos, you can stop at nothing to expose the truth.… Expand"}, {"name": "Paper Mario: The Thousand-Year Door", "details_link": "https://www.metacritic.com/game/gamecube/paper-mario-the-thousand-year-door", "publisher": "Nintendo", "release_date": "Oct 11 2004", "developers": ["Intelligent Systems"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 87, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/6/5d897eefb20ae6df398e01025634ab73-98.jpg", "descriptions": "Get ready for a new role-playing adventure as Mario returns to paper form to stop a dangerous threat. In Paper Mario 2, Mario can dodge, inflict damage, and impress the crowd to strengthen his attacks. Also, Mario and his friends have more paper abilities. They can now turn sideways to slipGet ready for a new role-playing adventure as Mario returns to paper form to stop a dangerous threat. In Paper Mario 2, Mario can dodge, inflict damage, and impress the crowd to strengthen his attacks. Also, Mario and his friends have more paper abilities. They can now turn sideways to slip through cracks, fold into a paper airplane to fly, roll into a tube, and more. They can also use a variety of items like hammers and thunderbolts to defeat their enemies. … Expand"}, {"name": "DJ Hero", "details_link": "https://www.metacritic.com/game/wii/dj-hero", "publisher": "Activision", "release_date": "Oct 27 2009", "developers": ["Exient Entertainment"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 87, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/e87509286e6e9714b548171975255d22-98.jpg", "descriptions": "DJ Hero drops the needle with a completely fresh experience and legendary artists including Black Eyed Peas, 50 Cent, Justice, Marvin Gaye, Beck, Beastie Boys and N.E.R.D. DJ Hero features more than 100 individual songs that have been transformed into more than 80 exclusive, original mixesDJ Hero drops the needle with a completely fresh experience and legendary artists including Black Eyed Peas, 50 Cent, Justice, Marvin Gaye, Beck, Beastie Boys and N.E.R.D. DJ Hero features more than 100 individual songs that have been transformed into more than 80 exclusive, original mixes by superstar DJs including DJ Shadow, DJ Z-Trip, DJ AM, and the legendary Grandmaster Flash. With an innovative, new turntable controller and the hottest music collection of original music, DJ Hero is a unique new social music gaming experience that excite the millions of dance club music fans who can now play along to hit songs from a range of genres including hip-hop, R&B, pop, rock and electronica allowing them to rule the party with original mixes. Joining the internationally acclaimed DJ, producer and recording artist DJ Shadow, who has been consulting and contributed several mixes for DJ Hero, and making their video game debuts, DJ Z-Trip, a founder of the mashup movement who’s known worldwide for his sold out shows and eclectic style, and DJ AM, one of the world’s premier and most in-demand DJs today, appear as in-game characters and have each created multiple exclusive mixes for DJ Hero. In DJ Hero, faces in the crowd are transformed into the life of the party as the game’s turntable controller - created exclusively for DJ Hero and featuring familiar DJ tools including a fully-rotating turntable, sample buttons, effects dial and cross fader - immerses fans into the authenticity of DJ culture and a sea of music. By utilizing and mastering various DJ techniques including scratching, blending, cross fading and sampling, while leaving room for creative expression with a variety of effects and player chosen samples and scratches, gamers rule the party performing music as only a DJ can. Social expression is heightened with euphoric multiplayer gameplay where two DJs can battle competitively or have a player join in to emcee over any track in the game with a mic. Additionally, gamers can rock together as DJ Hero features DJ-guitar exclusive mixes played with a turntable controller and Guitar Hero guitar controller. [Activision]… Expand"}, {"name": "TowerFall Ascension", "details_link": "https://www.metacritic.com/game/pc/towerfall-ascension", "publisher": "Matt Makes Games Inc.", "release_date": "Mar 11 2014", "developers": ["Matt Thorson"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 87, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/b0cfc9af10a791eeb7c39265b5058938-98.jpg", "descriptions": "TowerFall is an archery combat platformer for up to 4 players. It's a local party game centering around hilarious, intense versus matches. The core mechanics are simple and accessible, but combat is fast and fierce. It's best played competitively with friends, cross-legged on the floorTowerFall is an archery combat platformer for up to 4 players. It's a local party game centering around hilarious, intense versus matches. The core mechanics are simple and accessible, but combat is fast and fierce. It's best played competitively with friends, cross-legged on the floor within punching distance of each other. … Expand"}, {"name": "Tomb Raider", "details_link": "https://www.metacritic.com/game/playstation-3/tomb-raider", "publisher": "Square Enix", "release_date": "Mar  5 2013", "developers": ["Crystal Dynamics", "Nixxes Software"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Modern", "General", "Modern", "Linear"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/9c4c10cca44a687d8bb1852ebe8a4940-98.jpg", "descriptions": "An intense and gritty story of the origins of Lara Croft and her ascent from frightened young woman to hardened survivor in Tomb Raider."}, {"name": "Hollow Knight", "details_link": "https://www.metacritic.com/game/pc/hollow-knight", "publisher": "Team Cherry", "release_date": "Feb 24 2017", "developers": ["Team Cherry"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "", "Metroidvania"], "meta_score": 87, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/4/d4d3032660ea1a0552c985031b9798b5-98.jpg", "descriptions": "Hollow Knight is a 2D action-adventure game with an emphasis on traditional 2D animation and skillful gameplay. Journey to Hallownest, a vast and ancient underground kingdom inhabited by a bizarre collection of insects and monsters. Players will forge their own path as they explore ruinedHollow Knight is a 2D action-adventure game with an emphasis on traditional 2D animation and skillful gameplay. Journey to Hallownest, a vast and ancient underground kingdom inhabited by a bizarre collection of insects and monsters. Players will forge their own path as they explore ruined cities, forests of fungus, temples of bone and other fantastic lands, all on their way to uncovering an ancient mystery.… Expand"}, {"name": "Mario Kart: Double Dash!!", "details_link": "https://www.metacritic.com/game/gamecube/mario-kart-double-dash!!", "publisher": "Nintendo", "release_date": "Nov 17 2003", "developers": ["Nintendo"], "platforms": "GameCube", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/260716850bb76e81bdae8dc0ea3256c1-98.jpg", "descriptions": "The Mushroom Kingdom just got a whole lot more hectic as Mario and friends double up for furious kart racing.  This time around, each kart holds two racers that can switch places at any time, so choose from a huge cast of favorites and pair them up any way you see fit.  The character inThe Mushroom Kingdom just got a whole lot more hectic as Mario and friends double up for furious kart racing.  This time around, each kart holds two racers that can switch places at any time, so choose from a huge cast of favorites and pair them up any way you see fit.  The character in front handles the driving duties, while the character in the rear doles out damage with six normal items and eight special items that only specific characters can use.  Get ready for some intense multiplayer mayhem with your favorite characters, including Mario, Luigi, Donkey Kong, Peach, Bowser, and Koopa.… Expand"}, {"name": "Tinykin", "details_link": "https://www.metacritic.com/game/switch/tinykin", "publisher": "tinyBuild", "release_date": "Aug 30 2022", "developers": ["Splashteam"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "Platformer", "3D", "Command"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/1606aa5bce82304516f7ae987e7e4324-98.jpg", "descriptions": "Milo arrives on Earth to find that he's way too small, everybody's gone and a day hasn't passed since 1991!Catch hundreds of mysterious tinykin and use their unique powers to create ladders, bridges, explosions and a lot more!\n\nFind a way home through a sprawling ant-sized metropolis, andMilo arrives on Earth to find that he's way too small, everybody's gone and a day hasn't passed since 1991!Catch hundreds of mysterious tinykin and use their unique powers to create ladders, bridges, explosions and a lot more!Find a way home through a sprawling ant-sized metropolis, and unravel Earth's biggest mystery!… Expand"}, {"name": "Destiny 2: The Witch Queen", "details_link": "https://www.metacritic.com/game/playstation-5/destiny-2-the-witch-queen", "publisher": "Bungie", "release_date": "Feb 22 2022", "developers": ["Bungie"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/03c87b89bf6faeb5680914e064452967-98.jpg", "descriptions": "The Definitive Destiny Campaign. Delve into Savathûn’s Throne World to uncover the mystery of how she and her Lucent Hive stole the Light. Learn the secrets to crafting new weapons, the new Glaive, and survive the truth within her web of lies. New Destination. A twisted wonderland ofThe Definitive Destiny Campaign. Delve into Savathûn’s Throne World to uncover the mystery of how she and her Lucent Hive stole the Light. Learn the secrets to crafting new weapons, the new Glaive, and survive the truth within her web of lies. New Destination. A twisted wonderland of corruption and splendor, Savathûn’s Throne World plays host to a fragile balance of power. From her palace to the swamp, all that she hides can be found here. Weapon Crafting. Create custom weaponry with unique mod, shader, and stat combinations. Master the new Glaive weapon type and unleash powerful melee combos, projectile attacks, and a deployable energy shield. … Expand"}, {"name": "OlliOlli World", "details_link": "https://www.metacritic.com/game/pc/olliolli-world", "publisher": "Private Division", "release_date": "Feb  8 2022", "developers": ["roll7"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 87, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/99474595ccc19395047d9ae4e833d25b-98.jpg", "descriptions": "OlliOlli World is a bold new skateboarding action-platformer that’s bursting with personality. Flip and flow through the vivid and vibrant world of Radlandia, meeting colorful characters as you grind, trick, and air your way to discover the mystical skate gods on your quest for Gnarvana.OlliOlli World is a bold new skateboarding action-platformer that’s bursting with personality. Flip and flow through the vivid and vibrant world of Radlandia, meeting colorful characters as you grind, trick, and air your way to discover the mystical skate gods on your quest for Gnarvana. Traverse a delightful and weird world as you take on missions, challenges, and make new friends along the way. Customize your character’s looks, tricks, and style while you experience explorable levels with multiple paths that provide an array of opportunities for player expression. Challenge the world in Leagues or dare a friend to beat your best tricks on one of millions of sharable levels. Experience the accessibility, depth, and player freedom as you dive into the signature flow state gameplay of OlliOlli World.\r OlliOlli World marks the third entry in the critically-acclaimed OlliOlli series from Roll7, the BAFTA and multi-award-winning independent studio.\r Key Features:\r • Welcome to Radlandia!: Take a trip across a lush skateboarding utopia that is filled to the brim with eccentric characters and vibrant locations that are begging to be explored. Find your grind in Inflatable Alley or blaze down Los Vulgas to discover new paths, fresh side quests, rad rewards, and epic trick opportunities. All perfectly complemented by a hand-picked compilation of IDM and Electronica tracks. \r\r• Play at your level: Super tight controls combine with highly refined gameplay to ensure a silky smooth ride. Not a Pro? Don’t worry – OlliOlli World welcomes you with open arms, allowing new players to tear down streets and pull off sick method grabs without fear of faceplanting the curb. Think you’ve got what it takes? Achieve mastery through millions of unique levels in sandbox mode or compete against rivals around the globe in leagues with a hugely deep combo system with over 100 moves to master and combine in your battle for the highest score.\r • Freedom of expression: Cruise through Radlandia's epic skate-haven and prove your skills to unlock special rewards that let you customize your character’s looks, tricks and style. Want to skate in your flip flops… go for it. Want to wear a bumble bee onesie …ok then… no judgement. In OlliOlli World as long as you’re on board anything goes! … Expand"}, {"name": "Rayman Legends", "details_link": "https://www.metacritic.com/game/playstation-vita/rayman-legends", "publisher": "Ubisoft", "release_date": "Sep  3 2013", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Stadia", "Wii U", "Xbox 360", "Xbox One", "PlayStation Vita"], "num_players": "2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/876572684c5de4dababbff93d39276ec-98.jpg", "descriptions": "Rayman Legends is the follow-up to Rayman Origins and aims to bring innovative multiplayer interactions for you to use."}, {"name": "Battlefield 3: Armored Kill", "details_link": "https://www.metacritic.com/game/pc/battlefield-3-armored-kill", "publisher": "Electronic Arts", "release_date": "Sep 11 2012", "developers": ["EA DICE"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 87, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/082e99af8b15dea7f067cd171dedfa7a-98.jpg", "descriptions": "Battlefield 3: Armored Kill ups the ante for vehicular mayhem as only Battlefield can do. Featuring new drivable tanks, ATVs, mobile artillery and more, this expansion pack also delivers huge battlefields for an all-out vehicle assault. Armored Kill also includes the biggest map inBattlefield 3: Armored Kill ups the ante for vehicular mayhem as only Battlefield can do. Featuring new drivable tanks, ATVs, mobile artillery and more, this expansion pack also delivers huge battlefields for an all-out vehicle assault. Armored Kill also includes the biggest map in Battlefield history.\r KEY FEATURES:\r * All-out vehicle warfare on four new maps\r* Includes the biggest map in Battlefield history\r* Drive five new vehicles, including tank destroyers, mobile artillery and an ATV or spawn on the gunship and man the cannons\r* Earn 20+ unlocks for the new vehicles\r* New Tank Superiority game mode\r* Earn five new Assignments… Expand"}, {"name": "World Series Baseball 2K3", "details_link": "https://www.metacritic.com/game/playstation-2/world-series-baseball-2k3", "publisher": "Sega", "release_date": "Mar 17 2003", "developers": ["Blue Shift"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/0b0310adda8dd9a7dfc7871a39680501-98.jpg", "descriptions": "WSB 2K3 spent the offseason improving what was already THE baseball franchise by adding an all-new ESPN broadcast presentation, more classic uniforms for every team, player-specific batting stances and pitching styles for Hall of Fame players, and historic ballparks. WSB 2K3's unrivaledWSB 2K3 spent the offseason improving what was already THE baseball franchise by adding an all-new ESPN broadcast presentation, more classic uniforms for every team, player-specific batting stances and pitching styles for Hall of Fame players, and historic ballparks. WSB 2K3's unrivaled gameplay gives users what they asked for, including: a jump button for home run-robbing snatches and line drive-snaring grabs, user-controlled leadoffs, drag bunts, improved double play animations, power swings, and more. [Sega]… Expand"}, {"name": "Metal Gear Solid 2: Substance", "details_link": "https://www.metacritic.com/game/playstation-2/metal-gear-solid-2-substance", "publisher": "Konami", "release_date": "Mar  3 2003", "developers": ["KCEJ"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 87, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/2/0f3c51f3010964b3ff8a083bce7bcaf7-98.jpg", "descriptions": "Solid Snake returns in Metal Gear Solid 2: Substance, the expanded edition of Metal Gear Solid 2: Sons of Liberty with all-new game modes, hidden characters and storylines. Top-secret weapons technology is being mysteriously transported under cover of an oil tanker to an unknown destination.Solid Snake returns in Metal Gear Solid 2: Substance, the expanded edition of Metal Gear Solid 2: Sons of Liberty with all-new game modes, hidden characters and storylines. Top-secret weapons technology is being mysteriously transported under cover of an oil tanker to an unknown destination. It's up to Snake to infiltrate the transport and keep this deadly weapon of mass destruction from falling into the wrong hands! Featuers 350+ VR Missions and 150+ Alternate Missions, as well as 5 all-new \"Snake Tales\" side stories. [Konami]… Expand"}, {"name": "Rallisport Challenge", "details_link": "https://www.metacritic.com/game/xbox/rallisport-challenge", "publisher": "Microsoft Game Studios", "release_date": "Mar  4 2002", "developers": ["Digital Illusions"], "platforms": ["PC", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/687f9e2b0e3f0d9b7c9231b80ad7940e-98.jpg", "descriptions": "Rallisport Challenge delivers an action-packed racing experience by combining four different types of Rally competition into one intense game: Hill Climb, traditional Rally, RallyCros, and Ice Racing. The variety of race types lets you experience traditional rally racing against the clock asRallisport Challenge delivers an action-packed racing experience by combining four different types of Rally competition into one intense game: Hill Climb, traditional Rally, RallyCros, and Ice Racing. The variety of race types lets you experience traditional rally racing against the clock as well as fierce grudge matches against computer opponents or over a network against friends. With 29 licensed cars (and several bonus vehicles), 48 tracks, realistic AI opponents, and realistic car damage, Rallisport Challenge packs fun and thrills into every race across a variety of terrain.… Expand"}, {"name": "NHL 2002", "details_link": "https://www.metacritic.com/game/pc/nhl-2002", "publisher": "EA Sports", "release_date": "Sep 17 2001", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/f55fb4b6a6f48fc8a6b3a58370b53f32-98.jpg", "descriptions": "EA's Canadian developing team returns to the ice with better graphics, improved lighting, create-a-player features, \"Soul Calibur\"-like digital NHL trading cards, and a dramatic new breakaway cam for those one-on-one, juke-the-goalie situations."}, {"name": "Bangai-O", "details_link": "https://www.metacritic.com/game/dreamcast/bangai-o", "publisher": "Conspiracy Entertainment", "release_date": "Mar 21 2001", "developers": ["Treasure"], "platforms": "Dreamcast", "num_players": "1 Player", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/8c05c2fdf182b02328ba235d38f9ec18-98.jpg", "descriptions": "Join Riki and Mami Makishi as they pilot the most destructive force the universe has ever known -- the giant robot Bangai-O against the forces of a notorious intergalactic crime syndicate. Utilize Bangai-O's devestating firepower to blast your way through 44 levels of non-stop, hardcoreJoin Riki and Mami Makishi as they pilot the most destructive force the universe has ever known -- the giant robot Bangai-O against the forces of a notorious intergalactic crime syndicate. Utilize Bangai-O's devestating firepower to blast your way through 44 levels of non-stop, hardcore arcade action filled with mind-bending puzzles and titanic bosses. Just don't forget to breathe.… Expand"}, {"name": "Icewind Dale", "details_link": "https://www.metacritic.com/game/pc/icewind-dale", "publisher": "Interplay", "release_date": "Jun 29 2000", "developers": ["Black Isle Studios"], "platforms": "PC", "genres": ["Role-Playing", "PC-style RPG", "General", "PC-style RPG", "Western-Style"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/9a4a8111ad9a34d4bc7711b7ef07ce9e-98.jpg", "descriptions": "A completely new Advanced Dungeons & Dragons adventure with an epic storyline in the tradition of \"Baldur's Gate.\" Includes 3-D technology developed for \"Baldur's Gate II\" that allows for incredible spell and environment effects. New spells, equipment, and abilities provide a higher level ofA completely new Advanced Dungeons & Dragons adventure with an epic storyline in the tradition of \"Baldur's Gate.\" Includes 3-D technology developed for \"Baldur's Gate II\" that allows for incredible spell and environment effects. New spells, equipment, and abilities provide a higher level of gameplay.  [Interplay]… Expand"}, {"name": "Forza Motorsport 6", "details_link": "https://www.metacritic.com/game/xbox-one/forza-motorsport-6", "publisher": "Microsoft Game Studios", "release_date": "Sep 15 2015", "developers": ["Turn 10"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 24 ", "genres": ["Driving", "GT / Street", "Racing", "Simulation", "Automobile"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/8a6cb38b3282ebcb961abd0b40892a03-98.jpg", "descriptions": "More than 450 cars all carefully recreated and customizable, and complete with working cockpits and full damage. Tour twenty-six world-famous locales including Daytona, Le Mans, and more. 2-player split-screen racing, 24-player races, and realistic Drivatar opponents deliver packed tracksMore than 450 cars all carefully recreated and customizable, and complete with working cockpits and full damage. Tour twenty-six world-famous locales including Daytona, Le Mans, and more. 2-player split-screen racing, 24-player races, and realistic Drivatar opponents deliver packed tracks and action.… Expand"}, {"name": "Donkey Kong Country Returns", "details_link": "https://www.metacritic.com/game/wii/donkey-kong-country-returns", "publisher": "Nintendo", "release_date": "Nov 21 2010", "developers": ["Retro Studios"], "platforms": ["3DS", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/e14f8c75606d50e263f3cd7d19b2e2b6-98.jpg", "descriptions": "The latest installment of the Donkey Kong Country series returns."}, {"name": "Bully", "details_link": "https://www.metacritic.com/game/playstation-2/bully", "publisher": "Rockstar Games", "release_date": "Oct 17 2006", "developers": ["Rockstar Vancouver"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/62c6e0590e8e87ca8c186300a1a6db4f-98.jpg", "descriptions": "(Known as \"Canis Canem Edit\" in the UK/EU)  Bully, the brutally funny debut title from Rockstar Vancouver, takes the Rockstar tradition of groundbreaking, innovative, original gameplay and humorous tongue-in-cheek storytelling to an entirely new setting: the schoolyard. As a troublesome(Known as \"Canis Canem Edit\" in the UK/EU)  Bully, the brutally funny debut title from Rockstar Vancouver, takes the Rockstar tradition of groundbreaking, innovative, original gameplay and humorous tongue-in-cheek storytelling to an entirely new setting: the schoolyard. As a troublesome schoolboy, you'll laugh and cringe as you stand up to bullies, get picked on by teachers, play pranks on malicious kids, win or lose the girl, and ultimately learn to navigate the obstacles of the fictitious reform school, Bullworth Academy. [Rockstar Games]… Expand"}, {"name": "Call of Duty: Black Ops", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops", "publisher": "Activision", "release_date": "Nov  9 2010", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Tactical", "Historic", "Arcade"], "meta_score": 87, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/d7d7e6273c87e620725d316ae3e1e7fb-98.jpg", "descriptions": "Treyarch is developing the next installment in the Call of Duty franchise, rumored to be set during the Cold War."}, {"name": "Deathloop", "details_link": "https://www.metacritic.com/game/pc/deathloop", "publisher": "Bethesda Softworks", "release_date": "Sep 14 2021", "developers": ["Arkane Studios"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/5be5bad50d3d2917003fe09fb4f5099e-98.jpg", "descriptions": "If at first you don't succeed Die, Die Again. From the team at Arkane Lyon comes an innovative take on first-person action. \"DEATHLOOP\" transports players to the lawless island of Blackreef in an eternal struggle between two extraordinary assassins. Explore stunning environments andIf at first you don't succeed Die, Die Again. From the team at Arkane Lyon comes an innovative take on first-person action. \"DEATHLOOP\" transports players to the lawless island of Blackreef in an eternal struggle between two extraordinary assassins. Explore stunning environments and meticulously designed levels in an immersive gameplay experience that lets you approach every situation any way you like. Hunt down targets all over the island in an effort to put an end to the cycle once and for all, and remember, if at first you don't succeed die, die again.… Expand"}, {"name": "Teenage Mutant Ninja Turtles: Shredder's Revenge", "details_link": "https://www.metacritic.com/game/switch/teenage-mutant-ninja-turtles-shredders-revenge", "publisher": "DotEmu", "release_date": "Jun 16 2022", "developers": ["Tribute Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 6 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/49452971b07678ad676ba6b42a8d67cf-98.jpg", "descriptions": "With Bebop and Rocksteady assaulting Channel 6 and stealing super gnarly devices to support Krang and Shredder's latest twisted plan, Teenage Mutant Ninja Turtles: Shredder's Revenge sees the Turtles battling across a righteous range of timeless TMNT locations. From Manhattan and ConeyWith Bebop and Rocksteady assaulting Channel 6 and stealing super gnarly devices to support Krang and Shredder's latest twisted plan, Teenage Mutant Ninja Turtles: Shredder's Revenge sees the Turtles battling across a righteous range of timeless TMNT locations. From Manhattan and Coney Island, to city rooftops and dank sewers, help the fearsome foursome trounce Foot Soldiers, Triceraton Warriors, and Rock Troops all the way to Dimension X! \r\rEnjoy stunning full-color pixel art graphics and a vintage TMNT vibe that will rock you straight back to the awesome 80s. Every character, vehicle, weapon, item, and background is directly inspired by the 1987 TV show, making you feel like you hopped into the television -- with a dope mix of killer humor and action-packed adventures!… Expand"}, {"name": "Vampire Survivors", "details_link": "https://www.metacritic.com/game/pc/vampire-survivors", "publisher": "poncle", "release_date": "Oct 20 2022", "developers": ["poncle"], "platforms": ["iPhone/iPad", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Shooter", "Roguelike", "Shoot-'Em-Up", "Top-Down"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/3f0e08f3659161dcddce075d527581fe-98.jpg", "descriptions": "Mow thousands of night creatures and survive until dawn! Vampire Survivors is a gothic horror casual game with rogue-lite elements, where your choices can allow you to quickly snowball against the hundreds of monsters that get thrown at you."}, {"name": "The Witness", "details_link": "https://www.metacritic.com/game/pc/the-witness", "publisher": "Thekla, Inc", "release_date": "Jan 26 2016", "developers": ["Thekla", "Inc"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "General", "Puzzle", "Puzzle", "Adventure", "3D", "First-Person"], "meta_score": 87, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/af6ce58fad3e1c7c6d0bd10038a7c359-98.jpg", "descriptions": "You awaken, alone, on a strange island full of puzzles that challenge and surprise you. You can't remember who you are, and you don't remember how you came to be here, but there's one thing you can do: explore the island in hope of discovering clues, regaining your memory, and somehowYou awaken, alone, on a strange island full of puzzles that challenge and surprise you. You can't remember who you are, and you don't remember how you came to be here, but there's one thing you can do: explore the island in hope of discovering clues, regaining your memory, and somehow finding your way home. The Witness is a single-player game in an open world with dozens of locations to explore and over 500 puzzles to solve. This game respects you as an intelligent player and it treats your time as precious. There's no filler; each of those puzzles brings its own new idea into the mix.… Expand"}, {"name": "Fire Emblem Fates: Conquest", "details_link": "https://www.metacritic.com/game/3ds/fire-emblem-fates-conquest", "publisher": "Nintendo", "release_date": "Feb 19 2016", "developers": ["Intelligent Systems"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Strategy", "Turn-Based", "Tactics"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/36f1dd9bf3328ff73b1476ad7c61fc3c-98.jpg", "descriptions": "Two kingdoms at war – the peace-loving Hoshido and the glory-seeking Nohr. It is up to the player to decide which side to fight for. As the prince/princess of Hoshido, who was raised by Nohr royal family, you will be torn between two families you love. Whichever path you take, you will faceTwo kingdoms at war – the peace-loving Hoshido and the glory-seeking Nohr. It is up to the player to decide which side to fight for. As the prince/princess of Hoshido, who was raised by Nohr royal family, you will be torn between two families you love. Whichever path you take, you will face different types of challenges.… Expand"}, {"name": "TowerFall Ascension", "details_link": "https://www.metacritic.com/game/playstation-4/towerfall-ascension", "publisher": "Matt Makes Games Inc.", "release_date": "Mar 11 2014", "developers": ["Matt Thorson"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 87, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/9311ea8093d30f14460261315f90bb8d-98.jpg", "descriptions": "TowerFall is an archery combat platformer for up to 4 players. It's a local party game centering around hilarious, intense versus matches. The core mechanics are simple and accessible, but combat is fast and fierce. It's best played competitively with friends, cross-legged on the floorTowerFall is an archery combat platformer for up to 4 players. It's a local party game centering around hilarious, intense versus matches. The core mechanics are simple and accessible, but combat is fast and fierce. It's best played competitively with friends, cross-legged on the floor within punching distance of each other. … Expand"}, {"name": "Tearaway", "details_link": "https://www.metacritic.com/game/playstation-vita/tearaway", "publisher": "SCEA", "release_date": "Nov 22 2013", "developers": ["Media Molecule"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Adventure", "General", "Platformer", "3D"], "meta_score": 87, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/8/de346ebcd281510ff7b259da3da8c928-98.jpg", "descriptions": "Adventure through a vibrant papery world with your new friend Iota, a plucky messenger with a unique message to deliver-to you.This paper world is small enough to hold in your own two hands, allowing you to reach into the game with your god-like powers and help Iota complete this veryAdventure through a vibrant papery world with your new friend Iota, a plucky messenger with a unique message to deliver-to you.This paper world is small enough to hold in your own two hands, allowing you to reach into the game with your god-like powers and help Iota complete this very special delivery.… Expand"}, {"name": "Skylanders SuperChargers", "details_link": "https://www.metacritic.com/game/wii-u/skylanders-superchargers", "publisher": "Activision", "release_date": "Sep 20 2015", "developers": ["Vicarious Visions"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Wii U"], "genres": ["Action", "Platformer", "3D"], "meta_score": 87, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/2a6b18c7fa8c4507ccb7458a0d5e6d5e-98.jpg", "descriptions": "Skylanders SuperChargers features a brand-new class of heroes, called SuperChargers who are distinct with fresh moves, powerful attacks and all-new weapons.  These SuperChargers also have special in-game abilities that help Portal Masters fight Kaos.  Twenty new SuperChargers character toysSkylanders SuperChargers features a brand-new class of heroes, called SuperChargers who are distinct with fresh moves, powerful attacks and all-new weapons.  These SuperChargers also have special in-game abilities that help Portal Masters fight Kaos.  Twenty new SuperChargers character toys and 20 new vehicle toys will be available.… Expand"}, {"name": "Rocket League", "details_link": "https://www.metacritic.com/game/xbox-one/rocket-league", "publisher": "505 Games", "release_date": "Feb 17 2016", "developers": ["Psyonix", "Panic Button"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Sports", "Team", "Soccer", "Arcade"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/7f873c4abe8ecbe7e30143990f93a04a-98.jpg", "descriptions": "Fire your rockets. High-octane team sports. Get behind the wheel of a high-flying, hard-hitting rocket powered car and drive into the Rocket League arena. Choose from a variety of vehicles to drive and customise in this football-meets-destruction derby team sport and master the skills youllFire your rockets. High-octane team sports. Get behind the wheel of a high-flying, hard-hitting rocket powered car and drive into the Rocket League arena. Choose from a variety of vehicles to drive and customise in this football-meets-destruction derby team sport and master the skills youll need to fire home the goals. Soar high into the air to perform daring acrobatic strikes and daredevil saves, or use aggressive tactics to take down rival players at supersonic speeds.… Expand"}, {"name": "Metal Gear Solid: Portable Ops", "details_link": "https://www.metacritic.com/game/psp/metal-gear-solid-portable-ops", "publisher": "Konami", "release_date": "Dec  5 2006", "developers": ["Kojima Productions"], "platforms": "PSP", "num_players": "Up to 6 ", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/75f7162cb24819712333e204b1f6ce88-98.jpg", "descriptions": "An all-new action game in Hideo Kojima's legendary Metal Gear Solid series, Metal Gear Solid: Portable Ops jumps into the stealth action genre on the PSP system with an original storyline that follows the events of \"Metal Gear Solid 3: Snake Eater\" and innovative online play that lets gamersAn all-new action game in Hideo Kojima's legendary Metal Gear Solid series, Metal Gear Solid: Portable Ops jumps into the stealth action genre on the PSP system with an original storyline that follows the events of \"Metal Gear Solid 3: Snake Eater\" and innovative online play that lets gamers recruit their own comrades to form a unique fighting force. Providing the missing pieces to the puzzle of the Metal Gear saga, players learn more about their favorite characters and how the events of later Metal Gear games were set into motion while experiencing breakthrough online play that lets gamers utilize all aspects of the PSP systems' infrastructure functionality. [Konami]… Expand"}, {"name": "3D Sonic the Hedgehog 2", "details_link": "https://www.metacritic.com/game/3ds/3d-sonic-the-hedgehog-2", "publisher": "Sega", "release_date": "Oct  8 2015", "developers": ["M2"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360", "3DS"], "genres": ["Action", "Platformer", "2D"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/f0bb9d3750e25bcd9a24a49ed33b83c5-98.jpg", "descriptions": "Super Speed! Sonic's back and better than ever. He's a blur in blue! A blaze of action! With his new Super Spin Dash. And a new, fabulous friend, \"Tails\" the Fox. You won't believe it 'til you see it. And when you play, you won't stop. Super Play! Defy gravity in hair-raisingSuper Speed! Sonic's back and better than ever. He's a blur in blue! A blaze of action! With his new Super Spin Dash. And a new, fabulous friend, \"Tails\" the Fox. You won't believe it 'til you see it. And when you play, you won't stop. Super Play! Defy gravity in hair-raising loop-de-loops. Grab Power Sneakers and race like lightning through the mazes. All at break-neck speed! Super Power! Sonic's attitude is can-do. The mad scientist Dr. Robotnik is planning a world takeover. Sonic gets tough in the fight to save his friends and squash Robotnik for good!… Expand"}, {"name": "Zack & Wiki: Quest for Barbaros' Treasure", "details_link": "https://www.metacritic.com/game/wii/zack-wiki-quest-for-barbaros-treasure", "publisher": "Capcom", "release_date": "Oct 23 2007", "developers": ["Capcom"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Adventure", "General", "General"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/ddd9eff3ab7bf48c59b7285db10a301d-98.jpg", "descriptions": "Legend has it that a revered pirate named Barbaros once stole the world's treasure and hid it on a mysterious island. Though no one knows of its exact location, stories about the untold riches that lay in wait have been passed down through the ages, driving pirates from all walks of life toLegend has it that a revered pirate named Barbaros once stole the world's treasure and hid it on a mysterious island. Though no one knows of its exact location, stories about the untold riches that lay in wait have been passed down through the ages, driving pirates from all walks of life to pursue the alluring prizes. One of these treasure seekers, a young apprentice pirate named Zack happens upon a mysterious talking skull, the skull of Barbaros himself. Barbaros promises to reveal the key to the island, if Zack will help to lift the curse he is under. Players explore a variety of wondrous environments and stages, solving puzzles and interacting with the world in search of a legendary pirate ship and the ultimate pursuit of becoming the greatest pirate the world has ever seen. Inventive gameplay mechanics and controller movements allow players to move and open objects, transform items, unlock new pathways and navigate through perilous stages based on a variety of themes including a jungle, ice temple, volcanic caves and more, each with multiple sub-areas. Players will use the Wii Remote controller in various ways - rotate handles, turn keys to open doors, play a piccolo and much more in order to solve the progressively difficult puzzle stages and collect key items that will lead to the legendary pirate ship. [Capcom]… Expand"}, {"name": "Monster Boy and the Cursed Kingdom", "details_link": "https://www.metacritic.com/game/playstation-4/monster-boy-and-the-cursed-kingdom", "publisher": "FDG Entertainment", "release_date": "Dec  4 2018", "developers": ["FDG Entertainment"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/81cc2582fec32adb42c768dfffa6c021-98.jpg", "descriptions": "A legendary game series returns with an all-new adventure and in HD. Monster Boy is a colorful side-scrolling action adventure created in cooperation with Ryuichi Nishizawa, the creator of the famous Wonder Boy in Monster World series. Monster Boy is being created to bring back the enjoymentA legendary game series returns with an all-new adventure and in HD. Monster Boy is a colorful side-scrolling action adventure created in cooperation with Ryuichi Nishizawa, the creator of the famous Wonder Boy in Monster World series. Monster Boy is being created to bring back the enjoyment of the classic games that shine by simplicity. Exciting gameplay, upbeat music and smooth graphics. You'll need to overcome huge bosses, find hidden passages, discover powerful equipment and use all your wits and skills to remove a powerful curse. Transform into 6 different creatures, each with their own skills and abilities. Take advantage of all the unique powers to open new paths and advance in an epic story.… Expand"}, {"name": "The Walking Dead: Episode 3 - Long Road Ahead", "details_link": "https://www.metacritic.com/game/playstation-3/the-walking-dead-episode-3---long-road-ahead", "publisher": "Telltale Games", "release_date": "Aug 28 2012", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/7c250df90e5e92de5eb24bc39904bbb9-98.jpg", "descriptions": "Episode 3 of a 5-part game series set in Robert Kirkman’s universe. Treachery within the group leads to a devastating series of events. Will the tough choices you made in episodes one and two come back to haunt you or prove to be worthwhile decisions?"}, {"name": "MLB 13: The Show", "details_link": "https://www.metacritic.com/game/playstation-3/mlb-13-the-show", "publisher": "SCEA", "release_date": "Mar  5 2013", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/5d23562a82bc5e4c6bd6dfe7ed703608-98.jpg", "descriptions": "MLB 13 The Show promises an MLB experiences like never before. Improvements have been made to Diamond Dynasty, Franchise and Road To The Show modes and all-new game modes expand gameplay options."}, {"name": "Psychonauts 2", "details_link": "https://www.metacritic.com/game/xbox-series-x/psychonauts-2", "publisher": "Xbox Game Studios", "release_date": "Aug 25 2021", "developers": ["Double Fine Productions"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "3D"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/806747f74681056d332281709ea75717-98.jpg", "descriptions": "Razputin Aquato, trained acrobat and powerful young psychic, has realized his life long dream of joining the international psychic espionage organization known as the Psychonauts! But these psychic super spies are in trouble. Their leader hasn't been the same since he was kidnapped, andRazputin Aquato, trained acrobat and powerful young psychic, has realized his life long dream of joining the international psychic espionage organization known as the Psychonauts! But these psychic super spies are in trouble. Their leader hasn't been the same since he was kidnapped, and what's worse, there's a mole hiding in headquarters. Raz must use his powers to stop the mole before they execute their secret plan--to bring the murderous psychic villain, Maligula, back from the dead.… Expand"}, {"name": "Brothers in Arms: Road to Hill 30", "details_link": "https://www.metacritic.com/game/pc/brothers-in-arms-road-to-hill-30", "publisher": "Ubisoft", "release_date": "Mar  8 2005", "developers": ["Gearbox Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 87, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/f85f19514c58d5058318567f98783898-98.jpg", "descriptions": "Created by Texas-based Gearbox Software, Brothers in Arms is the most realistic and authentic WWII shooter ever. While other WWII games have sugarcoated the war experience, Brothers in Arms is based on a true story and will immerse gamers into the gritty, uncensored and emotionally-chargedCreated by Texas-based Gearbox Software, Brothers in Arms is the most realistic and authentic WWII shooter ever. While other WWII games have sugarcoated the war experience, Brothers in Arms is based on a true story and will immerse gamers into the gritty, uncensored and emotionally-charged side of war. The game puts you in the shoes of Sgt. Matt Baker, a D-Day paratrooper squad leader, and asks you to lead the squad as you balance their lives with the success of the mission. The true stories and historical events you experience on your perilous journey take you through real battlefields meticulously recreated from aerial reconnaissance images, US Army Signal Corps photos and eye-witness accounts of war-torn Normandy. Players of allskill levels can battle their way through this intense experience because of Brothers in Arms innovative and accessible command and control system. [Ubisoft]… Expand"}, {"name": "MechAssault", "details_link": "https://www.metacritic.com/game/xbox/mechassault", "publisher": "Microsoft Game Studios", "release_date": "Nov 11 2002", "developers": ["Day 1 Studios"], "platforms": "Xbox", "num_players": "1-8 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/7ac5d84c868d20c9c78b86effa98b0f0-98.jpg", "descriptions": "Pilot the most powerful weapon of the 31st century--a 40-foot tall walking tank called a BattleMech.  MechAssault is a third-person action shooter that features fully destructible environments, a powerful array of upgradeable BattleMechs, and dynamic mission-based gameplay.  MechAssault alsoPilot the most powerful weapon of the 31st century--a 40-foot tall walking tank called a BattleMech.  MechAssault is a third-person action shooter that features fully destructible environments, a powerful array of upgradeable BattleMechs, and dynamic mission-based gameplay.  MechAssault also includes complete Xbox online and split-screen multiplay capabilities, so you can taunt the competition or strategize with a teammate with full voice communication support.  Prepare yourself for some devastating, metal-crunching warfare.… Expand"}, {"name": "NFL 2K2", "details_link": "https://www.metacritic.com/game/xbox/nfl-2k2", "publisher": "Sega", "release_date": "Jan  9 2002", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 87, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/389303710ae547adb8e13a7523870ede-98.jpg", "descriptions": "Sega Sports NFL 2K2 hits the Gridiron on the Xbox video game system, with the look and feel of a champion. With all-new gameplay animations and platform-specific features, NFL 2K2 combines flash and substance in a football game that is as exciting to watch as it is to play."}, {"name": "Kohan: Immortal Sovereigns", "details_link": "https://www.metacritic.com/game/pc/kohan-immortal-sovereigns", "publisher": "Strategy First", "release_date": "Mar 14 2001", "developers": ["TimeGate Studios"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "General", "General", "Command"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/89b54e81653b47eb8973149f1525e852-98.jpg", "descriptions": "No, it's not another Warcraft clone.  This well-received first title from TimeGate Studios introduces a unique combination of real-time gaming and turn-based strategy that sheds the old unit micromanagement scheme and emphasizes fantasy strategic combat."}, {"name": "Hitman 3", "details_link": "https://www.metacritic.com/game/xbox-series-x/hitman-3", "publisher": "Io Interactive", "release_date": "Jan 20 2021", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/9120ae4c6e51f74435ae272653193c96-98.jpg", "descriptions": "Death Awaits \r\rHITMAN 3 is the dramatic conclusion to the World of Assassination trilogy and takes players around the world on a globetrotting adventure to sprawling sandbox locations. Agent 47 returns as a ruthless professional for the most important contracts of his entire career.Death Awaits \r\rHITMAN 3 is the dramatic conclusion to the World of Assassination trilogy and takes players around the world on a globetrotting adventure to sprawling sandbox locations. Agent 47 returns as a ruthless professional for the most important contracts of his entire career.\r Supported by his Agency handler, Diana Burnwood, 47 joins forces with his long-lost friend Lucas Grey. Their ultimate mission is to eliminate the partners of Providence, but they are forced to adapt as their hunt intensifies. When the dust settles, 47 and the world he inhabits will never be the same again. \r\rTop of the World\rEvery mission location in HITMAN 3 is meticulously detailed and packed full of creative opportunities. Players will have unrivalled freedom to complete their objectives and the game world will react to everything they do. \r\rA Platform of Assassination\rThe World of Assassination trilogy is fully realised with HITMAN 3 as the ultimate place to play all three games. Players of previous HITMAN games will be pleased to know that it will be possible to 'import' locations that they own from the previous two HITMAN games into HITMAN 3, essentially putting all 20+ locations from the entire trilogy in one place.\r Playing the entire trilogy from beginning to end, from within HITMAN 3, also means that the progression systems in HITMAN 3 work across all locations. You can unlock an item in Dubai and take it with you to Paris, for example. HITMAN 2 players will have the option to carry over their hard-earned unlocks and progression into HITMAN 3.… Expand"}, {"name": "FIFA 14", "details_link": "https://www.metacritic.com/game/playstation-4/fifa-14", "publisher": "EA Sports", "release_date": "Nov 12 2013", "developers": ["EA Canada"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 87, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/d653953db2613210718bce351944ba6c-98.jpg", "descriptions": "Fuelled by EA SPORTS IGNITE, FIFA 14 feels alive with players who think, move, and behave like world-class footballers, and dynamic stadiums that come to life. Players have four times the decision making ability and feel alive with human-like reactions, anticipation, and instincts. With 10Fuelled by EA SPORTS IGNITE, FIFA 14 feels alive with players who think, move, and behave like world-class footballers, and dynamic stadiums that come to life. Players have four times the decision making ability and feel alive with human-like reactions, anticipation, and instincts. With 10 times more animation depth and detail than previous consoles, FIFA 14 delivers the dynamic movements and biomechanics of the worlds best footballers. Players are agile and athletic as they plant, pivot and cut, and explode out of each step. The increased fidelity has a game-changing effect on gameplay. Plus, the artistry and athleticism of footballers will come to life with the addition of hundreds of new types of skills and hundreds of new behaviors. And for the first time ever, fans will feel the electricity of a living stadium as the emotions of new 3D crowds rise and fall around the stories on the pitch.… Expand"}, {"name": "Animal Crossing", "details_link": "https://www.metacritic.com/game/gamecube/animal-crossing", "publisher": "Nintendo", "release_date": "Sep 15 2002", "developers": ["Nintendo"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/68629770dd086862c8cf4452c8cea58a-98.jpg", "descriptions": "Animal Crossing allows you to interact with a virtual village of animals that are doing something different every minute of every day.  With Animal Crossing's 24-hour clock, the game's unique events can be in synch with real time--as day turns to night in the real world, the sun will alsoAnimal Crossing allows you to interact with a virtual village of animals that are doing something different every minute of every day.  With Animal Crossing's 24-hour clock, the game's unique events can be in synch with real time--as day turns to night in the real world, the sun will also begin to set in the game.  The dynamic setup requires you to come back every day and carry out your daily routines, build relationships with villagers, celebrate special days, collect furnishings for your homes, and just live life in the unique world of Animal Crossing.… Expand"}, {"name": "Hotline Miami", "details_link": "https://www.metacritic.com/game/playstation-3/hotline-miami", "publisher": "Devolver Digital", "release_date": "Jun 25 2013", "developers": ["Abstraction Games", "Dennaton"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Stadia", "PlayStation 3"], "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/88e67e5ec07f1a443c7e33480c6459f9-98.jpg", "descriptions": "Step into the neon-soaked underground of 1980s Miami as bizarre messages on your answering machine seem to be urging you to commit terrible acts of violence - but will you obey? Hotline Miami reeks of raw brutality and skull crushing close combat as you find yourself outgunned and using yourStep into the neon-soaked underground of 1980s Miami as bizarre messages on your answering machine seem to be urging you to commit terrible acts of violence - but will you obey? Hotline Miami reeks of raw brutality and skull crushing close combat as you find yourself outgunned and using your wits to choreograph your way through impossible situations. Its visual style, a driving soundtrack, and a surreal plot will have you question your own thirst for blood. Bash and blast through over 20 multiscreen levels with 35 unique weapons and collect 25 game-altering masks.… Expand"}, {"name": "BlazBlue: Continuum Shift", "details_link": "https://www.metacritic.com/game/playstation-3/blazblue-continuum-shift", "publisher": "Aksys Games", "release_date": "Jul 27 2010", "developers": ["Arc System Works"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 87, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/6da550131dc57aab316ece7b15d3ad2d-98.jpg", "descriptions": "BlazBlue: Continuum Shift inherits all the key features of its predecessor while adding a few twists of its own. Tsubaki, ?-12 and Hazama will join the ranks of the veterans, who will be reborn with additional moves added to their arsenals. With new modes like Beginner Mode and TutorialBlazBlue: Continuum Shift inherits all the key features of its predecessor while adding a few twists of its own. Tsubaki, ?-12 and Hazama will join the ranks of the veterans, who will be reborn with additional moves added to their arsenals. With new modes like Beginner Mode and Tutorial Mode, even fighting game beginners can pull off combos like the pros and dive right into the action. [Aksys Games]… Expand"}, {"name": "Fight Night Round 4", "details_link": "https://www.metacritic.com/game/xbox-360/fight-night-round-4", "publisher": "EA Sports", "release_date": "Jun 23 2009", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 87, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/752806b0e403c1bdff581e509f4c8c7c-98.jpg", "descriptions": "Featuring a re-written gameplay engine, EA Sports Fight Night Round 4 adds a variety of fighting styles and boxer differentiation to authentically emulate the greatest fighters of all time. Pressure your opponent with the brawling inside style of young Mike Tyson, bobbing and weaving to setFeaturing a re-written gameplay engine, EA Sports Fight Night Round 4 adds a variety of fighting styles and boxer differentiation to authentically emulate the greatest fighters of all time. Pressure your opponent with the brawling inside style of young Mike Tyson, bobbing and weaving to set up powerful hooks and uppercuts. Capitalize on Muhammad Ali's reach, hand speed and fleetness of foot to bewilder your opponent with lightning fast jabs and straights from the outside. For the first time, EA Sports Fight Night Round 4 gives you the opportunity to pit these legendary heavyweights against one another and name a true champ. No fight will be the same with an all-new physics-based animation system that recreates the full spectrum of true-to-life punch impacts, giving boxers a devastating arsenal of punches, blocks and ring movement. The new physics system allows for missed punches, glancing punches, knockout blows and for the first time ever, rough and tumble inside fighting. Fatigue, adrenaline, footwork and timing all come into play as you hammer away at your opponents. [Electronic Arts]… Expand"}, {"name": "Inscryption", "details_link": "https://www.metacritic.com/game/playstation-5/inscryption", "publisher": "Devolver Digital", "release_date": "Aug 30 2022", "developers": ["Daniel Mullins Games"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/f0f846fd2081cd64d7063a5f4c64dd1f-98.jpg", "descriptions": "From the creator of Pony Island and The Hex comes the latest mind melting, self-destructing love letter to video games. Inscryption is an inky black card-based odyssey that blends the deckbuilding roguelike, escape-room style puzzles, and psychological horror into a blood-laced smoothie.From the creator of Pony Island and The Hex comes the latest mind melting, self-destructing love letter to video games. Inscryption is an inky black card-based odyssey that blends the deckbuilding roguelike, escape-room style puzzles, and psychological horror into a blood-laced smoothie. Darker still are the secrets inscrybed upon the cards...In Inscryption you will...Acquire a deck of woodland creature cards by draft, surgery, and self mutilation.Unlock the secrets lurking behind the walls of Leshy's cabin.Embark on an unexpected and deeply disturbing odyssey.… Expand"}, {"name": "Overcooked! All You Can Eat", "details_link": "https://www.metacritic.com/game/switch/overcooked!-all-you-can-eat", "publisher": "Team17", "release_date": "Mar 23 2021", "developers": ["Ghost Town Games Ltd."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox Series X", "Switch"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/639a3043332b1a50251f0f117fc1b3da-98.jpg", "descriptions": "Overcooked!, Overcooked! 2 and all additional content are blended together and remastered in this delicious definitive edition! Enjoy hundreds of levels of cooperative cooking chaos across increasingly perilous and obscure kitchens."}, {"name": "SteamWorld Heist", "details_link": "https://www.metacritic.com/game/wii-u/steamworld-heist", "publisher": "Image & Form", "release_date": "Oct 20 2016", "developers": ["Image & Form"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Wii U"], "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/58a523690499726d475c2515bbc00d36-98.jpg", "descriptions": "Join Captain Piper Faraday, smuggler and occasional pirate, as she recruits a rag-tag team of steam-driven robots and sets out on a daring adventure. With your hearty crew you’ll board, loot and shoot your way through enemy spaceships. Overcome the challenges of the vast frontier byJoin Captain Piper Faraday, smuggler and occasional pirate, as she recruits a rag-tag team of steam-driven robots and sets out on a daring adventure. With your hearty crew you’ll board, loot and shoot your way through enemy spaceships. Overcome the challenges of the vast frontier by upgrading your robots with unique abilities, weapons – and even stylish hats!… Expand"}, {"name": "The Legend of Zelda: Spirit Tracks", "details_link": "https://www.metacritic.com/game/ds/the-legend-of-zelda-spirit-tracks", "publisher": "Nintendo", "release_date": "Dec  7 2009", "developers": ["Nintendo"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "Fantasy", "Open-World"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/e076abbbb7449c898a7528dc00adf502-98.jpg", "descriptions": "The Legend of Zelda: Spirit Tracks sets hero Link on a daring new adventure. The game provides players with a new story, more puzzles and even a new mode of transportation. In this game, Link voyages by train, which offers up new possibilities for problem-solving. The game has the same lookThe Legend of Zelda: Spirit Tracks sets hero Link on a daring new adventure. The game provides players with a new story, more puzzles and even a new mode of transportation. In this game, Link voyages by train, which offers up new possibilities for problem-solving. The game has the same look and feel established in Phantom Hourglass. Link has a valuable new companion. While navigating dungeons, he's accompanied by a Phantom, a hulking suit of armor that responds to his commands. Players can tap the Phantom to take command of him, then draw a line on the touch screen to direct him where to go. The stout Phantom can walk through fire or lava, be used as a platform to carry Link above dangers, or even run interference to block Link from harm. When Link conducts the train, players enjoy a satisfying combination of action and real-time puzzle solving as they determine which track to take and how to best manipulate their speed. When on the train, Link must plot the best route to the end of the line around ever-moving obstacles. While en route, Link might need to fire an onboard cannon at enemies who attack the train or sound the whistle to scare animals off the tracks. Link uses a variety of new items and weapons, including the Whirlwind, which players activate by blowing into the microphone of the Nintendo DS system. As with The Legend of Zelda: Phantom Hourglass, players can draw notes on the in-game maps using the stylus on the touch screen. [Nintendo]… Expand"}]