[{"name": "NCAA Basketball 09", "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-basketball-09", "publisher": "Electronic Arts", "release_date": "Nov 17 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 70, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/9b85480015447de4512d23d03d88f245-98.jpg", "descriptions": "NCAA Basketball 09 operates on a new gameplay engine with over 1,000 new animation sequences that deliver a more responsive experience with improved ball physics and more intelligent AI. The new animation system enables gamers to apply pressure defense with new full-court presses and traps.NCAA Basketball 09 operates on a new gameplay engine with over 1,000 new animation sequences that deliver a more responsive experience with improved ball physics and more intelligent AI. The new animation system enables gamers to apply pressure defense with new full-court presses and traps. Plus, improved AI and animations enable quicker players to get up and down the floor faster and make better decisions running the lanes and driving to the rim. Animations can be interrupted at any time, enabling you to read and respond to the action on the floor, just like real life. Feel the excitement of game night with the band playing fight songs, the student section leading the cheers and popular ESPN college basketball broadcasters Dick Vitale, Brad Nessler, and Erin Andrews providing the commentary. [Electronic Arts]… Expand"}, {"name": "Below", "details_link": "https://www.metacritic.com/game/xbox-one/below", "publisher": "Microsoft Game Studios", "release_date": "Dec 14 2018", "developers": ["Capy Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Action Adventure", "General"], "meta_score": 70, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/2c902d667212c0e33f91be9b4808d317-98.jpg", "descriptions": "BELOW is a solitary journey through the haunted depths of a forbidden isle. Test your mettle in a large, interconnected underworld crawling with cunning wildlife, deadly traps, while stalked by a shadowy presence. Survive the perils of The Depths, and unearth what lies below..."}, {"name": "Homefront", "details_link": "https://www.metacritic.com/game/xbox-360/homefront", "publisher": "THQ", "release_date": "Mar 15 2011", "developers": ["Kaos Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 70, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/2dd698791cac41518adccd8530c5ca0a-98.jpg", "descriptions": "The year is 2027. The world has suffered a decade-long energy crisis, and economies have crumbled. Reduced to a mere shadow of the super power it once was, the United States became the target of a North Korean takeover. American malls, suburbs and city streets are now battlegrounds as theThe year is 2027. The world has suffered a decade-long energy crisis, and economies have crumbled. Reduced to a mere shadow of the super power it once was, the United States became the target of a North Korean takeover. American malls, suburbs and city streets are now battlegrounds as the civilian resistance fights for freedom. Featuring a compelling single player story crafted by John Milius (Apocalypse Now, Red Dawn), Homefront immerses gamers in an interactive and cinematic FPS experience where they assume an infantry role or take command of a wide variety of aerial and ground vehicles. In a land stripped of freedom, the brave will fight for their home. [THQ]… Expand"}, {"name": "Minute of Islands", "details_link": "https://www.metacritic.com/game/playstation-4/minute-of-islands", "publisher": "Mixtvision", "release_date": "Jun 13 2021", "developers": ["Fizbin", "Studio Fizbin"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/44a0199c7693f5f3f102e4821e017b28-98.jpg", "descriptions": "Explore strange and wonderful islands and dark labyrinths below in this narrative puzzle platformer. Guide young mechanic Mo on her quest to repair a world on the brink of collapse. The powerful Omni Switch at your disposal may not be enough to fix the damage that hides beneath the surface.."}, {"name": "Star Wars Episode I: Racer", "details_link": "https://www.metacritic.com/game/switch/star-wars-episode-i-racer", "publisher": "Aspyr", "release_date": "Jun 23 2020", "developers": ["LucasArts"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/342764752cc57d47df9e87824f953c65-98.jpg", "descriptions": "Join Jedi-to-be Anakin Skywalker in the Star Wars race of your life! Relive all the thrills and excitement of the Podracer sequence from Star Wars: Episode I. Hang on tight - with afterburners on, Podracers max out at a simulated 600 mph! Race in furious competition against more than 21Join Jedi-to-be Anakin Skywalker in the Star Wars race of your life! Relive all the thrills and excitement of the Podracer sequence from Star Wars: Episode I. Hang on tight - with afterburners on, Podracers max out at a simulated 600 mph! Race in furious competition against more than 21 opponents! Take on over 21 tracks in 8 unique worlds. Avoid hazards such as methane lakes, meteor showers and Tusken Raiders! Featuring spectacular 3D environments!… Expand"}, {"name": "Biped", "details_link": "https://www.metacritic.com/game/playstation-4/biped", "publisher": "NExT Studios", "release_date": "Apr  8 2020", "developers": ["NExT Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 70, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/3735945fb53c0e81df3bf02d39b7e14c-98.jpg", "descriptions": "Biped is a physics-based 3D co-op action-adventure game with a strong focus on moment-to-moment collaboration between two players. Two little bipedal robots, Aku and Sila, will walk side by side and embark on a fun and bonding journey to accomplish their mission on planet Earth."}, {"name": "Tembo the Badass Elephant", "details_link": "https://www.metacritic.com/game/xbox-one/tembo-the-badass-elephant", "publisher": "Sega", "release_date": "Jul 21 2015", "developers": ["Game Freak"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/c9b6c48a2e2d09711cce0bcf6d226854-98.jpg", "descriptions": "TEMBO THE BADASS ELEPHANT is a larger than life, 2D side-scrolling action adventure from the creative geniuses behind the Pokémon games"}, {"name": "America's Army: Rise of a Soldier", "details_link": "https://www.metacritic.com/game/xbox/americas-army-rise-of-a-soldier", "publisher": "Ubisoft", "release_date": "Nov 17 2005", "developers": ["Secret Level"], "platforms": "Xbox", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 70, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/893b266a5c3d274f7b5488a937c621fd-98.jpg", "descriptions": "America's Army: Rise of a Soldier is the Xbox version of the tactical first-person shooter developed in conjunction with the US Army. You can create a soldier and advance him or her through an army career from recruit to leader of a Special Forces team. America's Army: Rise of a Soldier alsoAmerica's Army: Rise of a Soldier is the Xbox version of the tactical first-person shooter developed in conjunction with the US Army. You can create a soldier and advance him or her through an army career from recruit to leader of a Special Forces team. America's Army: Rise of a Soldier also includes online multiplayer, so you can battle up to 16 players over the Internet.… Expand"}, {"name": "Virtua Tennis 2009", "details_link": "https://www.metacritic.com/game/playstation-3/virtua-tennis-2009", "publisher": "Sega", "release_date": "Jun  9 2009", "developers": ["Sumo Digital"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/3f25709f612f590f529627e1649d59c8-98.jpg", "descriptions": "Create your own player and join the new World Tour where you are trained by a real-life legend of tennis to compete for the #1 ranking against the biggest stars. Then take your character online and prove you're the best with the new online ranking system! With brand new courts, a new rollCreate your own player and join the new World Tour where you are trained by a real-life legend of tennis to compete for the #1 ranking against the biggest stars. Then take your character online and prove you're the best with the new online ranking system! With brand new courts, a new roll call of tennis stars to compete against and even more court mini-games, Virtua Tennis 2009 is set to be the #1 tennis title once again! New World Tour & Online Rankings - Take your career online and compete for the ultimate title of ‘Virtua Tennis Champion’ with the new PLAYSTATION 3 system and Xbox 360 online ranking system. With prize money you earn in online tournaments, you can purchase over 800 shop items in the new Tennis Store and upgrade your character. New Players / Courts - Play as or against over 20 of the world’s top players, including seven new to Virtua Tennis and three legends. All-new arenas and the officially licensed Davis Cup provide the most realistic tennis competition to date. New Player Creation System - You now have full control over facial, body and clothing customization, as well as the depth to populate the game world with hundreds of unknown opponents. More Court Games. Playing alone or with up to three friends compete in 12 mini-games, five completely new, and upload your hi-scores on the worldwide rankings in games such as Zoo Feeder and Pirate War. Improved Gameplay - Courtside action is better than ever, with extensive updates to the famous arcade-style Virtua Tennis match engine, as well as 3D crowds and a more realistic courtside experience. [Sega]… Expand"}, {"name": "Road 96: Mile 0", "details_link": "https://www.metacritic.com/game/playstation-5/road-96-mile-0", "publisher": "Ravenscourt", "release_date": "Apr  4 2023", "developers": ["Digixart Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/2fc35d6557e7a1389f35b53dd85315da-98.jpg", "descriptions": "Road 96: Mile 0 is a Narrative-Adventure game with a musical component created by DigiXArt, the French studio behind the successful Road 96, 11-11 Memories Retold and 5 Pegases Awards winner. Published by Ravenscourt, players will alternate between the roles of Zoe and Kaito, two teenagersRoad 96: Mile 0 is a Narrative-Adventure game with a musical component created by DigiXArt, the French studio behind the successful Road 96, 11-11 Memories Retold and 5 Pegases Awards winner. Published by Ravenscourt, players will alternate between the roles of Zoe and Kaito, two teenagers with different backgrounds and beliefs. They live and explore White Sands, a luxurious condominium where Petria´s elite reside and where Kaito´s parents work.\rZoe is one of the characters of Road 96. She comes from the rich side of the city and her father works for the government. Kaito, a character from Lost in Harmony, lives in the less privileged area. They're good friends, but that could all change quite soon.\r\"Their journey in Road 96: Mile 0 will challenge their friendship and everything they believe in. They say money doesn’t buy happiness, nor friendship. These teens are dreamers and they are going to learn where they belong. Will they remain friends?\r ROAD 96 WORLD\rUnderstand the previous event of Road 96 and what made Zoe flee from her home. Play as Zoe and Kaito to shape the evolution of their fate. Besides this, you will run into many of the colorful characters from Road 96. Get to experience another side of the troubled country of Petria.\r IT'S ALL ABOUT FRIENDSHIP\rThis is a story about conflict and difference of opinion between two friends. Zoe and Kaito come from two different worlds, but they are unified by a powerful friendship. They will face many challenges, can they overcome them?\r MUSICAL RIDES\rThe musical segments of the game are a real emotional experience that put you into inner worlds of Zoe and Kaito. You will have to make choices and ride and dodge to find your way through these beautiful psychedelic trips.… Expand"}, {"name": "Section 8: Prejudice", "details_link": "https://www.metacritic.com/game/playstation-3/section-8-prejudice", "publisher": "TimeGate Studios", "release_date": "Jul 26 2011", "developers": ["TimeGate Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/2d53a15e040625f5ba4f3d34e4c5114b-98.jpg", "descriptions": "Section 8: Prejudice is a sci-fi shooter featuring online team-based multiplayer."}, {"name": "The Callisto Protocol", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-callisto-protocol", "publisher": "KRAFTON Inc.", "release_date": "Dec  2 2022", "developers": ["Striking Distance Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/4192696ec5c80d198f64889b624bee8f-98.jpg", "descriptions": "Set on Jupiter's moon Callisto in the year 2320, The Callisto Protocol is a next-generation take on survival horror. The game challenges players to escape the maximum security Black Iron Prison and uncover its terrifying secrets. A blend of horror, action, and immersive storytelling, theSet on Jupiter's moon Callisto in the year 2320, The Callisto Protocol is a next-generation take on survival horror. The game challenges players to escape the maximum security Black Iron Prison and uncover its terrifying secrets. A blend of horror, action, and immersive storytelling, the game aims to set a new bar for horror in interactive entertainment.… Expand"}, {"name": "Pathologic 2", "details_link": "https://www.metacritic.com/game/pc/pathologic-2", "publisher": "tinyBuild", "release_date": "May 28 2019", "developers": ["Ice-Pick Lodge", "tinyBuild"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 70, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/27938ac5f7201f03e8a561532f6105a1-98.jpg", "descriptions": "Pathologic 2 is an Open World Survival Horror game where you fight against a devastating plague. As the only sane medic around, save the town before it's fully consumed."}, {"name": "Top Spin 2", "details_link": "https://www.metacritic.com/game/pc/top-spin-2", "publisher": "2K Sports", "release_date": "Mar 16 2007", "developers": ["Aspyr", "2K Sports"], "platforms": ["Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/f6dd292981564115896ec1e0e35a8ad8-98.jpg", "descriptions": "Top Spin 2 serves up 24 top-ranked athletes (Roger Federer, Maria Sharapova and more), a wide variety of events including all four Grand Slam tournaments, a multi-season career, and a set of new risk and advanced shots. In detailed, real-world venues such as Wimbledon, gamers can createTop Spin 2 serves up 24 top-ranked athletes (Roger Federer, Maria Sharapova and more), a wide variety of events including all four Grand Slam tournaments, a multi-season career, and a set of new risk and advanced shots. In detailed, real-world venues such as Wimbledon, gamers can create realistic player models and their own on-court style with slices, drops, top spins, lobs, and drives against the tennis world’s best-of-the-best. For experienced players, Top Spin 2 adds depth to gameplay with a number of risk shots and advanced controls, giving gamers the ability to pick apart their opponent piece-by-piece. If hard-core competition isn't your thing, take it easy and enjoy multiplayer party games, like Splash Court, Wall Breaker, and Time Bomb. The game supports up to four players on a single PC, and two players over the Internet or a LAN. [Aspyr Media]… Expand"}, {"name": "Rainbow Moon", "details_link": "https://www.metacritic.com/game/playstation-3/rainbow-moon", "publisher": "EastAsiaSoft", "release_date": "Jul 10 2012", "developers": ["SideQuest Studios"], "platforms": ["PlayStation 4", "PlayStation Vita", "PlayStation 3"], "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/71b145f0bc2b4c7cffe0bdee08e07f32-98.jpg", "descriptions": "Rainbow Moon is a strategic RPG with a strong emphasis on character development."}, {"name": "Fe", "details_link": "https://www.metacritic.com/game/xbox-one/fe", "publisher": "Electronic Arts", "release_date": "Feb 16 2018", "developers": ["Zoink!"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 70, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/e9adf34c12e44112bc6370e44423937d-98.jpg", "descriptions": "In Fe, players are enchanted by the natural surroundings as they uncover secrets, complete side quests, and meet the mystical creatures of the forest. Players climb, glide and dig as they voyage through the open experience meeting, interacting and rescuing plants and animals from the SilentIn Fe, players are enchanted by the natural surroundings as they uncover secrets, complete side quests, and meet the mystical creatures of the forest. Players climb, glide and dig as they voyage through the open experience meeting, interacting and rescuing plants and animals from the Silent Ones, the machine antagonists that are threatening the forest. Through unparalleled freedom of exploration in a world full of discoveries to uncover, players become Fe and never want to leave. [Electronic Arts]… Expand"}, {"name": "Coffee Talk", "details_link": "https://www.metacritic.com/game/playstation-4/coffee-talk", "publisher": "Toge Productions", "release_date": "Jan 30 2020", "developers": ["Toge Productions"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 70, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/5db8b596b5241fdf7b1633b4b18a2761-98.jpg", "descriptions": "Coffee Talk is a coffee brewing and heart-to-heart talking simulator about listening to fantasy-inspired modern peoples’ problems, and helping them by serving up a warm drink or two. Immerse yourself in the stories of alternative-Seattle inhabitants that modern readers will find stronglyCoffee Talk is a coffee brewing and heart-to-heart talking simulator about listening to fantasy-inspired modern peoples’ problems, and helping them by serving up a warm drink or two. Immerse yourself in the stories of alternative-Seattle inhabitants that modern readers will find strongly echo the world around them.… Expand"}, {"name": "AER: Memories of Old", "details_link": "https://www.metacritic.com/game/playstation-4/aer-memories-of-old", "publisher": "Daedalic Entertainment", "release_date": "Oct 25 2017", "developers": ["Daedalic Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/20c649da5bffc7b4505f2b373dce629e-98.jpg", "descriptions": "AER puts you in the shoes of Auk, a magical shape-shifting girl who can transform between human and bird. As one of the last few shapeshifters, you are sent on a pilgrimage to the Land of Gods. Uncover the secrets that will help save reality itself."}, {"name": "AIPD - Artificial Intelligence Police Department", "details_link": "https://www.metacritic.com/game/xbox-one/aipd---artificial-intelligence-police-department", "publisher": "Blazing Badger", "release_date": "Jan 29 2016", "developers": ["Blazing Badger"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/e75fcf2b5b4bf99ae4935a74aa8b454f-98.jpg", "descriptions": "Enter the AI arena and fight evil artificial intelligences with a variety of weapons and modifications. AIPD is a top-down coop twin-stick shooter with a visual style that is an homage to 80s neon art styles, pioneered by games like Minestorm on the Vectrex console system or feature filmsEnter the AI arena and fight evil artificial intelligences with a variety of weapons and modifications. AIPD is a top-down coop twin-stick shooter with a visual style that is an homage to 80s neon art styles, pioneered by games like Minestorm on the Vectrex console system or feature films like TRON. … Expand"}, {"name": "Shadow Blade: Reload", "details_link": "https://www.metacritic.com/game/pc/shadow-blade-reload", "publisher": "Dead Mage Studio", "release_date": "Aug 10 2015", "developers": ["Dead Mage Studio", "Dead Mage"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 70, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/f29aa8116c15c7bcd9fe5e6e8ca8b1b5-98.jpg", "descriptions": "Kuro is a young guy on his quest to become the Shadow Blade. He seeks the teachings of the last remaining ninja master. You will guide him through challenging levels, around countless traps, sneaking past enemies or right over their dead bodies. You have to be fast, be stealthy, be aware ofKuro is a young guy on his quest to become the Shadow Blade. He seeks the teachings of the last remaining ninja master. You will guide him through challenging levels, around countless traps, sneaking past enemies or right over their dead bodies. You have to be fast, be stealthy, be aware of your environment. You have to be a Ninja! … Expand"}, {"name": "Before the Echo", "details_link": "https://www.metacritic.com/game/pc/before-the-echo", "publisher": "Iridium Studios", "release_date": "Oct 20 2011", "developers": ["Iridium Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/8e267754ff95395aec1432796bf08eb3-98.jpg", "descriptions": "Sequence is a rhythm-based RPG in which you battle a series of opponents to escape from a mysterious tower."}, {"name": "Little League World Series Baseball 2008", "details_link": "https://www.metacritic.com/game/wii/little-league-world-series-baseball-2008", "publisher": "Activision", "release_date": "Aug  5 2008", "developers": ["Now Production"], "platforms": "Wii", "genres": ["Sports", "Traditional", "Team", "Baseball", "Arcade", "Arcade"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/9ded7aa1f7f3dc5d37fe0d9b95efa461-98.jpg", "descriptions": "Little League World Series is the first officially licensed Little League video game to hit next-generation consoles. Bat, pitch and field your way from local sandlot slugger to Little League World Series Champion. Featuring eight U.S. and eight international teams, extraordinarily deepLittle League World Series is the first officially licensed Little League video game to hit next-generation consoles. Bat, pitch and field your way from local sandlot slugger to Little League World Series Champion. Featuring eight U.S. and eight international teams, extraordinarily deep character customization, World Series Mode, and various skill based challenges, Little League World Series offers an exciting, authentic baseball experience. Motion-sensing controls on Wii make it accessible for Little League players and parents, while the DS version gives players the freedom to get on the diamond anywhere. [Activision]… Expand"}, {"name": "Lemony Snicket's A Series of Unfortunate Events", "details_link": "https://www.metacritic.com/game/xbox/lemony-snickets-a-series-of-unfortunate-events", "publisher": "Activision", "release_date": "Nov 10 2004", "developers": ["Activision"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/75070ceb3f953a0dc311caf88f431711-98.jpg", "descriptions": "Based on the book series and the feature film, this game tells the tale of Violet, Klaus, and Sunny Baudelaire, whose parents perish in a fire. Soon after, they are sent to live with their sinister uncle, Count Olaf, in a cavernous mansion. Now you can help the Baudelaire orphans by usingBased on the book series and the feature film, this game tells the tale of Violet, Klaus, and Sunny Baudelaire, whose parents perish in a fire. Soon after, they are sent to live with their sinister uncle, Count Olaf, in a cavernous mansion. Now you can help the Baudelaire orphans by using their special skills to journey through 15 missions, from the deep catacombs beneath Olaf's mansion to the gloomy shores of Lake Lachrymose. Collect household items and assemble them into contraptions for puzzle-solving and combat. Wield those items to battle Olaf's minions.… Expand"}, {"name": "Shadow Warrior", "details_link": "https://www.metacritic.com/game/playstation-4/shadow-warrior", "publisher": "Majesco Games", "release_date": "Oct 21 2014", "developers": ["Flying Wild Hog"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 70, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/d7794841d33905af32df22c90e827c2e-98.jpg", "descriptions": "Shadow Warrior is bold reimagining of 3D Realms' cult classic shooter from developer Flying Wild Hog (Hard Reset) and independent game label Devolver Digital (Serious Sam 3: BFE, Hotline Miami, LUFTRAUSERS) for PC and next-gen consoles.  Blending the viciously over-the-top gunplay of itsShadow Warrior is bold reimagining of 3D Realms' cult classic shooter from developer Flying Wild Hog (Hard Reset) and independent game label Devolver Digital (Serious Sam 3: BFE, Hotline Miami, LUFTRAUSERS) for PC and next-gen consoles.  Blending the viciously over-the-top gunplay of its predecessor with the elegant precision of the powerful katana, Shadow Warrior is an imaginative take on the classic arcade-style shooter.… Expand"}, {"name": "Aliens: Fireteam Elite", "details_link": "https://www.metacritic.com/game/xbox-series-x/aliens-fireteam-elite", "publisher": "Cold Iron Studios", "release_date": "Aug 24 2021", "developers": ["Cold Iron Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 70, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/33a351e49da1446e06a5855c9daa03fa-98.jpg", "descriptions": "2202. A mysterious distress call reroutes your Marine Assault Unit to LV-895 in the outer colonies, where deadly Xenomorph legions, hidden corporate secrets, and ancient alien ruins await your arrival. Set in the iconic Alien universe, Aliens: Fireteam is a cooperative third-person survival2202. A mysterious distress call reroutes your Marine Assault Unit to LV-895 in the outer colonies, where deadly Xenomorph legions, hidden corporate secrets, and ancient alien ruins await your arrival. Set in the iconic Alien universe, Aliens: Fireteam is a cooperative third-person survival shooter that drops your fireteam of hardened marines into a desperate fight to contain the Xenomorph threat.\r Face off against waves of terrifying Xenomorph and Weyland-Yutani Synthetic foes alongside two players or AI teammates, as you and your fireteam desperately fight your way through four unique campaigns that introduce new storylines to the Alien universe. Create and customize your own Colonial Marine, choosing from an extensive variety of classes, weapons, gear and perks, battling overwhelming odds in this heart-pounding survival shooter experience.\r THE ULTIMATE HUNT\rPlay a pivotal role in the epic events that occur 23 years after the original Alien trilogy as a Colonial Marine stationed aboard the USS Endeavor, battling terrifying Xenomorph threats.\r SURVIVE THE HIVE\rFace overwhelming odds against over 20 enemy types, including 11 different Xenomorphs along the evolutionary scale from Facehuggers to Praetorians, each designed with their own intelligence to ambush, outsmart and eviscerate vulnerable marines.\r CUSTOMIZE YOUR FIRETEAM\rChoose from five unique classes - Gunner, Demolisher, Technician, Doc and Recon - each with their own special abilities and character perks. Utilize an extensive arsenal of 30+ weapons and 70+ mods/attachments in your effort to eradicate the Alien threat.… Expand"}, {"name": "Tropico 6 - Nintendo Switch Edition", "details_link": "https://www.metacritic.com/game/switch/tropico-6---nintendo-switch-edition", "publisher": "Kalypso", "release_date": "Nov  6 2020", "developers": ["Limbic Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 70, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/7/2c6c8cfa2b2281e3f8acbf4b300016bb-98.jpg", "descriptions": "In times of political turmoil and social unrest, the people are calling out for a visionary leader, one who will steer the fate of their country with foresight and ingenuity. Will you answer that call?"}, {"name": "Romancing SaGa 2", "details_link": "https://www.metacritic.com/game/switch/romancing-saga-2", "publisher": "Square Enix", "release_date": "Dec 15 2017", "developers": ["Square Enix", "ArtePiazza"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 70, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/364682c43eb26d114cf752543bd804ad-98.jpg", "descriptions": "Romancing SaGa 2, originally released only in Japan in 1993, has been completely remastered and now receives its first ever official English translation!No two players will experience the story in the same way\n\nThe SaGa series is one of Square Enix's most beloved. The first three titlesRomancing SaGa 2, originally released only in Japan in 1993, has been completely remastered and now receives its first ever official English translation!No two players will experience the story in the same wayThe SaGa series is one of Square Enix's most beloved. The first three titles were originally branded overseas under the \"FINAL FANTASY LEGEND\" moniker , and garnered critical acclaim for their complex yet compelling combat system.Romancing SaGa 2 takes the varied gameplay of other entries in the series and combines it with an open-ended free-form scenario system whose story is as vast as the world in which it plays out. The player takes the role of a succession of emperors, painting the history of the world with each and every action.Familiar series hallmarks such as formations and glimmers make a return in this unique title.StoryIt all begins with the song of a lone bard in a bustling pub.Great nations such as the Varennes Empire, which had once ensured peace throughout the world, stagnated and atrophied over the course of centuries, and sinister forces started emerging in outlying areas.Ere long, peace spiraled into war and the common folk spoke in hushed words of the Seven Heroeshistorical figures who saved the world once and who, it was hoped, would do so again.Additional Elements*New dungeons*New classes: diviner and ninja*New Game+*Autosave*UI specifically designed for smartphonesAndroid 4.2.2 or above recommended.Not compatible with all devices.… Expand"}, {"name": "Rainbow Moon", "details_link": "https://www.metacritic.com/game/playstation-4/rainbow-moon", "publisher": "SideQuest Studios", "release_date": "Feb 16 2016", "developers": ["SideQuest Studios"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 70, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/d92a4aacf5699ed8ce5b8924b07c4e31-98.jpg", "descriptions": "Download Rainbow Moon and embark on an epic adventure through a beautiful open world! \r\rRainbow Moon is a beautiful role-playing game filled with exploration, turn-based battles, and character development. Six playable main characters with upgradeable weapons and armor, and more than 20Download Rainbow Moon and embark on an epic adventure through a beautiful open world! \r\rRainbow Moon is a beautiful role-playing game filled with exploration, turn-based battles, and character development. Six playable main characters with upgradeable weapons and armor, and more than 20 challenging dungeons await you in a fascinating story that lasts over 40 hours.\r Play for 100 hours and more, including all side quests and optional content.\r Acquire and customize new weapons, armor, and accessories.\r Battle around 100 nasty monsters from 17 different classes.\r Learn over 120 exciting special skills.\r Earn more than 50 trophies, including a prestigious platinum trophy.\r Download additional content and boost your journey.… Expand"}, {"name": "Castlevania: Lords of Shadow 2", "details_link": "https://www.metacritic.com/game/xbox-360/castlevania-lords-of-shadow-2", "publisher": "Konami", "release_date": "Feb 25 2014", "developers": ["Mercury Steam"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Fantasy", "Action Adventure", "General", "Fantasy"], "meta_score": 70, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/4227251336e6b6c9496f2bdba6e28432-98.jpg", "descriptions": "In Castlevania: Lords of Shadow, the origin of Dracula and his legendary connection with the Belmonts was revealed. In Castlevania: Lords of Shadow 2, fans can expect thrilling new twists and challenges. In this shocking conclusion to the Lords of Shadow saga, Dracula returns once again,In Castlevania: Lords of Shadow, the origin of Dracula and his legendary connection with the Belmonts was revealed. In Castlevania: Lords of Shadow 2, fans can expect thrilling new twists and challenges. In this shocking conclusion to the Lords of Shadow saga, Dracula returns once again, weakened and yearning for release from his immortal bonds. Facing a new and powerful threat, the vampire lord must reacquire his old powers – and only his castle holds the key. However, the famed Belmont clan also seek his ultimate destruction.… Expand"}, {"name": "The Godfather: The Don's Edition", "details_link": "https://www.metacritic.com/game/playstation-3/the-godfather-the-dons-edition", "publisher": "Electronic Arts", "release_date": "Mar 20 2007", "developers": ["EA Redwood Shores"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 70, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/11703692355f3b1325c9f4f06a85e91e-98.jpg", "descriptions": "The Godfather The Don's Edition includes The Corleone Expansion Pack with new gameplay and missions. The game offers brand new ways to go from Soldier to Don as you gain control of the streets of New York. Follow the path of an Enforcer or Operator; each with its own unique perks andThe Godfather The Don's Edition includes The Corleone Expansion Pack with new gameplay and missions. The game offers brand new ways to go from Soldier to Don as you gain control of the streets of New York. Follow the path of an Enforcer or Operator; each with its own unique perks and abilities to earn. Now you can chat up specific characters to get the skinny on dirty cops, take down two additional revised compounds of rival Families, execute five new contract hits, and call in larger Corleone Hit Squads when the going gets tough. With The Godfather The Don’s Edition also having the new Shipyard and Rail yard transportation hubs to explore and exploit; your path to the head of La Cosa Nostra is wrought with all new perils and excitement. The Godfather The Don’s Edition takes full advantage of the SIXAXIS controller for PS3; manhandle your controller to manhandle your opponent. [Electronic Arts]… Expand"}, {"name": "Cities XL 2011", "details_link": "https://www.metacritic.com/game/pc/cities-xl-2011", "publisher": "Focus Home Interactive", "release_date": "Oct 14 2010", "developers": ["Monte Cristo Multimedia", "Monte Cristo"], "platforms": "PC", "genres": ["Strategy", "City Building", "Management", "Modern", "Modern", "Government"], "meta_score": 70, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/b55409f591f9254fa6642078d0fb2131-98.jpg", "descriptions": "With Cities XL 2011, build and develop gigantic cities on realistic 3D maps, thanks to an incredible collection counting more than 700 buildings and unique structures. You are the virtual mayor and as such, you will need to find the right balance between economic development for your city,With Cities XL 2011, build and develop gigantic cities on realistic 3D maps, thanks to an incredible collection counting more than 700 buildings and unique structures. You are the virtual mayor and as such, you will need to find the right balance between economic development for your city, public transportation, housing, social services, leisure activities and even special events in town. Realism has been pushed a little bit deeper with larger cities, more realistic and more sophisticated than ever before! … Expand"}, {"name": "The Solitaire Conspiracy", "details_link": "https://www.metacritic.com/game/pc/the-solitaire-conspiracy", "publisher": "Mike Bithell", "release_date": "Oct  6 2020", "developers": ["Mike Bithell"], "platforms": ["PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/f627226dc1b24817999d44d291094b18-98.jpg", "descriptions": "We need your help, Spymaster. Join a world of near-future spies and take on a supervillain in this supercharged take on classic Solitaire. Precision engineered for replayable espionage action."}, {"name": "Lake", "details_link": "https://www.metacritic.com/game/pc/lake", "publisher": "Whitethorn Digital", "release_date": "Sep  1 2021", "developers": ["Gamious"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/f22772bb17d683254fadcf92167d5126-98.jpg", "descriptions": "It's 1986 - Meredith Weiss takes a break from her career in the big city to deliver mail in her hometown. How will she experience two weeks in beautiful Providence Oaks, with its iconic lake and quirky community? And what will she do next? It's up to you."}, {"name": "Sudden Strike 4", "details_link": "https://www.metacritic.com/game/pc/sudden-strike-4", "publisher": "Kalypso", "release_date": "Aug 11 2017", "developers": ["Kite Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/c8bb1c18f0d816ad23326bcca2fe1c16-98.jpg", "descriptions": "Sudden Strike is back! The beloved Real Time Strategy series returns, this time with bigger battlefields, more units, better graphics, new scenarios and legendary commanders with individual abilities  all of which makes Sudden Strike 4 more tactical and realistic than ever before!\r SuddenSudden Strike is back! The beloved Real Time Strategy series returns, this time with bigger battlefields, more units, better graphics, new scenarios and legendary commanders with individual abilities  all of which makes Sudden Strike 4 more tactical and realistic than ever before!\r Sudden Strike 4 sends you off on three extensive campaigns set amongst the battlefields of World War 2. Commanding the British and American, German or Soviet troops, you will lead over 100 different units into battle; like the German bomber Heinkel He111, the Russian T-34 tank, the British Hawker Typhoon fighter plane and the notorious German PanzerkampfwagenVI Tiger. In a first for the Sudden Strike series, you can now choose from one of nine individual commanders, such as George Patton or Bernard Montgomery, who will each allow for different approaches to combat and boast unique abilities.\r Prove your strategic expertise in over 20 demanding single player scenarios, the challenge-focused skirmish mode and the ultra-competitive multiplayer mode. Excellence will be rewarded through a unique reward system, where successfully completing missions will unlock exclusive content, such as historical film footage from the era.\r Sudden Strike 4 offers countless ways to vanquish your opponents. Exploit the weak spots of tanks, set up an ambush, occupy buildings with infantry, outmaneuver the enemy with clever positioning or unleash devastating air strikes  how you approach each mission is up to you!… Expand"}, {"name": "CIMA: The Enemy", "details_link": "https://www.metacritic.com/game/game-boy-advance/cima-the-enemy", "publisher": "Natsume", "release_date": "Nov 17 2003", "developers": ["Neverland"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/91fa9cbe52bc7620d774512d241c8af9-98.jpg", "descriptions": "For decades, the human race and the CIMA race have been in constant conflict with one another. As Ark J, your mission is to guard the gate between the two worlds, protect your appointed town, and ultimately, find peace. You'll progress through a nonlinear storyline while solving puzzles,For decades, the human race and the CIMA race have been in constant conflict with one another. As Ark J, your mission is to guard the gate between the two worlds, protect your appointed town, and ultimately, find peace. You'll progress through a nonlinear storyline while solving puzzles, exploring worlds, and battling enemies. The game includes a combat system that features both action and strategy elements. Another feature lets you activate non-playable characters to help you accomplish your goals. … Expand"}, {"name": "Hunter: The Reckoning", "details_link": "https://www.metacritic.com/game/gamecube/hunter-the-reckoning", "publisher": "Interplay", "release_date": "Nov 18 2002", "developers": ["High Voltage Software"], "platforms": ["Xbox 360", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/61900c57d21dc6f8af66207df210f085-98.jpg", "descriptions": "Set in White Wolf's World of Darkness, Hunter: The Reckoning lets you take the role of one of four different hunters--Deuce, a biker ex-con; Father Cortez, a prison chaplain; Kassandra, a raver chick; and Samantha, a tough ex-cop. Armed with a variety of fearsome weaponry--ranging from axesSet in White Wolf's World of Darkness, Hunter: The Reckoning lets you take the role of one of four different hunters--Deuce, a biker ex-con; Father Cortez, a prison chaplain; Kassandra, a raver chick; and Samantha, a tough ex-cop. Armed with a variety of fearsome weaponry--ranging from axes to shotguns--you'll battle it out with hordes of supernatural enemies. Intense action combined with multiplayer support brings the true spirit of Hunter: The Reckoning to life.… Expand"}, {"name": "Mat Hoffman's Pro BMX 2", "details_link": "https://www.metacritic.com/game/gamecube/mat-hoffmans-pro-bmx-2", "publisher": "Activision", "release_date": "Oct  8 2002", "developers": ["Rainbow Studios"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 70, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/8724cc4fb16acc5b378968b5de03e08d-98.jpg", "descriptions": "Matt Hoffman's Pro BMX 2 takes you for a ride through free-roaming cities, where you can perform a variety of stunts on your bike. Choose from an array of professional riders--including Matt Hoffman, Ruben Alcantara, Cory Nastazio, Mike Escamilla, Nathan Wessel, and Joe Kowalski--and begin aMatt Hoffman's Pro BMX 2 takes you for a ride through free-roaming cities, where you can perform a variety of stunts on your bike. Choose from an array of professional riders--including Matt Hoffman, Ruben Alcantara, Cory Nastazio, Mike Escamilla, Nathan Wessel, and Joe Kowalski--and begin a skating career. You'll travel to eight expansive cities that come to life with helicopters, boats, cars, and pedestrians. Then, challenge your friend in Push mode, where every time you score big, your side of the screen gets bigger while your friend's shrinks. … Expand"}, {"name": "Crash Bandicoot: The Wrath of Cortex", "details_link": "https://www.metacritic.com/game/xbox/crash-bandicoot-the-wrath-of-cortex", "publisher": "VU Games", "release_date": "Apr 15 2002", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/31572e6dfd1f1ca6462d9652584a4ee1-98.jpg", "descriptions": "The fifth Crash adventure features engaging gameplay, quirky characters and exotic locales.  Still smarting from his last defeat, Dr. Neo Cortex has developed a new diabolical plan to steal ancient crystals and unleash destructive gods on Crash and the planet Earth.  With Crash and hisThe fifth Crash adventure features engaging gameplay, quirky characters and exotic locales.  Still smarting from his last defeat, Dr. Neo Cortex has developed a new diabolical plan to steal ancient crystals and unleash destructive gods on Crash and the planet Earth.  With Crash and his sister Coco, it's now up to you to find and return all the crystals across dangerous levels, including a volcanic island, a Japanese village, and the jungles of Africa.  You'll find many ways to move around, whether you maneuver a Jeep, fly a hang glider, or pilot a Crash-Mech.  But don't marvel too long at the new inventions, because you might find yourself in a heap of destruction.… Expand"}, {"name": "Okage: Shadow King", "details_link": "https://www.metacritic.com/game/playstation-2/okage-shadow-king", "publisher": "SCEA", "release_date": "Oct  1 2001", "developers": ["Zener Works"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 70, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/aafbfe50b19c8b53e9b2315e7bae60b6-98.jpg", "descriptions": "In an unexpected twist of fate, the spirit of an evil king is unleashed and possesses the shadow of an innocent young boy named Ari. In one magical moment, Ari's life is turned upside down. Wielding the burden of the evil ghostly being. Ari must journey across a wonderfully animated,In an unexpected twist of fate, the spirit of an evil king is unleashed and possesses the shadow of an innocent young boy named Ari. In one magical moment, Ari's life is turned upside down. Wielding the burden of the evil ghostly being. Ari must journey across a wonderfully animated, whimsical world in order to free his shadow. [Sony]… Expand"}, {"name": "ESPN Final Round Golf 2002", "details_link": "https://www.metacritic.com/game/game-boy-advance/espn-final-round-golf-2002", "publisher": "Konami", "release_date": "Aug 28 2001", "developers": ["Konami Computer Entertainment Nagoya"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/8bc08da52c4a50b5371367f8320745da-98.jpg", "descriptions": "Golf action has moved from the greens to the portable convenience of the Game Boy® Advance. Choose from 14 golfers, 5 courses and a variety of club. You will experience realistic weather conditions such as wind, rain and sunshine on the fairway. Tee off against up to 3 other playersGolf action has moved from the greens to the portable convenience of the Game Boy® Advance. Choose from 14 golfers, 5 courses and a variety of club. You will experience realistic weather conditions such as wind, rain and sunshine on the fairway. Tee off against up to 3 other players using the Game Boy® Advance Game Link® cable.… Expand"}, {"name": "Echelon", "details_link": "https://www.metacritic.com/game/pc/echelon", "publisher": "Bethesda Softworks", "release_date": "May 16 2001", "developers": ["Buka Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Sci-Fi", "Small Spaceship", "Futuristic Jet", "Combat"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/0488e95b0699f4d03c47b89f02d929d0-98.jpg", "descriptions": "Russia's Buka Entertainment developed this space/air-combat game which combines elements from filght sim and science-fiction action games, and which pits young hotshot fighter pilots against an alien race of Velians in a series of fast-paced battles."}, {"name": "Soulbringer", "details_link": "https://www.metacritic.com/game/pc/soulbringer", "publisher": "Interplay", "release_date": "Jun 30 2000", "developers": ["Infogrames"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 70, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/bef8cd593eabe0a637790cafc6b2c6b6-98.jpg", "descriptions": "It features a five-act plot that involves the player in a fully 3-D world with 1,000 years of history. It includes over 60 speaking NPCs with over 450 people to meet plus over 100 locations to visit spanning an incredible 60 unique maps!  [Interplay]"}, {"name": "Red Faction: Guerrilla Re-Mars-tered", "details_link": "https://www.metacritic.com/game/playstation-4/red-faction-guerrilla-re-mars-tered", "publisher": "THQ Nordic", "release_date": "Jul  3 2018", "developers": ["Volition Inc."], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 70, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/8/41aaf566ecc48bb2db332edc68053790-98.jpg", "descriptions": "Set 50 years after the climactic events of the original Red Faction, Red Faction: Guerrilla allows players to take the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Red Faction: GuerrillaSet 50 years after the climactic events of the original Red Faction, Red Faction: Guerrilla allows players to take the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Red Faction: Guerrilla still defines the limits of destruction-based game-play with a huge open-world, fast-paced guerrilla-style combat, and true physics-based destruction.Features:* Open World Guerrilla Warfare - You decide who, when, where and how to battle. Utilize guerrilla tactics, improvised weaponry, and modified vehicles to lead insurgent attacks on EDF targets. Launch attacks based on your own gameplay style, take on missions in any order you choose, or engage in destructive activities to weaken the EDF's grip on Mars.* Strategic Destruction - Use destruction to your tactical advantage, setting ambushes or chain reaction explosions to attack enemy strongholds and permanently modify the game environment. Leverage fully-dynamic physics-based destruction to improvise on the fly: blow holes in a wall or floor to set an ambush or escape, take out a staircase to stop your pursuers, or drive vehicles through blown out walls.* Evolving & Emergent Gameplay - Carve your path through an ever-changing landscape as you improvise your combat tactics - mixing gameplay styles, vehicles, weapons and explosives to defeat the EDF.* Epic Sci-Fi Setting - Explore the huge, unforgiving Martian landscape, from the desolate mining outpost of Parker to the gleaming EDF capital city of Eos; then tear through the fully destructible open-world environments swarming with EDF forces, Red Faction resistance fighters, and the downtrodden settlers caught in the cross-fire.* Multiplayer Combat - There is no place to hide when you put your guerrilla warfare skills to the test in a variety of highly destructive multiplayer combat modes.Re-Mars-tered Features:> Fully reworked graphics Heavily reworked textures and graphic features adding for example specular maps.> Improved shadow rendering> Improved Lighting> Shader & Postprocessing rework> Native 4k support for the finest up to date mars destruction experience ever… Expand"}, {"name": "Shining Resonance Refrain", "details_link": "https://www.metacritic.com/game/switch/shining-resonance-refrain", "publisher": "Sega", "release_date": "Jul 10 2018", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 70, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/2a6a9367cd1c8871394312cf479cb8a9-98.jpg", "descriptions": "Assume the role of Yuma Ilvern and stop the Empire from exploiting the power of the ancient dragons, including the soul of the Shining Dragon within you. With the help of your friends, realize your destiny, save Astoria, and unleash the strength you’ve always had locked away."}, {"name": "Elefunk", "details_link": "https://www.metacritic.com/game/playstation-3/elefunk", "publisher": "SCEA", "release_date": "Jul 17 2008", "developers": ["8bit Games"], "platforms": "PlayStation 3", "num_players": "2  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 70, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/14db2ca95c624f6ce03352e0ce5e25a8-98.jpg", "descriptions": "(Downloadable Game)  Use your construction skills to save elephants from a dangerous fall! In the puzzle game Elefunk, your elephants must traverse 20 levels of ravines, rivers, fire pits and swamps – and they'll only get across if you strengthen the structures correctly with metal, wood and(Downloadable Game)  Use your construction skills to save elephants from a dangerous fall! In the puzzle game Elefunk, your elephants must traverse 20 levels of ravines, rivers, fire pits and swamps – and they'll only get across if you strengthen the structures correctly with metal, wood and rope. It's real construction with realistic physics and three different game modes: Time Attack, Puzzle, and Deconstruction. Get building today! Puzzle Mode – Beginning with an empty level, the player constructs a structure using the limited number of pieces given. There is no time limit, and the next level is unlocked when the player successfully aids the elephant in traversing the level's ravine. Time Attack – This mode is played on previously unlocked levels. The player begins with a partially constructed structure and has to finish the structure with the limited materials given in a certain time limit. Once the counter reaches zero, the elephants are released! Deconstruction Multiplayer – This two-player mode can be played either on-or-offline. In each round, a player tries to remove a piece of the structure that is holding an elephant without causing the elephant to fall. When a player causes the elephant to fall, the round is over and a point is awarded to his opponent. When all rounds have been played, a winner is declared. [SCEA]… Expand"}, {"name": "Project X Zone", "details_link": "https://www.metacritic.com/game/3ds/project-x-zone", "publisher": "Namco Bandai Games", "release_date": "Jun 25 2013", "developers": ["Monolith Soft", "Banpresto"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 70, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/7cb7e9a1e029beb73d5cdb15999f0937-98.jpg", "descriptions": "Developed by Banpresto and Monolith Soft, Project X Zone features over 50 characters from 29 historic game franchises by three of Japan's most prolific video game companies. In Project X Zone players use a team of two characters known as a Pair Unit to explore the world within the game. AnDeveloped by Banpresto and Monolith Soft, Project X Zone features over 50 characters from 29 historic game franchises by three of Japan's most prolific video game companies. In Project X Zone players use a team of two characters known as a Pair Unit to explore the world within the game. An additional character known as a Solo Unit can be combined with the Pair Unit to assist in battles with Solo Attacks as well as augment the attacks available for players to execute. Throughout the game, epic battles are waiting to erupt at a moment's notice. Players will have to master an array of screen-busting moves including Solo Attacks, Support Attacks, Cross Hits, and Finishing Moves in order to defeat a multitude of foes. … Expand"}, {"name": "The Angry Birds Movie 2 VR: Under Pressure", "details_link": "https://www.metacritic.com/game/playstation-4/the-angry-birds-movie-2-vr-under-pressure", "publisher": "Sony Pictures Digital Entertainment", "release_date": "Aug  6 2019", "developers": ["XR Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 70, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/0252995fe4f2885154e19e9873ad548c-98.jpg", "descriptions": "Now the birds and piggies are best frenemies, Red and Leonard team up to assemble a crack(ed) team and investigate mysterious Eagle Island. But first, they must get there in one piece — in a giant Piggy submarine. Can the birds and pigs cooperate, deep beneath the waves? Or will they getNow the birds and piggies are best frenemies, Red and Leonard team up to assemble a crack(ed) team and investigate mysterious Eagle Island. But first, they must get there in one piece — in a giant Piggy submarine. Can the birds and pigs cooperate, deep beneath the waves? Or will they get that sinking feeling as the pressure rises?… Expand"}, {"name": "Lost Planet: Extreme Condition Colonies Edition", "details_link": "https://www.metacritic.com/game/pc/lost-planet-extreme-condition-colonies-edition", "publisher": "Capcom", "release_date": "May 27 2008", "developers": ["Capcom"], "platforms": ["Xbox 360", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/8d575fb60bb76374c9f43767c4137266-98.jpg", "descriptions": "Lost Planet: Extreme Condition Colonies Edition provides action for both online and offline players. Gamers who missed the original Lost Planet will have the opportunity to experience the original with the added bonus of fresh new content and cross platform multi-play all at a great valueLost Planet: Extreme Condition Colonies Edition provides action for both online and offline players. Gamers who missed the original Lost Planet will have the opportunity to experience the original with the added bonus of fresh new content and cross platform multi-play all at a great value price. Fans of the Lost Planet's online action will enjoy new online modes, maps, weapons and models. [Capcom]… Expand"}, {"name": "The Sims 4", "details_link": "https://www.metacritic.com/game/pc/the-sims-4", "publisher": "Electronic Arts", "release_date": "Sep  2 2014", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Virtual Life", "Simulation", "Miscellaneous", "Virtual", "Virtual Life"], "meta_score": 70, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/1/2ab4505b989717d20dc53160f0f84726-98.jpg", "descriptions": "New to the series, the Sims display a range of emotions which influence your variety of decisions in the game. Emotions give you new choices that impact your Sims and shape their stories. You can now control how your Sims engage other Sims, objects and individual moments in the game. YouNew to the series, the Sims display a range of emotions which influence your variety of decisions in the game. Emotions give you new choices that impact your Sims and shape their stories. You can now control how your Sims engage other Sims, objects and individual moments in the game. You control the brain, corpus, and now the heart of your Sims. The Sims you generate are full of life and are defined by, among other things, their unique personalities and their varying emotions. … Expand"}, {"name": "Assassin's Creed Unity", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-unity", "publisher": "Ubisoft", "release_date": "Nov 11 2014", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Historic", "Open-World"], "meta_score": 70, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/59d0eba29c8ba87df2485580c1236f90-98.jpg", "descriptions": "Paris, 1789. The French Revolution turns a once-magnificent city into a land of terror and chaos. Its cobblestone streets flow red with the blood of commoners who dared to rise up against the murderous aristocracy. As the nation rips itself apart, a younger man named Arno embarks on aParis, 1789. The French Revolution turns a once-magnificent city into a land of terror and chaos. Its cobblestone streets flow red with the blood of commoners who dared to rise up against the murderous aristocracy. As the nation rips itself apart, a younger man named Arno embarks on a harrowing journey to expose the authentic powers behind the Revolution. His pursuit thrusts him into the middle of a ruthless struggle for the fate of a nation, and transform him into a true Master Assassin. From the storming of the Bastille to the killing of King Louis XVI, experience the French Revolution unlike any medium that has come before, and assist the people of France carve out for themselves an entirely new destiny.… Expand"}, {"name": "The Last Remnant Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/the-last-remnant-remastered", "publisher": "Square Enix", "release_date": "Dec  6 2018", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/8b9d85c0e622dd12f334e1e43feb278d-98.jpg", "descriptions": "Last released in 2008, The Last Remnant captured the hearts and minds of gamers with its enthralling story, countless characters and intricate battle system. Now this classic RPG is back with a Remastered version and is coming to PlayStation 4 with even more beautiful graphics, enhanced viaLast released in 2008, The Last Remnant captured the hearts and minds of gamers with its enthralling story, countless characters and intricate battle system. Now this classic RPG is back with a Remastered version and is coming to PlayStation 4 with even more beautiful graphics, enhanced via an updated game engine. The Last Remnant told the story of a world filled with Remnants — mysterious artifacts from an ancient era. No one knew who created the Remnants, or how long they had existed, but even with these question around their origins, they still became tools for the good of civilization.… Expand"}, {"name": "Pinball Hall of Fame - The Gottlieb Collection", "details_link": "https://www.metacritic.com/game/xbox/pinball-hall-of-fame---the-gottlieb-collection", "publisher": "Crave", "release_date": "Nov 18 2004", "developers": ["Farsight Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Parlor", "Pinball"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Pinball Hall of Fame features more than eight pinball tables from the '60s through the '90s. The game features realistic physics, detailed graphics, and sounds captured directly from the actual tables. A tutorial fly-through of each table helps you plan your strategy and make every shotPinball Hall of Fame features more than eight pinball tables from the '60s through the '90s. The game features realistic physics, detailed graphics, and sounds captured directly from the actual tables. A tutorial fly-through of each table helps you plan your strategy and make every shot count. Compete for the high score alone or against three of your friends. With enough play, you'll learn fun facts about each table and even unlock a bonus table. … Expand"}, {"name": "Guitar Hero: Aerosmith", "details_link": "https://www.metacritic.com/game/playstation-3/guitar-hero-aerosmith", "publisher": "Activision", "release_date": "Jun 29 2008", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 70, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/9c5481c487e3df829aa0b6bddc7ef119-98.jpg", "descriptions": "Guitar Hero: Aerosmith is the first game built around the legendary music of \"America's Greatest Rock ‘N Roll Band\": Steven Tyler, Joe Perry, Brad Whitford, Tom Hamilton and Joey Kramer. This latest Guitar Hero installment puts players in the shoes of Perry (guitar), Whitford (guitar) andGuitar Hero: Aerosmith is the first game built around the legendary music of \"America's Greatest Rock ‘N Roll Band\": Steven Tyler, Joe Perry, Brad Whitford, Tom Hamilton and Joey Kramer. This latest Guitar Hero installment puts players in the shoes of Perry (guitar), Whitford (guitar) and Hamilton (bass), as they rock out alongside frontman Tyler and drummer Kramer. Gamers experience Aerosmith’s Grammy winning career, from their first gig to becoming rock royalty, in a way that no other entertainment vehicle offers. As fans progress through their careers in the game, they can rock out to scores of Aerosmith’s greatest hits, as well as songs from celebrated artists that the band has either performed with or has been inspired by in some way.  Venues from historical moments during the band's illustrious career offer the experience of \"sweet emotion\" and further capture the essence of the band's rise to fame. [Activision]… Expand"}, {"name": "Kung Fu Panda", "details_link": "https://www.metacritic.com/game/wii/kung-fu-panda", "publisher": "Activision", "release_date": "Jun  3 2008", "developers": ["Xpec"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 70, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/dc02118b31bbd7a49a1e55bda44db45c-98.jpg", "descriptions": "In Kung Fu Panda, players embark on an epic, action-packed adventure as they master the specialized Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13In Kung Fu Panda, players embark on an epic, action-packed adventure as they master the specialized Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13 legendary levels from the movie and beyond, and spanning land, water and air, players must work their way to become the Dragon Warrior and defeat the ultimate enemy, Tai Lung, as they battle a variety of foes, overcome dangerous obstacles, navigate multi-tiered environments and solve challenging puzzles. Featuring a deep variety of gameplay, unique co-op and competitive multiplayer modes, collectibles, and a host of character upgrades, the Kung Fu Panda video game provides an experience gamers of all ages will enjoy. [Activision]… Expand"}, {"name": "Septerra Core: Legacy of the Creator", "details_link": "https://www.metacritic.com/game/pc/septerra-core-legacy-of-the-creator", "publisher": "Monolith Productions", "release_date": "Oct 31 1999", "developers": ["Valkyrie Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 70, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/37c9bab7e1005eea1ec0892b2baf4379-98.jpg", "descriptions": "You are Maya, a junk scavenger, surviving on refuse dumped from above. Yours is a world of layers, in which continents orbit at different elevations around the planet. Those at the top, the Chosen, consume massive amounts of energy and dump their waste down to the layers below. Now they haveYou are Maya, a junk scavenger, surviving on refuse dumped from above. Yours is a world of layers, in which continents orbit at different elevations around the planet. Those at the top, the Chosen, consume massive amounts of energy and dump their waste down to the layers below. Now they have begun a descent to the Core, a living computer, in their search for the Gift of the Creator, fabled to bestow great power. At first you stand in the way of the Chosen, fighting to slow their march to the Core, and protect your homeland. But it is you who will ultimately discover Septerra's true nature, as you journey out of the familiar surroundings of your home country, and come face to face with the Legacy... [Monolith Productions]… Expand"}, {"name": "Wet", "details_link": "https://www.metacritic.com/game/playstation-3/wet", "publisher": "Bethesda Softworks", "release_date": "Sep 15 2009", "developers": ["Artificial Mind and Movement"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 70, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/92b6be8c39b673160b63039c5d9b0a45-98.jpg", "descriptions": "WET is a seamless integration of intense gunplay, death-defying acrobatics and exciting swordplay. The game  tells the story of Rubi, an acrobatic gun-for-hire. When she agrees to help a wealthy man find and bring back his wayward son, all hell breaks loose and the tables are turned, as theWET is a seamless integration of intense gunplay, death-defying acrobatics and exciting swordplay. The game  tells the story of Rubi, an acrobatic gun-for-hire. When she agrees to help a wealthy man find and bring back his wayward son, all hell breaks loose and the tables are turned, as the man who hired her isn't who he appeared to be. Now Rubi's on the run, needing to find the man who left her for dead and leaving a massive body count in her wake. Innovative 3rd person shooter gameplay: With her trusty twin custom made Colt Pythons, Rubi gracefully engages in amazing, cinematic high-body count gunplay against diverse and challenging enemies. Along with her guns, Rubi has an arsenal of death-defying acrobatic moves. Her incredible agility allows her to climb on ledges, slide under obstacles, swing on poles and run along walls. Rubi's sword is an instrument for deadly close-quarter proximity attacks.  Rubi will unleash a flurry of multi-staged stylized attack sequences. [Sierra Entertainment]… Expand"}, {"name": "Marvel's Guardians of the Galaxy - Episode 2: Under Pressure", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-guardians-of-the-galaxy---episode-2-under-pressure", "publisher": "Telltale Games", "release_date": "Jun  6 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 70, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": null}, {"name": "Star Wars Battlefront: Outer Rim", "details_link": "https://www.metacritic.com/game/playstation-4/star-wars-battlefront-outer-rim", "publisher": "Electronic Arts", "release_date": "Apr  5 2016", "developers": ["EA DICE"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 70, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/3d0538ae0c2c63f16d031059c38b41fe-98.jpg", "descriptions": "Fight among the factories of Sullust and battle within Jabba the Hutt's palace on Tatooine."}, {"name": "Retrovirus", "details_link": "https://www.metacritic.com/game/pc/retrovirus", "publisher": "Cadenza", "release_date": "Nov 16 2012", "developers": ["Cadenza"], "platforms": "PC", "genres": ["Action", "Miscellaneous", "General", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 70, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/40a61b6d43ba1a10547059b001bcdc74-98.jpg", "descriptions": "Players will enjoy an action-oriented shooter focused on movement along six axes, in a world designed for indoor flight.  Retrovirus will put players in control of an advanced anti-virus program within the game world, putting them up to the task of cleaning a dangerous infection from aPlayers will enjoy an action-oriented shooter focused on movement along six axes, in a world designed for indoor flight.  Retrovirus will put players in control of an advanced anti-virus program within the game world, putting them up to the task of cleaning a dangerous infection from a single computer which hosts the game’s setting.  In addition to a challenging, story-driven single player campaign, Retrovirus will deliver cooperative and competitive multiplayer modes for group play.… Expand"}, {"name": "Tomb Raider: Underworld", "details_link": "https://www.metacritic.com/game/ds/tomb-raider-underworld", "publisher": "Eidos Interactive", "release_date": "Nov 18 2008", "developers": ["Santa Cruz Games"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/b0a403c3502635f1cf18caeb8bef1930-98.jpg", "descriptions": "Master your surroundings: Conquer the world utilizing fluid acrobatic abilities along with the grapple and an arsenal of weapons. Treacherous and unpredictable challenges: Each level is an elaborate multi-stage puzzle filled with environmental traps to overcome. Explore unknown worlds:Master your surroundings: Conquer the world utilizing fluid acrobatic abilities along with the grapple and an arsenal of weapons. Treacherous and unpredictable challenges: Each level is an elaborate multi-stage puzzle filled with environmental traps to overcome. Explore unknown worlds: Discover ancient mysteries of the underworld hidden within the coast of Thailand, frozen islands of the Arctic Sea, the jungles of Mexico, and more. Unlock hidden secrets: Collect relics and solve challenges to unlock chests to unlock bonus content. The chests can be stored in the inventory and solved at any point. Touch Screen Challenges: Use the touch screen to solve environmental puzzles, unlock chests, access the inventory, and change weapons. [Eidos Interactive]… Expand"}, {"name": "Thrillville: Off the Rails", "details_link": "https://www.metacritic.com/game/playstation-2/thrillville-off-the-rails", "publisher": "LucasArts", "release_date": "Oct  9 2007", "developers": ["Frontier Developments"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Strategy", "General"], "meta_score": 70, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/7/0988d341189f839d2a29f75e8ec2abb8-98.jpg", "descriptions": "Off the Rails lives up to its name with 20 death-defying rides so outrageous, they inspire the same word from every park visitor who sees them: \"WHOA!\" Players build these incredible \"WHOA Coasters\" to leap from one track to another, launch through the air like cannonballs, blast through aOff the Rails lives up to its name with 20 death-defying rides so outrageous, they inspire the same word from every park visitor who sees them: \"WHOA!\" Players build these incredible \"WHOA Coasters\" to leap from one track to another, launch through the air like cannonballs, blast through a burning rings of fire and more. A new lighthearted story ties together more than 100 missions, complete with 34 playable multiplayer theme-park games and social interaction with park guests that's better than ever. The in-depth conversations both advance the plot and suggest better ways to manage the park. But is every guest to be trusted? [LucasArts]… Expand"}, {"name": "Nostradamus: The Last Prophecy", "details_link": "https://www.metacritic.com/game/pc/nostradamus-the-last-prophecy", "publisher": "Encore Software, Inc.", "release_date": "Sep 30 2007", "developers": ["Kheops Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 70, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/c6155be6d07f37d82f66910d7e967124-98.jpg", "descriptions": "Nostradamus: The Last Prophecy is set in 16th century Provence, in a country ravaged by religious wars and devastated by the plague. It has been three years since Catherine de Médicis' rule as regent came to an end, but she still holds the reins of power, making her the target of repeatedNostradamus: The Last Prophecy is set in 16th century Provence, in a country ravaged by religious wars and devastated by the plague. It has been three years since Catherine de Médicis' rule as regent came to an end, but she still holds the reins of power, making her the target of repeated attacks from the French nobility. One day in March 1566, when she realises that she has fallen victim to a terrible curse, she turns to her doctor and astrologer, Michel de Nostre-Dame, better known as Nostradamus. Unfortunately, the famous prophet is too old and weak to take on such a mission alone. Refusing to abandon his queen in her hour of need, he sends his daughter Madeleine in his place. However, there is no such thing as women astrologers, let alone women doctors in medieval times. To be accepted as such, the young woman must go in disguise and assume her younger brother's identity, César, who is away for some time. Alternating between Madeleine the young woman and Madeleine disguised as César, players are plunged into a thriller where political scheming and ancestral prophecies are intertwined. The game begins as an initiatory adventure in the footsteps of her father, the prophet and astrologer, before creating all the suspense of a detective novel: from one murder to another, players make their way through a test-riddled forensic investigation. [Kheops Studio]… Expand"}, {"name": "Midway Arcade Treasures Deluxe Edition", "details_link": "https://www.metacritic.com/game/pc/midway-arcade-treasures-deluxe-edition", "publisher": "Midway", "release_date": "Feb 17 2006", "developers": ["Midway"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/73487556b27c0595dc2d9b8027a350ae-98.jpg", "descriptions": "Deluxe Edition Midway Arcade Treasures: Deluxe Edition lives up to its title with an abundance of Midway arcade-perfect classics from both Midway Arcade Treasures 2 and Midway Arcade Treasures 3. This collection includes a wide-array of games ranging from fighting to racing. For the firstDeluxe Edition Midway Arcade Treasures: Deluxe Edition lives up to its title with an abundance of Midway arcade-perfect classics from both Midway Arcade Treasures 2 and Midway Arcade Treasures 3. This collection includes a wide-array of games ranging from fighting to racing. For the first time ever on PC, gamers will hear the famous cries of \"Fight\" and \"Finish Him\" from Mortal Kombat, Mortal Kombat II and Mortal Kombat 3. Gamers will also be offered a plethora of multi-player action, in two-player hits such as Arch Rivals and Total Carnage, three-player games Rampage World Tour and Xenophobe, and the four player classic Gauntlet II. [Midway]… Expand"}, {"name": "UFC Personal Trainer: The Ultimate Fitness System", "details_link": "https://www.metacritic.com/game/xbox-360/ufc-personal-trainer-the-ultimate-fitness-system", "publisher": "THQ", "release_date": "Jun 28 2011", "developers": ["THQ", "Heavy Iron Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 70, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/10cd58a9530cbc995d334bfca79bda79-98.jpg", "descriptions": "UFC Personal Trainer aims to get people in shape through similar training methods as the UFC superstars."}, {"name": "Digimon Survive", "details_link": "https://www.metacritic.com/game/playstation-4/digimon-survive", "publisher": "Bandai Namco Games", "release_date": "Jul 29 2022", "developers": ["Bandai Namco Games", "Hyde", "WitchCraft"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Trainer", "Strategy", "Turn-Based", "Tactics"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/88bdeaadef4cf72124ead7121abf20e8-98.jpg", "descriptions": "Digimon Survive presents a hybrid visual novel and tactical RPG set in a mysterious world filled with dangerous monsters and deadly battles that will test your ability to survive. After getting lost on a school trip, Takuma Momozuka finds himself transported to a world inhabited by ferociousDigimon Survive presents a hybrid visual novel and tactical RPG set in a mysterious world filled with dangerous monsters and deadly battles that will test your ability to survive. After getting lost on a school trip, Takuma Momozuka finds himself transported to a world inhabited by ferocious foes and new allies. Join Takuma and his friends as they fight their way back home. Craft your story in this thrilling visual novel with turn-based combat.\r Key Features:\r Rich Visual Novel Experience – Unfold a dark tale about friendship and survival that is jam-packed with exciting drama, a unique cast of characters, and potentially grim choices.\r  A Mysterious World – Explore otherworldly areas filled with hidden secrets and Digimon to recruit.\r  The Power Is Yours – Your choices affect gameplay: your bond with other NPCs, your Digimon’s evolution, and the outcome of your adventure.\r  Thrilling & Strategic Gameplay – Persuade your opponents to join your team and evolve them to fight alongside you in battles thrilling turn-based battles.… Expand"}, {"name": "Mercenaries 2: World in Flames", "details_link": "https://www.metacritic.com/game/pc/mercenaries-2-world-in-flames", "publisher": "Electronic Arts", "release_date": "Sep  4 2008", "developers": ["Pandemic Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 70, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/01a0ef4a0d76a2ec789aae9e51533183-98.jpg", "descriptions": "Mercenaries 2: World in Flames is an explosive open-world action game set in a massive, highly reactive, war-torn world. A power-hungry tyrant messes with Venezuela's oil supply, sparking an invasion that turns the country into a warzone. But for you, international crisis is all upside: YouMercenaries 2: World in Flames is an explosive open-world action game set in a massive, highly reactive, war-torn world. A power-hungry tyrant messes with Venezuela's oil supply, sparking an invasion that turns the country into a warzone. But for you, international crisis is all upside: You are a mercenary, and you profit from chaos. Mercenaries 2 features a slew of potential clients, all willing to pay you to do their dirty work. Dirty deeds, done for exorbitant fees. These are world powers with deep pockets, deep grudges, and enough arms and ammo to start World War III. This is your kind of environment. Mercenaries 2 features the latest and most dangerous in civilian and military tech, everything from shiny new sports cars, to the future-tech satellite-guided bunker-busting mini-nuke. Tanks, APCs, boats, luxury automobiles – you name it, you can have it delivered to you in real time. And if you run out of cash you can always 'acquire' the gear you need in the field. If you see it, you can buy it, steal it, or blow the living crap out of it. Play your own way, or play with the help of a friend in the new cooperative multiplayer mode. You are not a soldier. You don't have to play by anyone's rules. You have your own code: you will fulfill the terms of the contract, no matter what. Not everyone in the world of Mercenaries is as honorable. Everyone will try and screw you, given the chance. They think they can get away with it, because they don't know rule #1: EVERYBODY PAYS. [Pandemic Studios]… Expand"}, {"name": "Resident Evil 0: HD Remaster", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-0-hd-remaster", "publisher": "Capcom", "release_date": "Jan 19 2016", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/4fa53f6df8e9bbfb870be60f6de34dc0-98.jpg", "descriptions": "Resident Evil 0 reveals the truth behind the Mansion Incident, the catalyst for the entire storyline of the Resident Evil series. This remastered version takes the story and gameplay of the original and adds stunning HD graphics, 5.1 channel surround sound, optional modernized controls andResident Evil 0 reveals the truth behind the Mansion Incident, the catalyst for the entire storyline of the Resident Evil series. This remastered version takes the story and gameplay of the original and adds stunning HD graphics, 5.1 channel surround sound, optional modernized controls and widescreen TV compatibility. Get ready to discover the terrible secrets lurking in the origins of evil.… Expand"}, {"name": "Serious Sam: Siberian Mayhem", "details_link": "https://www.metacritic.com/game/pc/serious-sam-siberian-mayhem", "publisher": "Devolver Digital", "release_date": "Jan 25 2022", "developers": ["Croteam"], "platforms": ["PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/13a73aa72479d0e77a87065c8c872cee-98.jpg", "descriptions": "Serious Sam: Siberian Mayhem is a new stand-alone expansion to the world of the classic FPS series. Join the fight against Notorious Mental on a journey through the wild lands of Russia, and find your way through this lost chapter of Sam Stone's adventures."}, {"name": "TimeShift", "details_link": "https://www.metacritic.com/game/playstation-3/timeshift", "publisher": "Sierra Entertainment", "release_date": "Nov 19 2007", "developers": ["Saber Interactive"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 70, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/d0e61719dd3a7eb67abdb5a159361295-98.jpg", "descriptions": "TimeShift challenges players to use their minds along with their weapons to battle enemies and solve complex gameplay puzzles. TimeShift changes the fundamental way gamers think about first-person shooters by using the fourth dimension: time itself. TimeShift empowers players with the giftTimeShift challenges players to use their minds along with their weapons to battle enemies and solve complex gameplay puzzles. TimeShift changes the fundamental way gamers think about first-person shooters by using the fourth dimension: time itself. TimeShift empowers players with the gift of time manipulation, including the ability to slow down, stop and rewind the world around them, allowing them to move freely while opponents and game objects are frozen in time.  TimeShift feature mores than 30 combat missions, each showcasing time control elements and challenges that players must solve using both their extraordinary capabilities and combat expertise. An array of devastating and unique weaponry from the world's alternate timeline is at the player's disposal, including bizarre incarnations of traditional sniper guns, machine guns, pistols and more, as well as never-before-imagined armaments from an era humanity has never seen. [Atari]… Expand"}, {"name": "Prince of Persia: Rival Swords", "details_link": "https://www.metacritic.com/game/wii/prince-of-persia-rival-swords", "publisher": "Ubisoft", "release_date": "Apr  3 2007", "developers": ["Ubisoft Montreal"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 70, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/af61051fc94c56a1a4397d364e4e319a-98.jpg", "descriptions": "The Prince of Persia makes his way home to Babylon, bearing with him Kaileena, the enigmatic Empress of Time, and unspeakable scars from the Island of Time. But instead of the peace he longs for, he finds his kingdom ravaged by war and Kaileena the target of a brutal plot. When she isThe Prince of Persia makes his way home to Babylon, bearing with him Kaileena, the enigmatic Empress of Time, and unspeakable scars from the Island of Time. But instead of the peace he longs for, he finds his kingdom ravaged by war and Kaileena the target of a brutal plot. When she is kidnapped, the Prince tracks her to the Palace – only to see her murdered by a powerful enemy. Her death unleashes the Sands of Time, which strike the Prince and threaten to destroy everything he holds dear. Cast to the streets, hunted as a fugitive, the Prince soon discovers that the Sands have tainted him, too. They have given rise to a deadly Dark Prince, whose spirit gradually possesses him. Play and master two distinct characters: Wield the powers and weapons of two master warriors with different combat styles, attitudes and histories. Choose your way to kill: Master the expanded Free-Form Fighting system to destroy enemies in your own style, strangle enemies from afar with the deadly Daggertail or use a new stealth art to inflict surprise. Battle freely through Babylon: Dominate enemies on the perilous rooftops, dodge through chaotic streets and ambush pursuers in dark underground passageways. Immerse yourself in a dramatic story: Experience unparalleled depth in storytelling as you fight your way through a twisting tale filled with adrenaline, tension and discovery. Manipulate time to surprise enemies: Execute powerful attacks against entire armies by slowing down or rewinding time, or surprise them by using some all-new Sands of Time powers. Experience a masterful blend of gameplay: True to the Prince of Persia franchise, the game provides a variety of action combat, agility and story-driven puzzles – all masterfully blended into a rich gaming experience. [Ubisoft]… Expand"}, {"name": "Call of Duty: Ghosts - Devastation", "details_link": "https://www.metacritic.com/game/xbox-one/call-of-duty-ghosts---devastation", "publisher": "Activision", "release_date": "Apr  3 2014", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 70, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/aedd6670a27a00be7d4156569f227030-98.jpg", "descriptions": "Behemoth - Columbia: Situated on a massive excavation vehicle, Behemoth is a narrow multi-level map, giving players flanking opportunities with danger around every corner. Complete the map’s Field Order and take control of an attack helicopter able to rain down destruction from above withBehemoth - Columbia: Situated on a massive excavation vehicle, Behemoth is a narrow multi-level map, giving players flanking opportunities with danger around every corner. Complete the map’s Field Order and take control of an attack helicopter able to rain down destruction from above with devastating grenade launchers. Ruins - Mexico: A mountaintop Mayan ruin overrun by the jungle, Ruins’ skyline is dominated by an ominous volcano on the brink of eruption. This map blends the verticality of a dominant temple with tight subterranean sections.  Unearthed - Classified: Inspired by Dome, the fan-favorite map from Call of Duty®: Modern Warfare® 3, Unearthed drops players in the heart of an alien dig site. This small map asks players to navigate through Cryptid artifacts, a mix of high-tech HAZMAT facilities, scientific equipment and vehicles. Players skilled enough to complete Unearthed’s unique Field Order will be able to unleash three Cryptid alien creatures, delivering an explosive end to their foes. Collision - New York: The mangled remains of cargo ship crashed into a New York bridge, ripe with burnt out vehicles and shipping containers strewn across the deck, this map provides the ideal theatre for close-quarters combat. Unlock the map’s unique Killstreak by completing the Field Order, and use the full arsenal of an A-10 Warthog aircraft to strafe the full length of the map. [Activision]\r… Expand"}, {"name": "Nancy Drew: Danger By Design", "details_link": "https://www.metacritic.com/game/pc/nancy-drew-danger-by-design", "publisher": "Her Interactive", "release_date": "Jul 11 2006", "developers": ["Her Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 70, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/ee65dc5a47aec535868ba1032a09b9ea-98.jpg", "descriptions": "You, as Nancy Drew, intern undercover in a prestigious fashion design studio in Paris. The lead designer, Minette, hasn't quite been herself lately. She hides behind a white mask and often throws tantrums, even firing several employees. Mysterious threats arrive at the old windmill studioYou, as Nancy Drew, intern undercover in a prestigious fashion design studio in Paris. The lead designer, Minette, hasn't quite been herself lately. She hides behind a white mask and often throws tantrums, even firing several employees. Mysterious threats arrive at the old windmill studio and other troubles lurk in the underbelly of the City of Light. Can you help Minette release her latest clothing line on time? Or will your sleuthing abroad meet an unfashionable end? [Her Interactive]… Expand"}, {"name": "Dracula Origin", "details_link": "https://www.metacritic.com/game/pc/dracula-origin", "publisher": "Big Fish Games", "release_date": "Dec 19 2008", "developers": ["Big Fish Games"], "platforms": "PC", "genres": ["Adventure", "General"], "meta_score": 0, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/b0fdaeec89bb20e5009ec5ebcd696562-98.jpg", "descriptions": null}, {"name": "RICO", "details_link": "https://www.metacritic.com/game/switch/rico", "publisher": "Rising Star Games", "release_date": "Mar 12 2019", "developers": ["Ground Shatter Ltd."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/5a2f8b62c3dc8626e728c7fb6ec0b0ff-98.jpg", "descriptions": "Two cops, one case and only 24 hours to take them down... can you score the bust of a lifetime? Take the role of a loose cannon police detective and face off against criminal gangs in an exciting procedurally-generated action movie FPS. Join forces with a friend, online or locally, and takeTwo cops, one case and only 24 hours to take them down... can you score the bust of a lifetime? Take the role of a loose cannon police detective and face off against criminal gangs in an exciting procedurally-generated action movie FPS. Join forces with a friend, online or locally, and take down those crooks in true buddy-cop style. As a part of the RICO task force, your mission is clear: get in, take down the criminals and get out again. Sounds easy, but it's not - procedurally-generated cases mean you'll never know who or what's waiting for you. Pick your load-out, then use the element of surprise to get a tactical edge over the enemy. Unlock new weapons, mission types and traits, or dive into Daily Play and see how high you can climb the cop rankings.… Expand"}, {"name": "Real Soccer 2009", "details_link": "https://www.metacritic.com/game/ds/real-soccer-2009", "publisher": "Ubisoft", "release_date": "Nov  4 2008", "developers": ["Ubisoft", "Gameloft"], "platforms": ["iPhone/iPad", "DS"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Arcade", "Arcade"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/52210210fbda74994d45fe8b47477c29-98.jpg", "descriptions": "(Also known as \"Real Football 2009\")  Feel as close as possible to being a real professional soccer player. Real Soccer 2009 is the definitive soccer title designed specifically for the Nintendo DS and its unique capabilities. The game offers a never-before-seen soccer experience with(Also known as \"Real Football 2009\")  Feel as close as possible to being a real professional soccer player. Real Soccer 2009 is the definitive soccer title designed specifically for the Nintendo DS and its unique capabilities. The game offers a never-before-seen soccer experience with revolutionary yet accessible Touch Screen controls (e.g. fake opponents by drawing a circle to perform a roulette). It includes 198 teams using real players' names, dynamic AI opponents and 3D graphics that push the DS to the max. Real Soccer 2009 is the true benchmark that this platform deserves for soccer games. Take your best shot on the DS. [Ubisoft]… Expand"}, {"name": "Homefront", "details_link": "https://www.metacritic.com/game/pc/homefront", "publisher": "THQ", "release_date": "Mar 14 2011", "developers": ["Digital Extremes"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 70, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/8de88ad68f3ea194763859fe97306e13-98.jpg", "descriptions": "The year is 2027. The world has suffered a decade-long energy crisis, and economies have crumbled. Reduced to a mere shadow of the super power it once was, the United States became the target of a North Korean takeover. American malls, suburbs and city streets are now battlegrounds as theThe year is 2027. The world has suffered a decade-long energy crisis, and economies have crumbled. Reduced to a mere shadow of the super power it once was, the United States became the target of a North Korean takeover. American malls, suburbs and city streets are now battlegrounds as the civilian resistance fights for freedom. Featuring a compelling single player story crafted by John Milius (Apocalypse Now, Red Dawn), Homefront immerses gamers in an interactive and cinematic FPS experience where they assume an infantry role or take command of a wide variety of aerial and ground vehicles. In a land stripped of freedom, the brave will fight for their home. [THQ]… Expand"}, {"name": "The Moment of Silence", "details_link": "https://www.metacritic.com/game/pc/the-moment-of-silence", "publisher": "The Adventure Company", "release_date": "Mar  1 2005", "developers": ["House of Tales"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/4cea6fe94ea4c8e4bb785b6c1c53867a-98.jpg", "descriptions": "The Moment of Silence is a high-tech political thriller. Players step into the shoes of Peter Wright, a communications designer currently working on the Government's 'Freedom of Speech' campaign. When a SWAT team storms his neighbour's apartment, it is Peter's job to uncover the truth behindThe Moment of Silence is a high-tech political thriller. Players step into the shoes of Peter Wright, a communications designer currently working on the Government's 'Freedom of Speech' campaign. When a SWAT team storms his neighbour's apartment, it is Peter's job to uncover the truth behind his mysterious disappearance. [Digital Jesters]… Expand"}, {"name": "Vampyr", "details_link": "https://www.metacritic.com/game/xbox-one/vampyr", "publisher": "Focus Home Interactive", "release_date": "Jun  5 2018", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/a43487696bf293095cd07aac379637a8-98.jpg", "descriptions": "Vampyr is set in early 20th century Britain as the country is gripped by the lethal Spanish flu and the streets of London are crippled by disease, violence and fear. In a disorganized and ghostly city, those foolish, desperate, or unlucky enough to walk the streets lay prey to Britain’s mostVampyr is set in early 20th century Britain as the country is gripped by the lethal Spanish flu and the streets of London are crippled by disease, violence and fear. In a disorganized and ghostly city, those foolish, desperate, or unlucky enough to walk the streets lay prey to Britain’s most elusive predators: the vampires. Emerging from the chaos, a tormented figure awakens. You are Jonathan E. Reid, a high-ranking military surgeon transformed into a vampire upon his return home from the frontline.  Explore the darkly atmospheric streets of early 20th century London, and interact with a multitude of characters with their own identities and importance. Accept and fulfill the missions they give you, but don’t forget: sooner or later, you will have to feed, and make a difficult choice... who will be your prey? Absolutely all characters in the game are potential victims of your vampiric lust. Carefully study the habits of your next victim, his or her relationships with other characters, and set up your strategy to feed, unnoticed: seduce them, change their daily habits, or make sure they end up alone in a dark street…  Be careful who you choose to hunt, as they will be gone forever, and their death will impact in a meaningful way the world that surrounds you. Feeding on human blood will not just keep you 'alive;' it will also unlock new vampiric powers to use. [Focus Home]… Expand"}, {"name": "Virtua Tennis 2009", "details_link": "https://www.metacritic.com/game/xbox-360/virtua-tennis-2009", "publisher": "Sega", "release_date": "Jun  9 2009", "developers": ["Sumo Digital"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/de3593c393c9c581a20b18ea8831a1b6-98.jpg", "descriptions": "Create your own player and join the new World Tour where you are trained by a real-life legend of tennis to compete for the #1 ranking against the biggest stars. Then take your character online and prove you're the best with the new online ranking system! With brand new courts, a new rollCreate your own player and join the new World Tour where you are trained by a real-life legend of tennis to compete for the #1 ranking against the biggest stars. Then take your character online and prove you're the best with the new online ranking system! With brand new courts, a new roll call of tennis stars to compete against and even more court mini-games, Virtua Tennis 2009 is set to be the #1 tennis title once again! New World Tour & Online Rankings - Take your career online and compete for the ultimate title of ‘Virtua Tennis Champion’ with the new PLAYSTATION 3 system and Xbox 360 online ranking system. With prize money you earn in online tournaments, you can purchase over 800 shop items in the new Tennis Store and upgrade your character. New Players / Courts - Play as or against over 20 of the world’s top players, including seven new to Virtua Tennis and three legends. All-new arenas and the officially licensed Davis Cup provide the most realistic tennis competition to date. New Player Creation System - You now have full control over facial, body and clothing customization, as well as the depth to populate the game world with hundreds of unknown opponents. More Court Games. Playing alone or with up to three friends compete in 12 mini-games, five completely new, and upload your hi-scores on the worldwide rankings in games such as Zoo Feeder and Pirate War. Improved Gameplay - Courtside action is better than ever, with extensive updates to the famous arcade-style Virtua Tennis match engine, as well as 3D crowds and a more realistic courtside experience. [Sega]… Expand"}, {"name": "Tricky Towers", "details_link": "https://www.metacritic.com/game/xbox-one/tricky-towers", "publisher": "WeirdBeard", "release_date": "Sep 15 2017", "developers": ["WeirdBeard"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Puzzle", "Stacking"], "meta_score": 70, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/902c485614032f815e093e385da3a9f1-98.jpg", "descriptions": "With your brilliant robe and magic powers, it's time to build some Tricky Towers!\r Tricky Towers is a multiplayer physics-based tower building game. In a game of Tricky Towers you stack your bricks to create a stable tower and try to topple those of your opponents. To spice it up you canWith your brilliant robe and magic powers, it's time to build some Tricky Towers!\r Tricky Towers is a multiplayer physics-based tower building game. In a game of Tricky Towers you stack your bricks to create a stable tower and try to topple those of your opponents. To spice it up you can cast magic to support your structure and fend off the dark spells of your rivals in this frantic physics party game.\r Tricky Towers offers local and online multiplayer with up to 4 players in Race, Survival and Puzzle mode. It also features 50 single player trials for players to test their skills or practice for online play.\r With spells flying everywhere and bricks tumbling down, Tricky Towers makes for a chaotically good time!… Expand"}, {"name": "Pix the Cat", "details_link": "https://www.metacritic.com/game/xbox-one/pix-the-cat", "publisher": "Pasta Games", "release_date": "Feb  8 2017", "developers": ["Pasta Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "genres": ["Action", "Arcade"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/8e6eef7afdd725eabe4af7be579d12fa-98.jpg", "descriptions": "PIX the CAT is an intense arcade game designed to make your pads sore!Rescue forsaken ducklings from the nested levels of the infamous GRID of INFINITY. Perfect your skills to SPEED and COMBO UP until you reach the explosive FEVER TIME! Defeat your friends at home in the combat ARENA andPIX the CAT is an intense arcade game designed to make your pads sore!Rescue forsaken ducklings from the nested levels of the infamous GRID of INFINITY. Perfect your skills to SPEED and COMBO UP until you reach the explosive FEVER TIME! Defeat your friends at home in the combat ARENA and compete online with the GHOST feature. Surprising surprises are hidden along your adventure, eager to please you when you least expect it!… Expand"}, {"name": "The Outer Worlds: Peril on Gorgon", "details_link": "https://www.metacritic.com/game/playstation-4/the-outer-worlds-peril-on-gorgon", "publisher": "Obsidian Entertainment", "release_date": "Sep  9 2020", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 70, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/df196815d0bf236ed6f41c17818fd079-98.jpg", "descriptions": "The Outer Worlds: Peril on Gorgon takes place on the Gorgon asteroid, which was the site of one of the most ambitious scientific undertakings in Halcyon: the development and synthesis of Adrena-Time, a drug intended to improve the productivity of workers across the Halcyon colony."}, {"name": "Disney Universe", "details_link": "https://www.metacritic.com/game/playstation-3/disney-universe", "publisher": "Disney Interactive Studios", "release_date": "Oct 25 2011", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/ecb40612aa677934ce8e3ff9c5b259fa-98.jpg", "descriptions": "In Disney Universe, players can select from more than 40 classic and contemporary Disney character costumes, including Alice (\"Alice in Wonderland\"), Mike (\"Monsters, Inc.\"), TRON (\"TRON: Legacy\") and Stitch (\"Lilo & Stitch\") to explore sixIn Disney Universe, players can select from more than 40 classic and contemporary Disney character costumes, including Alice (\"Alice in Wonderland\"), Mike (\"Monsters, Inc.\"), TRON (\"TRON: Legacy\") and Stitch (\"Lilo & Stitch\") to explore six different worlds inspired by legendary Disney and Disney Pixar films.  Each world will allow players to experience objectives and missions that follow Disney and Disney Pixar movie storylines.  Players will select a character-based costume, with each costume offering a specific tool that changes and grows in power as players adventure through the game.  Disney Universe offers frenetic gameplay, multiplayer with up to three friends and slapstick humor that will appeal to players of all ages.… Expand"}, {"name": "Pride of Nations", "details_link": "https://www.metacritic.com/game/pc/pride-of-nations", "publisher": "Paradox Interactive", "release_date": "Jun  7 2011", "developers": ["Paradox Interactive", "AGEOD"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 70, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/4ebe4aecc7d47ad2c69db91386ff1d85-98.jpg", "descriptions": "Pride of Nations is a turn-based historical strategy game set in the colonial era of the 19th century."}, {"name": "Madden NFL 23", "details_link": "https://www.metacritic.com/game/xbox-series-x/madden-nfl-23", "publisher": "Electronic Arts", "release_date": "Aug 16 2022", "developers": ["EA Sports", "EA Tiburon"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 70, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/6/41a5c567d4a16f05283cde23715c6f0f-98.jpg", "descriptions": "FRANCHISE - Call the shots from the front office as you lead your Madden NFL 23 Franchise to the top. New athlete motivations like salary demands factor into contract negotiations and add to the drama of NFL free agency. FACE OF THE FRANCHISE - Play your way into the history books in MaddenFRANCHISE - Call the shots from the front office as you lead your Madden NFL 23 Franchise to the top. New athlete motivations like salary demands factor into contract negotiations and add to the drama of NFL free agency. FACE OF THE FRANCHISE - Play your way into the history books in Madden NFL 23. The League drops you into your fifth NFL season, and you're seeking a fresh start as you negotiate a one-year deal with a new team and strive for a legendary career. ULTIMATE TEAM - Develop your dream fantasy roster of current NFL superstars, Hall of Fame legends, and more. Keep improving your Madden 23 Ultimate Team roster all season through simplified team-building and convenient competition. [Electronic Arts]… Expand"}, {"name": "SILT", "details_link": "https://www.metacritic.com/game/playstation-5/silt", "publisher": "Sold Out", "release_date": "Jun  1 2022", "developers": ["Spiral Circus"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 70, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/e9b6e6244f555eb87638be20d027b147-98.jpg", "descriptions": "Silt is a puzzle-adventure set deep within a harrowing ocean abyss, where you play as a lone diver searching the deep and exploring dangerous waters to uncover long-forgotten mysteries. But the diver has a secret. Harnessing an unusual power, you’ll be able to possess sea creatures that roamSilt is a puzzle-adventure set deep within a harrowing ocean abyss, where you play as a lone diver searching the deep and exploring dangerous waters to uncover long-forgotten mysteries. But the diver has a secret. Harnessing an unusual power, you’ll be able to possess sea creatures that roam the ocean void, discovering new creatures and using their unique abilities to solve puzzles, traverse the environment, and make your way deeper into the darkness.… Expand"}, {"name": "NUTS", "details_link": "https://www.metacritic.com/game/pc/nuts", "publisher": "Noodlecake Studios", "release_date": "Feb  4 2021", "developers": ["Joon", "Pol", "Muutsch", "Char & Torfi"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 70, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/ead15dd8e4ad74939b42dffcd29e1778-98.jpg", "descriptions": "A single-player surveillance mystery. Record the squirrels, report your findings, and piece together what’s really going on in Melmoth Forest."}, {"name": "Samurai Jack: Battle Through Time", "details_link": "https://www.metacritic.com/game/switch/samurai-jack-battle-through-time", "publisher": "Adult Swim", "release_date": "Aug 21 2020", "developers": ["Soleil", "Soleil Ltd."], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/56cf81e211540371a63b13c014a2e2ee-98.jpg", "descriptions": "Voiced by the original voice-actors, Samurai Jack: Battle Through Time is an action platform game that spans across time and space, where your actions will determine a new legend. An Untold Adventure That Ties Into the Epic Series Finale\rTeam up with trusted allies from the show to face offVoiced by the original voice-actors, Samurai Jack: Battle Through Time is an action platform game that spans across time and space, where your actions will determine a new legend. An Untold Adventure That Ties Into the Epic Series Finale\rTeam up with trusted allies from the show to face off against familiar enemies.\r Explore Worlds from the Award Winning Series\rVisit classic worlds and moments from your favorite episodes. Travel to a dark future to free mankind. Dive into the past to face off against diabolical monsters. Seek your fate as you travel across space and time.\r Create Your Own Legend\rEquip and master over a dozen different weapons in combat. Increase your power even more by training and unlocking new skills to support your playstyle.… Expand"}, {"name": "Evergate", "details_link": "https://www.metacritic.com/game/switch/evergate", "publisher": "PQube", "release_date": "Aug 18 2020", "developers": ["Stone Lantern Games"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/81d84f9437ab96390d3f96197fd4e489-98.jpg", "descriptions": "Wield your Soulflame, unleash extraordinary powers, and dive into the touching story of two kindred spirits. Guide the child-like soul Ki on a journey through the beautiful and haunting Afterlife in this unique 2D puzzle platformer.\r SOULFLAME MECHANIC\r\nSlow down time, take aim, andWield your Soulflame, unleash extraordinary powers, and dive into the touching story of two kindred spirits. Guide the child-like soul Ki on a journey through the beautiful and haunting Afterlife in this unique 2D puzzle platformer.\r SOULFLAME MECHANIC\rSlow down time, take aim, and unleash the mysterious power hidden within every crystal you encounter with the unique Soulflame mechanic. Hit multiple crystals at once and experiment with how their energies combine.\r REVEAL THE MEMORIES OF A LIFE LEFT BEHIND\rMove across time and space to uncover Ki's mysterious connection to another soul.\r COLLECT ESSENCE, UNLOCK ARTIFACTS\rRise to the challenge and collect essence by completing challenges on every level. Use them to unlock ancient artifacts and boost Ki’s abilities.\r DREAM-LIKE ART STYLE\rGorgeous environmental backdrops paired with beautifully hand-drawn illustrations bring Ki and Evergate’s environments to life.\r ENCHANTING SOUNDTRACK\rEnjoy an elegantly orchestrated original soundtrack, recorded by a live orchestra, and tailor-made for each environment.… Expand"}, {"name": "Puddle", "details_link": "https://www.metacritic.com/game/wii-u/puddle", "publisher": "Neko Entertainment", "release_date": "Jan 31 2013", "developers": ["Neko Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Logic", "Logic"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/7be4e178965f1c2dfbd9799cbd9ba742-98.jpg", "descriptions": "Dive into Puddle, a physics game unlike any other!\r Winner at the Independent Games Festival 2010, Puddle is now available on Nintendo Wii U.\r\n\r\nDive into Puddle, a game unlike any other where you have to guide a puddle of fluid by tilting the environment to the left or right!\r\n\r\nPlayDive into Puddle, a physics game unlike any other!\r Winner at the Independent Games Festival 2010, Puddle is now available on Nintendo Wii U.\r Dive into Puddle, a game unlike any other where you have to guide a puddle of fluid by tilting the environment to the left or right!\r Play carefully taking friction, gravity and temperature into account, and by using the unique properties of each type of fluid (water, oil, nitroglycerin, molten lava...) in a range of original environments.\r Conserve as much fluid as possible when crossing a variety of obstacles such as burning passageways, carnivorous plants and electric currents!\r Key features:\r-49 levels specially re-mastered for the Nintendo Wii U!\r-Play by using the Wii U GamePad accelerometer!\r-Compare your score in the worldwide Leaderboard!\r-Enter the world competition! Win as many Medals and Challenges as the best ones from the Puddle Community!… Expand"}, {"name": "Pid", "details_link": "https://www.metacritic.com/game/playstation-3/pid", "publisher": "Might and Delight", "release_date": "Nov  6 2012", "developers": ["Might and Delight"], "platforms": ["PC", "Switch", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/2c85278717a1f9731201222d105d5555-98.jpg", "descriptions": "In the fantastic world of Pid, the player's unique and eccentric journey unfolds as the young protagonist is stranded on a remote planet. Players hone their gaming abilities through creative approaches to gravity-bending action, intricate puzzle-solving and classic precision platform action,In the fantastic world of Pid, the player's unique and eccentric journey unfolds as the young protagonist is stranded on a remote planet. Players hone their gaming abilities through creative approaches to gravity-bending action, intricate puzzle-solving and classic precision platform action, overcoming larger-than-life obstacles and truly original enemies and characters. Throughout the course of the adventure, players will be challenged to outwit a variety of quirky robots and befriend unlikely allies on their quest to face-off against a ruler that has no intention of letting anyone leave the planet.… Expand"}, {"name": "LEGO Indiana Jones 2: The Adventure Continues", "details_link": "https://www.metacritic.com/game/playstation-3/lego-indiana-jones-2-the-adventure-continues", "publisher": "LucasArts", "release_date": "Nov 17 2009", "developers": ["Traveller's Tales"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/3902d06dc08b4ec4060b02b09dcebe1e-98.jpg", "descriptions": "LEGO Indiana Jones 2 presents a tongue-in-cheek take on all four cinematic adventures of pop culture’s most iconic archaeologist, including for the first time ever Indiana Jones and the Kingdom of the Crystal Skull and will give players the ability to create levels of their own! [LucasArts]"}, {"name": "Deliver Us Mars", "details_link": "https://www.metacritic.com/game/pc/deliver-us-mars", "publisher": "Frontier Foundry", "release_date": "Feb  2 2023", "developers": ["KeokeN Interactive"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/7e7d93dcd14dac968f933049fab5c6ce-98.jpg", "descriptions": "Sequel to the award-winning Deliver Us The Moon, Deliver Us Mars is an atmospheric sci-fi adventure offering an immersive astronaut experience. Explore new frontiers on a suspense-fuelled, high-stakes mission to recover the ARK colony ships stolen by the mysterious Outward."}, {"name": "Rainbow Moon", "details_link": "https://www.metacritic.com/game/playstation-vita/rainbow-moon", "publisher": "EastAsiaSoft", "release_date": "Dec  3 2013", "developers": ["SideQuest Studios"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/7962b929f7a0e647f70a3bbd6866662d-98.jpg", "descriptions": "Rainbow Moon is a strategic role-playing game with a strong emphasis on character development."}, {"name": "Touhou Genso Wanderer", "details_link": "https://www.metacritic.com/game/playstation-4/touhou-genso-wanderer", "publisher": "NIS America", "release_date": "Mar 21 2017", "developers": ["Mediascape"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Roguelike"], "meta_score": 70, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/3bcdd31d1d28f04c349650bfcd43af7e-98.jpg", "descriptions": "In this roguelike RPG, you will take control of Reimu, the Hakurei Shrine Maiden, to investigate the latest incident to take place in the world of Gensokyo."}, {"name": "Mr. Driller: Drill Spirits", "details_link": "https://www.metacritic.com/game/ds/mr-driller-drill-spirits", "publisher": "Namco", "release_date": "Nov 30 2004", "developers": ["Namco"], "platforms": "DS", "num_players": "1-5 ", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "General"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/5740b5dab2d176f9f71336284da7f031-98.jpg", "descriptions": "Master the art of drilling and take advantage of the dual screen and wireless connectivity of the Nintendo DS. Your fellow drillers are trapped underground and it's up to Mr. Driller to dig through the blocks and rescue them. Play anytime, anywhere with quick play features or duelMaster the art of drilling and take advantage of the dual screen and wireless connectivity of the Nintendo DS. Your fellow drillers are trapped underground and it's up to Mr. Driller to dig through the blocks and rescue them. Play anytime, anywhere with quick play features or duel head-to-head with other players through the wireless capabilities. Tap the stylus on-screen and Mr. Driller will dig in the indicated direction. Whether it's racing to avoid falling blocks or scrambling for an air capsule, Mr. Driller: Drill Spirits brilliantly blends puzzle-solving with white-knuckle action. Battle head-to-head with as many as four players via the DS wireless capability (multiple game cards required). Dual screen support: The lower screen is the main play screen. The upper screen will display the rest of the map, so you can now see how far down you have drilled. Escape the Earth Destroyer Drill in DS Exclusive Pressure Mode. You're on the bottom screen, with the the humongous E.D.D. bearing down on you from above. Go underground with Time Attack and Race modes. Unlock various playable drillers in the Mission mode. [Nintendo]… Expand"}, {"name": "Wallace & Gromit: Curse of the Were-Rabbit", "details_link": "https://www.metacritic.com/game/xbox/wallace-gromit-curse-of-the-were-rabbit", "publisher": "Konami", "release_date": "Sep 29 2005", "developers": ["Frontier Developments"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action Adventure", "Modern"], "meta_score": 70, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/3/75636897642aceb8c744b7b8e3e0a6b6-98.jpg", "descriptions": "Konami's Wallace & Gromit: The Curse of the Were-Rabbit video game closely follows the events of the Aardman and DreamWorks film, with players using cooperative modes to guide any pairing of Wallace, Gromit or their rabbit friend, Hutch, through four huge areas. Players are given free reignKonami's Wallace & Gromit: The Curse of the Were-Rabbit video game closely follows the events of the Aardman and DreamWorks film, with players using cooperative modes to guide any pairing of Wallace, Gromit or their rabbit friend, Hutch, through four huge areas. Players are given free reign of the area as they attempt to solve the problems of the Giant Vegetable Competition. Their mission takes them from the seaside to suburbia as they venture out at night to confront the beast responsible for the vegetable-based carnage.… Expand"}, {"name": "Game of Thrones: Episode Three - The Sword in the Darkness", "details_link": "https://www.metacritic.com/game/playstation-4/game-of-thrones-episode-three---the-sword-in-the-darkness", "publisher": "Telltale Games", "release_date": "Mar 24 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/b89a96a274d5fe356efb6d21160c2ac8-98.jpg", "descriptions": "Asher, the exile, proceeds to Mereen in search of an army to take on the Whitehills. Meanwhile in Westeros, Mira must deal with the lethal politics of King’s Landing. [Telltale Games]"}, {"name": "Fate of the World", "details_link": "https://www.metacritic.com/game/pc/fate-of-the-world", "publisher": "Red Redemption", "release_date": "Feb 28 2011", "developers": ["Red Redemption"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/acc5210c144d187918c3bc81215edff1-98.jpg", "descriptions": "Fate of the World is a global strategy game that puts our future in your hands. Players will have to decide how the world will respond to rising temperatures, heaving populations, dwindling resources, crumbling ecosystems and brave opportunities."}, {"name": "Tiger Woods PGA Tour 10", "details_link": "https://www.metacritic.com/game/psp/tiger-woods-pga-tour-10", "publisher": "Electronic Arts", "release_date": "Jun  8 2009", "developers": ["EA Tiburon"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/dac35c4e26eb45530bc4e7a21fe2eede-98.jpg", "descriptions": "Tiger Woods PGA Tour 10 takes golf fans inside-the-ropes to experience the drama and emotion of tournament golf. In addition, the U.S. Open, a USGA championship, and the USGA’s Rules of Golf is available in Tiger Woods PGA Tour 10 for the first time in franchise history. As you hear the roarTiger Woods PGA Tour 10 takes golf fans inside-the-ropes to experience the drama and emotion of tournament golf. In addition, the U.S. Open, a USGA championship, and the USGA’s Rules of Golf is available in Tiger Woods PGA Tour 10 for the first time in franchise history. As you hear the roar of the crowd from the next hole over, can you handle the mounting pressure while you stand over your tournament-winning putt? Expanded crowds surround every hole; adding to the tension and excitement of each shot. A first for the franchise, real-time weather is reflected on every course, ensuring the in-game experience matches that of the current weather conditions. Tiger Woods PGA Tour 10 also features a television broadcast style presentation, which include instantaneous updates and a new announcer team of ESPN’s Scott Van Pelt and the Golf Channel’s Kelly Tilghman. [Electronic Arts]… Expand"}]