[{"name": "Animal Crossing: Wild World", "details_link": "https://www.metacritic.com/game/ds/animal-crossing-wild-world", "publisher": "Nintendo", "release_date": "Dec  5 2005", "developers": ["Nintendo"], "platforms": "DS", "num_players": "Up to 4 ", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/ee3d251265f11633df2389a8e829ea4b-98.jpg", "descriptions": "In this sequel to the wildly popular Nintendo GameCube game, players and up to three friends can hang out in the same village and interact in real time - either through wireless LAN or over Nintendo Wi-Fi Connection. Now players can visit a friend's village from thousands of miles away.In this sequel to the wildly popular Nintendo GameCube game, players and up to three friends can hang out in the same village and interact in real time - either through wireless LAN or over Nintendo Wi-Fi Connection. Now players can visit a friend's village from thousands of miles away. \rThe touch screen makes item management and world navigation a breeze. Typing letters and designing patterns are now just stylus strokes away. Days and seasons pass in real time, so whether players want to decorate their homes, catch bugs or fish, collect brand-new items like hats and sunglasses or just chat with the wild and wacky characters in their villages, there's always something to do. [Nintendo]… Expand"}, {"name": "Tomb Raider", "details_link": "https://www.metacritic.com/game/pc/tomb-raider", "publisher": "Square Enix", "release_date": "Mar  4 2013", "developers": ["Crystal Dynamics", "Nixxes Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Modern", "General", "Modern", "Linear"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/e4c7dbc585abaa821cfabfd32507b834-98.jpg", "descriptions": "An intense and gritty story of the origins of the infamous Lara Croft and her ascent from frightened young woman to hardened survivor in Tomb Raider."}, {"name": "Atari 50: The Anniversary Celebration", "details_link": "https://www.metacritic.com/game/playstation-5/atari-50-the-anniversary-celebration", "publisher": "Atari", "release_date": "Nov 11 2022", "developers": ["Digital Eclipse"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/cd3266d9f34bd7fe183a0a269bb8df1d-98.jpg", "descriptions": "It has been five decades since a small team in Silicon Valley first combined their creativity, curiosity and passion into making video games and hardware. The result of their efforts was Atari, one of the most recognizable and enduring entertainment and pop culture brands in the world.It has been five decades since a small team in Silicon Valley first combined their creativity, curiosity and passion into making video games and hardware. The result of their efforts was Atari, one of the most recognizable and enduring entertainment and pop culture brands in the world.Atari 50: The Anniversary Celebration takes players on an interactive journey through 50 years of video games via interviews with designers, developers and industry leaders, documentary footage, product design documents, high-resolution original artwork, and a specially-curated list of more than 90 playable games.… Expand"}, {"name": "Disco Elysium: The Final Cut", "details_link": "https://www.metacritic.com/game/playstation-4/disco-elysium-the-final-cut", "publisher": "ZA/UM", "release_date": "Mar 30 2021", "developers": ["ZA/UM"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Western-Style"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/e793fbb464dd58dadcf46f43c5ac761c-98.jpg", "descriptions": "Disco Elysium is about a detective who wakes up in a rundown coastal district with a banging headache and only a few dregs of memory left. You set out to discover what happened to him inside the unique world we have created. We’ve thrown together disco music, early motor carriages, andDisco Elysium is about a detective who wakes up in a rundown coastal district with a banging headache and only a few dregs of memory left. You set out to discover what happened to him inside the unique world we have created. We’ve thrown together disco music, early motor carriages, and post-revolutionary angst for our setting, and brought it all to life with actual oil paintings.… Expand"}, {"name": "DmC: Devil May Cry", "details_link": "https://www.metacritic.com/game/xbox-360/dmc-devil-may-cry", "publisher": "Capcom", "release_date": "Jan 15 2013", "developers": ["Ninja Theory"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 86, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/f2a4fe9198b500c9bea477a0483d0a1b-98.jpg", "descriptions": "In a society infused with demons only The Order can, in Platonic style, see the world for what it really is. Join Dante in a stylish action experience; chain together multiple combos with flair and send the demonic spawn back to hell – uncover the truth behind the lies. Delve into Dante’sIn a society infused with demons only The Order can, in Platonic style, see the world for what it really is. Join Dante in a stylish action experience; chain together multiple combos with flair and send the demonic spawn back to hell – uncover the truth behind the lies. Delve into Dante’s dark past confronting some the most familiar faces in the DmC universe. Harness unimaginable powers combined with Dante’s notorious arsenal of weapons: sword, scythe, axe, pistols and more.… Expand"}, {"name": "Nioh 2: The Complete Edition", "details_link": "https://www.metacritic.com/game/pc/nioh-2-the-complete-edition", "publisher": "Koei Tecmo Games", "release_date": "Feb  5 2021", "developers": ["Team Ninja"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/6c92a466df24d8c744bf23c64b494393-98.jpg", "descriptions": "Battle hordes of yokai in this masocore Action RPG. Create your protagonist and embark on an adventure through a myriad of locales across Japan during the Sengoku period. Utilize the new Yokai Shift ability to defeat even the most ferocious yokai and be prepared to brave through Dark RealmsBattle hordes of yokai in this masocore Action RPG. Create your protagonist and embark on an adventure through a myriad of locales across Japan during the Sengoku period. Utilize the new Yokai Shift ability to defeat even the most ferocious yokai and be prepared to brave through Dark Realms created by your enemies.\r… Expand"}, {"name": "Medal of Honor Underground", "details_link": "https://www.metacritic.com/game/playstation/medal-of-honor-underground", "publisher": "Electronic Arts", "release_date": "Oct 23 2000", "developers": ["Dreamworks Interactive"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 86, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/447bb77ab264112dfde40ef10fe4dfc3-98.jpg", "descriptions": "Germans invaded your country. Your leaders surrendered, and some are now collaborating with the enemy. Join the resistance and battle the Reich from Paris to North Africa."}, {"name": "Dino Crisis 2", "details_link": "https://www.metacritic.com/game/playstation/dino-crisis-2", "publisher": "Capcom", "release_date": "Sep 29 2000", "developers": ["Capcom"], "platforms": ["PC", "PlayStation"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 86, "users_score": 9.4, "image": "https://static.metacritic.com/images/products/games/2/80863c1c4574dda0fc162cb94bad848c-98.jpg", "descriptions": "In the first Dino Crisis, Regina fought for survival against raging prehistoric dinosaurs and helped capture rogue scientist Dr. Kirk, but the threat is far from over. Despite these past events, research continued on Third Energy, which led to the disappearance of a military base, a researchIn the first Dino Crisis, Regina fought for survival against raging prehistoric dinosaurs and helped capture rogue scientist Dr. Kirk, but the threat is far from over. Despite these past events, research continued on Third Energy, which led to the disappearance of a military base, a research institute, and an entire town. Armed with the latest in heavy artillery, Regina and her team get to the root of this latest catastrophe. With more dinosaurs, environments, and weapons, you must be ready to hunt or be hunted.… Expand"}, {"name": "Star Trek: Voyager Elite Force", "details_link": "https://www.metacritic.com/game/pc/star-trek-voyager-elite-force", "publisher": "Activision", "release_date": "Sep 20 2000", "developers": ["Raven Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/9e559036112cbef613950fb591886b6e-98.jpg", "descriptions": "As Lt. Tuvok, you'll leap into action to defend the Voyager from assault, battle through derelict spacecraft, infiltrate a Borg cube, and take on the ultimate colonization force -- all while facing annihilation at every turn. No one said being a hero was easy.  [Activision]"}, {"name": "Need for Speed: High Stakes", "details_link": "https://www.metacritic.com/game/playstation/need-for-speed-high-stakes", "publisher": "Electronic Arts", "release_date": "Mar  1 1999", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/582143ffc290c46c29b29f95a06aaf41-98.jpg", "descriptions": "It doesn't really mess with the formula of the last game, but adds enough new features and options to keep its fans excited."}, {"name": "Dragon Ball FighterZ", "details_link": "https://www.metacritic.com/game/xbox-one/dragon-ball-fighterz", "publisher": "Bandai Namco Games", "release_date": "Jan 26 2018", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/f2c4e090ad41c8b507cbc5d3bb9793d6-98.jpg", "descriptions": "After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters.After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters. Partnering with Arc System Works, DRAGON BALL FighterZ maximizes high end Anime graphics and brings easy to learn but difficult to master fighting gameplay to audiences worldwide. \r\rKey Features:\r * 3vs3 TAG/SUPPORT\rAllows players to train and master more than one fighter/style which brings deeper gameplay\r * HIGH-END ANIME GRAPHICS\rUsing the power of the Unreal engine and the talented team at Arc System Works, DRAGON BALL FighterZ is a visual tour-de-force \r\r* SPECTACULAR FIGHTS\rExperience aerial combos, destructible stages, famous scenes from the DRAGON BALL anime reproduced in 60FPS and 1080p resolution (Higher resolution will be supported on PS4 Pro and Xbox Scorpio)… Expand"}, {"name": "Destiny 2: Forsaken", "details_link": "https://www.metacritic.com/game/xbox-one/destiny-2-forsaken", "publisher": "Activision", "release_date": "Sep  4 2018", "developers": ["Bungie Software", "Bungie"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 86, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/0d96ac0841c9f305e31dba62680d5943-98.jpg", "descriptions": "With 2 brand-new destinations to explore, and new weapons, armour and Supers to acquire, Forsaken takes players on an epic journey into the wild frontiers of our solar system where the lines between justice and revenge are blurred. Forsaken also features an all-new competitive andWith 2 brand-new destinations to explore, and new weapons, armour and Supers to acquire, Forsaken takes players on an epic journey into the wild frontiers of our solar system where the lines between justice and revenge are blurred. Forsaken also features an all-new competitive and collaborative endgame activity, called Gambit. A first-of-its kind for Destiny, Gambit is a new, hybrid 4v4 mode that merges both PvE and PvP experiences into an epic battle. This entirely new way to play Destiny 2 offers something for all types of gamers to enjoy, appealing to those who thrive on the competitive challenge of PvP gameplay, while seamlessly blending the collaborative and unpredictable elements of PvE. [Bungie] … Expand"}, {"name": "Street Fighter III: Third Strike Online Edition", "details_link": "https://www.metacritic.com/game/playstation-3/street-fighter-iii-third-strike-online-edition", "publisher": "Capcom", "release_date": "Aug 23 2011", "developers": ["Iron Galaxy Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 86, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/e9a00636fa22d621a4091389b1713514-98.jpg", "descriptions": "Street Fighter III: Third Strike Online Edition brings the classic fighting title to PS3 and Xbox 360."}, {"name": "Professor Layton and the Unwound Future", "details_link": "https://www.metacritic.com/game/ds/professor-layton-and-the-unwound-future", "publisher": "Nintendo", "release_date": "Sep 12 2010", "developers": ["Level 5"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/0c4a3672a211135c397a9b14f6b291f0-98.jpg", "descriptions": "Professor Layton and his apprentice, Luke, receive a confounding letter - from Luke 10 years in the future. But the message inside is even more troubling: London of the future is in disarray, and the only person\rwho can help set things right is Professor Layton."}, {"name": "Assassin's Creed IV: Black Flag", "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed-iv-black-flag", "publisher": "Ubisoft", "release_date": "Oct 29 2013", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Stadia", "Wii U", "Xbox One", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/dde69e624f55de8d42207e5f7a084a4d-98.jpg", "descriptions": "The year is 1715. Pirates rule the waters of the Caribbean and have established a lawless Republic. Among these outlaws is a lethal young captain named Edward Kenway. His notorious exploits earn the respect of legends like Blackbeard, but draw him into an ancient war that may destroyThe year is 1715. Pirates rule the waters of the Caribbean and have established a lawless Republic. Among these outlaws is a lethal young captain named Edward Kenway. His notorious exploits earn the respect of legends like Blackbeard, but draw him into an ancient war that may destroy everything the pirates have built for themselves.… Expand"}, {"name": "We Love Katamari", "details_link": "https://www.metacritic.com/game/playstation-2/we-love-katamari", "publisher": "Namco", "release_date": "Sep 20 2005", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 86, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/6c75075faeae73b215e140515b0640a6-98.jpg", "descriptions": "We Love Katamari features the diminutive yet determined Prince with an assortment of celestial cousins and the eccentric King of All Cosmos. The King of All Cosmos grew to stardom after taking all of the Prince's katamaris and replacing the stars. His fans knew no bounds and wished to seeWe Love Katamari features the diminutive yet determined Prince with an assortment of celestial cousins and the eccentric King of All Cosmos. The King of All Cosmos grew to stardom after taking all of the Prince's katamaris and replacing the stars. His fans knew no bounds and wished to see more katamaris fill the sky. The King of All Cosmos desired to appease all of their requests and recruited the Prince and his cousins to help. Now they are tasked with rolling up even more clumps, each larger and more different than the one before. In We Love Katamari, players find themselves in various new locations around Earth as the Prince and his cousins roll up different katamaris according to the fans' requests. We Love Katamari continues the series' trademark graphical style and musical excellence with an original soundtrack and hundreds of brand new items including Koi fish, angels and famous Earthly landmarks to roll up. The Prince's celestial rolling has no boundaries; as his katamari grows larger, he can roll up literally everything in his path – from underwater creatures to mountains and even the Eiffel Tower itself! Players can also roll with a friend in the all-new two-player cooperative mode. With each player controlling part of the clump, they will have to devise new strategies and communicate their rolling intentions in a new level of katamari madness. Battle Mode has also returned to We Love Katamari in extended form with three size scopes for competitive rolling action. [Namco]… Expand"}, {"name": "Tunic", "details_link": "https://www.metacritic.com/game/playstation-5/tunic", "publisher": "Finji", "release_date": "Sep 27 2022", "developers": ["ISOMETRICORP Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/f497031c48d525c8e756c6ded95e52b5-98.jpg", "descriptions": "TUNIC is an action adventure game about a tiny fox in a big world where you don't belong. Presented by Finji.Developed by Andrew Shouldice, TUNIC is a game shrouded in mystery and intrigue. Crafted to evoke feelings of classic action adventure games, TUNIC stars a heroic little fox as theyTUNIC is an action adventure game about a tiny fox in a big world where you don't belong. Presented by Finji.Developed by Andrew Shouldice, TUNIC is a game shrouded in mystery and intrigue. Crafted to evoke feelings of classic action adventure games, TUNIC stars a heroic little fox as they explore a foreign land that hides danger around every corner. Discover unique items, new combat techniques, and arcane secrets as our hero forges their way through intriguing new world. Explore a land filled with lost legends, ancient powers, and ferocious monsters in TUNIC, an isometric action game about a small fox on a big adventure. Stranded on a mysterious beach, armed with only your own curiosity, you will confront colossal beasts, collect strange and powerful items, and unravel long-lost secrets.* Explore a hostile and intricately-connected world of shady forests, sprawling ruins, and labyrinthine catacombs* Fight mighty bosses deep beneath the earth, high above the clouds, and in places stranger still* Collect the missing manual pages, bursting with hints and original full-colour illustrations* Discover hidden treasures to help you on your way* Unearth secret relics, secret techniques, secret puzzles, and listen, there's a lot of secrets!* Featuring sound design by Power Up Audio (Celeste, Darkest Dungeon, Subnautica: Below Zero)* And an original soundtrack by Lifeformed (Dustforce, Double Fine Adventure)Keep your wits about you and be brave, little fox!… Expand"}, {"name": "Worldwide Soccer Manager 2008", "details_link": "https://www.metacritic.com/game/pc/worldwide-soccer-manager-2008", "publisher": "Sega", "release_date": "Oct 23 2007", "developers": ["Sports Interactive"], "platforms": "PC", "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 86, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/388103246f1b75504e11b3beeb088650-98.jpg", "descriptions": "(Also known as \"Worldwide Soccer Manager 2008\")  Football Manager returns before Christmas packed full of new features for fans of the much-acclaimed series from Sports Interactive to feast their eyes on. Transfer Center - A new way of managing all current transfer and loan bids for your(Also known as \"Worldwide Soccer Manager 2008\")  Football Manager returns before Christmas packed full of new features for fans of the much-acclaimed series from Sports Interactive to feast their eyes on. Transfer Center - A new way of managing all current transfer and loan bids for your club, both incoming and outgoing, making it easier to compare bids and reject or accept them. Finance Revamp - Sports Interactive have updated the finance area of Football Manager 2008 to better reflect the ever-changing modern football world. More information is available to the manager too, including, but not limited to, corporate matchday income, season ticket news, investment funds, improved sponsorships, collective win bonuses and the ability to move around funds from the wage budget and transfer budget (and vice versa) at any point to help you in your quest for the ideal squad. International Management - The international management gameplay has been completely revamped for Football Manager 2008, including, but not limited to, media improvements, international retirements, player interaction, international scouting, improved national pool selection, captain selection and a separation of international and club morale for players. Match Flow - The largest change to matchdays in a Sports Interactive game since the introduction of the 2D match engine. Match flow brings more atmosphere to matchdays with match previews, team talks, opposition player instructions, the match itself, half time and post match now seamlessly following on from one another. There's no more pausing to make tactical changes and you'll find a mini-radar pitch whilst making those tactical changes to keep you in touch with what's going on in the match. [Sega Europe]… Expand"}, {"name": "Dance Central 2", "details_link": "https://www.metacritic.com/game/xbox-360/dance-central-2", "publisher": "Microsoft Game Studios", "release_date": "Oct 25 2011", "developers": ["Harmonix Music Systems"], "platforms": "Xbox 360", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/e534f409d4ce0df1d094e1978bf07b8b-98.jpg", "descriptions": "Dance Central 2 is the sequel to the popular Dance Central game."}, {"name": "Fell Seal: Arbiter's Mark", "details_link": "https://www.metacritic.com/game/playstation-4/fell-seal-arbiters-mark", "publisher": "1C Entertainment", "release_date": "Apr 30 2019", "developers": ["1C Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 86, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/8dff2fe38ad65a8131617753eca6e4fe-98.jpg", "descriptions": "Fell Seal: Arbiter’s Mark is a turn-based tactical RPG with a focus on storytelling and strategic battles. Unfold a mature story as you progress through hand-crafted scenarios, controlling your own group of Arbiters, with each character customizable from a wide selection of classes and abilities."}, {"name": "Sly Cooper and the Thievius Raccoonus", "details_link": "https://www.metacritic.com/game/playstation-2/sly-cooper-and-the-thievius-raccoonus", "publisher": "SCEA", "release_date": "Sep 23 2002", "developers": ["Sucker Punch"], "platforms": ["PlayStation 3", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/01af25225a279c7229abdbea7d86cbd2-98.jpg", "descriptions": "Sly Cooper was born into the world's greatest thieving family. On his eighth birthday, Sly is presented with the \"Thievius Raccoonus,\" an ancient thieving instruction guide passed down through his family for generations. Later that evening, a gang of ruthless villains break into hisSly Cooper was born into the world's greatest thieving family. On his eighth birthday, Sly is presented with the \"Thievius Raccoonus,\" an ancient thieving instruction guide passed down through his family for generations. Later that evening, a gang of ruthless villains break into his harmonious home to steal the valuable heirloom. As Sly watches in terror, the intruders overpower his father and split the \"Thievius Raccoonus\" into pieces, which they divide between themselves. Ten years later, Sly is out to steal the \"Thievius Raccoonus\" back and reclaim what is rightfully his. He enlists the help of his gadget genius pal, Bentley, and his big eager friend Murray, and the trio embark on a quest to help Sly prove he is the world's greatest thief and to restore honor to his family's name. [Sucker Punch]… Expand"}, {"name": "IL-2 Sturmovik: Forgotten Battles", "details_link": "https://www.metacritic.com/game/pc/il-2-sturmovik-forgotten-battles", "publisher": "Ubisoft", "release_date": "Mar  2 2003", "developers": ["1C", "1C Entertainment"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/2add28e77291c467fa3a4485f680069c-98.jpg", "descriptions": "With 20 new single player missions and 10 new cooperative multiplayer missions, and a new dynamic campaign system, Forgotten Battles expands the aerial battlefield for IL-2 owners, adding almost limitless replayability. The expansion pack also adds 27 new flyable planes, and 12 new AIWith 20 new single player missions and 10 new cooperative multiplayer missions, and a new dynamic campaign system, Forgotten Battles expands the aerial battlefield for IL-2 owners, adding almost limitless replayability. The expansion pack also adds 27 new flyable planes, and 12 new AI controlled aircraft to faithfully recreate the WWII aerial combat experience.… Expand"}, {"name": "Geometry Wars: Retro Evolved", "details_link": "https://www.metacritic.com/game/xbox-360/geometry-wars-retro-evolved", "publisher": "Bizarre Creations", "release_date": "Nov 22 2005", "developers": ["Bizarre Creations"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/f9a841ad4cad99cad4f58470dda532a1-98.jpg", "descriptions": "[Xbox Live Arcade]  Return to the farthest reaches of the galaxy, where hordes of evil, neon shapes await. The circles, squares, and diamonds are out to get you in Geometry Wars: Retro Evolved. Green squares evade your fire; purple ones divide into smaller clones. Snake-like lines leave[Xbox Live Arcade]  Return to the farthest reaches of the galaxy, where hordes of evil, neon shapes await. The circles, squares, and diamonds are out to get you in Geometry Wars: Retro Evolved. Green squares evade your fire; purple ones divide into smaller clones. Snake-like lines leave behind a venomous trail, and red circles morph into black holes. Conserve your bombs—they destroy all enemies, but quantities are limited. Geometry Wars became an instant classic when it first appeared in \"Project Gotham Racing 2.\" This exclusive Xbox Live Arcade sequel gives you both the original Retro version and a new Evolved mode, which combines modern graphics with old-school fun. [Xbox.com]… Expand"}, {"name": "Fight Night Round 3", "details_link": "https://www.metacritic.com/game/xbox-360/fight-night-round-3", "publisher": "EA Sports", "release_date": "Feb 20 2006", "developers": ["EA Chicago"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 86, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/3cea95725f0651979c81cb330bf39e8c-98.jpg", "descriptions": "Go toe-to-toe with greats such as Ali, De La Hoya, Joe Frazier, Bernard Hopkins and Roy Jones. Outside of the ring, gamers can establish intense rivalries through pre-fight events putting purpose and passion behind every hit. Three new Impact Punches a la the EA Sports Haymaker keep gamersGo toe-to-toe with greats such as Ali, De La Hoya, Joe Frazier, Bernard Hopkins and Roy Jones. Outside of the ring, gamers can establish intense rivalries through pre-fight events putting purpose and passion behind every hit. Three new Impact Punches a la the EA Sports Haymaker keep gamers at the edge of their seat as players are only one punch away from the entire dynamic of the fight changing. Land a perfectly timed Flash KO or jump into a quick mid-fight mini-game to land a humiliating knockdown punch. Thrown using EA Sports Fight Night's innovative analog punch system, Impact Punches are high risk and high reward - put down your opponent or get knocked on the canvas. Boxing's Greatest Rivalries - Watch ESPN Classic footage of real-life bouts or re-create the greatest fights from past and present including Arturo Gatti vs. Mickey Ward, Marco Antonio Barrera vs. Eric Morales, and Ali vs. Frasier. Establish intense rivalries of your own by intimidating opponents before the big fight with heated press conferences full of hype, trash talkin', and fights at weigh-ins. Relive the best rivalries of your career in ESPN's Instant Classics! Create a style of your own, then see how you match up against the authentic signature styles from the world's best fighters. Licensed boxers use tactics and strategies that match their real life counterparts. Self Determinant AI adapts its style to match user strengths and to exploit weaknesses. [Electronic Arts]… Expand"}, {"name": "F1 2016", "details_link": "https://www.metacritic.com/game/pc/f1-2016", "publisher": "Codemasters", "release_date": "Aug 19 2016", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/7ac20013986c3d47471098044eb8cb73-98.jpg", "descriptions": "Includes the full 2016 season calendar of 21 tracks, including the brand new Baku circuit in Azerbaijan, and the full roster of 22 drivers and 11 teams, including the new Haas F1 Team. F1 2016 immerses you in not only the on-track excitement of a FORMULA ONE career, including the inclusionIncludes the full 2016 season calendar of 21 tracks, including the brand new Baku circuit in Azerbaijan, and the full roster of 22 drivers and 11 teams, including the new Haas F1 Team. F1 2016 immerses you in not only the on-track excitement of a FORMULA ONE career, including the inclusion of the iconic Safety Car and also the Virtual Safety Car for the first time, but also uniquely offers the drama and vehicle development that goes on behind the scenes. Work with your agent, engineer and team to develop your car in the deepest ever career experience, spanning up to ten seasons. Forge your own path to glory, and rise to be the champion. … Expand"}, {"name": "Amplitude", "details_link": "https://www.metacritic.com/game/playstation-2/amplitude", "publisher": "SCEA", "release_date": "Mar 24 2003", "developers": ["Harmonix Music Systems"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/57963c1223a4288b00f6346e091633cd-98.jpg", "descriptions": "The sequel to Sony's \"Frequency\" features music from such artists as David Bowie, Weezer, Garbage, Quarashi, Logan 7. Trigger drum, bass, vocal, and guitar tracks by tapping the control pad in time to rhythm, and you'll generate an amazing lightshow to accompany your musical stylings. EvenThe sequel to Sony's \"Frequency\" features music from such artists as David Bowie, Weezer, Garbage, Quarashi, Logan 7. Trigger drum, bass, vocal, and guitar tracks by tapping the control pad in time to rhythm, and you'll generate an amazing lightshow to accompany your musical stylings. Even better, Amplitude is compatible with Sony's online adapter, so multiplayer game aren't limited to folks sitting around in your living room. Online options will include full chat modes and a ranking system, as well as the ability to create a remix online, which can be saved by the system for other players to listen to and play.… Expand"}, {"name": "Bastion", "details_link": "https://www.metacritic.com/game/xbox-360/bastion", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jul 20 2011", "developers": ["Supergiant Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "Xbox 360"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/5a2381e285af547d87bc73b291beaef4-98.jpg", "descriptions": "Bastion is an action role-playing game from Supergiant Games."}, {"name": "DiRT 3", "details_link": "https://www.metacritic.com/game/pc/dirt-3", "publisher": "Codemasters", "release_date": "May 23 2011", "developers": ["Codemasters"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 86, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/248cd6c00066e111226ed17d922d51a5-98.jpg", "descriptions": "DiRT 3 will boast more cars, more locations, more routes and more events than any other game in the series, including over 50 rally cars representing the very best from five decades of the sport.  DiRT 3 delivers mud, sweat and gears world over: from the intense weather-beaten rally stagesDiRT 3 will boast more cars, more locations, more routes and more events than any other game in the series, including over 50 rally cars representing the very best from five decades of the sport.  DiRT 3 delivers mud, sweat and gears world over: from the intense weather-beaten rally stages of Europe, Africa and the US, to executing performance driving showcases and career challenges where car control is pushed to spectacular limits.  … Expand"}, {"name": "Minecraft: PlayStation 3 Edition", "details_link": "https://www.metacritic.com/game/playstation-3/minecraft-playstation-3-edition", "publisher": "SCEA", "release_date": "Dec 17 2013", "developers": ["4J Studios", "Mojang AB"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Fantasy", "Action Adventure", "Adventure", "3D", "Sandbox", "First-Person", "Fantasy"], "meta_score": 86, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/553293838614ca362bb621733bc2b93c-98.jpg", "descriptions": "Imagine it, and you can build it. Create your very own game world and explore, build and conquer. When night falls the monsters appear, so ensure you’ve made yourself a shelter before they arrive. Make it through the night and the world is only limited by your imagination you choose what youImagine it, and you can build it. Create your very own game world and explore, build and conquer. When night falls the monsters appear, so ensure you’ve made yourself a shelter before they arrive. Make it through the night and the world is only limited by your imagination you choose what you want to make or what to do. Play on your own, cooperatively with friends in 2 player and 4 player split screen modes, or online with up to 8 players. Split screen option requires HD TV with HD connection. … Expand"}, {"name": "Devotion", "details_link": "https://www.metacritic.com/game/pc/devotion", "publisher": "Red Candle Games", "release_date": "Feb 19 2019", "developers": ["Red Candle Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/a0334d40278a5b26fbfe416b760be78d-98.jpg", "descriptions": "Devotion is a first-person atmospheric horror game depicting the life of a family shadowed by religious belief. Explore a 1980s Taiwan apartment complex lost in time gradually shift into a hellish nightmare. Delve into the vows each member of the family has made, and witness their devotion."}, {"name": "Sonic Mania", "details_link": "https://www.metacritic.com/game/playstation-4/sonic-mania", "publisher": "SegaSoft", "release_date": "Aug 15 2017", "developers": ["SegaSoft", "Sega", "PagodaWest Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/1d05653031bc510fd043b038083efa0c-98.jpg", "descriptions": "Experience the ultimate celebration of past and future in Sonic Mania, an all-new 2D Sonic adventure running at a crisp 60FPS with stunning HD retro-style graphics. Multiple playable characters give you the ability to go explosively fast as Sonic, soar as Tails, or power through toughExperience the ultimate celebration of past and future in Sonic Mania, an all-new 2D Sonic adventure running at a crisp 60FPS with stunning HD retro-style graphics. Multiple playable characters give you the ability to go explosively fast as Sonic, soar as Tails, or power through tough obstacles with Knuckles’ brute strength. You can re-live the Sonic of the past with an exciting new twist on classic zones while fighting against new bosses and Dr. Eggman’s evil robot army. Go head to-head with players in Competition Mode or play in Co-Op Mode with a friend. [Playstation.com]… Expand"}, {"name": "The Legend of Zelda: Four Swords Adventures", "details_link": "https://www.metacritic.com/game/gamecube/the-legend-of-zelda-four-swords-adventures", "publisher": "Nintendo", "release_date": "Jun  7 2004", "developers": ["Nintendo"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/9b5f8e15ebfca8784319763dc9fc6ced-98.jpg", "descriptions": "The legend continues on the GameCube in an all-new epic adventure for one to four players. To thwart Vaati's vile forces, Link turns to the mystical power of the Four Swords to split himself into four colored copies of himself. Now you and your friends can simultaneously participate inThe legend continues on the GameCube in an all-new epic adventure for one to four players. To thwart Vaati's vile forces, Link turns to the mystical power of the Four Swords to split himself into four colored copies of himself. Now you and your friends can simultaneously participate in cooperative and competitive action and master skills and techniques new to the Legend of Zelda series. In Four Swords Adventures, up to four players can link their Game Boy Advances to the GameCube to join a fun and intense competition for Force Gems while cooperating to move massive blocks, trigger switches, and slay mighty bosses. … Expand"}, {"name": "Joe Danger", "details_link": "https://www.metacritic.com/game/playstation-3/joe-danger", "publisher": "Hello Games", "release_date": "Jun  8 2010", "developers": ["Hello Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "PlayStation 3"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/d8ef73b44eae652481f33a8f63dace21-98.jpg", "descriptions": "[Playstation Network]  Take control of Joe Danger, motorbike stuntman, and break world records in this 3D side-scrolling stunt-em-up."}, {"name": "Tales of Symphonia", "details_link": "https://www.metacritic.com/game/gamecube/tales-of-symphonia", "publisher": "Namco", "release_date": "Jul 13 2004", "developers": ["Namco"], "platforms": ["PC", "PlayStation 3", "GameCube"], "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 86, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/3/0b6213a7ec9c61d15384e048de29e393-98.jpg", "descriptions": "In a dying village on Sylvarant, legend has it that a Chosen One will one day appear from among the people, and the land will be reborn. Now, you must enter a cel-shaded world in which you command real-time battles. Execute and combine hundreds of special attacks, magic spells, and combos.In a dying village on Sylvarant, legend has it that a Chosen One will one day appear from among the people, and the land will be reborn. Now, you must enter a cel-shaded world in which you command real-time battles. Execute and combine hundreds of special attacks, magic spells, and combos. Each character grows to suit your fighting style, and the storyline changes based on the characters' relationships. The line between good and evil blurs in this immersive adventure where the fate of two interlocked worlds hangs in the balance. … Expand"}, {"name": "Fight Night Champion", "details_link": "https://www.metacritic.com/game/xbox-360/fight-night-champion", "publisher": "EA Sports", "release_date": "Mar  1 2011", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/3a1f63049ba3c3e9a9df8456f2a04062-98.jpg", "descriptions": "A new installment in EA Sports' boxing series will enter the ring in early 2011."}, {"name": "NBA Live 2004", "details_link": "https://www.metacritic.com/game/playstation-2/nba-live-2004", "publisher": "EA Sports", "release_date": "Oct 14 2003", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/948728f01228c3576a17aa01f43a1a61-98.jpg", "descriptions": "Step up your game with NBA Live 2004. With brand-new 10-Man Freestyle, authentic gameplay, and stunning graphics, NBA Live 2004 delivers the definitive basketball experience. Whether running the point with one-button Quick Plays, spinning free in the lane for a vicious dunk, or locking downStep up your game with NBA Live 2004. With brand-new 10-Man Freestyle, authentic gameplay, and stunning graphics, NBA Live 2004 delivers the definitive basketball experience. Whether running the point with one-button Quick Plays, spinning free in the lane for a vicious dunk, or locking down on \"D\", NBA LIVE 2004 puts players in total control. With a dramatically enhanced Dynasty Mode, the ability to take the court at all NBA arenas, and all-new commentary from Marv Albert and Mike Fratello, NBA Live 2004 is all about authenticity. Compete in One-on-One or all-new Online Tournament games, and chat in-game with EA SPORTS Talk. [Electronic Arts]… Expand"}, {"name": "Colin McRae Rally 3", "details_link": "https://www.metacritic.com/game/playstation-2/colin-mcrae-rally-3", "publisher": "Codemasters", "release_date": "Apr 22 2003", "developers": ["Codemasters"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/1f0d6f56175d0b411e3158b344a97916-98.jpg", "descriptions": "(Colin McRae Rally 3 isn't just about cars and tracks; it's about giving gamers the professional rally driver experience. The game makes a massive leap in terms of playability, motor sport detail and rich visuals; above all it delivers a game that captures every drop of sweat, the(Colin McRae Rally 3 isn't just about cars and tracks; it's about giving gamers the professional rally driver experience. The game makes a massive leap in terms of playability, motor sport detail and rich visuals; above all it delivers a game that captures every drop of sweat, the split-second decision and the teamwork that goes into actually being Colin McRae. Capturing the emotions and consequences of being a professional rally champion, it takes the gaming experience to the limit as the player attempts to become the planet's greatest rally driver. As Colin McRae, get behind the wheel of his internationally famous Ford Focus PS WRC with co-driver Nicky Grist and set the course alight as you race to become champion. [Codemasters]… Expand"}, {"name": "Tom Clancy's Rainbow Six 3", "details_link": "https://www.metacritic.com/game/xbox/tom-clancys-rainbow-six-3", "publisher": "Ubisoft", "release_date": "Mar 14 2003", "developers": ["Ubisoft"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-16 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/d1472afff27c0735167d4fbd19187775-98.jpg", "descriptions": "As terrorist attacks against the United States and Venezuela escalate, you are in charge of leading the last line of defense: Rainbow.  In Rainbow Six 3, you will lead this top-secret task force dedicated to combating terrorism in all its forms.  Your team consists of the best fieldAs terrorist attacks against the United States and Venezuela escalate, you are in charge of leading the last line of defense: Rainbow.  In Rainbow Six 3, you will lead this top-secret task force dedicated to combating terrorism in all its forms.  Your team consists of the best field operatives--equipped with an arsenal of no fewer than 30 weapons--that the United Nations has to offer.  Tackle all 14 worldwide missions in single-player or match wits and words against 15 other players online, with full headset support.  You may be the last hope in the war against terror.… Expand"}, {"name": "Colin McRae Rally 3", "details_link": "https://www.metacritic.com/game/xbox/colin-mcrae-rally-3", "publisher": "Codemasters", "release_date": "Feb 18 2003", "developers": ["Codemasters"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 86, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/9379be49fa22c59f77c9910fab465076-98.jpg", "descriptions": "Live the life of a rally driver and prove your skills around the world. As part of the Ford Rally Sport Team, you'll have access to authentic high-performance rally cars, including Mitsubishi Lancer EVO 7, Subaru Impreza WRX, Citroen Saxo Kit Car, and Ford Focus RS WRC. It's a race againstLive the life of a rally driver and prove your skills around the world. As part of the Ford Rally Sport Team, you'll have access to authentic high-performance rally cars, including Mitsubishi Lancer EVO 7, Subaru Impreza WRX, Citroen Saxo Kit Car, and Ford Focus RS WRC. It's a race against the clock through 56 stages from the United Kingdom to the United States. If you damage your car or the landscape, the path to the finish line will be a shaky one. … Expand"}, {"name": "Burnout 2: Point of Impact", "details_link": "https://www.metacritic.com/game/playstation-2/burnout-2-point-of-impact", "publisher": "Acclaim", "release_date": "Sep 30 2002", "developers": ["Criterion Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/6861a5dc47a1dd5072e0fa53d2b543bb-98.jpg", "descriptions": "Features six new United States locations, including Miami, Los Angeles, The Rocky Mountains, New Mexico and a busy international airport; thirty new stages and fourteen all-new vehicles; seven secret vehicles to unlock including police cars, 1950's hotrods and stock cars; point-to-pointFeatures six new United States locations, including Miami, Los Angeles, The Rocky Mountains, New Mexico and a busy international airport; thirty new stages and fourteen all-new vehicles; seven secret vehicles to unlock including police cars, 1950's hotrods and stock cars; point-to-point races; all-new points-based championship gameplay structure; new Custom Series Mode that allows you to race modified vehicles complete with body kits and decals; and an intelligent traffic system, featuring three distinct types of driver behaviors. [Acclaim]… Expand"}, {"name": "Unreal Tournament 2003", "details_link": "https://www.metacritic.com/game/pc/unreal-tournament-2003", "publisher": "Atari", "release_date": "Sep 30 2002", "developers": ["Digital Extremes"], "platforms": "PC", "num_players": "1-64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/40d44f0951ca39c2e81a0d87091c4469-98.jpg", "descriptions": "Reload with Unreal Tournament 2003 - the sequel to 1999's multiple 'Game of the Year' award winner - \"Unreal Tournament.\" Using the latest Unreal technology, Unreal Tournament 2003 takes you to the merciless arenas of the future, where elite warriors rely on skill, speed, cunning and awesomeReload with Unreal Tournament 2003 - the sequel to 1999's multiple 'Game of the Year' award winner - \"Unreal Tournament.\" Using the latest Unreal technology, Unreal Tournament 2003 takes you to the merciless arenas of the future, where elite warriors rely on skill, speed, cunning and awesome firepower to demonstrate their style and become the ultimate champion. [Infogrames]… Expand"}, {"name": "Age of Wonders II: The Wizard's Throne", "details_link": "https://www.metacritic.com/game/pc/age-of-wonders-ii-the-wizards-throne", "publisher": "Gathering", "release_date": "Jun 12 2002", "developers": ["Triumph Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/3f18ab31e9721089be8134bf3dfbf347-98.jpg", "descriptions": "Delivering an invigorating mix of Empire Building, Role-playing, and Warfare, Age Of Wonders II offers the ultimate in fantasy turn-based strategy. Explore a world full of mythical creatures and mysterious lands. Build an impressive force as an all-powerful Wizard through dangerous perilsDelivering an invigorating mix of Empire Building, Role-playing, and Warfare, Age Of Wonders II offers the ultimate in fantasy turn-based strategy. Explore a world full of mythical creatures and mysterious lands. Build an impressive force as an all-powerful Wizard through dangerous perils and exhilarating challenges. Now is your time to embrace your destiny and take your rightful place at the head of the Circle, forever. [GodGames]… Expand"}, {"name": "Daytona USA", "details_link": "https://www.metacritic.com/game/dreamcast/daytona-usa", "publisher": "Sega", "release_date": "Mar 12 2001", "developers": ["Amusement Vision"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/404cac3feead64648b150dd977f1509b-98.jpg", "descriptions": "Feel the thundering sound of finely tuned engines and the scent of burning rubber as you await the 'Rolling Start'! Immerse yourself in the blistering speed and white-knuckle action of Daytona USA 2001, the enhanced version of the most renowned arcade racing classic of all time, featuringFeel the thundering sound of finely tuned engines and the scent of burning rubber as you await the 'Rolling Start'! Immerse yourself in the blistering speed and white-knuckle action of Daytona USA 2001, the enhanced version of the most renowned arcade racing classic of all time, featuring exclusive new tracks, secret un-lockable vehicles and if you have the skill, you can upload/download fastest times and ghost data via the internet ranking board.… Expand"}, {"name": "Links 2001", "details_link": "https://www.metacritic.com/game/pc/links-2001", "publisher": "Microsoft Game Studios", "release_date": "Oct 24 2000", "developers": ["Microsoft Game Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 86, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/fdd78fc7f1b4ac15d19a60b5d459e64a-98.jpg", "descriptions": "Features an all-new graphics rendering engine, perfected ball physics, new tour players and courses, and the new Arnold Palmer Course Designer (APCD).  [Microsoft]"}, {"name": "EverQuest: The Ruins of Kunark", "details_link": "https://www.metacritic.com/game/pc/everquest-the-ruins-of-kunark", "publisher": "Sony Online Entertainment", "release_date": "Mar 24 2000", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/8027e7a882d2477c845a8b003f980cde-98.jpg", "descriptions": "An entire world with its own diverse species, economic systems, alliances, and politics awaits you. Choose from a variety of races and classes, and begin your quest in any number of cities or villages throughout several continents. From there, equip yourself for adventure, seek allies andAn entire world with its own diverse species, economic systems, alliances, and politics awaits you. Choose from a variety of races and classes, and begin your quest in any number of cities or villages throughout several continents. From there, equip yourself for adventure, seek allies and knowledge, and head out into a rich world of dungeons, towers, crypts, evil abbeys -- anything conceivable -- even planes and realities beyond your imagination. Learn skills, earn experience, acquire treasure and equipment, meet friends and encounter enemies. A multitude of quests and adventures await, but you choose your role, you define your destiny. [Sony Online Entertainment]… Expand"}, {"name": "Full Throttle", "details_link": "https://www.metacritic.com/game/pc/full-throttle", "publisher": "LucasArts", "release_date": "Apr 30 1995", "developers": ["LucasArts"], "platforms": "PC", "genres": ["Adventure", "General"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/a326d3d1a420ccbe350481b09d67bc69-98.jpg", "descriptions": "You're Ben--beaten, framed for murder and left for dead on the roadside. You've got a lump on your back and a feeling in your gut that the road you're on is about to get a lot rougher. Full Throttle features an amazingly simple interface and fast-paced action. Brilliant graphics andYou're Ben--beaten, framed for murder and left for dead on the roadside. You've got a lump on your back and a feeling in your gut that the road you're on is about to get a lot rougher. Full Throttle features an amazingly simple interface and fast-paced action. Brilliant graphics and animation provide a strong cartoon feel, while the voice acting is powerful and cinematic. Players find themselves racing to the finish to help Ben find the bad guys.… Expand"}, {"name": "Katamari Damacy", "details_link": "https://www.metacritic.com/game/playstation-2/katamari-damacy", "publisher": "Namco", "release_date": "Sep 21 2004", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 86, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/3f927d46d6159fb41674f5642333ba3b-98.jpg", "descriptions": "(Also known as \"Katamari Damashii\" )  In Katamari Damacy, players take on the role of Prince of the Cosmos, whose father ­ the great King ­ managed to inadvertently knock the stars out of the sky. As the prince, a player's duty is to clean up the King's mess and re-create the starry skies by(Also known as \"Katamari Damashii\" )  In Katamari Damacy, players take on the role of Prince of the Cosmos, whose father ­ the great King ­ managed to inadvertently knock the stars out of the sky. As the prince, a player's duty is to clean up the King's mess and re-create the starry skies by rolling around the cleverly designed locations to collect objects and build up their 'katamari' -- a Japanese word for clump or large mass. The catch is that it's not the quality or the actual number of objects gathered that is most critical to the player's success, but instead the sheer size of the player's 'katamari' that is most important. Along the way, players can roll over hundreds of unusual objects of all sizes and shapes including cookies, cars, mermaids, planes, clouds and even people. The larger the player's 'katamari' grows, the more objects the player can amass along the way -- thus proving if you want to succeed in Katamari Damacy -- size does matter. Katamari Damacy features a single-player story mode and a two-player battle mode. The simple game play mechanics allow for optimal ball rolling and object collecting fun. [Namco]… Expand"}, {"name": "The Lord of the Rings Online: Shadows of Angmar", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-online-shadows-of-angmar", "publisher": "Midway", "release_date": "Apr 24 2007", "developers": ["Turbine Inc."], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/b65e289519e0060248bcfb897569dc20-98.jpg", "descriptions": "The only massively-multiplayer role-playing game set in J.R.R. Tokien's Middle-earth. Travel with your Fellowship in the fight against the forces of Sauron. Across the wide lands of Middle-earth, the Free Peoples must face the threatening Shadow growing in the East. All of Mordor is stirringThe only massively-multiplayer role-playing game set in J.R.R. Tokien's Middle-earth. Travel with your Fellowship in the fight against the forces of Sauron. Across the wide lands of Middle-earth, the Free Peoples must face the threatening Shadow growing in the East. All of Mordor is stirring as Sauron dispatches the NazgÃ»l to hunt for the Ring. The rumor of war brings forth many eager adventurers who will find their place among the great events of the Third Age. High deeds call to the willing, for their time is at hand. Hundreds of thousands of people will enter the perpetual world of Middle-earth for the very first time. Prepare yourself to choose a path amongst the likes of Elves, Dwarves, and Humans. Will you choose to fight for the things that bring peace to the land or will you add to the corruption of Middle-earth as the forces of Sauron move swiftly to extinguish all that is good? [Turbine]… Expand"}, {"name": "Grand Theft Auto: Vice City Stories", "details_link": "https://www.metacritic.com/game/psp/grand-theft-auto-vice-city-stories", "publisher": "Rockstar Games", "release_date": "Oct 31 2006", "developers": ["Rockstar Leeds"], "platforms": ["PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/73ef5ef4c626a14b8f8faeada172042e-98.jpg", "descriptions": "Vice City, 1984. Opportunity abounds in a city emerging from the swamps, its growth fueled by the violent power struggle in a lucrative drugs trade. Construction is everywhere as a shining metropolis rises from foundations of crime and betrayal. As a soldier, Vic Vance always protected hisVice City, 1984. Opportunity abounds in a city emerging from the swamps, its growth fueled by the violent power struggle in a lucrative drugs trade. Construction is everywhere as a shining metropolis rises from foundations of crime and betrayal. As a soldier, Vic Vance always protected his dysfunctional family, his country, himself. One bad decision later and that job is about to get much harder. Kicked out onto the streets of a city between glamour and gluttony, Vic is faced with a stark choice - build an empire or be crushed. [Rockstar Games]… Expand"}, {"name": "Desperados III", "details_link": "https://www.metacritic.com/game/pc/desperados-iii", "publisher": "THQ Nordic", "release_date": "Jun 16 2020", "developers": ["Mimimi Productions"], "platforms": ["PlayStation 4", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/0bae8084d91279c1af753ce3b914717c-98.jpg", "descriptions": "On his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and aOn his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and a mysterious lady from New Orleans. They make their way from the mountains of Colorado to the heart of Louisiana, then finally to New Mexico, right back into Cooper's past.\r You take control of this ragtag band becoming a highly functional group of unlikely heroes and heroines. The leader of his team is Cooper, drifter and gunslinger, who can kill quietly with a knife or take out multiple foes with his revolvers. Strongman Hector carries a giant beartrap and can slay the toughest opponents with his trusty axe. Cold-blooded bounty hunter McCoy likes to be methodical, using lures, knockout gas, poison syringes and a custom long-range pistol. Kate can fool almost any man with the right outfit and kill discretely with her hidden gun.\r Combine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real-time to sneak past your enemies while remaining undetected.… Expand"}, {"name": "Mortal Kombat 11", "details_link": "https://www.metacritic.com/game/xbox-one/mortal-kombat-11", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 23 2019", "developers": ["NetherRealm Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 86, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/3/eec2bb9cc2d7407cbb462e41c233e70f-98.jpg", "descriptions": "Mortal Kombat is back and better than ever in the next evolution of the iconic franchise. The all new Custom Character Variations give you unprecedented control to customize the fighters and make them your own. The new graphics engine showcasing every skull-shattering, eye-popping moment,Mortal Kombat is back and better than ever in the next evolution of the iconic franchise. The all new Custom Character Variations give you unprecedented control to customize the fighters and make them your own. The new graphics engine showcasing every skull-shattering, eye-popping moment, brings you so close to the fight you can feel it. And featuring a roster of new and returning Klassic Fighters, Mortal Kombat's best in class cinematic story mode continues the epic saga over 25 years in the making.… Expand"}, {"name": "Pony Island", "details_link": "https://www.metacritic.com/game/pc/pony-island", "publisher": "Daniel Mullins Games", "release_date": "Jan  4 2016", "developers": ["Daniel Mullins Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/ae2008bdac56cef09541b43a81e8ee07-98.jpg", "descriptions": "Pony Island is a suspense puzzle game in disguise. You are in limbo, trapped in a malevolent and malfunctioning arcade machine devised by the devil himself."}, {"name": "Tomb Raider: Definitive Edition", "details_link": "https://www.metacritic.com/game/xbox-one/tomb-raider-definitive-edition", "publisher": "Square Enix", "release_date": "Jan 28 2014", "developers": ["Crystal Dynamics", "United Front Games"], "platforms": ["PlayStation 4", "Stadia", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Modern", "Action Adventure", "General", "Modern", "Linear"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/4dcd13c8fea3980bc5457caf59717d59-98.jpg", "descriptions": "Armed with only the raw instincts and physical ability to push beyond the limits of human endurance, Tomb Raider delivers an intense and gritty story into the origins of Lara Croft and her ascent from a frightened young woman to a hardened survivor."}, {"name": "Warhammer 40,000: Dawn of War", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-dawn-of-war", "publisher": "THQ", "release_date": "Sep 20 2004", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/aa001c1b883880267fc49997edd53eb6-98.jpg", "descriptions": "Warhammer 40,000: Dawn of War is a science fiction real-time strategy (RTS) game set in the violent, post-apocalyptic universe of the 41st Millennium. Utilizing the exceptional game design skills of Relic Entertainment, Dawn of War provides an immersive entertainment experience of epicWarhammer 40,000: Dawn of War is a science fiction real-time strategy (RTS) game set in the violent, post-apocalyptic universe of the 41st Millennium. Utilizing the exceptional game design skills of Relic Entertainment, Dawn of War provides an immersive entertainment experience of epic proportions. Command hardened troops, deadly vehicles and high tech weaponry with one goal in mind, the complete extermination of the opposition. Whether you lead Humanity's finest - the Space Marines, the diabolic and villainous traitors of man - the Chaos Space Marines, the brutal and savage beasts - the Orks, or the psychic and technologically advanced alien warriors - the Eldar, you control the action and the fate of your race! [THQ]… Expand"}, {"name": "Diablo III", "details_link": "https://www.metacritic.com/game/playstation-3/diablo-iii", "publisher": "Blizzard Entertainment", "release_date": "Sep  3 2013", "developers": ["Blizzard Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 86, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/4b5b6fc1c7e6f1f17597d351b3dba971-98.jpg", "descriptions": "The game takes place on Sanctuary, a world of dark fantasy. Unbeknownst to most of its inhabitants, Sanctuary was saved some twenty years ago from the demonic forces of the underworld by a few brave and powerful heroes. Most of those warriors who directly faced the armies of the BurningThe game takes place on Sanctuary, a world of dark fantasy. Unbeknownst to most of its inhabitants, Sanctuary was saved some twenty years ago from the demonic forces of the underworld by a few brave and powerful heroes. Most of those warriors who directly faced the armies of the Burning Hells -- and were fortunate enough to survive -- went mad from their experiences. And most of the others have buried their haunted memories and pushed the horrors from their thoughts. In Diablo III, players will return to Sanctuary to confront evil in its many forms once again.… Expand"}, {"name": "MLB The Show 19", "details_link": "https://www.metacritic.com/game/playstation-4/mlb-the-show-19", "publisher": "Sony Interactive Entertainment", "release_date": "Mar 26 2019", "developers": ["Sony Interactive Entertainment"], "platforms": "PlayStation 4", "num_players": "Up to 8 ", "genres": ["Sports", "Team", "Baseball", "Sim"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/4b2822833e96bb71b908abe64e76a7bc-98.jpg", "descriptions": "MLB® The Show 19 brings you the best of baseball. Experience the ultimate duel: the 1v1 battle between hitter and pitcher to see who reigns supreme. Whether it be home runs, quick experiences, playing as legends, a full RPG experience or stiff Player vs Player competition; MLBTS 19 providesMLB® The Show 19 brings you the best of baseball. Experience the ultimate duel: the 1v1 battle between hitter and pitcher to see who reigns supreme. Whether it be home runs, quick experiences, playing as legends, a full RPG experience or stiff Player vs Player competition; MLBTS 19 provides the perfect combination of authentic baseball experience mixed with video game fun.… Expand"}, {"name": "Tom Clancy's Ghost Recon Advanced Warfighter 2", "details_link": "https://www.metacritic.com/game/xbox-360/tom-clancys-ghost-recon-advanced-warfighter-2", "publisher": "Ubisoft", "release_date": "Mar  6 2007", "developers": ["Red Storm Entertainment", "Ubisoft Paris"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/911f4e2012e2c9615aee717e39edb8df-98.jpg", "descriptions": "Tom Clancy's Ghost Recon Advanced Warfighter 2 builds off of the events in the first game and places gamers in control of the U.S. military's elite fighting unit, the Ghosts. In the year 2014, the rising conflict between Mexican loyalists and insurgent rebel forces has thrown Mexico intoTom Clancy's Ghost Recon Advanced Warfighter 2 builds off of the events in the first game and places gamers in control of the U.S. military's elite fighting unit, the Ghosts. In the year 2014, the rising conflict between Mexican loyalists and insurgent rebel forces has thrown Mexico into full-scale civil war. Under the command of Captain Scott Mitchell, the Ghosts are called upon to face an imminent threat to the United States. The fate of two countries now lies in the hands of the Ghosts as they fend off an attack on U.S. soil. Equipped with the most cutting-edge weaponry and technology, the Ghosts must battle on both sides of the border to neutralize the escalating rebel threat. The Ghosts will battle enemies in mountain terrains, barren deserts and even on their home turf in El Paso, Texas. Each environment presents its own benefits and challenges and will call for fresh tactical approaches. Vastly Improved Artificial Intelligence (AI): Watch your back as rebels send their own team members to flank your position or gain vantage points by utilizing vertical gameplay to pick you off from the rooftops above. Improved squad-mate AI will now feed you more of the information you need with descriptive commands. The revolutionary new Cross-Com 2.0 will give the player more information than ever before. You will be able to see what your friendly forces see in the top left display and the click of a button will expand that to full-screen view for a clearer and more precise picture. Command lethal air strikes with jet fighters, gain mobile cover for otherwise impassable situations and replenish armaments on the battlefield using an unmanned artillery MULE. Players can now heal their team on the battlefield, including squad leader Scott Mitchell, with an all-new Medic class of soldier. [Ubisoft]… Expand"}, {"name": "Tales From Space: Mutant Blobs Attack", "details_link": "https://www.metacritic.com/game/playstation-vita/tales-from-space-mutant-blobs-attack", "publisher": "DrinkBox Studios", "release_date": "Feb 21 2012", "developers": ["DrinkBox Studios"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "PlayStation Vita"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/c0abb34030a70736b37d434a6cdd8170-98.jpg", "descriptions": "Tales from Space: Mutant Blobs Attack is a side-scrolling puzzle platformer about an ornery mutant blob that, after being held captive in a lab that can only be described as something out of a retro sci-fi movie from the early '50's, escapes into the world and sets out on a path to destroyTales from Space: Mutant Blobs Attack is a side-scrolling puzzle platformer about an ornery mutant blob that, after being held captive in a lab that can only be described as something out of a retro sci-fi movie from the early '50's, escapes into the world and sets out on a path to destroy and consume everything! A follow-up to last year's PlayStationÂ®Network title Tales from Space: About a Blob, Mutant Blobs Attack will contain a wide range of exciting new features and gameplay modes designed exclusively for the PlayStationÂ®Vita handheld entertainment system.… Expand"}, {"name": "Sid Meier's Civilization VI", "details_link": "https://www.metacritic.com/game/switch/sid-meiers-civilization-vi", "publisher": "2K Games", "release_date": "Nov 16 2018", "developers": ["Firaxis Games", "Aspyr"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/5aaa34faef5256387067a75572b04e80-98.jpg", "descriptions": "Civilization VI offers new ways to interact with your world, expand your empire across the map, advance your culture, and compete against historys greatest leaders to build a civilization that will stand the test of time. Play as one of 24 different leaders from various countries around theCivilization VI offers new ways to interact with your world, expand your empire across the map, advance your culture, and compete against historys greatest leaders to build a civilization that will stand the test of time. Play as one of 24 different leaders from various countries around the world and throughout history. Build an empire of lucrative trade routes with Cleopatra of Egypt, flex the military might of your legions with Trajan of Rome, or develop a powerhouse of culture with Hojo Tokimune of Japan. Each of the leaders can be played any way you prefer, with unique abilities, units, and infrastructure in their quest for victory. … Expand"}, {"name": "Max Payne 3", "details_link": "https://www.metacritic.com/game/xbox-360/max-payne-3", "publisher": "Rockstar Games", "release_date": "May 15 2012", "developers": ["Rockstar Games", "Rockstar Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/11bfd2ddaba29867cfd29060a3b9f47a-98.jpg", "descriptions": "The tragedies that took Max Payne's loved ones years ago are wounds that won't heal. No longer a police, nearly washed up and addicted to pain killers, Max takes a job in São Paulo, Brazil, protecting the family of wealthy real estate mogul Rodrigo Branco to finally escape his troubled past.The tragedies that took Max Payne's loved ones years ago are wounds that won't heal. No longer a police, nearly washed up and addicted to pain killers, Max takes a job in São Paulo, Brazil, protecting the family of wealthy real estate mogul Rodrigo Branco to finally escape his troubled past. But as events spin out of his control, Max finds himself alone on the streets of an unfamiliar city, desperately searching for the truth and fighting for a way out.… Expand"}, {"name": "Skate", "details_link": "https://www.metacritic.com/game/xbox-360/skate", "publisher": "EA Games", "release_date": "Sep 14 2007", "developers": ["EA Black Box"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "6  Online", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/380fb64a78d3353c8b6fcd85e6a6ee8a-98.jpg", "descriptions": "SKATE delivers the feel of skating through innovative controls, authentic cameras and a fully reactive skateboarding city. The game features professional skaters such as Danny Way and PJ Ladd, as well as a reactive city and relevant in-game cameras. SKATE's unique control scheme captures theSKATE delivers the feel of skating through innovative controls, authentic cameras and a fully reactive skateboarding city. The game features professional skaters such as Danny Way and PJ Ladd, as well as a reactive city and relevant in-game cameras. SKATE's unique control scheme captures the true feel of skating versus the typical button mashing gameplay of past skating games. Featuring physics-driven animations, gamers will have a unique gaming experience every time they pick up the controller since no two tricks will ever be the same. [Electronic Arts]… Expand"}, {"name": "Returnal", "details_link": "https://www.metacritic.com/game/pc/returnal", "publisher": "Sony Interactive Entertainment", "release_date": "Feb 15 2023", "developers": ["Housemarque"], "platforms": ["PlayStation 5", "PC"], "num_players": "2 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 86, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/53efe6dc9818774667dacd94a58b9a06-98.jpg", "descriptions": "After crash-landing on this shape-shifting world, Selene must search through the barren landscape of an ancient civilization for her escape. Isolated and alone, she finds herself fighting tooth and nail for survival. Again and again, she's defeated forced to restart her journey every timeAfter crash-landing on this shape-shifting world, Selene must search through the barren landscape of an ancient civilization for her escape. Isolated and alone, she finds herself fighting tooth and nail for survival. Again and again, she's defeated forced to restart her journey every time she dies.\r Through relentless roguelike gameplay, you'll discover that just as the planet changes with every cycle, so do the items at your disposal. Every loop offers new combinations, forcing you to push your boundaries and approach combat with a different strategy each time.\r Brought to life by stunning visual effects, the dark beauty of the decaying world around you is packed with explosive surprises. From high stakes, bullet hell-fuelled combat, to visceral twists and turns through stark and contrasting environments. You'll explore, discover and fight your way through an unforgiving journey, where mystery stalks your every move.… Expand"}, {"name": "Warhammer Online: Age of Reckoning", "details_link": "https://www.metacritic.com/game/pc/warhammer-online-age-of-reckoning", "publisher": "EA Games", "release_date": "Sep 16 2008", "developers": ["EA Mythic"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/a07356496d066f691759a7c71f302689-98.jpg", "descriptions": "It is a desperate time for the Emperor. A terrible Chaos Plague defiles his lands, ravaging the populace and weakening his armies. Meanwhile, the Dwarf holds in the nearby World's Edge Mountains have come under siege by a massive greenskin horde. Honor-bound by an ancient oath, the ruler ofIt is a desperate time for the Emperor. A terrible Chaos Plague defiles his lands, ravaging the populace and weakening his armies. Meanwhile, the Dwarf holds in the nearby World's Edge Mountains have come under siege by a massive greenskin horde. Honor-bound by an ancient oath, the ruler of the greatest nation of men in the Old World has dispatched several regiments to assist the embattled Dwarfs, further depleting the Empire's already thin defenses. In this dark hour, a new threat appears. Under a sky darkened by a crimson eclipse, a great warhost erupts from the wastelands of the north. Bearing the banner of Tzeentch, Changer of the Ways, the army of Chaos marches south for the borders of the Empire, crushing everything in its path. With the Dwarfs fighting desperately to slow the ferocious greenskin \"Waaagh!\", the Emperor realizes that his only hope of defeating the encroaching legions of Chaos lies with the High Elves of Ulthuan. Upon receiving the Emperor's dire plea for help, Finubar, Phoenix King of the High Elves, sets sail at the head of a mighty fleet of warships laden with battalions of High Elf warriors. [Mythic Entertainment]… Expand"}, {"name": "Resident Evil 7: biohazard", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-7-biohazard", "publisher": "Capcom", "release_date": "Jan 24 2017", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/4e6cccf0e54262c255f88dd6a94d9ae8-98.jpg", "descriptions": "While Resident Evil 7 draws from the series’ roots of atmospheric survival horror, it also delivers a new level of terror. In the Resident Evil games of yesteryear, players braced for fear in the first-person via the creepy door-opening scenes, and Resident Evil 7 ramps up that tension withWhile Resident Evil 7 draws from the series’ roots of atmospheric survival horror, it also delivers a new level of terror. In the Resident Evil games of yesteryear, players braced for fear in the first-person via the creepy door-opening scenes, and Resident Evil 7 ramps up that tension with an immersive first-person view and a photorealistic graphical style. Capcom is able to achieve a higher degree of visual fidelity thanks to the new proprietary in-house RE Engine that includes VR oriented tools. With the RE Engine plus industry leading audio and visual technologies, you experience every abhorrent detail up close and personal in Resident Evil 7. Playing the game in the PlayStation VR Mode escalates the unsettling feeling of presence to a level that horror fans have never experienced. The full gameplay experience is available in the included PlayStation VR Mode from beginning to end. No Resident Evil you’ve ever survived could prepare you for this. [Capcom]… Expand"}, {"name": "NHL 12", "details_link": "https://www.metacritic.com/game/xbox-360/nhl-12", "publisher": "Electronic Arts", "release_date": "Sep 13 2011", "developers": ["Electronic Arts"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 86, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/1c570a8403eafc6d4183d4d40c5ec1bc-98.jpg", "descriptions": "NHL 12 has players try to become the next legend in hockey."}, {"name": "Rise of the Tomb Raider", "details_link": "https://www.metacritic.com/game/xbox-one/rise-of-the-tomb-raider", "publisher": "Square Enix", "release_date": "Nov 10 2015", "developers": ["Crystal Dynamics"], "platforms": ["PC", "Stadia", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General", "Linear"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/97db5b492982c9c94fbe043fe16ac09b-98.jpg", "descriptions": "Conquer a world strenuously protecting its secrets, endure dangers conditions and unstable landscapes, face viscous wildlife that act as guardians to ancient tombs, and explore massive interactive environments. Utilize the environment to your advantage, climb trees and go underwater to avoidConquer a world strenuously protecting its secrets, endure dangers conditions and unstable landscapes, face viscous wildlife that act as guardians to ancient tombs, and explore massive interactive environments. Utilize the environment to your advantage, climb trees and go underwater to avoid or accost enemies, configure Lara's gear, weapons, and ammunition to suit your play style, dummy up explosives on the fly to wreak havoc, and wield Lara's signature combat bows and climbing axe. [Xbox.com]… Expand"}, {"name": "Dead Space (2008)", "details_link": "https://www.metacritic.com/game/pc/dead-space-2008", "publisher": "Electronic Arts", "release_date": "Oct 20 2008", "developers": ["EA Redwood Shores"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/e5607b646bccca10bbf1e435451044e6-98.jpg", "descriptions": "In the bold and often-bloody Dead Space gamers step into a third-person sci-fi survival horror experience that delivers psychological thrills and gruesome action. Set in the cold blackness of deep space, the atmosphere is soaked with a feeling of tension, dread and sheer terror. In DeadIn the bold and often-bloody Dead Space gamers step into a third-person sci-fi survival horror experience that delivers psychological thrills and gruesome action. Set in the cold blackness of deep space, the atmosphere is soaked with a feeling of tension, dread and sheer terror. In Dead Space, players step into the role of engineer Isaac Clarke – an ordinary man on a seemingly routine mission to fix the communications systems aboard a deep space mining ship. It is not long before Isaac awakes to a living nightmare when he learns that the ship's crew has been ravaged by a vicious alien infestation. He must fight through the dead silence and darkness of deep space to stay alive. [Electronic Arts]… Expand"}, {"name": "Mario + Rabbids Sparks of Hope", "details_link": "https://www.metacritic.com/game/switch/mario-+-rabbids-sparks-of-hope", "publisher": "Ubisoft", "release_date": "Oct 20 2022", "developers": ["Ubisoft Paris", "Ubisoft Milan"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/f78d45d23003488223a9ed06c1bcb05b-98.jpg", "descriptions": "Team up with Mario, Luigi, Princess Peach, Rabbid Peach, Rabbid Luigi, and their friends on a galactic journey to defeat a malevolent entity and save your Spark companions. Explore planets throughout the galaxy as you uncover mysterious secrets and compelling quests! * Build your dream teamTeam up with Mario, Luigi, Princess Peach, Rabbid Peach, Rabbid Luigi, and their friends on a galactic journey to defeat a malevolent entity and save your Spark companions. Explore planets throughout the galaxy as you uncover mysterious secrets and compelling quests! * Build your dream team with three heroes from an eclectic roster of nine. * Take down all new bosses, along with some familiar enemies throughout the galaxy. \r* Rescue the adorable Sparks throughout the galaxy, who provide distinct powers that will help you in battle. \r* Unleash your heroes' skills but be strategic as you dash your enemies, team jump on your allies, and hide behind covers.… Expand"}, {"name": "PlayerUnknown's Battlegrounds", "details_link": "https://www.metacritic.com/game/pc/playerunknowns-battlegrounds", "publisher": "Bluehole, Inc.", "release_date": "Dec 20 2017", "developers": ["Bluehole", "Inc.", "PUBG Corporation"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 86, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/0/4a7625374651193db62dd1b8c40efdc5-98.jpg", "descriptions": "PLAYERUNKNOWN'S BATTLEGROUNDS is a last-man-standing shooter being developed with community feedback. Players must fight to locate weapons and supplies in a massive 8x8 km island to be the lone survivor. This is BATTLE ROYALE."}, {"name": "Advance Wars: Days of Ruin", "details_link": "https://www.metacritic.com/game/ds/advance-wars-days-of-ruin", "publisher": "Nintendo", "release_date": "Jan 21 2008", "developers": ["Intelligent Systems"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Modern", "Modern", "Tactics"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/61efa6c8674ebf4b0a40409c7b02a32b-98.jpg", "descriptions": "(Also known as \"Advance Wars: Dark Conflict\" in the UK/EU)  After a cataclysmic meteor strike exterminates 90% of the population, the survivors must battle barbarians, disease, and strongmen who seek only to secure their own power. Advance Wars has been reinvented. Set amidst a world in(Also known as \"Advance Wars: Dark Conflict\" in the UK/EU)  After a cataclysmic meteor strike exterminates 90% of the population, the survivors must battle barbarians, disease, and strongmen who seek only to secure their own power. Advance Wars has been reinvented. Set amidst a world in chaos and featuring new characters and settings, a gritty look, an engaging storyline, and online Wi-Fi battles and map trading. Try you hand with new COs and units, realistic graphics, and a new environment. Use Nintendo WiFi Connection and battle against a friend halfway across the world, or use the map editor to create, trade and battle on your own custom maps. [Nintendo]… Expand"}, {"name": "The Elder Scrolls IV - Knights of the Nine", "details_link": "https://www.metacritic.com/game/xbox-360/the-elder-scrolls-iv---knights-of-the-nine", "publisher": "Bethesda Softworks", "release_date": "Nov 21 2006", "developers": ["Bethesda Softworks"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/fad742445f2d23229f3e7c0fe90f16e2-98.jpg", "descriptions": "Knights of the Nine is a compilation that includes all the other Oblivion downloadable content released to date: Horse Armor, The Orrery, Wizard’s Tower, Vile Lair, Thieves Den, Mehrunes' Razor, and Spell Tomes. Knights of the Nine features an all-new faction and quests for noble charactersKnights of the Nine is a compilation that includes all the other Oblivion downloadable content released to date: Horse Armor, The Orrery, Wizard’s Tower, Vile Lair, Thieves Den, Mehrunes' Razor, and Spell Tomes. Knights of the Nine features an all-new faction and quests for noble characters and answers many of the questions surrounding the Ayleid ruins found throughout Oblivion. Players can join a new faction and found their own order of holy knights – leading them into battle against a sorcerer-king and his demonic minions while exploring massive dungeons and searching for legendary relics – the holy armor and weapons of the Divine Crusader. [Bethesda Softworks]… Expand"}, {"name": "Thumper", "details_link": "https://www.metacritic.com/game/pc/thumper", "publisher": "drool Games", "release_date": "Oct 10 2016", "developers": ["drool Games", "Drool"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 86, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/6abf9b2ea31b2ed36aead9d881982511-98.jpg", "descriptions": "Thumper is a rhythm violence game. It combines classic rhythm-action with breakneck speed and brutal physicality."}, {"name": "Rocksmith 2014 Edition", "details_link": "https://www.metacritic.com/game/playstation-3/rocksmith-2014-edition", "publisher": "Ubisoft", "release_date": "Oct 22 2013", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/67427b7ebe675e0ca213c5293f20dc01-98.jpg", "descriptions": "Rocksmith 2014 Edition lets players plug in any electric guitar or bass directly into your system and begin learning guitar with the Rocksmith Method."}, {"name": "Bionic Commando: Rearmed", "details_link": "https://www.metacritic.com/game/pc/bionic-commando-rearmed", "publisher": "Capcom", "release_date": "Aug 13 2008", "developers": ["GRIN"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 86, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/3d3f47421570079c92bbba6f40885c4d-98.jpg", "descriptions": "Bionic Commando Rearmed sees a return of the intense 2D side-scrolling, shooting, and grappling action from the much-loved 1988 Bionic Commando on the Nintendo Entertainment System. Bionic Commando Rearmed brings the amazing gameplay up to date with new visuals, new weapons, online rankings,Bionic Commando Rearmed sees a return of the intense 2D side-scrolling, shooting, and grappling action from the much-loved 1988 Bionic Commando on the Nintendo Entertainment System. Bionic Commando Rearmed brings the amazing gameplay up to date with new visuals, new weapons, online rankings, a reworked musical score, and the addition of a two-player co-op mode. Local multiplayer mode for up to four players. Total modern visual revamp, including dynamic shadows, particle effects, and environmental damage. Reworking of musical score. Cross-game interoperability - complete specific parts of Bionic Commando Rearmed to unlock new content and hints for the Bionic Commando sequel. In-game art designed by one of Capcom's most talented artists, Toshiaki Mori. [Capcom]… Expand"}, {"name": "DJ Hero", "details_link": "https://www.metacritic.com/game/playstation-3/dj-hero", "publisher": "Activision", "release_date": "Oct 27 2009", "developers": ["FreeStyleGames"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/790fcd49fce71f4a2f39777fe9eec05d-98.jpg", "descriptions": "DJ Hero drops the needle with a completely fresh experience and legendary artists including Black Eyed Peas, 50 Cent, Justice, Marvin Gaye, Beck, Beastie Boys and N.E.R.D. DJ Hero features more than 100 individual songs that have been transformed into more than 80 exclusive, original mixesDJ Hero drops the needle with a completely fresh experience and legendary artists including Black Eyed Peas, 50 Cent, Justice, Marvin Gaye, Beck, Beastie Boys and N.E.R.D. DJ Hero features more than 100 individual songs that have been transformed into more than 80 exclusive, original mixes by superstar DJs including DJ Shadow, DJ Z-Trip, DJ AM, and the legendary Grandmaster Flash. With an innovative, new turntable controller and the hottest music collection of original music, DJ Hero is a unique new social music gaming experience that excite the millions of dance club music fans who can now play along to hit songs from a range of genres including hip-hop, R&B, pop, rock and electronica allowing them to rule the party with original mixes. Joining the internationally acclaimed DJ, producer and recording artist DJ Shadow, who has been consulting and contributed several mixes for DJ Hero, and making their video game debuts, DJ Z-Trip, a founder of the mashup movement who’s known worldwide for his sold out shows and eclectic style, and DJ AM, one of the world’s premier and most in-demand DJs today, appear as in-game characters and have each created multiple exclusive mixes for DJ Hero. In DJ Hero, faces in the crowd are transformed into the life of the party as the game’s turntable controller - created exclusively for DJ Hero and featuring familiar DJ tools including a fully-rotating turntable, sample buttons, effects dial and cross fader - immerses fans into the authenticity of DJ culture and a sea of music. By utilizing and mastering various DJ techniques including scratching, blending, cross fading and sampling, while leaving room for creative expression with a variety of effects and player chosen samples and scratches, gamers rule the party performing music as only a DJ can. Social expression is heightened with euphoric multiplayer gameplay where two DJs can battle competitively or have a player join in to emcee over any track in the game with a mic. Additionally, gamers can rock together as DJ Hero features DJ-guitar exclusive mixes played with a turntable controller and Guitar Hero guitar controller. [Activision]… Expand"}, {"name": "Forza Horizon 2", "details_link": "https://www.metacritic.com/game/xbox-one/forza-horizon-2", "publisher": "Microsoft Game Studios", "release_date": "Sep 30 2014", "developers": ["Playground Games"], "platforms": ["Xbox 360", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "Automobile"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/f51887518c128c7455aa452a4606c65b-98.jpg", "descriptions": "Race through a wide-open world featuring dramatic weather and day to night cycles. Connect with friends in this celebration of speed, style, and action-packed driving. Explore exotic locations in more than 200 of the world’s greatest cars."}, {"name": "Monster Train", "details_link": "https://www.metacritic.com/game/pc/monster-train", "publisher": "Good Shepherd Entertainment", "release_date": "May 21 2020", "developers": ["Shiny Shoe"], "platforms": ["iPhone/iPad", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/35d08f947c46bcd3e4b1392ea88f9579-98.jpg", "descriptions": "Monster Train is a strategic roguelike deck building game with a twist. Set on a train to hell, you’ll use tactical decision making to defend multiple vertical battlegrounds. With real time competitive multiplayer and endless replayability, Monster Train is always on time."}, {"name": "FIFA 14", "details_link": "https://www.metacritic.com/game/playstation-3/fifa-14", "publisher": "EA Sports", "release_date": "Sep 24 2013", "developers": ["EA Canada"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 22 ", "genres": ["Ice Hockey", "Sim", "Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 86, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/488075bc9d79a00409a1c1bac2331b46-98.jpg", "descriptions": "Pure Shot promises to let FIFA fans feel what it is like to connect with the perfect strike while a brand new ball physics system called Real Ball Physics ensures the trajectory of the ball behaves as it would in real life. With Teammate Intelligence in FIFA 14, players have betterPure Shot promises to let FIFA fans feel what it is like to connect with the perfect strike while a brand new ball physics system called Real Ball Physics ensures the trajectory of the ball behaves as it would in real life. With Teammate Intelligence in FIFA 14, players have better decision-making and teams play smarter on both the attack and defense to bring the beauty of the game to life. … Expand"}, {"name": "Crypt of the NecroDancer: Nintendo Switch Edition", "details_link": "https://www.metacritic.com/game/switch/crypt-of-the-necrodancer-nintendo-switch-edition", "publisher": "Spike Chunsoft", "release_date": "Feb  1 2018", "developers": ["Brace Yourself Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Rhythm", "General", "Action RPG", "Music"], "meta_score": 86, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/a07cfd361ede14736d309fcfd1ec32d7-98.jpg", "descriptions": "Crypt of the NecroDancer is a hardcore rhythm-based roguelike game. Can you survive this deadly dungeon of dance, slay the NecroDancer, and recapture your still beating heart? Or will you be a slave to the rhythm for all eternity? Players must move on the beat to navigate procedurallyCrypt of the NecroDancer is a hardcore rhythm-based roguelike game. Can you survive this deadly dungeon of dance, slay the NecroDancer, and recapture your still beating heart? Or will you be a slave to the rhythm for all eternity? Players must move on the beat to navigate procedurally generated dungeons while battling dancing skeletons, zombies, dragons, and more! Groove with the game's epic dance soundtrack, or select songs from your own MP3 collection! You can even play with a dance pad to really shake your bones!… Expand"}, {"name": "Observer", "details_link": "https://www.metacritic.com/game/xbox-one/observer", "publisher": "Aspyr", "release_date": "Aug 15 2017", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/3b03662f60aa97e4959c570523e634a0-98.jpg", "descriptions": "What would you do if your fears were hacked? The year is 2084. You are Daniel Lazarski, an elite neural detective known as an Observer, whose purpose is to hack and invade suspects’ minds. To gather evidence, you must relive their darkest fears, and, finally, face your own. From BlooberWhat would you do if your fears were hacked? The year is 2084. You are Daniel Lazarski, an elite neural detective known as an Observer, whose purpose is to hack and invade suspects’ minds. To gather evidence, you must relive their darkest fears, and, finally, face your own. From Bloober Team, the creators of Layers of Fear, >observer_ is a cyberpunk horror game designed to disturb you.… Expand"}, {"name": "ZEN Pinball 2", "details_link": "https://www.metacritic.com/game/playstation-3/zen-pinball-2", "publisher": "Zen Studios", "release_date": "Sep  4 2012", "developers": ["Zen Studios"], "platforms": ["PlayStation 4", "PlayStation Vita", "Wii U", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/1938ecbe381fb3a6934df4a6c47212ac-98.jpg", "descriptions": "Zen Pinball 2 is full of exciting Wii U GamePad features such as controlling the plunger on the touch screen, rotating camera views, accessing information via the dot matrix, and Free View control by tilting the Wii U GamePad. Additional features include:\r- Unprecedented table visuals andZen Pinball 2 is full of exciting Wii U GamePad features such as controlling the plunger on the touch screen, rotating camera views, accessing information via the dot matrix, and Free View control by tilting the Wii U GamePad. Additional features include:\r- Unprecedented table visuals and the most advanced ball physics on Wii U\r- Trial version for all tables, try them out before you buy!\r- Local Hotseat multiplayer, and fast paced Split-screen multiplayer game modes\r- Action cameras to guide and emphasize spectacular moments\r- Ranking support for all tables, National Ranking, and Worldwide tournaments\r- Continue playing on the Wii U GamePad if the TV is occupied!\r- Robust social features with Challenges, Pro Score, and Team Score. Its up to you to become the Pinball Champion!\r- Awards for each table\r- Regular table releases through the Nintendo eShop… Expand"}, {"name": "Moto Racer Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/moto-racer-advance", "publisher": "Ubisoft", "release_date": "Dec  5 2002", "developers": ["Delphine Software International"], "platforms": "Game Boy Advance", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 86, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/c7a2c34a6917633d4a9bd59329c972a5-98.jpg", "descriptions": null}, {"name": "Command & Conquer: Red Alert 2 - Yuri's Revenge", "details_link": "https://www.metacritic.com/game/pc/command-conquer-red-alert-2---yuris-revenge", "publisher": "Electronic Arts", "release_date": "Oct 10 2001", "developers": ["Westwood Studios"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "Command"], "meta_score": 86, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/0/81afdb2ef323533145e189221f39a7ed-98.jpg", "descriptions": "This Red Alert 2 Expansion Pack finds Yuri ready for world domination in a post-peace treaty, free world. Refining his mind-control technologies, he's created an army of terrors, from mind-controlling tanks to long-range psychics, whose brains are their biggest weapons.  Play as Allies orThis Red Alert 2 Expansion Pack finds Yuri ready for world domination in a post-peace treaty, free world. Refining his mind-control technologies, he's created an army of terrors, from mind-controlling tanks to long-range psychics, whose brains are their biggest weapons.  Play as Allies or Soviets, and take on Yuri in Hollywood, Egypt -- even the moon -- in 14 new solo campaign missions. [Westwood Studios]… Expand"}, {"name": "Europa Universalis", "details_link": "https://www.metacritic.com/game/pc/europa-universalis", "publisher": "Strategy First", "release_date": "Feb  2 2001", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "General", "General"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/057edbd721517dc14779f3a97e01620c-98.jpg", "descriptions": "In a time of hunger for power, honor, and wealth, it is your destiny to rule your country, accept new challenges, mobilize troops, build cities, and exploit your resources. The skilled will gain wealth; the less fortunate can expect poverty and disease. Do you have what it takes to changeIn a time of hunger for power, honor, and wealth, it is your destiny to rule your country, accept new challenges, mobilize troops, build cities, and exploit your resources. The skilled will gain wealth; the less fortunate can expect poverty and disease. Do you have what it takes to change the course of history?  [Strategy First]… Expand"}, {"name": "Escape from Monkey Island", "details_link": "https://www.metacritic.com/game/pc/escape-from-monkey-island", "publisher": "LucasArts", "release_date": "Nov  8 2000", "developers": ["LucasArts"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/05ade681b14688bec2e503294dd466a7-98.jpg", "descriptions": "A scurvy-inducing new chapter in the legendary Monkey Island adventure series unfolds in rollicking 3-D. Developed by the team who created LucasArts' irreverent classic \"Sam & Max Hit The Road,\" Escape features an original cinematic story full of drama, intrigue, and, of course,A scurvy-inducing new chapter in the legendary Monkey Island adventure series unfolds in rollicking 3-D. Developed by the team who created LucasArts' irreverent classic \"Sam & Max Hit The Road,\" Escape features an original cinematic story full of drama, intrigue, and, of course, side-splitting humor. [LucasArts]… Expand"}, {"name": "Beat Saber", "details_link": "https://www.metacritic.com/game/playstation-4/beat-saber", "publisher": "Hyperbolic Magnetism", "release_date": "Nov 20 2018", "developers": ["Hyperbolic Magnetism"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "General", "Music"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/ec0cf8910425d6f8c802fa63533cc619-98.jpg", "descriptions": "Enjoy precisely handcrafted levels and exclusively created electronic dance music, all embedded in an appealing futuristic world. Swing your sabers, match the color and the right direction to slash the cubes, and keep up with the adrenaline-pumping music…"}, {"name": "SteamWorld Heist", "details_link": "https://www.metacritic.com/game/3ds/steamworld-heist", "publisher": "Image & Form", "release_date": "Dec 10 2015", "developers": ["Image & Form"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Wii U", "3DS"], "genres": ["Sci-Fi", "Strategy", "Turn-Based", "General"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/39f83fcce329a29604a13cce606f9d0e-98.jpg", "descriptions": "A game featuring space adventures and strategic shoot-outs. Assume the role of Captain Piper and recruit a team of rag-tag robots to explore and scavenge the remains of a destroyed world. Board enemy spaceships and command your crew in a unique variety of turn-based combat, where the outcomeA game featuring space adventures and strategic shoot-outs. Assume the role of Captain Piper and recruit a team of rag-tag robots to explore and scavenge the remains of a destroyed world. Board enemy spaceships and command your crew in a unique variety of turn-based combat, where the outcome is determined purely by your own skills.… Expand"}, {"name": "The Case of the Golden Idol", "details_link": "https://www.metacritic.com/game/pc/the-case-of-the-golden-idol", "publisher": "Playstack", "release_date": "Oct 13 2022", "developers": ["Color Gray Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/425b33c057fee26690f5c38fce5f0f21-98.jpg", "descriptions": "The Case of the Golden Idol is a wryly amusing detective game set in the 18th century, brought to life with striking hand-drawn artwork. The game tests your ability to piece together clues and reconstruct the events leading up to some mysterious deaths.Investigate a series of mysteriousThe Case of the Golden Idol is a wryly amusing detective game set in the 18th century, brought to life with striking hand-drawn artwork. The game tests your ability to piece together clues and reconstruct the events leading up to some mysterious deaths.Investigate a series of mysterious deaths. Explore hand-drawn locations set in the 18th century, where some mysterious deaths have taken place.Reconstruct the events with a unique drag-and-drop mechanic. Gather verbal evidence and visual clues, then apply your deduction skills to figure out what actually happened and how each victim died.Explore a greater mystery that spans centuries. Start revealing a larger overarching story that connects all the individual tales.… Expand"}, {"name": "IL-2 Sturmovik: 1946", "details_link": "https://www.metacritic.com/game/pc/il-2-sturmovik-1946", "publisher": "Ubisoft", "release_date": "Mar 13 2007", "developers": ["1C: Maddox Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/c2fcf8544805d29c9ce278bdf1c69cdf-98.jpg", "descriptions": "Oleg Maddox's Il-2 Sturmovik series of flight simulators continues to expand. The latest offering, Il-2 1946, adds 36 new planes, four new gigantic maps, over a hundred new ground objects, and nearly 200 new campaign missions. This new opus also includes all of the previous Il-2 seriesOleg Maddox's Il-2 Sturmovik series of flight simulators continues to expand. The latest offering, Il-2 1946, adds 36 new planes, four new gigantic maps, over a hundred new ground objects, and nearly 200 new campaign missions. This new opus also includes all of the previous Il-2 series content. What began as a one-aircraft study sim is now an astonishing anthology, with a whopping 229 flyable aircraft and over 300 aircraft total! Not to mention that players will have the opportunity to get a first glance at the future of the series arriving next year: Storm of War Battle of Britain via exclusive bonus videos.… Expand"}, {"name": "XCOM: Enemy Within", "details_link": "https://www.metacritic.com/game/pc/xcom-enemy-within", "publisher": "2K Games", "release_date": "Nov 11 2013", "developers": ["Firaxis Games"], "platforms": "PC", "num_players": "2 ", "genres": ["Sci-Fi", "Strategy", "Turn-Based", "Sci-Fi", "General", "Tactics"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/2cded4b892c847115977979d91904b6f-98.jpg", "descriptions": "XCOM: Enemy Within is the expansion to the 2012 strategy game XCOM: Enemy Unknown.  Enemy Within adds an array of new abilities, upgrades and weapons to combat new enemy and alien threats. This expansion pack also introduces new maps, new tactical and strategic gameplay, and new multiplayerXCOM: Enemy Within is the expansion to the 2012 strategy game XCOM: Enemy Unknown.  Enemy Within adds an array of new abilities, upgrades and weapons to combat new enemy and alien threats. This expansion pack also introduces new maps, new tactical and strategic gameplay, and new multiplayer content providing a renewed gameplay experience.… Expand"}, {"name": "Atelier Ryza 3: Alchemist of the End & the Secret Key", "details_link": "https://www.metacritic.com/game/pc/atelier-ryza-3-alchemist-of-the-end-the-secret-key", "publisher": "Koei Tecmo Games", "release_date": "Mar 24 2023", "developers": ["Gust"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/5d1a99be8b327c14a3e70a0d84835dee-98.jpg", "descriptions": "Ryza and her friends are living their lives on Kurken Island when news of a sudden appearance of a mysterious group of islands in nearby waters arrives.\r To find a way to save her island, Ryza and her friends will set off on final adventure surrounding the \"roots of alchemy.\"\r\n\r\nReuniteRyza and her friends are living their lives on Kurken Island when news of a sudden appearance of a mysterious group of islands in nearby waters arrives.\r To find a way to save her island, Ryza and her friends will set off on final adventure surrounding the \"roots of alchemy.\"\r Reunite with characters from previous games, and meet new characters who will be key to the story. Mix and match your favorite members and enjoy the adventure!… Expand"}, {"name": "Wildermyth", "details_link": "https://www.metacritic.com/game/pc/wildermyth", "publisher": "Worldwalker Games", "release_date": "Jun 15 2021", "developers": ["Worldwalker Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/b31920909c2817cfa680cd90683b284a-98.jpg", "descriptions": "We call Wildermyth a myth-making tactical RPG. It empowers you to craft iconic characters who grow through deep, rewarding battles and interactive storytelling."}, {"name": "Cuphead", "details_link": "https://www.metacritic.com/game/playstation-4/cuphead", "publisher": "Studio MDHR", "release_date": "Jul 28 2020", "developers": ["Studio MDHR"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/fb4785de654eec1caa168baafa45c1b3-98.jpg", "descriptions": "Cuphead is a classic run and gun action game heavily focused on boss battles. Inspired by cartoons of the 1930s, the visuals and audio are painstakingly created with the same techniques of the era, i.e. traditional hand drawn cel animation, watercolor backgrounds, and original jazzCuphead is a classic run and gun action game heavily focused on boss battles. Inspired by cartoons of the 1930s, the visuals and audio are painstakingly created with the same techniques of the era, i.e. traditional hand drawn cel animation, watercolor backgrounds, and original jazz recordings.\rPlay as Cuphead or Mugman (in single player or local co-op) as you traverse strange worlds, acquire new weapons, learn powerful super moves, and discover hidden secrets while you try and pay your debt back to the devil!… Expand"}, {"name": "Warframe", "details_link": "https://www.metacritic.com/game/switch/warframe", "publisher": "Digital Extremes", "release_date": "Nov 20 2018", "developers": ["Digital Extremes"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/b61df101341abcd6198d3679f09af6cf-98.jpg", "descriptions": "They were called Tenno. Warriors of blade and gun: masters of the Warframe armor. Those that survived the old war were left drifting among the ruins. Now they are needed once more. The Grineer, with their vast armies, are spreading throughout the solar system. A call echoes across the starsThey were called Tenno. Warriors of blade and gun: masters of the Warframe armor. Those that survived the old war were left drifting among the ruins. Now they are needed once more. The Grineer, with their vast armies, are spreading throughout the solar system. A call echoes across the stars summoning the Tenno to an ancient place. They summon you. Allow the Lotus to guide you. She has rescued you from your cryostasis chamber and given you a chance to survive. The Grineer will find you; you must be prepared. The Lotus will teach you the ways of the Warframes and the secrets to unlocking their powers. Come Tenno, you must join the war.… Expand"}, {"name": "Final Fantasy XIV: Heavensward", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-xiv-heavensward", "publisher": "Square Enix", "release_date": "Jun 23 2015", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "num_players": "Massively Multiplayer", "genres": ["Massively Multiplayer Online", "Fantasy", "Role-Playing", "Massively Multiplayer"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/197b9beb561a988b20cd03ae0bdde375-98.jpg", "descriptions": "The to-this-point sealed gates to Ishgard open to the citizens of Eorzea as the Dragonsong War deteriorates. This bloody thousand-year skirmish between the dragoons of Ishgard and the sentient dragons of Dravania invites the support of new adventurers to bring to a halt to the conflict.The to-this-point sealed gates to Ishgard open to the citizens of Eorzea as the Dragonsong War deteriorates. This bloody thousand-year skirmish between the dragoons of Ishgard and the sentient dragons of Dravania invites the support of new adventurers to bring to a halt to the conflict. Heavensward expands the playable area of the game into additional areas of Eorzea, beyond the Coerthas Central Highlands and in to the skies above the Sea of Clouds and the floating landmasses therein. … Expand"}, {"name": "Bayonetta", "details_link": "https://www.metacritic.com/game/wii-u/bayonetta", "publisher": "Nintendo", "release_date": "Oct 24 2014", "developers": ["Bee Tribe"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Fantasy", "Beat-'Em-Up", "Action Adventure", "Linear"], "meta_score": 86, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/56a9e34d5552bbb114556c60a11ceeb5-98.jpg", "descriptions": "Bayonetta is a cinematic and stylish action game from the creative mind of Hideki Kamiya. As a gun-wielding witch with powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless enemies in a game of 100% pure all-out action. Outlandish finishing moves areBayonetta is a cinematic and stylish action game from the creative mind of Hideki Kamiya. As a gun-wielding witch with powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless enemies in a game of 100% pure all-out action. Outlandish finishing moves are performed with acrobatic grace as Bayonetta flows from one fight to another. Bayonetta pushes the limits of the action genre with magnificent over-the-top action and fast-paced, dynamic climax combat.… Expand"}, {"name": "Luigi's Mansion 3", "details_link": "https://www.metacritic.com/game/switch/luigis-mansion-3", "publisher": "Nintendo", "release_date": "Oct 31 2019", "developers": ["Next Level Games", "Nintendo"], "platforms": "Switch", "num_players": "Up to 8 ", "genres": ["Action Adventure", "General"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/ca97c87d3945aae2a8b7ddb2742b0639-98.jpg", "descriptions": "Luigi embarks on a dream vacation with Mario and friends upon receiving an invitation to a luxurious hotel. However, his dream quickly becomes a nightmare when King Boo reveals everything had been a ploy to capture Mario and friends. With the assistance of Professor E. Gadd once again, theLuigi embarks on a dream vacation with Mario and friends upon receiving an invitation to a luxurious hotel. However, his dream quickly becomes a nightmare when King Boo reveals everything had been a ploy to capture Mario and friends. With the assistance of Professor E. Gadd once again, the reluctant and cowardly hero Luigi traverses up and down treacherous floors of the now-ominous hotel on a quest to save them. Wield the upgraded Poltergust G-00 to slam and blow away the ghosts’ defenses, or summon Gooigi, an all-green doppelganger that can help Luigi overcome obstacles he can’t get past alone. Interchange between Luigi and Gooigi as one player, or grab a friend and control one each. For more frenetic multiplayer action, race the timer to clear various objectives on a series of floors in ScareScraper mode. ScareScraper mode can be played online* or locally with up to eight players on four Nintendo Switch systems (additional games required; sold separately).… Expand"}, {"name": "Dance Central 3", "details_link": "https://www.metacritic.com/game/xbox-360/dance-central-3", "publisher": "Microsoft Game Studios", "release_date": "Oct 16 2012", "developers": ["Harmonix Music Systems"], "platforms": "Xbox 360", "genres": ["Dancing", "Action", "Miscellaneous", "Rhythm", "Dancing"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/d3d5ae6ba95ea2769d7247df45fc156a-98.jpg", "descriptions": "Includes a soundtrack featuring forty plus new tracks, from the disco hits of the seventies to current top 40 dance hits."}, {"name": "Shatter", "details_link": "https://www.metacritic.com/game/playstation-3/shatter", "publisher": "Sidhe Interactive", "release_date": "Jul 23 2009", "developers": ["Sidhe Interactive"], "platforms": ["PC", "PlayStation 3"], "genres": ["Action", "General", "General", "Arcade"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/7efd585f1ffe13dddb573fe6b6e61a8e-98.jpg", "descriptions": "[Playstation Network]  Shatter reminds players of classic brick-breaking games, but with twists that make it modern and unique including: Innovative controls, physics effects, power-ups, special attacks, and boss battles which combine to provide an experience that is always interactive.[Playstation Network]  Shatter reminds players of classic brick-breaking games, but with twists that make it modern and unique including: Innovative controls, physics effects, power-ups, special attacks, and boss battles which combine to provide an experience that is always interactive. Standard, Boss Rush and Bonus game modes enhanced with leaderboards and trophies. Vibrant 3D style presented across 10 distinct worlds in 4xAA 60fps HD. A fully scored soundtrack featuring more than 90 minutes of rich original music. [Sidhe]… Expand"}, {"name": "Final Fantasy XIV Online: A Realm Reborn", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-xiv-online-a-realm-reborn", "publisher": "Square Enix", "release_date": "Apr 14 2014", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 3", "PlayStation 5", "PlayStation 4"], "num_players": "Up to 64 ", "genres": ["Fantasy", "Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/c6aa607fc2d4de95df35b221e7a1207b-98.jpg", "descriptions": "Take part in an ever-changing FINAL FANTASY as you adventure and explore with friends from around the world. Experience all the hallmarks of the franchise - airships, chocobos, moogles, and more."}]