[{"name": "X: Beyond the Frontier", "details_link": "https://www.metacritic.com/game/pc/x-beyond-the-frontier", "publisher": "THQ", "release_date": "Jan 26 2000", "developers": ["Egosoft"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Combat"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/cf4e79066ac21e62a0ad915782c1bae3-98.jpg", "descriptions": "Take a trip to the farthest reaches of space in this real-time simulation. You're the pilot of an experimental aircraft that falls into an unknown sector of the universe. Your objective is to get home alive, but that won't be any small task as tons of enemies and obstacles will try to slowTake a trip to the farthest reaches of space in this real-time simulation. You're the pilot of an experimental aircraft that falls into an unknown sector of the universe. Your objective is to get home alive, but that won't be any small task as tons of enemies and obstacles will try to slow your progress throughout the adventure. The game boasts more than 150 fully operational aircraft, six interactive civilizations, in excess of 10,000 objects to use, and thousands of hours of gameplay. Fighting, trading, and solving puzzles are all part of the territory in this massive gaming experience.… Expand"}, {"name": "The LEGO NINJAGO Movie Video Game", "details_link": "https://www.metacritic.com/game/playstation-4/the-lego-ninjago-movie-video-game", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 22 2017", "developers": ["TT Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 67, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/8dcc7e221999bb1a450a5db464722027-98.jpg", "descriptions": "Find your inner ninja with the Lego Ninjago Movie Video Game. Play as your favorite ninjas to defend Ninjago from the evil Lord Garmadon."}, {"name": "Technic Beat", "details_link": "https://www.metacritic.com/game/playstation-2/technic-beat", "publisher": "Mastiff", "release_date": "Nov  2 2004", "developers": ["Arika"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/2c778a1b4b0ae38edbf7909f24dc1137-98.jpg", "descriptions": "Technic Beat allows players to actually create, alter and dance on screen to their own music. The game features tunes from some of Namco's most popular games. In Technic Beat, players listen to music represented in the game by radiating concentric rings of sound. Picking up the beat, theyTechnic Beat allows players to actually create, alter and dance on screen to their own music. The game features tunes from some of Namco's most popular games. In Technic Beat, players listen to music represented in the game by radiating concentric rings of sound. Picking up the beat, they dance into the middle of the rings and try to \"catch\" the music. If successful, they achieve the power to manipulate the sound rings and create entirely new music. As players progress and gain skill they are rewarded with spectacular visual displays, bonuses, and power ups. Technic Beat features include: Arcade mode ? use the Tension Meter to measure your performance. Push it up and you're on to the next round! Free mode ? choose the songs you want to play. Save and replay your performances, and control the camera and music. Challenge mode ? choose the difficulty level and let the game pick your test! Sudden death ? Can you play all the songs in order without a single mistake? Supports one or two players playing cooperatively or competitively. [Mastiff]… Expand"}, {"name": "Life is Strange: Arcadia Bay Collection", "details_link": "https://www.metacritic.com/game/switch/life-is-strange-arcadia-bay-collection", "publisher": "Square Enix", "release_date": "Sep 27 2022", "developers": ["DONTNOD Entertainment"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 67, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/2cb6b455db33e82d46b51e185451d06c-98.jpg", "descriptions": "The collection contains Life is Strange and Life is Strange: Before the Storm. These two narrative adventures both set in the small town of Arcadia Bay (hence the name of the collection) and are renowned for their emotional stories, unforgettable characters, impeccably curated soundtracks,The collection contains Life is Strange and Life is Strange: Before the Storm. These two narrative adventures both set in the small town of Arcadia Bay (hence the name of the collection) and are renowned for their emotional stories, unforgettable characters, impeccably curated soundtracks, and compelling choice-based gameplay. … Expand"}, {"name": "UFO: Aftershock", "details_link": "https://www.metacritic.com/game/pc/ufo-aftershock", "publisher": "Cenega Publishing", "release_date": "Nov 23 2005", "developers": ["Altar Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/98ba3e78eda8072abf9140ebe6968baa-98.jpg", "descriptions": "The sequel to UFO: Aftermath - Global strategy and small scale tactical missions intertwined...The year is 2054. Fifty years ago, something terrible happened and the surface of Earth became uninhabitable. The remnants of humankind escaped to an immense flying island, the Laputa. However aThe sequel to UFO: Aftermath - Global strategy and small scale tactical missions intertwined...The year is 2054. Fifty years ago, something terrible happened and the surface of Earth became uninhabitable. The remnants of humankind escaped to an immense flying island, the Laputa. However a revolt against increasingly rigid and corrupt human leadership of the island escalated into a conflict that eventually destroyed it. The survivors of the survivors flee once again. Can they reclaim the Earth from the unknown forces now holding her in their grasp? The game features new amazing technologies and items to be researched and developed, new enemies and allies, resource and base management in the strategic game, and improved SAS and RPG systems in the tactical game. [Cenega Publishing]… Expand"}, {"name": "INDUSTRIA", "details_link": "https://www.metacritic.com/game/pc/industria", "publisher": "Headup Games", "release_date": "Sep 30 2021", "developers": ["Bleakmill"], "platforms": ["PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 67, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/a0e6931c58adf6f2c549c9305f07ff6e-98.jpg", "descriptions": "Berlin, 9th November 1989: The streets are full of people. After four decades of division, thousands of cars are rolling across the inner-German border. The Wall is finally open!At the same time a man disappears in a secret research facility near East Berlin. His goodbye message reachesBerlin, 9th November 1989: The streets are full of people. After four decades of division, thousands of cars are rolling across the inner-German border. The Wall is finally open!At the same time a man disappears in a secret research facility near East Berlin. His goodbye message reaches you too late. You drive back to the office, where the State Security has already destroyed all records of the research project. The complex is deserted and empty.The search for Walter takes you deep into the center of the facility - right into the heart of the universe, where time seems to stand still. The dark secret lurks - well hidden - behind the curtain. In the end, it is horrible insights and the questions of responsibility that make you dive deeper and deeper into a strange, surreal yet familiar world.… Expand"}, {"name": "NASCAR '14", "details_link": "https://www.metacritic.com/game/playstation-3/nascar-14", "publisher": "Deep Silver", "release_date": "Feb 18 2014", "developers": ["Eutechnyx"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["GT / Street", "Driving", "Racing", "Simulation", "GT / Street", "Stock Car", "Automobile"], "meta_score": 67, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/8/2307edc69f7f4de59c11bfe05d11b75e-98.jpg", "descriptions": "Grab the wheel from your favorite driver and engage in the race week experience from practice, to qualifying, to race day challenges. With your favorite personalities and live replay, NASCAR '14 promises to be the authentic NASCAR experience for fans."}, {"name": "Railworks 3: Train Simulator 2012", "details_link": "https://www.metacritic.com/game/pc/railworks-3-train-simulator-2012", "publisher": "RailSimulator.com", "release_date": "Sep 23 2011", "developers": ["RailSimulator.com"], "platforms": "PC", "genres": ["Simulation", "Train", "Vehicle", "Train"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/1faebfba883d83e958b4a96eeb168f0f-98.jpg", "descriptions": "Train Simulator 2012 promises to be the most advanced train simulator in the world, with the most up to date graphics available for the PC and numerous technical innovations to create the most immersive sense of reality yet seen in a PC simulation. Every aspect of gameplay and the in-gameTrain Simulator 2012 promises to be the most advanced train simulator in the world, with the most up to date graphics available for the PC and numerous technical innovations to create the most immersive sense of reality yet seen in a PC simulation. Every aspect of gameplay and the in-game environment is designed to make the player feel that they are controlling the locomotive. … Expand"}, {"name": "Real Heroes: Firefighter", "details_link": "https://www.metacritic.com/game/wii/real-heroes-firefighter", "publisher": "Conspiracy Entertainment", "release_date": "Aug  4 2009", "developers": ["Epicenter Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Wii"], "genres": ["Action", "Simulation", "General", "General", "Virtual", "Career"], "meta_score": 67, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/cdf5ebfaa2ac403d4530ef848e8979f0-98.jpg", "descriptions": "Enter the soot-stained boots of an everyday hero as a newly graduated Fire Academy cadet getting their start in a big city firehouse. Experience raging infernos and explosive environments in this unique first person action game. Use the firefighter's tools of the trade like the axe, hose andEnter the soot-stained boots of an everyday hero as a newly graduated Fire Academy cadet getting their start in a big city firehouse. Experience raging infernos and explosive environments in this unique first person action game. Use the firefighter's tools of the trade like the axe, hose and saw to rescue survivors and get the fires under control. Thinking fire technology delivers a cunning and dangerous enemy unlike any before. Work with a team of fellow firefighters to make sure everyone makes it out alive. Diverse scenarios test your skills, from a collapsing bridge to an engulfed shopping mall. [Conspiracy Entertainment]… Expand"}, {"name": "Soundfall", "details_link": "https://www.metacritic.com/game/playstation-5/soundfall", "publisher": "Noodlecake Studios", "release_date": "May 11 2022", "developers": ["Drastic Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Action", "Action Adventure", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/54f301b38577900c528703b85546be14-98.jpg", "descriptions": "Soundfall is a dungeon crawler that combines looter-shooter action with rhythm-based gameplay. Venture out solo or with up to 4 friends locally or online. Collect loot and time your actions to the beat to become all powerful. Play the Campaign Mode, Free Play 100's of songs or import your Soundfall is a dungeon crawler that combines looter-shooter action with rhythm-based gameplay. Venture out solo or with up to 4 friends locally or online. Collect loot and time your actions to the beat to become all powerful. Play the Campaign Mode, Free Play 100's of songs or import your own music! … Expand"}, {"name": "Marvel's Avengers", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-avengers", "publisher": "Square Enix", "release_date": "Sep  1 2020", "developers": ["Crystal Dynamics", "Eidos Montreal"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 67, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/9/eb1147c2c379ed447426cd3c85074b5c-98.jpg", "descriptions": "Marvel’s Avengers is an epic, third-person, action-adventure game that combines an original, cinematic story with single-player and co-operative gameplay. Assemble into a team of up to four players online, master extraordinary abilities, customize a growing roster of Heroes, and defend theMarvel’s Avengers is an epic, third-person, action-adventure game that combines an original, cinematic story with single-player and co-operative gameplay. Assemble into a team of up to four players online, master extraordinary abilities, customize a growing roster of Heroes, and defend the Earth from escalating threats.… Expand"}, {"name": "The Thin Silence", "details_link": "https://www.metacritic.com/game/pc/the-thin-silence", "publisher": "Nkidu Games Inc.", "release_date": "Apr 27 2018", "developers": ["TwoPM Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/5ee6c4e44bc3dc1404222ab70fa1956e-98.jpg", "descriptions": "The Thin Silence explores depression, self-doubt, struggles, and trials. Amongst the darkness, the game features that sound, that thin silence, which calls to us in our darkest hours."}, {"name": "Manhunt 2", "details_link": "https://www.metacritic.com/game/playstation-2/manhunt-2", "publisher": "Rockstar Games", "release_date": "Oct 29 2007", "developers": ["Rockstar London"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 67, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/0e269e9bc225b13ca927e203763c2c41-98.jpg", "descriptions": "An experiment at a secret research facility has gone catastrophically wrong. Daniel Lamb and Leo Kasper are the only surviving subjects. The Pickman Project will stop at nothing to hunt them down and stop the truth from getting out. Demented screams echo around the dank Dixmor asylum thatAn experiment at a secret research facility has gone catastrophically wrong. Daniel Lamb and Leo Kasper are the only surviving subjects. The Pickman Project will stop at nothing to hunt them down and stop the truth from getting out. Demented screams echo around the dank Dixmor asylum that has caged you for the last six years. You open your eyes. A white-coated body slumps to the floor through your shaking hands. A bloody syringe slips from your arm. Waves of confusion and paranoia crash over you.  You have no idea who you are or how you got here. The door to your cell is open. One choice. One chance. They took your life. Time to take it back. [Rockstar Games]… Expand"}, {"name": "Might & Magic: Heroes VII", "details_link": "https://www.metacritic.com/game/pc/might-magic-heroes-vii", "publisher": "Ubisoft", "release_date": "Sep 29 2015", "developers": ["Limbic Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Strategy", "Turn-Based", "General"], "meta_score": 67, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/0dfa2cb8bf161bc76d029d4f1506eada-98.jpg", "descriptions": "The story takes place during a war of succession. The Empress’ murder has left a realm in flames with many ambitious rivals ready to take the throne by force. The Duke Ivan then brings together a prestigious council of six trusted advisers to restore order and end the conflict that setThe story takes place during a war of succession. The Empress’ murder has left a realm in flames with many ambitious rivals ready to take the throne by force. The Duke Ivan then brings together a prestigious council of six trusted advisers to restore order and end the conflict that set ablaze Ashan’s lands. … Expand"}, {"name": "Tank Universal: Challenger Eight", "details_link": "https://www.metacritic.com/game/pc/tank-universal-challenger-eight", "publisher": "Meridian4", "release_date": "Aug 21 2008", "developers": ["Dialogue Design"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/7a4f97cab265405c3f3aebefd4e3a4d3-98.jpg", "descriptions": "Our hero, George, after a trip to the doctor, has been given bad news. He's also been given a large quantity of different pills, presumably to treat some unknown yet terminal illness, and to cheer him up he's also been given a VR helmet. On donning the helmet, George (under your control) isOur hero, George, after a trip to the doctor, has been given bad news. He's also been given a large quantity of different pills, presumably to treat some unknown yet terminal illness, and to cheer him up he's also been given a VR helmet. On donning the helmet, George (under your control) is able to explore a strange virtual world. All goes well until he is \"recruited\" by the mysterious figures in this virtual world and forced to take part in a ritual combat exercise. Tank Universal creates a huge virtual 'Tron-like' world where you take part in immense 3D tank battles involving scores of units both friendly and not so friendly in wide open levels. Players can bombard the enemy from a distance or close the gap and dodge shells point blank - all in an immersive first person perspective. [Meridian4]… Expand"}, {"name": "World Championship Poker 2: Featuring Howard Lederer", "details_link": "https://www.metacritic.com/game/pc/world-championship-poker-2-featuring-howard-lederer", "publisher": "Crave", "release_date": "Nov  8 2005", "developers": ["Point of View"], "platforms": ["PlayStation 2", "PC"], "num_players": "8  Online", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/aa0d90682144281133b875a7afddc94e-98.jpg", "descriptions": "WCP 2 features Howard Lederer, Greg Raymer, Clonie Gowen, Amir Vahidi, Paul Darden, Robert Williamson III, Matt Savage, and Annie Duke. World Championship Poker 2 features a much more detailed one player game, where you now have to work your way up the ranks, starting in your mom's basement.WCP 2 features Howard Lederer, Greg Raymer, Clonie Gowen, Amir Vahidi, Paul Darden, Robert Williamson III, Matt Savage, and Annie Duke. World Championship Poker 2 features a much more detailed one player game, where you now have to work your way up the ranks, starting in your mom's basement. Once you start winning and accumulating money, you can spend your winnings on increasingly better pads, and furnishings. Hit a losing streak, and you may have to hock your stuff to stay in the game. 14 types of poker are featured, including Texas Hold'em, Five Card Draw, Seven Card Stud and Pineapple. [Crave]… Expand"}, {"name": "Looney Tunes: Cartoon Conductor", "details_link": "https://www.metacritic.com/game/ds/looney-tunes-cartoon-conductor", "publisher": "Eidos Interactive", "release_date": "Jun 10 2008", "developers": ["Amaze Entertainment"], "platforms": "DS", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/ebab272b958fb64b60ccfa42713f6983-98.jpg", "descriptions": "Players unleash musical abilities using the DS stylus to conduct the orchestra like a maestro and compose the music to classic Looney Tunes cartoon scenes featuring infamous characters such as Bugs Bunny, Porky Pig, Daffy Duck, Sylvester the Cat and Tweety. Once the famous scenes arePlayers unleash musical abilities using the DS stylus to conduct the orchestra like a maestro and compose the music to classic Looney Tunes cartoon scenes featuring infamous characters such as Bugs Bunny, Porky Pig, Daffy Duck, Sylvester the Cat and Tweety. Once the famous scenes are successfully recreated, gamers will be rewarded with clips from favorite Looney Tunes cartoon moments. [Eidos Interactive]… Expand"}, {"name": "Skyshine's Bedlam", "details_link": "https://www.metacritic.com/game/pc/skyshines-bedlam", "publisher": "Skyshine Games", "release_date": "Sep 16 2015", "developers": ["Skyshine Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 67, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/e78db731a347d12aa52a6ba0236c042c-98.jpg", "descriptions": "Skyshine's BEDLAM is a strategic rogue-like turn-based RPG. You are the Mechanic, in charge of commanding your crew in battles, managing your resources, improving your Dozer, interacting with various characters, and protecting your passengers while navigating through the post-apocalyptic wasteland."}, {"name": "Shadow Man: Remastered", "details_link": "https://www.metacritic.com/game/pc/shadow-man-remastered", "publisher": "Valiant Entertainment", "release_date": "Apr 15 2021", "developers": ["Night Dive Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/16f9f49334e8c2df190e0658c8c0b41c-98.jpg", "descriptions": "He is coming, stalking criminals in the spirit world and the real world. A possessed man is coming, a voodoo mask in his chest and lines of power in his back. Shadow Man is coming, trailing evil from Liveside to Deadside. To stop an apocalypse. To save your soul."}, {"name": "Batman: The Telltale Series - Episode 5: City of Light", "details_link": "https://www.metacritic.com/game/playstation-4/batman-the-telltale-series---episode-5-city-of-light", "publisher": "Telltale Games", "release_date": "Dec 13 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/a79bef3d4716bdeabc49c3de2eeda090-98.jpg", "descriptions": "Enter the fractured psyche of Bruce Wayne and discover the powerful and far-reaching consequences of your choices as the Dark Knight. The fate of Bruce Wayne, his dark persona, Batman, and Gotham hang in the balance."}, {"name": "Final Fantasy", "details_link": "https://www.metacritic.com/game/psp/final-fantasy", "publisher": "Square Enix", "release_date": "Jun 26 2007", "developers": ["TOSE"], "platforms": ["iPhone/iPad", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 67, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/708b3bf498b6631a92d2484c6d726732-98.jpg", "descriptions": "In FINAL FANTASY, the tale begins when four young warriors, each possessing a Crystal, are summoned to bring the world back to a harmonious elemental balance. During their voyage, they discover a nefarious entity has created turmoil in the structure of time in order to take control of theIn FINAL FANTASY, the tale begins when four young warriors, each possessing a Crystal, are summoned to bring the world back to a harmonious elemental balance. During their voyage, they discover a nefarious entity has created turmoil in the structure of time in order to take control of the world, causing the heroes to travel to places they never imagined possible. This all-new anniversary edition contain the best treatment of the classic RPG and features all-new character art, updated graphics, new dungeons, full 16:9 widescreen presentation and an updated camera view that gives players a new vantage point. [Square Enix]… Expand"}, {"name": "FIFA Soccer 12", "details_link": "https://www.metacritic.com/game/3ds/fifa-soccer-12", "publisher": "Electronic Arts", "release_date": "Sep 27 2011", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "3DS"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 67, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/5/bf977737edef73e161826f3d9a92aaea-98.jpg", "descriptions": "Take to the pitch with superstars like Real Madrid’s Kaká and Manchester United’s Wayne Rooney, and become a true marksman using all-new optional touch screen controls.  Enjoy precision shooting by picking a spot precisely from the player’s viewpoint using the lower touch screen and thenTake to the pitch with superstars like Real Madrid’s Kaká and Manchester United’s Wayne Rooney, and become a true marksman using all-new optional touch screen controls.  Enjoy precision shooting by picking a spot precisely from the player’s viewpoint using the lower touch screen and then finessing a shot with pinpoint accuracy. Utilize touch screen controls on set pieces to draw a shot that curves the ball around, or even power it over the wall for the match-winning goal that lifts your club to victory.… Expand"}, {"name": "My World, My Way", "details_link": "https://www.metacritic.com/game/ds/my-world-my-way", "publisher": "Atlus", "release_date": "Feb  3 2009", "developers": ["Global A"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "General", "General"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/5ab019ebb57a49272776fe4b22251853-98.jpg", "descriptions": "Elise is a beautiful princess who has been given everything she’s ever wanted. Upon turning 15, she realizes there’s only one thing in the world she lacks - a handsome boyfriend. She sets out to remedy this by asking her father to hold a ball in her honor, to which every prince from everyElise is a beautiful princess who has been given everything she’s ever wanted. Upon turning 15, she realizes there’s only one thing in the world she lacks - a handsome boyfriend. She sets out to remedy this by asking her father to hold a ball in her honor, to which every prince from every kingdom is invited to come and try their hand at wooing her. However, only one young man catches Elise’s eye, and, as it turns out, he is no prince, but an adventurer. Knowing that fate itself has ordained him as her true love, she confesses her desire to share in his exciting life... Only to be flat out rejected. He tells her, \"If it is truly your desire is to be with an adventurer such as me, I would ask you first to do something with that long hair. Cast aside that frilly dress, and don a suit of armor. Gain some experience in battle, and when you have matured, we shall meet again. Until then, I bid you farewell.\" And so, much to the Kingdom’s shock and dismay, Elise, the clueless princess, sets out on her adventure! It’s her world, her way, and as long as she can help the weak, slay the monsters, and win enough fame, she’ll get her happily ever after! Alter the landscape to get your way! Different terrain options will open up different opportunities for new enemies and items, and give you power over your adventure. Pouting is power, and developing your selfishness is key to getting the Pout Points that will give you options to force the world to behave.  Delight in the off-the-wall journey of a spoiled princess whose selfishness fuels her ability to successfully become an adventurer. [Atlus USA]… Expand"}, {"name": "Spider-Man 2", "details_link": "https://www.metacritic.com/game/psp/spider-man-2", "publisher": "Activision", "release_date": "Mar 23 2005", "developers": ["Vicarious Visions"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Linear"], "meta_score": 67, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/6eb44bd5d0004926d6fffaac16695094-98.jpg", "descriptions": "As Spider-Man, players must master new combo moves as they protect the city of Manhattan from the nefarious Doc Ock and other classic Marvel villains by swinging, jumping and wall-crawling through 19 new levels that extend beyond the film. Featuring an unprecedented depth of gameplay,As Spider-Man, players must master new combo moves as they protect the city of Manhattan from the nefarious Doc Ock and other classic Marvel villains by swinging, jumping and wall-crawling through 19 new levels that extend beyond the film. Featuring an unprecedented depth of gameplay, players experience original storylines and battle through graphically rich 3D environments. Swing, climb and web-sling through interactive 3D environments while experiencing scenarios, settings and characters based on the hit film and others that are exclusive to the game. In addition to Doc Ock, gamers must battle a plethora of characters in Spider-Man's legendary Rogue's Gallery of villains, such as Mysterio, Rhino, Shocker and Vulture. Utilizing the graphical power of the PSP, Spider-Man 2 delivers amazing console-like 3D graphics and incredibly immersive gameplay never before seen in a handheld Spider-Man game. Beyond Spider-Man's signature set of moves which include wall crawling, web yanking and capture webbing, Spider-Man 2 PSP brings a host of new moves to the handheld such as the \"cocoon,\" \"web net\" and \"heavy web ball.\" [Activision]… Expand"}, {"name": "MX vs. ATV Untamed", "details_link": "https://www.metacritic.com/game/playstation-3/mx-vs-atv-untamed", "publisher": "THQ", "release_date": "Dec 17 2007", "developers": ["Rainbow Studios"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/e8dae6c91353c8009e21158c06bf69a1-98.jpg", "descriptions": "MX vs ATV kicks it up a notch and shifts into high gear as the best selling offroad franchise returns. Rainbow Studios (MX Unleashed, MX vs ATV Unleashed) has evolved their legendary Rhythm Racing engine to include throttle based power slides, near upside down whips and new scrubs at fullMX vs ATV kicks it up a notch and shifts into high gear as the best selling offroad franchise returns. Rainbow Studios (MX Unleashed, MX vs ATV Unleashed) has evolved their legendary Rhythm Racing engine to include throttle based power slides, near upside down whips and new scrubs at full speed all while retaining the smooth and authentic feel not found in any other game. Attempt to own the offroad by dominating the innovative new \"X-Cross Tournament\". X-Cross brings together 8 unique racing series like Endurocross, Opencross, Supercross, Waypoint and SuperMoto and then crosses them into one ultimate offroad championship. Brand new styles of racing are born as powerful vehicles tear through treacherous trails in the new Opencross mode, while then shifting gears to navigate boulders, logs, and water pits in Endurocross. Players can take control of the new ORV Sport and multiple other vehicles, including Monster and Trophy Trucks, as they blitz through rough rivers, rip though swampy everglades, and blaze through the desert dunes. Amp up your favourite vehicles power, handling, and acceleration with more than 100 sponsor parts and accessories. The MX vs ATV rivalry explodes as the top professional riders like Ricky Carmichael, Chad Reed, and others go bar to bar in Supercross, Outdoor Nationals, Supermoto, and Freestyle showdowns. The top 10 professional MX and ATV riders collide on the same track vying for vehicle supremacy. Be the last vehicle standing as 8 players compete online. [THQ]… Expand"}, {"name": "NCAA March Madness 07", "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-march-madness-07", "publisher": "EA Sports", "release_date": "Jan 17 2007", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/ddb17ebf2856bbcf0c5e6ec8c678bd24-98.jpg", "descriptions": "NCAA March Madness 07 delivers an authentic college basketball gameplay experience by offering custom playbooks for each team through the Floor General Playcalling system, the EA SPORTS Lockdown Stick that allows your players to pressure the ball, force turnovers and harass opponents on theNCAA March Madness 07 delivers an authentic college basketball gameplay experience by offering custom playbooks for each team through the Floor General Playcalling system, the EA SPORTS Lockdown Stick that allows your players to pressure the ball, force turnovers and harass opponents on the court, and an enhanced Dynasty Mode with new School Pride and Recruiting features that let you build your school into a national powerhouse. In addition, the popular voices of college basketball are back with ESPN’s Dick Vitale and Brad Nessler calling the action courtside. With the most advanced ESPN integration package available in NCAA March Madness 07, fans connected online via Xbox LIVE can watch college basketball game highlights, segments from Pardon the Interruption and Around the Horn, interviews and analysis from SportsCenter, and more. Fans can also download and listen to ESPN radio podcasts as they play NCAA March Madness 07, including segments from Dan Patrick, Mike & Mike, Stephen A. Smith and others. All this is in addition to live ESPN Radio SportsCenter updates every 20 minutes, the ESPN Ticker and ESPNews. [Electronic Arts]… Expand"}, {"name": "Hidden & Dangerous 2: Sabre Squadron", "details_link": "https://www.metacritic.com/game/pc/hidden-dangerous-2-sabre-squadron", "publisher": "Global Star Software", "release_date": "Oct 21 2004", "developers": ["Illusion Softworks"], "platforms": "PC", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Historic", "Historic"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/0ba233fe5aa9767b29ab981436ea6a95-98.jpg", "descriptions": "Sabre Squadron features nine new single-player campaign missions in four new locations plus the added ability to play all of these nine missions cooperatively over the Internet. In addition, Sabre Squadron features three new deathmatches, three new occupations and two new objectiveSabre Squadron features nine new single-player campaign missions in four new locations plus the added ability to play all of these nine missions cooperatively over the Internet. In addition, Sabre Squadron features three new deathmatches, three new occupations and two new objective multiplayer missions for up to 32 players, enhanced, more realistic AI, and new weapons such as the German Panzershreck, SAS flare gun, German G43 rifle and the PAK40 cannon. [Gathering]… Expand"}, {"name": "The Longest Five Minutes", "details_link": "https://www.metacritic.com/game/switch/the-longest-five-minutes", "publisher": "NIS America", "release_date": "Feb 13 2018", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/69cfa0c5b953d540327642dfc4705e5a-98.jpg", "descriptions": "Our hero faces the origin of all evil, the Overlord himself, but suddenly loses all memories of his adventure.His finishing moves, the name of his hometown, and even the reason he's trying to defeat the Overlord in the first place, all gone. Our hero feels as though he's letting his alliesOur hero faces the origin of all evil, the Overlord himself, but suddenly loses all memories of his adventure.His finishing moves, the name of his hometown, and even the reason he's trying to defeat the Overlord in the first place, all gone. Our hero feels as though he's letting his allies down...In the midst of battle, his allies' words and the Overlord's taunting triggers flashbacks, bringing his memories back piece by piece. Our hero tries to regain his priceless memories before it's too late, but the Overlord stands before him, his power unyielding!What can happen in The Longest Five Minutes!?… Expand"}, {"name": "Dakar Desert Rally", "details_link": "https://www.metacritic.com/game/xbox-series-x/dakar-desert-rally", "publisher": "Saber Interactive", "release_date": "Oct  4 2022", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Racing", "Simulation", "Other", "Automobile"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/de3c7dc99e1ce234197794824b674908-98.jpg", "descriptions": "Dakar Desert Rally is the biggest and most epic off-road rally racing adventure ever developed.Dakar Desert Rally captures the genuine speed and excitement of Amaury Sport Organisation's largest rally race on the planet, featuring a wide variety of licensed vehicles from the world's topDakar Desert Rally is the biggest and most epic off-road rally racing adventure ever developed.Dakar Desert Rally captures the genuine speed and excitement of Amaury Sport Organisation's largest rally race on the planet, featuring a wide variety of licensed vehicles from the world's top makers, including motorcycles, cars, trucks, quads and SSVs. The game offers unique challenges for off-road simulation diehards and casual racing fans alike.Compete in fierce online multiplayer races or navigate the vast wilds in single-player offline.… Expand"}, {"name": "Nickelodeon All-Star Brawl", "details_link": "https://www.metacritic.com/game/switch/nickelodeon-all-star-brawl", "publisher": "GameMill Entertainment", "release_date": "Oct  5 2021", "developers": ["Ludosity Interactive", "Fair Play Labs"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Fighting", "Party / Minigame", "2D"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/3c284edcf7fb97373eb03d6084064d5d-98.jpg", "descriptions": "THE ALL-STAR BRAWL BEGINS!Nickelodeon All-Star Brawl brings together all your Nickelodeon favorites for one bombastic battle. Face off with a power-packed cast of heroes from the top shows within the Nickelodeon universe, including SpongeBob SquarePants, Teenage Mutant Ninja Turtles,THE ALL-STAR BRAWL BEGINS!Nickelodeon All-Star Brawl brings together all your Nickelodeon favorites for one bombastic battle. Face off with a power-packed cast of heroes from the top shows within the Nickelodeon universe, including SpongeBob SquarePants, Teenage Mutant Ninja Turtles, Invader Zim, and many more, to determine the ultimate champion. With unique moves and attacks drawn directly from their identifiable personalities, each brawler has its own style of play for endless action.… Expand"}, {"name": "Space Invaders Forever", "details_link": "https://www.metacritic.com/game/playstation-4/space-invaders-forever", "publisher": "ININ Games", "release_date": "Dec 11 2020", "developers": ["Taito Corporation"], "platforms": ["Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "Shoot-'Em-Up", "Vertical"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/b99c8cf7fe1f5e6bc9d6729d2b52f82e-98.jpg", "descriptions": "Space Invaders Extreme has arrived to invade consoles with greatly improved graphics and interactive sound to deliver a new immersive experience. Packed with vibrant visuals and a pulsing soundtrack. Space Invaders Extreme comes with 16 stages, packed with devious invaders and fiendish bossSpace Invaders Extreme has arrived to invade consoles with greatly improved graphics and interactive sound to deliver a new immersive experience. Packed with vibrant visuals and a pulsing soundtrack. Space Invaders Extreme comes with 16 stages, packed with devious invaders and fiendish boss fights. Practice individual stages in Free Play, then boost your high score to new heights in Arcade Mode! Can you find all the countless, hidden bonuses? Welcome to the new invasion!.… Expand"}, {"name": "Warhammer: Chaosbane", "details_link": "https://www.metacritic.com/game/playstation-5/warhammer-chaosbane", "publisher": "Bigben Interactive", "release_date": "Nov 12 2020", "developers": ["Games Workshop"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/f7b6fd2e2b86819f54862a04c312a047-98.jpg", "descriptions": "In a world ravaged by war and dominated by magic, you are the last hope for the Empire of Man against the Chaos hordes. Playing solo or with up to 4 in local or online co-op, choose a hero from 4 character classes with unique and complementary skills, and prepare for epic battles wieldingIn a world ravaged by war and dominated by magic, you are the last hope for the Empire of Man against the Chaos hordes. Playing solo or with up to 4 in local or online co-op, choose a hero from 4 character classes with unique and complementary skills, and prepare for epic battles wielding some of the most powerful artefacts of the Old World.\r THE FIRST HACK AND SLASH set in the Warhammer Fantasy world, told through an all-new story written by Mike Lee (a Black Library author) and featuring a soundtrack composed by Chance Thomas.\r FEROCIOUS BATTLES: from the sewers of Nuln to the ruined streets of Praag, fight your way through monster hordes using over 180 different powers. Activate your bloodlust, a devastating skill, to escape the most perilous situations.\r 4 CHARACTER CLASSES, each with unique skills and customisation: a soldier of the Empire who can take heavy damage, a Dwarf specialising in melee combat, a High Elf who deals ranged damage by manipulating magic or a Wood Elf who lays deadly traps and wields the bow like no other!\r AN XXL BESTIARY with over 70 monsters aligned with the Chaos Gods and unique bosses. Battle Nurgle's minions, Khorne's spawn and waves of other vile creatures!\r OPTIMIZED FOR CO-OP: solo or with up to 4 players, local or online, the class synergy and interface have been designed for co-op. Combine different skills and powers to create even more devastating effects.\r HIGH REPLAY VALUE: Story mode, a boss rush mode, countless dungeons and regular updates offer a rich and varied gaming experience. And with 10 difficulty levels, you can find the right challenge to test your abilities.… Expand"}, {"name": "Warhammer 40,000: Mechanicus", "details_link": "https://www.metacritic.com/game/playstation-4/warhammer-40000-mechanicus", "publisher": "Kalypso", "release_date": "Jul 17 2020", "developers": ["Bulwark Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 67, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/360a22a4ba3fcc07bdb14894b656d300-98.jpg", "descriptions": "Take control of one of the most technologically advanced armies in the Imperium - The Adeptus Mechanicus. As Magos Dominus Faustinius, you'll lead the expedition on the newly rediscovered planet of Silva Tenebris. Manage resources, discover long-forgotten tech, plan tactical operations usingTake control of one of the most technologically advanced armies in the Imperium - The Adeptus Mechanicus. As Magos Dominus Faustinius, you'll lead the expedition on the newly rediscovered planet of Silva Tenebris. Manage resources, discover long-forgotten tech, plan tactical operations using the Noosphere technology and control your Tech-Priests every move.Your every decision will shape the missions ahead and ultimately decide the fate of the troops under your command. However, choose your path carefully - the Imperium depends on it.* AugmentFlesh is weak! Upgrade your Tech-Priests limbs with mechanical augments made from the blessed metals of the Omnissiah. Customize your team with hundreds of possibilities, creating a squad to suit your playstyle.* Difficult DecisionsMake tough decisions that will forge the future from your Ark Mechanicus, The Caestus Metalican, and send you towards alternate endings for a truly unique playthrough.* Experience the NoosphereUse the Adeptus Mechanicus' evolved human cognition to scan unexplored tombs for valuable data in order to gain a tactical advantage over your enemy.* The LibraryA compelling story written by Black Library author, Ben Counter, specifically crafted to fit the unique personality of the Adeptus Mechanicus faction.… Expand"}, {"name": "Romance of the Three Kingdoms XIV", "details_link": "https://www.metacritic.com/game/playstation-4/romance-of-the-three-kingdoms-xiv", "publisher": "Koei Tecmo Games", "release_date": "Feb 28 2020", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 67, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/911edb6c8fc66070a7245d570515207b-98.jpg", "descriptions": "The latest iteration of the classic tactical series is once again set during the fall of the Han Dynasty in ancient China; where battles take place in a boundary-free scramble for land."}, {"name": "Total War: Three Kingdoms - Eight Princes", "details_link": "https://www.metacritic.com/game/pc/total-war-three-kingdoms---eight-princes", "publisher": "Sega", "release_date": "Aug  8 2019", "developers": ["Creative Assembly"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 67, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/1/649b82d732979b9e2e82bb7d73c44a5b-98.jpg", "descriptions": "The year is 291 CE, and a generation has passed since the tumultuous events of the Three Kingdoms period began. Despite the tripartite division of power which brought the conflict to a stalemate, and the brief unification of the kingdoms under the Jin dynasty, civil war is no more than aThe year is 291 CE, and a generation has passed since the tumultuous events of the Three Kingdoms period began. Despite the tripartite division of power which brought the conflict to a stalemate, and the brief unification of the kingdoms under the Jin dynasty, civil war is no more than a heartbeat away.\r For the Jin is a dynasty divided. Its many ruling princes are hungry for greater power, each with ambitions – and methods – of their own. Eight stand above all others… will they rally to their emperor and empress? Or carve a legacy for themselves that will echo through the ages?\r The Eight Princes Chapter Pack is set 100 years after the events of Total War: THREE KINGDOMS, and features a new cast of playable factions led by the foremost princes of the Jin Dynasty. These Eight Princes offer feature substantially different campaign mechanics, focussing their playstyles in fascinating and unique ways\r Playable princes\r Each of the eight playable princes adhere to the five core character classes of the base game, and have their own sets of campaign mechanics which strongly focus their gameplay style.\r… Expand"}, {"name": "Rainswept", "details_link": "https://www.metacritic.com/game/pc/rainswept", "publisher": "Frostwood Interactive", "release_date": "Feb  1 2019", "developers": ["Frostwood Interactive"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/f1f127b341ca67d114668ce56a8e8d4d-98.jpg", "descriptions": "Rainswept is an adventure game - A murder mystery dealing with themes of love, relationships and unresolved trauma."}, {"name": "Sky Force Anniversary", "details_link": "https://www.metacritic.com/game/switch/sky-force-anniversary", "publisher": "Infinite Dreams", "release_date": "Nov  8 2018", "developers": ["Infinite Dreams", "Infinite Dreams Inc."], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/37caf9941a27dc88e73da3b2744d9477-98.jpg", "descriptions": "The legendary shoot-em-up is here to celebrate its 10-year anniversary in super-destructive style.\r Harnessing the intensity of classic arcade games combined with modern visuals, Sky Force Anniversary offers a stunning scrolling shooter experience with an incredible new social gameplayThe legendary shoot-em-up is here to celebrate its 10-year anniversary in super-destructive style.\r Harnessing the intensity of classic arcade games combined with modern visuals, Sky Force Anniversary offers a stunning scrolling shooter experience with an incredible new social gameplay element.\r Over a decade ago, IGN said, \"Put simply, Sky Force is amazing.\" Scoring an incredible 9.5 out of 10. And now i'ts back. Bigger, bolder and more intense than ever.\r This 10th anniversary edition adds incredible depth to the series through stunning 3D graphics, intuitive controls and a powerful upgrade system that'll keep you blasting for hours on end.… Expand"}, {"name": "Transference", "details_link": "https://www.metacritic.com/game/xbox-one/transference", "publisher": "Ubisoft", "release_date": "Sep 18 2018", "developers": ["SpectreVision"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 67, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/7696d194f568c74bf7791a9a5b615115-98.jpg", "descriptions": "Transference is a psychological thriller and the first game collaboration between SpectreVision and Ubisoft. Bridging the gap between movies and games, we invite you to lose yourself in the destructive tale of a man's obsession as you explore his digitally recreated memories. Experience theTransference is a psychological thriller and the first game collaboration between SpectreVision and Ubisoft. Bridging the gap between movies and games, we invite you to lose yourself in the destructive tale of a man's obsession as you explore his digitally recreated memories. Experience the limits of techno-psychology, and escape a maze-like puzzle concealing a corrupted truth. Get projected into the digital consciousness of troubled case subjects and maybe you will influence their fate.… Expand"}, {"name": "Shining Resonance Refrain", "details_link": "https://www.metacritic.com/game/playstation-4/shining-resonance-refrain", "publisher": "Sega", "release_date": "Jul 10 2018", "developers": ["Sega"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/fe97ee5e42e6ca34e3159896d5b9e9cb-98.jpg", "descriptions": "Assume the role of Yuma Ilvern and stop the Empire from exploiting the power of the ancient dragons, including the soul of the Shining Dragon within you. With the help of your friends, realize your destiny, save Astoria, and unleash the strength you’ve always had locked away."}, {"name": "House Flipper", "details_link": "https://www.metacritic.com/game/pc/house-flipper", "publisher": "PlayWay", "release_date": "May 17 2018", "developers": ["Empyrean"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life", "Career"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/a6273e5efd30f788c0d1202631901270-98.jpg", "descriptions": "House Flipper is a unique chance to become a one-man renovation crew. Buy, repair and remodel devastated houses. Give them a second life and sell them at a profit!"}, {"name": "Guns of Icarus Alliance", "details_link": "https://www.metacritic.com/game/playstation-4/guns-of-icarus-alliance", "publisher": "Muse Games", "release_date": "May  1 2018", "developers": ["Muse Games"], "platforms": "PlayStation 4", "num_players": "Up to 32 ", "genres": ["Simulation", "Space", "Combat"], "meta_score": 67, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/8/30b47a33088e199e2953e2716eedfc72-98.jpg", "descriptions": "Guns of Icarus Alliance: PS4 Edition is a player-vs-player, player-vs-environment, steampunk airship combat game, complete with an ongoing war between six elite factions vying for control of a world ravaged by machines."}, {"name": "Urban Trial Playground", "details_link": "https://www.metacritic.com/game/switch/urban-trial-playground", "publisher": "Tate Multimedia", "release_date": "Apr  5 2018", "developers": ["Teyon", "Tate Multimedia"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Other", "Biking"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/ffe31da085c4ae9f1ff1a52df15f9f2f-98.jpg", "descriptions": "UTP is stunt bike racing game set in sunny and colorful beaches of California.  Mix tricks, flips and combos more than ever before. Compete on more than 50 levels, in various modes."}, {"name": "Rad Rodgers", "details_link": "https://www.metacritic.com/game/xbox-one/rad-rodgers", "publisher": "THQ Nordic", "release_date": "Feb 21 2018", "developers": ["Slipgate Studios LLC", "Slipgate Ironworks"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["3D", "Action", "Platformer", "2D"], "meta_score": 67, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/1a0e1083ba70caa8546222545c207333-98.jpg", "descriptions": "Rad is a rambunctious but spirited young boy who maybe plays too many video games. After dozing off at the tail end of a long night of gaming, Rad awakens to find his dusty old console has turned itself back on."}, {"name": "Max: The Curse of Brotherhood", "details_link": "https://www.metacritic.com/game/playstation-4/max-the-curse-of-brotherhood", "publisher": "Wired Productions", "release_date": "Nov  8 2017", "developers": ["Wired Productions"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/75ff1a2af72e3245582460180a018502-98.jpg", "descriptions": "When Max wishes for his annoying little brother, Felix, to be whisked away by unknown evil forces, he gets more than he bargained for. Armed only with a marker and a hope of undoing what he has just done, he sets out on a perilous journey across deserts, eerie lantern-lit bogs, ancientWhen Max wishes for his annoying little brother, Felix, to be whisked away by unknown evil forces, he gets more than he bargained for. Armed only with a marker and a hope of undoing what he has just done, he sets out on a perilous journey across deserts, eerie lantern-lit bogs, ancient temples and lush green forests to get his younger sibling back. Along the way Max gains the power to manipulate his environment and overcome seemingly impossible obstacles.… Expand"}, {"name": "Shiness: The Lightning Kingdom", "details_link": "https://www.metacritic.com/game/playstation-4/shiness-the-lightning-kingdom", "publisher": "Focus Home Interactive", "release_date": "Apr 18 2017", "developers": ["Enigami"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/fdd8a262dfe888551ad45fb8748ca795-98.jpg", "descriptions": "Shiness is an action-RPG that takes you on a journey across a universe on the verge of collapse. After crash-landing on a hostile island, you find yourself in a conflict spanning multiple kingdoms. Face off against dangerous enemies in hyper-dynamic fights, mixing magic with traditionalShiness is an action-RPG that takes you on a journey across a universe on the verge of collapse. After crash-landing on a hostile island, you find yourself in a conflict spanning multiple kingdoms. Face off against dangerous enemies in hyper-dynamic fights, mixing magic with traditional fighting game mechanics. Gain experience to evolve your characters, learning exciting new skills and spells.… Expand"}, {"name": "Resident Evil 7: biohazard - Banned Footage Vol. 2", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-7-biohazard---banned-footage-vol-2", "publisher": "Capcom", "release_date": "Feb 14 2017", "developers": ["Capcom"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/1ad2da83a93eab0822221edad6a6f6c5-98.jpg", "descriptions": "It’s Jack’s 55th Birthday! There’s nothing quite like a big birthday bash, and that’s exactly what you’ll get in this extra mode in Banned Footage Vol. 2."}, {"name": "Super Mutant Alien Assault", "details_link": "https://www.metacritic.com/game/playstation-4/super-mutant-alien-assault", "publisher": "Surprise Attack", "release_date": "Jul 12 2016", "developers": ["Cybernate", "Chris Suffern"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/4/fce2da2694660334f7179b24ab0c60b1-98.jpg", "descriptions": "A quick, brutal arcade platformer. The player must fight off an alien assault across 12 rapid-fire single-screen levels. Each with a random combination of platform layout, objective, vending machines and enemies."}, {"name": "Dex", "details_link": "https://www.metacritic.com/game/playstation-4/dex", "publisher": "Dreadlocks Ltd", "release_date": "Jul 12 2016", "developers": ["Dreadlocks Ltd", "Dreadlocks"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/7341ee810cb4e4b439b266db968dd1e2-98.jpg", "descriptions": "Discover the truth behind an enigmatic AI striving to reach the Singularity, a theoretical “event horizon” in which artificial intelligence will surpass human intelligence and all bets about the future will be off. How will you play your part in the story?  Explore the futuristic city ofDiscover the truth behind an enigmatic AI striving to reach the Singularity, a theoretical “event horizon” in which artificial intelligence will surpass human intelligence and all bets about the future will be off. How will you play your part in the story?  Explore the futuristic city of Harbor Prime and meet its many inhabitants, answer the challenges the city has to offer, roam the neon-lit streets, and augment your character with skills and implants.… Expand"}, {"name": "TurnOn", "details_link": "https://www.metacritic.com/game/xbox-one/turnon", "publisher": "Brainy Studio LLC", "release_date": "Jun  1 2016", "developers": ["Brainy Studio LLC"], "platforms": ["PC", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/eb8ec98f96925b4c2f88c0c1995ed05f-98.jpg", "descriptions": "The whole city has been plunged into darkness. After an accident at the power station, a living electric spark must restore electricity to the city and give citizens back their safe and carefree lives. \"TurnOn\" tells the spellbinding tale of a brave alien creature and its striking journeyThe whole city has been plunged into darkness. After an accident at the power station, a living electric spark must restore electricity to the city and give citizens back their safe and carefree lives. \"TurnOn\" tells the spellbinding tale of a brave alien creature and its striking journey through blackout world, in an incredibly colorful and detailed platformer without platforms. Featuring a charming art style and visual storytelling, cute character personality, and a soothing and magical soundtrack, \"TurnOn\" makes the world the way it was before, but a little better and kinder.\r The creation of TurnOn was inspired by the global movement Earth Hour, which is held by WWF.… Expand"}, {"name": "Legend of Kay Anniversary", "details_link": "https://www.metacritic.com/game/wii-u/legend-of-kay-anniversary", "publisher": "Nordic Games Publishing", "release_date": "Jul 28 2015", "developers": ["Neon Studios", "Kaiko"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/526cd85a49f43e2ae07672e11a4b6953-98.jpg", "descriptions": "Ten years after its original release, Legend of Kay - Anniversary is a remastered version of the initial game: high-resolution textures; new, more detailed character models; modern rendering techniques and crystal-clear surround sound promise to give this great classic a new shine."}, {"name": "Magical Beat", "details_link": "https://www.metacritic.com/game/playstation-vita/magical-beat", "publisher": "Arc System Works", "release_date": "Jun 17 2014", "developers": ["Arc System Works"], "platforms": "PlayStation Vita", "genres": ["Action", "Miscellaneous", "Rhythm", "Music"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/500f7138a17d8c0e716bd900bf0e861b-98.jpg", "descriptions": "Combines Drop-Down Puzzle with Beats. The main BGM is composed by the Nico Nico celebrity and sound creator, ‘Kikuo’. Last but not least, don’t forget the thirteen colorful pixel-art characters to take you through the game."}, {"name": "Strike Suit Zero: Director's Cut", "details_link": "https://www.metacritic.com/game/xbox-one/strike-suit-zero-directors-cut", "publisher": "Born Ready Games", "release_date": "Apr  8 2014", "developers": ["Born Ready Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Simulation", "Flight", "Combat"], "meta_score": 67, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/d26a49583e32700c70106d8ad36c84f2-98.jpg", "descriptions": "In the year 2299, an interstellar war rages on. In a bid to save Earth from destruction, you must take control of the Strike Suit  a revolutionary fighter craft with the ability to transform into a lethal suit of space armor. Immerse yourself in massive fleet battles where your dog-fightingIn the year 2299, an interstellar war rages on. In a bid to save Earth from destruction, you must take control of the Strike Suit  a revolutionary fighter craft with the ability to transform into a lethal suit of space armor. Immerse yourself in massive fleet battles where your dog-fighting skills will directly affect the fate of the cosmos. Discover a colorful and vibrant universe, with an epic story where the fate of Earth hangs in the balance and your actions will determine the outcome: preventing Earths destruction is your immediate concern but preserving its future is your ultimate goal. Engage intelligent enemy fighters and take on colossal capital ships, exploiting weak points in their super-structure to blow them apart. Upgrade your ships and customize your weapon load-outs to tailor combat to your tastes. Take advantage of four unique craft, including the Strike Suit, to experience dogfighting action as youve never seen it before.\r This Is Space Combat Reborn.… Expand"}, {"name": "The Showdown Effect", "details_link": "https://www.metacritic.com/game/pc/the-showdown-effect", "publisher": "Paradox Interactive", "release_date": "Mar  5 2013", "developers": ["Arrowhead Game Studios"], "platforms": "PC", "genres": ["Action", "General", "General"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/10630242d53e103c0c74c26fe0e2bf63-98.jpg", "descriptions": "Created by Arrowhead Game Studios, the same brilliant and eccentric minds behind Magicka, The Showdown Effect is a 2.5D multiplayer action game in which players will be participating in death-matches to gain glory and fame. Formerly known as \"Project JFK,\" The Showdown EffectCreated by Arrowhead Game Studios, the same brilliant and eccentric minds behind Magicka, The Showdown Effect is a 2.5D multiplayer action game in which players will be participating in death-matches to gain glory and fame. Formerly known as \"Project JFK,\" The Showdown Effect operates on the principle of \"more is more\" and offers an infinite amount of ways to customize your gameplay. Whether its character, stage, game mode, or weapons, customize as much as you want and control how creatively you want to kill your friends! Remember, the gorier it is, the better the showdown you will have!… Expand"}, {"name": "Primal Carnage", "details_link": "https://www.metacritic.com/game/pc/primal-carnage", "publisher": "Reverb", "release_date": "Oct 29 2012", "developers": ["Lukewarm Media"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 67, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/6fe4fad973602474f04d8c0ca5dfaae8-98.jpg", "descriptions": "Primal Carnage is an asymmetrical online-multiplayer class-based game of humans versus dinosaurs. Choose to play as either side and prepare to engage in a heart-pounding, fun, and visceral experience of combat, stealth, strategy, and survival. Hunt and be hunted!"}, {"name": "Growlanser: Wayfarer of Time", "details_link": "https://www.metacritic.com/game/psp/growlanser-wayfarer-of-time", "publisher": "Atlus", "release_date": "Jul 31 2012", "developers": ["Career Soft"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 67, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/b7b5aa8edd337657c494d6b8dd4f1c69-98.jpg", "descriptions": "Never before released outside of Japan and widely considered the best entry in the long-running franchise, this PSP system iteration of the fourth chapter in the Growlanser saga delivers visuals remastered for PSP system's 16:9 widescreen, a vastly expanded script with tons of new charactersNever before released outside of Japan and widely considered the best entry in the long-running franchise, this PSP system iteration of the fourth chapter in the Growlanser saga delivers visuals remastered for PSP system's 16:9 widescreen, a vastly expanded script with tons of new characters to meet and quests to complete, a wealth of new ending possibilities, and much more, making it the first and only version of the game North American fans will ever want!… Expand"}, {"name": "The Sims Medieval: Pirates & Nobles", "details_link": "https://www.metacritic.com/game/pc/the-sims-medieval-pirates-nobles", "publisher": "Electronic Arts", "release_date": "Aug 30 2011", "developers": ["The Sims Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "General", "Virtual", "Virtual Life"], "meta_score": 67, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/7/e2c10365adcf3d308722772975731bca-98.jpg", "descriptions": "The Sims Medieval Pirates & Nobles Adventure Pack introduces new quests, treasure hunting, and hundreds of new objects for your medieval kingdom."}, {"name": "Operation Flashpoint: Red River", "details_link": "https://www.metacritic.com/game/playstation-3/operation-flashpoint-red-river", "publisher": "Codemasters", "release_date": "Jun  7 2011", "developers": ["Codemasters"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/ed09538e58d7501c21554cacb2a96c5d-98.jpg", "descriptions": "Taking a small step into the future, Red River depicts a fictional conflict with contemporary geopolitical themes, which will unfold over three distinct acts in both single player and drop-in-drop-out co-operative play for up to four players online. Faced with new counter-insurgency combatTaking a small step into the future, Red River depicts a fictional conflict with contemporary geopolitical themes, which will unfold over three distinct acts in both single player and drop-in-drop-out co-operative play for up to four players online. Faced with new counter-insurgency combat and the returning threat of the Chinese PLA, players will feel the tension, brutality and carnage of modern conflict from the perspective of a marine fireteam on deployment in a hostile country, thousands of miles from home.… Expand"}, {"name": "Phoenix Wright: Ace Attorney", "details_link": "https://www.metacritic.com/game/wii/phoenix-wright-ace-attorney", "publisher": "Capcom", "release_date": "Jan 11 2010", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "iPhone/iPad", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "First-Person", "Visual Novel", "Modern", "Modern"], "meta_score": 67, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/bb65e785f640e083a4737afc0d4a38df-98.jpg", "descriptions": "[WiiWare]  Meet Phoenix Wright, the rookie defense lawyer new to the scene with the wildest cross-examination skills in town. Take on four intriguing cases to reveal dramatic, stunning and even comical court proceedings. Use the Wii Remote controller to investigate the crime scenes, question[WiiWare]  Meet Phoenix Wright, the rookie defense lawyer new to the scene with the wildest cross-examination skills in town. Take on four intriguing cases to reveal dramatic, stunning and even comical court proceedings. Use the Wii Remote controller to investigate the crime scenes, question witnesses and present shocking evidence. [Nintendo]… Expand"}, {"name": "Codename Panzers: Cold War", "details_link": "https://www.metacritic.com/game/pc/codename-panzers-cold-war", "publisher": "Atari", "release_date": "Mar 10 2009", "developers": ["Stormregion"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 67, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/52bef8bf19a2b6216758339fcf243196-98.jpg", "descriptions": "Tempelhof, Berlin, dawn of 8th April 1949. A major armed conflict is brewing between the Western powers and the Soviet bloc. The Red Army has been growing ever stronger since the end of World War II. With the growth of their army the Soviets realize that they hold the advantage, and are onlyTempelhof, Berlin, dawn of 8th April 1949. A major armed conflict is brewing between the Western powers and the Soviet bloc. The Red Army has been growing ever stronger since the end of World War II. With the growth of their army the Soviets realize that they hold the advantage, and are only waiting for the right moment to attack. That moment arrives with the Tempelhof Incident: the near-fatal collision of a US cargo plane and a Soviet fighter over Berlin’s main airfield. A fatal combination of coincidence and human error, there is no point in arguing what went wrong, no point in asking who pulled the trigger first and who fired on whom in return. The Incident went down in history as fatal. Within 12 hours of the crash the ground beneath the German capital is shaking with the salvoes of a war never meant to be: a conflict between former allies over Europe and global supremacy. What if Stalin knew exactly that the USA cannot produce more A-bombs after the war? What if he decides to strike first? The massive Russian army was still standing in the middle of Europe and its dependancy on western technology was past - it was ready to roll towards the Atlantic ocean on the first sign from the Boss. The fate of the world was in the hands of a ruthless dictator, who would have shown no sign of hesitation if he knew the proper status of the atomic arsenal in the western world...In this game the worst comes true, and it may just change the fate of the \"free world\" forever! WWII is now just a memory - but the Cold War has just begun. [Atari]… Expand"}, {"name": "The King of Fighters Collection: The Orochi Saga", "details_link": "https://www.metacritic.com/game/playstation-2/the-king-of-fighters-collection-the-orochi-saga", "publisher": "SNK Playmore", "release_date": "Oct 28 2008", "developers": ["Terminal Reality"], "platforms": ["PlayStation 4", "PlayStation 4", "PlayStation 2"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 67, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/28690fc9eb06ad2f5fa84593aebdeaad-98.jpg", "descriptions": "The first ever collection of THE KING OF FIGHTERS, consisting of 5 complete games. KOF 94, 95, 96, 97, 98. [SNK Playmore]"}, {"name": "MLB Power Pros 2008", "details_link": "https://www.metacritic.com/game/playstation-2/mlb-power-pros-2008", "publisher": "2K Sports", "release_date": "Jul 29 2008", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 67, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/1079f7427f0e550eff08d8be68aca552-98.jpg", "descriptions": "With over ten different exciting game modes including the traditional Practice, Exhibition, League and Home Run Challenge modes, MLB Power Pros 2008 brings fans closer to the action than ever before. Gamers also get the opportunity to act as general manager and control the destiny of theirWith over ten different exciting game modes including the traditional Practice, Exhibition, League and Home Run Challenge modes, MLB Power Pros 2008 brings fans closer to the action than ever before. Gamers also get the opportunity to act as general manager and control the destiny of their own franchise in Season mode, or engage in entertaining role-playing story modes such as Success and MLB Life modes. As general manager, gamers can trade, sign free agents, coordinate practice schedules, purchase new equipment, call up and send down players from the Minor Leagues, along with other management options to bring in fans, win playoff games and eventually, earn the title of World Series champion. In Success mode, fans can participate in a story-based career of rising players in the Double-A Minor League system trying to improve their baseball skills and make an impression on baseball scouts while also having to balance various situations in their personal lives. Through a variety of amusing training and game challenges, players who complete Success mode can take their created player files into MLB Life as well, or also play as either an existing Major League Baseball player in Dream Mode, or start as a rookie in Major League Career mode. As a new feature in MLB Power Pros 2008, MLB Life is another story-based mode that allows fans the possibility to simulate the exciting life and experience of being a Major League Baseball player over the course of a 20-year career. While continuing to play in games through the regular baseball season, players also participate in a number of realistic situations such as signing contracts, purchasing houses and cars, making charitable donations, building up relationships with friends and teammates, picking up hobbies and much more. [2K Sports]… Expand"}, {"name": "MySims", "details_link": "https://www.metacritic.com/game/ds/mysims", "publisher": "EA Games", "release_date": "Sep 18 2007", "developers": ["TOSE"], "platforms": ["PC", "DS"], "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/359714537fa5f455418a858adb7da089-98.jpg", "descriptions": "Explore a whole new world with MySims - it's your world to transform. Move to a town that has been struggling lately. With a little creativity and some help from the locals, you can make this place thrive. Improve the town to attract new characters, from the Italian Chef and Florist to theExplore a whole new world with MySims - it's your world to transform. Move to a town that has been struggling lately. With a little creativity and some help from the locals, you can make this place thrive. Improve the town to attract new characters, from the Italian Chef and Florist to the Kickboxing Instructor and DJ. Discover what the residents want and need, so that you can help them enjoy life in their town. Design a hot tub or a jukebox from scratch, build homes and businesses from the roof to the front door. Uncover special decorations and patterns as you explore the growing town. From the furniture and objects to the buildings to the town as a whole – each of your creations is unique. In MySims, what you make... makes all the difference. Your town is your own unique creation, from the flower shop to building a mad scientist's laboratory, and beyond. It's your call who lives there and who moves out. Who will you befriend? Who will you ignore? Socialize with the locals and uncover all sorts of useful or surprising treasures hidden throughout the town. It's a cinch to personalize your Sims appearance from head to toe with the Wii & Nintendo DS controls. Unlock cool new clothing and accessories as you befriend the neighbors. Decorate with your very own furniture and accessories, then customize your creations with things you can grow, harvest, or discover around town. [Electronic Arts]… Expand"}, {"name": "Pokemon Mystery Dungeon: Red Rescue Team", "details_link": "https://www.metacritic.com/game/game-boy-advance/pokemon-mystery-dungeon-red-rescue-team", "publisher": "Nintendo", "release_date": "Sep 18 2006", "developers": ["ChunSoft"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 67, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/3bd4a35435ac1b785a5cfbdfa1239110-98.jpg", "descriptions": "For the first time ever, the player is a Pokemon, speaking and interacting with other characters in a world populated only by Pokemon! Features a deep, involving and dramatic story brings the player into a world of Pokemon not seen or experienced before. Strategic battles enhance theFor the first time ever, the player is a Pokemon, speaking and interacting with other characters in a world populated only by Pokemon! Features a deep, involving and dramatic story brings the player into a world of Pokemon not seen or experienced before. Strategic battles enhance the adventure. Randomly generated dungeons make every mission unique. One day the player awakens to find that he or she has been turned into a Pokemon. The land is being ravaged by natural disasters so the player decides to form a rescue team with a partner Pokemon. The player can interact with many different Pokemon on various missions while trying to uncover their true purpose and destiny. An engrossing story of adventure, redemption and, most of all, friendship.… Expand"}, {"name": "World Championship Pool 2004", "details_link": "https://www.metacritic.com/game/xbox/world-championship-pool-2004", "publisher": "Jaleco Entertainment", "release_date": "Dec  9 2003", "developers": ["Blade Interactive"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Parlor", "Billiards"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/187faaadea6dc237c51e20c91ba19f2c-98.jpg", "descriptions": "Both die-hard pool fans and the casual pool players can practice with World Championship Pool 2004, a pool simulator that features single-player, multiplayer, and online play. In both real and fictitious venues, you'll play to unlock fun tables, unique ball sets, and world-class pool cues.Both die-hard pool fans and the casual pool players can practice with World Championship Pool 2004, a pool simulator that features single-player, multiplayer, and online play. In both real and fictitious venues, you'll play to unlock fun tables, unique ball sets, and world-class pool cues. Become a professional in six gameplay modes; including 8-Ball, 9-Ball, Career, Snooker, Trick Shots; and bonus games like Countdown, Target Table, and Minefield. Realistic ball physics and a dynamic camera system give World Championship Pool 2004 TV-style coverage complete with famous commentators. … Expand"}, {"name": "Mission: Impossible: Operation Surma", "details_link": "https://www.metacritic.com/game/xbox/mission-impossible-operation-surma", "publisher": "Atari", "release_date": "Dec  2 2003", "developers": ["Paradigm Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 67, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/1c12187e73f3d1af931179bba139c6ee-98.jpg", "descriptions": "Your mission, should you choose to accept it, is to save the free world from certain doom.  Ethan Hunt is back in Mission: Impossible Operation Surma, a stealth action adventure featuring an incredible arsenal of the latest weaponry, hi-tech gadgets, and mind-blowing disguises.  Ethan andYour mission, should you choose to accept it, is to save the free world from certain doom.  Ethan Hunt is back in Mission: Impossible Operation Surma, a stealth action adventure featuring an incredible arsenal of the latest weaponry, hi-tech gadgets, and mind-blowing disguises.  Ethan and his IMF team travel to exotic international locations in an effort to thwart the Surma Corporation's diabolical plans for global domination.  Throughout your mission, you'll be called upon to use your brains and brawn to get the job done.  … Expand"}, {"name": "Freestyle Metal X", "details_link": "https://www.metacritic.com/game/playstation-2/freestyle-metal-x", "publisher": "Midway", "release_date": "Jun 27 2003", "developers": ["Deibus Studios"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 67, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/450e0d7b5d82a35aff977df5b48fec76-98.jpg", "descriptions": "Freestyle Metal X unleashes anarchy with the freedom to do what you want, when you want. Be anti-establishment: break windows, run over people, ride where you normally can't ride...and get away with it. With an unlimited stunt system and a lawless energy, Freestyle Metal X dares riders toFreestyle Metal X unleashes anarchy with the freedom to do what you want, when you want. Be anti-establishment: break windows, run over people, ride where you normally can't ride...and get away with it. With an unlimited stunt system and a lawless energy, Freestyle Metal X dares riders to push the envelope with psychotic tricks in limitless, freestyle environments full of challenges and side events. Freestyle Metal X doesn't just cross the line, it eliminates it. A sizable dose of insanity will help you perform stunts on the tops of buildings, get air over the Vegas Strip, or shoot yourself out of a cannon onto the Marina streets. Be sick all over! [Midway]… Expand"}, {"name": "Mystic Heroes", "details_link": "https://www.metacritic.com/game/playstation-2/mystic-heroes", "publisher": "Koei", "release_date": "Nov 24 2002", "developers": ["Koei"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 67, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/d127dc889902dba63988ab9dedb6a4db-98.jpg", "descriptions": "In a world thought to have existed only in legend, four brave Mystics rise against the shadow of darkness that has engulfed the land. Level-up, gather runes, and wield and incredible arsenal of mystic attacks in this epic fantasy action!"}, {"name": "High Heat Major League Baseball 2003", "details_link": "https://www.metacritic.com/game/pc/high-heat-major-league-baseball-2003", "publisher": "3DO", "release_date": "Mar 11 2002", "developers": ["3DO"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/1ee7cceb7ebaa93a30e3153cd1495ab9-98.jpg", "descriptions": "The follow-up to last year's award winning baseball game utilizes the DirectX 8.1 Graphics Engine. Proceeds from each game sold directly benefit Curt Schilling's charity for ALS (Lou Gehrig's disease)."}, {"name": "Dave Mirra Freestyle BMX: Maximum Remix", "details_link": "https://www.metacritic.com/game/playstation/dave-mirra-freestyle-bmx-maximum-remix", "publisher": "Acclaim", "release_date": "May 21 2001", "developers": ["Z-Axis", "Ltd."], "platforms": "PlayStation", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/c5ffc102cf944a9f29677a4479a8b68c-98.jpg", "descriptions": "The graphics in Maximum Remix are roughly identical to the first game, so you're stuck with muddy, ugly textures and quite a bit of texture warping."}, {"name": "Dracula: The Resurrection", "details_link": "https://www.metacritic.com/game/pc/dracula-the-resurrection", "publisher": "DreamCatcher Interactive", "release_date": "Jun 14 2000", "developers": ["Canal+ Multimedia"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "First-Person", "Point-and-Click", "Modern", "Fantasy", "Modern"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/02cdff498183e59a6b91a1549c0bea70-98.jpg", "descriptions": "Your adventure begins as you depart on a journey to save your beloved wife. Enter into the shadows, and explore catacombs and hidden passages as you travel the pathway to darkness.  [Dreamcatcher Interactive]"}, {"name": "Mystical Ninja starring Goemon", "details_link": "https://www.metacritic.com/game/nintendo-64/mystical-ninja-starring-goemon", "publisher": "Konami", "release_date": "Mar 31 1998", "developers": ["Konami Computer Entertainment Osaka"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 67, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/cf4248609d089b7bc995f55753c29edf-98.jpg", "descriptions": "A giant UFO has appeared over Oedo Castle, and the Mystical Ninja is off to save the world again! Control Goemon and his giant robot, Impact, Ebisimaru, a truly twisted ninja, Yae, the part-time militant mermaid, and Sasuke, a mechanical warrior. This brave band must travel from town toA giant UFO has appeared over Oedo Castle, and the Mystical Ninja is off to save the world again! Control Goemon and his giant robot, Impact, Ebisimaru, a truly twisted ninja, Yae, the part-time militant mermaid, and Sasuke, a mechanical warrior. This brave band must travel from town to town, collecting information and purchasing helpful items in their quest to defeat the dreaded Peach Mountain Shoguns.… Expand"}, {"name": "Elex", "details_link": "https://www.metacritic.com/game/pc/elex", "publisher": "Nordic Games Publishing", "release_date": "Oct 17 2017", "developers": ["Piranha Bytes"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/07ac390e3b4b42df00559d504fbb2c87-98.jpg", "descriptions": "Advanced in technology, civilized and with a population of billions, Magalan was a planet looking to the future. Then the meteor hit. Those who survived are now trapped in a battle to survive, a struggle to decide the fate of a planet. At the center of this fight is the element \"Elex\". AAdvanced in technology, civilized and with a population of billions, Magalan was a planet looking to the future. Then the meteor hit. Those who survived are now trapped in a battle to survive, a struggle to decide the fate of a planet. At the center of this fight is the element \"Elex\". A precious, limited resource that arrived with the meteor, Elex can power machines, open the door to magic, or re-sculpt life into new, different forms. But which of these choices should be the future of Magalan? Can technology, or magic save this world? Or will this new power destroy all those left alive amongst the ruins? \r\rElex is an action, role-playing open world game for PC and Consoles, developed by Piranha Bytes, creators of the award winning Gothic series and is set in a brand new, post-apocalyptic, Science-Fantasy universe where magic meets mechs.… Expand"}, {"name": "Transformers: Autobots", "details_link": "https://www.metacritic.com/game/ds/transformers-autobots", "publisher": "Activision", "release_date": "Jun 19 2007", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1-4 ", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/685de8e178a9aaf6c5be57ca819cf0f3-98.jpg", "descriptions": "Based on the 2007 live-action feature film, Transformers: Deceptions lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in DisguiseBased on the 2007 live-action feature film, Transformers: Deceptions lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in Disguise such as BumbleBee, Barricade and others. As the Transformers robot's war comes to Earth, gamers make the choice to join the Autobots in protecting our planet or to join the Decepticons in destroying it. With dual campaigns, the fate of the world is in players' hands. Instantly change from a larger than life robot to a high-powered vehicle such as a sports car, fighter jet or helicopter. Players crush, topple and wreck every object, including buildings and vehicles, in their path or use the objects as weapons. [Activision]… Expand"}, {"name": "Fate/Extella: The Umbral Star", "details_link": "https://www.metacritic.com/game/playstation-4/fateextella-the-umbral-star", "publisher": "XSEED Games", "release_date": "Jan 17 2017", "developers": ["Marvelous Inc."], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/c6ab775e14daf5ae9c842e4ed8e9bc07-98.jpg", "descriptions": "The Moon Cell Automaton is a spiritron computer, which exists on the moon and has the power to grant any wish. Throughout the spiritron-constructed virtual world, SE.RA.PH., Servants and the Masters who control them fight for the right to be the Moon Cell Automaton's sole owner in aThe Moon Cell Automaton is a spiritron computer, which exists on the moon and has the power to grant any wish. Throughout the spiritron-constructed virtual world, SE.RA.PH., Servants and the Masters who control them fight for the right to be the Moon Cell Automaton's sole owner in a ceremonial conflict known as the Holy Grail War. Now, the Servant Nero Claudius and her Master have won the Holy Grail War and have obtained the universal wishing mechanism, the Holy Grail. They also obtained the Regalia, a ring that proves their kingship. With it, they rule over their once-enemy Servants and start a new beginning on the moon's new world. But a new enemy has appeared before them. And this enemy has something that shouldn't exist: another Regalia. … Expand"}, {"name": "Adventure Time: Hey Ice King! Why'd You Steal Our Garbage?!", "details_link": "https://www.metacritic.com/game/3ds/adventure-time-hey-ice-king!-whyd-you-steal-our-garbage!", "publisher": "D3Publisher", "release_date": "Nov 13 2012", "developers": ["WayForward"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Fantasy", "General", "General", "Fantasy"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/2f899e96eed77b15fe13597e9d79dd4f-98.jpg", "descriptions": "Adventure Time: Hey Ice King! Why'd you steal our garbage?! is the first video game based on the radical, Emmy nominated Cartoon Network show about two close friends."}, {"name": "Legacy of Ys: Books I & II", "details_link": "https://www.metacritic.com/game/ds/legacy-of-ys-books-i-ii", "publisher": "Atlus", "release_date": "Feb 24 2009", "developers": ["Interchannel-Holon"], "platforms": ["PC", "DS"], "genres": ["Role-Playing", "Miscellaneous", "Action RPG", "Compilation", "Compilation"], "meta_score": 67, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/37263908cac17cfdba8ef39daa260098-98.jpg", "descriptions": "One of the most heralded action RPG franchises of all time, Legacy of Ys: Books I & II delivers the first two epic adventures of the famed saga on one cartridge, presented with a series of never-before-seen enhancements. [Atlus USA]"}, {"name": "ZooCube", "details_link": "https://www.metacritic.com/game/gamecube/zoocube", "publisher": "Acclaim", "release_date": "May  5 2002", "developers": ["PuzzleKings"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/0ae1f661a0ff27c0500d1af32b805808-98.jpg", "descriptions": "ZooCube tests your reflexes with fast-paced puzzle action. Simple to learn, but tough to master, ZooCube features a variety of 3D puzzles that you can solve by yourself or cooperatively with a friend. You can even challenge your friend in head-to-head multiplayer mode or try out 11 otherZooCube tests your reflexes with fast-paced puzzle action. Simple to learn, but tough to master, ZooCube features a variety of 3D puzzles that you can solve by yourself or cooperatively with a friend. You can even challenge your friend in head-to-head multiplayer mode or try out 11 other different modes. In this intense puzzle experience, you must rotate the puzzles and collect special power-ups and bonuses to keep the action going.… Expand"}, {"name": "Ar nosurge: Ode to an Unborn Star", "details_link": "https://www.metacritic.com/game/playstation-3/ar-nosurge-ode-to-an-unborn-star", "publisher": "Koei Tecmo Games", "release_date": "Sep 23 2014", "developers": ["Gust"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/c9ecf3860bf637e2b6682ea78b0b0357-98.jpg", "descriptions": "In AR NOSURGE: ODE TO AN UNBORN STAR, the player follows two sets of characters: Delta and Casty, whose goal is to protect humanity and save the world, and Ion & Earthes, who are trying to find Ion a way home to Earth. The player can interchange between both pairs and soon discover a way toIn AR NOSURGE: ODE TO AN UNBORN STAR, the player follows two sets of characters: Delta and Casty, whose goal is to protect humanity and save the world, and Ion & Earthes, who are trying to find Ion a way home to Earth. The player can interchange between both pairs and soon discover a way to combine their storylines and strengths to eventually solve the mystery that shrouds their ongoing struggle.… Expand"}, {"name": "Romance of the Three Kingdoms XIII", "details_link": "https://www.metacritic.com/game/playstation-4/romance-of-the-three-kingdoms-xiii", "publisher": "Koei Tecmo Games", "release_date": "Jul  5 2016", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/d56ad4a8bdda1aa7e55dc54094ace593-98.jpg", "descriptions": "With all officers playable, the lives of these colorful characters, the bonds created during battles, and much more combine to create a fresh new human drama. Strategy and battles, like naval battles and sieges, are done on a great scale, turning them into grand epic spectacles. We also useWith all officers playable, the lives of these colorful characters, the bonds created during battles, and much more combine to create a fresh new human drama. Strategy and battles, like naval battles and sieges, are done on a great scale, turning them into grand epic spectacles. We also use the vast expanse of China as a background to the “dynamism” of hundreds of characters each striving to expand their Force. All of this allows the player to experience the world of the Three Kingdoms like never before. The player becomes one of the characters of the Three Kingdoms drama and whether as a genius strategist, an unparalleled warrior, or something else, he must at times cooperate and at other times compete as he creates his own personal story of heroism in ancient China. [KOEI]… Expand"}, {"name": "Sega Superstars Tennis", "details_link": "https://www.metacritic.com/game/xbox-360/sega-superstars-tennis", "publisher": "Sega", "release_date": "Mar 18 2008", "developers": ["Sumo Digital"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/dc66e6b2c7e8587d66db75b40d15d666-98.jpg", "descriptions": "Sixteen fan-favorite SEGA characters from Sonic to NiGHTS are serving up fun in SEGA Superstars Tennis. Multiple madcap mini-games keep the party rolling and up to four friends can challenge each other in tournaments, exhibitions and unlockable special events. With hilarious cameos andSixteen fan-favorite SEGA characters from Sonic to NiGHTS are serving up fun in SEGA Superstars Tennis. Multiple madcap mini-games keep the party rolling and up to four friends can challenge each other in tournaments, exhibitions and unlockable special events. With hilarious cameos and comical guest umpires from SEGA's rich gaming history, this fun-filled tennis party promises to be a smashing good time for the whole family. Zany SEGA Characters with Superstar Abilities - Each of the 16 characters has their own superstar alter-ego, which gives them the winning edge on the court. Ten Fantastical Themed Courts - Guest umpires will supervise the action on a wide variety of colorful courts, from Sonic's lush Green Hill Zone to Ulala's galactic Space Channel 5 world, just to name a couple. Four Action-Packed Tournaments - As you slice your way through the competitive tournaments, you will unlock loads of bonus content. Classic Soundtrack - Faithfully recreated in full Dolby Digital 5.1, treasured SEGA tunes will entertain SEGA fans new and old. [Sega]… Expand"}, {"name": "Blazing Angels: Squadrons of WWII", "details_link": "https://www.metacritic.com/game/playstation-3/blazing-angels-squadrons-of-wwii", "publisher": "Ubisoft", "release_date": "Dec 12 2006", "developers": ["Ubisoft"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/b499182a7bcc825b4197d4dc775db593-98.jpg", "descriptions": "In Blazing Angels: Squadrons of WWII, players experience the most gripping and famous battles of WWII through the eyes of a squadron commander and ace fighter pilot. From the Battle of Britain, through the dramatic air combat of Pearl Harbor, the fierce fighting of Midway, and on to theIn Blazing Angels: Squadrons of WWII, players experience the most gripping and famous battles of WWII through the eyes of a squadron commander and ace fighter pilot. From the Battle of Britain, through the dramatic air combat of Pearl Harbor, the fierce fighting of Midway, and on to the European continent in the battle of Berlin, players can hone their pilot skills while creating WWII history. Dominate the skies of Western Europe and the Pacific and bring your squadron of Blazing Angels back alive. The game takes advantage of the PlayStation 3 system’s unique and powerful capabilities, including innovative use of the PlayStation 3 controller. New missions are introduced and the game features a 16-player multiplayer mode. [Ubisoft]… Expand"}, {"name": "Mount & Blade: Warband", "details_link": "https://www.metacritic.com/game/playstation-4/mount-blade-warband", "publisher": "Taleworlds Entertainment", "release_date": "Sep 13 2016", "developers": ["Koch Media", "Taleworlds Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 64 ", "genres": ["Role-Playing", "Western-Style"], "meta_score": 67, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/a5eeca56594bbee293256e821bd4af6f-98.jpg", "descriptions": "The first expansion pack for Mount & Blade introduces an array of brand-new features, highlighted by a multiplayer capability that allows up to 32 players to battle it out in team-deathmatch-style combat on a single map."}, {"name": "Say No! More", "details_link": "https://www.metacritic.com/game/switch/say-no!-more", "publisher": "Thunderful", "release_date": "Apr  9 2021", "developers": ["Fizbin", "Studio Fizbin"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/95367bfea99a47f41d2a2051ab2df2d2-98.jpg", "descriptions": "SAY NO! MORE is the world’s first NPG (NO!-Playing Game). Play as an intern with a burning desire to say NO! to everything and everyone. Customize your character, say NO! in different styles and languages, clap back at mean colleagues and change the world! WISHLIST TODAY!"}, {"name": "Warhammer 40,000: Inquisitor - Martyr", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-inquisitor---martyr", "publisher": "Games Workshop", "release_date": "Jun  5 2018", "developers": ["NeocoreGames"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/6112eb0b5de896cc72ad954e467f5536-98.jpg", "descriptions": "Enter the Chaos-infested Caligari Sector and purge the unclean with the most powerful agents of the Imperium of Man. Warhammer 40,000: Inquisitor – Martyr is a grim Action-RPG featuring multiple classes of the Inquisition who will carry out the Emperor’ will in the darkest reaches of theEnter the Chaos-infested Caligari Sector and purge the unclean with the most powerful agents of the Imperium of Man. Warhammer 40,000: Inquisitor – Martyr is a grim Action-RPG featuring multiple classes of the Inquisition who will carry out the Emperor’ will in the darkest reaches of the Imperium!… Expand"}, {"name": "Galleon: Islands of Mystery", "details_link": "https://www.metacritic.com/game/xbox/galleon-islands-of-mystery", "publisher": "Atlus Co.", "release_date": "Aug  3 2004", "developers": ["Confounding Factor"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/03aaadab325197b1ccb666906d8047a6-98.jpg", "descriptions": "Galleon takes you from the bustling port of Akbah to islands populated with giant monsters, evil slave lords, and damsels in distress. You'll follow Captain Rhama Sabrier as he investigates the origins of a mysterious ship that could hold the key to incredible powers and untold wealth.Galleon takes you from the bustling port of Akbah to islands populated with giant monsters, evil slave lords, and damsels in distress. You'll follow Captain Rhama Sabrier as he investigates the origins of a mysterious ship that could hold the key to incredible powers and untold wealth. Rhama's journey takes you to six island locations filled with action, exploration, and challenges. While the landscape can be harsh, you'll have Rhama's backflip and climbing skills and the abilities of your crew members to aid you on your journey.… Expand"}, {"name": "Cleopatra: Riddle of the Tomb", "details_link": "https://www.metacritic.com/game/pc/cleopatra-riddle-of-the-tomb", "publisher": "DreamCatcher Interactive", "release_date": "Mar 31 2008", "developers": ["DreamCatcher Interactive", "Dreamcatcher"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Fantasy", "Fantasy"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/173efd5902bbfd82ed6d29eaf9dc3c14-98.jpg", "descriptions": "(Also known as \"Cleopatra: Riddle of the Tomb\")  You are in the middle of a civil war in ancient Egypt, pitting Cleopatra's supporters against those of her brother and husband, Ptolemy, who is ravaging the country. In the midst of all this, you are a young apprentice to Akkad, Cleopatra's(Also known as \"Cleopatra: Riddle of the Tomb\")  You are in the middle of a civil war in ancient Egypt, pitting Cleopatra's supporters against those of her brother and husband, Ptolemy, who is ravaging the country. In the midst of all this, you are a young apprentice to Akkad, Cleopatra's chief astrologist and astronomist and you fall in love with your master's daughter. But one day, you discover that both of them have been kidnapped. You learn from Cleopatra that he has a prophecy that holds the fate of Egypt. Set out on their trail through the ruins of Egypt, including such legendary sites as the Library of Alexandria and the Lighthouse, all while meeting a whole host of mysterious characters. Can you save Egypt and its Queen, too?… Expand"}, {"name": "The Club", "details_link": "https://www.metacritic.com/game/pc/the-club", "publisher": "Sega", "release_date": "Feb 19 2008", "developers": ["Bizarre Creations"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 67, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/0a6e1cb05a34c72f19601be0a7973660-98.jpg", "descriptions": "The Club is a new breed of third-person shooter, combining fast-paced run and gun gameplay, destructive environments, lethal weapons and an in-depth story structure. You will fight to survive in a shadowy underground blood-sport controlled by a faceless, obscenely wealthy and influentialThe Club is a new breed of third-person shooter, combining fast-paced run and gun gameplay, destructive environments, lethal weapons and an in-depth story structure. You will fight to survive in a shadowy underground blood-sport controlled by a faceless, obscenely wealthy and influential elite who place their bets on who will survive as the blood-bath ensues before them. Take control of up to eight uniquely trained killers motivated by greed, driven by pure insane bloodlust, and hell bent on earning respect on a global level. As one of eight fighters, blast your way through five single player game modes including: Standard Mode, Time Attack, Survivor, Siege, and Run the Gauntlet. Earn Respect Online. Shoot your way to the top of the leader boards in over nine cut-throat multiplayer modes.  Face-off with 15 real-time opponents online. Battle in eight unique real-world locations from around the globe, including war-torn cities, abandoned factories, steel mills and many more. Extreme Gun Battles in Hazardous Environments: A motion blur camera system intensifies the adrenaline rush in both open range and close quarter firefights. Destroy and manipulate objects in the environment to your advantage. A unique score-based accumulation system creates even more competition among players; the faster, more efficient and accurate that you are, the more points you will earn to unlock weapons, characters and maps. There are 17 high-powered assault weapons to choose from and customize, including Automatic Weapons, Sniper Rifles, High Caliber Pistols, Sub Machine Guns, and Mounted Weapons. Each Character has a Story to Tell. [Sega]… Expand"}, {"name": "Call of Cthulhu", "details_link": "https://www.metacritic.com/game/pc/call-of-cthulhu", "publisher": "Focus Home Interactive", "release_date": "Oct 29 2018", "developers": ["Cyanide", "Cyanide Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Survival"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/c3b18128e4131f1efb80d3e501c8e49f-98.jpg", "descriptions": "Plunge into Cyanide Studio's Call of Cthulhu, the official Cthulhu videogame inspired by Chaosium's classic pen and paper RPG. Uncover the chilling mysteries of this RPG-investigation game, descending deep into a world of cosmic horrors, creeping madness, and shrouded Old Gods withinPlunge into Cyanide Studio's Call of Cthulhu, the official Cthulhu videogame inspired by Chaosium's classic pen and paper RPG. Uncover the chilling mysteries of this RPG-investigation game, descending deep into a world of cosmic horrors, creeping madness, and shrouded Old Gods within Lovecraft's iconic universe.\r The Cthulhu Mythos has been fascinating audiences for generations, growing to become one of the largest shared universes ever envisioned and giving birth to countless stories, novels, movies, tabletop and videogames since the original publication of H.P. Lovecraft's The Call of Cthulhu. Adaptions and references have formed a widespread legacy stretching back to the very beginning of the 20th century, latching on to the key fear of the human psyche: that of the unknown. Now, Call of Cthulhu will bring the mythos to life like never before, on PlayStation 4, Xbox One and PC.\r In this world, nothing is as it seems. Sanity is an irregular bedfellow, all too often replaced by the whisperings in the dark. Strange creatures, weird science, and shadowy cults dominate the Cthulhu Mythos, intent on realizing their mad schemes to bring about the end of everything. Your mind will suffer -- balancing a razor-thin line between sanity and madness, your senses will be disrupted until you question the reality of everything around you. Trust no one. Creeping shadows hide lurking figures... and all the while, the Great Dreamer prepares for his awakening.… Expand"}, {"name": "MySims SkyHeroes", "details_link": "https://www.metacritic.com/game/wii/mysims-skyheroes", "publisher": "Electronic Arts", "release_date": "Sep 28 2010", "developers": ["Electronic Arts", "Behaviour Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 67, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/5a48c1e6accd3da9ebd92da4f6e79a98-98.jpg", "descriptions": "In MySims SkyHeroes, players take to the sky to lead the resistance against Morcubus and his drone army and to stop his plans to take over the skyways. Starting as an unknown pilot, players fight to become a celebrated hero as they defeat dangerous enemies in aerial combat, test theirIn MySims SkyHeroes, players take to the sky to lead the resistance against Morcubus and his drone army and to stop his plans to take over the skyways. Starting as an unknown pilot, players fight to become a celebrated hero as they defeat dangerous enemies in aerial combat, test their reflexes in fast-paced speed challenges, and take on massive enemy bosses that demand all their skills as a pilot to survive. As they progress, players build, customize and tune their aircraft to give them an edge in combat – upgrade wings for swifter maneuvers, switch out the engine for a speed boost, or change the paint job to camouflage the plane and avoid enemy fire.… Expand"}, {"name": "Nerf N-Strike Elite", "details_link": "https://www.metacritic.com/game/wii/nerf-n-strike-elite", "publisher": "Electronic Arts", "release_date": "Oct 26 2009", "developers": ["EA Salt Lake"], "platforms": "Wii", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 67, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/6/db94013026e734835b5b7bf400e5d1ab-98.jpg", "descriptions": "NERF 2: N-Strike Elite features a classic rail shooter style of gameplay and equip players with a cache of fresh features. With the Wii-remote snapped into the NERF SWITCH SHOT EX-3 blaster and the red reveal lens engaged, players can detect enemy weak spots, solve puzzles and decode secretNERF 2: N-Strike Elite features a classic rail shooter style of gameplay and equip players with a cache of fresh features. With the Wii-remote snapped into the NERF SWITCH SHOT EX-3 blaster and the red reveal lens engaged, players can detect enemy weak spots, solve puzzles and decode secret messages as they blast their way to victory.  Boys in the target age range of 8 to 12 will jump into battle as one of four playable characters, each with their own unique customizable blasters and abilities. For those players who find themselves in a melee that requires back-up, NERF 2: N-Strike Elite includes two-player co-op, allowing buddies to immediately jump in and join the crusade.  Players can also interact with a veritable army of robots including B.O.B., the same recruiting robot from the first NERF N-Strike game. [Electronic Arts]… Expand"}, {"name": "Fuel", "details_link": "https://www.metacritic.com/game/pc/fuel", "publisher": "Codemasters", "release_date": "Jun 23 2009", "developers": ["Asobo Studio"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "General", "General"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/f165944ad7e03e33bdf2ea9ce5b32065-98.jpg", "descriptions": "Get fuelled up and prepare to race and explore the world's largest ever racing environment - over 5,000 square miles of spectacular wilderness. Set to revolutionise multi-terrain, multi-vehicle racing, FUEL is a fiercely competitive game without boundaries. On and off-road, two andGet fuelled up and prepare to race and explore the world's largest ever racing environment - over 5,000 square miles of spectacular wilderness. Set to revolutionise multi-terrain, multi-vehicle racing, FUEL is a fiercely competitive game without boundaries. On and off-road, two and four-wheeled vehicles race a massively diverse environment, from scaling the highest snow-capped mountain to racing the deepest arid canyon. In a fictional present, vast swathes of the United States have been ravaged by the extreme effects of accelerated global warming: tornados, brush fires, hurricanes and tsunamis have driven people from their homes leaving huge areas of America abandoned. Now these dangerous areas have created the perfect playground for a new breed of adrenaline junkies who set out to conquer each other, and Mother Nature, in closely fought races. There are over 70 different vehicles with which to take on any challenge that FUEL’s stunning environment throws at you. On-road and off-road bikes, cars, quads, trucks, buggies and dragsters take dangerous short-cuts, perform death-defying jumps and tear through spectacular cross-over points. FUEL's landscape is powered by cutting-edge technology and, using satellite data, features some of the most exciting and inspiring areas of America - including the Grand Canyon, Yosemite National Park, Mount Rainier and much more. In FUEL, if you can see it, you can drive to it, taking any route - on or off-road - that you want.  With a draw distance of 40KM, 100,000 miles of roads, tracks and trails and hundreds of race events FUEL’s epic world demands to be explored. [Codmasters]… Expand"}, {"name": "Mahjong Cub3d", "details_link": "https://www.metacritic.com/game/3ds/mahjong-cub3d", "publisher": "Atlus", "release_date": "Oct 11 2011", "developers": ["SunSoft"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Matching", "Board Games", "Board / Card Game", "General", "General"], "meta_score": 67, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/acea952c1fb6b685c3477f9aede108ed-98.jpg", "descriptions": "With 200 Mahjong matching puzzles, delivered in full, vibrant 3D through the power of Nintendo 3DS, MAHJONG CUB3D offers colorful, meditative, challenging puzzle gameplay that's easy to pick up and impossible to set down! Three amazing game modes, including the 2-player Versus, add value toWith 200 Mahjong matching puzzles, delivered in full, vibrant 3D through the power of Nintendo 3DS, MAHJONG CUB3D offers colorful, meditative, challenging puzzle gameplay that's easy to pick up and impossible to set down! Three amazing game modes, including the 2-player Versus, add value to an overall package that fires out from every angle.… Expand"}, {"name": "Resident Evil Code: Veronica X HD", "details_link": "https://www.metacritic.com/game/xbox-360/resident-evil-code-veronica-x-hd", "publisher": "Capcom", "release_date": "Sep 27 2011", "developers": ["Capcom"], "platforms": ["PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 67, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/fd1f83b937fec93b555403e75c41a8c7-98.jpg", "descriptions": "Experience another terrifying chapter in the Resident Evil series with Resident Evil: Code Veronica X.  After narrowly surviving the horrific onslaught in Raccoon City, Claire Redfield now seeks clues in search of her missing brother, Chris.  Join Claire as she uncovers the insidiousExperience another terrifying chapter in the Resident Evil series with Resident Evil: Code Veronica X.  After narrowly surviving the horrific onslaught in Raccoon City, Claire Redfield now seeks clues in search of her missing brother, Chris.  Join Claire as she uncovers the insidious activities of the Umbrella Corporation.   Avoid or eliminate flesh-eating zombies and horrific beasts.  Use a variety weapons, items, and clues scattered around Raccoon City to help you survive the nightmare and make sure the virus doesn't spread any farther.… Expand"}, {"name": "SimCity Creator", "details_link": "https://www.metacritic.com/game/wii/simcity-creator", "publisher": "EA Games", "release_date": "Sep 22 2008", "developers": ["Electronic Arts"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Strategy", "Breeding/Constructing", "General", "Management", "Breeding/Constructing", "Government"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/19a3b125e91de9f0f7c4ee4ce1b459a8-98.jpg", "descriptions": "Be a powerful mayor -- create, enjoy and destroy your ultimate city. Start by zoning your city, constructing homes, businesses, factories, skyscrapers, freeways, railroads, and much more. SimCity Creator is a visually exciting experience with a completely new user interface, designedBe a powerful mayor -- create, enjoy and destroy your ultimate city. Start by zoning your city, constructing homes, businesses, factories, skyscrapers, freeways, railroads, and much more. SimCity Creator is a visually exciting experience with a completely new user interface, designed specifically for the Wii and the Wii remote. You'll discover many ways to customize your city, including 13 city styles to explore, such as American, European and Asian themes. You can also place a selection of more than 30 \"Hero\" buildings into your city to make it distinctive and momentous. Some of these iconic buildings are based on the current day, some on history and some on fantasy. The more city styles you explore, the more Hero building options you have. For the first time, take the liberty to build transportation systems with free placement of rounded and curved roads and rail lines, taking your city to new creative and curvy heights. And get a new perspective on your cityscape from a helicopter, a jet or a propeller plane which you can use to fly over your creation. Check out what you've built in your aircraft of choice. Disasters that players of SimCity always love remain an important and entertaining element in SimCity Creator. Using the Wii remote you can create earthquakes, tornados, call in destructive robots and monsters, create fires and discover many more ways to cause havoc. You created it, and now you can destroy it. [Electronic Arts]… Expand"}, {"name": "Session: Skate Sim", "details_link": "https://www.metacritic.com/game/playstation-5/session-skate-sim", "publisher": "Maximum Games", "release_date": "Sep 22 2022", "developers": ["Crea-ture Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 67, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/1/47a7d11249429adfb6ee5983bfd160d5-98.jpg", "descriptions": "Inspired by the golden era of skateboarding, Session's primary goal is to make you experience what skateboarding really is; an incredible culture where there are no other goals other than expressing your creativity and achieving success through hard work, perseverance and bits of madness forInspired by the golden era of skateboarding, Session's primary goal is to make you experience what skateboarding really is; an incredible culture where there are no other goals other than expressing your creativity and achieving success through hard work, perseverance and bits of madness for no one else other than yourself.\r Be ready to play the most authentic and grounded skateboarding experience in the most legendary spots on earth, film and make the gnarliest skate parts out there.\r Don't be fooled by copycats and experience the real pioneering dual stick board control feature! Session offers for the first time a per foot stick control giving you the full power in your hands where each stick represents a foot. Careful though, skating switch now has a real meaning.\r Filming has always been a big part of the skateboarding culture. With Session's video editor players can perform their tricks; edit, and create a montage in-game.\r Explore the best and most iconic skate spots, starting with New-York which helped shape what street skating is today. Recreated on a 1:1 scale and supported by grounded and realistic skate physics, get the feel of what it is to skate the infamous Brooklyn Banks and our fresh twist of the surrounding financial district of Manhattan.\"… Expand"}, {"name": "Mini-Mech Mayhem", "details_link": "https://www.metacritic.com/game/playstation-4/mini-mech-mayhem", "publisher": "FuturLab", "release_date": "Jun 18 2019", "developers": ["FuturLab"], "platforms": "PlayStation 4", "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 67, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/72e409a0bcf39eee5950d6894084413d-98.jpg", "descriptions": "Join your lil’ Mech buddy to plan a flawless strategy, then marvel at just how wrong you were. Not to worry, play some power actions to get your team back on track, or dare to trust in your instincts and crafty skills, and pull off a stunning win."}, {"name": "Pro Cycling Manager Season 2014: Le Tour de France", "details_link": "https://www.metacritic.com/game/pc/pro-cycling-manager-season-2014-le-tour-de-france", "publisher": "Focus Home Interactive", "release_date": "Jun 19 2014", "developers": ["Cyanide"], "platforms": "PC", "genres": ["Sports", "Alternative", "Individual", "Biking"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/ee2ced1403c39a8417e56efa996028ab-98.jpg", "descriptions": "Assume the role of manager and lead one of the pro cycling circuit's 75 teams. Join an outstanding 2014 season with more than 200 competitions across 550 stages including the prestigious Tour de France."}, {"name": "Exit the Gungeon", "details_link": "https://www.metacritic.com/game/pc/exit-the-gungeon", "publisher": "Devolver Digital", "release_date": "Mar 17 2020", "developers": ["Dodge Roll"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/11be622d329971e7efea4ada469f80e8-98.jpg", "descriptions": "Exit the Gungeon is a bullet hell dungeon climber immediately following the adventures of the misfit ‘Gungeoneers’ and their journey for personal absolution in Enter the Gungeon."}, {"name": "Weedcraft Inc", "details_link": "https://www.metacritic.com/game/pc/weedcraft-inc", "publisher": "Devolver Digital", "release_date": "Apr 11 2019", "developers": ["Vile Monarch"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/6182259a05128fe2bd1471c476b3850d-98.jpg", "descriptions": "Whether you choose to hobnob with politicians, grease the police, fight for medical rights or work the legal system, it's all in the name of the sticky icky and your cutthroat corporate profits."}, {"name": "Tony Hawk's Project 8", "details_link": "https://www.metacritic.com/game/xbox/tony-hawks-project-8", "publisher": "Activision", "release_date": "Nov  7 2006", "developers": ["Shaba Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 67, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/ab836141ad75c8ae744fb420c646b4de-98.jpg", "descriptions": "Reengineered from the ground up, Tony Hawk's Project 8 immerses players in the definitive skateboarding experience using ultra-realistic graphics, enhanced physics and responsive controls that simulate the feeling of skating with every trick and bail. The game challenges players toReengineered from the ground up, Tony Hawk's Project 8 immerses players in the definitive skateboarding experience using ultra-realistic graphics, enhanced physics and responsive controls that simulate the feeling of skating with every trick and bail. The game challenges players to experience the intensity and pressure of skating against some of the world's top pros in true to life competitions as they aim to become the #1 skater.… Expand"}]