[{"name": "Dusk Diver", "details_link": "https://www.metacritic.com/game/playstation-4/dusk-diver", "publisher": "PQube", "release_date": "Oct 29 2019", "developers": ["JFi Games"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/17d3daca52a07c04029dbf5c5ee7aa7c-98.jpg", "descriptions": "When an unstable dimensional rift brings together Gods, Phantoms and Humans, headstrong highschool girl Yang Yumo must step up to protect the neighborhood. Fight alongside your guardians as part of a dynamic action-oriented combat system in the bustling streets, stores, personalities andWhen an unstable dimensional rift brings together Gods, Phantoms and Humans, headstrong highschool girl Yang Yumo must step up to protect the neighborhood. Fight alongside your guardians as part of a dynamic action-oriented combat system in the bustling streets, stores, personalities and even cuisines of Taipei.… Expand"}, {"name": "Dragon Ball Z Budokai HD Collection", "details_link": "https://www.metacritic.com/game/playstation-3/dragon-ball-z-budokai-hd-collection", "publisher": "Namco Bandai Games", "release_date": "Nov  6 2012", "developers": ["Pyramid"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/e18c5a7d512d1cfe8b3b7fc185910cfe-98.jpg", "descriptions": "The Dragon Ball Z Budokai HD Collection includes two blockbuster fighting games based on the Dragon Ball Z anime series. Included are Dragon Ball Z Budokai and Dragon Ball Z Budokai 3.Dragon Ball Z Budokai --- Fight to the finish against the deadliest fighters in the universe and take onThe Dragon Ball Z Budokai HD Collection includes two blockbuster fighting games based on the Dragon Ball Z anime series. Included are Dragon Ball Z Budokai and Dragon Ball Z Budokai 3.Dragon Ball Z Budokai --- Fight to the finish against the deadliest fighters in the universe and take on the most powerful heroes and the most evil villains in Dragon Ball Z. The more you win, the more difficult it gets. Can you survive?Dragon Ball Z Budokai 3 -- A \"Hall of Fame\" cast of warriors from Dragon Ball Z, Dragon Ball GT, and DBZ movies come together for a tournament of champions. With the power of the new Saiyan Overdrive Fighting System, players have unprecedented gameplay control and Dragon Ball Z authenticity.… Expand"}, {"name": "Conduit 2", "details_link": "https://www.metacritic.com/game/wii/conduit-2", "publisher": "Sega", "release_date": "Apr 19 2011", "developers": ["High Voltage Software"], "platforms": "Wii", "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 64, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/82e6a326014667886d0ebb4134d89127-98.jpg", "descriptions": "Building upon the success of the original, Conduit 2 will take players to the far reaches of the world to stop an alien invasion that can be fought in single-player, online multi-player battles, and all-new off and online co-op modes.  Armed with advanced and powerful weapons, players canBuilding upon the success of the original, Conduit 2 will take players to the far reaches of the world to stop an alien invasion that can be fought in single-player, online multi-player battles, and all-new off and online co-op modes.  Armed with advanced and powerful weapons, players can expect massive action in large, multi-tiered levels featuring dynamic environments, cinematic battles, giant boss enemies, and deep customization features. … Expand"}, {"name": "Defiance", "details_link": "https://www.metacritic.com/game/pc/defiance", "publisher": "Trion Worlds", "release_date": "Apr  2 2013", "developers": ["Trion Worlds"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Sci-Fi", "Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/a9268e9e25cb0f9f39559540a8498b49-98.jpg", "descriptions": "Shoot any way you'd like, with a myriad of weapons, armor, and special abilities that evolve with experience. Custom character creation means you can play as human or alien, modifying your look to become a unique citizen of the Defiance world. Fight to survive in a consistently evolvingShoot any way you'd like, with a myriad of weapons, armor, and special abilities that evolve with experience. Custom character creation means you can play as human or alien, modifying your look to become a unique citizen of the Defiance world. Fight to survive in a consistently evolving environment with regular content updates and dynamic events. Play on your own, or join tens of thousands of simultaneous live players in a futuristic San Francisco Bay Area that’s a fully-realized open world.… Expand"}, {"name": "Battles of Prince of Persia", "details_link": "https://www.metacritic.com/game/ds/battles-of-prince-of-persia", "publisher": "Ubisoft", "release_date": "Dec  6 2005", "developers": ["Ubisoft Montreal"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 64, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/bb3325725d529704801576475128343e-98.jpg", "descriptions": "Battles of Prince of Persia’s storyline takes place between \"Prince of Persia The Sands of Time\" and \"Prince of Persia: Warrior Within.\"  The game focuses on the appearance of the Dahaka and how the Prince, while trying to rid himself of the terrible creature, ignites a conflict betweenBattles of Prince of Persia’s storyline takes place between \"Prince of Persia The Sands of Time\" and \"Prince of Persia: Warrior Within.\"  The game focuses on the appearance of the Dahaka and how the Prince, while trying to rid himself of the terrible creature, ignites a conflict between Persia and India by releasing an ancient evil that has caused much death and devastation.  Players can battle it out from not only the Prince’s perspective, but also from that of several Generals who hold key roles in the conflict between the nations. Game features include: New depth in tactical gameplay: A host of original rules bring a fresh depth to tacticals games. Collect and trade cards: By advancing in the single player mode, collect money and purchase new cards to trade and make more powerful decks. Don’t like your cards? Trade them with your friends. Play any of the nine Generals in single player or in multiplayer. Create the army you want from any of the three factions and 27 units. Fully customizable multiplayer mode ensures replay value. Challenge someone who has the game or someone who doesn’t in either Multiboot mode or Hotseat. [Ubisoft]… Expand"}, {"name": "Star Wars Jedi Knight II: Jedi Outcast", "details_link": "https://www.metacritic.com/game/switch/star-wars-jedi-knight-ii-jedi-outcast", "publisher": "Aspyr", "release_date": "Sep 24 2019", "developers": ["Aspyr", "Aspire"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 64, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/0/fb2deb39638683ffd8c84b483dabfcca-98.jpg", "descriptions": "In the tradition of Jedi Knight, rebel agent Kyle Katarn returns in thrilling first-person action. Several years have passed since Kyle avenged his father's death and saved the Valley of the Jedi from Jerec and his band of Dark Jedi. When a new and menacing threat to the galaxy emerges, KyleIn the tradition of Jedi Knight, rebel agent Kyle Katarn returns in thrilling first-person action. Several years have passed since Kyle avenged his father's death and saved the Valley of the Jedi from Jerec and his band of Dark Jedi. When a new and menacing threat to the galaxy emerges, Kyle knows he must reclaim his past in order to save his future. You assume the role of Kyle and employ a unique mix of weapons, Force powers, and your lightsaber in both solo and multiplayer modes.… Expand"}, {"name": "Tokyo Twilight Ghost Hunters: Daybreak Special Gigs", "details_link": "https://www.metacritic.com/game/playstation-4/tokyo-twilight-ghost-hunters-daybreak-special-gigs", "publisher": "Aksys Games", "release_date": "Sep 20 2016", "developers": ["Arc System Works", "Now Production"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/242d375c678a44e3f0426c8c0cb19562-98.jpg", "descriptions": "Tokyo Twilight Ghost Hunters Daybreak: Special Gigs weaves an intricate story that pushes the boundaries of reality as you battle restless spirits causing chaos throughout Tokyo!"}, {"name": "Master of Orion 3", "details_link": "https://www.metacritic.com/game/pc/master-of-orion-3", "publisher": "Atari", "release_date": "Feb 25 2003", "developers": ["Quicksilver Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "4X"], "meta_score": 64, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/8/a6bbac694dae79ca8d0a4d40d6eb0f24-98.jpg", "descriptions": "On Master of Orion 3, you become the controlling force behind an entire galactic civilization. It is not enough to be an able economist or a great captain to succeed; political, administrative, and espionage skills must be applied to craft your civilization's glorious chapter in the annalsOn Master of Orion 3, you become the controlling force behind an entire galactic civilization. It is not enough to be an able economist or a great captain to succeed; political, administrative, and espionage skills must be applied to craft your civilization's glorious chapter in the annals of time and space and claim the rightful title of \"Master of Orion\".… Expand"}, {"name": "Fallout: New Vegas - Honest Hearts", "details_link": "https://www.metacritic.com/game/xbox-360/fallout-new-vegas---honest-hearts", "publisher": "Bethesda Softworks", "release_date": "May 17 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/7312ad29e03cb9d4e8109a30b87f9643-98.jpg", "descriptions": "Honest Hearts takes you on an expedition to the unspoiled wilderness of Utah's Zion National Park. Things go horribly wrong when your caravan is ambushed by a tribal raiding band. As you try to find a way back to the Mojave, you become embroiled in a war between tribes and a conflict betweenHonest Hearts takes you on an expedition to the unspoiled wilderness of Utah's Zion National Park. Things go horribly wrong when your caravan is ambushed by a tribal raiding band. As you try to find a way back to the Mojave, you become embroiled in a war between tribes and a conflict between a New Canaanite missionary and the mysterious Burned Man. The decisions you make will determine the fate of Zion.… Expand"}, {"name": "Cloudpunk", "details_link": "https://www.metacritic.com/game/playstation-4/cloudpunk", "publisher": "Merge Games", "release_date": "Oct 15 2020", "developers": ["ION LANDS"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "Vehicle", "Open-World", "Civilian"], "meta_score": 64, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/c597443dad2219a8ee777070c2518221-98.jpg", "descriptions": "Your name is Rania. This is your first night working for Cloudpunk, the semi-legal delivery company based in the sprawling city of Nivalis. You go everywhere, from the Marrow below to the spires that pierce the grey clouds high above before scraping the edge of the troposphere. No deliveryYour name is Rania. This is your first night working for Cloudpunk, the semi-legal delivery company based in the sprawling city of Nivalis. You go everywhere, from the Marrow below to the spires that pierce the grey clouds high above before scraping the edge of the troposphere. No delivery job is too dangerous, and no one is faster than a Cloudpunk driver.In this story-based exploration game, you will meet a diverse range of characters including androids, AI and unscrupulous humans at every level of society. Everyone has a story, and in the course of one night in Nivalis, everything will change.… Expand"}, {"name": "Cargo! The Quest for Gravity", "details_link": "https://www.metacritic.com/game/pc/cargo!-the-quest-for-gravity", "publisher": "Viva Media", "release_date": "Apr 21 2011", "developers": ["Ice-Pick Lodge"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Fantasy", "General", "General", "Fantasy"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/32e804a6ef90cd12f78b300e5560eecb-98.jpg", "descriptions": "In Cargo, you will be asked to put your creativity to work as you build up wacky machines that fly and dive as you garner enough fun to restore gravity back to our planet.  Search for Cargo floating around and use this debris – from the Statue of Liberty to Big Ben and the Eiffel Towner toIn Cargo, you will be asked to put your creativity to work as you build up wacky machines that fly and dive as you garner enough fun to restore gravity back to our planet.  Search for Cargo floating around and use this debris – from the Statue of Liberty to Big Ben and the Eiffel Towner to stake out new lands.  Boasting a completely fresh and unique look, the game story hooks in players as it combines physics based puzzles solving with insanely addictive game play.  Players will be challenged to think and use their solutions in this outrageous game where gravity and creativity meets fun!… Expand"}, {"name": "theHunter: Call of the Wild", "details_link": "https://www.metacritic.com/game/pc/thehunter-call-of-the-wild", "publisher": "Avalanche Studios", "release_date": "Feb 16 2017", "developers": ["Expansive Worlds"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Sports", "Individual", "Nature", "Hunting"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/a707848bda7043d2e90ed2e9a50cbed7-98.jpg", "descriptions": "Experience the thrill of the hunt in a vast open world. Immerse yourself in the atmospheric single player campaign, or share the ultimate hunting experience with friends."}, {"name": "StarDrone", "details_link": "https://www.metacritic.com/game/playstation-3/stardrone", "publisher": "Beatshapers", "release_date": "Apr  5 2011", "developers": ["Beatshapers"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "PlayStation 3"], "genres": ["Action", "General", "General", "Arcade"], "meta_score": 64, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/78de15e7a34f9b34e475622cfbb5aa5b-98.jpg", "descriptions": "StarDrone is a high-speed action thriller with a mix of arcade action, pinball, breakout, physics and collect-the-objects. It is created for PlayStation Move motion controller and supports HDTV and stereoscopic 3D. The game features over 50 levels of unparalleled gaming experience andStarDrone is a high-speed action thriller with a mix of arcade action, pinball, breakout, physics and collect-the-objects. It is created for PlayStation Move motion controller and supports HDTV and stereoscopic 3D. The game features over 50 levels of unparalleled gaming experience and extraordinary replay value.\rCause your attackers to crash with rapid speed while collecting gems and power-up enhancements. Overcome perilous hazards and elude zillions of enemies in an effort to complete each stage with a record score. With simple gesture controls and unique, intuitive game play mechanics, StarDrone is friendly to beginners, at the same time challenging enough to bring you back for more and more.… Expand"}, {"name": "Fallout: Brotherhood of Steel", "details_link": "https://www.metacritic.com/game/playstation-2/fallout-brotherhood-of-steel", "publisher": "Interplay", "release_date": "Jan 14 2004", "developers": ["Interplay"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/7/74f96d2ce257228aaf4318f5a202c5ee-98.jpg", "descriptions": "In this gritty and darkly humorous 3rd person action adventure, players join the courageous Brotherhood of Steel, whose mission is to maintain peace in the grim post-apocalyptic world of Fallout. Battling raiders, mutants and a host of radioactive nightmares, players attempt to save theIn this gritty and darkly humorous 3rd person action adventure, players join the courageous Brotherhood of Steel, whose mission is to maintain peace in the grim post-apocalyptic world of Fallout. Battling raiders, mutants and a host of radioactive nightmares, players attempt to save the scattered remnants of the human race. Life is hard, mutation is rampant and the closet thing to law and order is the fusion-powered pistol that you carry on your hip. [Vivendi Universal]… Expand"}, {"name": "Mission: Impossible: Operation Surma", "details_link": "https://www.metacritic.com/game/playstation-2/mission-impossible-operation-surma", "publisher": "Atari", "release_date": "Dec  8 2003", "developers": ["Paradigm Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 64, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/0a4efae38fe4e8da1a53fb44cec1ebf3-98.jpg", "descriptions": "Your mission, should you choose to accept it, is to save the free world from certain doom! Ethan Hunt is back in Mission: Impossible Operation Surma, a stealth-action adventure featuring an incredible arsenal of the latest weaponry, hi-tech gadgets and mind-blowing disguises. Ethan and hisYour mission, should you choose to accept it, is to save the free world from certain doom! Ethan Hunt is back in Mission: Impossible Operation Surma, a stealth-action adventure featuring an incredible arsenal of the latest weaponry, hi-tech gadgets and mind-blowing disguises. Ethan and his IMF team travel to exotic international locations in an effort to thwart the Surma Corporation's diabolical plans for global domination. Throughout your mission, you?ll be called upon to use your brains and brawn to get the job done. Play as Ethan Hunt, leading your IMF team through a stealth-action Mission: Impossible adventure. Use shadows and stealth to infiltrate enemy fortifications and incapacitate enemies. Utilize classic IMF-style gadgets including scanners, inner-ear communicators and hi-tech IMF disguises. Control gameplay with multiple paths toward completing each mission. Tackle missions in exotic locations. Encounter more than 11 characters within an in-depth storyline. [Atari]… Expand"}, {"name": "Heroes of Might and Magic IV: The Gathering Storm", "details_link": "https://www.metacritic.com/game/pc/heroes-of-might-and-magic-iv-the-gathering-storm", "publisher": "3DO", "release_date": "Sep 27 2002", "developers": ["3DO"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General"], "meta_score": 64, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/fe94b79cca55c6094516a0df900a221d-98.jpg", "descriptions": "The Gathering Storm includes six entirely new campaigns which tell the tale of five heroes and their quest to defeat a mad wizard named Hexis, whose control of the realms of Nature and Death have begun a chain of events that threaten not just the heroes' own kingdom of Devonshire, but all ofThe Gathering Storm includes six entirely new campaigns which tell the tale of five heroes and their quest to defeat a mad wizard named Hexis, whose control of the realms of Nature and Death have begun a chain of events that threaten not just the heroes' own kingdom of Devonshire, but all of the lands of Lodwar. As Hexis's strength grows, so does his negative effect on nature itself. Earthquakes, floods, storms, and more have begun to spread across the kingdom, and it is up to the five heroes to stop Hexis and somehow reverse the damage he has done. [3DO]… Expand"}, {"name": "ESPN Winter X-Games Snowboarding 2002", "details_link": "https://www.metacritic.com/game/playstation-2/espn-winter-x-games-snowboarding-2002", "publisher": "Konami", "release_date": "Jan 14 2002", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 64, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/49093de896744ed4a6d2dd1489b43acf-98.jpg", "descriptions": "Ride on 30 new courses with big kickers and twisted rails for intense arcade action. Learn new tricks and build your charisma points in order to get noticed by sponsors. Fly the world for competitions, film shoots and heli-boarding trips in your quest to compete at the X Games. Ride as oneRide on 30 new courses with big kickers and twisted rails for intense arcade action. Learn new tricks and build your charisma points in order to get noticed by sponsors. Fly the world for competitions, film shoots and heli-boarding trips in your quest to compete at the X Games. Ride as one of 13 real pro riders including X Games medal winners Peter Line, Tina Basich and Danny Kass. Extra DVD features include over 35 minutes of snowboarding films and killer music. [Konami]… Expand"}, {"name": "Silent Scope 2: Dark Silhouette", "details_link": "https://www.metacritic.com/game/playstation-2/silent-scope-2-dark-silhouette", "publisher": "Konami", "release_date": "Sep 18 2001", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Rail"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/2c18a101f394a28e74cf624bacc6b3fe-98.jpg", "descriptions": "Using weapons like the Thermal Vision Scope and X-Ray Scope (without the use of a light gun peripheral), Dark Silhouette pits the player against enemy terrorists in four single & two-player modes of play, including Story, Shooting Range, Duel, and Original."}, {"name": "Heroes of Might and Magic: Quest for the Dragon Bone Staff", "details_link": "https://www.metacritic.com/game/playstation-2/heroes-of-might-and-magic-quest-for-the-dragon-bone-staff", "publisher": "3DO", "release_date": "Apr 18 2001", "developers": ["New World Computing"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "PC-style RPG"], "meta_score": 64, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/0737f896b16328784e443b6ffbc3489e-98.jpg", "descriptions": "The venerable \"Heroes of Might and Magic\" series arrives from the PC, shedding its 2D and turn-based roots while maintaining a traditional RPG storyline -- find the cure for your poisoned king."}, {"name": "Jagged Alliance 2: Unfinished Business", "details_link": "https://www.metacritic.com/game/pc/jagged-alliance-2-unfinished-business", "publisher": "Interplay", "release_date": "Nov 30 2000", "developers": ["Sir-Tech Software Inc."], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Modern", "Tactics"], "meta_score": 64, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/9f03d1899aa55da9ba4628d62b9ae65c-98.jpg", "descriptions": "The bullets have stopped flying. Arulco is free at last, but your job's not over. An all-powerful corporation is assaulting the tiny country and, once again, you're needed! Enter a whole new chapter of Jagged Alliance 2 with all new weapons, new mercenaries, new terrains, and the new MissionThe bullets have stopped flying. Arulco is free at last, but your job's not over. An all-powerful corporation is assaulting the tiny country and, once again, you're needed! Enter a whole new chapter of Jagged Alliance 2 with all new weapons, new mercenaries, new terrains, and the new Mission Builder!  [Interplay]… Expand"}, {"name": "Harry Potter and the Half-Blood Prince", "details_link": "https://www.metacritic.com/game/xbox-360/harry-potter-and-the-half-blood-prince", "publisher": "EA Games", "release_date": "Jun 30 2009", "developers": ["EA Bright Light"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 64, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/6/2b55f59bb8669dcce24c6be695adb976-98.jpg", "descriptions": "In Harry Potter and the Half-Blood Prince, Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the finalIn Harry Potter and the Half-Blood Prince, Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle that he knows is fast approaching. Together they work to find the key to unlock Voldemort's defenses and, to this end, Dumbledore recruits his old friend and colleague, the well-connected and unsuspecting bon vivant Professor Horace Slughorn, whom he believes holds crucial information. Meanwhile, the students are under attack from a very different adversary as teenage hormones rage across the ramparts. Harry finds himself more and more drawn to Ginny, but so is Dean Thomas. And Lavender Brown has decided that Ron is the one for her, only she hadn't counted on Romilda Vane's chocolates! And then there's Hermione, simmering with jealously but determined not to show her feelings. As romance blossoms, one student remains aloof. He is determined to make his mark, albeit a dark one. Love is in the air, but tragedy lies ahead and Hogwarts may never be the same again. In the game, players return to Hogwarts to help Harry survive a fraught sixth year. They also have a chance to engage in exciting wizard duels, mix and brew magical ingredients in Potions class and take to the air to lead the Gryffindor Quidditch team to victory. Players may even get sidetracked by Ron's romantic entanglements as they journey towards a dramatic climax and discover the identity of the Half-Blood Prince. [Electronic Arts]… Expand"}, {"name": "Metroid Prime: Federation Force", "details_link": "https://www.metacritic.com/game/3ds/metroid-prime-federation-force", "publisher": "Nintendo", "release_date": "Aug 19 2016", "developers": ["Next Level Games", "Nintendo"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 64, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/643631decc789d35c9bef1462b0fce22-98.jpg", "descriptions": "Enlist with a four-player local or online squad in this co-operative sci-fi shooter set in the Metroid universe. Hop in a specialized battle Mech suit and work with your teammates to take down enemy forces and complete objective- based missions. Then, take a break and play a fun, pick-upEnlist with a four-player local or online squad in this co-operative sci-fi shooter set in the Metroid universe. Hop in a specialized battle Mech suit and work with your teammates to take down enemy forces and complete objective- based missions. Then, take a break and play a fun, pick-up game of Blast Ball with fellow troops.… Expand"}, {"name": "Worms: A Space Oddity", "details_link": "https://www.metacritic.com/game/wii/worms-a-space-oddity", "publisher": "THQ", "release_date": "Mar 18 2008", "developers": ["Team17"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Artillery"], "meta_score": 64, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/2/87a763c59cb7a6800b37bf9d9bf5635a-98.jpg", "descriptions": "In Worms: A Space Oddity, players enjoy the ultimate blend of classic Worms game modes and re-invented single-player missions, as well as multiplayer modes that include a host of all-new party games and even more customization options. The game takes advantage of the Wii’s intuitiveIn Worms: A Space Oddity, players enjoy the ultimate blend of classic Worms game modes and re-invented single-player missions, as well as multiplayer modes that include a host of all-new party games and even more customization options. The game takes advantage of the Wii’s intuitive controls, on-screen hints and the redesigned interface with an in-game help system. Worms: A Space Oddity demonstrates significant visual, technical and design advancement over its predecessors with a new visual style that abandons the traditional drawn approach and replaces it with a distinctive style inspired by classic Sci-Fi looks. The Worms battles take place across six planets, each with its own, unique environments and global events. The online multiplayer experience pits up to four Worms fiends from all over the world against each other. [THQ]… Expand"}, {"name": "Shadow of the Beast", "details_link": "https://www.metacritic.com/game/playstation-4/shadow-of-the-beast", "publisher": "SCEA", "release_date": "May 17 2016", "developers": ["Heavy Spectrum"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Action Adventure", "General"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/d10342a5dade2e59be765a6050ac3c0c-98.jpg", "descriptions": "The legend of Aarbron is told once more as you embark upon a ferocious action adventure, seeking to dethrone the evil lord Maletoth, in the visually stunning world of Shadow of the Beast."}, {"name": "Warhammer Age of Sigmar: Storm Ground", "details_link": "https://www.metacritic.com/game/pc/warhammer-age-of-sigmar-storm-ground", "publisher": "Focus Home Interactive", "release_date": "May 27 2021", "developers": ["Gasket Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 64, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/2/863935dede29944f0d349f74edd5cfaf-98.jpg", "descriptions": "The first strategy videogame adaptation of Age of Sigmar’s dark-fantasy universe. Lead your highly-customisable force, and unlock new units, equipment and skills in this dynamic turn-based game packed with fast-paced warfare."}, {"name": "Extreme Exorcism", "details_link": "https://www.metacritic.com/game/xbox-one/extreme-exorcism", "publisher": "Ripstone", "release_date": "Sep 23 2015", "developers": ["Golden Ruby Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/8df1db680deb0716a18f3cd653980d34-98.jpg", "descriptions": "Extreme Exorcism is an action platformer with a spooky twist. You assume the role of Mae Barrons, tiny medium at large who is tasked with ridding a haunted house full of evil spirits. Instead of using seances and crystal balls, Mae uses rocket launchers, swords and a kick-ass arsenal to getExtreme Exorcism is an action platformer with a spooky twist. You assume the role of Mae Barrons, tiny medium at large who is tasked with ridding a haunted house full of evil spirits. Instead of using seances and crystal balls, Mae uses rocket launchers, swords and a kick-ass arsenal to get her point across. Unfortunately for her, with every ghost she kills, another takes it's place copying everything she did the round before.… Expand"}, {"name": "Ravaged", "details_link": "https://www.metacritic.com/game/pc/ravaged", "publisher": "Reverb", "release_date": "Oct 17 2012", "developers": ["2 Dawn Games"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/0462417830e2efd7724ee6ee143ed77e-98.jpg", "descriptions": "Ravaged is a post apocalyptic vehicular first person shooter."}, {"name": "Nickelodeon Kart Racers 3: Slime Speedway", "details_link": "https://www.metacritic.com/game/switch/nickelodeon-kart-racers-3-slime-speedway", "publisher": "GameMill Entertainment", "release_date": "Oct 14 2022", "developers": ["Bamtang"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/92d7c428e047c1556dc64256e6e59308-98.jpg", "descriptions": "Rebuilt and re-imagined from the ground up, Nickelodeon Kart Racers returns - bigger and better than ever!Featuring a fully voice acted cast of over 40 iconic characters, drift, slide, and boost your way to the finish line on tracks inspired by legendary Nickelodeon shows like SpongeBobRebuilt and re-imagined from the ground up, Nickelodeon Kart Racers returns - bigger and better than ever!Featuring a fully voice acted cast of over 40 iconic characters, drift, slide, and boost your way to the finish line on tracks inspired by legendary Nickelodeon shows like SpongeBob SquarePants, Teenage Mutant Ninja Turtles, Avatar: The Last Airbender, and more!… Expand"}, {"name": "Alfred Hitchcock: Vertigo", "details_link": "https://www.metacritic.com/game/playstation-5/alfred-hitchcock-vertigo", "publisher": "Microids", "release_date": "Oct  4 2022", "developers": ["Pendulo Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/0e5baf7c7135aad06a094cfaa86e782a-98.jpg", "descriptions": "Ed Miller, a writer, came out unscathed from his car crash down into Brody Canyon, California.Even though no one was found inside the car wreckage, Ed insists that he was traveling with his wife and daughter. Traumatized by the event, he begins to suffer from severe vertigo. As he startsEd Miller, a writer, came out unscathed from his car crash down into Brody Canyon, California.Even though no one was found inside the car wreckage, Ed insists that he was traveling with his wife and daughter. Traumatized by the event, he begins to suffer from severe vertigo. As he starts therapy, he will try to uncover what really happened on that tragic day.Prepare yourself for a most disturbing investigation inside the human mind: truth is sometimes worse than madness.An original story about obsession, manipulation and madness, inspired by Alfred Hitchcock's masterpiece Vertigo.… Expand"}, {"name": "Pokemon Quest", "details_link": "https://www.metacritic.com/game/switch/pokemon-quest", "publisher": "Nintendo", "release_date": "May 29 2018", "developers": ["Game Freak"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/f8340176e1acf96bca6245748438ff3e-98.jpg", "descriptions": "Welcome to Tumblecube Island, where Pokémon have turned into cubes?Set off for adventure in the Pokémon Quest game. Venture out with your Pokémon buddies on expeditions across Tumblecube Island in search of loot in this free-to-start action-adventure. Modify your Pokémon buddies withWelcome to Tumblecube Island, where Pokémon have turned into cubes?Set off for adventure in the Pokémon Quest game. Venture out with your Pokémon buddies on expeditions across Tumblecube Island in search of loot in this free-to-start action-adventure. Modify your Pokémon buddies with discovered Power Stones to make your ultimate expedition team.With a cube-shaped art style, Pokémon Quest is unlike any Pokémon game you've seen before. The simple gameplay makes it easy to hop into expeditions and start exploring Tumblecube Island with the help of your Pokémon buddies. Afterwards, head back to your base camp where you can use the loot you found during your adventure to befriend more Pokémon. Attract various Kanto Region Pokémon to your base camp by cooking up dishes made with collected ingredients! You can even decorate your base camp with fun items that provide helpful bonuses that make your expeditions more beneficial.… Expand"}, {"name": "Vesta", "details_link": "https://www.metacritic.com/game/switch/vesta", "publisher": "FinalBoss Games", "release_date": "Jan 19 2018", "developers": ["FinalBoss Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 64, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/29c182013d650d455f7e56a6f32d4f0a-98.jpg", "descriptions": null}, {"name": "Oh...Sir!", "details_link": "https://www.metacritic.com/game/pc/ohsir!", "publisher": "Gambitious", "release_date": "Oct 25 2016", "developers": ["Vile Monarch"], "platforms": "PC", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/fcc6f5e4768ab2aeff9f2a74db89d1c7-98.jpg", "descriptions": "A Hilarious Insult-‘em up in which players must verbally take-out their friends and family in different game modes. Assemble witty insults using different word strings, and employ combos, criticals, continuations and more to battle your opponents both offline and online across multipleA Hilarious Insult-‘em up in which players must verbally take-out their friends and family in different game modes. Assemble witty insults using different word strings, and employ combos, criticals, continuations and more to battle your opponents both offline and online across multiple devices using crossplay.… Expand"}, {"name": "Blade Arcus from Shining: Battle Arena", "details_link": "https://www.metacritic.com/game/pc/blade-arcus-from-shining-battle-arena", "publisher": "Studio Saizensen", "release_date": "Jul 28 2016", "developers": ["Studio Saizensen"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/36033fae28ac90ccc37b707e568f4b98-98.jpg", "descriptions": "In a world controlled by blade, magic, and fist diverse warriors gather for battle! This is a 2D fighting game featuring characters from Shining Blade and Shining Hearts."}, {"name": "The Silver Case", "details_link": "https://www.metacritic.com/game/playstation-4/the-silver-case", "publisher": "NIS America", "release_date": "Apr 18 2017", "developers": ["Grasshopper Manufacture"], "platforms": ["PC", "PlayStation 4"], "genres": ["General", "Adventure", "Visual Novel"], "meta_score": 64, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/543d550d853fd8252de3899441821491-98.jpg", "descriptions": "The detectives of the 24 Wards Heinous Crimes Unit have their eyes on one man: Kamui Uehara, legendary serial killer and assassin of a number of government officials 20 years prior in the now-famous \"Silver Case.\" However, nobody knows who—or what—Kamui really is. Has he really returned? WhoThe detectives of the 24 Wards Heinous Crimes Unit have their eyes on one man: Kamui Uehara, legendary serial killer and assassin of a number of government officials 20 years prior in the now-famous \"Silver Case.\" However, nobody knows who—or what—Kamui really is. Has he really returned? Who is this infamous serial killer? As the player, you will take control of the protagonist—a member of the Special Forces Unit known as “Republic”—from a first-person perspective. Inspired by classic adventure and visual novel-style games, The Silver Case offers a fresh and unique gameplay experience as it leads the player through an in-depth story containing various puzzles, and uncovering the truth piece by piece. [NIS]… Expand"}, {"name": "League of Evil", "details_link": "https://www.metacritic.com/game/switch/league-of-evil", "publisher": "Ratalaika Games", "release_date": "Aug 31 2017", "developers": ["Ratalaika Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 64, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/6e4b8af1c27ebe3d8f030515a4ea2f39-98.jpg", "descriptions": "Get ready for the GREATEST platformer with the most responsive controls to hit the App Store yet!The world needs your help! Evil scientists worldwide have joined forces forming a \"League of Evil\"; the only super agent who can stop them is YOU!As a specially trained agent you canGet ready for the GREATEST platformer with the most responsive controls to hit the App Store yet!The world needs your help! Evil scientists worldwide have joined forces forming a \"League of Evil\"; the only super agent who can stop them is YOU!As a specially trained agent you can double jump, flipping your way over obstacles. You are also trained in wall jumping gaps to reach new heights. So get ready to show your sick acrobatic moves across 160 challenging levels! Fight your way through your mission and find the mad scientist to deliver a well earned pixel punch in the face!The world is counting on you. Now go save everyone!FEATURES- Over 160 levels of super agent action!- Sick acrobatics: Jump, flip, wall jump, wall hug, double jump- Multiple world locations- Decapitations- Pixel art and chiptune retro style game!---MORE REVIEWS\"League of Evil is totally worth your dollar.\" - TouchArcade.com\"League of Evil offers some of the tightest controls I've seen in a mobile game!\" - Destructoid.com\"I simply cannot put the game down!\" - TheAppERA.com\"League of Evil is how you do a platformer on the iPhone!\" - MTV.com\"Super fun game, easy to get sucked into and looks gorgeous as a pixel platformer!\" - RazorianFly.com\"League of Evil's controls are flawless.\" - AppModo.com\"An 8-bit throwback through-and-through!\" - TouchGen.net\"League of Evil is perfect for fans of retro-inspired games!\" - 148Apps.com\"Best implementation of on-screen controls in a 2D side-scroller that I've yet seen!\" - GamePro.com\"This is a quality game that opts to take what other platformers have done and do it better.\" - SlideToPlay.com\"Whether you're a casual gamer after a challenge; a platformer fan after a fix; or a hard core gamer ready to test your skills, League of Evil will provide you with what you need.\" - AppSpy.com\"Highly recommend this game.\" - CNET.com\"Definitely consider dropping the $0.99 for League of Evil!\" - MacLife.com\"The. Best. iOS Platformer. Ever. Need I say more?\" - NoDPad.com---Follow us on Facebook:www.leagueofevilgame.com/facebookFollow us on Twitter:www.leagueofevilgame.com/twitterVisit us on the Web:www.leagueofevilgame.com… Expand"}, {"name": "Tokyo Twilight Ghost Hunters", "details_link": "https://www.metacritic.com/game/playstation-3/tokyo-twilight-ghost-hunters", "publisher": "Aksys Games", "release_date": "Mar 10 2015", "developers": ["TOYBOX"], "platforms": ["PlayStation 4", "PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General"], "meta_score": 64, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/4e2c02d6ba4675cee21258c3715b94a7-98.jpg", "descriptions": "A gaggle of teens are prepared to square off against the evil spirits that have been the cause of strange incidents all across Tokyo..."}, {"name": "Apache: Air Assault", "details_link": "https://www.metacritic.com/game/pc/apache-air-assault", "publisher": "Activision", "release_date": "Nov 19 2010", "developers": ["Gaijin Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Simulation", "Flight", "Helicopter", "Helicopter", "Combat"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/71b2870f86d8e6809d0538a2bacf7125-98.jpg", "descriptions": "Apache: Air Assault is a new combat flight simulation game based on the Apache AH-64D Longbow attack helicopter. The player takes on the role of three distinct Apache crews that each deal with what at first appears to be localized enemy activity, but eventually reveals itself to be part ofApache: Air Assault is a new combat flight simulation game based on the Apache AH-64D Longbow attack helicopter. The player takes on the role of three distinct Apache crews that each deal with what at first appears to be localized enemy activity, but eventually reveals itself to be part of the larger plan. The gameplay intercuts back and forth between the three crews as the action and stakes escalate.… Expand"}, {"name": "Phantasy Star Portable", "details_link": "https://www.metacritic.com/game/psp/phantasy-star-portable", "publisher": "Sega", "release_date": "Mar  3 2009", "developers": ["Alfa System"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 64, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/61407315f8194a28a488de04ad18c8ab-98.jpg", "descriptions": "Fans of the acclaimed Phantasy Star Universe series can now explore Gurhal on-the-go via the PSP m. Up to four friends team up to unravel the exclusive new storyline that picks up where Phantasy Star Universe ends and before the start of PSU: Ambition of the Illuminus. The infestation of theFans of the acclaimed Phantasy Star Universe series can now explore Gurhal on-the-go via the PSP m. Up to four friends team up to unravel the exclusive new storyline that picks up where Phantasy Star Universe ends and before the start of PSU: Ambition of the Illuminus. The infestation of the alien SEED was thought to be under control by the end of PSU, but a new menace has stricken the Gurhal system. Alongside a new character named Vivienne, players must investigate the contamination and clear out the affected wildlife. In this intriguing new installment, players will delve deeper than ever before into the mysteries of Phantasy Star Universe. [Sega]… Expand"}, {"name": "The Crew 2", "details_link": "https://www.metacritic.com/game/playstation-4/the-crew-2", "publisher": "Ubisoft", "release_date": "Jun 26 2018", "developers": ["Ubisoft Ivory Tower"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 64, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/b09ec251c49c2043198de418aeda37cb-98.jpg", "descriptions": "The newest iteration in the franchise, The Crew 2 captures the thrill of the American motorsports spirit in an open world. Welcome to Motornation, a huge, varied, action-packed playground built for motorsports throughout the entire US of A. Enjoy unrestrained exploration on ground, sea, andThe newest iteration in the franchise, The Crew 2 captures the thrill of the American motorsports spirit in an open world. Welcome to Motornation, a huge, varied, action-packed playground built for motorsports throughout the entire US of A. Enjoy unrestrained exploration on ground, sea, and sky. From coast to coast, street and pro racers, off-road explorers, and freestylers gather and compete in all kinds of disciplines. Join them in high-octane contests and share every glorious moment with the world. The Crew 2 gives you the chance to showcase your skills and rise as a multi-skilled motorsports champion. [Ubisoft]… Expand"}, {"name": "Stonefly", "details_link": "https://www.metacritic.com/game/pc/stonefly", "publisher": "MWM Interactive", "release_date": "Jun  1 2021", "developers": ["Flight School Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/cd12a4a65155be58d952e9ea63e29c31-98.jpg", "descriptions": "Harness the wind and soar through the wilderness of Stonefly, a chill and tranquil action-adventure game about self-discovery, legacy, and belonging. Glide your mech strategically among beautiful flora and dangerous fauna, confronting hungry bugs, adventures, and memorable characters."}, {"name": "Omen of Sorrow", "details_link": "https://www.metacritic.com/game/playstation-4/omen-of-sorrow", "publisher": "Soedesco", "release_date": "Nov  6 2018", "developers": ["AOne Games"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 64, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/fe6589442f81a5dbf48f4aaa3130c839-98.jpg", "descriptions": "Clear your mind, clench your fists and get ready for a wicked battle. Powered by Unreal Engine 4, Omen of Sorrow delivers a deep 2D battle system inspired by the classics, bringing back the edge, mindset and philosophy rooted in the genre’s arcade legacy, taking it to the next level withClear your mind, clench your fists and get ready for a wicked battle. Powered by Unreal Engine 4, Omen of Sorrow delivers a deep 2D battle system inspired by the classics, bringing back the edge, mindset and philosophy rooted in the genre’s arcade legacy, taking it to the next level with innovative features and fighting mechanics. Join the battle, conquer darkness.… Expand"}, {"name": "Californium", "details_link": "https://www.metacritic.com/game/pc/californium", "publisher": "Neko Entertainment", "release_date": "Feb 17 2016", "developers": ["Nova Production"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/10419ccedebe187161fa8b9161b0b847-98.jpg", "descriptions": "Explore the worlds of Californium, a first person exploration game where you are a writer trapped into shifting realities. Will you find what’s behind the simulacra?"}, {"name": "Legions of Steel", "details_link": "https://www.metacritic.com/game/pc/legions-of-steel", "publisher": "Slitherine", "release_date": "Jul 16 2015", "developers": ["Slitherine", "Slitherine Group"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 64, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/e629c85c82f3993a10f86dba3def42ae-98.jpg", "descriptions": "The Empire of the Machines is threatening the entire universe. The other factions have banded together to defend the galaxy from the invader. Battles are raging in the corridors of the Machines underground production facilities."}, {"name": "Arcania: Gothic 4", "details_link": "https://www.metacritic.com/game/xbox-360/arcania-gothic-4", "publisher": "JoWooD Entertainment AG", "release_date": "Oct 19 2010", "developers": ["Spellbound"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 64, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/4d8ef37ed2646a46b94b92291e557ef3-98.jpg", "descriptions": "ArcaniA - A Gothic Tale is set in a rich world that invites the player to explore all of its innumerable attractions and details. Different climate zones, abundant flora and fauna, subterranean vaults, and cities and castles with unique architecture await the adventurous player. CloudsArcaniA - A Gothic Tale is set in a rich world that invites the player to explore all of its innumerable attractions and details. Different climate zones, abundant flora and fauna, subterranean vaults, and cities and castles with unique architecture await the adventurous player. Clouds darken the skies, weather effects such as wind and heavy rain influence the game world, keeping it endlessly fascinating with its amazing graphics, day and night cycles, and a stunning display of light and shadow. Wonderfully atmospheric music and top-of-the-line sound effects create a truly immersive playing environment. A multitude of entertaining and challenging quests, challenging combat, mysterious NPC characters and a sophisticated plot guarantee many hours of highly entertaining gameplay. The Southern Islands await!… Expand"}, {"name": "Aliens vs. Predator", "details_link": "https://www.metacritic.com/game/xbox-360/aliens-vs-predator", "publisher": "Sega", "release_date": "Feb 16 2010", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 18 ", "genres": ["Action", "General", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 64, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/330a5c28dcd33b23752ca6be2260738a-98.jpg", "descriptions": "Developed at Rebellion by the team responsible for the original 1999 PC classic, the all-new Aliens vs. Predator allows players to take the role of three infamous species: Colonial Marines, Predators and Aliens. The game features a unique three-way online multiplayer experience, allowingDeveloped at Rebellion by the team responsible for the original 1999 PC classic, the all-new Aliens vs. Predator allows players to take the role of three infamous species: Colonial Marines, Predators and Aliens. The game features a unique three-way online multiplayer experience, allowing gamers to battle for survival and the right to be crowned the deadliest species in the galaxy. Each race also has its own distinct action-packed single-player campaign mode, with a storyline that cleverly interweaves with the other two species’ paths. Set on planet BG-386; a human colonist mining group discovers an ancient pyramid containing a dark and horrible secret. Across the galaxy, a race of warriors is alerted to the discovery of their pyramid and a hunting party is dispatched to ensure that it remains sealed at all costs. Deep inside the ruined pyramid meanwhile, nature's deadliest species awakes from centuries of hibernation intent on finding new prey. The Colonial Marine's story is an incredible fight against all odds from horrors lurking in the dark. Surrounded on all sides yet armed to the teeth, the Colonial Marine represents humanity's last stand with the firepower to fight back. As the Alien, players discover what it's like to be the scariest, most murderous creature in the universe, with the ability to traverse any surface at lightning speed in order to get close enough to unleash its deadly claws, tail and teeth. A master of the hunt, the Predator grants the player an arsenal of exotic weaponry with which to stalk from the shadows. Earn the greatest honor by ambushing prey up-close, before butchering them for a gory trophy kill. [Sega]… Expand"}, {"name": "Samurai Warriors: State of War", "details_link": "https://www.metacritic.com/game/psp/samurai-warriors-state-of-war", "publisher": "Koei", "release_date": "Mar  7 2006", "developers": ["Omega Force"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 64, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/755676f67a3903a8fc8db8cebec63c4f-98.jpg", "descriptions": "(Also known as \"Geki Sengoku Musou\" in Japan)  Samurai Warriors: State of War is set in civil war Japan, when great commanders such as Nobunaga Oda, Shingen Takeda, and Kenshin Uesugi struggled for control of the country. Arm yourself with classic Japanese weaponry such as katanas and(Also known as \"Geki Sengoku Musou\" in Japan)  Samurai Warriors: State of War is set in civil war Japan, when great commanders such as Nobunaga Oda, Shingen Takeda, and Kenshin Uesugi struggled for control of the country. Arm yourself with classic Japanese weaponry such as katanas and shuriken, and launch into the chaos of 16th century Japan. The action is relentless, and ranges from massive open-field warfare to sieges of trap-laden castles. With a variety of unique characters, moves, and environments, Samurai Warriors: State of War will give you an unrivalled taste of Japan's most volatile era. Many prominent figures from Japanese history make their appearance in Samurai Warriors: State of War, including the legendary soldier Yukimura Sanada, the revolutionary Nobunaga Oda, and the enigmatic ninja Hattori Hanzo. Each character has signature weapons and skills, as well as their unique role to play in this dramatic epic. State of War's \"Battlefield Area System\" divides the battlefield into smaller, strategic sections, making the game perfect for quick, portable play. In addition, there are many long-term elements that will keep you coming back for more, such as the raising of character and equipment stats. [KOEI]… Expand"}, {"name": "Dragon Star Varnir", "details_link": "https://www.metacritic.com/game/switch/dragon-star-varnir", "publisher": "Idea Factory", "release_date": "Aug  3 2021", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/4a8be3ffd0cced67816f902b66d415c9-98.jpg", "descriptions": "In a world where the bones of an ancient beast tower over the land... The knight Zephy is part of an order whose role is to hunt down witches -- people seen as cursed beings for giving birth to dragons. When he is almost killed on one of these missions, two mysterious witches save him fromIn a world where the bones of an ancient beast tower over the land... The knight Zephy is part of an order whose role is to hunt down witches -- people seen as cursed beings for giving birth to dragons. When he is almost killed on one of these missions, two mysterious witches save him from the brink of death by feeding him dragon blood. Granted new magic abilities by their efforts, he soon finds his fate intertwined with the witches and reluctantly joins them to fight against an Empire out to destroy his kind, ruthless dragon hunters, and a witch more powerful than any in existence. Can they fight all this and save themselves, or will his new allies succumb to the dragon's curse?… Expand"}, {"name": "Robinson: The Journey", "details_link": "https://www.metacritic.com/game/playstation-4/robinson-the-journey", "publisher": "Crytek", "release_date": "Nov  8 2016", "developers": ["Crytek"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/ff644597f45c15b84332309cb6648c31-98.jpg", "descriptions": "When the Esmeralda crashes on Tyson III, a boy named Robin is stranded. He must rely on his wits — and HIGS, an AI companion from the ship — to survive. As he searches for the lost crew and comes face-to-face with dinosaurs, Robin discovers that Tyson III is not the paradise once promised."}, {"name": "Saints Row: Gat Out of Hell", "details_link": "https://www.metacritic.com/game/playstation-4/saints-row-gat-out-of-hell", "publisher": "Deep Silver", "release_date": "Jan 20 2015", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "General", "Modern", "Open-World"], "meta_score": 64, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/5d91c2bdb90ffa2b640e26444dde687b-98.jpg", "descriptions": "Get with Johnny Gat & Kinzie Kensington as you tear apart Hell in a mission to save the Boss’ soul. Historic icons, old friends, older enemies, a talking gun, a full length musical number and more shenanigans await you."}, {"name": "Urban Trial Freestyle", "details_link": "https://www.metacritic.com/game/playstation-3/urban-trial-freestyle", "publisher": "Tate Multimedia", "release_date": "Feb 12 2013", "developers": ["Tate Multimedia"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation Vita", "PlayStation 3"], "num_players": "1 Player", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 64, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/9d1e07900db4a80248b1bbf229b1d776-98.jpg", "descriptions": "Urban Trial Freestyle challenges players to push their risk-taking to the absolute limits to deliver maximum stunt rewards. The game's nonstop action is complemented by a host of features including trophies, multiple game modes, leader boards, rider and bike customisation, and much more.Urban Trial Freestyle challenges players to push their risk-taking to the absolute limits to deliver maximum stunt rewards. The game's nonstop action is complemented by a host of features including trophies, multiple game modes, leader boards, rider and bike customisation, and much more.\r \rWith slick urban detailed graphics and an innovative physics engine fine-tuned for fun pick-up and play, the game has been specifically engineered to get the most out of each platform.… Expand"}, {"name": "The Testament of Sherlock Holmes", "details_link": "https://www.metacritic.com/game/xbox-360/the-testament-of-sherlock-holmes", "publisher": "Atlus", "release_date": "Sep 25 2012", "developers": ["Frogwares"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "3D", "Third-Person"], "meta_score": 64, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/c64d236d09fbca06799633614393f9ef-98.jpg", "descriptions": "The famous detective Sherlock Holmes is back on the PC and Xbox 360 for a great adventure and probably the most dangerous investigation of his entire career."}, {"name": "Driver: San Francisco", "details_link": "https://www.metacritic.com/game/wii/driver-san-francisco", "publisher": "Ubisoft", "release_date": "Sep  6 2011", "developers": ["Ubisoft Reflections"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/2c1de835be15860ec84ee1fc9f00e277-98.jpg", "descriptions": "Driver: San Francisco marks the return of the established video game series that has sold 14 million copies worldwide. Gamers will play as Detective John Tanner on a relentless manhunt for crime lord Charles Jericho through the hills of the City by the Bay. Thanks to a groundbreakingDriver: San Francisco marks the return of the established video game series that has sold 14 million copies worldwide. Gamers will play as Detective John Tanner on a relentless manhunt for crime lord Charles Jericho through the hills of the City by the Bay. Thanks to a groundbreaking gameplay feature, players can now seamlessly \"shift\" between well over a hundred licensed vehicles, keeping them constantly in the heart of the action. With its timeless setting, unique car handling and renewed playability, Driver: San Francisco will revitalize the classic free-roaming, cinematic car chase experience for the current generation of gaming platforms.… Expand"}, {"name": "Puzzlegeddon", "details_link": "https://www.metacritic.com/game/xbox-360/puzzlegeddon", "publisher": "Tecmo", "release_date": "Dec 16 2009", "developers": ["Tecmo"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "1-6 ", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/bb338c92459f67bcc69c989988787aea-98.jpg", "descriptions": "[Xbox Live Arcade]  Set in an array of galaxies, Puzzlegeddon™ features a clever mix of puzzle, action, and strategy in a fast-paced and exciting game! Compete for the top spot on the planet by creating multiple combos for the quickest way to gather enough resources to blast your enemies out[Xbox Live Arcade]  Set in an array of galaxies, Puzzlegeddon™ features a clever mix of puzzle, action, and strategy in a fast-paced and exciting game! Compete for the top spot on the planet by creating multiple combos for the quickest way to gather enough resources to blast your enemies out of this world. Or, if you find yourself on the perilous poisonous planet, solve brainteasers to survive for as long as possible and rack up a high score. Battle up to five players on Xbox LIVE in a variety of galaxies in this stylish and quirky puzzle brawler. [Tecmo]… Expand"}, {"name": "Sonic Rivals", "details_link": "https://www.metacritic.com/game/psp/sonic-rivals", "publisher": "Sega", "release_date": "Nov 16 2006", "developers": ["Backbone Entertainment"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade", "On-foot", "Other", "On-foot"], "meta_score": 64, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/3b2e0e02b74382b30cc099b1891e77cc-98.jpg", "descriptions": "Sonic Rivals is a head-to-head competition between Sonic and his top rivals, where the gloves are off and winner takes all. Built from the ground-up, the engine allows gamers to rip through tracks in some high-spirited single player and wireless multiplayer action against friends as SonicSonic Rivals is a head-to-head competition between Sonic and his top rivals, where the gloves are off and winner takes all. Built from the ground-up, the engine allows gamers to rip through tracks in some high-spirited single player and wireless multiplayer action against friends as Sonic returns in a whole new racing-platformer with classic 2D gameplay in true 3D environments for gamers on the go. What starts as a friendly competition between Sonic and Knuckles quickly intensifies as Shadow and other rivals jump into the action. Sonic Rivals allows gamers to utilize boost moves and power-ups to trip, shove, and vault over each other while hurtling towards the finish line at breakneck speeds. Players will negotiate wildly twisting 3D tracks while avoiding the insidious Dr. Eggman and his myriad of hazardous traps and contraptions. In Sonic Rivals, gamers can play as one of four different characters from the Sonic Universe, each with separate fast and winding storylines. In addition, the extensive rewards system, which is based on collecting trading cards, allows players to customize their favorite characters. Connect via wireless to race against a friend, and put trading cards on the line for even more multiplayer challenges. [Sega]… Expand"}, {"name": "Microsoft Flight", "details_link": "https://www.metacritic.com/game/pc/microsoft-flight", "publisher": "Microsoft Game Studios", "release_date": "Feb 29 2012", "developers": ["Microsoft Game Studios"], "platforms": "PC", "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 64, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/7/8659ba439413b2db517d7716465f15f3-98.jpg", "descriptions": "Microsoft Flight brings the thrill and wonder of flying to beginners and PC pilots alike through missions, daily challenges, and the ability to explore the skies above gorgeous representations of real world environments in accurately rendered aircraft. The initial experience is free to playMicrosoft Flight brings the thrill and wonder of flying to beginners and PC pilots alike through missions, daily challenges, and the ability to explore the skies above gorgeous representations of real world environments in accurately rendered aircraft. The initial experience is free to play and will continually evolve with new terrain, aircraft, and challenges that can be purchased as additional content.… Expand"}, {"name": "The Spiderwick Chronicles", "details_link": "https://www.metacritic.com/game/playstation-2/the-spiderwick-chronicles", "publisher": "Sierra Entertainment", "release_date": "Feb  5 2008", "developers": ["Stormfront Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Adventure", "General"], "meta_score": 64, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/96deadda8c5d3d5ccd0f486d38369212-98.jpg", "descriptions": "The Spiderwick Chronicles is a video game based on the theatrical release by Paramount Pictures and Nickelodeon Films. The game recreates the fantastical world of the Spiderwick film and best-selling book series. The Spiderwick Chronicles video game recreates the world of Jared, Simon andThe Spiderwick Chronicles is a video game based on the theatrical release by Paramount Pictures and Nickelodeon Films. The game recreates the fantastical world of the Spiderwick film and best-selling book series. The Spiderwick Chronicles video game recreates the world of Jared, Simon and Mallory Grace, putting gamers in their shoes as they discover a hidden world of fantastical creatures - sprites, ogres, goblins, brownies and more. [Sierra Entertainment]… Expand"}, {"name": "MySims Party", "details_link": "https://www.metacritic.com/game/ds/mysims-party", "publisher": "EA Games", "release_date": "Mar 10 2009", "developers": ["EA Games"], "platforms": "DS", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/0345b1a63e2a6fb2f60163dc77cfc60c-98.jpg", "descriptions": "Take the mini games with you! MySims Party for the Nintendo DS offers 40 mini games to choose from. These games, specific for the DS, offer hours of entertainment. You can dig up dinosaur fossils during Excavate-a-Saurus, join Goth Boy on a first person shooter mission during Haunted HuntedTake the mini games with you! MySims Party for the Nintendo DS offers 40 mini games to choose from. These games, specific for the DS, offer hours of entertainment. You can dig up dinosaur fossils during Excavate-a-Saurus, join Goth Boy on a first person shooter mission during Haunted Hunted or rock out with Air-Guitar-Star. [Electronic Arts]… Expand"}, {"name": "YIIK: A Postmodern RPG", "details_link": "https://www.metacritic.com/game/pc/yiik-a-postmodern-rpg", "publisher": "Ysbryd Games", "release_date": "Jan 17 2019", "developers": ["Ackkstudios"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 64, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/4/31d689f162604b820135bcf40f10ce6d-98.jpg", "descriptions": "On the afternoon of April 4th 1999 Sammy Pak went missing.  That night, a video of her last known moments was uploaded online.  All of your friends excitedly watched as she is pulled from an elevator by something. otherworldly. \r\rThis is a story about what happens when you look for someoneOn the afternoon of April 4th 1999 Sammy Pak went missing.  That night, a video of her last known moments was uploaded online.  All of your friends excitedly watched as she is pulled from an elevator by something. otherworldly. \r\rThis is a story about what happens when you look for someone who cant be found and the strange things you invite into your life when you go to forbidden places.… Expand"}, {"name": "Conan Exiles", "details_link": "https://www.metacritic.com/game/xbox-one/conan-exiles", "publisher": "Funcom", "release_date": "May  8 2018", "developers": ["Funcom"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 40 ", "genres": ["Action Adventure", "Survival"], "meta_score": 64, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/c4c300f41c70601fcac505e58c31a67d-98.jpg", "descriptions": "You are an exile, outcast and downtrodden, sentenced to walk in a barbaric wasteland where the weak are crushed and only the strong can live. Here you must fight to survive, build, and dominate the world alone on your own server, or with enemies and allies in online multiplayer.\r JourneyYou are an exile, outcast and downtrodden, sentenced to walk in a barbaric wasteland where the weak are crushed and only the strong can live. Here you must fight to survive, build, and dominate the world alone on your own server, or with enemies and allies in online multiplayer.\r Journey through a vast, seamless world filled with the ruins of ancient civilizations and uncover its dark history and buried secrets as you seek to conquer and dominate the exiled lands yourself. Start with nothing but your bare hands and forge the legacy of your clan, from simple tools and weapons to gigantic fortresses and entire cities. Enslave the bandits of the exiled lands to do your bidding by breaking them on the grueling Wheel of Pain. Sacrifice the beating hearts of your enemies on the blood-soiled altars of your god to seize true power and glory. Summon the colossal avatar of your god and see them lay waste to your enemies and their homes.\r Just remember: in this brutal land of vengeful gods, bloodthirsty cannibals, and vicious monsters, survival is more than tracking down food and water. Explore mysterious ruins in search of treasure and knowledge, but beware the risk of your mind being corrupted by the dark forces of the world. Traverse vast sand dunes and seek shelter from scouring sandstorms sweeping across the burning sands. March into war against your enemies and unleash your savage fury in brutal combat. Go in unprepared and it will be your head rolling and limbs flying.\r Conan Exiles is not an empty sandbox. It is a world rich in history where you must discover the knowledge and secrets of ancient civilizations as you struggle to build your own.\r * SURVIVE THE BARBARIC WASTELAND\rIn the world of Conan the Barbarian, survival is more than being well-fed and hydrated. Here you must weather scouring sandstorms, save your mind from being corrupted and going insane, and fight vicious monsters from the darkest holes of the earth.\r * BUILD YOUR LEGACY IN A VAST, SEAMLESS WORLD\rJourney through a huge, seamless world filled with danger and opportunity, exploring everything from sand dunes to towering ruins. Harvest resources to craft tools and weapons, then build everything from a small settlement to entire cities.\r * DISCOVER THE DARK HISTORY OF ANCIENT CIVILIZATIONS\rExplore shadow-haunted ruins of ancient civilizations and discover great treasures and knowledge. Learn about the people who inhabited this world before and what led to their demise through inscriptions, wandering NPCs, and the environment itself.\r * CALL UPON THE POWER OF THE GODS\rCut out the hearts of your enemies and sacrifice it upon the altars of your god to earn their blessing. Summon and take direct control of huge, towering avatars and wreak havoc on your enemies as you crush their homes and drive them from their lands.\r * DEFEND YOUR LAND WITH AN ARMY OF SLAVES\rEnslave the criminals of the exiled lands and force them to join your cause and defend your territory. Put them through the grueling Wheel of Pain to break their will, then turn them into archers, crafters, entertainers, and more. Find rare thralls for the greatest rewards!\r * DOMINATE YOUR ENEMIES\rMarch forth to war against your enemies, use explosives and see their fortifications crumble to dust, then unleash your savage fury with brutal attacks that will see heads rolling and limbs flying. Find or craft a wide range of weapons and armor.\r * PLAY TOGETHER OR ALONE\rPlay alone locally or fight for survival and dominance in persistent multiplayer on public servers. You can also host your own server and invite others to join you in a world where you have full control of the rules and settings. Want to play with just handful of friends? Try co-op mode!\r * CONTROL YOUR EXPERIENCE\rWhen playing alone locally or on a server you are the administrator of you have access to a range of in-game tools. These allow you to change progression speed, spawn monsters, turn yourself invisible, deactivate avatars, and much more. Be the dungeon master of your own server!\r * PLAY WITH MODS\rDownload Conan Exiles mods directly from the Steam workshop to customize your game experience. You can also download the custom Conan Exiles Unreal Editor and start creating your own!… Expand"}, {"name": "Albino Lullaby: Episode 1", "details_link": "https://www.metacritic.com/game/pc/albino-lullaby-episode-1", "publisher": "Ape Law", "release_date": "Sep 15 2015", "developers": ["Ape Law"], "platforms": "PC", "genres": ["Action Adventure", "Survival"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/6a128d84a4311cdf724b668109ce18f7-98.jpg", "descriptions": "Albino Lullaby is a horror adventure game that doesn't rely on jump scares or gore. Escape from a surreal psychological nightmare as the world dynamically twists and contorts around you."}, {"name": "Dog's Life", "details_link": "https://www.metacritic.com/game/playstation-2/dogs-life", "publisher": "Hip Games", "release_date": "Sep 14 2004", "developers": ["Frontier Developments"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Modern"], "meta_score": 64, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/0/39122397667606b3b2c396b5bb5865f3-98.jpg", "descriptions": "Meet Jake, the loveable mutt on a mission: to rescue his dog-napped pal Daisy! The plucky pup embarks on an epic adventure which sees him journeying across the US, taking in the Mid-West countryside, scenic ski resorts, and even busy cities on his travels. Playing as the heroic hound, you'llMeet Jake, the loveable mutt on a mission: to rescue his dog-napped pal Daisy! The plucky pup embarks on an epic adventure which sees him journeying across the US, taking in the Mid-West countryside, scenic ski resorts, and even busy cities on his travels. Playing as the heroic hound, you'll get to do pretty much anything a real-life dog can do - including sniffing out food, playing fetch, chasing chickens, and marking your territory (yep, that's right, Jake can fart, pee and poo). As you explore the huge environments, you can choose whether to interact with other animals and humans, go on missions for treats, and even play as other dogs utilise their individual canine talents. [SCEE]… Expand"}, {"name": "Alias", "details_link": "https://www.metacritic.com/game/playstation-2/alias", "publisher": "Acclaim", "release_date": "Apr  5 2004", "developers": ["Acclaim Studios Cheltenham"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 64, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/557f2605e5a32bfb0c0ddf337befbff3-98.jpg", "descriptions": "Alias is a third-person action adventure containing a unique blend of action and stealth that puts you under fire and under pressure. Whether you're up against the clock or being hunted by the enemy, fighting against the odds or fleeing for your life, the action is relentless. Utilize yourAlias is a third-person action adventure containing a unique blend of action and stealth that puts you under fire and under pressure. Whether you're up against the clock or being hunted by the enemy, fighting against the odds or fleeing for your life, the action is relentless. Utilize your incredible spyware and array of disguises to complete the most dangerous covert missions across the globe. Experience all the heart-stopping action and tension of the award winning TV series. [Acclaim]… Expand"}, {"name": "Mission: Impossible: Operation Surma", "details_link": "https://www.metacritic.com/game/gamecube/mission-impossible-operation-surma", "publisher": "Atari", "release_date": "Mar 23 2004", "developers": ["Paradigm Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/095a3cbfc4d0e6344a9cdd98c25b97c9-98.jpg", "descriptions": "Your mission, should you choose to accept it, is to save the free world from certain doom.  Ethan Hunt is back in Mission: Impossible Operation Surma, a stealth action adventure featuring an incredible arsenal of the latest weaponry, hi-tech gadgets, and mind-blowing disguises.  Ethan andYour mission, should you choose to accept it, is to save the free world from certain doom.  Ethan Hunt is back in Mission: Impossible Operation Surma, a stealth action adventure featuring an incredible arsenal of the latest weaponry, hi-tech gadgets, and mind-blowing disguises.  Ethan and his IMF team travel to exotic international locations in an effort to thwart the Surma Corporation's diabolical plans for global domination.  Throughout your mission, you'll be called upon to use your brains and brawn to get the job done.  … Expand"}, {"name": "Aero Elite: Combat Academy", "details_link": "https://www.metacritic.com/game/playstation-2/aero-elite-combat-academy", "publisher": "Sega", "release_date": "Mar 10 2003", "developers": ["Sega AM2"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 64, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/c9260e8dc356ec11fcfd6dee97b78939-98.jpg", "descriptions": "Aero Elite is your opportunity to train as a fighter pilot and master the intricate flight mechanics and high-tech weaponry of today's latest aircraft. Take part in rigorous training, where you will master more than 60 types of aircraft, from jump jets to choppers. Through a wide range ofAero Elite is your opportunity to train as a fighter pilot and master the intricate flight mechanics and high-tech weaponry of today's latest aircraft. Take part in rigorous training, where you will master more than 60 types of aircraft, from jump jets to choppers. Through a wide range of combat scenarios, you'll hone your skills and perfect a wide variety of difficult aerial maneuvers. These will come in handy as you become intimately involved with radar-guided missiles, heavy machine guns, and terrestrial targets in need of destruction. Are you skilled enough to become one of the Aero Elite? Pilot more than 60 authentically-modeled aircraft, including helicopters. Battle above 12 different areas during morning, day, or night under various weather conditions. Master aerial acrobatics through realistic training. Outsmart deviously aggressive enemy squadrons. [Sega]… Expand"}, {"name": "Egg Mania: Eggstreme Madness", "details_link": "https://www.metacritic.com/game/playstation-2/egg-mania-eggstreme-madness", "publisher": "Kemco", "release_date": "Sep 12 2002", "developers": ["Kemco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/4f1a545d420c5d380944eaa6b8b01f4f-98.jpg", "descriptions": "Over 33 configurable options in the special customize play mode allows gamers to design their own Eggstreme Madness challenges. Intuitive Wobble Meter analyzes the stability of each player's puzzle tower and heightens game strategy elements. Over 33 individual enemies and helpful allies roamOver 33 configurable options in the special customize play mode allows gamers to design their own Eggstreme Madness challenges. Intuitive Wobble Meter analyzes the stability of each player's puzzle tower and heightens game strategy elements. Over 33 individual enemies and helpful allies roam a wide range of new themed stages. New bonus scoring system includes tricks and combos and continuous scoring bonuses, essential strategies for unlocking hidden characters and game modes.… Expand"}, {"name": "Street Fighter EX3", "details_link": "https://www.metacritic.com/game/playstation-2/street-fighter-ex3", "publisher": "Capcom", "release_date": "Oct 24 2000", "developers": ["Arika"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 64, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/a57d51b017b21f0527dc914325e3869a-98.jpg", "descriptions": "The Street Fighter EX3 series returns with a third serving of tag-team, free-for-all brawls. Choose from 16 characters to play one-on-one, two-on-one, and even one-on-three battles. In original mode, take one character through a fighting quest and recruit your defeated opponents for tag orThe Street Fighter EX3 series returns with a third serving of tag-team, free-for-all brawls. Choose from 16 characters to play one-on-one, two-on-one, and even one-on-three battles. In original mode, take one character through a fighting quest and recruit your defeated opponents for tag or team play. With four gameplay modes and new enhancements such as the Critical Parade and Emotional Flow super moves, Street Fighter EX3 adds more fun to tag-team fighting. … Expand"}, {"name": "Sword Art Online: Fatal Bullet", "details_link": "https://www.metacritic.com/game/playstation-4/sword-art-online-fatal-bullet", "publisher": "Bandai Namco Games", "release_date": "Feb 23 2018", "developers": ["Dimps Corporation"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/ce25124ed73af382d0967a1cf19819df-98.jpg", "descriptions": "Your Choice is Heavier and Faster Than a Bullet. Become the hero of Gun Gale Online in the latest game of the SAO franchise in Sword Art Online: Fatal Bullet. Step into the versatile landscapes and environments of Gun Gale Online with unique and realistic designs resembling something out ofYour Choice is Heavier and Faster Than a Bullet. Become the hero of Gun Gale Online in the latest game of the SAO franchise in Sword Art Online: Fatal Bullet. Step into the versatile landscapes and environments of Gun Gale Online with unique and realistic designs resembling something out of a sci-fi movie and numerous other weapons and fighting styles to choose from. Interact with characters from the Sword Art Online original novels, anime and previous games as you navigate a world that is vastly personalized and visually enhanced. Play as the protagonist, battle against opponents using new weapons and further customize gameplay by creating skills and abilities. Full dive into Sword Art Online: Fatal Bullet!FEATURES:* Welcome to the World of Guns: Gun Gale Online from Sword Art Online II is visually enhanced and diverse with many landscapes to discover in an all new original story supervised by series creator, Reki Kawahara.* Unreal Visuals: Get lost in a lifelike world developed by Dimps with realistic and robust environments and textures made possible by Unreal Engine 4.* Friend or Foe: Challenge tough bosses that require friends in co-op or play against them in 4-on- 4 battles.* Realistic and Heroic Gun play: Plenty of one-of-a-kind and beautifully designed weapons to choose from and unique skills to create.* New to XBOX ONE: Sword Art Online will come to XBOX ONE and PS4 simultaneously for the first time in the history of the popular gaming series.… Expand"}, {"name": "Devil Kings", "details_link": "https://www.metacritic.com/game/playstation-2/devil-kings", "publisher": "Capcom", "release_date": "Oct 12 2005", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/1b9570e0994ccc933f2892e5d2a29f15-98.jpg", "descriptions": "In Devil Kings, players assume the role of various warriors who must lead their hero into a succession of hostile confrontations against an onslaught of opponents. The action explodes on-screen when awesome \"critical moves\" are performed on the battlefield as players plow through enemyIn Devil Kings, players assume the role of various warriors who must lead their hero into a succession of hostile confrontations against an onslaught of opponents. The action explodes on-screen when awesome \"critical moves\" are performed on the battlefield as players plow through enemy hordes. Unleash the special powers from within to bombard those who stand against you with ruthless attacks or summon a powerful storm of fiery meteors and watch them explode in a whirlwind of destruction. Using experience points earned during combat, gamers can level up their characters' personal attributes and weapons. There are over 80 special items to find and unlock in hidden treasure chests located throughout the game. It's up to the player to build up their heroes, collect items, and carve a new path to victory and ultimate domination. [Capcom]… Expand"}, {"name": "Tom Clancy's Splinter Cell Double Agent", "details_link": "https://www.metacritic.com/game/gamecube/tom-clancys-splinter-cell-double-agent", "publisher": "Ubisoft", "release_date": "Oct 26 2006", "developers": ["Ubisoft Montreal"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Action Adventure", "Modern"], "meta_score": 64, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/fc22ec4fbaca6bbfd7c75fb8d6331b3b-98.jpg", "descriptions": "Veteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life asVeteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life as a double agent. As you infiltrate a terrorist organization in its American headquarters, you must carefully weigh the consequences of your actions. Kill too many criminals and you'll blow your cover. Hesitate too long and millions will die. Do whatever it takes to complete your mission, but get out alive.  … Expand"}, {"name": "Foregone", "details_link": "https://www.metacritic.com/game/playstation-4/foregone", "publisher": "Big Blue Bubble Inc.", "release_date": "Oct  5 2020", "developers": ["Big Blue Bubble Inc."], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 64, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/4b4626a939e9bb682c13620218046b38-98.jpg", "descriptions": "Foregone has players take on the role of the city of Calagan’s strongest Arbiter, tasked with investigating the sudden resurgence of an all-corrupting force known as the Harrow. The Arbiter will destroy legions of enemies, battle formidable bosses, and collect a wide array of upgradeableForegone has players take on the role of the city of Calagan’s strongest Arbiter, tasked with investigating the sudden resurgence of an all-corrupting force known as the Harrow. The Arbiter will destroy legions of enemies, battle formidable bosses, and collect a wide array of upgradeable loot as she embarks on a twisted journey to unravel the haunting truth behind the Harrow. The intense, combat-focused title features fluid pixel artwork, combining old-school visual influences with modern 3D animation technology.… Expand"}, {"name": "Pokemon Cafe Mix", "details_link": "https://www.metacritic.com/game/switch/pokemon-cafe-mix", "publisher": "Nintendo", "release_date": "Jun 23 2020", "developers": ["Genius Sonority Inc.", "The Pokemon Company"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Matching"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/c51fe6098ced96194bf9069a752d955c-98.jpg", "descriptions": "Complete touch-based puzzles to serve dishes and drinks to adorable Pokémon customers.\r Link together Pokémon™ icons to clear puzzles as you work to build up your very own café in Pokémon Café Mix, a free-to-start game for the Nintendo Switch™ system! Meet the goals for each puzzle beforeComplete touch-based puzzles to serve dishes and drinks to adorable Pokémon customers.\r Link together Pokémon™ icons to clear puzzles as you work to build up your very own café in Pokémon Café Mix, a free-to-start game for the Nintendo Switch™ system! Meet the goals for each puzzle before you run out of turns—link a certain number of icons, get a high score, or even destroy sugar cubes to serve up Pokémon themed menu items.\r Meet and grow your café staff of charming Pokémon eager to help\r Recruit Pokémon to help out at the café (in their adorable uniforms) by building friendship and expand your café and menu offerings by completing puzzles. Each Pokémon staff member has a Café Skill that will come in handy during puzzles!\r Golden Acorns can help you complete puzzles and recruit more Pokémon!\r Earn or purchase Golden Acorns, the in-game currency, and redeem them to regain hearts, continue puzzles, and get helpful items.\r As you complete puzzles to build a world-class café, you’ll face obstacles such as sugar cubes, dollops of whipped cream, and tomatoes! Use your puzzle skills to clear them and employ the help of Pokémon’s Café Skills for some extra oomph! In addition to Café Skills, each Pokémon staff member has a specialty. Match a Pokémon’s specialty with the dish or drink you are making for bonuses in puzzles.\r In addition to recruiting more Pokémon staff members and growing your collection of menu items, the café itself will expand as you play! Getting new tools or having areas added to your café may even draw in more customers. All the action in Pokémon Café Mix unfolds in a playful art style that brings out the cuteness of your Pokémon pals and patrons. It’s time to become a café owner, solve puzzles, and bring joy to Pokémon patrons!… Expand"}, {"name": "Farming Simulator 19", "details_link": "https://www.metacritic.com/game/playstation-4/farming-simulator-19", "publisher": "Focus Home Interactive", "release_date": "Nov 20 2018", "developers": ["Giants Software"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 64, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/aec2a9d76f192a58cc6a06da1db49095-98.jpg", "descriptions": "The multimillion-selling franchise takes a giant leap forward for 2018 -- the ultimate farming simulation returns this year with a complete overhaul of the graphics engine, offering the most striking and immersive visuals and effects, along with the deepest and most complete farmingThe multimillion-selling franchise takes a giant leap forward for 2018 -- the ultimate farming simulation returns this year with a complete overhaul of the graphics engine, offering the most striking and immersive visuals and effects, along with the deepest and most complete farming experience ever!Farming Simulator 19 takes the biggest step forward yet with the franchise's most extensive vehicle roster ever! You'll take control of vehicles and machines faithfully recreated from all the leading brands in the industry, including for the first time John Deere, the largest agriculture machinery company in the world, Case IH, New Holland, Challenger, Fendt, Massey Ferguson, Valtra, Krone, Deutz-Fahr and many more.Farming Simulator 19 will feature new American and European environments in which to develop and expand your farm and will introduce many exciting new farming activities, including new machinery and crops with cotton and oat! Tend to your livestock of pigs, cows, sheep, and chickens -- or ride your horse for the first time, letting you explore in a brand-new way the vast land around your farm.… Expand"}, {"name": "InnerSpace", "details_link": "https://www.metacritic.com/game/xbox-one/innerspace", "publisher": "PolyKnight Games", "release_date": "Jan 16 2018", "developers": ["PolyKnight Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Civilian"], "meta_score": 64, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/9/e06d82360ee7ddb57e93f42b8d43418e-98.jpg", "descriptions": "InnerSpace is an exploration flying game set in a world where physics are inverted. Take the role of an unnamed cartographer to explore the various bubble-worlds, collect relics, and encounter each bubble’s mythical demigod, in order to discover more about the universe, its history, and itsInnerSpace is an exploration flying game set in a world where physics are inverted. Take the role of an unnamed cartographer to explore the various bubble-worlds, collect relics, and encounter each bubble’s mythical demigod, in order to discover more about the universe, its history, and its future. … Expand"}, {"name": "Kerbal Space Program: Enhanced Edition", "details_link": "https://www.metacritic.com/game/playstation-4/kerbal-space-program-enhanced-edition", "publisher": "SQUADTeam", "release_date": "Jan 16 2018", "developers": ["BlitWorks"], "platforms": ["PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Space", "Combat", "Civilian"], "meta_score": 64, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/cbfd0a36980920ec6f5d270325f53dcd-98.jpg", "descriptions": "In Kerbal Space Program, take charge of the space program for the alien race known as the Kerbals. You have access to an array of parts to assemble fully-functional spacecraft that flies (or doesn’t) based on realistic aerodynamic and orbital physics."}, {"name": "Franchise Hockey Manager 3", "details_link": "https://www.metacritic.com/game/pc/franchise-hockey-manager-3", "publisher": "Out Of The Park Developments", "release_date": "Oct 31 2016", "developers": ["Out Of The Park Developments"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/556b22aa24ef28ce83813ac1a9ac47d5-98.jpg", "descriptions": null}, {"name": "F1 2014", "details_link": "https://www.metacritic.com/game/xbox-360/f1-2014", "publisher": "Codemasters", "release_date": "Oct 21 2014", "developers": ["Codemasters Birmingham"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Automobile"], "meta_score": 64, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/8/194a1cd099a471849fe6b50390c61d38-98.jpg", "descriptions": "Broaden your F1 2014 multiplayer experience with RaceNet, the free online community hub which boasts over a million members. F1 2014 features two-player split-screen racing and full online grids, with 16-player racing plus 8 AI across a range of game modes."}, {"name": "The Impossible Game", "details_link": "https://www.metacritic.com/game/pc/the-impossible-game", "publisher": "FlukeDude", "release_date": "May  8 2014", "developers": ["Grip Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/cfd4153b8b5f0ed85d8abb941c57a048-98.jpg", "descriptions": "Jump over spikes and jump on blocks to get to the end. Sounds easy? It's quite possibly the world's hardest game."}, {"name": "Rubik's World", "details_link": "https://www.metacritic.com/game/wii/rubiks-world", "publisher": "The Game Factory", "release_date": "Nov  4 2008", "developers": ["Two Tribes"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/b16846662c12ca4b8c2c81787591f584-98.jpg", "descriptions": "Welcome to Rubik's Puzzle World - an abstract environment populated by \"Cubies\" which make up the game's DNA. Rubik's Puzzle World takes the shape, functionality and concept behind the famous Rubik's Cube but twists and turns the rules to transform it into a unique Puzzle filled gameWelcome to Rubik's Puzzle World - an abstract environment populated by \"Cubies\" which make up the game's DNA. Rubik's Puzzle World takes the shape, functionality and concept behind the famous Rubik's Cube but twists and turns the rules to transform it into a unique Puzzle filled game experience for players of all ages. Get ready for a collection of games infused with the mental challenges which made the original Rubik's Cube such a hit. The construction of the games will challenge your brain, enable you to solve increasingly difficult puzzles, and develop your logical capabilities - while having lots of fun! So take a trip inside the Rubik's Cube and enter an abstract world of Rubik's themed puzzles - each as addictive as the original cube we know and love. [The Game Factory]… Expand"}, {"name": "Killer Is Dead", "details_link": "https://www.metacritic.com/game/xbox-360/killer-is-dead", "publisher": "XSEED Games", "release_date": "Aug 27 2013", "developers": ["Grasshopper Manufacture"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "Sci-Fi", "General"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/3f8de8255f5b593dbfee7aea63937af8-98.jpg", "descriptions": "The latest title from the mind of game creator SUDA51 serving as a spiritual successor to previous cult favorites No More Heroes and Killer 7. Stylish cel-shaded visuals set the mood in this gritty, bloody, ultra-violent world where biomechanical augmentations increase the power of criminalsThe latest title from the mind of game creator SUDA51 serving as a spiritual successor to previous cult favorites No More Heroes and Killer 7. Stylish cel-shaded visuals set the mood in this gritty, bloody, ultra-violent world where biomechanical augmentations increase the power of criminals and “executioners” alike. Mondo Zappa, a newly recruited executioner, hunts criminals wielding a Japanese sword in his right hand, and powerful biomechanical engineering in his left.… Expand"}, {"name": "Dynasty Warriors: Strikeforce", "details_link": "https://www.metacritic.com/game/playstation-3/dynasty-warriors-strikeforce", "publisher": "Koei", "release_date": "Feb 16 2010", "developers": ["Omega Force"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 64, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/0eb483146a6b10f235e86250a690a6a3-98.jpg", "descriptions": "Infiltrate enemy strongholds with three of your friends in Dynasty Warriors: Strikeforce."}, {"name": "Crazy Taxi: Fare Wars", "details_link": "https://www.metacritic.com/game/psp/crazy-taxi-fare-wars", "publisher": "Sega", "release_date": "Aug  7 2007", "developers": ["Sega"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Miscellaneous", "Driving", "Mission-based", "Compilation"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/ee1fea7e28c8816054f226913dede72f-98.jpg", "descriptions": "Only skilled cabbies need apply in Crazy Taxi: Fare Wars, where drivers are more aggressive than ever to earn the big dollars by speeding fares to their destination, no matter what the obstacles. Brand new multiplayer gameplay features provide endless entertainment where players can stealOnly skilled cabbies need apply in Crazy Taxi: Fare Wars, where drivers are more aggressive than ever to earn the big dollars by speeding fares to their destination, no matter what the obstacles. Brand new multiplayer gameplay features provide endless entertainment where players can steal passengers from other cabbies by bumping their opponent's car and create chaotic competition on the road. Navigating through traffic, hills, and obstacles isn't easy, so it takes a skilled cabbie with no fear to earn the big bucks. Players can drive through the two original maps of Crazy Taxi, including the arcade map and the original Dreamcast map, both inspired by the steep hills, trademark cable cars, and breezy waterfront of San Francisco. Then they'll head for the Small Apple maps in \"Crazy Taxi 2,\" which is inspired by New York's large building fronts, hectic downtown streets, and the city's famous Central Park and subway system. Crazy Taxi: Fare Wars offers cabbies several single player modes including the mission-based Arcade mode, where skilled drivers earn time bonuses, and Time Trial mode where drivers collect the highest fares possible in the time allowed. In addition, for cabbies to practice their crazy driving skills, two mini-game training modes are available. They include Crazy Box, a collection of 16 original Crazy Taxi mini-games and Crazy Pyramid, mini-games arranged in a pyramid that drivers must complete to unlock more mini-games from \"Crazy Taxi 2.\" [Sega]… Expand"}, {"name": "Farming Simulator 15", "details_link": "https://www.metacritic.com/game/pc/farming-simulator-15", "publisher": "Focus Home Interactive", "release_date": "Oct 30 2014", "developers": ["Giants Software"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Simulation", "General", "Virtual", "Career"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/aab73c20c76c7e80a4943078959d959d-98.jpg", "descriptions": "Administer your own farm: from harvesting to animal husbandry, and from the sales of fresh products to woodcutting, the benefits of your exploitation allows you to develop, and invest in new and more powerful vehicles or tools."}, {"name": "Need for Speed: The Run", "details_link": "https://www.metacritic.com/game/playstation-3/need-for-speed-the-run", "publisher": "Electronic Arts", "release_date": "Nov 15 2011", "developers": ["Black Box", "EA Black Box"], "platforms": ["3DS", "PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 64, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/d11e450371e29ae7e4e69586c68f08ed-98.jpg", "descriptions": "Need for Speed The Run lures players into an underground world of illicit, high-stakes racing. The heat is on – and it isn’t just the fuzz who are after you. Entering the race is just the beginning as you blow across borders, weave through dense urban traffic, rocket down icy mountain passesNeed for Speed The Run lures players into an underground world of illicit, high-stakes racing. The heat is on – and it isn’t just the fuzz who are after you. Entering the race is just the beginning as you blow across borders, weave through dense urban traffic, rocket down icy mountain passes and navigate narrow canyons at breakneck speeds. Powered by DICE’s state-of-the-art Frostbite 2 engine, Need for Speed The Run takes the action racing genre to new heights with stunning visuals and car physics that hug the road even at top speeds all built around a gripping storyline. The cars are hot, the racing is intense and the story will have you at the edge of your seat… all the way from the Golden Gate Bridge to the Empire State building.… Expand"}, {"name": "Street Racing Syndicate", "details_link": "https://www.metacritic.com/game/gamecube/street-racing-syndicate", "publisher": "Namco", "release_date": "Aug 31 2004", "developers": ["Eutechnyx"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 64, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/ca1fde9cad78c0fdaffb9b13982b7b32-98.jpg", "descriptions": "From fancy cars to beautiful import models, Street Racing Syndicate delivers the fast-paced world of street racing. You can race for money, pink slips, and more through the streets of LA, Philadelphia, and Miami. With each win, you'll earn cash, respect, and the affections of real-worldFrom fancy cars to beautiful import models, Street Racing Syndicate delivers the fast-paced world of street racing. You can race for money, pink slips, and more through the streets of LA, Philadelphia, and Miami. With each win, you'll earn cash, respect, and the affections of real-world street racing models. Use your cash to customize vehicles with licensed parts and graphic upgrades. Showcase your vehicle in online races, but be ready to drive off track if the police come.… Expand"}, {"name": "Touhou Genso Wanderer Reloaded", "details_link": "https://www.metacritic.com/game/switch/touhou-genso-wanderer-reloaded", "publisher": "NIS America", "release_date": "Jul 17 2018", "developers": ["Mediascape"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/e4dffff2f1e17a88ac9279dbf6e7d367-98.jpg", "descriptions": "Join the colorful cast of Touhou characters on an incredible journey through the Tower of Desire! Touhou Genso Wanderer Reloaded is the definitive edition of a roguelike masterpiece, filled with new dungeons to explore, new items to collect, and new faces to meet! Newcomers and veterans ofJoin the colorful cast of Touhou characters on an incredible journey through the Tower of Desire! Touhou Genso Wanderer Reloaded is the definitive edition of a roguelike masterpiece, filled with new dungeons to explore, new items to collect, and new faces to meet! Newcomers and veterans of the Touhou series will love journeying through the land of Gensokyo with Reimu Hakurei, the shrine maiden of the Hakurei Shrine, as well as new faces such as the spunky magician Marisa Kirisame, and wind priestess Sanae Kochiya! And now, with a ton of new content, new and veteran players can experience the world of Touhou wherever they go.… Expand"}, {"name": "Scribblenauts Showdown", "details_link": "https://www.metacritic.com/game/playstation-4/scribblenauts-showdown", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar  6 2018", "developers": ["Warner Bros. Interactive Entertainment"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 64, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/e31fc2ea7ae02b60ea8dacc21a435c3b-98.jpg", "descriptions": "The game is designed primarily to be played with friends: up to four players can partake in \"more than\" 25 mini-games, which are served up in different forms depending on which mode you select. Showdown is a competitive mode in which finding the best word the quickest is the key, whileThe game is designed primarily to be played with friends: up to four players can partake in \"more than\" 25 mini-games, which are served up in different forms depending on which mode you select. Showdown is a competitive mode in which finding the best word the quickest is the key, while Versus supplies various mini-games for you and one other friend to battle in, one-vs-one. Sandbox is a more traditional Scribblenauts mode that will be familiar to fans of the series. Here you can summon a variety of objects--publisher Warner Bros. says over 35,000 items are available in-game--to solve objectives either by yourself or with a friend. Eight new levels are included, as are hidden collectibles and achievements.… Expand"}, {"name": "The Golf Club", "details_link": "https://www.metacritic.com/game/xbox-one/the-golf-club", "publisher": "HB Studios Multimedia", "release_date": "Aug 19 2014", "developers": ["HB Studios Multimedia"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Traditional", "Sports", "Individual", "Golf", "Sim"], "meta_score": 64, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/b58f32d941e2c1f5d1ecfb43dd989062-98.jpg", "descriptions": "The Golf Club is HB Studios' next generation golf simulation. What really takes The Golf Club into the next generation is the procedural generation of courses and depth of social interaction. The Course Creator can generate a brand new course in seconds which can be shared and playedThe Golf Club is HB Studios' next generation golf simulation. What really takes The Golf Club into the next generation is the procedural generation of courses and depth of social interaction. The Course Creator can generate a brand new course in seconds which can be shared and played immediately online with friends and other gamers across the world. There are also full editing capabilities for courses, Tournaments and Tours. Challenge your friends on a new or existing course in real time or try to beat their best recorded round. Add to this a myriad of stat tracking and personal bests of friends and rivals to beat, notifications, challenges and social media integration.… Expand"}, {"name": "Dynasty Warriors 7: Xtreme Legends", "details_link": "https://www.metacritic.com/game/playstation-3/dynasty-warriors-7-xtreme-legends", "publisher": "Koei Tecmo Games", "release_date": "Nov 15 2011", "developers": ["Omega Force"], "platforms": "PlayStation 3", "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/930e60449d4fc9538ebca3219dcb88e7-98.jpg", "descriptions": "Dynasty Warriors 7: Xtreme Legends is a stand-alone expansion that super-charges the Dynasty Warriors 7 world."}, {"name": "Time Hollow", "details_link": "https://www.metacritic.com/game/ds/time-hollow", "publisher": "Konami", "release_date": "Sep 23 2008", "developers": ["Tenky"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Visual Novel"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/d83764b60a7d9fe0ef5015a341abd171-98.jpg", "descriptions": "Featuring a variety of interesting characters that come to life via the words of Junko Kawano, script writer for \"Suikoden IV,\" Time Hollow enables players to guide Ethan Kairos on his quest to solve the mysterious disappearance of his family. While on his quest, Ethan comes across theFeaturing a variety of interesting characters that come to life via the words of Junko Kawano, script writer for \"Suikoden IV,\" Time Hollow enables players to guide Ethan Kairos on his quest to solve the mysterious disappearance of his family. While on his quest, Ethan comes across the mysterious Hollow Pen - an uncanny object that has the unique power to open portals to the past. Using the stylus pen and dual screen capabilities of the DS, players can use the Hollow Pen to draw portals between past and present. As they progress through their journey, they will encounter a variety of interesting characters that help them guide Ethan on his search for his family. [Konami]… Expand"}, {"name": "Pokemon XD: Gale of Darkness", "details_link": "https://www.metacritic.com/game/gamecube/pokemon-xd-gale-of-darkness", "publisher": "Nintendo", "release_date": "Sep 28 2005", "developers": ["Genius Sonority Inc."], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 64, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/34a7332b3ea2e9ce1a96a82ab0dc8d4d-98.jpg", "descriptions": "Pokemon XD is a sequel to the role-playing game Pokémon Coliseum. You'll play as Michael, a Pokémon trainer who is trying to thwart the evil Cipher. Cipher plans to control the world by using the powerful, but unpredictable, shadow Pokémon. Now you must fight back byPokemon XD is a sequel to the role-playing game Pokémon Coliseum. You'll play as Michael, a Pokémon trainer who is trying to thwart the evil Cipher. Cipher plans to control the world by using the powerful, but unpredictable, shadow Pokémon. Now you must fight back by collecting your own shadow Pokémon and beating Cipher's goons in battle. Pokémon XD also lets you import Pokémon from Game Boy Advance Pokémon games and participate in head-to-head battles with other players.… Expand"}, {"name": "Silent Hill: Downpour", "details_link": "https://www.metacritic.com/game/playstation-3/silent-hill-downpour", "publisher": "Konami", "release_date": "Mar 13 2012", "developers": ["Vatra"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 64, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/3e1c9a5cc1733593b6c07527ac442a58-98.jpg", "descriptions": "The survival horror experience begins after a prison transport vehicle careens off the road, leaving lone inmate Murphy Pendleton stranded in Silent Hill.  Gamers will encounter mind-bending puzzles, as well as horrific creatures and other world terrors using everyday objects from woodenThe survival horror experience begins after a prison transport vehicle careens off the road, leaving lone inmate Murphy Pendleton stranded in Silent Hill.  Gamers will encounter mind-bending puzzles, as well as horrific creatures and other world terrors using everyday objects from wooden chairs to glass bottles to fend off their enemies.  The natural response, fight or flight is left to the player as they unravel a dark, thought-provoking storyline which will appeal to fans of the early, classic Silent Hill series, as well as anyone who enjoys a deep, psychological horror experience.  In addition to the main storyline, players will also be presented with variable side quests along the way that can change depending on their play style, revealing unknown evils within the town.… Expand"}, {"name": "Secret Ponchos", "details_link": "https://www.metacritic.com/game/playstation-4/secret-ponchos", "publisher": "Switchblade Monkeys", "release_date": "Dec  2 2014", "developers": ["Switchblade Monkeys"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/aecd850bfe07c8567d9c13417843d0a4-98.jpg", "descriptions": "Engage in one-on-one duels or all-out gunfights as one of several unique and customizable outlaws - each with his or her own strengths, weapon types, special moves and play styles - in a game that rewards tactical awareness, precision timing and player skill. Add in melee attacks, anEngage in one-on-one duels or all-out gunfights as one of several unique and customizable outlaws - each with his or her own strengths, weapon types, special moves and play styles - in a game that rewards tactical awareness, precision timing and player skill. Add in melee attacks, an original line-of-sight mechanic, cover fire, destructible cover objects and more, and Secret Ponchos is a game with exceptional depth.… Expand"}, {"name": "NUTS", "details_link": "https://www.metacritic.com/game/switch/nuts", "publisher": "Noodlecake Studios", "release_date": "Feb  4 2021", "developers": ["Joon", "Pol", "Muutsch", "Char & Torfi"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/50ae0b2e09e4cf5ba3fe5b88ebccf221-98.jpg", "descriptions": "Spy on squirrels in the forest. A single-player surveillance mystery set in a remote forest - record the squirrels, report your findings… and uncover the secret that the curious creatures are hiding. Gear up your caravan, boot up your GPS, spread out your map and head for the depths ofSpy on squirrels in the forest. A single-player surveillance mystery set in a remote forest - record the squirrels, report your findings… and uncover the secret that the curious creatures are hiding. Gear up your caravan, boot up your GPS, spread out your map and head for the depths of Melmoth Forest. As a rookie field researcher, you’ll place cameras during the day, and watch the footage at night, tracking the movements of a scurry of squirrels. Where do they hide their nuts? What puzzling routes do they take? And why do they behave so strangely?… Expand"}, {"name": "Wrecked: Revenge Revisited", "details_link": "https://www.metacritic.com/game/playstation-3/wrecked-revenge-revisited", "publisher": "505 Games", "release_date": "Mar 28 2012", "developers": ["Supersonic Software"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/67e74def42ef4af0afc0d875c5d631b0-98.jpg", "descriptions": "In WRECKED, players are required to drive aggressively with a chip on their shoulders, utilizing a variety of weapons and vehicle enhancements to take their opponents out of the race. However, vanquished foes are able to exact vengeance against those who knocked them out through fiveIn WRECKED, players are required to drive aggressively with a chip on their shoulders, utilizing a variety of weapons and vehicle enhancements to take their opponents out of the race. However, vanquished foes are able to exact vengeance against those who knocked them out through five different aerial strikes.… Expand"}, {"name": "Tekken 3D Prime Edition", "details_link": "https://www.metacritic.com/game/3ds/tekken-3d-prime-edition", "publisher": "Namco Bandai Games", "release_date": "Feb 14 2012", "developers": ["Arika"], "platforms": "3DS", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/185ae321eaecb382c05a5b393c17830d-98.jpg", "descriptions": "Namco Bandai brings the Tekken franchise to the Nintendo 3DS."}, {"name": "London 2012 - The Official Video Game of the Olympic Games", "details_link": "https://www.metacritic.com/game/xbox-360/london-2012---the-official-video-game-of-the-olympic-games", "publisher": "Sega", "release_date": "Jun 26 2012", "developers": ["Sega Studios Australia"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Olympic Sports", "Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/c7b14887481444a2a36aba28b9d78e11-98.jpg", "descriptions": "London 2012 - The Official Video Game of the Olympic Games will allow gamers to create their own moments of sporting history and fame by experiencing the thrill and adrenaline rush of the events and disciplines that will be a part of the London 2012 Olympic Games. With over 30 events inLondon 2012 - The Official Video Game of the Olympic Games will allow gamers to create their own moments of sporting history and fame by experiencing the thrill and adrenaline rush of the events and disciplines that will be a part of the London 2012 Olympic Games. With over 30 events in which to claim gold, players will enjoy more gameplay variety than ever before, even taking the race for medals online by competing for personal and national glory with online leaderboards.… Expand"}, {"name": "Treachery in Beatdown City", "details_link": "https://www.metacritic.com/game/pc/treachery-in-beatdown-city", "publisher": "Nuchallenger", "release_date": "Mar 30 2020", "developers": ["Nuchallenger"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/51d06eff3b82bac713ef0fe0d19e699f-98.jpg", "descriptions": "Explore an urban dystopia, meet awful people, and use an all new beat 'em up system infused with RPG/tactics/wrestling mechanics to make them think twice about picking a fight! Pick your fighter, build custom STRIKE and GRAPPLE combos, and knock out your enemies, all to save the president."}, {"name": "Xenon Racer", "details_link": "https://www.metacritic.com/game/pc/xenon-racer", "publisher": "Soedesco", "release_date": "Mar 26 2019", "developers": ["3DClouds.it", "3DClouds"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 64, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/dde7449a3c5ce8852a6a5cc5202e9519-98.jpg", "descriptions": "It’s the year 2030, the era of flying vehicles. A one-off championship for wheel based vehicles has been organised, with cutting-edge electric cars boosted by Xenon gas. Drift through cities like Tokyo and Dubai as fast as you can and claim eternal glory."}, {"name": "The Silver Case", "details_link": "https://www.metacritic.com/game/pc/the-silver-case", "publisher": "Grasshopper Manufacture", "release_date": "Oct  6 2016", "developers": ["Grasshopper Manufacture"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 64, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/219f7538955a49a7180ced68afdc9aab-98.jpg", "descriptions": "The debut game from developer SUDA51, \"The Silver Case\" is fully remastered, localized into English for the first time."}, {"name": "Tokyo Twilight Ghost Hunters: Daybreak Special Gigs", "details_link": "https://www.metacritic.com/game/playstation-vita/tokyo-twilight-ghost-hunters-daybreak-special-gigs", "publisher": "Aksys Games", "release_date": "Sep 20 2016", "developers": ["Arc System Works", "Now Production"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita"], "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/871b8ae9493310a7e74c89d85625d875-98.jpg", "descriptions": "Tokyo Twilight Ghost Hunters Daybreak: Special Gigs weaves an intricate story that pushes the boundaries of reality as you battle restless spirits causing chaos throughout Tokyo!"}]