[{"name": "SimCity: Cities of Tomorrow Expansion Pack", "details_link": "https://www.metacritic.com/game/pc/simcity-cities-of-tomorrow-expansion-pack", "publisher": "Electronic Arts", "release_date": "Nov 12 2013", "developers": ["Maxis"], "platforms": "PC", "genres": ["Modern", "Strategy", "City Building", "Management", "Modern", "Government"], "meta_score": 61, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/3/f837fd9188dd6d8445cc57ab9c4e0498-98.jpg", "descriptions": "Brace yourself for an all-new type of disaster only fitting a technologically-advanced economy: a giant robot attack on your city. Unlock two new city specializations that allow you to build a resource-hungry mega corporation powered by a low-wealth workforce, or an urban utopia thatBrace yourself for an all-new type of disaster only fitting a technologically-advanced economy: a giant robot attack on your city. Unlock two new city specializations that allow you to build a resource-hungry mega corporation powered by a low-wealth workforce, or an urban utopia that develops clean technology and is controlled by the rich. Watch your city transform as it adapts to the changing times, with new options based on real-world technology such as Mag Levs that rise above the city streets and small buildings, futurized vehicles, and service drones. … Expand"}, {"name": "Emergency 2012", "details_link": "https://www.metacritic.com/game/pc/emergency-2012", "publisher": "ValuSoft", "release_date": "Nov 22 2010", "developers": ["ValuSoft"], "platforms": "PC", "genres": ["Action", "General", "General"], "meta_score": 61, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/b923316f69575ae70ac4fc25c7c15279-98.jpg", "descriptions": "Warning! The world as we know it is out of control! As the head of all rescue operations - you must ensure that the job gets done with all fire and rescue services, police and specialist personnel. The world is counting on you - can you handle the pressure?"}, {"name": "Football Genius - The Ultimate Quiz", "details_link": "https://www.metacritic.com/game/xbox-360/football-genius---the-ultimate-quiz", "publisher": "RTL", "release_date": "Sep 30 2009", "developers": ["RTL"], "platforms": "Xbox 360", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/1acdce6333bb442e4da9fc9ece373371-98.jpg", "descriptions": "[Xbox Live Arcade]  Are you a Football Genius? Test your football knowledge in Football Genius - The Ultimate Quiz! The game features six questions packs covering International, English, French, German, Italian, and Spanish football with over 3500 questions about your favorite teams,[Xbox Live Arcade]  Are you a Football Genius? Test your football knowledge in Football Genius - The Ultimate Quiz! The game features six questions packs covering International, English, French, German, Italian, and Spanish football with over 3500 questions about your favorite teams, players, and tournaments! [RTL]… Expand"}, {"name": "The Spiderwick Chronicles", "details_link": "https://www.metacritic.com/game/pc/the-spiderwick-chronicles", "publisher": "Sierra Entertainment", "release_date": "Feb  5 2008", "developers": ["Stormfront Studios"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/99e1dad295025af34ddd831a206ee605-98.jpg", "descriptions": "The Spiderwick Chronicles is a video game based on the theatrical release by Paramount Pictures and Nickelodeon Films. The game recreates the fantastical world of the Spiderwick film and best-selling book series. The Spiderwick Chronicles video game recreates the world of Jared, Simon andThe Spiderwick Chronicles is a video game based on the theatrical release by Paramount Pictures and Nickelodeon Films. The game recreates the fantastical world of the Spiderwick film and best-selling book series. The Spiderwick Chronicles video game recreates the world of Jared, Simon and Mallory Grace, putting gamers in their shoes as they discover a hidden world of fantastical creatures - sprites, ogres, goblins, brownies and more. [Sierra Entertainment]… Expand"}, {"name": "Fullmetal Alchemist: Trading Card Game", "details_link": "https://www.metacritic.com/game/ds/fullmetal-alchemist-trading-card-game", "publisher": "Destineer", "release_date": "Oct 15 2007", "developers": ["Magellan Interactive"], "platforms": "DS", "num_players": "2  Online", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 61, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/3c43224b583d82be54c156ae978fc1a6-98.jpg", "descriptions": "A completely accurate translation of the popular Fullmetal Alchemist trading card series by Press Pass, Inc (formerly JoyRide Entertainment), the Fullmetal Alchemist Trading Card Game brings the collectible strategy game to the Nintendo DS with nearly 500 cards, a variety of play modes, andA completely accurate translation of the popular Fullmetal Alchemist trading card series by Press Pass, Inc (formerly JoyRide Entertainment), the Fullmetal Alchemist Trading Card Game brings the collectible strategy game to the Nintendo DS with nearly 500 cards, a variety of play modes, and extensive touch screen support. Featuring the most popular characters from one of the top-rated anime programs on Adult Swim, the Fullmetal Alchemist Trading Card Game allows you to battle against both AI-controlled opponents and friends via the Nintendo DS’ Wi-Fi capabilities. Earn new cards in Character mode, learn to play in Tutorial mode, or even build your ideal deck in Fantasy mode. With every card from the original trading card set and the complete Blood and Water expansion, the Nintendo DS version of the Fullmetal Alchemist Trading Card Game has everything that both trading card fans and Fullmetal Alchemist aficionados could want, including: Multiple play modes, including Single match, Character mode, Fantasy mode, and Multiplayer via Wi-Fi. The complete rule set from the Press Pass Fullmetal Alchemist trading card game Unlockable characters like Edward Elric, Roy Mustang, Father Cornello and Lust, complete with voiceovers from the original English cast. [Destineer]… Expand"}, {"name": "Surf's Up", "details_link": "https://www.metacritic.com/game/xbox-360/surfs-up", "publisher": "Ubisoft", "release_date": "May 30 2007", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Alternative", "Individual", "Surfing", "Surfing", "Surf / Wakeboard"], "meta_score": 61, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/43e6e45d503427b81ab2dbdbabc15696-98.jpg", "descriptions": "Surf's Up is an arcade surfing and extreme sports video game. The action is set at the annual \"Reggie Belafonte Big Z Memorial Surf Off,\" where surfers from around the world are ready to risk it all for glory. Players experience the rush and thrills of surfing in exotic surf spots around PenSurf's Up is an arcade surfing and extreme sports video game. The action is set at the annual \"Reggie Belafonte Big Z Memorial Surf Off,\" where surfers from around the world are ready to risk it all for glory. Players experience the rush and thrills of surfing in exotic surf spots around Pen Gu Island and can rip it up and play as one of 10 characters from the film, including Cody, the young challenger from Shiverpool; Tank, the merciless champion; or Big Z, the surfing legend from the past. Only by mastering and understanding the waves can the player become not only the new champion, but a true surf legend. Game features include: Innovative arcade and surf feeling with players performing a variety of impressive tricks in the air and learning to surf inside a tube. Win the championship in the single-player mode or challenge your friends in the multiplayer mode with easy pick-up-and-play game controls. Surf in a variety of locations, each with its own waves and obstacles. Train in the calm water of Shiverpool, ride your first tubes in Pen Gu Island, and try to surf on the explosive waters of the volcano area. [Ubisoft]… Expand"}, {"name": "NBA Live 07", "details_link": "https://www.metacritic.com/game/pc/nba-live-07", "publisher": "EA Sports", "release_date": "Sep 25 2006", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 61, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/2/8d3b652e917737fc65b2212044d49012-98.jpg", "descriptions": "NBA LIVE 07 plays as good as it looks with gameplay advancements that build upon the depth and authenticity that the NBA LIVE franchise has delivered for more than a decade. NBA LIVE 07 introduces the next generation of basketball gameplay with EA SPORTS Total Freestyle Control, a newNBA LIVE 07 plays as good as it looks with gameplay advancements that build upon the depth and authenticity that the NBA LIVE franchise has delivered for more than a decade. NBA LIVE 07 introduces the next generation of basketball gameplay with EA SPORTS Total Freestyle Control, a new feature that gives users more control over athletes than ever. By introducing a next generation AI system that is both intuitive and intelligent, combined with advancements to fan-favorite features like All-Star Weekend and Dynasty Mode, NBA LIVE 07 continues to deliver its award-winning gameplay experience. This year NBA LIVE 07 partners with the worldwide leader in sports to deliver more ESPN content in-game while you play than ever before. [Electronic Arts]… Expand"}, {"name": "Teen Titans", "details_link": "https://www.metacritic.com/game/game-boy-advance/teen-titans", "publisher": "THQ", "release_date": "Oct 16 2005", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "Game Boy Advance"], "genres": ["Action Adventure", "Modern"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/f0a5d1da3034656922393bf697794b73-98.jpg", "descriptions": "Brother Blood has cloned the Teen Titans, and it's up to you to fight them to save the city in Teen Titans for the Game Boy Advance. Teen Titans is based on the cartoon series of the same name, and it lets you play as Robin, Starfire, Beast Boy, Cyborg, or Raven. By switching your characterBrother Blood has cloned the Teen Titans, and it's up to you to fight them to save the city in Teen Titans for the Game Boy Advance. Teen Titans is based on the cartoon series of the same name, and it lets you play as Robin, Starfire, Beast Boy, Cyborg, or Raven. By switching your character in real time, you can take advantage of the unique attacks and abilities that each has to offer. Battle familiar enemies from the series through various environments that are littered with environmental hazards, power-ups, and hidden bonus items.… Expand"}, {"name": "Civilization III: Play the World", "details_link": "https://www.metacritic.com/game/pc/civilization-iii-play-the-world", "publisher": "Infogrames", "release_date": "Oct 25 2002", "developers": ["Firaxis Games"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Historic", "Historic", "4X"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/487c2772bb7d568592d69deb403c5a30-98.jpg", "descriptions": "Rise to meet new challenges as you battle eight new Civilizations and Leaders in the exciting follow-up to the game that many consider the greatest of all time! With exciting new single player and multiplayer features and scenarios, Civilization III: Play the World pits you against the bestRise to meet new challenges as you battle eight new Civilizations and Leaders in the exciting follow-up to the game that many consider the greatest of all time! With exciting new single player and multiplayer features and scenarios, Civilization III: Play the World pits you against the best Civilization players from all corners of the earth. With new online modes of play, the battle for the ultimate in bragging rights will be intense! Also included is a powerful Scenario Editor, giving you access to scenarios created by the thousands of members of the Civilization III: Play the World community. Play scenarios created by others, or build your own - replayability is now truly limitless with this new benchmark in strategy gaming! [Infogrames]… Expand"}, {"name": "Prince of Qin", "details_link": "https://www.metacritic.com/game/pc/prince-of-qin", "publisher": "Strategy First", "release_date": "Aug 19 2002", "developers": ["Object"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/197a5f6db20eb3ed1eba42697be3f2b6-98.jpg", "descriptions": "Prince Of Qin is an action role-playing game, which takes place around 2,200 years ago during the last 20 years of the Qin Dynasty. Players can play as Fu Su, the Crown Prince of Qin. According to history, the Prince committed suicide in obedience to an imperial decree that was forged by hisPrince Of Qin is an action role-playing game, which takes place around 2,200 years ago during the last 20 years of the Qin Dynasty. Players can play as Fu Su, the Crown Prince of Qin. According to history, the Prince committed suicide in obedience to an imperial decree that was forged by his younger brother Hu Hai, who went on to become the Second Emperor of Qin. In this game Prince Fu Su does not die, but strives to take revenge on his enemies and becomes the Emperor of Qin in accordance with his birthright. [Strategy First Inc.]… Expand"}, {"name": "Nightcaster", "details_link": "https://www.metacritic.com/game/xbox/nightcaster", "publisher": "Microsoft Game Studios", "release_date": "Jan 21 2002", "developers": ["Jaleco Entertainment"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 61, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/d1c479e12dc105bfd0f3e1dd18f9bd6d-98.jpg", "descriptions": "Battling against eternal darkness, you are Arran, a young wizard embarking on quest filled with explosive spell combat and adventure. Armed with your magical orb and immense spell collection, you age from a young wizard into an older powerful sorcerer.\rDefeat your enemies with aBattling against eternal darkness, you are Arran, a young wizard embarking on quest filled with explosive spell combat and adventure. Armed with your magical orb and immense spell collection, you age from a young wizard into an older powerful sorcerer.\rDefeat your enemies with a revolutionary control system: direct movement with one analog stick and aim with the other. Embrace your destiny; restore light to your homeland.… Expand"}, {"name": "Rune: Halls of Valhalla", "details_link": "https://www.metacritic.com/game/pc/rune-halls-of-valhalla", "publisher": "Gathering", "release_date": "Apr 26 2001", "developers": ["Human Head Studios"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/205921d4d151b8a50f6c82333a63254b-98.jpg", "descriptions": "Still into Vikings even though you're not from Minnesota?  G.O.D's budget stand-alone expansion pack may be your cup of gruel -- it's exclusively a multiplayer experience, features 30 new levels, new maps and modes, and a patch for the original game."}, {"name": "Gauntlet: Seven Sorrows", "details_link": "https://www.metacritic.com/game/xbox/gauntlet-seven-sorrows", "publisher": "Midway", "release_date": "Dec 12 2005", "developers": ["Midway"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG"], "meta_score": 61, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/bd202b3c3dd1b4bd16d8968e45c53c49-98.jpg", "descriptions": "The arcade classic returns with Gauntlet: Seven Sorrows. The game improves upon the old title with a deeper fighting system and light RPG elements. Now you can choose from six heroes, each with their own fighting style, abilities, and backstory. Gauntlet: Seven Sorrows has solo, cooperative,The arcade classic returns with Gauntlet: Seven Sorrows. The game improves upon the old title with a deeper fighting system and light RPG elements. Now you can choose from six heroes, each with their own fighting style, abilities, and backstory. Gauntlet: Seven Sorrows has solo, cooperative, and online play modes. You can go online to join parties of fighters and trade goods. … Expand"}, {"name": "Ar tonelico Qoga: Knell of Ar Ciel", "details_link": "https://www.metacritic.com/game/playstation-3/ar-tonelico-qoga-knell-of-ar-ciel", "publisher": "NIS America", "release_date": "Mar 15 2011", "developers": ["Gust"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 61, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/d41d27f3792278095d271cbc1c646bbd-98.jpg", "descriptions": "A unique game style where action-based combat meets RPG."}, {"name": "The Dwarves", "details_link": "https://www.metacritic.com/game/pc/the-dwarves", "publisher": "EuroVideo Medien", "release_date": "Dec  1 2016", "developers": ["KING Art", "King Art Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 61, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/a76b6d9c843bb5f7f82ac3873db4da61-98.jpg", "descriptions": "A few heroes are facing hundreds of foes – are you even able to lead the coolest fantasy people to victory against the dark hordes? Explore a vast world, fight tactical real-time battles, and experience the fantastic story based on the bestseller \"The Dwarves\"."}, {"name": "Vietcong 2", "details_link": "https://www.metacritic.com/game/pc/vietcong-2", "publisher": "2K Games", "release_date": "Oct 24 2005", "developers": ["Pterodon"], "platforms": "PC", "num_players": "64  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Arcade"], "meta_score": 61, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/81bbb4040726da51a892e73293b8df78-98.jpg", "descriptions": "Vietcong 2 is a FPS set against the background of the 1968 Tet Offensive, in and around the ancient city of Hue during the Vietnam War. Brought to life through a gritty story compiled from first hand accounts and memories of Special Forces and Infantry servicemen stationed in Hue during theVietcong 2 is a FPS set against the background of the 1968 Tet Offensive, in and around the ancient city of Hue during the Vietnam War. Brought to life through a gritty story compiled from first hand accounts and memories of Special Forces and Infantry servicemen stationed in Hue during the assault. [2K Games]… Expand"}, {"name": "StarDrive", "details_link": "https://www.metacritic.com/game/pc/stardrive", "publisher": "Iceberg Interactive", "release_date": "Apr 26 2013", "developers": ["Zero Sum Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/35106e4b6f0d533b1d919a55d01a65b5-98.jpg", "descriptions": "In StarDrive, you will design your own race to lead into the stars. You will find new worlds to colonize and conquer, meet strange aliens to trade with or war upon, and implement strategies to promote trade within and growth of your interstellar empire.  Expand your military forces byIn StarDrive, you will design your own race to lead into the stars. You will find new worlds to colonize and conquer, meet strange aliens to trade with or war upon, and implement strategies to promote trade within and growth of your interstellar empire.  Expand your military forces by researching new technologies and ship designs. And, when provoked by alien warmongering or the urge to conquer, lead your customized fleets and ships into pulse-pounding battles for supremacy of the galaxy.… Expand"}, {"name": "Create", "details_link": "https://www.metacritic.com/game/playstation-3/create", "publisher": "EA Games", "release_date": "Nov 16 2010", "developers": ["EA Bright Light"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 61, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/8/b061c2762206a4eeead61a99ca789b7b-98.jpg", "descriptions": "The more players explore the game, solve level-based challenges, and customize their world, the more rewards will be unlocked. Creativity will be unleashed as players design environments with easy-to-use brushes and tools, including textures, props and animating objects that bring the sceneThe more players explore the game, solve level-based challenges, and customize their world, the more rewards will be unlocked. Creativity will be unleashed as players design environments with easy-to-use brushes and tools, including textures, props and animating objects that bring the scene to life. On the PlayStation 3, Xbox 360, PC, and MAC players can share any of their creations, solutions or challenges with the community through the console and also via the official Create website at www.create.ea.com. Friends can download and remix solutions and set challenges for other players to download and complete. Imaginations will run wild this holiday!… Expand"}, {"name": "Deiland: Pocket Planet Edition", "details_link": "https://www.metacritic.com/game/switch/deiland-pocket-planet-edition", "publisher": "Chibig", "release_date": "Apr 15 2021", "developers": ["Chibig"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/07bf69745bce6faaedee00f62cd3bc5e-98.jpg", "descriptions": "Deiland: Pocket Planet Edition is a farming adventure where you will have to take care of your tiny planet. Farm, craft, fight and explore the universe of Deiland. Deiland: Pocket Planet Edition is a relaxing farming adventure where you will have to take care of your tiny planet. Farm, craftDeiland: Pocket Planet Edition is a farming adventure where you will have to take care of your tiny planet. Farm, craft, fight and explore the universe of Deiland. Deiland: Pocket Planet Edition is a relaxing farming adventure where you will have to take care of your tiny planet. Farm, craft and fight monsters to make your home a special place and help others with their quest. Discover the story of Arco in this single-player experience, a tale about growing up, helping others and revealing the secrets that lie on the heart of your planet. We’ve crafted a relaxing game, with a strong narrative and a cast of diverse characters for you to meet.\r - Customize your planet with trees, plants, crops, flowers or structures, and take care of your farm animals.\r- Discover how the whole planet changes through Spring, Summer, Autumn and Winter. Each crop will only be available in the right seasons.\r- Over 12 characters to meet and befriend.\r- Day and night cycle that have an effect on the world with natural elements like meteor showers, storms, shooting stars, aurora borealis or hurricane winds.\r- More than 100 quests to uncover the secrets that the heart of your planet holds.\r- Play and relax. Smooth and cute graphics as well as relaxing soundtrack to ease up the bustling everyday routine.\r… Expand"}, {"name": "Far Cry 5: Lost on Mars", "details_link": "https://www.metacritic.com/game/pc/far-cry-5-lost-on-mars", "publisher": "Ubisoft", "release_date": "Jul 17 2018", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 61, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/099b26a23c2000551bfe919687369a87-98.jpg", "descriptions": "Nick Rye, the \"King of the Skies\" is ready to go - literally - above and beyond, to discover uncharted territories. Once you're stranded on the red planet, your mission is simple: stop the Martian Arachnid invasion and get back home safely."}, {"name": "Dance Dance Revolution: Disney Channel Edition", "details_link": "https://www.metacritic.com/game/playstation-2/dance-dance-revolution-disney-channel-edition", "publisher": "Konami", "release_date": "Jan  8 2008", "developers": ["Keen Games"], "platforms": "PlayStation 2", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/0c0d6f0f14e9525e8fcda53399f5cf15-98.jpg", "descriptions": "The magical world of Disney hits the dancefloor with an entirely new DanceDanceRevolution game on the PS2. Leveraging some of the hottest and most popular shows and characters from the Disney Channel network, DanceDanceRevolution Disney Channel combines the mega-popular DDR dancingThe magical world of Disney hits the dancefloor with an entirely new DanceDanceRevolution game on the PS2. Leveraging some of the hottest and most popular shows and characters from the Disney Channel network, DanceDanceRevolution Disney Channel combines the mega-popular DDR dancing phenomenon with content that is cool and relevant with today’s youth. Featuring music and characters from some of Disney Channel’s biggest sensations such as High School Musical, Hannah Montana, The Suite Life of Zack and Cody, That’s So Raven, Cheetah Girls, Kim Possible & more. 40 songs including other popular hits. Multiple difficulty levels so everyone can get out there and dance. [Konami]… Expand"}, {"name": "Death Jr.", "details_link": "https://www.metacritic.com/game/psp/death-jr", "publisher": "Konami", "release_date": "Aug 16 2005", "developers": ["Backbone Entertainment"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 61, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/12402aa019e6c3aacddd6b61a83879e0-98.jpg", "descriptions": "Death, Jr. embarks with his friends on a school fieldtrip to the local museum. When the group sneaks away to explore on their own, they unwittingly unleash an ancient evil force from a mysterious locked box. Facing near insurmountable odds and the threat of being grounded and sent toDeath, Jr. embarks with his friends on a school fieldtrip to the local museum. When the group sneaks away to explore on their own, they unwittingly unleash an ancient evil force from a mysterious locked box. Facing near insurmountable odds and the threat of being grounded and sent to military school, Death, Jr. and his pals must fight hoards of demons and their wicked master Moloch through the museum and surrounding town before anyone else finds out. In order to avoid being punished for his mischief, and to save his friends from eternal suffering at the hands of Moloch, Death, Jr. must eliminate the evil demon scourge that has taken over the town. Armed with his scythe and an arsenal of guns and explosives, Death, Jr. will battle through numerous action-filled levels towards a final confrontation with Moloch himself. [Konami]… Expand"}, {"name": "Perception", "details_link": "https://www.metacritic.com/game/xbox-one/perception", "publisher": "The Deep End Games", "release_date": "Jun  6 2017", "developers": ["The Deep End Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 61, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/309e033c6cd291ed6c00fc46e3792529-98.jpg", "descriptions": "A first person narrative horror adventure that puts players in the shoes of a young blind woman who must use her extraordinary hearing and razor-sharp wits to solve mysteries and escape a deadly presence."}, {"name": "Signal Ops", "details_link": "https://www.metacritic.com/game/pc/signal-ops", "publisher": "Space Bullet Dynamics Corporation", "release_date": "Apr  5 2013", "developers": ["Space Bullet Dynamics Corporation"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 61, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/83c1e73cec24acf6369aff29446672f9-98.jpg", "descriptions": "In Signal Ops, you guide agents from the relative safety of a control room. Complete daring missions to plant evidence, steal secrets, assassinate targets, and perform sabotage. Take advantage of multiple simultaneous first person views to stealthily evade enemies or get the drop on them."}, {"name": "Venetica", "details_link": "https://www.metacritic.com/game/pc/venetica", "publisher": "Atari", "release_date": "Jan 25 2011", "developers": ["Deck 13"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Third-Person", "Third-Person", "General"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/d93b9a32fc6fcc37a52572e038317992-98.jpg", "descriptions": "Set in the fantastic world of long ago Venice, the young Scarlett falls victim to a terrible mystery, which begins with the murder of her companion by a secretive alliance of mighty necromancers. Thus fate takes its inevitable course and threatens to throw the world out of order. ScarlettSet in the fantastic world of long ago Venice, the young Scarlett falls victim to a terrible mystery, which begins with the murder of her companion by a secretive alliance of mighty necromancers. Thus fate takes its inevitable course and threatens to throw the world out of order. Scarlett finds out that she is the daughter of death incarnate and is blessed with his ultimate powers. She is the only one who can stop the gruesome powers that threaten to destroy the entire living world. Now it's your chance to reverse fate! Get ready for a fast-paced adventure set in an epic world filled with dark dangers and merciless adversaries. Arm yourself with mighty weapons, rally together powerful allies and master the dark powers of death. Can you conquer the powers that threaten to inescapably destroy the world of the living? Follow your path down into the deepest abyss to death itself - and back again, if you are worthy. [DTP]… Expand"}, {"name": "Raiden III", "details_link": "https://www.metacritic.com/game/playstation-2/raiden-iii", "publisher": "UFO Interactive", "release_date": "Apr 17 2007", "developers": ["Moss"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/16bef2824cdfad475b929bd36732ab7b-98.jpg", "descriptions": "Shoot. Evade. Destroy! Fight your way through countless enemies as you pilot the legendary Raiden fighter in this latest installment for your PlayStation 2. Enhanced Graphics – The series has transitioned from its 2D roots to 3D, creating lush environments, devastating explosions andShoot. Evade. Destroy! Fight your way through countless enemies as you pilot the legendary Raiden fighter in this latest installment for your PlayStation 2. Enhanced Graphics – The series has transitioned from its 2D roots to 3D, creating lush environments, devastating explosions and countless enemies, without a drop in frame-rate. All the favorites are back, including all the weapons (ie, spread shot, laser cannon, and proton laser), bigger then life boss battles, and the insane amount of enemies populating the screen at one time. Two players can play together to push back the invading forces, just like in the arcade. There is also a new 'multiplayer' mode that lets one player control two ships. There are several new modes within this title that can be unlocked, including Boss Rush (which lets you battle against bosses you have conquered) and Score Attack Mode (replay levels to obtain the highest score). There is also a Replay mode, so you can analyze your play as well as that of the bosses, and a gallery mode, which holds images, easter eggs, etc. when it is unlocked. There are also several new options so the player can tailor fit the game to maximize their experience, making for the most complete shooter on the PS2. [UFO Interactive]… Expand"}, {"name": "What Happened", "details_link": "https://www.metacritic.com/game/pc/what-happened", "publisher": "KATNAPPE SP. Z O. O.", "release_date": "Jul 30 2020", "developers": ["Genius Slackers"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/e26ed4904df99623d631de3b66c97740-98.jpg", "descriptions": "What Happened is a nightmarish first-person exploration of anxiety and depression from the perspective of American high school student, Stiles."}, {"name": "Tour de France 2020", "details_link": "https://www.metacritic.com/game/playstation-4/tour-de-france-2020", "publisher": "Nacon", "release_date": "Jun  4 2020", "developers": ["Cyanide"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Biking"], "meta_score": 61, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/6/54a1face7bb463e28e4ec740084af5a4-98.jpg", "descriptions": "Experience the intensity of the Tour de France with the official game. To wear the yellow jersey on the Champs-Elysees, you will need to take risks, attack, sprint and perfect your race tactics. Try out the new, immersive first-person camera and test it in the iconic Liege-Bastogne-LiegeExperience the intensity of the Tour de France with the official game. To wear the yellow jersey on the Champs-Elysees, you will need to take risks, attack, sprint and perfect your race tactics. Try out the new, immersive first-person camera and test it in the iconic Liege-Bastogne-Liege race or with the all-new time-trial gameplay. Features - All 21 official stages of the Tour de France 2020. The classic Liege-Bastogne-Liege race for the first time in Tour de France. Redesigned, more realistic time-trials. You must manage your stamina and riding position to improve your aerodynamics and achieve the best time. New first-person camera for greater immersion. More attacking and opportunistic peloton. Improved race interface with more details about your surroundings (competitors, route, descents, etc.) Online mode: redesigned matchmaking system.\r… Expand"}, {"name": "Rogue Trooper Redux", "details_link": "https://www.metacritic.com/game/xbox-one/rogue-trooper-redux", "publisher": "Sold Out", "release_date": "Oct 17 2017", "developers": ["Sold Out"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/7c55d27dbdaf01e303c2e3e38e51478c-98.jpg", "descriptions": "A tactical shooter and comic book adaptation, Rogue Trooper is back, remastered in high definition. Experience combat and third person action in this tale of betrayal and revenge at the far reaches of the galaxy. You are the last Genetic Infantryman (GI). Bred for war and betrayed by yourA tactical shooter and comic book adaptation, Rogue Trooper is back, remastered in high definition. Experience combat and third person action in this tale of betrayal and revenge at the far reaches of the galaxy. You are the last Genetic Infantryman (GI). Bred for war and betrayed by your superiors at the Quartz Zone Massacre, you stalk the battlefield as a one-man squad, carrying the sentient biochips of three fallen soldiers in your rifle, pack and helmet. Your mission? Fight your way across the chemical-blasted wastes of Nu-Earth -- a planet ravaged by an endless apocalyptic war  in search of the Traitor General and payback.… Expand"}, {"name": "Ryse: Son of Rome", "details_link": "https://www.metacritic.com/game/pc/ryse-son-of-rome", "publisher": "Crytek", "release_date": "Oct 10 2014", "developers": ["Crytek"], "platforms": ["Xbox One", "PC"], "genres": ["Action Adventure", "General", "Fantasy", "Linear"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/dfc938cdf35cec958776307b96e6226d-98.jpg", "descriptions": "Fight as a soldier. Lead as a general. Rise as a legend. Ryse is an action game that draws gamers into the epic times of the Roman Empire."}, {"name": "Cyberpunk 2077", "details_link": "https://www.metacritic.com/game/xbox-one/cyberpunk-2077", "publisher": "Microsoft Game Studios", "release_date": "Dec 10 2020", "developers": ["CD Projekt Red Studio", "CD Projekt"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 61, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/dd65ad3e2219e6eaf261bfeb7c3a1257-98.jpg", "descriptions": "Cyberpunk 2077 is an open-world, action-adventure story set in Night City, a megalopolis obsessed with power, glamour and body modification. Assume the role of V, a mercenary outlaw going after a one-of-a-kind implant that is the key to immortality. You can customize your character’sCyberpunk 2077 is an open-world, action-adventure story set in Night City, a megalopolis obsessed with power, glamour and body modification. Assume the role of V, a mercenary outlaw going after a one-of-a-kind implant that is the key to immortality. You can customize your character’s cyberware, skillset and playstyle, and explore a vast city where the choices you make shape the story and the world around you. Become a cyberpunk, an urban mercenary equipped with cybernetic enhancements and build your legend on the streets of Night City. Take the riskiest job of your life and go after a prototype implant that is the key to immortality.… Expand"}, {"name": "Monster Energy Supercross - The Official Videogame 4", "details_link": "https://www.metacritic.com/game/xbox-series-x/monster-energy-supercross---the-official-videogame-4", "publisher": "Koch Media", "release_date": "Mar 11 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "num_players": "Up to 16 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/4853d5da2d17bdb2015da1fe4f61c460-98.jpg", "descriptions": "Cross is Super Again! The official videogame of the Monster Energy AMA Supercross Championship is back with its fourth edition, the most extreme ever!"}, {"name": "J-Stars Victory Vs+", "details_link": "https://www.metacritic.com/game/playstation-4/j-stars-victory-vs+", "publisher": "Bandai Namco Games", "release_date": "Jun 30 2015", "developers": ["Bandai Namco Games", "Spike Chunsoft"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 61, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/511364e712f97c5f0970ceec5ba16deb-98.jpg", "descriptions": "J-STARS Victory Vs+ invites fans and gamers to play with their favorite manga/anime characters and progress in the JUMP World through different environments recalling NARUTO, DRAGON BALL Z, ONE PIECE and other memorable moments."}, {"name": "Spy Fiction", "details_link": "https://www.metacritic.com/game/playstation-2/spy-fiction", "publisher": "Sammy Studios", "release_date": "Aug 31 2004", "developers": ["Access Games"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 61, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/48f521b76c93c97b2f37e17486ecd737-98.jpg", "descriptions": "Spy Fiction is an action-stealth game combining exciting espionage action with a thrilling story line. Assume the identity of others and steal identifying characteristics like voice and appearance. Play action-oriented mini-games such as parachuting and rappelling. Use new gadgets like theSpy Fiction is an action-stealth game combining exciting espionage action with a thrilling story line. Assume the identity of others and steal identifying characteristics like voice and appearance. Play action-oriented mini-games such as parachuting and rappelling. Use new gadgets like the optical camouflage transparent suit, spider grips and more. 3rd Person Action-Stealth game introducing the ability to steal identities and assume the appearance, voice and other characteristics of enemies. Seamless combination of stealth, action, puzzles & mini-games such as parachuting and rappelling. Host of new gadgets like the 3DA cam, spider grips, remote mini cams, patch grenades and more allow for novel ways to avoid detection. Intriguing storyline drawn from genre-defining espionage films. Interior and exterior stages, with settings from around the world ranging from classic spy film locales to modern day hot-spots of conflict. 2 playable characters, with multiple endings and story paths, secret missions and unlockable skins. [Sammy Studios]… Expand"}, {"name": "One Must Fall: Battlegrounds", "details_link": "https://www.metacritic.com/game/pc/one-must-fall-battlegrounds", "publisher": "Diversions Entertainment", "release_date": "Dec 19 2003", "developers": ["Diversions Entertainment"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/5e09b79a4e51d7428b54e6e84c116dc5-98.jpg", "descriptions": "Battlegrounds is the first on-line, 3D, multiplayer fighting game. OMF:BG represents a serious change in the philosophy of making fighting games. Instead of 2 players facing off in a small space, Battlegrounds features up to sixteen simultaneous players in huge arenas, fighting in teamBattlegrounds is the first on-line, 3D, multiplayer fighting game. OMF:BG represents a serious change in the philosophy of making fighting games. Instead of 2 players facing off in a small space, Battlegrounds features up to sixteen simultaneous players in huge arenas, fighting in team battles or all-out brawls! Our goal is to free you, the player, from the restrictions of the past, and allow you to fight the way you've always wanted to. Just like your favourite martial-arts movies, you can go toe-to-toe with several opponents, use nearby objects as weapons, and integrate terrain and hazards into your fighting strategy. But... We've missed an important detail: you get to do all this while piloting a huge robot. [Diversions]… Expand"}, {"name": "Rugby 2004", "details_link": "https://www.metacritic.com/game/playstation-2/rugby-2004", "publisher": "EA Sports", "release_date": "Sep 16 2003", "developers": ["HB Studios Multimedia"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Rugby"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/8cc5463fa8c8235b878a6fbfdec92bcd-98.jpg", "descriptions": "Choose from 20 international, all Super 12, and other domestic teams, then take your team to victory in the World Cup, Tri nations, Super 12 Series, Domestic, Master League and Friendly matches. Strap on your boots, this is World Cup Rugby at its body-ramming, bullet-passing, try-scoringChoose from 20 international, all Super 12, and other domestic teams, then take your team to victory in the World Cup, Tri nations, Super 12 Series, Domestic, Master League and Friendly matches. Strap on your boots, this is World Cup Rugby at its body-ramming, bullet-passing, try-scoring best! More than 60 Teams From Around the World: Featuring every Rugby World Cup qualifying team plus international teams that did not qualify for the tournament, and every Super 12, and European Cup team. Over 1,500 Players Ready to Scrum: All the top players in the world, from Jonah Lomu to Jonny Wilkinson. With the revamped player editor, change every element of your players including height, weight, look, and playing attributes. Make a run for the cup with a wide variety of game and tournament modes including: Training Pitch, World Cup, Tri Nations, Bledisloe Cup, Super 12, European Cup, British Lions Tour, and Master League, the flagship tournament that lets you fully trade and customize your player, team, and tournament, and play through a career-style game mode. [Electronic Arts]… Expand"}, {"name": "Motor Trend presents Lotus Challenge", "details_link": "https://www.metacritic.com/game/xbox/motor-trend-presents-lotus-challenge", "publisher": "Xicat Interactive", "release_date": "Apr 30 2003", "developers": ["Kuju Entertainment"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/4bf94dbdb3f7a20eef629440c5c23f51-98.jpg", "descriptions": "Climb in, buckle up and pop the clutch on one of 38 stylish cars, spanning Lotus' prestigious 54-year racing history. Put yourself to the test as you twist through mountain passes in the Alps, fly over the Rainbow Bridge in Tokyo or leap a strain in a Hollywood stunt."}, {"name": "Disney's Donald Duck: Goin' Quackers", "details_link": "https://www.metacritic.com/game/gamecube/disneys-donald-duck-goin-quackers", "publisher": "Ubisoft", "release_date": "Mar 25 2002", "developers": ["Ubisoft Montreal"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 61, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/0/433a617ba2a7918c35a87f69bf4f648a-98.jpg", "descriptions": "Donald runs amuck, gets hyper and goes berserk across 22 levels in this hilarious quest to rescue Daisy."}, {"name": "BCT Commander", "details_link": "https://www.metacritic.com/game/pc/bct-commander", "publisher": "Shrapnel Games", "release_date": "Feb 23 2002", "developers": ["ProSim"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Wargame", "Real-Time", "General"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/d5e1ffa8d64ceafa359cd535badac465-98.jpg", "descriptions": "Based on the battalion/brigade level tactical simulator, JANUS, and designed for and used by the army to train its senior commanders, this windows-based simulation retains all of the realism of its mainframe-based predecessor, while improving on the user interface by using windows-styleBased on the battalion/brigade level tactical simulator, JANUS, and designed for and used by the army to train its senior commanders, this windows-based simulation retains all of the realism of its mainframe-based predecessor, while improving on the user interface by using windows-style point and click commands. [Shrapnel Games]… Expand"}, {"name": "Championship Surfer", "details_link": "https://www.metacritic.com/game/dreamcast/championship-surfer", "publisher": "Mattel", "release_date": "Dec 11 2000", "developers": ["Krome Studios"], "platforms": ["PC", "Dreamcast"], "genres": ["Sports", "Alternative", "Surfing"], "meta_score": 61, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/5708763117f3bf64114e678f0d7b7b4b-98.jpg", "descriptions": "10 outrageous beaches, 5-to-30-foot breakers, and 8 world class surfers including Cory Lopex, Shane Beschen, and Rochelle Ballard."}, {"name": "Moon Diver", "details_link": "https://www.metacritic.com/game/xbox-360/moon-diver", "publisher": "Square Enix", "release_date": "May  4 2011", "developers": ["FeelPlus"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 61, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/c74ff0cd6bad4532da075c7d8eebe1b2-98.jpg", "descriptions": "At the dawn of the 22nd century, an evil power brought inanimate objects to life, and they turned on humanity. Bridges, cars, cups-the whole of humanity's creations turned on their makers. But hidden amongst humanity's survivors, an elite unit of specially trained ninja known as MoondiversAt the dawn of the 22nd century, an evil power brought inanimate objects to life, and they turned on humanity. Bridges, cars, cups-the whole of humanity's creations turned on their makers. But hidden amongst humanity's survivors, an elite unit of specially trained ninja known as Moondivers has been lying in wait for orders to reclaim the planet. Today, those orders arrived.… Expand"}, {"name": "Shadow Ops: Red Mercury", "details_link": "https://www.metacritic.com/game/pc/shadow-ops-red-mercury", "publisher": "Atari", "release_date": "Sep 21 2004", "developers": ["Zombie Studios"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 61, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/7ec9b63edcadd82aaa11219240bb64a6-98.jpg", "descriptions": "Race against time and terrorism as a member of the elite Delta Force in this all-out first person shooter. From the hostile streets of the middle-east, where danger can come from any direction, to the landmarks of a major European city. Your duty is to hunt down a terrorist overlord carryingRace against time and terrorism as a member of the elite Delta Force in this all-out first person shooter. From the hostile streets of the middle-east, where danger can come from any direction, to the landmarks of a major European city. Your duty is to hunt down a terrorist overlord carrying a nuclear device before untold disaster is unleashed. The most realistic, immersive, shell-shocked battlefield experience ever. Modes include: plant the bomb, VIP escort, capture the flag and more. Take a seat in military vehicles to speed your way to victory (also available in multiplayer mode). Mix all-out assault with stealth infiltration in your mission to prevent disaster. Incredible plot that sees YOU on the trail of lethal terrorists. Join forces with other elite fighting units from the USA and Europe. Makes use of enhanced Unreal engine technology for unparalleled graphical realism. Places and sounds modeled on real-world locations for total immersion. Hollywood production values ? music, sound and scanning technology as used by the biggest blockbusters. Motion capture moves provided by ex-Special Forces operatives. [Atari]… Expand"}, {"name": "Georifters", "details_link": "https://www.metacritic.com/game/switch/georifters", "publisher": "Another Indie", "release_date": "Sep 18 2020", "developers": ["Busy Toaster"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/e527e49bb9caf4186a051a11eb645fff-98.jpg", "descriptions": "Five different bubble worlds lived perfectly in isolation....but one day they were connected by an unexpected event. Now they must learn to overcome their differences to survive."}, {"name": "Dead Rising: Chop Till You Drop", "details_link": "https://www.metacritic.com/game/wii/dead-rising-chop-till-you-drop", "publisher": "Capcom", "release_date": "Feb 24 2009", "developers": ["TOSE"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival", "Open-World"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/ff65d997a08d31d44763e364d78e2344-98.jpg", "descriptions": "Taking advantage of the same proven technology that brought \"Resident Evil 4\" to Wii, Dead Rising: Chop Till You Drop delivers a more immersive, intuitive and interactive experience as players use the Wii Remote to shoot, slash and bludgeon their way through a zombie infested shopping mall,Taking advantage of the same proven technology that brought \"Resident Evil 4\" to Wii, Dead Rising: Chop Till You Drop delivers a more immersive, intuitive and interactive experience as players use the Wii Remote to shoot, slash and bludgeon their way through a zombie infested shopping mall, fighting for survival. Dead Rising: Chop Till You Drop follows the harrowing tale of Frank West, an overly zealous freelance journalist on a hunt for the scoop of a lifetime. In pursuit of a juicy lead, he makes his way to the small suburban town of Willamette only to find that it has become overrun by zombies. Frank escapes to the local shopping mall, thinking it will be a bastion of safety but it turns out to be anything but. It's a true struggle to survive the endless stream of enemies, but players have full reign of a realistic shopping centre and its varied stores offering an endless supply of real and makeshift weapons to fight off the flesh-hungry mob. If Frank is running low on health he can pay a visit to one of the many restaurants or cafes for a meal in order to restore his energy and continue the fight. The game is split into a series of individual cases, all of which Frank must complete in order to gain vital information that allow him to piece together the truth behind the horrendous epidemic. In addition to the cases, players are faced with the dilemma of deciding the rescue priority of the residents of Wilamette who also sought sanctuary in the mall. Depending on the player’s skill, some may not be so fortunate as each rescue needs to be undertaken in a set time period, therefore players may need to delay completion of a case in order to save a fellow human. Dead Rising: Chop Till You Drop's infectious humor delivers some welcome relief from the incessant tide of zombies with players able to dress Frank up in a variety of comedic costumes and take on the undead hordes with a selection of improvised and sometimes highly ineffective weapons such as a toy sword or a football. [Capcom]… Expand"}, {"name": "Ghost in the Shell: Stand Alone Complex", "details_link": "https://www.metacritic.com/game/psp/ghost-in-the-shell-stand-alone-complex", "publisher": "Bandai", "release_date": "Oct 26 2005", "developers": ["G-Artists"], "platforms": "PSP", "num_players": "1-6 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Sci-Fi", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 61, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/cadb764daef6c96013d8917de4e401a2-98.jpg", "descriptions": "Based on the critically-acclaimed anime series by the renowned manga artist and writer Masamune Shirow, this sci-fi first-person shooter offers wireless multiplayer action for up to four-players, including heated cooperative and competitive modes. In the futuristic world of Ghost in theBased on the critically-acclaimed anime series by the renowned manga artist and writer Masamune Shirow, this sci-fi first-person shooter offers wireless multiplayer action for up to four-players, including heated cooperative and competitive modes. In the futuristic world of Ghost in the Shell: Stand Alone Complex, crime knows no limits. Gamers can face off against cyber-criminals as members of Section 9, an elite group of secret intelligence operatives tasked to keep technological terrorists at bay. Players must use “Major” Motoko Kusanagi’s agility, her partner Batou’s strength, the rookie Togusa’s stealth, or Saito’s sniper skills to unravel the mysteries of Berutarube. Issue precise commands and orders to the sentient Think Tank, Tachikoma, to gain an advantage during heated battles. Customize Tachikoma with unique accessories and change the personality of the tanks with different commands. Choose from 51 different weapons; from hand guns to rocket launchers and sub-machine guns. Play wirelessly in head-to-head battles. Hack into enemies or surveillance systems to break down the terrorist cells. [Bandai]… Expand"}, {"name": "Star Wars: The Force Unleashed II", "details_link": "https://www.metacritic.com/game/xbox-360/star-wars-the-force-unleashed-ii", "publisher": "LucasArts", "release_date": "Oct 26 2010", "developers": ["LucasArts"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 61, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/3736433b98e7474b973e9591a5a324a9-98.jpg", "descriptions": "With Star Wars: The Force Unleashed II, the epic story continues as players once again assume the role of the devastatingly powerful Starkiller - Darth Vader's secret apprentice set during the largely unexplored era between Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IVWith Star Wars: The Force Unleashed II, the epic story continues as players once again assume the role of the devastatingly powerful Starkiller - Darth Vader's secret apprentice set during the largely unexplored era between Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IV A New Hope.… Expand"}, {"name": "GoldenEye: Rogue Agent", "details_link": "https://www.metacritic.com/game/xbox/goldeneye-rogue-agent", "publisher": "EA Games", "release_date": "Nov 22 2004", "developers": ["EA LA"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/e13a2d694ead7deeb25ae8e8706ca526-98.jpg", "descriptions": "Why save the world when you can rule it? GoldenEye: Rogue Agent transports you to the dark side of the Bond universe as an aspiring 00 agent dismissed from MI6 for reckless brutality. You can customize and upgrade your villain persona and wreak havoc as you make your unrelenting rise throughWhy save the world when you can rule it? GoldenEye: Rogue Agent transports you to the dark side of the Bond universe as an aspiring 00 agent dismissed from MI6 for reckless brutality. You can customize and upgrade your villain persona and wreak havoc as you make your unrelenting rise through the ranks. You'll cross paths with such legendary allies and enemies as Oddjob, Scaramanga, Xenia Onatopp, and Pussy Galore on worldwide missions of vengeance and demolition. GoldenEye: Rogue Agent integrates single-player and multiplayer split-screen across all game modes.… Expand"}, {"name": "Fun! Fun! Minigolf TOUCH!", "details_link": "https://www.metacritic.com/game/3ds/fun!-fun!-minigolf-touch!", "publisher": "Shin'en", "release_date": "Mar  8 2012", "developers": ["Shin'en"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 61, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/3ab672c418f344a3c62dbd11c1a3df3f-98.jpg", "descriptions": "Play minigolf with your friends in beautiful environments. Choose a character and turn your Wii Remote controller into a golf club. With its easy-to-use controls, all you need to do is aim, swing and see who's the best putter. Play 27 holes spread across America, Asia and Europe. EnjoyPlay minigolf with your friends in beautiful environments. Choose a character and turn your Wii Remote controller into a golf club. With its easy-to-use controls, all you need to do is aim, swing and see who's the best putter. Play 27 holes spread across America, Asia and Europe. Enjoy exotic locations all over the world. Go for gold in single-player mode, or invite your friends. Fun! Fun! Minigolf supports up to four players. You can use one to four Wii Remote controllers. Fun! Fun! Minigolf is the ultimate party game for everyone.… Expand"}, {"name": "Fast Striker", "details_link": "https://www.metacritic.com/game/playstation-4/fast-striker", "publisher": "EastAsiaSoft", "release_date": "Oct 16 2018", "developers": ["NG:DEV.TEAM"], "platforms": ["iPhone/iPad", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/02f914c751c7936fbf704253f721ab9d-98.jpg", "descriptions": "FAST STRIKER is a 2D arcade shooting game with emphasis on scoring. You can choose between 3 game modes with different scoring systems. This game features six stages of excellent 2D arcade game play with over 40 unique enemy types, super smooth 3D scrolling backgrounds, huge CGI bosses."}, {"name": "Deadpool", "details_link": "https://www.metacritic.com/game/playstation-3/deadpool", "publisher": "Activision", "release_date": "Jun 25 2013", "developers": ["High Moon Studios"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Fighting", "3D", "Action", "Action Adventure", "Beat-'Em-Up", "Shooter", "Beat-'Em-Up", "Linear", "Third-Person", "3D", "Arcade"], "meta_score": 61, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/8c1e9c8e45ed192cd6ccb7c3812ec674-98.jpg", "descriptions": "Deadpool's address: \"There are a few important things I need to say before you crack into my insanely sweet game. (Oof. Here we go again.) I'm a mercenary with an accelerated healing factor. I've been described as unstable, which is just plain coo-coo. (Wait, do sane people say coo-coo?) I'mDeadpool's address: \"There are a few important things I need to say before you crack into my insanely sweet game. (Oof. Here we go again.) I'm a mercenary with an accelerated healing factor. I've been described as unstable, which is just plain coo-coo. (Wait, do sane people say coo-coo?) I'm gonna battle for the safety of humans and mutants. (And even mumans.) Be prepared for just about anything. (Holla!) • I made sure to capture all my good sides, so I made my game a third-person action-shooter. (Yep, you get to look at my heinie.) • Keep a look out cuz some of my X-Men pals (Whoa, what pals?!) are making an appearance. (Hope you don't mind picking hair out of your tacos.) • I'm really good at killing, so I made it a blast stringing together combos, and totally eviscerating my enemies. (Ev-is-cer-a-ting!) • I brought my skills and a buttload of my favorite things. Katanas (check), guns (bang!) explosives (boom), duct tape (quack) and of course, yours truly - ME! (Checkmate!)\"… Expand"}, {"name": "PowerUp Heroes", "details_link": "https://www.metacritic.com/game/xbox-360/powerup-heroes", "publisher": "Ubisoft", "release_date": "Oct 18 2011", "developers": ["Ubisoft"], "platforms": "Xbox 360", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/a04e1125b30565f99878ad4024bd88fc-98.jpg", "descriptions": "Leveraging the Kinect technology, PowerUpHeroes is the ultimate super power-infused full-body fighting game. Players control each move in combat by using their entire body to launch projectiles, dodge strikes and counter deadly attacks. Players can unleash super assaults on their opponentsLeveraging the Kinect technology, PowerUpHeroes is the ultimate super power-infused full-body fighting game. Players control each move in combat by using their entire body to launch projectiles, dodge strikes and counter deadly attacks. Players can unleash super assaults on their opponents in a two-player cosmic showdown online.  Additional modes include local two-player versus and four-player tournament.… Expand"}, {"name": "Transformers: Revenge of the Fallen", "details_link": "https://www.metacritic.com/game/xbox-360/transformers-revenge-of-the-fallen", "publisher": "Activision", "release_date": "Jun 23 2009", "developers": ["Luxoflux", "Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Adventure", "Shooter", "Beat-'Em-Up", "Sci-Fi", "Sci-Fi", "Third-Person", "3D", "Arcade"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/82c1364e60a04edf3838fa730e150e1e-98.jpg", "descriptions": "Transformers: Revenge of the Fallen thrusts players into a battle for supremacy across the globe as either AUTOBOTS or DECEPTICONS to drive, fly, fight and blast their way through intense, pressure-packed levels. Delivering more control, players can select from a diverse range of playableTransformers: Revenge of the Fallen thrusts players into a battle for supremacy across the globe as either AUTOBOTS or DECEPTICONS to drive, fly, fight and blast their way through intense, pressure-packed levels. Delivering more control, players can select from a diverse range of playable TRANSFORMERS - each with distinct personalities, abilities and weaponry - and jump straight into action as they instantly switch between robot, vehicle and weapon modes to fight for the preservation or annihilation of all mankind. For the first time in the TRANSFORMERS universe, players can also fight the epic war between the AUTOBOTS and DECEPTICONS online in explosive, multiplayer combat. Players can take on the role of their favorite AUTOBOTS and DECEPTICONS such as Optimus Prime, Starscream, Bumblebee and Ironhide, along with new characters making their first appearance in a game.  With two distinct campaigns that allow players to save or destroy the human race, players can unlock and play missions in any order and with different characters for a whole new experience. Instantaneously convert from a colossal robot to a dynamic land or air vehicle such as a diesel truck, sports car, military chopper or fighter jet.  New, ultra-fluid transformations can be performed in-motion anytime and anywhere, allowing players to strategically propel through and decimate hordes of enemies with incredible agility. [Activision]… Expand"}, {"name": "Bus Driver", "details_link": "https://www.metacritic.com/game/pc/bus-driver", "publisher": "Meridian4", "release_date": "Mar 22 2007", "developers": ["SCS Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General", "Vehicle", "Civilian"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/760690d606aa355b7977173631019e7b-98.jpg", "descriptions": "In Bus Driver, your job is to transport passengers around an attractive and realistic city. You must drive to a timetable on a planned route, while obeying traffic rules, and taking care not to upset or injure your passengers. This makes Bus Driver unlike any other driving game - theIn Bus Driver, your job is to transport passengers around an attractive and realistic city. You must drive to a timetable on a planned route, while obeying traffic rules, and taking care not to upset or injure your passengers. This makes Bus Driver unlike any other driving game - the experience of driving a bus is very different from blazing through a racing circuit. 12 buses to drive – detailed models inspired by real-world buses, including London’s double-decker bus, America’s school bus, Europe’s low floor buses and many more. 30 routes arranged into 5 tiers with increasing difficulty. Multiple duties, such as driving a school bus, transporting tourists, sight-seeing tours and even the transportation of prisoners. High replay value based on sophisticated system of traffic rules and game-play related bonuses. Large city to drive in, with several districts of varying styles: modern, old-town, suburb, airport, harbor and more with day/night cycles and realistic weather conditions. Living roads with intelligent traffic controlled by AI system. [Meridian4]… Expand"}, {"name": "F1 Race Stars", "details_link": "https://www.metacritic.com/game/playstation-3/f1-race-stars", "publisher": "Codemasters", "release_date": "Nov 13 2012", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Arcade", "Formula One", "Formula One", "Automobile"], "meta_score": 61, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/41858ba3089df83e5e73b09c0a992d76-98.jpg", "descriptions": "Get ready to experience FORMULA ONE cars, teams and circuits like never before with F1 Race Stars from Codemasters Racing, the home of the series of HD official FORMULA ONE games. F1 RACE STARS is a fast-to-the-fun arcade racing game featuring the official FORMULA ONE cars, teams andGet ready to experience FORMULA ONE cars, teams and circuits like never before with F1 Race Stars from Codemasters Racing, the home of the series of HD official FORMULA ONE games. F1 RACE STARS is a fast-to-the-fun arcade racing game featuring the official FORMULA ONE cars, teams and circuits as they've never been seen before. Drivers including Lewis Hamilton, Fernando Alonso and Sebastian Vettel have been transformed into personality-packed heroes bursting with charm and character and stunning FORMULA ONE locations have become exhilarating racing theme parks designed for speed and wheel-to-wheel competition.… Expand"}, {"name": "The Witch and the Hundred Knight 2", "details_link": "https://www.metacritic.com/game/playstation-4/the-witch-and-the-hundred-knight-2", "publisher": "NIS America", "release_date": "Mar 27 2018", "developers": ["Nippon Ichi Software"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 61, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/1850abb3e830253bd2aff4ebcc537fd1-98.jpg", "descriptions": "Follow the Hundred Knight in its journey through a witch-ravaged world. Young girls are contracting a strange illness and awakening as witches, causing mayhem across the region of Kevala. Along the Hundred Knight's side are two sisters: Amalie, an agent of an organization who opposesFollow the Hundred Knight in its journey through a witch-ravaged world. Young girls are contracting a strange illness and awakening as witches, causing mayhem across the region of Kevala. Along the Hundred Knight's side are two sisters: Amalie, an agent of an organization who opposes witches; and Chelka, the witch who awakened in Amalie's younger sister, Milm.Uncover the mysteries of Kevala as you protect them both from harm. Delve through dungeons and landscapes teeming with fiends and monsters, looking for equipment of legendary power. Grow stronger with help from Tochkas and Facets that will give an advantage in combat. Chain attacks together with the unique weapon system that welcomes weapon change mid-combat. The fate of Kevala is in your hands, brave knight.… Expand"}, {"name": "Batman: Arkham Origins Blackgate", "details_link": "https://www.metacritic.com/game/playstation-vita/batman-arkham-origins-blackgate", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 25 2013", "developers": ["Armature Studio"], "platforms": ["3DS", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Fantasy", "General", "Platformer", "Fantasy", "", "Metroidvania"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/bebbbca4ef9206c7f9ea00138854df5a-98.jpg", "descriptions": "Batman: Arkham Origins Blackgate is a 2.5-D game developed by Armature Studio that brings the Batman Arkham experience for the first time to Nintendo and Sony handheld systems. A companion game to Batman: Arkham Origins, players can continue the storyline of the console version and discoverBatman: Arkham Origins Blackgate is a 2.5-D game developed by Armature Studio that brings the Batman Arkham experience for the first time to Nintendo and Sony handheld systems. A companion game to Batman: Arkham Origins, players can continue the storyline of the console version and discover more detalis of the Dark Knight's past.… Expand"}, {"name": "Boiling Point: Road to Hell", "details_link": "https://www.metacritic.com/game/pc/boiling-point-road-to-hell", "publisher": "Atari", "release_date": "Jun  6 2005", "developers": ["Deep Shadows"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/92a7c46c205b556aa66a28671b87a4c7-98.jpg", "descriptions": "Boiling Point: Road to Hell combines intense armed combat with exploration and interaction with a vast and seamless open-ended gaming world. In Boiling Point: Road to Hell, gamers travel to the present day jungles of South America and battle competing factions in a brutal guerrilla war.Boiling Point: Road to Hell combines intense armed combat with exploration and interaction with a vast and seamless open-ended gaming world. In Boiling Point: Road to Hell, gamers travel to the present day jungles of South America and battle competing factions in a brutal guerrilla war. Developer Deep Shadows' innovative game engine streams the beautifully rendered environment, creating a non-linear gameplay experience, with no loading times or separate levels, creating a continuous world spanning hundreds of miles. To make the most of the environment, a massive range of vehicles are at the disposal of the player, as well as a vast array of weapons. The wide open game world features an array of different AI factions with which the player can interact, and hundreds of diverse missions to create an original experience each time the game is played. Combined with the vast seamless gaming world, the result is gameplay freedom and replayability on an unprecedented scale. [Atari]… Expand"}, {"name": "Crimsonland", "details_link": "https://www.metacritic.com/game/switch/crimsonland", "publisher": "10tons", "release_date": "Nov 24 2017", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 61, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/baddd9ccdfb5da43a3c999b87b3fa1dd-98.jpg", "descriptions": "Crimsonland is an intense, addictive and immensely gratifying top-down dual stick shooter where your screen is filled with literally hundreds of aliens, giant spiders, mutant lizards, and more.\r Complete sixty quests to unlock an array of weapons and abilities, then unleash your arsenal inCrimsonland is an intense, addictive and immensely gratifying top-down dual stick shooter where your screen is filled with literally hundreds of aliens, giant spiders, mutant lizards, and more.\r Complete sixty quests to unlock an array of weapons and abilities, then unleash your arsenal in five survival modes with leaderboards.\r All Crimsonland game modes feature local co-op for up to four players. There are also dedicated leaderboards for co-op games, so gather your friends and show everyone who wields the gauss shotgun like a pro!… Expand"}, {"name": "Traverser", "details_link": "https://www.metacritic.com/game/pc/traverser", "publisher": "Adult Swim", "release_date": "Jul  9 2015", "developers": ["Gatling Goat Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/0328f10718df8cc1b6c894a28700b716-98.jpg", "descriptions": "The sun is dead. Mankind has fled underground. In the two-sided city of Brimstone, the all-seeing Raven Corporation controls our most precious resource: breathable air. It now falls to guard-in-training Valerie to infiltrate the company, reveal its secrets and uncover years of lies and propaganda."}, {"name": "The Perils of Man", "details_link": "https://www.metacritic.com/game/pc/the-perils-of-man", "publisher": "IF Games", "release_date": "Apr 28 2015", "developers": ["IF Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/576881877b25cbc595dc32d0b538a7b6-98.jpg", "descriptions": null}, {"name": "A City Sleeps", "details_link": "https://www.metacritic.com/game/pc/a-city-sleeps", "publisher": "Harmonix Music Systems", "release_date": "Oct 16 2014", "developers": ["Harmonix Music Systems"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 61, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/98583294b769a56560fec78b66a4eba7-98.jpg", "descriptions": "A City Sleeps follows Poe, youngest member of The Silk, an ancient clan of dream exorcists that can enter the minds of sleeping hosts to rid their dreams of demons. When the residents of SanLo fall into an endless slumber, only Poe can rescue them from a never-ending nightmare. Equipped withA City Sleeps follows Poe, youngest member of The Silk, an ancient clan of dream exorcists that can enter the minds of sleeping hosts to rid their dreams of demons. When the residents of SanLo fall into an endless slumber, only Poe can rescue them from a never-ending nightmare. Equipped with her legendary Koto-sword “Heartstrings”, and flanked by her stable of powerful ghost familiars, she must cleanse their dreams, and uncover the city’s dark secrets. Driven by an unforgettable original soundtrack that builds through player actions and enemy engagement, A City Sleeps infuses classic twin-stick hardcore shoot ‘em up sensibilities with moment-to-moment tactical choices.… Expand"}, {"name": "Invincible Tiger: The Legend of Han Tao", "details_link": "https://www.metacritic.com/game/xbox-360/invincible-tiger-the-legend-of-han-tao", "publisher": "Namco Bandai Games America", "release_date": "Aug 26 2009", "developers": ["Blitz Arcade"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/0cafd65f39e5661eac4a3ad8b714dab9-98.jpg", "descriptions": "[Xbox Live Arcade]  Han Tao, General of a Thousand Victories, has pledged his life to protect the legendary Star of Destiny, a mysterious artifact recently stolen by the Evil Overlord. Han Tao will face a cavalcade of enemies, ranging from standard grunts to undead horrors in his quest to[Xbox Live Arcade]  Han Tao, General of a Thousand Victories, has pledged his life to protect the legendary Star of Destiny, a mysterious artifact recently stolen by the Evil Overlord. Han Tao will face a cavalcade of enemies, ranging from standard grunts to undead horrors in his quest to recover the sacred Star. Luckily Han Tao is well versed in intense combos, slick counter-moves, the art of deadly weapons, and mystical Zen attacks. By filling up Han Tao’s Zen Meter with punishing combos and well timed dodges, players can unlock the full potential of his true power and decimate the opposition. Invincible Tiger: The Legend of Han Tao offers a variety of modes for both online and local play: Team up with a partner and take on the Evil Overload’s diabolical army through Story Mode Co-op. Carefully battle through each stage with increased difficulty and a shared Zen Meter. Combat techniques learned through the single player game will serve players well as all-out brawls will leave stragglers in the dust. Endurance Mode has players battling an endless stream of enemies under a specific time limit. Post your scores online for bragging rights. [Namco Bandai Games]… Expand"}, {"name": "FaceBreaker K.O. Party", "details_link": "https://www.metacritic.com/game/wii/facebreaker-ko-party", "publisher": "EA Sports", "release_date": "Nov 11 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 61, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/7a70995008d8d3028e9be0394b7746c4-98.jpg", "descriptions": "Pick up and Punch - A hyper-intuitive, gesture-based control scheme developed with 1:1 responsiveness and approachability in mind. Grab the Wiimote and Nunchuck and feel the deep satisfaction of stringing together mug shots, body blows, and bone crushing Breakers. Dodge and Parry yourPick up and Punch - A hyper-intuitive, gesture-based control scheme developed with 1:1 responsiveness and approachability in mind. Grab the Wiimote and Nunchuck and feel the deep satisfaction of stringing together mug shots, body blows, and bone crushing Breakers. Dodge and Parry your opponent's attacks and then unload on them with the Grand Daddy of them all... the FaceBreaker. Brawl for It All - Throw your hat in the ring for the most extremely extreme boxing tournament of all time! Put your skills to the test in this single player experience where you battle past every character in the game, earning belts, characters, costumes - and ultimate glory - along the way. It ain’t called Brawl for it All for nuthin'. Mess up yo' Face - After you beat your opponent to the mat add the ultimate humiliation by using your Wii Remote to brand. [Electronic Arts]… Expand"}, {"name": "Tom Clancy's Splinter Cell Double Agent", "details_link": "https://www.metacritic.com/game/wii/tom-clancys-splinter-cell-double-agent", "publisher": "Ubisoft", "release_date": "Nov 28 2006", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 61, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/364b0c0e71c3c6d90e0be9fff0a19715-98.jpg", "descriptions": "Veteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life asVeteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life as a double agent. As you infiltrate a terrorist organization in its American headquarters, you must carefully weigh the consequences of your actions. Kill too many criminals and you'll blow your cover. Hesitate too long and millions will die. Do whatever it takes to complete your mission, but get out alive. Dual objectives to fulfill: NSA government agents and terrorists will each want you to accomplish opposing tasks at the same time. Discover the tension of being a double agent: Use actual tactics employed by today's real-life double agents to sabotage the terrorists' plans. Explore a branching storyline with multiple endings: Your choices have an impact on how the story and gameplay unfolds. A world of international espionage: Missions from all over the world, from Asia to Africa to the heart of the U.S. Experience extreme situations: underwater or in a sandstorm, hiding behind the dust or smoke – and even skydiving. New authentic gadgets: Master the latest weapons and gadgets used by NSA government agents in addition to black-market terrorist weapons. [Ubisoft]… Expand"}, {"name": "Fantastic 4", "details_link": "https://www.metacritic.com/game/gamecube/fantastic-4", "publisher": "Activision", "release_date": "Jun 27 2005", "developers": ["7 Studios"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 61, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/0600d0c7b1e0cfd8c18acec716d2e53f-98.jpg", "descriptions": "Based on the 2005 movie of the same name, Fantastic Four lets you control the team of superheroes known as the Fantastic 4. Each character possesses a unique set of abilities that you can use and combine in the hunt for Doctor Doom. The game includes single-player, cooperative, andBased on the 2005 movie of the same name, Fantastic Four lets you control the team of superheroes known as the Fantastic 4. Each character possesses a unique set of abilities that you can use and combine in the hunt for Doctor Doom. The game includes single-player, cooperative, and two-player versus modes. … Expand"}, {"name": "Disney Universe", "details_link": "https://www.metacritic.com/game/wii/disney-universe", "publisher": "Disney Interactive Studios", "release_date": "Oct 25 2011", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 61, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/eaef5070eecbeaf0cf4942e3cbb427d4-98.jpg", "descriptions": "In Disney Universe, players can select from more than 40 classic and contemporary Disney character costumes, including Alice (\"Alice in Wonderland\"), Mike (\"Monsters, Inc.\"), TRON (\"TRON: Legacy\") and Stitch (\"Lilo & Stitch\") to explore sixIn Disney Universe, players can select from more than 40 classic and contemporary Disney character costumes, including Alice (\"Alice in Wonderland\"), Mike (\"Monsters, Inc.\"), TRON (\"TRON: Legacy\") and Stitch (\"Lilo & Stitch\") to explore six different worlds inspired by legendary Disney and Disney Pixar films.  Each world will allow players to experience objectives and missions that follow Disney and Disney Pixar movie storylines.  Players will select a character-based costume, with each costume offering a specific tool that changes and grows in power as players adventure through the game.  Disney Universe offers frenetic gameplay, multiplayer with up to three friends and slapstick humor that will appeal to players of all ages.… Expand"}, {"name": "F1 2014", "details_link": "https://www.metacritic.com/game/pc/f1-2014", "publisher": "Codemasters", "release_date": "Oct 16 2014", "developers": ["Codemasters Birmingham"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Automobile"], "meta_score": 61, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/bf13a10051289b89dfdf6054f1792522-98.jpg", "descriptions": "Gamers can refine their skills and win medals by taking part in bite-sized racing challenges in an expanded Scenario mode, featuring a range of different scenarios based on real-world challenges and moments from recent history."}, {"name": "Ragnarok Odyssey ACE", "details_link": "https://www.metacritic.com/game/playstation-3/ragnarok-odyssey-ace", "publisher": "XSEED Games", "release_date": "Apr  1 2014", "developers": ["Game Arts"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 61, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/b1cc5185708117ac545dcfb41ba2e24f-98.jpg", "descriptions": "Ragnarok Odyssey ACE is a completely evolved version of the popular giant-hunting game released on PlayStation Vita, adding a wealth of new content and features and introducing a PlayStation 3 version. New job-specific ACE skills change the battle dynamic significantly, while the addition ofRagnarok Odyssey ACE is a completely evolved version of the popular giant-hunting game released on PlayStation Vita, adding a wealth of new content and features and introducing a PlayStation 3 version. New job-specific ACE skills change the battle dynamic significantly, while the addition of hirable in-game mercenaries ensures that players can have a battle party to take on the toughest foes even when they can't get online. The new Yggdrasil Tower, with its randomly generated levels, along with a consistent supply of new online quests, ensures that there will always be unique content each time the game is played.… Expand"}, {"name": "Elite Forces: Unit 77", "details_link": "https://www.metacritic.com/game/ds/elite-forces-unit-77", "publisher": "Deep Silver", "release_date": "Apr 28 2009", "developers": ["Gammick Entertainment"], "platforms": "DS", "genres": ["Strategy", "Turn-Based", "Modern", "General", "Modern"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/93e2181572e1dbf7bce9ff4190504677-98.jpg", "descriptions": "This game of strategic action developed by Abylight is taking us to control Unit 77,  ?a command of elite that must face its most important mission. The mysterious disappearance of some celebrities and politicians around the world is only the tip of an iceberg of a terrible terrorist threat.This game of strategic action developed by Abylight is taking us to control Unit 77,  ?a command of elite that must face its most important mission. The mysterious disappearance of some celebrities and politicians around the world is only the tip of an iceberg of a terrible terrorist threat. Only Unit 77 seems to be capable to stop the conspiracy. Now, the destiny of millions of people is relies on them. [Gammick Entertainment]… Expand"}, {"name": "Dead Island: Riptide", "details_link": "https://www.metacritic.com/game/pc/dead-island-riptide", "publisher": "Deep Silver", "release_date": "Apr 22 2013", "developers": ["Techland"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 61, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/c6f4bdbdeb7fc870ca12aef643bdceae-98.jpg", "descriptions": "They assumed they had escaped the terrors of Banoi and survived the apocalypse on a corrupted paradise. However, their fate took a turn for the worse. The Dead Island heroes escaped in a helicopter to the friendly confines of a military ship, but when an unpredictable storm hits and theThey assumed they had escaped the terrors of Banoi and survived the apocalypse on a corrupted paradise. However, their fate took a turn for the worse. The Dead Island heroes escaped in a helicopter to the friendly confines of a military ship, but when an unpredictable storm hits and the virus suddenly spreads throughout the crew, the nightmare starts all over again, leaving hope drowning in the rising tides. … Expand"}, {"name": "Spore Hero", "details_link": "https://www.metacritic.com/game/wii/spore-hero", "publisher": "EA Games", "release_date": "Oct  6 2009", "developers": ["Maxis"], "platforms": "Wii", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/885a598488a4cdecdeaef91bbf1d9863-98.jpg", "descriptions": "Spore Hero  delivers the creative freedom of Spore in an accessible, story-driven action-adventure made exclusively for the Wii. Set in a rich and vibrant 3D world, Spore Hero empowers players to create their own Hero as they embark on an epic quest to save their new home world fromSpore Hero  delivers the creative freedom of Spore in an accessible, story-driven action-adventure made exclusively for the Wii. Set in a rich and vibrant 3D world, Spore Hero empowers players to create their own Hero as they embark on an epic quest to save their new home world from destruction as a dark force threatens the planet. Taking full advantage of the Wii controls, Spore Hero engages players in heated battles, humorous missions, curious puzzles and more. Throughout the game, players collect more than 250 parts with unique abilities and experience the unparalleled customization of the revolutionary Spore Creature Creator enhanced for the Wii. [Electronic Arts]… Expand"}, {"name": "Superfrog HD", "details_link": "https://www.metacritic.com/game/playstation-3/superfrog-hd", "publisher": "Team17", "release_date": "Aug  6 2013", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 61, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/128fbf8936719f71a58d7ffd14935532-98.jpg", "descriptions": "Superfrog HD is a 2D amphibian platformer that is an HD remake of Team17's classic Superfrog, which was released in 1993 on the Amiga. It will feature all-new graphics and will be appearing on the PlayStation 3 and PlayStation Vita."}, {"name": "Namco Museum 50th Anniversary", "details_link": "https://www.metacritic.com/game/playstation-2/namco-museum-50th-anniversary", "publisher": "Namco", "release_date": "Aug 30 2005", "developers": ["Digital Eclipse"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 61, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/4f5e5d97eccb7821c6b19c2abfc9eebc-98.jpg", "descriptions": "It's party time! Namco is celebrating 50 years of bringing you the greatest games on the planet by releasing the biggest and best compilation of time-honored, all-star arcade classics. Namco Museum 50th Anniversary features 14 of the most treasured Namco original games in arcade historyIt's party time! Namco is celebrating 50 years of bringing you the greatest games on the planet by releasing the biggest and best compilation of time-honored, all-star arcade classics. Namco Museum 50th Anniversary features 14 of the most treasured Namco original games in arcade history wrapped up in a retro-cool menu interface that allows you to explore a virtual arcade and dominate your favorite games. Relive your arcade years and rock out to a cool 80's soundtrack that takes you back to glory days of arcade gaming and this time...leave your quarters at home. 14 Classic Arcade Games Include: Pac-Man, Ms. Pac-Man, Galaga, Galaxian, Dig Dug, Pole Position, Pole Position II, Rolling Thunder, Rally X, Bosconian, Dragon Spirit, Sky Kid, Xevious, Mappy. Sky Kid and Rolling Thunder are two new titles new to Namco Museum. [Namco]… Expand"}, {"name": "Scathe", "details_link": "https://www.metacritic.com/game/pc/scathe", "publisher": "Kwalee Ltd", "release_date": "Aug 31 2022", "developers": ["DAMAGE STATE LTD"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 61, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/b95943cd75d4cc74fa7f9c9316ef50a3-98.jpg", "descriptions": "Scathe is an intense, classic FPS with big guns and even bigger demons. You are Scathe, Enforcer of the Legions of Hell, forged from the earth by the Divine Creator himself. And you, like your fallen kin before you, must prove your worth by navigating a deviously crafted maze, entangled withScathe is an intense, classic FPS with big guns and even bigger demons. You are Scathe, Enforcer of the Legions of Hell, forged from the earth by the Divine Creator himself. And you, like your fallen kin before you, must prove your worth by navigating a deviously crafted maze, entangled with demonic evil at every twist and turn. So, grab your Hell Hammer and get ready to unleash your almighty fury!Use Scathe's brute strength and extreme speed to purge your way through Hell's most grotesque abominations, as you search for the Hellstones and defeat the all-powerful Guardians that protect them.It's time to blast your way out of bullet Hell.… Expand"}, {"name": "Alfred Hitchcock: Vertigo", "details_link": "https://www.metacritic.com/game/pc/alfred-hitchcock-vertigo", "publisher": "Microids", "release_date": "Dec 16 2021", "developers": ["Pendulo Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 61, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/0a699ae4e3d9d3c68f5595cdc8cf7f59-98.jpg", "descriptions": "Ed Miller, a writer, came out unscathed from his car crash down into Brody Canyon, California. Even though no one was found inside the car wreckage, Ed insists that he was traveling with his wife and daughter. Traumatized by the event, he begins to suffer from severe vertigo. As he startsEd Miller, a writer, came out unscathed from his car crash down into Brody Canyon, California. Even though no one was found inside the car wreckage, Ed insists that he was traveling with his wife and daughter. Traumatized by the event, he begins to suffer from severe vertigo. As he starts therapy, he will try to uncover what really happened on that tragic day.\r Prepare yourself for a most disturbing investigation inside the human mind: truth is sometimes worse than madness.\r An original story about obsession, manipulation and madness, inspired by Alfred Hitchcock's masterpiece Vertigo.… Expand"}, {"name": "Violett", "details_link": "https://www.metacritic.com/game/pc/violett", "publisher": "Forever Entertainment S.A.", "release_date": "Dec 13 2013", "developers": ["Forever Entertainment S.A.", "Forever Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/af596400ef43d6594e1a9ccf0a3f7387-98.jpg", "descriptions": "Dragged by her parents, a young and rebellious teenage girl"}, {"name": "Rogue Ops", "details_link": "https://www.metacritic.com/game/playstation-2/rogue-ops", "publisher": "Kemco", "release_date": "Oct 29 2003", "developers": ["Bits Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 61, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/0eda0742f38db97893bb91deebd14e1b-98.jpg", "descriptions": "Rocked from normality by an explosion that claimed her daughter and husband, ex-Green Beret Nikki Conners exploits her military training and her new role as leading lady in a covert government agency to further her personal quest for vengeance. After receiving two years of gruelingRocked from normality by an explosion that claimed her daughter and husband, ex-Green Beret Nikki Conners exploits her military training and her new role as leading lady in a covert government agency to further her personal quest for vengeance. After receiving two years of grueling instruction, she is unleashed upon Omega 19, a terrorist organization recognized as the most ominous in the world. With a host of engaging missions, Rogue Ops tests your ability as Nikki to survive in any situation as you work with team members and fights enemies throughout intense gameplay! [Kemco]… Expand"}, {"name": "Original War", "details_link": "https://www.metacritic.com/game/pc/original-war", "publisher": "Virgin Interactive", "release_date": "Dec  3 2001", "developers": ["Altar Interactive"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "General", "General", "Command"], "meta_score": 61, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/01d86da7e2cf0347fef6f2cef058ad0f-98.jpg", "descriptions": "A real-time strategy game in which the plot influences mission objectives and which has multiple endings depending on player's actions. Contrary to other games, there is no other way of creating new human units. Each man or woman is unique. [Altar Interactive]"}, {"name": "18 Wheeler: American Pro Trucker", "details_link": "https://www.metacritic.com/game/playstation-2/18-wheeler-american-pro-trucker", "publisher": "Acclaim", "release_date": "Nov 14 2001", "developers": ["Acclaim Studios Cheltenham"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 61, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/35f09d427bd33bca3a10f2173e553da2-98.jpg", "descriptions": "Get behind the wheel of a 60 foot long, 20 ton, 18-wheeled beast and buckle up as you haul tail from New York to California and everywhere in between.  The PS2 version supports the Driving Force Racing Wheel, the Logitech steering wheel employed with with \"Gran Turismo 3.\""}, {"name": "X-Men: Reign of Apocalypse", "details_link": "https://www.metacritic.com/game/game-boy-advance/x-men-reign-of-apocalypse", "publisher": "Activision", "release_date": "Sep 25 2001", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/6cabd090bc388c3160258ab3b0cff64d-98.jpg", "descriptions": "You and your fellow X-MEN are thrown into a strange, parallel universe where Apocalypse reigns supreme. Your only hope - fight through countless enemies and threats to reach the Warp Gate and return home. \rFight as Wolverine, Cyclops, Storm or Rogue as you battle former friends and foes inYou and your fellow X-MEN are thrown into a strange, parallel universe where Apocalypse reigns supreme. Your only hope - fight through countless enemies and threats to reach the Warp Gate and return home. \rFight as Wolverine, Cyclops, Storm or Rogue as you battle former friends and foes in a twisted alternate reality. Defeat the minions of Apocalypse with a friend in Co-op Mode or challenge each other head-to-head in Versus Mode. Use mutant powers to unleash devastating attacks and earn points to upgrade your character's abi… Expand"}, {"name": "Virtua Athlete 2000", "details_link": "https://www.metacritic.com/game/dreamcast/virtua-athlete-2000", "publisher": "Agetec Inc.", "release_date": "Aug 10 2001", "developers": ["Hitmaker"], "platforms": "Dreamcast", "genres": ["Sports", "Olympic Sports"], "meta_score": 61, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/b5d9cc0dce714b544d3c44cc886a512c-98.jpg", "descriptions": "The top 7 events from Track and Field come to life like never before as players vie for the top sports honor - \"The World's Greatest Athlete!\" Using the latest 3D graphics, Virtua Athlete 2000 challenges you to use quick reflexes, sharp eye-hand coordination, and split-secondThe top 7 events from Track and Field come to life like never before as players vie for the top sports honor - \"The World's Greatest Athlete!\" Using the latest 3D graphics, Virtua Athlete 2000 challenges you to use quick reflexes, sharp eye-hand coordination, and split-second timing to master each of the events.… Expand"}, {"name": "Alien Resurrection", "details_link": "https://www.metacritic.com/game/playstation/alien-resurrection", "publisher": "Fox Interactive", "release_date": "Oct 10 2000", "developers": ["Argonaut Games"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 61, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/a5adcd7fe1b50feec621814f663c7ada-98.jpg", "descriptions": "Ellen Ripley died trying to wipe out the Aliens. Now, 200 years later, scientists have resurrected Ripley - along with the Alien Queen - hoping to create the ultimate weapon. Teamed with a crew of renegade space pirates on a research vessel headed for Earth, they must fight for survival andEllen Ripley died trying to wipe out the Aliens. Now, 200 years later, scientists have resurrected Ripley - along with the Alien Queen - hoping to create the ultimate weapon. Teamed with a crew of renegade space pirates on a research vessel headed for Earth, they must fight for survival and destroy the Aliens once and for all.… Expand"}, {"name": "Dogs of War: Battle On Primus IV", "details_link": "https://www.metacritic.com/game/pc/dogs-of-war-battle-on-primus-iv", "publisher": "TalonSoft", "release_date": "Jul 30 2000", "developers": ["Silicon Dreams"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Tactics"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/d9edf0d0ecd5d7935390d0521c4b891b-98.jpg", "descriptions": "The first fully 3-D tactical action/strategy game to effortlessly mix line-of-sight arcade urgency with the command interface required to lead a massed force to victory, delivering highly challenging and addictive gameplay across a breathtaking, dynamic battlefield.  [TalonSoft]"}, {"name": "Flockers", "details_link": "https://www.metacritic.com/game/playstation-4/flockers", "publisher": "Team17", "release_date": "Sep 23 2014", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 61, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/0/73a2d49b2623ff0b85200f699cce2930-98.jpg", "descriptions": "Flockers is a modern day take on the classic A to B puzzle genre with a generous helping of dark humour for good measure."}, {"name": "DOLMEN", "details_link": "https://www.metacritic.com/game/playstation-5/dolmen", "publisher": "Deep Silver", "release_date": "May 20 2022", "developers": ["Massive Work Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 61, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/842ceaa7d768af1c577dc9c5c93ed9a1-98.jpg", "descriptions": "Cosmic Horror and Sci-Fi are two ways to talk about Dolmen. It is a third person action game with RPG elements but with a lovecraftian plot that calls players to find what's behind the darkest secret of the universe! A forgotten planet called Revion Prime will be the place where the actionCosmic Horror and Sci-Fi are two ways to talk about Dolmen. It is a third person action game with RPG elements but with a lovecraftian plot that calls players to find what's behind the darkest secret of the universe! A forgotten planet called Revion Prime will be the place where the action takes part. And it won't be easy: Adaptation and exploration will be your main weapons as you craft new items and equipments from your enemies' carcasses! Every step can be your last one!\r Use your experience points to improve yourself and face what no human has ever faced. After all, quoting David Hume: \"The life of man is of no greater importance to the universe than that of an oyster.\" Maybe he was right Or not.… Expand"}, {"name": "Test Drive: Ferrari Racing Legends", "details_link": "https://www.metacritic.com/game/xbox-360/test-drive-ferrari-racing-legends", "publisher": "Evolved Games", "release_date": "Jul  3 2012", "developers": ["Atari", "Slightly Mad Studios", "Atari SA"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "General", "General", "Automobile"], "meta_score": 61, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/45e001a794f7d2f0cd2b883cd269833a-98.jpg", "descriptions": "Test Drive: Ferrari Racing Legends is a driving experience for fans of the Ferrari brand."}, {"name": "Need for Speed Payback", "details_link": "https://www.metacritic.com/game/xbox-one/need-for-speed-payback", "publisher": "Electronic Arts", "release_date": "Nov  7 2017", "developers": ["Ghost Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Simulation", "Racing", "Arcade", "Automobile"], "meta_score": 61, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/1/91cf4f531f28781c2f8cc7f34e5cbb9a-98.jpg", "descriptions": "Set in the underworld of Fortune Valley, players drive as three distinct characters reunited by a quest for vengeance against The House, a nefarious cartel that rules the city’s casinos, criminals and cops. They take on a variety of challenges and events as Tyler, the Racer; Mac, theSet in the underworld of Fortune Valley, players drive as three distinct characters reunited by a quest for vengeance against The House, a nefarious cartel that rules the city’s casinos, criminals and cops. They take on a variety of challenges and events as Tyler, the Racer; Mac, the Showman; and Jess, the Wheelman to earn the respect of the underground. Featuring the deepest customization from the series, players can truly craft a personalized and unique ride, or spend hours finding and tuning an abandoned derelict into a supercar. They can then push their cars to the limit and raise the stakes by betting on their own performance, where they can either multiply their winnings or risk losing it all. [Electronic Arts]… Expand"}, {"name": "Age of Pirates 2: City of Abandoned Ships", "details_link": "https://www.metacritic.com/game/pc/age-of-pirates-2-city-of-abandoned-ships", "publisher": "Playlogic", "release_date": "May 26 2009", "developers": ["Akella"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 61, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/21bcfa39c873e4ae26cfa3fbeb49bdc2-98.jpg", "descriptions": "Fortune and glory awaits you! Destiny awaits you, but destiny though is what you make it. Start your buccaneering career by choosing to go it alone and become the most feared pirate on the seven seas or prove your loyalty and take the coin of one of four different navies; French, English,Fortune and glory awaits you! Destiny awaits you, but destiny though is what you make it. Start your buccaneering career by choosing to go it alone and become the most feared pirate on the seven seas or prove your loyalty and take the coin of one of four different navies; French, English, Spanish or Dutch. Sail the high seas as a swashbuckling dread pirate or as a dashing naval captain. Explore strange new countries and undiscovered civilizations, raid and plunder merchant ships, fortified ports and cities. But beware, the dead do not sleep easy, and in the dark South American jungles myth and reality intertwine. Solve the ancient mysteries of a vanishing tribe, cross swords with the most notorious swashbucklers ever to sail the ocean blue and make sure that no foe ever sets foot on land again. [Playlogic]… Expand"}, {"name": "Secret Agent Clank", "details_link": "https://www.metacritic.com/game/playstation-2/secret-agent-clank", "publisher": "SCEA", "release_date": "May 26 2009", "developers": ["Sanzaru Games"], "platforms": "PlayStation 2", "genres": ["Action", "Platformer", "3D"], "meta_score": 61, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/fe1a32ec7895ed1a46924a4471bfc5d8-98.jpg", "descriptions": "Clank's on a mission. His best buddy, Ratchet, has been framed by a ruthless enemy and jailed for a crime he did not commit. Not only that, but Ratchet's maximum security prison is full of the universe's most dangerous criminals most of whom are lining up to personally 'welcome' Ratchet intoClank's on a mission. His best buddy, Ratchet, has been framed by a ruthless enemy and jailed for a crime he did not commit. Not only that, but Ratchet's maximum security prison is full of the universe's most dangerous criminals most of whom are lining up to personally 'welcome' Ratchet into his new cell. Luckily for Ratchet he’s got Clank on the outside, and luckily for Clank he's the kind of brainy little robot who is cool under pressure and knows a thing or two about tracking down a mysterious enemy. That's why, as Secret Agent Clank, he's hot on the trail of clues to unravel the mystery and secure Ratchet’s release from jail. Unleash Clank's cutting edge array of weapons and gadgets, such as Cufflink Bombs, Tie-a-Rangs, Spy Sunglasses and the ever helpful Holo-Disguise Monocle. Launch into a variety of gameplay styles from all-out action to cunning stealth and brain-busting puzzle solving. Drive state-of-the-art super spy vehicles including speedboats, snowboards and sports cars. Play as Clank, Ratchet and even Captain Qwark to gather enough evidence to set Ratchet free and discover who framed the innocent Lombax. [SCEA]… Expand"}, {"name": "Override 2: Super Mech League", "details_link": "https://www.metacritic.com/game/pc/override-2-super-mech-league", "publisher": "Modus Games", "release_date": "Dec 22 2020", "developers": ["Modus Studios Brazil"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Fighting", "3D"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/83ea388ca6e38c772b5a89ff7689cbe0-98.jpg", "descriptions": "Override is a 3D fighting game with local and online multiplayer modes that is perfect for competitive players, mech fans, or casual brawlers.\rThis newest entry to the series features a fully online Career Mode, improved combat systems, and tons of multiplayer modes."}, {"name": "Outcast: Second Contact", "details_link": "https://www.metacritic.com/game/playstation-4/outcast-second-contact", "publisher": "Maximum Games", "release_date": "Nov 14 2017", "developers": ["Appeal", "Bigben Interactive", "Bigben Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Open-World"], "meta_score": 61, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/834142dbccc999bd22a258b9a9176584-98.jpg", "descriptions": "Outcast – Second Contact is the complete remake of the cult title which sparked the open world, action-adventure genre. Take off on an exploration of Adelpha, an alien world as beautiful as it is dangerous, where your heroic journey places the fate of two worlds in your hands."}, {"name": "Major League Baseball 2K9", "details_link": "https://www.metacritic.com/game/playstation-3/major-league-baseball-2k9", "publisher": "2K Sports", "release_date": "Mar  3 2009", "developers": ["2K Sports"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 61, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/1d8e69ffd77a96a454aa63512a597889-98.jpg", "descriptions": "While attending the University of Washington, MLB 2K9's cover athlete Tim Lincecum won the coveted Golden Spikes Award which is given to the nation’s top college baseball player.  He was drafted 10th overall by the San Francisco Giants in 2006.  Known to fans as \"The Franchise\" and \"TheWhile attending the University of Washington, MLB 2K9's cover athlete Tim Lincecum won the coveted Golden Spikes Award which is given to the nation’s top college baseball player.  He was drafted 10th overall by the San Francisco Giants in 2006.  Known to fans as \"The Franchise\" and \"The Freak\", Lincecum was named to the National League All-Star team this past season while putting up astonishing numbers and leading the Majors™ with a remarkable 265 strikeouts.  Lincecum also led the National League in other key pitching categories including win percentage (18-5, .783), opponent’s batting average (.221), and strikeouts per nine innings (10.51), along with ranking second in earned run average (2.62).  For all of his historic accomplishments, Lincecum won the Players’ Choice Award as the National League Outstanding Pitcher this season, along with the National League Pitcher of the Year Award from Sporting News.  Both awards were voted on by his peers.  More significantly, Lincecum today was named the National League Cy Young Award winner, given annually to the top pitcher in both the American League and the National League, and voted on by members of the Baseball Writers’ Association of America. [2K Sports]… Expand"}, {"name": "Need for Speed ProStreet", "details_link": "https://www.metacritic.com/game/wii/need-for-speed-prostreet", "publisher": "EA Games", "release_date": "Nov 13 2007", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 61, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/52554e1215f3ff09e31e7a944f382dd9-98.jpg", "descriptions": "Need for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting yourNeed for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting your skills and reputation against the very best street racers. Need for Speed ProStreet boasts impeccable precision and impressively detailed photo-realistic graphics, effectively transporting you to the center of the action. It pushes the Autosculpt technology to a new level, allowing you to directly impact your car's performance for the first time as well as personalize its appearance. Need for Speed ProStreet is a true taste of raw adrenaline and racing with consequences. Every dent, every scratch and every crumpled body panel is a battle scar, proof of your commitment and competitive mettle. With an aggressive and skilled AI system, you become immersed in an unmatched believable race experience. Add in a revolutionary online mode that will redefine the meaning of competitive social play, and Need for Speed ProStreet is the ultimate formula for an emotionally charged street racing showdown. [Electronic Arts]… Expand"}, {"name": "No Man's Sky", "details_link": "https://www.metacritic.com/game/pc/no-mans-sky", "publisher": "Hello Games", "release_date": "Aug 12 2016", "developers": ["Hello Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Action Adventure", "Open-World"], "meta_score": 61, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/4/800462630e81816c440740d1b9ff3054-98.jpg", "descriptions": "No Man’s Sky is an exploration and survival game set in an infinite procedurally generated universe. Whether a distant mountain or a planet hanging low on the horizon, you can go forth there. You can fly seamlessly from the surface of a planet to another, and every star in the sky is a sunNo Man’s Sky is an exploration and survival game set in an infinite procedurally generated universe. Whether a distant mountain or a planet hanging low on the horizon, you can go forth there. You can fly seamlessly from the surface of a planet to another, and every star in the sky is a sun that you can visit. Where you’ll go and how fast you’ll make you way through this universe is your decision. Explore uncharted solar systems and catalog unique new forms of life. Every planet’s landscape is different from the next and populated by species never before encountered. Acquire ancient artifacts that may reveal the secrets behind the universe. Choose whether to share your discoveries with other players. You won’t see them, but they’re exploring the same universe in parallel; perhaps you’ll make your mark on their worlds as well as your own. Every solar system, planet, ocean and cave is filled with danger, and - make no mistake - you are vulnerable. Your ship and suit are fragile, and every encounter may test your skills to the limit. From dog-fighting in space to first-person combat on a planet’s surface, you will face foes ready to overwhelm you. One mistake could see you lose it all. In No Man’s Sky, every victory and every defeat is permanent. The voyage that stands before you cannot be taken lightly. You must prepare. Collect precious resources on the surfaces of planets and trade them for the ships, suits and equipment that will take you to your destiny in the stars.… Expand"}, {"name": "Asphalt 9: Legends", "details_link": "https://www.metacritic.com/game/switch/asphalt-9-legends", "publisher": "Gameloft", "release_date": "Oct  8 2019", "developers": ["Gameloft"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/ea542d4e869da6d027f5b2fd9f5e5e0b-98.jpg", "descriptions": "Asphalt 9: Legends features an extensive roster of real hypercars from renowned manufacturers such as Ferrari, Porsche, Lamborghini and W Motors. Pick your dream ride and race across spectacular locations around the world. Leave your friends in the dust and become a legend in your own groupAsphalt 9: Legends features an extensive roster of real hypercars from renowned manufacturers such as Ferrari, Porsche, Lamborghini and W Motors. Pick your dream ride and race across spectacular locations around the world. Leave your friends in the dust and become a legend in your own group or break your limits to achieve worldwide glory.… Expand"}, {"name": "Delta Force: Black Hawk Down", "details_link": "https://www.metacritic.com/game/xbox/delta-force-black-hawk-down", "publisher": "NovaLogic", "release_date": "Jul 26 2005", "developers": ["Climax Group"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "44  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 61, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/7bfbfe97f838c0c15abd0d95902d16f0-98.jpg", "descriptions": "In late 1993, the United States launched dual military operations in Mogadishu Somalia.  Delta Force Operatives and Army Rangers were sent in to capture Somali warlords and restore order.  As a Delta Force operative, it's your mission to join daring and intense raids against the oppressiveIn late 1993, the United States launched dual military operations in Mogadishu Somalia.  Delta Force Operatives and Army Rangers were sent in to capture Somali warlords and restore order.  As a Delta Force operative, it's your mission to join daring and intense raids against the oppressive Somali warlords in and around Mogadishu.  Get ready for an intense combat--in solo missions or online multiplayer battles--featuring an arsenal of heavy weapons, military vehicles, and helicopters.… Expand"}, {"name": "Kinect Adventures!", "details_link": "https://www.metacritic.com/game/xbox-360/kinect-adventures!", "publisher": "Microsoft Game Studios", "release_date": "Nov  4 2010", "developers": ["Good Science Studio"], "platforms": "Xbox 360", "num_players": "2 ", "genres": ["Miscellaneous", "Adventure", "General", "General", "Party / Minigame"], "meta_score": 61, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/61d3873cc41eb2fbb223809f4662779f-98.jpg", "descriptions": "Kinect Adventures is a compilation of games for the Xbox 360's motion-sensing accessory Kinect. It will include river rush, which is a rafting simulation."}, {"name": "James Cameron's Avatar: The Game", "details_link": "https://www.metacritic.com/game/xbox-360/james-camerons-avatar-the-game", "publisher": "Ubisoft", "release_date": "Dec  1 2009", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/73e25e43ad2ae96c3be49dc049300f56-98.jpg", "descriptions": "Based on James Cameron's film, the game takes you deep into the heart of Pandora, an alien planet that is beyond imagination. Gamers encounter the Na'vi, Pandora's indigenous people and discover creatures and other wildlife the likes of which have never been seen in the world of video gamesBased on James Cameron's film, the game takes you deep into the heart of Pandora, an alien planet that is beyond imagination. Gamers encounter the Na'vi, Pandora's indigenous people and discover creatures and other wildlife the likes of which have never been seen in the world of video games before. When conflict erupts between the RDA Corporation, a space-faring consortium in search of valuable resources, and the Na'vi, players find themselves thrust into a fight for the heart of a planet and the fate of a civilization. [Ubisoft]… Expand"}, {"name": "Metal Slug XX", "details_link": "https://www.metacritic.com/game/xbox-360/metal-slug-xx", "publisher": "SNK Playmore", "release_date": "May 19 2010", "developers": ["SNK Playmore"], "platforms": ["PC", "PlayStation 4", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "General", "Shooter", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 61, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/3f7f36c1097aa1f2867e5511a809e0f8-98.jpg", "descriptions": "[Xbox Live Arcade]  Joining the fight are the familiar four warriors Marco, Tarma, Eri, and Fio, backed by two allies from The King of Fighters, Ralf and Clark. Adding to the seven multi-path stages, this ultimate 2-D action shooting masterpiece also includes elements such as Combat School,[Xbox Live Arcade]  Joining the fight are the familiar four warriors Marco, Tarma, Eri, and Fio, backed by two allies from The King of Fighters, Ralf and Clark. Adding to the seven multi-path stages, this ultimate 2-D action shooting masterpiece also includes elements such as Combat School, which is loaded with more than 70 missions. [SNK Playmore]… Expand"}, {"name": "Need for Speed Payback", "details_link": "https://www.metacritic.com/game/playstation-4/need-for-speed-payback", "publisher": "Electronic Arts", "release_date": "Nov  7 2017", "developers": ["Ghost Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Simulation", "Racing", "Arcade", "Automobile"], "meta_score": 61, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/0/2036c55848f0605511fb830942b4e22b-98.jpg", "descriptions": "Set in the underworld of Fortune Valley, players drive as three distinct characters reunited by a quest for vengeance against The House, a nefarious cartel that rules the city’s casinos, criminals and cops. They take on a variety of challenges and events as Tyler, the Racer; Mac, theSet in the underworld of Fortune Valley, players drive as three distinct characters reunited by a quest for vengeance against The House, a nefarious cartel that rules the city’s casinos, criminals and cops. They take on a variety of challenges and events as Tyler, the Racer; Mac, the Showman; and Jess, the Wheelman to earn the respect of the underground. Featuring the deepest customization from the series, players can truly craft a personalized and unique ride, or spend hours finding and tuning an abandoned derelict into a supercar. They can then push their cars to the limit and raise the stakes by betting on their own performance, where they can either multiply their winnings or risk losing it all. [Electronic Arts]… Expand"}]