[
  {
    "name": "The Legend of Zelda: Ocarina of Time",
    "details_link": "https://www.metacritic.com/game/nintendo-64/the-legend-of-zelda-ocarina-of-time",
    "publisher": "Nintendo",
    "release_date": "Nov 23 1998",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Nintendo 64",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 99,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/2/70c7a7d5ef1a36a69018111cc1478f30-98.jpg",
    "descriptions": "As a young boy, Link is tricked by Ganondorf, the King of the Gerudo Thieves. The evil human uses Link to gain access to the Sacred Realm, where he places his tainted hands on Triforce and transforms the beautiful Hyrulean landscape into a barren wasteland. Link is determined to fix theAs a young boy, Link is tricked by Ganondorf, the King of the Gerudo Thieves. The evil human uses Link to gain access to the Sacred Realm, where he places his tainted hands on Triforce and transforms the beautiful Hyrulean landscape into a barren wasteland. Link is determined to fix the problems he helped to create, so with the help of Rauru he travels through time gathering the powers of the Seven Sages.… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 2",
    "details_link": "https://www.metacritic.com/game/playstation/tony-hawks-pro-skater-2",
    "publisher": "Activision",
    "release_date": "Sep 20 2000",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 98,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/9/eebb2509d46dbd97c612f634270d37dd-98.jpg",
    "descriptions": "As most major publishers' development efforts shift to any number of next-generation platforms, Tony Hawk 2 will likely stand as one of the last truly fantastic games to be released on the PlayStation."
  },
  {
    "name": "Grand Theft Auto IV",
    "details_link": "https://www.metacritic.com/game/playstation-3/grand-theft-auto-iv",
    "publisher": "Rockstar Games",
    "release_date": "Apr 29 2008",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Open-World"
    ],
    "meta_score": 98,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/2/d08ab1308780df8de1d75badb951c60a-98.jpg",
    "descriptions": "[Metacritic's 2008 PS3 Game of the Year; Also known as \"GTA IV\"]  What does the American Dream mean today? For Niko Belic, fresh off the boat from Europe. It's the hope he can escape his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City,[Metacritic's 2008 PS3 Game of the Year; Also known as \"GTA IV\"]  What does the American Dream mean today? For Niko Belic, fresh off the boat from Europe. It's the hope he can escape his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City, gateway to the land of opportunity. As they slip into debt and are dragged into a criminal underworld by a series of shysters, thieves and sociopaths, they discover that the reality is very different from the dream in a city that worships money and status, and is heaven for those who have them an a living nightmare for those who don't. [Rockstar Games]… Expand"
  },
  {
    "name": "SoulCalibur",
    "details_link": "https://www.metacritic.com/game/dreamcast/soulcalibur",
    "publisher": "Namco",
    "release_date": "Sep  8 1999",
    "developers": [
      "Namco"
    ],
    "platforms": "Dreamcast",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 98,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/1/a62a50a3f751819b94f0f922619c6b95-98.jpg",
    "descriptions": "This is a tale of souls and swords, transcending the world and all its history, told for all eternity... The greatest weapons-based fighter returns, this time on Sega Dreamcast. Soul Calibur unleashes incredible graphics, fantastic fighters, and combos so amazing they'll make your head spin!"
  },
  {
    "name": "Grand Theft Auto IV",
    "details_link": "https://www.metacritic.com/game/xbox-360/grand-theft-auto-iv",
    "publisher": "Rockstar Games",
    "release_date": "Apr 29 2008",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Open-World"
    ],
    "meta_score": 98,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/3/78b2451531891db4396d873d82accbeb-98.jpg",
    "descriptions": "[Metacritic's 2008 Xbox 360 Game of the Year; Also known as \"GTA IV\"]  What does the American Dream mean today? For Niko Belic, fresh off the boat from Europe. It's the hope he can escape his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City,[Metacritic's 2008 Xbox 360 Game of the Year; Also known as \"GTA IV\"]  What does the American Dream mean today? For Niko Belic, fresh off the boat from Europe. It's the hope he can escape his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City, gateway to the land of opportunity. As they slip into debt and are dragged into a criminal underworld by a series of shysters, thieves and sociopaths, they discover that the reality is very different from the dream in a city that worships money and status, and is heaven for those who have them an a living nightmare for those who don't. [Rockstar Games]… Expand"
  },
  {
    "name": "Super Mario Galaxy",
    "details_link": "https://www.metacritic.com/game/wii/super-mario-galaxy",
    "publisher": "Nintendo",
    "release_date": "Nov 12 2007",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Wii",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "3D"
    ],
    "meta_score": 97,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/9/2fe120b980872297a7a17ab582f6af7d-98.jpg",
    "descriptions": "[Metacritic's 2007 Wii Game of the Year] The ultimate Nintendo hero is taking the ultimate step ... out into space. Join Mario as he ushers in a new era of video games, defying gravity across all the planets in the galaxy. When some creature escapes into space with Princess Peach, Mario[Metacritic's 2007 Wii Game of the Year] The ultimate Nintendo hero is taking the ultimate step ... out into space. Join Mario as he ushers in a new era of video games, defying gravity across all the planets in the galaxy. When some creature escapes into space with Princess Peach, Mario gives chase, exploring bizarre planets all across the galaxy. Mario, Peach and enemies new and old are here. Players run, jump and battle enemies as they explore all the planets in the galaxy. Since this game makes full use of all the features of the Wii Remote, players have to do all kinds of things to succeed: pressing buttons, swinging the Wii Remote and the Nunchuk, and even pointing at and dragging things with the pointer. Since he's in space, Mario can perform mind-bending jumps unlike anything he's done before. He'll also have a wealth of new moves that are all based around tilting, pointing and shaking the Wii Remote. Shake, tilt and point! Mario takes advantage of all the unique aspects of the Wii Remote and Nunchuk controller, unleashing new moves as players shake the controller and even point at and drag items with the pointer. [Nintendo]… Expand"
  },
  {
    "name": "Super Mario Galaxy 2",
    "details_link": "https://www.metacritic.com/game/wii/super-mario-galaxy-2",
    "publisher": "Nintendo",
    "release_date": "May 23 2010",
    "developers": [
      "Nintendo EAD Tokyo"
    ],
    "platforms": "Wii",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "3D"
    ],
    "meta_score": 97,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/7/96ee04660e2b430798eae4f59d9bdeb2-98.jpg",
    "descriptions": "Super Mario Galaxy 2, the sequel to the galaxy-hopping original game, includes the gravity-defying, physics-based exploration from the first game, but is loaded with entirely new galaxies and features to challenge players. On some stages, Mario can pair up with his dinosaur buddy Yoshi andSuper Mario Galaxy 2, the sequel to the galaxy-hopping original game, includes the gravity-defying, physics-based exploration from the first game, but is loaded with entirely new galaxies and features to challenge players. On some stages, Mario can pair up with his dinosaur buddy Yoshi and use his tongue to grab items and spit them back at enemies. Players can also have fun with new items such as a drill that lets our hero tunnel through solid rock. [Nintendo]… Expand"
  },
  {
    "name": "Red Dead Redemption 2",
    "details_link": "https://www.metacritic.com/game/xbox-one/red-dead-redemption-2",
    "publisher": "Rockstar Games",
    "release_date": "Oct 26 2018",
    "developers": [
      "Rockstar Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Xbox One"
    ],
    "num_players": "Up to 32 ",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 97,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/9/24fbb5ce1d84f499b1fb0cf2c483287c-98.jpg",
    "descriptions": "Developed by the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America’s unforgiving heartland. The game’s vast and atmospheric world also provides the foundation for a brand new online multiplayer experience. America, 1899. The endDeveloped by the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America’s unforgiving heartland. The game’s vast and atmospheric world also provides the foundation for a brand new online multiplayer experience. America, 1899. The end of the Wild West era has begun. After a robbery goes badly wrong in the western town of Blackwater, Arthur Morgan and the Van der Linde gang are forced to flee. With federal agents and the best bounty hunters in the nation massing on their heels, the gang has to rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal fissures threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang that raised him. [Rockstar]… Expand"
  },
  {
    "name": "Grand Theft Auto V",
    "details_link": "https://www.metacritic.com/game/xbox-one/grand-theft-auto-v",
    "publisher": "Rockstar Games",
    "release_date": "Nov 18 2014",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox 360",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "Up to 30 ",
    "genres": [
      "Action Adventure",
      "Modern",
      "Open-World"
    ],
    "meta_score": 97,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/7f10462040718b3054c52f7791cf1c77-98.jpg",
    "descriptions": "Grand Theft Auto 5 melds storytelling and gameplay in unique ways as players repeatedly jump in and out of the lives of the game's three protagonists, playing all sides of the game's interwoven story."
  },
  {
    "name": "Grand Theft Auto V",
    "details_link": "https://www.metacritic.com/game/playstation-3/grand-theft-auto-v",
    "publisher": "Rockstar Games",
    "release_date": "Sep 17 2013",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox 360",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 3"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Modern",
      "Action Adventure",
      "Modern",
      "Open-World"
    ],
    "meta_score": 97,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/399bb685cc7f747a3b39a35acb5dc5de-98.jpg",
    "descriptions": "Los Santos is a vast, sun-soaked metropolis full of self-help gurus, starlets and once-important, formerly-known-as celebrities. The city was once the envy of the Western world, but is now struggling to stay afloat in an era of economic uncertainty and reality TV. Amidst the chaos, threeLos Santos is a vast, sun-soaked metropolis full of self-help gurus, starlets and once-important, formerly-known-as celebrities. The city was once the envy of the Western world, but is now struggling to stay afloat in an era of economic uncertainty and reality TV. Amidst the chaos, three unique criminals plot their own chances of survival and success:  Franklin, a former street gangster in search of real opportunities and serious cheddar; Michael, a professional ex-con whose retirement is a lot less rosy than he hoped it would be; and Trevor, a violent maniac driven by the chance of a cheap high and the next big score. Quickly running out of options, the crew risks it all in a sequence of daring and dangerous heists that could set them up for life.… Expand"
  },
  {
    "name": "Disco Elysium: The Final Cut",
    "details_link": "https://www.metacritic.com/game/pc/disco-elysium-the-final-cut",
    "publisher": "ZA/UM",
    "release_date": "Mar 30 2021",
    "developers": [
      "ZA/UM"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General",
      "Western-Style"
    ],
    "meta_score": 97,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/6/e3879329612427aca58cb5b7c7ab9818-98.jpg",
    "descriptions": "Disco Elysium - The Final Cut is the definitive edition of the smash-hit RPG. Pursue your political dreams in new quests, meet and question more of the city's locals, and explore a whole extra area. Full voice-acting, controller support, and expanded language options also included. Get evenDisco Elysium - The Final Cut is the definitive edition of the smash-hit RPG. Pursue your political dreams in new quests, meet and question more of the city's locals, and explore a whole extra area. Full voice-acting, controller support, and expanded language options also included. Get even more out of this award-winning open world. You're a detective with a unique skill system at your disposal and a whole city block to carve your path across. Interrogate unforgettable characters, crack murders, or take bribes. Become a hero or an absolute disaster of a human being.… Expand"
  },
  {
    "name": "Grand Theft Auto V",
    "details_link": "https://www.metacritic.com/game/xbox-360/grand-theft-auto-v",
    "publisher": "Rockstar Games",
    "release_date": "Sep 17 2013",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Xbox 360"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Modern",
      "Action Adventure",
      "Modern",
      "Open-World"
    ],
    "meta_score": 97,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/6/a03025b77dabe0980c17c6a3c8f540ae-98.jpg",
    "descriptions": "Los Santos is a sprawling sun-soaked metropolis full of self-help gurus, starlets and once-important stars. The city was once the envy of the Western world, but is now struggling to stay relevant in an era of economic uncertainty and reality TV. Amidst the chaos, three very differentLos Santos is a sprawling sun-soaked metropolis full of self-help gurus, starlets and once-important stars. The city was once the envy of the Western world, but is now struggling to stay relevant in an era of economic uncertainty and reality TV. Amidst the chaos, three very different criminals chart their own chances of survival and success:  Franklin, a former street gangster, now looking for real opportunities and fat stacks of cash; Michael, a professional ex-con whose retirement is significantly less rosy than he hoped it would be; and Trevor, a violent maniac driven by the chance of a cheap high and the next big score. Rapidly running out of options, the crew risks everything in a series of bolt and dangerous heists that could set them up for the long haul.… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 2",
    "details_link": "https://www.metacritic.com/game/dreamcast/tony-hawks-pro-skater-2",
    "publisher": "Activision",
    "release_date": "Nov  6 2000",
    "developers": [
      "Treyarch"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Dreamcast"
    ],
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 97,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/0/3d40880e41d0c8cd6732242de27d5cb2-98.jpg",
    "descriptions": "Hawk's back - with new technology, new pros and new tricks! THPS2, the legend rides on! Skate as legendary Tony Hawk or any one of 12 other pro skaters. Create your own custom skaters. Multiple play modes including 1-Player, Career and Free Skate modes, as well as 2-player modes such asHawk's back - with new technology, new pros and new tricks! THPS2, the legend rides on! Skate as legendary Tony Hawk or any one of 12 other pro skaters. Create your own custom skaters. Multiple play modes including 1-Player, Career and Free Skate modes, as well as 2-player modes such as Trick Attack, Graffiti Tag and Horse. Build your own custom skate parks with the real-time 3D park editor.… Expand"
  },
  {
    "name": "The Legend of Zelda: Breath of the Wild",
    "details_link": "https://www.metacritic.com/game/switch/the-legend-of-zelda-breath-of-the-wild",
    "publisher": "Nintendo",
    "release_date": "Mar  3 2017",
    "developers": [
      "Nintendo"
    ],
    "platforms": [
      "Wii U",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 97,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/9/6d163aaa6b6cc28519ffea9195649929-98.jpg",
    "descriptions": "Forget everything you know about The Legend of Zelda games. Step into a world of discovery, exploration and adventure in The Legend of Zelda: Breath of the Wild, a boundary-breaking new game in the acclaimed series. Travel across fields, through forests and to mountain peaks as you discoverForget everything you know about The Legend of Zelda games. Step into a world of discovery, exploration and adventure in The Legend of Zelda: Breath of the Wild, a boundary-breaking new game in the acclaimed series. Travel across fields, through forests and to mountain peaks as you discover what has become of the ruined kingdom of Hyrule in this open-air adventure. Explore the wilds of Hyrule any way you like - Climb up towers and mountain peaks in search of new destinations, then set your own path to get there and plunge into the wilderness. Along the way, you'll battle towering enemies, hunt wild beasts and gather ingredients for the food and elixirs you'll need to sustain you on your journey. More than 100 Shrines of Trials to discover and explore - Shrines dot the landscape, waiting to be discovered in any order you want. Search for them in various ways, and solve a variety of puzzles inside. Work your way through the traps and devices inside to earn special items and other rewards that will help you on your adventure.\r*    Be prepared and properly equipped - With an entire world waiting to be explored, you'll need a variety of outfits and gear to reach every corner. You may need to bundle up with warmer clothes or change into something better suited to the desert heat. Some clothing even has special effects that, for example, can make you faster and stealthier.\r*    Battling enemies requires strategy - The world is inhabited with enemies of all shapes and sizes. Each one has its own attack method and weaponry, so you must think quickly and develop the right strategies to defeat them.\r*    amiibo compatibility - Tap the Wolf Link amiibo (sold separately) to make Wolf Link appear in game. Wolf Link will attack enemies on his own and help you find items you're searching for.… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 3",
    "details_link": "https://www.metacritic.com/game/playstation-2/tony-hawks-pro-skater-3",
    "publisher": "Activision",
    "release_date": "Oct 28 2001",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 97,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/2/38c2011309e2cee4e5ae373456d5730b-98.jpg",
    "descriptions": "Challenge up to four friends in online competitions over a LAN or the Internet.  Take them on in both Trick Attack and Graffiti modes. [Activision]"
  },
  {
    "name": "Perfect Dark",
    "details_link": "https://www.metacritic.com/game/nintendo-64/perfect-dark",
    "publisher": "Nintendo",
    "release_date": "May 22 2000",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Nintendo 64",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 97,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/1/e064722d2d4521cb762502a48691e070-98.jpg",
    "descriptions": "Step into the Dark... As Carrington Institute's most promising new Agent, Joanna Dark must uncover the truth behind the dataDyne Corporation's recent technological breakthroughs - breakthroughs which could have serious consequences for mankind."
  },
  {
    "name": "Red Dead Redemption 2",
    "details_link": "https://www.metacritic.com/game/playstation-4/red-dead-redemption-2",
    "publisher": "Rockstar Games",
    "release_date": "Oct 26 2018",
    "developers": [
      "Rockstar Games"
    ],
    "platforms": [
      "PC",
      "Stadia",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 32 ",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 97,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/8/f5b1cbf43a118c429f67022f9e93b41d-98.jpg",
    "descriptions": "Developed by the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America’s unforgiving heartland. The game’s vast and atmospheric world also provides the foundation for a brand new online multiplayer experience. America, 1899. The endDeveloped by the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America’s unforgiving heartland. The game’s vast and atmospheric world also provides the foundation for a brand new online multiplayer experience. America, 1899. The end of the Wild West era has begun. After a robbery goes badly wrong in the western town of Blackwater, Arthur Morgan and the Van der Linde gang are forced to flee. With federal agents and the best bounty hunters in the nation massing on their heels, the gang has to rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal fissures threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang that raised him. [Rockstar]… Expand"
  },
  {
    "name": "Grand Theft Auto V",
    "details_link": "https://www.metacritic.com/game/playstation-4/grand-theft-auto-v",
    "publisher": "Rockstar Games",
    "release_date": "Nov 18 2014",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 5",
      "Xbox 360",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "Up to 30 ",
    "genres": [
      "Action Adventure",
      "Modern",
      "Open-World"
    ],
    "meta_score": 97,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/7/a149682ad949afdce7d25ee90d0ef848-98.jpg",
    "descriptions": "The sprawling sun-soaked metropolis of Los Santos is chock full of self-help coaches, starlets and C-List celebrities, once on top of the media world, now struggling to stay relevant in time of economic malaise and lowest-common-denominator reality TV. Amidst this madness, three uniqueThe sprawling sun-soaked metropolis of Los Santos is chock full of self-help coaches, starlets and C-List celebrities, once on top of the media world, now struggling to stay relevant in time of economic malaise and lowest-common-denominator reality TV. Amidst this madness, three unique criminals plan their own chances of survival and success: Franklin, a street-level hustler in search of opportunities for serious money; Michael, an ex-con whose \"retirement\" is a less rosy than he hoped it would be; and Trevor, a violent dude driven by the chance for a quick high and the next big score. Nearly out of options, the crew risks it all in a series of daring and dangerous heists that could set them up for life - one way or the other.… Expand"
  },
  {
    "name": "Metroid Prime",
    "details_link": "https://www.metacritic.com/game/gamecube/metroid-prime",
    "publisher": "Nintendo",
    "release_date": "Nov 17 2002",
    "developers": [
      "Retro Studios"
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 97,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/6/319fee49d72c25208b5dc3d8ae65f84e-98.jpg",
    "descriptions": "Samus returns in a new mission to unravel the mystery behind the ruined walls scattered across Tallon IV. In Metroid Prime, you'll play the role of this bounty hunter and view the world through her visor, which displays information ranging from current energy levels to ammunition. EquippedSamus returns in a new mission to unravel the mystery behind the ruined walls scattered across Tallon IV. In Metroid Prime, you'll play the role of this bounty hunter and view the world through her visor, which displays information ranging from current energy levels to ammunition. Equipped with a Power Beam and Gravity Suit, you must shoot locked switches, solve puzzles, and eliminate enemies. It's up to you to explore the world and recover more power-ups and weapons, which gradually open more gameplay areas.… Expand"
  },
  {
    "name": "Grand Theft Auto III",
    "details_link": "https://www.metacritic.com/game/playstation-2/grand-theft-auto-iii",
    "publisher": "Rockstar Games",
    "release_date": "Oct 22 2001",
    "developers": [
      "DMA Design"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 97,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/227b480f073b1c0ffba8b7a6dc79a453-98.jpg",
    "descriptions": "Players are put at the heart of their very own gangster movie, and let loose in a fully-realised 3 dimensional city with a cast of hundreds, 50 plus vehicles, ranging from sports cars to ice cream trucks and from boats to buses, 3 hours of music, including opera, reggae, house, drum andPlayers are put at the heart of their very own gangster movie, and let loose in a fully-realised 3 dimensional city with a cast of hundreds, 50 plus vehicles, ranging from sports cars to ice cream trucks and from boats to buses, 3 hours of music, including opera, reggae, house, drum and bass, pop and disco, and a huge array of street ready weapons.  [Rockstar Games]… Expand"
  },
  {
    "name": "Super Mario Odyssey",
    "details_link": "https://www.metacritic.com/game/switch/super-mario-odyssey",
    "publisher": "Nintendo",
    "release_date": "Oct 27 2017",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 97,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/0/95d6598e9d4f35b872429b25d2d044d0-98.jpg",
    "descriptions": "New Evolution of Mario Sandbox-Style Gameplay. Mario embarks on a new journey through unknown worlds, running and jumping through huge 3D worlds in the first sandbox-style Mario game since Super Mario 64 and Super Mario Sunshine. Set sail between expansive worlds aboard an airship, andNew Evolution of Mario Sandbox-Style Gameplay. Mario embarks on a new journey through unknown worlds, running and jumping through huge 3D worlds in the first sandbox-style Mario game since Super Mario 64 and Super Mario Sunshine. Set sail between expansive worlds aboard an airship, and perform all-new actions, such as throwing Mario's cap.… Expand"
  },
  {
    "name": "Halo: Combat Evolved",
    "details_link": "https://www.metacritic.com/game/xbox/halo-combat-evolved",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov 14 2001",
    "developers": [
      "Bungie Software"
    ],
    "platforms": [
      "PC",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 97,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/9/608a28ac37e2b3fc92291ca176867f67-98.jpg",
    "descriptions": "Enter the mysterious world of Halo, an alien planet shaped like a ring.  As mankind's super soldier Master Chief, you must uncover the secrets of Halo and fend off the attacking Covenant.  During your missions, you'll battle on foot, in vehicles, inside, and outside with alien and humanEnter the mysterious world of Halo, an alien planet shaped like a ring.  As mankind's super soldier Master Chief, you must uncover the secrets of Halo and fend off the attacking Covenant.  During your missions, you'll battle on foot, in vehicles, inside, and outside with alien and human weaponry.  Your objectives include attacking enemy outposts, raiding underground labs for advanced technology, rescuing fallen comrades, and sniping enemy forces.  Halo also lets you battle three other players via intense split screen combat or fight cooperatively with a friend through the single-player missions.  … Expand"
  },
  {
    "name": "NFL 2K1",
    "details_link": "https://www.metacritic.com/game/dreamcast/nfl-2k1",
    "publisher": "Sega",
    "release_date": "Sep  7 2000",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 97,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/4/18d735e823ff5b4bb6568596e3b902dc-98.jpg",
    "descriptions": "In the end, NFL 2K1 is a deeper, more refined version of the original game."
  },
  {
    "name": "Half-Life 2",
    "details_link": "https://www.metacritic.com/game/pc/half-life-2",
    "publisher": "VU Games",
    "release_date": "Nov 16 2004",
    "developers": [
      "Valve Software"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 96,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/8/3154ea81c0d3578b829a6640ac5ecfe7-98.jpg",
    "descriptions": "[Metacritic's 2004 PC Game of the Year]  By taking the suspense, challenge and visceral charge of the original, and adding startling new realism and responsiveness, Half-Life 2 opens the door to a world where the player's presence affects everything around him, from the physical environment[Metacritic's 2004 PC Game of the Year]  By taking the suspense, challenge and visceral charge of the original, and adding startling new realism and responsiveness, Half-Life 2 opens the door to a world where the player's presence affects everything around him, from the physical environment to the behaviors -- even the emotions -- of both friends and enemies. The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people -- people he cares about -- are counting on him. [Vivendi Universal]… Expand"
  },
  {
    "name": "Grand Theft Auto V",
    "details_link": "https://www.metacritic.com/game/pc/grand-theft-auto-v",
    "publisher": "Rockstar Games",
    "release_date": "Apr 13 2015",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox 360",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Up to 32 ",
    "genres": [
      "Modern",
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 96,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/2/bab786f634eee57a1c68be2dddf3d1e5-98.jpg",
    "descriptions": "Los Santos: a sprawling sun-soaked metropolis full of self-help gurus, starlets and fading celebrities, once the envy of the Western world, now struggling to stay alive in a time of economic uncertainty and cheap reality TV. Amidst the turmoil, three very unique criminals plot their ownLos Santos: a sprawling sun-soaked metropolis full of self-help gurus, starlets and fading celebrities, once the envy of the Western world, now struggling to stay alive in a time of economic uncertainty and cheap reality TV. Amidst the turmoil, three very unique criminals plot their own chances of survival and success: Franklin, a street hustler looking for tangible opportunities and serious money; Michael, a professional ex-con whose retirement is less rosy than he figured it would be; and Trevor, a violent dude driven by the opportunity for a cheap high and his next big score. With options at a premium, the crew risks it all in a myriad of daring and dangerous heists that could set them up for life.… Expand"
  },
  {
    "name": "The Legend of Zelda: Breath of the Wild",
    "details_link": "https://www.metacritic.com/game/wii-u/the-legend-of-zelda-breath-of-the-wild",
    "publisher": "Nintendo",
    "release_date": "Mar  3 2017",
    "developers": [
      "Nintendo"
    ],
    "platforms": [
      "Switch",
      "Wii U"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Fantasy",
      "Fantasy",
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 96,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/fa623f980d44795931b47cee835b1e9e-98.jpg",
    "descriptions": "Ignore everything you know about The Legend of Zelda games. Step into a world of discovery, exploration and adventure in The Legend of Zelda: Breath of the Wild. Travel across fields, through forests and to mountain peaks as you discover what has become of the ruined kingdom of Hyrule inIgnore everything you know about The Legend of Zelda games. Step into a world of discovery, exploration and adventure in The Legend of Zelda: Breath of the Wild. Travel across fields, through forests and to mountain peaks as you discover what has become of the ruined kingdom of Hyrule in this stunning open-air adventure. Explore the wilds of Hyrule any way you like - Climb up towers and mountain peaks in search of new destinations, then set your own path to get there and plunge into the wilderness. Along the way, you'll battle towering enemies, hunt wild beasts and gather ingredients for the food and elixirs you'll need to sustain you on your journey. More than 100 Shrines of Trials to discover and explore - Shrines dot the landscape, waiting to be discovered in any order you want. Search for them in various ways, and solve a variety of puzzles inside. Work your way through the traps and devices inside to earn special items and other rewards that will help you on your adventure. Be prepared and properly equipped - With an entire world waiting to be explored, you'll need a variety of outfits and gear to reach every corner. You may need to bundle up with warmer clothes or change into something better suited to the desert heat. Some clothing even has special effects that, for example, can make you faster and stealthier. [Nintendo]… Expand"
  },
  {
    "name": "BioShock",
    "details_link": "https://www.metacritic.com/game/xbox-360/bioshock",
    "publisher": "2K Games",
    "release_date": "Aug 21 2007",
    "developers": [
      "Irrational Games",
      "2K Marin"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 96,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/8/beb94c19496b1e7b633f7bf7285f42ea-98.jpg",
    "descriptions": "[Metacritic's 2007 Xbox 360 Game of the Year] Going beyond \"run and gun corridors,\" \"monster-closet AIs\" and static worlds, BioShock creates a living, unique and unpredictable FPS experience. After your plane crashes into icy uncharted waters, you discover a rusted bathysphere and descend[Metacritic's 2007 Xbox 360 Game of the Year] Going beyond \"run and gun corridors,\" \"monster-closet AIs\" and static worlds, BioShock creates a living, unique and unpredictable FPS experience. After your plane crashes into icy uncharted waters, you discover a rusted bathysphere and descend into Rapture, a city hidden beneath the sea. Constructed as an idealistic society for a hand picked group of scientists, artists and industrialists, the idealism is no more. Now the city is littered with corpses, wildly powerful guardians roam the corridors as little girls loot the dead, and genetically mutated citizens ambush you at every turn. Take control of your world by hacking mechanical devices, commandeering security turrets and crafting unique items critical to your very survival. Upgrade your weapons with ionic gels, explosives and toxins to customize them to the enemy and environment. Genetically modify your body through dozens of Plasmid Stations scattered throughout the city, empowering you with fantastic and often grotesque abilities. Explore a living world powered by Ecological A.I., where the inhabitants have interesting and consequential relationships with one another that impact your gameplay experience. Experience truly next generation graphics that vividly illustrate the forlorn art deco city, highlighted by the most detailed and realistic water effects ever developed in a video game. Make meaningful choices and mature decisions, ultimately culminating in the grand question: do you exploit the innocent survivors of Rapture...or save them? [2K Games]… Expand"
  },
  {
    "name": "GoldenEye 007",
    "details_link": "https://www.metacritic.com/game/nintendo-64/goldeneye-007",
    "publisher": "Nintendo",
    "release_date": "Aug 25 1997",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Nintendo 64",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Modern"
    ],
    "meta_score": 96,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/7/31a33b1d22da218508d3962b8c227f9c-98.jpg",
    "descriptions": "You are Bond. James Bond. You are assigned covert operations connected with the GoldenEye weapons satellite. M will brief you on your mission and objectives from London. Q Branch will support your efforts with a plentiful supply of weapons and gadgets. Moneypenny offers you light-heartedYou are Bond. James Bond. You are assigned covert operations connected with the GoldenEye weapons satellite. M will brief you on your mission and objectives from London. Q Branch will support your efforts with a plentiful supply of weapons and gadgets. Moneypenny offers you light-hearted best wishes and you're off! Your mission begins in the heavily guarded chemical warfare facility at the Byelomorye Dam in the USSR. Look and shoot in any direction as you navigate 12 interactive 3-D environments. Use stealth and force as you see fit in matters of international security. Consider the military personnel expendable. You are licensed to kill!… Expand"
  },
  {
    "name": "Uncharted 2: Among Thieves",
    "details_link": "https://www.metacritic.com/game/playstation-3/uncharted-2-among-thieves",
    "publisher": "SCEA",
    "release_date": "Oct 13 2009",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": "PlayStation 3",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Linear"
    ],
    "meta_score": 96,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/5/bcd9564959c78dc1f80bb54950bda4ec-98.jpg",
    "descriptions": "Fortune hunter Nathan Drake returns in Uncharted 2: Among Thieves, a third-person action-adventure/shooter created by award-winning developer Naughty Dog. Down on his luck, Drake is lured back into the treacherous world of thieves and mercenary treasure-seekers he had sought to leave behind.Fortune hunter Nathan Drake returns in Uncharted 2: Among Thieves, a third-person action-adventure/shooter created by award-winning developer Naughty Dog. Down on his luck, Drake is lured back into the treacherous world of thieves and mercenary treasure-seekers he had sought to leave behind. When a mysterious artifact propels Drake on an expedition to find the legendary Himalayan valley of Shambhala, he finds himself embroiled in a dangerous game of cat-and-mouse against a fugitive war criminal who’s after more than just the fabled riches of the lost city. Caught in a web of deception and plunged into an increasingly deadly pursuit that tests the limits of his endurance, Drake will be forced to risk everything - but has his luck finally run out? [SCEA]… Expand"
  },
  {
    "name": "Resident Evil 4",
    "details_link": "https://www.metacritic.com/game/gamecube/resident-evil-4",
    "publisher": "Capcom",
    "release_date": "Jan 11 2005",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox Series X",
      "GameCube"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Horror"
    ],
    "meta_score": 96,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/5/435703cf4e3b925b9a7cfea3d78d4b95-98.jpg",
    "descriptions": "Resident Evil 4 marks a new chapter in the Resident Evil series. You'll rejoin Leon S. Kennedy six years after his first mission as a rookie cop from Resident Evil 2. Now a US agent, Leon is on a top secret mission to investigate the disappearance of the president's daughter. As Leon, youResident Evil 4 marks a new chapter in the Resident Evil series. You'll rejoin Leon S. Kennedy six years after his first mission as a rookie cop from Resident Evil 2. Now a US agent, Leon is on a top secret mission to investigate the disappearance of the president's daughter. As Leon, you must make your way to a mysterious location in Europe, where new enemies await. Take them down by using enhanced aim-and-shoot features and a new action button.… Expand"
  },
  {
    "name": "The Orange Box",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-orange-box",
    "publisher": "EA Games",
    "release_date": "Oct 10 2007",
    "developers": [
      "Valve Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Action",
      "Miscellaneous",
      "Shooter",
      "Compilation",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 96,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/5/a1e86e73c40d4ce70191b86ccbf9295f-98.jpg",
    "descriptions": "Games included in The Orange Box compilation: The original Half-Life 2 - The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust intoGames included in The Orange Box compilation: The original Half-Life 2 - The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people - people he cares about - are counting on him. Half-Life 2: Episode One - The player reprises his role of Dr. Freeman, who must immediately face the repercussions of his actions in City 17 and the Citadel. Freeman reconnects with Alyx Vance and her robot, Dog, as they continue their support of the resistance's battle against the Combine forces.  Half-Life 2: Episode Two -- the second installment in Valve's episodic trilogy advances the award-winning story, leading the player to new locations outside of City 17. Portal - a pioneering type of single player action game that rewrites the rules for how players approach and manipulate their environment – much like how Half-Life 2's Gravity Gun reinvented the way gamers interact with objects in the game. Team Fortress 2 - an all-new version of the legendary title that spawned team based multiplayer action games. The game's daring new art style features the most advanced graphics of any Source-based game released to date. [Valve Software]… Expand"
  },
  {
    "name": "The Orange Box",
    "details_link": "https://www.metacritic.com/game/pc/the-orange-box",
    "publisher": "EA Games",
    "release_date": "Oct 10 2007",
    "developers": [
      "Valve Software"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "Up to 32 ",
    "genres": [
      "Action",
      "Miscellaneous",
      "Shooter",
      "Compilation",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 96,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/5/cf1e9a839c0b223409d505c354dfe59b-98.jpg",
    "descriptions": "Games included in The Orange Box compilation: The original Half-Life 2 - The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust intoGames included in The Orange Box compilation: The original Half-Life 2 - The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people - people he cares about - are counting on him. Half-Life 2: Episode One - The player reprises his role of Dr. Freeman, who must immediately face the repercussions of his actions in City 17 and the Citadel. Freeman reconnects with Alyx Vance and her robot, Dog, as they continue their support of the resistance's battle against the Combine forces.  Half-Life 2: Episode Two -- the second installment in Valve's episodic trilogy advances the award-winning story, leading the player to new locations outside of City 17. Portal - a pioneering type of single player action game that rewrites the rules for how players approach and manipulate their environment – much like how Half-Life 2's Gravity Gun reinvented the way gamers interact with objects in the game. Team Fortress 2 - an all-new version of the legendary title that spawned team based multiplayer action games. The game's daring new art style features the most advanced graphics of any Source-based game released to date. [Valve Software]… Expand"
  },
  {
    "name": "Batman: Arkham City",
    "details_link": "https://www.metacritic.com/game/playstation-3/batman-arkham-city",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Oct 18 2011",
    "developers": [
      "Rocksteady Studios"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Fantasy",
      "Open-World"
    ],
    "meta_score": 96,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/2/eda8575517197b9f2e2ae7d2cbd8ce28-98.jpg",
    "descriptions": "Developed by Rocksteady Studios, Batman: Arkham City builds upon the intense, atmospheric foundation of Batman: Arkham Asylum, sending players soaring into Arkham City, the new maximum security \"home\" for all of Gotham City's thugs, gangsters and insane criminal masterminds. Set inside theDeveloped by Rocksteady Studios, Batman: Arkham City builds upon the intense, atmospheric foundation of Batman: Arkham Asylum, sending players soaring into Arkham City, the new maximum security \"home\" for all of Gotham City's thugs, gangsters and insane criminal masterminds. Set inside the heavily fortified walls of a sprawling district in the heart of Gotham City, this highly anticipated sequel introduces a brand-new story that draws together a new all-star cast of classic characters and murderous villains from the Batman universe, as well as a vast range of new and enhanced gameplay features to deliver the ultimate experience as the Dark Knight. … Expand"
  },
  {
    "name": "Portal Companion Collection",
    "details_link": "https://www.metacritic.com/game/switch/portal-companion-collection",
    "publisher": "Valve Software",
    "release_date": "Jun 28 2022",
    "developers": [
      "Valve Software"
    ],
    "platforms": "Switch",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 96,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/0/0fd9dd168f28144ddfc481f6299eeaf6-98.jpg",
    "descriptions": "Including Portal and Portal 2, the Companion Collection comes to Nintendo Switch™ with all the groundbreaking gameplay, dark humor, and exploration that earned the series hundreds of awards. In Portal, you’ll use a highly experimental portal device to solve physical puzzles and challenges.Including Portal and Portal 2, the Companion Collection comes to Nintendo Switch™ with all the groundbreaking gameplay, dark humor, and exploration that earned the series hundreds of awards. In Portal, you’ll use a highly experimental portal device to solve physical puzzles and challenges. Maneuver objects--and yourself--through space to puzzle your way through the mysterious Aperture Science Laboratories.\r Return to Aperture Laboratories in Portal 2 where you’ll once again face off with the lethally inventive, power-mad A.I. named GLaDOS. Meet an expanded cast of characters as you think your way through dangerous, never-before-seen areas of the laboratories and a wider variety of portal puzzles. Plus Portal 2 also includes a co-operative game mode with local, split-screen and online multiplayer so you and a friend can think with portals.… Expand"
  },
  {
    "name": "Tekken 3",
    "details_link": "https://www.metacritic.com/game/playstation/tekken-3",
    "publisher": "Namco",
    "release_date": "Apr 29 1998",
    "developers": [
      "Namco"
    ],
    "platforms": "PlayStation",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 96,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/0/fd71737a311c55b0bf05a3e9ecbc1653-98.jpg",
    "descriptions": "An ancient evil force has reawakened, attacking in secret and feeding on the souls of mighty warriors. To lure it out of hiding will take the greatest fighting contest the world has ever seen...Tekken 3. Some are fighting for revenge, some for honor, Ultimately, all are fighting for theirAn ancient evil force has reawakened, attacking in secret and feeding on the souls of mighty warriors. To lure it out of hiding will take the greatest fighting contest the world has ever seen...Tekken 3. Some are fighting for revenge, some for honor, Ultimately, all are fighting for their lives and the fate of all mankind.… Expand"
  },
  {
    "name": "Elden Ring",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/elden-ring",
    "publisher": "Bandai Namco Games",
    "release_date": "Feb 25 2022",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 96,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/6/c900d44c97dfd16cc1fb1a08f7e5813e-98.jpg",
    "descriptions": "A New World Created By Hidetaka Miyazaki And George R. R. Martin. ELDEN RING, developed by FromSoftware, Inc. and BANDAI NAMCO Entertainment Inc., is a fantasy action-RPG adventure set within a world created by Hidetaka Miyazaki creator of the influential DARK SOULS video game series; andA New World Created By Hidetaka Miyazaki And George R. R. Martin. ELDEN RING, developed by FromSoftware, Inc. and BANDAI NAMCO Entertainment Inc., is a fantasy action-RPG adventure set within a world created by Hidetaka Miyazaki creator of the influential DARK SOULS video game series; and George R.R. Martin author of The New York Times best-selling fantasy series, A Song of Ice and Fire. Danger and discovery lurk around every corner in FromSoftware's largest game to-date.  Hidetaka Miyazaki, President and Game Director of FromSoftware Inc. Known for directing critically-acclaimed games in beloved franchises including Armored Core, Dark Souls, and Sekiro: Shadows Die Twice.  George R.R. Martin is the #1 New York Times bestselling author of many novels, including the acclaimed series A Song of Ice and Fire - A Game of Thrones, A Clash of Kings, A Storm of Swords, A Feast For Crows, and A Dance with Dragons. As a writer-producer, he has worked on The Twilight Zone, Beauty and the Beast, and various feature films and pilots that were never made.… Expand"
  },
  {
    "name": "Mass Effect 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-2",
    "publisher": "Electronic Arts",
    "release_date": "Jan 26 2010",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 96,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/2/7178937e2ea07ddd2ae3e46bdf746dc7-98.jpg",
    "descriptions": "The Mass Effect trilogy is a science fiction adventure set in a vast universe filled with dangerous alien life forms and mysterious uncharted planets. In this dark second chapter, Saren’s evil army of Geth soldiers has just been defeated, and humans, who are still struggling to make theirThe Mass Effect trilogy is a science fiction adventure set in a vast universe filled with dangerous alien life forms and mysterious uncharted planets. In this dark second chapter, Saren’s evil army of Geth soldiers has just been defeated, and humans, who are still struggling to make their mark on the galactic stage, are now faced with an even greater peril. [BioWare]… Expand"
  },
  {
    "name": "The House in Fata Morgana - Dreams of the Revenants Edition -",
    "details_link": "https://www.metacritic.com/game/switch/the-house-in-fata-morgana---dreams-of-the-revenants-edition--",
    "publisher": "Limited Run Games",
    "release_date": "Apr  9 2021",
    "developers": [
      "HuneX"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Visual Novel"
    ],
    "meta_score": 96,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/3/f4af18f409aae2c0ca6ba733e0eb50bf-98.jpg",
    "descriptions": "A gothic suspense tale set in a cursed mansion. ‘The House in Fata Morgana’ is a full-length visual novel spanning nearly a millennium that deals in tragedy, human nature, and insanity. This version includes three games and more:\r  1: The House in Fata Morgana: the main storyline.\r  2:A gothic suspense tale set in a cursed mansion. ‘The House in Fata Morgana’ is a full-length visual novel spanning nearly a millennium that deals in tragedy, human nature, and insanity. This version includes three games and more:\r  1: The House in Fata Morgana: the main storyline.\r  2: A Requiem for Innocence: a prequel shedding light on the origins of Fata Morgana’s terrible curse.\r  3: Reincarnation: a sequel featuring the central cast members reincarnated in the present day. *The part including voices\r  4: Other additional short stories.… Expand"
  },
  {
    "name": "The Legend of Zelda: Twilight Princess",
    "details_link": "https://www.metacritic.com/game/gamecube/the-legend-of-zelda-twilight-princess",
    "publisher": "Nintendo",
    "release_date": "Dec 11 2006",
    "developers": [
      "Nintendo"
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 96,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/2/2291fd278c02e177f572a8dda8a09f1f-98.jpg",
    "descriptions": "In the next chapter in the Legend of Zelda series, Link can transform into a wolf to scour the darkened land of Hyrule. With the help of Midna, a mysterious being, you must guide Link through hordes of foul creatures and challenging bosses using new moves and a new horseback combat system.In the next chapter in the Legend of Zelda series, Link can transform into a wolf to scour the darkened land of Hyrule. With the help of Midna, a mysterious being, you must guide Link through hordes of foul creatures and challenging bosses using new moves and a new horseback combat system.  Many puzzles stand between Link and the fulfillment of his quest, so you must sharpen your wits as you hunt for weapons and items.… Expand"
  },
  {
    "name": "Elden Ring",
    "details_link": "https://www.metacritic.com/game/playstation-5/elden-ring",
    "publisher": "Bandai Namco Games",
    "release_date": "Feb 25 2022",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 96,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/7/cf21bb68e9006d17f7b7bff4cdafe6f6-98.jpg",
    "descriptions": "A New World Created By Hidetaka Miyazaki And George R. R. Martin. ELDEN RING, developed by FromSoftware, Inc. and BANDAI NAMCO Entertainment Inc., is a fantasy action-RPG adventure set within a world created by Hidetaka Miyazaki creator of the influential DARK SOULS video game series; andA New World Created By Hidetaka Miyazaki And George R. R. Martin. ELDEN RING, developed by FromSoftware, Inc. and BANDAI NAMCO Entertainment Inc., is a fantasy action-RPG adventure set within a world created by Hidetaka Miyazaki creator of the influential DARK SOULS video game series; and George R.R. Martin author of The New York Times best-selling fantasy series, A Song of Ice and Fire. Danger and discovery lurk around every corner in FromSoftware's largest game to-date.  Hidetaka Miyazaki, President and Game Director of FromSoftware Inc. Known for directing critically-acclaimed games in beloved franchises including Armored Core, Dark Souls, and Sekiro: Shadows Die Twice.  George R.R. Martin is the #1 New York Times bestselling author of many novels, including the acclaimed series A Song of Ice and Fire - A Game of Thrones, A Clash of Kings, A Storm of Swords, A Feast For Crows, and A Dance with Dragons. As a writer-producer, he has worked on The Twilight Zone, Beauty and the Beast, and various feature films and pilots that were never made.… Expand"
  },
  {
    "name": "The Elder Scrolls V: Skyrim",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-elder-scrolls-v-skyrim",
    "publisher": "Bethesda Softworks",
    "release_date": "Nov 11 2011",
    "developers": [
      "Bethesda Game Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 96,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/5/3239d08e358b28f67cc70d0d41a9b2db-98.jpg",
    "descriptions": "The next chapter in the Elder Scrolls saga arrives from the Bethesda Game Studios. Skyrim reimagines the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose. Play any type of character you can imagine, and do whatever you want; theThe next chapter in the Elder Scrolls saga arrives from the Bethesda Game Studios. Skyrim reimagines the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose. Play any type of character you can imagine, and do whatever you want; the legendary freedom of choice, storytelling, and adventure of The Elder Scrolls is realized like never before. Skyrim's new game engine brings to life a complete virtual world with rolling clouds, rugged mountains, bustling cities, lush fields, and ancient dungeons. Choose from hundreds of weapons, spells, and abilities. The new character system allows you to play any way you want and define yourself through your actions. Battle ancient dragons like you've never seen. As Dragonborn, learn their secrets and harness their power for yourself.… Expand"
  },
  {
    "name": "Half-Life",
    "details_link": "https://www.metacritic.com/game/pc/half-life",
    "publisher": "Sierra Entertainment",
    "release_date": "Nov 19 1998",
    "developers": [
      "Valve Software"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 96,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/5/5764f80ddd3e67da3b29eb759e8a4737-98.jpg",
    "descriptions": "Half-Life combines great storytelling in the tradition of Stephen King with intense action and advanced technology to create a frighteningly realistic world where players need to think smart to survive. Half-Life has won more than 50 Game of the Year awards from publications around theHalf-Life combines great storytelling in the tradition of Stephen King with intense action and advanced technology to create a frighteningly realistic world where players need to think smart to survive. Half-Life has won more than 50 Game of the Year awards from publications around the world, and was named 'Best PC Game Ever' in PC Gamer's November 1999 issue. [Sierra]… Expand"
  },
  {
    "name": "Resident Evil 4",
    "details_link": "https://www.metacritic.com/game/playstation-2/resident-evil-4",
    "publisher": "Capcom",
    "release_date": "Oct 25 2005",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Horror"
    ],
    "meta_score": 96,
    "users_score": 9.3,
    "image": "https://static.metacritic.com/images/products/games/2/1b1a9d67d4ef046b5320670c890849cb-98.jpg",
    "descriptions": "In Resident Evil 4 players are reacquainted with Leon S. Kennedy, Raccoon City Police Department's idealistic rookie cop from \"Resident Evil 2.\" It has been six years since the destruction of Raccoon City and in that time, the U.S. government has been able to destroy the nefarious UmbrellaIn Resident Evil 4 players are reacquainted with Leon S. Kennedy, Raccoon City Police Department's idealistic rookie cop from \"Resident Evil 2.\" It has been six years since the destruction of Raccoon City and in that time, the U.S. government has been able to destroy the nefarious Umbrella Corporation. Fast forward to 2004 and players rejoin Leon, who is now a U.S. agent with a top-secret mission. He has been tasked to look into the abduction of the President's daughter and his investigation has led him to a mysterious location in Europe. As Leon encounters unimaginable horrors, he must find out who or what is behind everything. [Capcom]… Expand"
  },
  {
    "name": "The Legend of Zelda: The Wind Waker",
    "details_link": "https://www.metacritic.com/game/gamecube/the-legend-of-zelda-the-wind-waker",
    "publisher": "Nintendo",
    "release_date": "Mar 24 2003",
    "developers": [
      "Nintendo"
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 96,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/9/c4c9d1e723bdedc5a5a8795b3d289299-98.jpg",
    "descriptions": "In this ninth entry in the Legend of Zelda series, Link debuts on GameCube with a fun new cel-shaded look, but the game stays true to the respected heritage of the series. The classic mix of sword-swinging action, perplexing puzzles and stirring story lines remains intact, but the stunningIn this ninth entry in the Legend of Zelda series, Link debuts on GameCube with a fun new cel-shaded look, but the game stays true to the respected heritage of the series. The classic mix of sword-swinging action, perplexing puzzles and stirring story lines remains intact, but the stunning cel-shaded graphics give the people and places of Link's watery world a wildly artistic new look. And for the very first time, Link sails freely on the high seas. Join Link on his most epic and scenic adventure yet. Face unimaginable monsters, explore puzzling dungeons, and meet a cast of unforgettable characters as he searches for his kidnapped sister, Aryll. … Expand"
  },
  {
    "name": "Gran Turismo",
    "details_link": "https://www.metacritic.com/game/playstation/gran-turismo",
    "publisher": "SCEA",
    "release_date": "Apr 30 1998",
    "developers": [
      "Polyphony Digital"
    ],
    "platforms": "PlayStation",
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "GT / Street"
    ],
    "meta_score": 96,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/dea46d06f8c66a24ada212f4f9b0d710-98.jpg",
    "descriptions": "Welcome to the most advanced racing game ever created! Encounter exhilarating high-speed racing in 11 stunning environments. Feel handling agility and throttle response so convincing, the car seems to be an extension of yourself. Experience the extraordinary world of Gran Turismo!"
  },
  {
    "name": "BioShock",
    "details_link": "https://www.metacritic.com/game/pc/bioshock",
    "publisher": "2K Games",
    "release_date": "Aug 21 2007",
    "developers": [
      "Irrational Games",
      "2K Marin"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 96,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/4/6e40cbab3978d4fe0c1390f8b46f23cc-98.jpg",
    "descriptions": "Going beyond \"run and gun corridors,\" \"monster-closet AIs\" and static worlds, BioShock creates a living, unique and unpredictable FPS experience. After your plane crashes into icy uncharted waters, you discover a rusted bathysphere and descend into Rapture, a city hidden beneath the sea.Going beyond \"run and gun corridors,\" \"monster-closet AIs\" and static worlds, BioShock creates a living, unique and unpredictable FPS experience. After your plane crashes into icy uncharted waters, you discover a rusted bathysphere and descend into Rapture, a city hidden beneath the sea. Constructed as an idealistic society for a hand picked group of scientists, artists and industrialists, the idealism is no more. Now the city is littered with corpses, wildly powerful guardians roam the corridors as little girls loot the dead, and genetically mutated citizens ambush you at every turn. Take control of your world by hacking mechanical devices, commandeering security turrets and crafting unique items critical to your very survival. Upgrade your weapons with ionic gels, explosives and toxins to customize them to the enemy and environment. Genetically modify your body through dozens of Plasmid Stations scattered throughout the city, empowering you with fantastic and often grotesque abilities. Explore a living world powered by Ecological A.I., where the inhabitants have interesting and consequential relationships with one another that impact your gameplay experience. Experience truly next generation graphics that vividly illustrate the forlorn art deco city, highlighted by the most detailed and realistic water effects ever developed in a video game. Make meaningful choices and mature decisions, ultimately culminating in the grand question: do you exploit the innocent survivors of Rapture...or save them? [2K Games]… Expand"
  },
  {
    "name": "Metal Gear Solid 2: Sons of Liberty",
    "details_link": "https://www.metacritic.com/game/playstation-2/metal-gear-solid-2-sons-of-liberty",
    "publisher": "Konami",
    "release_date": "Nov 12 2001",
    "developers": [
      "KCEJ"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 96,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/9/20c772e77d9728b33faace026d13f835-98.jpg",
    "descriptions": "Since the incident on Shadow Moses Island, Metal Gear's top-secret technology has been leaked into the black market through the machinations of Revolver Ocelot. As a result, countless variations of Metal Gears have sprung up in every corner of the globe, making the weapon an increasinglySince the incident on Shadow Moses Island, Metal Gear's top-secret technology has been leaked into the black market through the machinations of Revolver Ocelot. As a result, countless variations of Metal Gears have sprung up in every corner of the globe, making the weapon an increasingly common component of the armed forces of nuclear powers. \rIn the midst of all of this, Solid Snake, now a member of the anti-Metal Gear group \"Philanthropy,\" has learned that a new prototype Metal Gear has been developed by the U.S. Marines and is being transported in secret to an unknown destination. To learn more about this new machine, Snake must infiltrate the transport, disguised as a tanker, as it makes its way down the Hudson River. Just as Snake is about to begin his mission, however, the ship is seized by a mysterious and well-armed group bent on stealing the new Metal Gear for their own, nefarious purposes. [Konami]… Expand"
  },
  {
    "name": "Grand Theft Auto Double Pack",
    "details_link": "https://www.metacritic.com/game/xbox/grand-theft-auto-double-pack",
    "publisher": "Rockstar Games",
    "release_date": "Oct 31 2003",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 96,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/4/5f9a719ed9b81c375c57aa8a8b5bbb5e-98.jpg",
    "descriptions": "From the dark and seedy streets of Liberty City's underworld to the glamorous hedonism of Vice City of the 1980s, the Grand Theft Auto double-pack takes you through the huge worlds of Grand Theft Auto III and it's sequel Vice City. The highly controversial Grand Theft Auto III gives you theFrom the dark and seedy streets of Liberty City's underworld to the glamorous hedonism of Vice City of the 1980s, the Grand Theft Auto double-pack takes you through the huge worlds of Grand Theft Auto III and it's sequel Vice City. The highly controversial Grand Theft Auto III gives you the freedom to go anywhere and jack anyone, putting the dark, intriguing and ruthless world of crime at your fingertips. Vice City is an entirely new game set in the '80s, preserving and adding to the free-roaming gameplay, cinematic graphics and immersive audio experience that made the Grand Theft Auto III so popular.… Expand"
  },
  {
    "name": "Baldur's Gate II: Shadows of Amn",
    "details_link": "https://www.metacritic.com/game/pc/baldurs-gate-ii-shadows-of-amn",
    "publisher": "Interplay",
    "release_date": "Sep 24 2000",
    "developers": [
      "BioWare"
    ],
    "platforms": "PC",
    "num_players": "Up to 6 ",
    "genres": [
      "Role-Playing",
      "PC-style RPG",
      "PC-style RPG",
      "Western-Style"
    ],
    "meta_score": 95,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/9/fee92d54ce517ca92f49122771fd4aa5-98.jpg",
    "descriptions": "An epic continuation of the story that began in \"Baldur's Gate,\" this RPG is set along the southern portion of the Sword Coast, a detailed and rich area of the Forgotten Realms called Amn. It features 300 spells and 130-plus monster types compared to only 130 spells and 60 monster types inAn epic continuation of the story that began in \"Baldur's Gate,\" this RPG is set along the southern portion of the Sword Coast, a detailed and rich area of the Forgotten Realms called Amn. It features 300 spells and 130-plus monster types compared to only 130 spells and 60 monster types in Baldur's Gate. [Interplay]… Expand"
  },
  {
    "name": "Grand Theft Auto: San Andreas",
    "details_link": "https://www.metacritic.com/game/playstation-2/grand-theft-auto-san-andreas",
    "publisher": "Rockstar Games",
    "release_date": "Oct 26 2004",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "PlayStation 2"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 95,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/6/1336a2d42299de601351bd802152440c-98.jpg",
    "descriptions": "[Metacritic's 2004 PS2 Game of the Year]  Five years ago Carl Johnson escaped from the pressures of life in Los Santos, San Andreas... a city tearing itself apart with gang trouble, drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers.[Metacritic's 2004 PS2 Game of the Year]  Five years ago Carl Johnson escaped from the pressures of life in Los Santos, San Andreas... a city tearing itself apart with gang trouble, drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers. Now, it's the early 90s. Carl's got to go home. His mother has been murdered, his family has fallen apart and his childhood friends are all heading towards disaster. On his return to the neighborhood, a couple of corrupt cops frame him for homicide. CJ is forced on a journey that takes him across the entire state of San Andreas, to save his family and to take control of the streets. [Rockstar]… Expand"
  },
  {
    "name": "Grand Theft Auto: Vice City",
    "details_link": "https://www.metacritic.com/game/playstation-2/grand-theft-auto-vice-city",
    "publisher": "Rockstar Games",
    "release_date": "Oct 27 2002",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 95,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/a051e01269f5e5ce7159b9d189618a7d-98.jpg",
    "descriptions": "[Metacritic's 2002 PS2 Game of the Year ] Welcome to Vice City. Welcome to the 1980s. Having just made it back onto the streets of Liberty City after a long stretch in maximum security, Tommy Vercetti is sent to Vice City by his old boss, Sonny Forelli. They were understandably nervous about[Metacritic's 2002 PS2 Game of the Year ] Welcome to Vice City. Welcome to the 1980s. Having just made it back onto the streets of Liberty City after a long stretch in maximum security, Tommy Vercetti is sent to Vice City by his old boss, Sonny Forelli. They were understandably nervous about his re-appearance in Liberty City, so a trip down south seemed like a good idea. But all does not go smoothly upon his arrival in the glamorous, hedonistic metropolis of Vice City. He's set up and is left with no money and no merchandise. Sonny wants his money back, but the biker gangs, Cuban gangsters, and corrupt politicians stand in his way. Most of Vice City seems to want Tommy dead. His only answer is to fight back and take over the city himself. Vice City offers vehicular pleasures to suit every taste. For the speed enthusiast, there's high-performance cars and motorbikes. For the sportsman, a powerboat or a golf buggy lets you enjoy the great outdoors. For those that need that sense of freedom and escape, why not charter a helicopter and see the beauty of Vice City from the air? [Rockstar]… Expand"
  },
  {
    "name": "LittleBigPlanet",
    "details_link": "https://www.metacritic.com/game/playstation-3/littlebigplanet",
    "publisher": "SCEA",
    "release_date": "Oct 27 2008",
    "developers": [
      "SCE/WWS",
      "Media Molecule"
    ],
    "platforms": "PlayStation 3",
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 95,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/9/7c8510a3ca7ac878e48304ad5fe52fbb-98.jpg",
    "descriptions": "In LittleBigPlanet Players meet on a blue and green planet scattered with individual plots – and use their character's amazing abilities to play, create and share what they build with other gamers throughout the world via the Playstation Network. The LittleBigPlanet experience starts withIn LittleBigPlanet Players meet on a blue and green planet scattered with individual plots – and use their character's amazing abilities to play, create and share what they build with other gamers throughout the world via the Playstation Network. The LittleBigPlanet experience starts with players learning about their character’s powers to interact physically with the environment. There are places to explore, creative resources to collect and puzzles to solve – all requiring a combination of brains and collaborative teamwork. As soon as players begin their creative skills will grow and they will soon be ready to start creating and modifying their surroundings – the first step to sharing them with the whole community.Characters have the power to move anything in this glued and stitched-together 3D landscape; they have the power to design, shape and build both objects and entire locations for others to view and play. There’s no complicated level editor; all of these skills can be learned by simply playing the game. Creativity is part of the gameplay experience and playing is part of the creative experience. Players can make their world as open or as secretive to explore as they like. When it’s ready, they can invite anyone within the LittleBigPlanet community to come and explore their patch – or can go and explore everybody else's. [SCEA]… Expand"
  },
  {
    "name": "The Legend of Zelda Collector's Edition",
    "details_link": "https://www.metacritic.com/game/gamecube/the-legend-of-zelda-collectors-edition",
    "publisher": "Nintendo",
    "release_date": "Nov 17 2003",
    "developers": [
      "Nintendo"
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 95,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/1/b752da9ceb16a38ced912d788267c929-98.jpg",
    "descriptions": "Receive Four Complete Classic Zelda games all on one disc when you buy the Zelda GameCube Bundle: The Legend of Zelda, Zelda II - The adventure of Link, The Legend of Zelda: Ocarina of Time, The Legend of Zelda: Majora's Mask. The disc also includes: Playable Demo of the Legend of Zelda: TheReceive Four Complete Classic Zelda games all on one disc when you buy the Zelda GameCube Bundle: The Legend of Zelda, Zelda II - The adventure of Link, The Legend of Zelda: Ocarina of Time, The Legend of Zelda: Majora's Mask. The disc also includes: Playable Demo of the Legend of Zelda: The Wind Waker, Zelda Retrospective Movie, The Legend of Zelda: The Wind Waker Movie Preview.… Expand"
  },
  {
    "name": "Red Dead Redemption",
    "details_link": "https://www.metacritic.com/game/playstation-3/red-dead-redemption",
    "publisher": "Rockstar Games",
    "release_date": "May 18 2010",
    "developers": [
      "Rockstar San Diego"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Historic",
      "Action Adventure",
      "Historic",
      "Historic",
      "Open-World"
    ],
    "meta_score": 95,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/2/a79df5c46863517adc95c787d668149e-98.jpg",
    "descriptions": "Developed by Rockstar San Diego, as a follow up to the 2004 hit game Red Dead Revolver, Red Dead Redemption is a Western epic, set at the turn of the 20th century when the lawless and chaotic badlands began to give way to the expanding reach of government and the spread of the IndustrialDeveloped by Rockstar San Diego, as a follow up to the 2004 hit game Red Dead Revolver, Red Dead Redemption is a Western epic, set at the turn of the 20th century when the lawless and chaotic badlands began to give way to the expanding reach of government and the spread of the Industrial Age.  The story of former outlaw, John Marston, Red Dead Redemption takes players on a great adventure across the American frontier. Utilizing Rockstar's proprietary Rockstar Advanced Game Engine (RAGE), Red Dead Redemption features an open-world environment for players to explore, including frontier towns, rolling prairies teeming with wildlife, and perilous mountain passes - each packed with an endless flow of varied distractions. Along the way, players experience the heat of gunfights and battles, meet a host of unique characters, struggle against the harshness of one of the world’s last remaining wildernesses, and ultimately pick their own precarious path through an epic story about the death of the Wild West and the gunslingers that inhabited it. [Rockstar Games]… Expand"
  },
  {
    "name": "Gran Turismo 3: A-Spec",
    "details_link": "https://www.metacritic.com/game/playstation-2/gran-turismo-3-a-spec",
    "publisher": "SCEA",
    "release_date": "Jul  9 2001",
    "developers": [
      "Polyphony Digital"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "GT / Street"
    ],
    "meta_score": 95,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/4/b88c306c53289d8c99b7d6a93d5ac4e1-98.jpg",
    "descriptions": "With the addition of two new courses (a downtown Tokyo circuit and the Monte Carlo Grand Prix course), an impressive range of cars (from Vipers to Cooper Minis), and a soundtrack featuring everything from Lenny Kravitz to Jimi Hendrix, this highly anticipated title is finally ready to be driven."
  },
  {
    "name": "Halo 2",
    "details_link": "https://www.metacritic.com/game/xbox/halo-2",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov  9 2004",
    "developers": [
      "Bungie Software"
    ],
    "platforms": [
      "PC",
      "Xbox"
    ],
    "num_players": "1-16 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 95,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/0bc9de91c1ea552966f25a5c10e8179f-98.jpg",
    "descriptions": "The Covenant alien race threatens to destroy all humankind, and the only thing standing in its way is Master Chief, a genetically enhanced supersoldier. Master Chief returns in Halo 2, which features new vehicles, weapons, environments, and more. This time, you can interact with yourThe Covenant alien race threatens to destroy all humankind, and the only thing standing in its way is Master Chief, a genetically enhanced supersoldier. Master Chief returns in Halo 2, which features new vehicles, weapons, environments, and more. This time, you can interact with your environment, wield two weapons at the same time, board opponents' vehicles, and even switch sides to play the role of a Covenant Elite. Halo 2 also supports broadband multiplayer action via Xbox Live. … Expand"
  },
  {
    "name": "Persona 5 Royal",
    "details_link": "https://www.metacritic.com/game/pc/persona-5-royal",
    "publisher": "Sega",
    "release_date": "Oct 21 2022",
    "developers": [
      "Atlus"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 95,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/2/c16caf7c23f604f602a45024889fb4a9-98.jpg",
    "descriptions": "Prepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt andPrepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona 5 Royal is packed with new characters, confidants, story depth, new locations to explore, and a new grappling hook mechanic for stealthy access to new areas. With a new semester at Shujin Academy, get ready to strengthen your abilities in the metaverse and in your daily life. Persona 5 Royal presents a unique visual style and award nominated composer Shoji Meguro returns with an all-new soundtrack. Explore Tokyo, unlock new Personas, customize your own personal Thieves Den, discover a never-before-seen story arc, cutscenes, alternate endings, and more! Even for the most seasoned Phantom Thieves among us, Persona 5 Royal is a new challenge to defy conventions, discover the power within, and fight for justice. Wear the mask. Reveal your truth.… Expand"
  },
  {
    "name": "The Legend of Zelda: A Link to the Past",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/the-legend-of-zelda-a-link-to-the-past",
    "publisher": "Nintendo",
    "release_date": "Dec  3 2002",
    "developers": [
      "Capcom"
    ],
    "platforms": "Game Boy Advance",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 95,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/8/e3de1753570b889cc3f3742191dd6af3-98.jpg",
    "descriptions": "Now you have a link to one of the greatest adventures in The Legend of Zelda series.  The Legend of Zelda: A Link to the Past revives the classic SNES game on the Game Boy Advance and adds a new multiplayer mode.  In a Link to the Past, Link travels between the light world and the darkNow you have a link to one of the greatest adventures in The Legend of Zelda series.  The Legend of Zelda: A Link to the Past revives the classic SNES game on the Game Boy Advance and adds a new multiplayer mode.  In a Link to the Past, Link travels between the light world and the dark world, conquering fierce monsters and uncovering Hyrule's deepest secrets along the way.  Also included is Four Swords, which lets you play with up to three other players, slashing through dungeons and collecting rupees.  Whether you choose solo or competitive play, The Legend of Zelda will keep you occupied with its brain-bending puzzles and fun swashbuckling action.… Expand"
  },
  {
    "name": "The Legend of Zelda: Majora's Mask",
    "details_link": "https://www.metacritic.com/game/nintendo-64/the-legend-of-zelda-majoras-mask",
    "publisher": "Nintendo",
    "release_date": "Oct 25 2000",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Nintendo 64",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 95,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/1/d3ab93207df2def4a5d7f60a3a16a35c-98.jpg",
    "descriptions": "Thrown into a parallel world by the mischievous actions of a possessed Skull Kid, Link finds a land in grave danger. The dark power of a relic called Majora's Mask has wreaked havoc on the citizens of Termina, but their most urgent problem is a suicidal moon crashing toward the world. LinkThrown into a parallel world by the mischievous actions of a possessed Skull Kid, Link finds a land in grave danger. The dark power of a relic called Majora's Mask has wreaked havoc on the citizens of Termina, but their most urgent problem is a suicidal moon crashing toward the world. Link has only 72 hours to find a way to stop its descent.… Expand"
  },
  {
    "name": "The Last of Us",
    "details_link": "https://www.metacritic.com/game/playstation-3/the-last-of-us",
    "publisher": "SCEA",
    "release_date": "Jun 14 2013",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": "PlayStation 3",
    "num_players": "Up to 8 ",
    "genres": [
      "Modern",
      "Adventure",
      "General",
      "Action Adventure",
      "General",
      "Modern",
      "Linear"
    ],
    "meta_score": 95,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/9/18523f08edc05b0a344edf5f6e6f49d3-98.jpg",
    "descriptions": "Twenty years after a pandemic radically transformed known civilization, infected humans run amuck and survivors kill one another for sustenance and weapons - literally whatever they can get their hands on. Joel, a salty survivor, is hired to smuggle a fourteen-year-old girl, Ellie, out of aTwenty years after a pandemic radically transformed known civilization, infected humans run amuck and survivors kill one another for sustenance and weapons - literally whatever they can get their hands on. Joel, a salty survivor, is hired to smuggle a fourteen-year-old girl, Ellie, out of a rough military quarantine, but what begins as a simple job quickly turns into a brutal journey across the country.… Expand"
  },
  {
    "name": "The Legend of Zelda: Twilight Princess",
    "details_link": "https://www.metacritic.com/game/wii/the-legend-of-zelda-twilight-princess",
    "publisher": "Nintendo",
    "release_date": "Nov 19 2006",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Wii",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy",
      "Open-World"
    ],
    "meta_score": 95,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/9/0c945776f87b847d4d322c1e02e5fa95-98.jpg",
    "descriptions": "When an evil darkness enshrouds the land of Hyrule, a young farm boy named Link must awaken the hero - and the animal - within. When Link travels to the Twilight Realm, he transforms into a wolf and must scour the land with the help of a mysterious girl named Midna. Using the power andWhen an evil darkness enshrouds the land of Hyrule, a young farm boy named Link must awaken the hero - and the animal - within. When Link travels to the Twilight Realm, he transforms into a wolf and must scour the land with the help of a mysterious girl named Midna. Using the power and unique control of the Wii console, The Legend of Zelda: Twilight Princess features precise aiming control using the Wii Remote. The Wii Remote and the Nunchuk controller are used for a variety of game activities, including fishing and special sword attacks. Players ride into battle against troops of foul creatures using an amazing horseback combat system, then take on massive bosses that must be seen to be believed. [Nintendo]… Expand"
  },
  {
    "name": "Madden NFL 2003",
    "details_link": "https://www.metacritic.com/game/playstation-2/madden-nfl-2003",
    "publisher": "EA Sports",
    "release_date": "Aug 12 2002",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 95,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/4/8db3e5281c1278fa0a62e7feefff0aa6-98.jpg",
    "descriptions": "Take Your Game Online: Access an online community where you can meet, chat, and play head-to-head against other gamers. Audio Dream Team: Dynamic play-by-play and analysis by Madden and Michaels. All-New Mini-camp: Hop on John Madden's Cruiser Tour Bus and travel to all NFL cities toTake Your Game Online: Access an online community where you can meet, chat, and play head-to-head against other gamers. Audio Dream Team: Dynamic play-by-play and analysis by Madden and Michaels. All-New Mini-camp: Hop on John Madden's Cruiser Tour Bus and travel to all NFL cities to complete skilled tasks. Create-A-Playbook: Customize receiver routes, player formations, and your team's entire playbook. Deepest Franchise Mode Ever: Play 30 years of Franchise mode and draft players each season with tips from your scouts. [EA Sports]… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 2",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/tony-hawks-pro-skater-2",
    "publisher": "Activision",
    "release_date": "May 30 2001",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Game Boy Advance"
    ],
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 95,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/8/46d1467ea09a779ef6500471e7a11c38-98.jpg",
    "descriptions": "Hawks back, in the worlds first 3D handheld skating game, and hes brought new pros (Caballero, Koston, Mullen), New tricks (Bluntsides, BS/FS Nose-and Tailsides, Heelflip Varials, Airwalks, and more), and new terrain (Insane street and vert levels) Tony Hawks Pro Skater 2 for Game BoyHawks back, in the worlds first 3D handheld skating game, and hes brought new pros (Caballero, Koston, Mullen), New tricks (Bluntsides, BS/FS Nose-and Tailsides, Heelflip Varials, Airwalks, and more), and new terrain (Insane street and vert levels) Tony Hawks Pro Skater 2 for Game Boy Advance. Get your hands on a legend.… Expand"
  },
  {
    "name": "Persona 5 Royal",
    "details_link": "https://www.metacritic.com/game/playstation-4/persona-5-royal",
    "publisher": "Atlus",
    "release_date": "Mar 31 2020",
    "developers": [
      "Atlus"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 95,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/2/1d340c792338fa16de96bd8b60d3cab5-98.jpg",
    "descriptions": "Prepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt andPrepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona 5 Royal is packed with new characters, confidants, story depth, new locations to explore, and a new grappling hook mechanic for stealthy access to new areas. With a new semester at Shujin Academy, get ready to strengthen your abilities in the metaverse and in your daily life. Persona 5 Royal presents a unique visual style and award nominated composer Shoji Meguro returns with an all-new soundtrack. Explore Tokyo, unlock new Personas, customize your own personal Thieves Den, discover a never-before-seen story arc, cutscenes, alternate endings, and more! Even for the most seasoned Phantom Thieves among us, Persona 5 Royal is a new challenge to defy conventions, discover the power within, and fight for justice. Wear the mask. Reveal your truth.… Expand"
  },
  {
    "name": "The Last of Us Remastered",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-last-of-us-remastered",
    "publisher": "SCEA",
    "release_date": "Jul 29 2014",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": "PlayStation 4",
    "num_players": "Up to 8 ",
    "genres": [
      "Action Adventure",
      "General",
      "Modern",
      "Linear"
    ],
    "meta_score": 95,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/6/dcb5d2f7d2f23d0d4aa8fd809af6b12e-98.jpg",
    "descriptions": "The Last of Us has been rebuilt for the PlayStation4 system. Now featuring full 1080p, higher resolution character models, improved shadows and lighting, in addition to several other gameplay improvements. 20 years after a pandemic has radically changed known civilization, infected humansThe Last of Us has been rebuilt for the PlayStation4 system. Now featuring full 1080p, higher resolution character models, improved shadows and lighting, in addition to several other gameplay improvements. 20 years after a pandemic has radically changed known civilization, infected humans run wild and survivors are killing each other for food, weapons; whatever they can get their hands on. Joel, a violent survivor, is hired to smuggle a 14 year-old girl, Ellie, out of an oppressive military quarantine zone, but what starts as a small job soon transforms into a brutal journey across the U.S. The Last of Us Remastered includes the Abandoned Territories Map Pack, Reclaimed Territories Map Pack, and the critically acclaimed The Last of Us: Left Behind Single Player campaign that combines themes of survival, loyalty, and love with tense, survival-action gameplay.\r Remastered Features:\r-Explore a brutal post-pandemic world, fully realized with the power of PlayStation4 system\r-Includes additional game content: over $30 in value\r-Delve into Ellies past in Left Behind, the single-player prequel chapter\r-Eight new multiplayer maps in the Abandoned and Reclaimed Territories packs\r-In-game cinematic commentary from the cast and creative director… Expand"
  },
  {
    "name": "Portal 2",
    "details_link": "https://www.metacritic.com/game/pc/portal-2",
    "publisher": "Valve Software",
    "release_date": "Apr 18 2011",
    "developers": [
      "Valve Software"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 95,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/8/8ebc9aa5758d569f33e543d9fb629545-98.jpg",
    "descriptions": "Valve is working on a full-length sequel to its award-winning, mind-bending puzzle action game for the Xbox 360 and PC."
  },
  {
    "name": "Red Dead Redemption",
    "details_link": "https://www.metacritic.com/game/xbox-360/red-dead-redemption",
    "publisher": "Rockstar Games",
    "release_date": "May 18 2010",
    "developers": [
      "Rockstar San Diego"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Action",
      "Action Adventure",
      "Shooter",
      "Historic",
      "Historic",
      "Open-World",
      "Third-Person",
      "Historic"
    ],
    "meta_score": 95,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/1/1aba85e322bb75caf4fcc3f15528963e-98.jpg",
    "descriptions": "Developed by Rockstar San Diego, as a follow up to the 2004 hit game Red Dead Revolver, Red Dead Redemption is a Western epic, set at the turn of the 20th century when the lawless and chaotic badlands began to give way to the expanding reach of government and the spread of the IndustrialDeveloped by Rockstar San Diego, as a follow up to the 2004 hit game Red Dead Revolver, Red Dead Redemption is a Western epic, set at the turn of the 20th century when the lawless and chaotic badlands began to give way to the expanding reach of government and the spread of the Industrial Age.  The story of former outlaw, John Marston, Red Dead Redemption takes players on a great adventure across the American frontier. Utilizing Rockstar's proprietary Rockstar Advanced Game Engine (RAGE), Red Dead Redemption features an open-world environment for players to explore, including frontier towns, rolling prairies teeming with wildlife, and perilous mountain passes - each packed with an endless flow of varied distractions. Along the way, players experience the heat of gunfights and battles, meet a host of unique characters, struggle against the harshness of one of the world’s last remaining wildernesses, and ultimately pick their own precarious path through an epic story about the death of the Wild West and the gunslingers that inhabited it. [Rockstar Games]… Expand"
  },
  {
    "name": "Portal 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/portal-2",
    "publisher": "Valve Software",
    "release_date": "Apr 19 2011",
    "developers": [
      "Valve Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 95,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/9/79841223c9df97d146152dab6ad135ec-98.jpg",
    "descriptions": "Valve is working on a full-length sequel to its award-winning, mind-bending puzzle action game for the Xbox 360 and PC."
  },
  {
    "name": "Metal Gear Solid V: The Phantom Pain",
    "details_link": "https://www.metacritic.com/game/xbox-one/metal-gear-solid-v-the-phantom-pain",
    "publisher": "Konami",
    "release_date": "Sep  1 2015",
    "developers": [
      "Kojima Productions",
      "Moby Dick Studio"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Modern",
      "Modern",
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 95,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/6/b6604eade078dd9167f2ed683a00fb62-98.jpg",
    "descriptions": "Following the prologue METAL GEAR SOLID V: GROUND ZEROES, METAL GEAR SOLID V: THE PHANTOM PAIN concludes the METAL GEAR SOLID V experience by following the story of the protagonist of the series, Big Boss (a.k.a. Snake). The METAL GEAR SOLID V experience is Creator and Director HideoFollowing the prologue METAL GEAR SOLID V: GROUND ZEROES, METAL GEAR SOLID V: THE PHANTOM PAIN concludes the METAL GEAR SOLID V experience by following the story of the protagonist of the series, Big Boss (a.k.a. Snake). The METAL GEAR SOLID V experience is Creator and Director Hideo Kojima's first time incorporating open world gameplay to the groundbreaking METAL GEAR franchise.… Expand"
  },
  {
    "name": "Portal 2",
    "details_link": "https://www.metacritic.com/game/playstation-3/portal-2",
    "publisher": "Valve Software",
    "release_date": "Apr 19 2011",
    "developers": [
      "Valve Software"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 95,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/0/882c6aa262652fa072560624e0d9d96b-98.jpg",
    "descriptions": "Portal 2 is the sequel to the title named \"Game of the Year\" 2007 by over 30 publications around the world. Portal 2 promises to break new ground in next generation gaming by expanding the award-winning recipe of innovative gameplay, immersive story, and creative inclusion of musicPortal 2 is the sequel to the title named \"Game of the Year\" 2007 by over 30 publications around the world. Portal 2 promises to break new ground in next generation gaming by expanding the award-winning recipe of innovative gameplay, immersive story, and creative inclusion of music while also introducing multiplayer co-op game modes. … Expand"
  },
  {
    "name": "Tetris Effect: Connected",
    "details_link": "https://www.metacritic.com/game/switch/tetris-effect-connected",
    "publisher": "Enhance Games",
    "release_date": "Oct  8 2021",
    "developers": [
      "Monstars Inc.",
      "Resonair"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Puzzle",
      "Stacking"
    ],
    "meta_score": 94,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/0/c43ea9b06c8a4e6fda2c4a3260c2022f-98.jpg",
    "descriptions": "Tetris Effect: Connected is the original Tetris Effect with all-new co-op and competitive online and local multiplayer modes. This is Tetris like you've never seen it, or heard it, or felt it beforean incredibly addictive, unique and breathtakingly gorgeous reinvention of one of the mostTetris Effect: Connected is the original Tetris Effect with all-new co-op and competitive online and local multiplayer modes. This is Tetris like you've never seen it, or heard it, or felt it beforean incredibly addictive, unique and breathtakingly gorgeous reinvention of one of the most popular puzzle games of all time.… Expand"
  },
  {
    "name": "World of Goo",
    "details_link": "https://www.metacritic.com/game/wii/world-of-goo",
    "publisher": "2D Boy",
    "release_date": "Oct 13 2008",
    "developers": [
      "2D Boy"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Wii"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "General",
      "Puzzle",
      "General"
    ],
    "meta_score": 94,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/9/6ce015a2c6528ab4e62d0704297db70e-98.jpg",
    "descriptions": "[WiiWare]  World of Goo is a physics based puzzle / construction game. The millions of Goo Balls that live in the beautiful World of Goo don't know that they are in a game, or that they are extremely delicious. [2D Boy]"
  },
  {
    "name": "The Elder Scrolls V: Skyrim",
    "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-v-skyrim",
    "publisher": "Bethesda Softworks",
    "release_date": "Nov 10 2011",
    "developers": [
      "Bethesda Game Studios"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 94,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/7/5988ee04196a686e107b46174f94a3ae-98.jpg",
    "descriptions": "The next chapter in the Elder Scrolls saga arrives from the Bethesda Game Studios. Skyrim reimagines the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose. Play any type of character you can imagine, and do whatever you want; theThe next chapter in the Elder Scrolls saga arrives from the Bethesda Game Studios. Skyrim reimagines the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose. Play any type of character you can imagine, and do whatever you want; the legendary freedom of choice, storytelling, and adventure of The Elder Scrolls is realized like never before. Skyrim's new game engine brings to life a complete virtual world with rolling clouds, rugged mountains, bustling cities, lush fields, and ancient dungeons. Choose from hundreds of weapons, spells, and abilities. The new character system allows you to play any way you want and define yourself through your actions. Battle ancient dragons like you've never seen. As Dragonborn, learn their secrets and harness their power for yourself.… Expand"
  },
  {
    "name": "BioShock Infinite",
    "details_link": "https://www.metacritic.com/game/playstation-3/bioshock-infinite",
    "publisher": "2K Games",
    "release_date": "Mar 26 2013",
    "developers": [
      "Irrational Games"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/6/841b8d4d89581b2e289906f5e7536213-98.jpg",
    "descriptions": "Once conceived as a floating symbol of American ideals at a time when the United States was emerging as a world power, Columbia has been dispatched to distant shores with great fanfare by a captivated public.  What begins as a brand new endeavor of hope turns drastically wrong as the cityOnce conceived as a floating symbol of American ideals at a time when the United States was emerging as a world power, Columbia has been dispatched to distant shores with great fanfare by a captivated public.  What begins as a brand new endeavor of hope turns drastically wrong as the city soon disappears into the clouds to whereabouts unknown. The player assumes the role of former Pinkerton agent Booker DeWitt, sent to the lost city to rescue Elizabeth, a young woman imprisoned there since childhood. He develops a relationship with Elizabeth, augmenting his abilities with hers so the pair may escape from a city that is literally falling from the sky. DeWitt must learn to fight foes in high-speed Sky-Line battles, engage in combat both indoors and amongst the clouds, and engage the power of dozens of new weapons and abilities.\r… Expand"
  },
  {
    "name": "Final Fantasy IX",
    "details_link": "https://www.metacritic.com/game/playstation/final-fantasy-ix",
    "publisher": "Square EA",
    "release_date": "Nov 13 2000",
    "developers": [
      "SquareSoft"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 94,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/8/2dc9a8dc7361425ed3cb3868d2a552c3-98.jpg",
    "descriptions": "The last Final Fantasy for the PlayStation, Final Fantasy IX returns to the pure fantasy roots that spawned the series.  This latest installment features highly detailed characters, vehicles, and environments, and breathtaking cinema-graphics.  The addition of brand new features such as theThe last Final Fantasy for the PlayStation, Final Fantasy IX returns to the pure fantasy roots that spawned the series.  This latest installment features highly detailed characters, vehicles, and environments, and breathtaking cinema-graphics.  The addition of brand new features such as the story-enhancing Active Time Event system and the return of minigames that grant additional gameplay make Final Fantasy IX not only a memorable gaming experience, but also a significant step forward in the series.… Expand"
  },
  {
    "name": "Call of Duty: Modern Warfare 2",
    "details_link": "https://www.metacritic.com/game/playstation-3/call-of-duty-modern-warfare-2",
    "publisher": "Activision",
    "release_date": "Nov 10 2009",
    "developers": [
      "Infinity Ward"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 18 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/9/7b8e5f3e8d0991c5314cdc4d37b8b041-98.jpg",
    "descriptions": "Modern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse. An entirely new gameplay mode which supports 2-player co-operative play online that is unique from the single player storyModern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse. An entirely new gameplay mode which supports 2-player co-operative play online that is unique from the single player story campaign. Special Ops pits players into a gauntlet of time-trial and objective-based missions. Rank-up as players unlock new Special Ops missions, each more difficult. Missions include highlights from the single player campaign, fan favorites from Call of Duty 4: Modern Warfare and all new, exclusive missions. Setting a new bar for online multiplayer, Modern Warfare 2 multiplayer delivers new capabilities, customization, gamestates and modes, including: Create-a-Class Evolved. Secondary Weapons - Machine Pistols, Shotguns, Handguns, Launchers. Riot Shields. Equipment - Throwing Knives, Blast Shield, Tactical Insertion. Perk Upgrades. Bling (Dual Attachments). Customizable Killstreaks - AC130, Sentry Gun, Predator Missile, Counter-UAV, Care Package. Accolades (Post match reports). [Activision]… Expand"
  },
  {
    "name": "God of War",
    "details_link": "https://www.metacritic.com/game/playstation-4/god-of-war",
    "publisher": "Sony Interactive Entertainment",
    "release_date": "Apr 20 2018",
    "developers": [
      "SCE Santa Monica"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 94,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/8/452903806353a11fbecc0089ac94ef13-98.jpg",
    "descriptions": "His vengeance against the gods of Olympus far behind him, Kratos now lives as a man in the lands of Norse Gods and monsters. It is in this harsh, unforgiving world that he must fight to survive… and teach his son to do the same. As mentor and protector to a son determined to earn hisHis vengeance against the gods of Olympus far behind him, Kratos now lives as a man in the lands of Norse Gods and monsters. It is in this harsh, unforgiving world that he must fight to survive… and teach his son to do the same. As mentor and protector to a son determined to earn his respect, Kratos is faced with an unexpected opportunity to master the rage that has long defined him. Questioning the dark lineage he’s passed on to his son, he hopes to make amends for the shortcomings of his past. Set within the untamed forests, mountains, and realms of Norse lore, God of War features a distinctly new setting with its own pantheon of creatures, monsters, and gods. [Playstation.com]… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 4",
    "details_link": "https://www.metacritic.com/game/playstation-2/tony-hawks-pro-skater-4",
    "publisher": "Activision",
    "release_date": "Oct 23 2002",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 94,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/2/0af941658097bb22888c8385b3b27ca0-98.jpg",
    "descriptions": "Build your skills, earn respect, and show that you've got what it takes to Go Pro.  190 progressively harder goals. No time clock, no constraints. Pro-specific challenges. Evolving levels. Interact with other skaters. Multi-player modes. Customize your game...Your career is what you make ofBuild your skills, earn respect, and show that you've got what it takes to Go Pro.  190 progressively harder goals. No time clock, no constraints. Pro-specific challenges. Evolving levels. Interact with other skaters. Multi-player modes. Customize your game...Your career is what you make of it. [Activision]… Expand"
  },
  {
    "name": "Devil May Cry",
    "details_link": "https://www.metacritic.com/game/playstation-2/devil-may-cry",
    "publisher": "Capcom",
    "release_date": "Oct 16 2001",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "Switch",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 94,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/4/e80ce3e272d0176ba2c7686f9de5b5b1-98.jpg",
    "descriptions": "In a large American metropolis, a man named Dante, a private investigator of the supernatural, is seeking revenge for the death of his mother and brother. The world is waiting, for Dante is no ordinary man, and with his father's sword in hand, he must enter the demon realm and avengeIn a large American metropolis, a man named Dante, a private investigator of the supernatural, is seeking revenge for the death of his mother and brother. The world is waiting, for Dante is no ordinary man, and with his father's sword in hand, he must enter the demon realm and avenge mankind.  [Capcom]… Expand"
  },
  {
    "name": "Call of Duty 4: Modern Warfare",
    "details_link": "https://www.metacritic.com/game/playstation-3/call-of-duty-4-modern-warfare",
    "publisher": "Activision",
    "release_date": "Nov  5 2007",
    "developers": [
      "Infinity Ward"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 18 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/4e5f0e4a6bb9bf71c5e2f1d8e398e219-98.jpg",
    "descriptions": "[Metacritic's 2007 PS3 Game of the Year]  As Call of Duty 4: Modern Warfare's single player campaign unfolds, the player is introduced to new gameplay at every turn – one moment you are fast-roping from your Black Hawk helicopter after storming into the war zone with an armada of choppers,[Metacritic's 2007 PS3 Game of the Year]  As Call of Duty 4: Modern Warfare's single player campaign unfolds, the player is introduced to new gameplay at every turn – one moment you are fast-roping from your Black Hawk helicopter after storming into the war zone with an armada of choppers, the next you are a sniper, under concealment, in a Ghillie suit miles behind enemy lines, the next you are engaging hostiles from an AC-130 gunship thousands of feet above the battlefield. Mixed with explosive action, Call of Duty 4: Modern Warfare also delivers special effects, including use of depth of field, rim-lighting, character self-shadowing, real time post-processing, texture streaming as well as physics-enabled effects. Infinity Ward deployed a dedicated team from the start to deliver a new level of depth to multiplayer. Building on the hit \"Call of Duty 2\" online experience, Call of Duty 4: Modern Warfare's new multiplayer provides the community an addictive and accessible experience to gamers of all levels. [Activision]… Expand"
  },
  {
    "name": "Madden NFL 2002",
    "details_link": "https://www.metacritic.com/game/playstation-2/madden-nfl-2002",
    "publisher": "EA Sports",
    "release_date": "Aug 19 2001",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 94,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/5/bade80b25fd38bb88392c0b49ac8f678-98.jpg",
    "descriptions": "The industry football standard returns featuring the Houston Texans, new player face and body technology, the ability to create your own team with custom helmets, uniforms, and stadiums, and a new training mode that let's you learn from Madden, the master himself."
  },
  {
    "name": "Batman: Arkham City",
    "details_link": "https://www.metacritic.com/game/xbox-360/batman-arkham-city",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Oct 18 2011",
    "developers": [
      "Rocksteady Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Fantasy",
      "Open-World"
    ],
    "meta_score": 94,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/1/b707e552149fd03b161be6ec73b94935-98.jpg",
    "descriptions": "Developed by Rocksteady Studios, Batman: Arkham City builds upon the intense, atmospheric foundation of Batman: Arkham Asylum, sending players soaring into Arkham City, the new maximum security \"home\" for all of Gotham City's thugs, gangsters and insane criminal masterminds. Set inside theDeveloped by Rocksteady Studios, Batman: Arkham City builds upon the intense, atmospheric foundation of Batman: Arkham Asylum, sending players soaring into Arkham City, the new maximum security \"home\" for all of Gotham City's thugs, gangsters and insane criminal masterminds. Set inside the heavily fortified walls of a sprawling district in the heart of Gotham City, this highly anticipated sequel introduces a brand-new story that draws together a new all-star cast of classic characters and murderous villains from the Batman universe, as well as a vast range of new and enhanced gameplay features to deliver the ultimate experience as the Dark Knight. … Expand"
  },
  {
    "name": "Metroid Prime Remastered",
    "details_link": "https://www.metacritic.com/game/switch/metroid-prime-remastered",
    "publisher": "Nintendo",
    "release_date": "Feb  8 2023",
    "developers": [
      "Nintendo",
      "Retro Studios",
      "Iron Galaxy Studios"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/95d20ca71b70da978acda0a572ea82a1-98.jpg",
    "descriptions": "Intergalactic bounty hunter Samus Aran receives a distress signal from a wrecked frigate in orbit around planet Tallon IV. Upon investigation, the frigate reveals itself to be a Space Pirate research vessel home to terrifying genetic experiments using the mysterious Phazon substance. There,Intergalactic bounty hunter Samus Aran receives a distress signal from a wrecked frigate in orbit around planet Tallon IV. Upon investigation, the frigate reveals itself to be a Space Pirate research vessel home to terrifying genetic experiments using the mysterious Phazon substance. There, Samus encounters her nemesis, Meta Ridley, whom she pursues to the surface of Tallon IV. It's up to her alone to explore the planet's interconnected regions, investigate its dark secrets, and end the intergalactic threat posed by Phazon.\r Experience this critically acclaimed first-person adventure like never before with remastered visuals, audio, controls, and more.… Expand"
  },
  {
    "name": "Persona 5 Royal",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/persona-5-royal",
    "publisher": "Sega",
    "release_date": "Oct 21 2022",
    "developers": [
      "Atlus"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 94,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/c9c8d46573b2620e2188c0efcfe8673a-98.jpg",
    "descriptions": "Prepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt andPrepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona 5 Royal is packed with new characters, confidants, story depth, new locations to explore, and a new grappling hook mechanic for stealthy access to new areas. With a new semester at Shujin Academy, get ready to strengthen your abilities in the metaverse and in your daily life. Persona 5 Royal presents a unique visual style and award nominated composer Shoji Meguro returns with an all-new soundtrack. Explore Tokyo, unlock new Personas, customize your own personal Thieves Den, discover a never-before-seen story arc, cutscenes, alternate endings, and more! Even for the most seasoned Phantom Thieves among us, Persona 5 Royal is a new challenge to defy conventions, discover the power within, and fight for justice. Wear the mask. Reveal your truth.… Expand"
  },
  {
    "name": "Mass Effect 2",
    "details_link": "https://www.metacritic.com/game/pc/mass-effect-2",
    "publisher": "Electronic Arts",
    "release_date": "Jan 26 2010",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 94,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/1/e2a90286a8a5a8d39aede79430f56575-98.jpg",
    "descriptions": "The Mass Effect trilogy is a science fiction adventure set in a vast universe filled with dangerous alien life forms and mysterious uncharted planets. In this dark second chapter, Saren’s evil army of Geth soldiers has just been defeated, and humans, who are still struggling to make theirThe Mass Effect trilogy is a science fiction adventure set in a vast universe filled with dangerous alien life forms and mysterious uncharted planets. In this dark second chapter, Saren’s evil army of Geth soldiers has just been defeated, and humans, who are still struggling to make their mark on the galactic stage, are now faced with an even greater peril. [BioWare]… Expand"
  },
  {
    "name": "The Legend of Zelda: Ocarina of Time 3D",
    "details_link": "https://www.metacritic.com/game/3ds/the-legend-of-zelda-ocarina-of-time-3d",
    "publisher": "Nintendo",
    "release_date": "Jun 19 2011",
    "developers": [
      "GREZZO"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Fantasy",
      "Fantasy",
      "Compilation",
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 94,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/0/4b6d1d1a1f09f9feb540f1337278a155-98.jpg",
    "descriptions": "The Legend of Zelda: Ocarina of Time 3D takes the best-reviewed game of all time for a brand-new experience. Now in 3D all of the graphic textures and colors have been vastly improved, taking advantage of the considerable graphic power of the Nintendo 3DS system. This game tells the epicThe Legend of Zelda: Ocarina of Time 3D takes the best-reviewed game of all time for a brand-new experience. Now in 3D all of the graphic textures and colors have been vastly improved, taking advantage of the considerable graphic power of the Nintendo 3DS system. This game tells the epic story of Hyrule and Link™, Zelda™, and Ganondorf in remarkable depth and gives context to the many tales of their struggles. As such, this title represents a perfect entry point for players new to the Zelda franchise. Phenomenally Improved Graphics Beyond even the incredible 3D effect, every graphic texture and character model has been lovingly built from the ground up to create the most dynamic and vivid vision of Zelda’s kingdom yet. This is Hyrule as you’ve always imagined it. Playing the Ocarina Link needs to play the eponymous Ocarina of Time many, many times over the course of the game. This involves a specific series of button presses to play one of the twelve songs in the game. In the original title, you would need to assign the ocarina to an item slot, then likely review the button prompts to your song, then play them from memory. The Nintendo 3DS version has the ocarina constantly available on the Touch Screen, and playing with the button prompts for each song right in front of you. Enhanced Game play While the greatest care has been taken to preserve the classic game play and story, a number of new features make this the definitive version of this extraordinary game.… Expand"
  },
  {
    "name": "Chrono Cross",
    "details_link": "https://www.metacritic.com/game/playstation/chrono-cross",
    "publisher": "Square EA",
    "release_date": "Aug 15 2000",
    "developers": [
      "SquareSoft"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 94,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/1/4d458337d5127394cea7b9f8b444d8f2-98.jpg",
    "descriptions": "Featuring a storyline developed by the creator of Chrono Trigger and Xenogears, Chrono Cross has been christened the \"Best RPG Creation\" by its development team. With multiple scenarios cast along a single story thread, and many different endings, each replay can result in anFeaturing a storyline developed by the creator of Chrono Trigger and Xenogears, Chrono Cross has been christened the \"Best RPG Creation\" by its development team. With multiple scenarios cast along a single story thread, and many different endings, each replay can result in an entirely new adventure. In addition, a brand new battle system makes combat smooth and innovative by introducing an element field system and combo system that gives the player unparalleled flexibility in their fighting options. The elimination of random battles also quickens the pace of the game, and places the choice of where to battle in the player's hands. With character designs by a famed Japanese illustrator and music by the original Chrono Trigger composer, Chrono Cross features visuals and sounds that bring its magic to life.… Expand"
  },
  {
    "name": "Celeste",
    "details_link": "https://www.metacritic.com/game/xbox-one/celeste",
    "publisher": "Matt Makes Games Inc.",
    "release_date": "Jan 26 2018",
    "developers": [
      "Matt Makes Games Inc."
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Stadia",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 94,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/7/c2d4b3e49ee25930e854dcd662411520-98.jpg",
    "descriptions": "Help Madeline survive her journey to the top of Celeste Mountain in this super-tight, hand-crafted platformer from the creators of TowerFall."
  },
  {
    "name": "BioShock",
    "details_link": "https://www.metacritic.com/game/playstation-3/bioshock",
    "publisher": "2K Games",
    "release_date": "Oct 21 2008",
    "developers": [
      "Digital Extremes",
      "2K Marin"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/9/b0e29872db264f3793559037aed1527b-98.jpg",
    "descriptions": "Going beyond \"run and gun corridors,\" \"monster-closet AIs\" and static worlds, BioShock creates a living, unique and unpredictable FPS experience. After your plane crashes into icy uncharted waters, you discover a rusted bathysphere and descend into Rapture, a city hidden beneath the sea.Going beyond \"run and gun corridors,\" \"monster-closet AIs\" and static worlds, BioShock creates a living, unique and unpredictable FPS experience. After your plane crashes into icy uncharted waters, you discover a rusted bathysphere and descend into Rapture, a city hidden beneath the sea. Constructed as an idealistic society for a hand picked group of scientists, artists and industrialists, the idealism is no more. Now the city is littered with corpses, wildly powerful guardians roam the corridors as little girls loot the dead, and genetically mutated citizens ambush you at every turn. Take control of your world by hacking mechanical devices, commandeering security turrets and crafting unique items critical to your very survival. Upgrade your weapons with ionic gels, explosives and toxins to customize them to the enemy and environment. Genetically modify your body through dozens of Plasmid Stations scattered throughout the city, empowering you with fantastic and often grotesque abilities. Explore a living world powered by Ecological A.I., where the inhabitants have interesting and consequential relationships with one another that impact your gameplay experience. Experience truly next generation graphics that vividly illustrate the forlorn art deco city, highlighted by the most detailed and realistic water effects ever developed in a video game. Make meaningful choices and mature decisions, ultimately culminating in the grand question: do you exploit the innocent survivors of Rapture...or save them? [2K Games]… Expand"
  },
  {
    "name": "Mass Effect 2",
    "details_link": "https://www.metacritic.com/game/playstation-3/mass-effect-2",
    "publisher": "Electronic Arts",
    "release_date": "Jan 17 2011",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 94,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/0/45fa44d3386c1d7144d3599a7364bd36-98.jpg",
    "descriptions": "The Mass Effect trilogy is an emotionally charged science fiction adventure set in a vast universe filled with dangerous alien life and mysterious, uncharted planets. In Mass Effect 2, players will once again step into the role of the heroic Commander Shepard, commanding their crew of someThe Mass Effect trilogy is an emotionally charged science fiction adventure set in a vast universe filled with dangerous alien life and mysterious, uncharted planets. In Mass Effect 2, players will once again step into the role of the heroic Commander Shepard, commanding their crew of some of the most dangerous operatives from across the galaxy on a mission so challenging that it's potentially suicidal. Featuring intense shooter action, a rich futuristic storyline, space exploration and emotionally engaging character interaction, the game delivers an unparalleled cinematic experience. … Expand"
  },
  {
    "name": "Grand Theft Auto: Vice City",
    "details_link": "https://www.metacritic.com/game/pc/grand-theft-auto-vice-city",
    "publisher": "Rockstar Games",
    "release_date": "May 12 2003",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3",
      "PlayStation 4",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Open-World"
    ],
    "meta_score": 94,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/4/a11e316b5dce587c8664323b4fd3230e-98.jpg",
    "descriptions": "[Metacritic's 2003 PC Game of the Year] The PC version has enhanced features including improved graphics and sound, additional PC controls, as well as several options for players to customize the game. \"Welcome to Vice City. Welcome to the 1980s.\" Having just made it back onto the streets of[Metacritic's 2003 PC Game of the Year] The PC version has enhanced features including improved graphics and sound, additional PC controls, as well as several options for players to customize the game. \"Welcome to Vice City. Welcome to the 1980s.\" Having just made it back onto the streets of Liberty City after a long stretch in maximum security, Tommy Vercetti is sent to Vice City by his old boss, Sonny Forelli. They were understandably nervous about his re-appearance in Liberty City, so a trip down south seemed like a good idea. But all does not go smoothly upon his arrival in the glamorous, hedonistic metropolis of Vice City. He's set up and is left with no money and no merchandise. Sonny wants his money back, but the biker gangs, Cuban gangsters, and corrupt politicians stand in his way. Most of Vice City seems to want Tommy dead. His only answer is to fight back and take over the city himself. Vice City offers vehicular pleasures to suit every taste. For the speed enthusiast, there's high-performance cars and motorbikes. For the sportsman, a powerboat or a golf buggy lets you enjoy the great outdoors. For those that need that sense of freedom and escape, why not charter a helicopter and see the beauty of Vice City from the air? [Rockstar]… Expand"
  },
  {
    "name": "Madden NFL 2004",
    "details_link": "https://www.metacritic.com/game/playstation-2/madden-nfl-2004",
    "publisher": "EA Sports",
    "release_date": "Aug 12 2003",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 94,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/511dce1d2f29806ff6d85441be83eac7-98.jpg",
    "descriptions": "[Metacritic's 2003 Playstation 2 Game of the Year] Key Features for 2004 include New Playmaker Control - Make pre-snap adjustments to your receiver routes, direct receiver routes during a scramble, direct blocking down field during a run, or read and react to the offense to deliver a[Metacritic's 2003 Playstation 2 Game of the Year] Key Features for 2004 include New Playmaker Control - Make pre-snap adjustments to your receiver routes, direct receiver routes during a scramble, direct blocking down field during a run, or read and react to the offense to deliver a crushing tackle; New Owner Mode - Hire your own staff, set your team's ticket prices, build your own stadium, reward key players with signing bonuses and boost player attributes in Mini-Camp drills; Most Realistic NFL Playbooks Ever -  Tons of new trick plays, multiple formation variations, and the deepest NFL playbooks from all 32 officially licensed Coaches Club Head Coaches; New Animations and Enhancements - New QB scramble transitions to improve throwing on the run, stumbles, open field blocks, whirlwind defensive reaction moves, sideline wrap tackles, and out of bound pushes. [Electronic Arts]… Expand"
  },
  {
    "name": "Gears of War",
    "details_link": "https://www.metacritic.com/game/xbox-360/gears-of-war",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov  7 2006",
    "developers": [
      "Epic Games"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "8  Online",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/5/4e6253bf2efe800e05d4c2270a52a674-98.jpg",
    "descriptions": "Gears of War blends tactical action with survival horror and thrusts gamers into a deep and harrowing story of humankind's epic battle for survival against the Locust Horde, a nightmarish race of creatures that surface from the bowels of the planet. Lead war hero Marcus Fenix and his fireGears of War blends tactical action with survival horror and thrusts gamers into a deep and harrowing story of humankind's epic battle for survival against the Locust Horde, a nightmarish race of creatures that surface from the bowels of the planet. Lead war hero Marcus Fenix and his fire team as they face the onslaught of merciless warrior fiends. A revolutionary tactical combat system and breathtaking, high-definition visuals from the Unreal Engine 3 immerse you in a horrifying story of war and survival. A.I. teammates are indiscernable from human players. Voice recognition and real-time lip synching heighten the experience. The battlefield is a lethal place. To survive, suppress your enemy with blindfire, take cover in interactive environments, or use weapons and teammates to outwit your foes. [Microsoft]… Expand"
  },
  {
    "name": "The Elder Scrolls IV: Oblivion",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-elder-scrolls-iv-oblivion",
    "publisher": "2K Games",
    "release_date": "Mar 20 2006",
    "developers": [
      "Bethesda Softworks",
      "Bethesda Game Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 94,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/2/180b7a5751235c7f2322eb652070c833-98.jpg",
    "descriptions": "Oblivion is a single-player game that takes place in Tamriel's capital province, Cyrodiil. You are given the task of finding the hidden heir to a throne that sits empty, the previous emperor having been killed by an unknown assassin. With no true Emperor, the gates to Oblivion (theOblivion is a single-player game that takes place in Tamriel's capital province, Cyrodiil. You are given the task of finding the hidden heir to a throne that sits empty, the previous emperor having been killed by an unknown assassin. With no true Emperor, the gates to Oblivion (the equivalent of hell in the world of Tamriel) open, and demons begin to invade Cyrodiil and attack its people and towns. It's up to you to find the lost heir to the throne and unravel the sinister plot that threatens to destroy all of Tamriel. In keeping with the Elder Scrolls tradition, players have the option to experience the main quest at their own pace, and there are plenty of opportunities to explore the vast world and make your own way. Numerous factions can be joined, such as the thieves or mages guilds, and each contains its own complete storyline and the chance to rise to the head of the faction and reap further rewards. Oblivion features a groundbreaking new AI system, called Radiant AI, which gives non-player characters (NPCs) the ability to make their own choices based on the world around them. They decide where to eat or who to talk to and what they say. They sleep, go to church, and even steal items, all based on their individual characteristics. Full facial animations and lip-synching, combined with full speech for all dialog, allows NPCs to come to life like never before. [Bethesda]… Expand"
  },
  {
    "name": "Persona 5 Royal",
    "details_link": "https://www.metacritic.com/game/switch/persona-5-royal",
    "publisher": "Sega",
    "release_date": "Oct 21 2022",
    "developers": [
      "Atlus"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 94,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/2/f6bdfc45e376d1a9d53a44d531e64ab1-98.jpg",
    "descriptions": "Forced to transfer to a high school in Tokyo, the protagonist has a strange dream. \"You truly are a prisoner of fate. In the near future, ruin awaits you.\" With the goal of \"rehabilitation\" looming overhead, he must save others from distorted desires by donning the mask of a Phantom Thief.Forced to transfer to a high school in Tokyo, the protagonist has a strange dream. \"You truly are a prisoner of fate. In the near future, ruin awaits you.\" With the goal of \"rehabilitation\" looming overhead, he must save others from distorted desires by donning the mask of a Phantom Thief. \r\rPrepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! \r\rDon the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona 5 Royal is packed with new characters, confidants, story depth, new locations to explore, and a new grappling hook mechanic for stealthy access to new areas. With a new semester at Shujin Academy, get ready to strengthen your abilities in the metaverse and in your daily life. \r\rPersona 5 Royal presents a unique visual style and award nominated composer Shoji Meguro returns with an all-new soundtrack. Explore Tokyo, unlock new Personas, customize your own personal Thieves Den, discover a never-before-seen story arc, cutscenes, alternate endings, and more! Even for the most seasoned Phantom Thieves among us, Persona 5 Royal is a new challenge to defy conventions, discover the power within, and fight for justice. Wear the mask. Reveal your truth.… Expand"
  },
  {
    "name": "Sid Meier's Civilization II",
    "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-ii",
    "publisher": "MicroProse",
    "release_date": "Feb 29 1996",
    "developers": [
      "MPS Labs"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Historic",
      "General",
      "Historic",
      "4X"
    ],
    "meta_score": 94,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/a316dd672da65f4bec1495e9078467e7-98.jpg",
    "descriptions": "An empire-building turn-based strategy game. The game starts at the Old Stone Age in 4000 BC. Your tribe begins with a Settlers unit and has no knowledge about the surrounding area. As you found new cities and explore the surroundings, you may find hostile barbarians, villages, and otherAn empire-building turn-based strategy game. The game starts at the Old Stone Age in 4000 BC. Your tribe begins with a Settlers unit and has no knowledge about the surrounding area. As you found new cities and explore the surroundings, you may find hostile barbarians, villages, and other competing cultures. [Civ Fantatics' Center]… Expand"
  },
  {
    "name": "Quake",
    "details_link": "https://www.metacritic.com/game/pc/quake",
    "publisher": "id Software",
    "release_date": "Jun 22 1996",
    "developers": [
      "id Software"
    ],
    "platforms": "PC",
    "num_players": "1-16 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/3/019b99bac78077f18f055b1c4019c0c7-98.jpg",
    "descriptions": "Rage through 32 single player levels and 6 deathmatch levels of sheer terror and fully immersive sound and lighting. Arm yourself against the cannibalistic Ogre, fiendish Vore and indestructible Schambler using letal nails, fierce Thunderbolts and abominable Rocket and Grenade Launchers. [idRage through 32 single player levels and 6 deathmatch levels of sheer terror and fully immersive sound and lighting. Arm yourself against the cannibalistic Ogre, fiendish Vore and indestructible Schambler using letal nails, fierce Thunderbolts and abominable Rocket and Grenade Launchers. [id Software]… Expand"
  },
  {
    "name": "Call of Duty 4: Modern Warfare",
    "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-4-modern-warfare",
    "publisher": "Activision",
    "release_date": "Nov  5 2007",
    "developers": [
      "Infinity Ward"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 18 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/2/4c04508ffbb8d2f01fc7abc652f6d53d-98.jpg",
    "descriptions": "As Call of Duty 4: Modern Warfare's single player campaign unfolds, the player is introduced to new gameplay at every turn – one moment you are fast-roping from your Black Hawk helicopter after storming into the war zone with an armada of choppers, the next you are a sniper, underAs Call of Duty 4: Modern Warfare's single player campaign unfolds, the player is introduced to new gameplay at every turn – one moment you are fast-roping from your Black Hawk helicopter after storming into the war zone with an armada of choppers, the next you are a sniper, under concealment, in a Ghillie suit miles behind enemy lines, the next you are engaging hostiles from an AC-130 gunship thousands of feet above the battlefield. Mixed with explosive action, Call of Duty 4: Modern Warfare also delivers special effects, including use of depth of field, rim-lighting, character self-shadowing, real time post-processing, texture streaming as well as physics-enabled effects. Infinity Ward deployed a dedicated team from the start to deliver a new level of depth to multiplayer. Building on the hit \"Call of Duty 2\" online experience, Call of Duty 4: Modern Warfare's new multiplayer provides the community an addictive and accessible experience to gamers of all levels. [Activision]… Expand"
  },
  {
    "name": "BioShock Infinite",
    "details_link": "https://www.metacritic.com/game/pc/bioshock-infinite",
    "publisher": "2K Games",
    "release_date": "Mar 25 2013",
    "developers": [
      "Irrational Games"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/d6db22b96a880fa7fb6d577591e181e2-98.jpg",
    "descriptions": "Initially conceived as a floating symbol of American ideals at a time when the United States was emerging as a world power, Columbia is sent to distant shores with great fanfare by a captivated public.  What begins as a fresh new endeavor of hope turns drastically wrong as the city soonInitially conceived as a floating symbol of American ideals at a time when the United States was emerging as a world power, Columbia is sent to distant shores with great fanfare by a captivated public.  What begins as a fresh new endeavor of hope turns drastically wrong as the city soon disappears into the clouds to whereabouts unknown. The player takes on the role of former Pinkerton agent Booker DeWitt, sent to the lost city to rescue Elizabeth, a young lady imprisoned there since her childhood. He develops a relationship with Elizabeth, enhancing his abilities with hers so the pair may escape from a city that is literally falling from the sky. DeWitt has to learn to fight foes in high-speed Sky-Line battles, engage in combat both indoors and amongst the clouds, and harness the power of a myriad of new weapons and abilities.\r… Expand"
  },
  {
    "name": "Halo 3",
    "details_link": "https://www.metacritic.com/game/xbox-360/halo-3",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep 25 2007",
    "developers": [
      "Bungie Software",
      "Bungie"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 94,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/6/23421b773cd4739a8a3c4e064fc93d9f-98.jpg",
    "descriptions": "Halo 3 is the third game in the Halo Trilogy and provides the thrilling conclusion to the events begun in \"Halo: Combat Evolved.\" Halo 3 picks up where \"Halo 2\" left off. The Master Chief is returning to Earth to finish the fight. The Covenant occupation of Earth has uncovered a massive andHalo 3 is the third game in the Halo Trilogy and provides the thrilling conclusion to the events begun in \"Halo: Combat Evolved.\" Halo 3 picks up where \"Halo 2\" left off. The Master Chief is returning to Earth to finish the fight. The Covenant occupation of Earth has uncovered a massive and ancient object beneath the African sands - an object who's secrets have yet to be revealed. Earth's forces are battered and beaten. The Master Chief's AI companion Cortana is still trapped in the clutches of the Gravemind - a horrifying Flood intelligence, and a civil war is raging in the heart of the Covenant. This is how the world ends... [Bungie]… Expand"
  }
]