[{"name": "Call of Duty: Black Ops III - Descent", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-black-ops-iii---descent", "publisher": "Activision", "release_date": "Jul 12 2016", "developers": ["Treyarch"], "platforms": "PlayStation 4", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 68, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/4/03e256aa50379937bea46514b9d6a8af-98.jpg", "descriptions": "Descent takes the fight to new Black Ops III Multiplayer environments, including Cryogen: an isolated cryo-prison; Berserk: a Viking village frozen in time; Rumble: a future robot combat arena; and Empire: a re-imagining of the Call of Duty Black Ops II classic, Raid, as a lavish RomanDescent takes the fight to new Black Ops III Multiplayer environments, including Cryogen: an isolated cryo-prison; Berserk: a Viking village frozen in time; Rumble: a future robot combat arena; and Empire: a re-imagining of the Call of Duty Black Ops II classic, Raid, as a lavish Roman villa. [Activision]… Expand"}, {"name": "Call of Duty: Ghosts", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-ghosts", "publisher": "Activision", "release_date": "Nov  4 2013", "developers": ["Infinity Ward"], "platforms": ["PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 68, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/1/0354194c1c44b8fe89de2e53bf34c98a-98.jpg", "descriptions": "This new chapter in the Call of Duty franchise features a fresh dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive. 10 years after a devastating mass event, the nation's borders and the balance of global power have beenThis new chapter in the Call of Duty franchise features a fresh dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive. 10 years after a devastating mass event, the nation's borders and the balance of global power have been permanently redrawn. As what's left of the nation's Special Operations forces, a mysterious group known only as \"Ghosts\" leads the fight back against a newly emerged, technologically-superior global power. The new Perks system has more perks than were previously available. Every perk has a value from 1 to 5, and you have 8 points to allocate. So for example, choose 4 perks each valued at 2 points a piece, or even 8 perks, each valued at 1. You could also choose to get rid of your secondary weapon and get up to 11 perks.… Expand"}, {"name": "Empires Apart", "details_link": "https://www.metacritic.com/game/pc/empires-apart", "publisher": "Slitherine", "release_date": "Mar 29 2018", "developers": ["DESTINYbit"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 68, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/4f383a62a1a1da5d34e95992803d1b89-98.jpg", "descriptions": "Empires Apart is a Real Time Strategy game set in medieval times. Play as one of six uniquely designed factions. Gather resources, raise an army and lead your civilization to victory in a multiplayer focused classic RTS, brought to the modern age."}, {"name": "Exist Archive: The Other Side of the Sky", "details_link": "https://www.metacritic.com/game/playstation-vita/exist-archive-the-other-side-of-the-sky", "publisher": "Aksys Games", "release_date": "Oct 18 2016", "developers": ["Tri-Ace"], "platforms": ["PlayStation 4", "PlayStation Vita"], "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/79dced0932290a547fa92950f698d0c4-98.jpg", "descriptions": "An RPG in which Kanata and others have been imbued with pieces of the dark god Yamatoga’s soul, and are sent to Protolexa, for reasons unbeknownst to them. Battle enemies and the armies of Chasseur as you search out for your other teammates, complete quests and side events, and learn theAn RPG in which Kanata and others have been imbued with pieces of the dark god Yamatoga’s soul, and are sent to Protolexa, for reasons unbeknownst to them. Battle enemies and the armies of Chasseur as you search out for your other teammates, complete quests and side events, and learn the truth of why you have been chosen. [Playstation.com]… Expand"}, {"name": "NCAA Basketball 09", "details_link": "https://www.metacritic.com/game/playstation-3/ncaa-basketball-09", "publisher": "Electronic Arts", "release_date": "Nov 17 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/82873fd603d5e13beec04f5b7fc1f2b9-98.jpg", "descriptions": "NCAA Basketball 09 operates on a new gameplay engine with over 1,000 new animation sequences that deliver a more responsive experience with improved ball physics and more intelligent AI. The new animation system enables gamers to apply pressure defense with new full-court presses and traps.NCAA Basketball 09 operates on a new gameplay engine with over 1,000 new animation sequences that deliver a more responsive experience with improved ball physics and more intelligent AI. The new animation system enables gamers to apply pressure defense with new full-court presses and traps. Plus, improved AI and animations enable quicker players to get up and down the floor faster and make better decisions running the lanes and driving to the rim. Animations can be interrupted at any time, enabling you to read and respond to the action on the floor, just like real life. Feel the excitement of game night with the band playing fight songs, the student section leading the cheers and popular ESPN college basketball broadcasters Dick Vitale, Brad Nessler, and Erin Andrews providing the commentary. [Electronic Arts]… Expand"}, {"name": "World Poker Tour", "details_link": "https://www.metacritic.com/game/psp/world-poker-tour", "publisher": "2K Sports", "release_date": "Apr 17 2006", "developers": ["Coresoft"], "platforms": "PSP", "num_players": "Up to 6 ", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/b64bb513aa566c1512c41a18425e6446-98.jpg", "descriptions": "Exclusive World Poker Tour Presentation - Including real WPT venues such as Commerce Casino and the Aviation Club, broadcast style overlays and commentary featuring Mike Sexton and Vince Van Patten. Compete against the virtual equivalents of Antonio \"the Magician\" Esfandiari, Erick Lindgren,Exclusive World Poker Tour Presentation - Including real WPT venues such as Commerce Casino and the Aviation Club, broadcast style overlays and commentary featuring Mike Sexton and Vince Van Patten. Compete against the virtual equivalents of Antonio \"the Magician\" Esfandiari, Erick Lindgren, Evelyn Ng, Lyle Berman, Michael \"the Grinder\" Mizrachi, and Phil \"Unabomber\" Laak, that play each situation just like their real-life counterparts. Go \"all in\" against players across the country with WPT's robust online functionality. Compete in tournaments, set up poker nights with your friends, manage buddy lists, and chat. Improve your poker playing skills by utilizing in-game tutorials and an in-depth stat tracking system that outlines your playing tendencies in numerous situations. Create a player, launch a career, and strive to become a WPT World Champion as you build your character's experience and boost your career earnings by competing in multiple game modes including Quick Play, Satellite Tour Play and WPT Season Play. Flaunt your success by using your earnings to deck out your player with hundreds of accessories. Create custom poker games by setting rules and limits with the poker game editor, or choose from 14 different community poker games including Texas Hold'em, Omaha, Pineapple, Double Flop Hold'em, Super Hold'em, Billabong, Tahoe and Shanghai. [2K Games]… Expand"}, {"name": "Automachef", "details_link": "https://www.metacritic.com/game/switch/automachef", "publisher": "Team17", "release_date": "Jul 23 2019", "developers": ["Hermes Interactive"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/817859d09b69da515264a8e2638b1afc-98.jpg", "descriptions": "It’s time to engineer tomorrow’s kitchen, today. Plan. Position. Program: Design and build automated restaurants, then program them to run like well-oiled machines! Do you have a can-do attitude and the know-how to conquer the world of automated restaurants? Challenging Puzzles: Fine tuneIt’s time to engineer tomorrow’s kitchen, today. Plan. Position. Program: Design and build automated restaurants, then program them to run like well-oiled machines! Do you have a can-do attitude and the know-how to conquer the world of automated restaurants? Challenging Puzzles: Fine tune your mind as you tackle intricate spatial, resource management and scenario puzzles! Not enough hot dogs? You’ll sort it! Kitchens on fire? No problem for a smart human like you. Multiple Brain-Tickling Modes: Take on the campaign levels, traverse your way through the business world in contracts mode, or just go nuts and bolts in the sandbox test mode and play until you get your fill.… Expand"}, {"name": "WWE All Stars", "details_link": "https://www.metacritic.com/game/wii/wwe-all-stars", "publisher": "THQ", "release_date": "Mar 29 2011", "developers": ["THQ"], "platforms": ["3DS", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/b04529eb939d8b08b098785e31091004-98.jpg", "descriptions": "WWE All Stars will deliver one of the greatest rosters ever assembled in a wrestling-centric videogame.  Renowned WWE Legends will align with today's most prominent Superstars, inviting players to generate fantasy matches and ultimately determine the greatest competitors of all time.  InWWE All Stars will deliver one of the greatest rosters ever assembled in a wrestling-centric videogame.  Renowned WWE Legends will align with today's most prominent Superstars, inviting players to generate fantasy matches and ultimately determine the greatest competitors of all time.  In addition, each Legend and Superstar will boast a distinctive and highly stylized appearance, adding to the overall atmosphere and intrepid attitude exuding from the on-screen action.… Expand"}, {"name": "Lost Sphear", "details_link": "https://www.metacritic.com/game/playstation-4/lost-sphear", "publisher": "Square Enix", "release_date": "Jan 23 2018", "developers": ["Tokyo RPG Factory"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/39a8f19b35beb6c0812f11afc4eaa180-98.jpg", "descriptions": "As an ominous power threatens the fabric of reality, a young man chosen by destiny must arise to face a phenomenon never seen before. Enter Kanata, as he awakens from a devastating dream leading him to find his home, erased from existence. Awaken the power of Memory to restore the Lost andAs an ominous power threatens the fabric of reality, a young man chosen by destiny must arise to face a phenomenon never seen before. Enter Kanata, as he awakens from a devastating dream leading him to find his home, erased from existence. Awaken the power of Memory to restore the Lost and rebuild the world!… Expand"}, {"name": "Metrico", "details_link": "https://www.metacritic.com/game/playstation-vita/metrico", "publisher": "Digital Dreams", "release_date": "Aug  5 2014", "developers": ["Digital Dreams"], "platforms": "PlayStation Vita", "genres": ["General", "Miscellaneous", "Puzzle", "Action", "General"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/8305f623b1d8757b72b500416b39c9b8-98.jpg", "descriptions": "Dutch indie developer Digital Dreams makes its console debut with Metrico, a unique infographic puzzle action game. Set in a world filled with infographics, Metrico challenges players through 6 worlds filled with bar charts, line diagrams and pie charts, each of which directly react to theDutch indie developer Digital Dreams makes its console debut with Metrico, a unique infographic puzzle action game. Set in a world filled with infographics, Metrico challenges players through 6 worlds filled with bar charts, line diagrams and pie charts, each of which directly react to the player’s movements, actions and input. For example, one bar diagram might grow with each step a player takes to the left, while another might decline with every jump. Players must explore Metrico and carefully analyze every move to see how they affect the world and what will help them advance. This game mechanic, called “Input Morphing”, forces players to think about actions that they normally wouldn’t consider in a video game. Metrico is a combination of exploration, skill, experimentation, but above all: thinking outside of the box. [Plan of Attack]… Expand"}, {"name": "Link's Crossbow Training", "details_link": "https://www.metacritic.com/game/wii/links-crossbow-training", "publisher": "Nintendo", "release_date": "Nov 19 2007", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/c81bafded5603697c9d8a160a3ced169-98.jpg", "descriptions": "Link returns from The Legend of Zelda: Twilight Princess to pick up the Wii Zapper and take aim at a host of targets in this shooting-gallery-style game. Anyone can pick up the Wii Zapper and become a master marksman in the quick-play shooting galleries of Link's Crossbow Training. Dozens ofLink returns from The Legend of Zelda: Twilight Princess to pick up the Wii Zapper and take aim at a host of targets in this shooting-gallery-style game. Anyone can pick up the Wii Zapper and become a master marksman in the quick-play shooting galleries of Link's Crossbow Training. Dozens of fast-paced stages offer a wide variety of game play, from shooting stationary targets to defending a supply wagon from onrushing hordes of enemies. Multiplayer modes let players and their friends share a Wii Zapper to shoot for the high score. Link's Crossbow Training comes bundled with the Wii Zapper. The Wii Zapper requires the Wii Remote and Nunchuk, housing both in a comfortable and intuitive frame. The control stick on the Nunchuk controls player movement (on stages that allow player movement), while simply aiming the Wii Zapper moves the targeting reticule on the screen. Pulling the trigger fires Link's crossbow. By aiming off screen, players can turn Link to face in a new direction (again, on stages that allow this). Link's Crossbow Training contains three basic game styles: target shooting, defender and ranger. There are 27 stages in total, and these categories represent only generally how each individual stage operates. Each stage's goal is to earn the highest score possible within the time limit. All rounds can be played with multiple players: Players pass the Wii Zapper around and then play one at a time and compete for the high score. [Nintendo]… Expand"}, {"name": "Marsupilami: Hoobadventure", "details_link": "https://www.metacritic.com/game/playstation-4/marsupilami-hoobadventure", "publisher": "Microids", "release_date": "Nov 16 2021", "developers": ["Ocellus Studio"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/a13d510624419b0ac397f915a57f87e6-98.jpg", "descriptions": "Punch, Twister and Hope are three Marsupilamis living a peaceful life in Palombia. Their lives are about to take a drastic turn when they accidentally open a sarcophagus whilst playing with debris on a beach, releasing a mysterious ghost cursing all the animals! Thankfully, our threePunch, Twister and Hope are three Marsupilamis living a peaceful life in Palombia. Their lives are about to take a drastic turn when they accidentally open a sarcophagus whilst playing with debris on a beach, releasing a mysterious ghost cursing all the animals! Thankfully, our three Marsupilamis are immune to the curse and decide to set out on an adventure and find the ghost and reverse the curse. Inspired by the comic book Marsupilami from Franquin, this 2.5D platformer will take you on a colorful journey through the Palombian jungle, a coastal city and even an abandoned temple. Jump, punch, dash and swing with your tail like only Marsupilamis do. While mainly targeting a younger audience, the most dedicated gamers would be delighted to learn a Time Attack mode will challenge them to finish each level as fast as they can. And for the completionist, a beautiful artwork gallery will be unlocked after collecting hidden feathers and visiting secret dojos.… Expand"}, {"name": "Hellpoint", "details_link": "https://www.metacritic.com/game/xbox-one/hellpoint", "publisher": "tinyBuild", "release_date": "Jul 30 2020", "developers": ["Cradle Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/47557201b2d5537d746757ea40f2f286-98.jpg", "descriptions": "Hellpoint is an intense action RPG taking place on Irid Novo, a derelict space station soaked in an intoxicating dark sci fi atmosphere. Fight dreadful creatures, face the Cosmic Gods and unravel their twisted story. Should the challenge be too great, play with a friend in local or online coop."}, {"name": "Red Wings: Aces of the Sky", "details_link": "https://www.metacritic.com/game/switch/red-wings-aces-of-the-sky", "publisher": "All in! Games", "release_date": "May 21 2020", "developers": ["All in! Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Combat"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/cdffe9abc1bc555c6abf5b3dafee47d9-98.jpg", "descriptions": "Red Wings: Aces of the Sky is a dynamic action game that will show you amazing battles straight from the pages of history in a brand new arcade gameplay style. Use your unique skills to take down your opponents, develop your deadly pilot aim, and become the true ace of the sky.\r WitnessRed Wings: Aces of the Sky is a dynamic action game that will show you amazing battles straight from the pages of history in a brand new arcade gameplay style. Use your unique skills to take down your opponents, develop your deadly pilot aim, and become the true ace of the sky.\r Witness the birth, rise, and fall of the Red Baron, Manfred von Richthofen—the ultimate hero of the first World War, credited with 80 victories. Become a part of his squadron or his archrival.\r Choose one of more than 10 historical warplanes of the Entente Powers or the Triple Alliance. Fly into a unique mix of historic events and over-the-top, comic book-style adventures.… Expand"}, {"name": "Steel Rats", "details_link": "https://www.metacritic.com/game/pc/steel-rats", "publisher": "Tate Multimedia", "release_date": "Nov  7 2018", "developers": ["Tate Multimedia"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/4adfdca634aaa1fbf6e1d1543e926ead-98.jpg", "descriptions": "Become one of the Steel Rats, a biker gang sworn to protect their city against an invading army of alien robots - Junkbots. Wreck and ride through hordes of enemies, switching between four unique characters as you wreak havoc with the ultimate killing machine; your flame spewing, saw bladed,Become one of the Steel Rats, a biker gang sworn to protect their city against an invading army of alien robots - Junkbots. Wreck and ride through hordes of enemies, switching between four unique characters as you wreak havoc with the ultimate killing machine; your flame spewing, saw bladed, motorcycle.… Expand"}, {"name": "Scribblenauts Unmasked: A DC Comics Adventure", "details_link": "https://www.metacritic.com/game/3ds/scribblenauts-unmasked-a-dc-comics-adventure", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 24 2013", "developers": ["5TH Cell"], "platforms": ["PC", "Wii U", "3DS"], "genres": ["Puzzle", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 68, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/18a512667210958222d2c9282484bc65-98.jpg", "descriptions": "Challenge your imagination as you battle the mightiest villains in an exciting and action-filled adventure through GOTHAM CITY, METROPOLIS, ATLANTIS and other iconic locales from the DC Comics universe.  Enjoy endless replayability with new, dynamic puzzles that feature a different missionChallenge your imagination as you battle the mightiest villains in an exciting and action-filled adventure through GOTHAM CITY, METROPOLIS, ATLANTIS and other iconic locales from the DC Comics universe.  Enjoy endless replayability with new, dynamic puzzles that feature a different mission every time you play. \r\rBring out your inner super hero (or villain!) with the all-new Super Hero Creator by crafting completely original objects out of parts of existing DC Comics characters. Then assign unique properties to your creations and use them to solve puzzles, or share them online with friends - which they can use in game or further modify as they like.… Expand"}, {"name": "Call of Duty: Modern Warfare 2 - Stimulus Package", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-modern-warfare-2---stimulus-package", "publisher": "Activision", "release_date": "Mar 30 2010", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 68, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/3/4a7cb4ce3733f9bf64581f83c32bc6ce-98.jpg", "descriptions": "The Modern Warfare 2 Stimulus Package delivers 5 additional action-packed multiplayer maps, including brand-new battlegrounds and legendary fan-favorites from Call of Duty 4: Modern Warfare. The Stimulus Package includes five additional multiplayer maps featuring a variety of locations:The Modern Warfare 2 Stimulus Package delivers 5 additional action-packed multiplayer maps, including brand-new battlegrounds and legendary fan-favorites from Call of Duty 4: Modern Warfare. The Stimulus Package includes five additional multiplayer maps featuring a variety of locations: \"Bailout,\" a multi-level apartment complex torn apart by combat with tight corridors and blown out suites along with vantage points overlooking the connecting courtyards and parking lots. \"Storm,\" an open industrial park with large abandoned warehouses and factories littered with heavy machinery subjected to the rain and booming approach of an impending thunderstorm. \"Salvage,\" a snowy junkyard fortified by stacked debris and crushed cars that offer a varied layout of open and close-quartered combat areas. \"Crash\", a war-torn urban environment centered by a downed helicopter and surrounded by vantage points from multi-story shops and destroyed buildings. \"Overgrown,\" which features open fields with high grass and a massive dry creek bed that splits this neglected village in half. [Activision]… Expand"}, {"name": "Wolfenstein: Youngblood", "details_link": "https://www.metacritic.com/game/xbox-one/wolfenstein-youngblood", "publisher": "Bethesda Softworks", "release_date": "Jul 26 2019", "developers": ["MachineGames"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 68, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/1/bb19282516e51f237ba049f42ee414d3-98.jpg", "descriptions": "Wolfenstein®: Youngblood is a brand-new co-op experience from MachineGames, the award-winning studio that developed the critically acclaimed Wolfenstein® II: The New Colossus. Set in 1980, 19 years after BJ Blazkowicz ignited the second American Revolution, Wolfenstein®: YoungbloodWolfenstein®: Youngblood is a brand-new co-op experience from MachineGames, the award-winning studio that developed the critically acclaimed Wolfenstein® II: The New Colossus. Set in 1980, 19 years after BJ Blazkowicz ignited the second American Revolution, Wolfenstein®: Youngblood introduces the next Blazkowicz generation to the fight against the Nazis. Play as one of BJ's twin daughters, Jess and Soph, as you search for your missing father in Nazi-occupied Paris.… Expand"}, {"name": "The Signifier", "details_link": "https://www.metacritic.com/game/pc/the-signifier", "publisher": "Raw Fury", "release_date": "Oct 15 2020", "developers": ["Playmestudio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/a021f45b6881e97956b85e19865f7027-98.jpg", "descriptions": "This psychological thriller journeys from the real world into the surreal realms of objective memories and subjective experiences. Experimental parapsychology, artificial intelligence, and technology intersect as players solve puzzles, unravel dialog, and seek the truth."}, {"name": "Squids Odyssey", "details_link": "https://www.metacritic.com/game/wii-u/squids-odyssey", "publisher": "The Game Bakers", "release_date": "May 22 2014", "developers": ["The Game Bakers"], "platforms": ["3DS", "PC", "Switch", "Wii U"], "genres": ["Role-Playing", "Console-style RPG", "Japanese-Style"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/3924573bb91a249f068fc43f314e36f7-98.jpg", "descriptions": "Squids Odyssey is a unique mix of action strategy and RPG: build your team of Squid heroes for epic turn-based battles against corrupted crabs and shrimps. Steev, Vahine and the rest of the Squids are in danger. An infectious black ooze is corrupting their world. The band of unlikely heroesSquids Odyssey is a unique mix of action strategy and RPG: build your team of Squid heroes for epic turn-based battles against corrupted crabs and shrimps. Steev, Vahine and the rest of the Squids are in danger. An infectious black ooze is corrupting their world. The band of unlikely heroes need to fight back to save their lush underwater kingdoms.… Expand"}, {"name": "Blackguards", "details_link": "https://www.metacritic.com/game/pc/blackguards", "publisher": "Daedalic Entertainment", "release_date": "Nov  6 2013", "developers": ["Daedalic Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/b6971f6216cfd4ad93644435b1ae07fa-98.jpg", "descriptions": "What happens when the only hope of a threatened world lies not with heroes in shining armor but in the hands of a band of misfits and criminals? Blackguards - the new turn-based RPG by Daedalic Entertainment - explores this very question. The player takes on the role of a convicted murderer,What happens when the only hope of a threatened world lies not with heroes in shining armor but in the hands of a band of misfits and criminals? Blackguards - the new turn-based RPG by Daedalic Entertainment - explores this very question. The player takes on the role of a convicted murderer, who with the help of a team of more-than-questionable characters, must save the world from a dark menace. During the wild chase throughout the South of Aventuria, the world of The Dark Eye, there is more to fight than vicious creatures - chapter by chapter, a story full of intrigue and surprising twists unfolds. But when life and death are in the player's hands, how far will they go to reach their goals?… Expand"}, {"name": "Night Call", "details_link": "https://www.metacritic.com/game/pc/night-call", "publisher": "Raw Fury", "release_date": "Jul 17 2019", "developers": ["Raw Fury", "BlackMuffin Studio", "Monkey Moon"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/36b2d3116b10a186410b0fba20697d73-98.jpg", "descriptions": "Friend. Confidant. Therapist. Voyeur. As a cab driver working the Paris night shift, you are many things to different people. Your gift is getting people to talk; and in order to catch the serial killer who left you for dead, that’s exactly what you’ll need to do."}, {"name": "Tiny Metal", "details_link": "https://www.metacritic.com/game/pc/tiny-metal", "publisher": "AREA35", "release_date": "Dec 21 2017", "developers": ["AREA35"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 68, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/8/720b1183bfb1503640d833ce0a20900c-98.jpg", "descriptions": "A turn-based strategy game of intrigue with a distinct Japanese flavor that takes place in the aftermath of your king's assassination. Roll out the tanks, create more troops, expand your squad, and struggle for territory with war-room levels of control!"}, {"name": "Ninjala", "details_link": "https://www.metacritic.com/game/switch/ninjala", "publisher": "GungHo Online Entertainment America, Inc.", "release_date": "Jun 24 2020", "developers": ["GungHo Online Entertainment America", "Inc.", "Soleil", "Soleil Ltd."], "platforms": "Switch", "num_players": "Up to 8 ", "genres": ["Action", "General"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/d9c33cb13f4ee7db6c0f8bb495b8385b-98.jpg", "descriptions": "An online action battle game featuring ninja and gum! Assume the role of a modern-day ninja and take part in the Ninjala tournament!\r ■ Ninja-Gum\r\n\r\nUse Ninja-Gum to blow bubbles that can be tossed at your foes, craft all sorts of weapons, and dash across stages.\r\n\r\nThe appearance andAn online action battle game featuring ninja and gum! Assume the role of a modern-day ninja and take part in the Ninjala tournament!\r ■ Ninja-Gum\r Use Ninja-Gum to blow bubbles that can be tossed at your foes, craft all sorts of weapons, and dash across stages.\r The appearance and variety of your weapon will vary depending on the type of Ninja-Gum you use.\r ■ Competitive Player\r Take part in Battle Royale-style matches of up to 8 players and vie for supremacy with ninja around the world. The player who earns the most points over the course of the match will be declared the winner. Score points by defeating your opponents, obtaining items, destroying drones positioned across the stage, and more. Earn extra points by taking down your opponents with an IPPON—impressive finishing techniques.\r ■ Cooperative Play\r Join up with friends and take part in a 4-on-4 team battle. Cooperate with your teammates and earn more points than the opposing team to be declared the winner.\r ■ Avatar\r A colorful variety of costumes and accessories from an array of unique fashion brands are available. Choose from a wide variety of avatar items which can be combined as you see fit. You can stick to one brand for a consistent look, or mix and match to create a style all your own!\r… Expand"}, {"name": "1942: Joint Strike", "details_link": "https://www.metacritic.com/game/xbox-360/1942-joint-strike", "publisher": "Capcom", "release_date": "Jul 23 2008", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/cee8cca68f45d5e3ea1653caa157e40a-98.jpg", "descriptions": "[Xbox Live Arcade]  1942: Joint Strike takes inspiration and influence from the 194X series of World War II-themed vertical shooters. The art, sound, and gameplay of the new game takes cues from the original 194X games, but stands out as its own unique entry. Gameplay resembles the classic[Xbox Live Arcade]  1942: Joint Strike takes inspiration and influence from the 194X series of World War II-themed vertical shooters. The art, sound, and gameplay of the new game takes cues from the original 194X games, but stands out as its own unique entry. Gameplay resembles the classic 2D style that gamers expect, but the game utilizes a full 3D engine. Set in a World War II-themed locale, stages, vehicles, and weapons have the look and feel of WWII with some stylistic differences. The world in which 1942 takes place is not our own and the events that transpire are not historically accurate, nor are they intended to be. This is an alternate world where history and technology developed along their own paths. As a result, players jump into the cockpits of WWII-era aircraft to take on huge waves of incoming enemy fire, dodging explosions and missiles while challenging huge bosses at the end of each stage. New co-op \"Joint Strike attacks\" combine the powers of two aircrafts into a devastating barrage. [Capcom]… Expand"}, {"name": "Jay and Silent Bob: Mall Brawl", "details_link": "https://www.metacritic.com/game/xbox-one/jay-and-silent-bob-mall-brawl", "publisher": "Limited Run Games", "release_date": "May 20 2021", "developers": ["Interabang Entertainment", "Spoony Bard Productions"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/2f2d4398dfb64446f2135be977349af2-98.jpg", "descriptions": "Jay and Silent Bob Mall Brawl, an all new side-scrolling brawler set in the world famous and beloved View Askewniverse, is now available as a fully functional cartridge compatible with the original NES. This cartridge is a full game playable by either one or two players! There are threeJay and Silent Bob Mall Brawl, an all new side-scrolling brawler set in the world famous and beloved View Askewniverse, is now available as a fully functional cartridge compatible with the original NES. This cartridge is a full game playable by either one or two players! There are three color variants available - Silent Bob Green, Jay Yellow, and NES Grey.\r Each copy of Jay and Silent Bob Mall Brawl comes in a retro box that has been painstakingly crafted to be as authentic as possible. The box is printed on the same material as original retro boxes and matches the same flap design at the top. The metallic gold ink on the \"Limited Run\" seal has also been matched to the original seal's ink.\r Included in the box is a retro manual, dust sleeve, and of course, a styrofoam block to hold the cartridge up inside the box. Each copy of the game will arrive shrinkwrapped.\r The game itself was programmed by Tomas Guinan from Spoony Bard Productions.\r This game is region free!… Expand"}, {"name": "Torchlight III", "details_link": "https://www.metacritic.com/game/xbox-one/torchlight-iii", "publisher": "Perfect World Entertainment", "release_date": "Oct 13 2020", "developers": ["Echtra Games", "Inc."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 40 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/9/37c62b373945bee25db706ebccd3e05a-98.jpg", "descriptions": "It's been a century since the events of Torchlight II, and the Ember Empire is in decline. In Torchlight III, Novastraia is again under threat of invasion and it's up to you to defend against the Netherim and its allies. Gather your wits and brave the frontier to find fame, glory, and newIt's been a century since the events of Torchlight II, and the Ember Empire is in decline. In Torchlight III, Novastraia is again under threat of invasion and it's up to you to defend against the Netherim and its allies. Gather your wits and brave the frontier to find fame, glory, and new adventures!Travel the FrontierExplore the wilderness, party with friends, gather materials to craft gear, or use magic to enter unknown dungeons! There's always something to do in the new frontier.Build & Upgrade Your FortIt's time to rebuild and that includes you! Enjoy your very own fort, where you can upgrade gear and renovate your fort to show off to your friends and the world. Collect Epic GearWhether it's armor, weapons, dyes, recipes, ember cores, or even new pets...there's always more to find as you battle through dungeons and take on dangerous foes. Pets Are BackFight your way to fame and glory with your loyal companion! Add skills and equip them with gear to make them stronger. Each species comes in a myriad of colors and styles, so make sure to collect them all! Build Your HeroWith four unique classes to choose from, players can utilize class-specific mechanics to maximize damage and their odds of survival. Combine epic gear, Relic powers, and class abilities to customize your playstyle.… Expand"}, {"name": "Warriors Orochi 4", "details_link": "https://www.metacritic.com/game/xbox-one/warriors-orochi-4", "publisher": "Koei Tecmo Games", "release_date": "Oct 16 2018", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/cfc2e5bf9f8bbabd189ca62d619c4a83-98.jpg", "descriptions": "Pick from 170 characters: Heroes gather from the Samurai Warriors and Dynasty Warriors Universes. Assume the Power of the Gods: Enjoy brand new Musou action. Sacred treasures empowered by a miraculous power enable characters to evoke magic attacks. The infamous one versus thousands battlePick from 170 characters: Heroes gather from the Samurai Warriors and Dynasty Warriors Universes. Assume the Power of the Gods: Enjoy brand new Musou action. Sacred treasures empowered by a miraculous power enable characters to evoke magic attacks. The infamous one versus thousands battle action sees new additions.… Expand"}, {"name": "Bear With Me: Episode 1", "details_link": "https://www.metacritic.com/game/pc/bear-with-me-episode-1", "publisher": "Exordium Games", "release_date": "Aug  8 2016", "developers": ["Exordium Games"], "platforms": "PC", "genres": ["Adventure", "Point-and-Click"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/30136a33d4f0153bdb5611bec5b7257b-98.jpg", "descriptions": "Bear With Me is an episodic noir adventure game. Amber is trying to find her missing brother while being aided by her trusty teddy, Ted E. Bear."}, {"name": "DmC: Devil May Cry - Vergil's Downfall", "details_link": "https://www.metacritic.com/game/xbox-360/dmc-devil-may-cry---vergils-downfall", "publisher": "Capcom", "release_date": "Mar  5 2013", "developers": ["Ninja Theory"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/58f72e19867dd8e330b6e84a86c11a7a-98.jpg", "descriptions": "Vergil's Downfall is downloadable content for DmC: Devil May Cry that shows players what happens to Vergil after the events of the main game."}, {"name": "Spider-Man: Shattered Dimensions", "details_link": "https://www.metacritic.com/game/pc/spider-man-shattered-dimensions", "publisher": "Activision", "release_date": "Nov 24 2010", "developers": ["Beenox"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Adventure", "General", "Beat-'Em-Up", "Linear", "Fantasy", "Third-Person", "Fantasy", "3D"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/ba7acda62e855b086ab2ef857a7c4c98-98.jpg", "descriptions": "Spider-Man: Shattered Dimensions is a thrilling action-packed adventure set in four dramatically different universes from legendary Spider-Man lore, each with a distinct Spider-Man armed with unique skills and strengths, in one original storyline.  Players will be transported to newSpider-Man: Shattered Dimensions is a thrilling action-packed adventure set in four dramatically different universes from legendary Spider-Man lore, each with a distinct Spider-Man armed with unique skills and strengths, in one original storyline.  Players will be transported to new locations never before seen in a Spider-Man game, from lush jungles and dusty deserts to various urban terrains.  Acclaimed comic book writer Dan Slott takes players on a mission to contain the magical energy of the Tablet of Order and Chaos, which has been shattered and sent hurtling across parallel universes, and battle fan-favorite villains in a quest to restore the fabric of reality.  … Expand"}, {"name": "The Sims 2: Pets", "details_link": "https://www.metacritic.com/game/playstation-2/the-sims-2-pets", "publisher": "EA Games", "release_date": "Oct 17 2006", "developers": ["Maxis"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/61690b36ec38d69e70eee968e9d6f5cd-98.jpg", "descriptions": "Sims Have New Friends - Pets! Sims can share their lives with their new pets and add more fun to the Sims experience. From dogs, cats, caged animals and more, your Sims share new friends to experience life's precious moments. With so many different animals to choose from, there’s no tellingSims Have New Friends - Pets! Sims can share their lives with their new pets and add more fun to the Sims experience. From dogs, cats, caged animals and more, your Sims share new friends to experience life's precious moments. With so many different animals to choose from, there’s no telling what unpredictable experiences could occur. Create-A-Pet: Choose from dozens of dog and cat breeds or customize features for a one-of-a-kind pet. You can even modify your pet's body shape by choosing from specific colors and unique markings. Don't like the way they act? Change their personality – from smart and sweet to silly and sloppy – anyone can create their ideal animal friend in The Sims 2 Pets. Your Sims can encourage and discipline pets, training them to shake, roll over, play dead, and more. Unruly pets might dig in the yard, claw the sofa, or topple the trash. Thankfully, a little training can go a long way. Create and control digital characters over a lifetime, setting their goals in life from popularity and romance, to fortune and family– their stories are in your hands. Use special codes to share unlockable pet accessories, fur types or markings with other The Sims 2 Pets players. Take your Sims and their pet for a romp at any of the nearby park areas, or head to the Central Town Park which is a favorite of pet owners.  While there, watch your pet play well with others while your Sim can meet others and socialize with fellow animal lovers. Visit the adjoining Town Center, a great gathering spot for Sims that evolves over time. Once you’ve seen the latest styles and decided on a purchase, deck your pet out in the latest clothing and accessories around. From geek to chic and cool to casual, your Sim can customize their pet’s look with one stop in the Town Center. [Electronic Arts]… Expand"}, {"name": "Atari Anthology", "details_link": "https://www.metacritic.com/game/xbox/atari-anthology", "publisher": "Atari", "release_date": "Nov 16 2004", "developers": ["Digital Eclipse"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/dfb1f4eb3084407bbc6ec4f21d32ed55-98.jpg", "descriptions": "Atari puts together its most popular arcade and console games in one massive collection. Now you can play classic arcade hits such as Asteroids, Centipede, Missile Command, Pong, Warlords, Crystal Castle, Gravitar, and much more. The collection also includes 62 Atari 2600 titles, includingAtari puts together its most popular arcade and console games in one massive collection. Now you can play classic arcade hits such as Asteroids, Centipede, Missile Command, Pong, Warlords, Crystal Castle, Gravitar, and much more. The collection also includes 62 Atari 2600 titles, including Adventure, Breakout, Casino, Pong, Star Raiders, and Yars' Revenge. Relive your favorite titles from the early days of video games, and take on new challenges and bonus games.… Expand"}, {"name": "Rise to Honor", "details_link": "https://www.metacritic.com/game/playstation-2/rise-to-honor", "publisher": "SCEA", "release_date": "Feb 17 2004", "developers": ["SCEA"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 68, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/9158f5cb0c6b1a5f464a02f78cb4d5d9-98.jpg", "descriptions": "Inspired by the excitement and cinematic styling of the Hong Kong action movie genre, Rise to Honor is a fast-paced action game developed in collaboration with worldwide film star Jet Li. Experience this intense action thrill ride through the seamy Hong Kong underworld as Kit utilizes all ofInspired by the excitement and cinematic styling of the Hong Kong action movie genre, Rise to Honor is a fast-paced action game developed in collaboration with worldwide film star Jet Li. Experience this intense action thrill ride through the seamy Hong Kong underworld as Kit utilizes all of his combat and strategic skills to save the family's honor.… Expand"}, {"name": "Magic: The Gathering - Battlegrounds", "details_link": "https://www.metacritic.com/game/pc/magic-the-gathering---battlegrounds", "publisher": "Atari", "release_date": "Nov 18 2003", "developers": ["Secret Level"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/025435ca1888b9c0f25cbd2a11e6ee2b-98.jpg", "descriptions": "Magic: The Gathering - Battlegrounds is filled with faithful translations of classic creatures, spells and enchantments from the premier trading card game in a visually stunning 3D game environment rife with real-time strategic fighting, devastating wizard arsenals and intense creatureMagic: The Gathering - Battlegrounds is filled with faithful translations of classic creatures, spells and enchantments from the premier trading card game in a visually stunning 3D game environment rife with real-time strategic fighting, devastating wizard arsenals and intense creature combat. In Magic: The Gathering - Battlegrounds players will choose a duelist and up to two of \"Magic's\" five colors -- red, green, white, blue, and black -- to attempt to reduce their opponent's life to zero. Of course, getting an opponent to zero will not be easy; players will have to utilize lightning reflexes, strategic brilliance and, on occasion, raw power to overcome an enemy.… Expand"}, {"name": "Whiplash", "details_link": "https://www.metacritic.com/game/xbox/whiplash", "publisher": "Eidos Interactive", "release_date": "Nov 18 2003", "developers": ["Crystal Dynamics"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/ad21d52d0154664336d31786e86b6ed3-98.jpg", "descriptions": "Join a shackled animal duo on a mission to both escape and sabotage an evil animal product-testing corporation. Ironically, the chain that links the rabbit, Redmond, to his weasel pal, Spanx, becomes their biggest weapon It can be used as a whip, a grappling hook, or a helicopter. Together,Join a shackled animal duo on a mission to both escape and sabotage an evil animal product-testing corporation. Ironically, the chain that links the rabbit, Redmond, to his weasel pal, Spanx, becomes their biggest weapon It can be used as a whip, a grappling hook, or a helicopter. Together, they'll battle a band of baddies, including a giant-syringe-toting doctor, an unsanitary surgeon, crooked rent-a-cops, vicious guard dogs, and a corrupt CEO. The more enemies you defeat, animals you free, and equipment you demolish, the further you drive the shady corporation into bankruptcy.… Expand"}, {"name": "RoadKill", "details_link": "https://www.metacritic.com/game/xbox/roadkill", "publisher": "Midway", "release_date": "Oct 13 2003", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Car Combat"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/d584547dafe8423826a9391120e8b452-98.jpg", "descriptions": "RoadKill presents an action-packed, mission-based combat driving experience.  To survive, you must out-drive, outgun and outthink rival gangs, city guards, and anyone else gunning for you in the living, post-apocalyptic territory of Hell County.  With the ability to build up a powerful gangRoadKill presents an action-packed, mission-based combat driving experience.  To survive, you must out-drive, outgun and outthink rival gangs, city guards, and anyone else gunning for you in the living, post-apocalyptic territory of Hell County.  With the ability to build up a powerful gang following, you'll unleash havoc, chaos, and destruction on the environment and its inhabitants with a wide selection of vehicles, a potent armory of weapons, and special equipment in both single-player and various multiplayer game modes.  … Expand"}, {"name": "O.R.B.: Off-World Resource Base", "details_link": "https://www.metacritic.com/game/pc/orb-off-world-resource-base", "publisher": "Strategy First", "release_date": "Nov  4 2002", "developers": ["Strategy First"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/ec3099b2e7ab21435e0177b020bdc6b5-98.jpg", "descriptions": "A visually stunning 3D real time strategy game that pits the forces of two planets against each other in an epic struggle for control of the vast asteroid belt that circles their planets. Within the concentric rings of the belt are the precious resources that both planets desperately need toA visually stunning 3D real time strategy game that pits the forces of two planets against each other in an epic struggle for control of the vast asteroid belt that circles their planets. Within the concentric rings of the belt are the precious resources that both planets desperately need to thrive. Millennia Ago, an empire spanning the galaxy collapsed after a long and brutal war. In the Aldus system, two orphaned races slowly evolved on two separate planets. Both races believed that they were unique and alone in the universe. They were soon to find out that they were neither unique nor alone. [Strategy First]… Expand"}, {"name": "Tony Tough and the Night of Roasted Moths", "details_link": "https://www.metacritic.com/game/pc/tony-tough-and-the-night-of-roasted-moths", "publisher": "Got Game Entertainment", "release_date": "Oct 31 2002", "developers": ["Prograph"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/91d2b3970199ed2a9f10c7e3bbe34713-98.jpg", "descriptions": "Don't let the small stature, over-sized raincoat and flying saucer-sized glasses fool you, Tony is a seasoned private eye for Wallen & Wallen Investigations, and he's been on the beat for ten years. Tonight, Halloween night, Tony has been assigned the case of a lifetime, he must nab theDon't let the small stature, over-sized raincoat and flying saucer-sized glasses fool you, Tony is a seasoned private eye for Wallen & Wallen Investigations, and he's been on the beat for ten years. Tonight, Halloween night, Tony has been assigned the case of a lifetime, he must nab the swollen-headed psychopath who is stealing candy from the children. [Got Game]… Expand"}, {"name": "Sega Bass Fishing Duel", "details_link": "https://www.metacritic.com/game/playstation-2/sega-bass-fishing-duel", "publisher": "Sega", "release_date": "Sep 23 2002", "developers": ["Wow Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/208a36bac1813a004926e1ae5bd08103-98.jpg", "descriptions": "You'll enjoy the addictive, arcade-style gameplay from the original hit title, plus an added level of realism. Motor out onto breathtaking, real-life lakes that change to reflect the seasons, time of day, water temperature, weather, and wind. But don't get distracted, as there's intenseYou'll enjoy the addictive, arcade-style gameplay from the original hit title, plus an added level of realism. Motor out onto breathtaking, real-life lakes that change to reflect the seasons, time of day, water temperature, weather, and wind. But don't get distracted, as there's intense action lurking just below the surface. Choose a character from a colorful cast of anglers, each with his own strengths and weaknesses and a whole lot of attitude. Then go head-to-head against your armchair angler buddy or a wily AI opponent in new split-screen competitions. What's more, the fish are even smarter this time around. Even with 100 lures and the freedom to cast anywhere, gamers will have to outwit the fish or lament the \"one that got away.\" [Sega]… Expand"}, {"name": "Scooby-Doo! Night of 100 Frights", "details_link": "https://www.metacritic.com/game/gamecube/scooby-doo!-night-of-100-frights", "publisher": "THQ", "release_date": "Sep 16 2002", "developers": ["THQ"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/786a2bb7afdfca3c8560bd1bdbc5afb6-98.jpg", "descriptions": "The Mastermind has kidnapped Mystery Inc, and it's up to Scooby-Doo to search for his lost friends. Guide Scooby through 12 huge levels that include a creepy mansion, a spooky cave, a ghostly graveyard, and a perilous pier. As you search for clues, you must avoid classic Scooby-Doo monsters,The Mastermind has kidnapped Mystery Inc, and it's up to Scooby-Doo to search for his lost friends. Guide Scooby through 12 huge levels that include a creepy mansion, a spooky cave, a ghostly graveyard, and a perilous pier. As you search for clues, you must avoid classic Scooby-Doo monsters, use wacky inventions, eat Scooby Snacks, and gather power-ups. Do you have what it takes to foil the Mastermind's plan to rid the world of Mystery Inc?… Expand"}, {"name": "Disney's Tarzan: Return to the Jungle", "details_link": "https://www.metacritic.com/game/game-boy-advance/disneys-tarzan-return-to-the-jungle", "publisher": "Activision", "release_date": "Sep 14 2002", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/0873430e8911f2f59ff089e36ff88b63-98.jpg", "descriptions": "Surf on trees, swim in swamps, swing on vines, and race mine carts down dark caves as the legendary Tarzan in an all-new adventure. Prepare for dangerous face-offs with hungry animals, tough hunters, and the evil Queen La. Get ready to rumble, 'cause it's a jungle in here! Take aSurf on trees, swim in swamps, swing on vines, and race mine carts down dark caves as the legendary Tarzan in an all-new adventure. Prepare for dangerous face-offs with hungry animals, tough hunters, and the evil Queen La. Get ready to rumble, 'cause it's a jungle in here! Take a vine-swinging, tree-surfing adventure as young and adult Tarzan, interacting with Terk, Jane, and Professor Porter. Discover evil pirate ships, abandoned mining caves, and the Lost Valley of the Dinosaurs as you explore 21 wild environments. Use your boomerang, spear, and famous animal call to help you and your jungle friends escape from danger.… Expand"}, {"name": "Ty the Tasmanian Tiger", "details_link": "https://www.metacritic.com/game/xbox/ty-the-tasmanian-tiger", "publisher": "EA Games", "release_date": "Sep 10 2002", "developers": ["Krome Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/e3738132406d876a4a17d14b2a1cbe84-98.jpg", "descriptions": "Meet TY, a fearless Tasmanian tiger in the wild and untamed Australian wilderness. Skilled in the art of boomerang combat, TY not only survives the dangerous Australian Outback, he runs, jumps, swims, and glides through it. As TY, you'll encounter more than 50 wild characters based onMeet TY, a fearless Tasmanian tiger in the wild and untamed Australian wilderness. Skilled in the art of boomerang combat, TY not only survives the dangerous Australian Outback, he runs, jumps, swims, and glides through it. As TY, you'll encounter more than 50 wild characters based on real-life indigenous animals of Australia. Not all of them are nice--so give your enemies a taste of eight different boomerangs. When you're not busy in combat, you'll solve puzzles, collect items, and participate in races.… Expand"}, {"name": "Battlecruiser Millennium", "details_link": "https://www.metacritic.com/game/pc/battlecruiser-millennium", "publisher": "3000AD, Inc.", "release_date": "Nov 18 2001", "developers": ["3000AD", "Inc."], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "General", "General"], "meta_score": 68, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/3/1314f4ff5b3d339550411c94ac1fea27-98.jpg", "descriptions": "The sequel to the critically acclaimed and industry recognized, Battlecruiser space simulation series. [3000 A.D.]"}, {"name": "Batman: Vengeance", "details_link": "https://www.metacritic.com/game/game-boy-advance/batman-vengeance", "publisher": "Ubisoft", "release_date": "Oct 30 2001", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 68, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/50d82ab0f0bd97dd5900135509270d7c-98.jpg", "descriptions": "Batman's Deepest and Darkest Handheld Adventure Yet. Brave 20 sinister levels through Gotham City's underworld. 4 intense game modes: Platform, Driving, Flyign, Puzzles. Face Mr. Freeze, Poison Ivy and over 20 different kinds of devious villains. Includes 3D slideshow and full-motion videoBatman's Deepest and Darkest Handheld Adventure Yet. Brave 20 sinister levels through Gotham City's underworld. 4 intense game modes: Platform, Driving, Flyign, Puzzles. Face Mr. Freeze, Poison Ivy and over 20 different kinds of devious villains. Includes 3D slideshow and full-motion video cinematics. Wield Batarangs, Batgrapple, \rSmoke Pellets and other sleek gear.… Expand"}, {"name": "Unison: Rebels of Rhythm & Dance", "details_link": "https://www.metacritic.com/game/playstation-2/unison-rebels-of-rhythm-dance", "publisher": "Tecmo", "release_date": "Mar 22 2001", "developers": ["Tecmo"], "platforms": "PlayStation 2", "num_players": "1-3 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/1849f845d62ac7de7dd859ba61b80c29-98.jpg", "descriptions": "The domestic incarnation of this Japanese dancing game has new movies, voice acting, and gameplay, but the plot remains the same:  in a land where dancing is fobidden, the lavender-clad Dance Doctor, assuming Kevin Bacon's role in \"Footloose,\" leads three girls in a revolution to bringThe domestic incarnation of this Japanese dancing game has new movies, voice acting, and gameplay, but the plot remains the same:  in a land where dancing is fobidden, the lavender-clad Dance Doctor, assuming Kevin Bacon's role in \"Footloose,\" leads three girls in a revolution to bring dancing back to the world.… Expand"}, {"name": "Metal Fatigue", "details_link": "https://www.metacritic.com/game/pc/metal-fatigue", "publisher": "TalonSoft", "release_date": "Jul 31 2000", "developers": ["Zono Inc."], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 68, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/9/ab561f3bb27104e3a97ffa4f73af1db7-98.jpg", "descriptions": "Choose from three warring factions; the Milagro, Neuropa, and Rimtech are competing CorpoNations, each with its own technologies and research capabilities. Build bases, research new weaponry and unit types, and engage the enemy on three different levels simultaneously! [TalonSoft]"}, {"name": "Agents of Mayhem", "details_link": "https://www.metacritic.com/game/pc/agents-of-mayhem", "publisher": "Deep Silver", "release_date": "Aug 15 2017", "developers": ["Volition Inc."], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 68, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/6214546999028a0bbc567973de9c5cb6-98.jpg", "descriptions": "In the wake of a global assault, the world has fallen under the rule of LEGION, a supervillainous cabal of criminal masterminds and costumed megalomaniacs. The only people who are capable of turning the tide are the Agents of MAYHEM. Led by Persephone Brimstone, these uniquely skilled agentsIn the wake of a global assault, the world has fallen under the rule of LEGION, a supervillainous cabal of criminal masterminds and costumed megalomaniacs. The only people who are capable of turning the tide are the Agents of MAYHEM. Led by Persephone Brimstone, these uniquely skilled agents are going to take down this New World Disorder by any means necessary. Take the fight to LEGION in Seoul: The City of Tomorrow, an open world chock full of world-shaking missions, city-spanning doomsday devices, and evil underground lairs. Take your team of three Agents into the field and swap between them on the fly for maximum mayhem. Upgrade and customize your Agents to create your personal dream team of gadget-wielding anti-heroes. Upgrade the ARK–MAYHEM HQ–to unlock even more mayhem-making means. [Deep Silver]\r… Expand"}, {"name": "Starblood Arena", "details_link": "https://www.metacritic.com/game/playstation-4/starblood-arena", "publisher": "Sony Interactive Entertainment", "release_date": "Apr 11 2017", "developers": ["WhiteMoon Dreams"], "platforms": "PlayStation 4", "num_players": "Up to 8 ", "genres": ["Action", "Simulation", "General", "Space", "Combat"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/49bada79aff236bb48934720b714abe3-98.jpg", "descriptions": "StarBlood Arena is a futuristic flight combat shooter developed for use with the PlayStation®VR headset. Players navigate battle pods in 360-degrees-of-freedom through underground arenas in close-quarters competitive and co-op multiplayer gameplay for 2 to 8 players."}, {"name": "Danger Zone 2", "details_link": "https://www.metacritic.com/game/playstation-4/danger-zone-2", "publisher": "Three Fields Entertainment", "release_date": "Jul 13 2018", "developers": ["Three Fields Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 68, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/4/0de7905924252a66fe1bf379676fa795-98.jpg", "descriptions": "Danger Zone 2 takes the crash testing action out of the Test Area and onto real public roads. A high-speed driving game featuring speed, traffic and crashes, Danger Zone 2 lets players loose onto the Freeways of the USA, the Motorways of the UK and the Autovias of Spain as they compete toDanger Zone 2 takes the crash testing action out of the Test Area and onto real public roads. A high-speed driving game featuring speed, traffic and crashes, Danger Zone 2 lets players loose onto the Freeways of the USA, the Motorways of the UK and the Autovias of Spain as they compete to cause the biggest crash.… Expand"}, {"name": "Rush: A Disney / Pixar Adventure", "details_link": "https://www.metacritic.com/game/xbox-one/rush-a-disney-pixar-adventure", "publisher": "Microsoft Game Studios", "release_date": "Oct 31 2017", "developers": ["Asobo Studio"], "platforms": ["PC", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "Party / Minigame"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/46d6212e6604d945a2443d46085ec64b-98.jpg", "descriptions": "\"Rush: A Disney / Pixar Adventure\" invites families and fans of all ages to experience the worlds of six beloved Disney Pixar films like never before. Play cooperatively and team up with characters from \"The Incredibles,\" \"Ratatouille,\" \"Up,\" \"Cars\", \"Toy Story\", and \"Finding Dory\" or a\"Rush: A Disney / Pixar Adventure\" invites families and fans of all ages to experience the worlds of six beloved Disney Pixar films like never before. Play cooperatively and team up with characters from \"The Incredibles,\" \"Ratatouille,\" \"Up,\" \"Cars\", \"Toy Story\", and \"Finding Dory\" or a friend to solve puzzles and uncover hidden secrets all remastered in 4K Ultra HD and HDR.FEATURES:* Save the day: Invite your whole family to join Woody, Lightning McQueen and others in this one-of-a-kind Pixar experience.* Cooperative play: Team up with Pixar characters to help you through each challenge or play on the same screen through split-screen couch co-op at home with a friend.* Explore and discover: Experience the sights and sounds of each Pixar world as you solve puzzles and uncover hidden secrets. Meet new friends and unlock adventures as you progress.… Expand"}, {"name": "Harvest Moon DS: Grand Bazaar", "details_link": "https://www.metacritic.com/game/ds/harvest-moon-ds-grand-bazaar", "publisher": "Natsume", "release_date": "Aug 24 2010", "developers": ["Marvelous Entertainment"], "platforms": "DS", "genres": ["Strategy", "General", "General", "Management", "Business / Tycoon"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/fcfdcc0a6938da7095a094cdd0bbb06a-98.jpg", "descriptions": "Zephyr Town's bazaar was once the grandest in the world, drawing customers and peddlers from all four corners of the Earth. These days, though, the bazaar has more tumbleweeds than customers. It's up to the player to turn its fortunes around! They'll raise animals, harvest crops, craft rareZephyr Town's bazaar was once the grandest in the world, drawing customers and peddlers from all four corners of the Earth. These days, though, the bazaar has more tumbleweeds than customers. It's up to the player to turn its fortunes around! They'll raise animals, harvest crops, craft rare delicacies, and then sell their wares at their very own shop. If players can bring prosperity back to Zephyr town, its bazaar will thrive once again, packed with exotic wares that they can purchase to expand their farm! … Expand"}, {"name": "NBA 2K21", "details_link": "https://www.metacritic.com/game/playstation-4/nba-2k21", "publisher": "2K Games", "release_date": "Sep  4 2020", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Arcade"], "meta_score": 68, "users_score": 0.9, "image": "https://static.metacritic.com/images/products/games/7/1c9de0c3f412e844ed8948ae4e5d980c-98.jpg", "descriptions": "With extensive improvements upon its best-in-class graphics and gameplay, competitive and community online features, and deep, varied game modes, NBA 2K21 offers one-of-a-kind immersion into all facets of NBA basketball and culture - where Everything is Game."}, {"name": "Blade & Soul", "details_link": "https://www.metacritic.com/game/pc/blade-soul", "publisher": "NCSOFT", "release_date": "Jan 19 2016", "developers": ["NCSOFT"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Massively Multiplayer Online", "Fantasy", "Role-Playing", "Massively Multiplayer"], "meta_score": 68, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/0/d66c5c871c0ad019dd33e417015f47a6-98.jpg", "descriptions": "Your tale of revenge unravels across a world where martial arts and mythology meet in a furious clash of fists and betrayal. The path of vengeance begins with determination. Choose one of four unique races, and use detailed character customization tools to shape your persona withYour tale of revenge unravels across a world where martial arts and mythology meet in a furious clash of fists and betrayal. The path of vengeance begins with determination. Choose one of four unique races, and use detailed character customization tools to shape your persona with near-infinite possibilities. Like the crane that soars on the wind, explore a beautiful, cinematic world as you use the power of windwalk to glide across forests, dash across rivers, and jump over mountains. See the world inspired by the distinct visual style of acclaimed artist Hyung Tae Kim as you travel the land.… Expand"}, {"name": "Cold Fear", "details_link": "https://www.metacritic.com/game/playstation-2/cold-fear", "publisher": "Ubisoft", "release_date": "Mar 15 2005", "developers": ["Darkworks"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/ce3bf6cff6b48b4df4981c4e77fe47d8-98.jpg", "descriptions": "Cold Fear is the first action-horror title under the Ubisoft brand. The game is set in a dynamic environment on a stormy sea, including intense combat, intelligent enemies, and a high element of the shockingly unexpected. Your life jacket won't be sufficient. Players step into the role ofCold Fear is the first action-horror title under the Ubisoft brand. The game is set in a dynamic environment on a stormy sea, including intense combat, intelligent enemies, and a high element of the shockingly unexpected. Your life jacket won't be sufficient. Players step into the role of Tom Hansen, a U.S. Coast Guard who is sent to board a drifting Russian whaling ship in the middle of a howling storm on the Bering Sea, who will discover there is no safe place here. On this constantly rocking and shifting ship and a mysterious oil rig, players must turn their interactive surroundings to their advantage to take down human enemies ? and enemies that aren't human any more - and save their own life. [Ubisoft]… Expand"}, {"name": "CHAOS;HEAD NOAH", "details_link": "https://www.metacritic.com/game/switch/chaoshead-noah", "publisher": "Spike Chunsoft", "release_date": "Oct  7 2022", "developers": ["Mages."], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/3e58b9c93414ff8d0397bf71b5500f80-98.jpg", "descriptions": "\"CHAOS; HEAD NOAH\", the first in the science adventure series, is here!Takumi Saijo, a second-year high school student just before withdrawal.\n\nIn Shibuya, where he lives, a series of bizarre murders broke out on the internet and on television. One day, in front of Takumi who is chatting,\"CHAOS; HEAD NOAH\", the first in the science adventure series, is here!Takumi Saijo, a second-year high school student just before withdrawal.In Shibuya, where he lives, a series of bizarre murders broke out on the internet and on television. One day, in front of Takumi who is chatting, a person who calls himself \"Shogun\" appears. At the URL he said, I see an image that predicts the next incident. The next day, Takumi encounters a terrible incident scene where he was killed as predicted.And in front of the body, a bloody girl - Rimi Sakihata - stood up...… Expand"}, {"name": "Nanotale - Typing Chronicles", "details_link": "https://www.metacritic.com/game/pc/nanotale---typing-chronicles", "publisher": "Fishing Cactus", "release_date": "Mar 31 2021", "developers": ["Fishing Cactus"], "platforms": ["Stadia", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/3cc341a238b82c73bdfd7cf6c968f976-98.jpg", "descriptions": "Something is wrong with the heart of magic. Play a young archivist venturing out into a dying world, cataloging its mysteries and its wonders to unearth the truth. Nanotale is the new adventure from the Typing Chronicles franchise and the spiritual successor to the acclaimed Epistory."}, {"name": "Hyper Scape", "details_link": "https://www.metacritic.com/game/pc/hyper-scape", "publisher": "Ubisoft", "release_date": "Aug 11 2020", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 68, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/6/fff76ac7bb4c38e353ba176f64e9aea7-98.jpg", "descriptions": "Futuristic Urban Battle Royale. Loot and fuse powerful Hacks and unique weapons in fast-paced battles, and rise to become a true champion of the Hyper Scape. Welcome to Neo Arcadia. Fight your way through the unique districts of Neo Arcadia, a virtual city featuring imposing landmarks thatFuturistic Urban Battle Royale. Loot and fuse powerful Hacks and unique weapons in fast-paced battles, and rise to become a true champion of the Hyper Scape. Welcome to Neo Arcadia. Fight your way through the unique districts of Neo Arcadia, a virtual city featuring imposing landmarks that bring verticality to the next level. Engage in high-stakes combat as you explore its streets, interiors, and rooftops. Hyper Scape offers two ways to win: Fight to be the last one standing, or capture the Crown that spawns near the end of the match. Keep possession of the Crown for long enough, and you and your squad will claim victory! [Ubisoft]… Expand"}, {"name": "MARVEL Powers United VR", "details_link": "https://www.metacritic.com/game/pc/marvel-powers-united-vr", "publisher": "Oculus Studios", "release_date": "Jul 26 2018", "developers": ["Sanzaru Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 68, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/26a3f98b8befd5b98bf5a19a9c9597ab-98.jpg", "descriptions": "Assemble your ideal Super Hero squad to defend the galaxy in explosive and immersive co-op fights across iconic Marvel locations. Unleash the strength of Black Panther, smash foes as Hulk, wield Deadpool’s katanas—or choose from a roster of 18 of Marvel’s greatest heroes. Get ready forAssemble your ideal Super Hero squad to defend the galaxy in explosive and immersive co-op fights across iconic Marvel locations. Unleash the strength of Black Panther, smash foes as Hulk, wield Deadpool’s katanas—or choose from a roster of 18 of Marvel’s greatest heroes. Get ready for battle with iconic character powers, over-the-top ultimate abilities, and a full-body transformation only possible in VR.… Expand"}, {"name": "The Spectrum Retreat", "details_link": "https://www.metacritic.com/game/pc/the-spectrum-retreat", "publisher": "Ripstone", "release_date": "Jul 13 2018", "developers": ["Dan Smith Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/e0699cde54456d9e5af977ab317ebf70-98.jpg", "descriptions": "Check-in to The Spectrum Retreat for a stay you won’t forget. Manipulate your way to the truth in this captivating narrative-driven puzzler."}, {"name": "Dark Arcana: The Carnival", "details_link": "https://www.metacritic.com/game/xbox-one/dark-arcana-the-carnival", "publisher": "Artifex Mundi", "release_date": "Mar 17 2017", "developers": ["Artifex Mundi"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Hidden Object"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/caaefb089aa45493b7c7774ec957585c-98.jpg", "descriptions": "WINNER OF THE GOLD AWARD FROM POCKETGAMER!\r An enigmatic carnival has come to town, bringing an unsettling mystery with it. A young mother has gone missing, and now its up to you to find her before its too late!\r\n\r\nInvestigate two worlds: the one you live in and an alternate plane existingWINNER OF THE GOLD AWARD FROM POCKETGAMER!\r An enigmatic carnival has come to town, bringing an unsettling mystery with it. A young mother has gone missing, and now its up to you to find her before its too late!\r Investigate two worlds: the one you live in and an alternate plane existing behind the carnivals Hall of Mirrors. Discover the secret of an ancient being named the Evil One and learn the tragic story of one of the carnivals employees, who accidentally killed his fiancee during a show many years ago. Explore picturesque yet terrifying locations and prevent the Evil One from perpetrating another terrible crime!\r TRY IT FREE, THEN UNLOCK THE FULL ADVENTURE FROM WITHIN THE GAME!\r * 48 enigmatic spine-tingling locations to visit\r* 18 hidden object scenes to search\r* 28 mini-games to tease your brain\r* 21 exciting achievements to rack up\r* Three difficulty modes to keep you guessing\r* Bonus chapter, strategy guide and extras… Expand"}, {"name": "Crimecraft: Bleedout", "details_link": "https://www.metacritic.com/game/pc/crimecraft-bleedout", "publisher": "Vogster", "release_date": "Dec  4 2010", "developers": ["Vogster"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 68, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/d7a8f7b729a1f1a056bfae0abffa286d-98.jpg", "descriptions": "Bleedout explores the complex, yet frighteningly possible, series of events that throw the world into violent chaos. It is a new Age of Ruin, caused by mankind's own greed, a new Wild Society run by criminals and outlaws, that players can explore and profit through exciting combat andBleedout explores the complex, yet frighteningly possible, series of events that throw the world into violent chaos. It is a new Age of Ruin, caused by mankind's own greed, a new Wild Society run by criminals and outlaws, that players can explore and profit through exciting combat and conspiratorial adventure.… Expand"}, {"name": "Hannspree Ten Kate Honda: SBK-07 Superbike World Championship", "details_link": "https://www.metacritic.com/game/playstation-2/hannspree-ten-kate-honda-sbk-07-superbike-world-championship", "publisher": "Valcon Games", "release_date": "Oct 29 2007", "developers": ["Milestone S.r.l"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 68, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/7b066473eb8e1051cb74570cdd117a1c-98.jpg", "descriptions": "(Currently available in the UK/EU only)  SBK-07 is the official Superbike World Championship videogame so it allows you to enter the fantastic SBK championship. The game is fully licensed and simulates every aspect of this world, from the physics (that give to you the sensation to really(Currently available in the UK/EU only)  SBK-07 is the official Superbike World Championship videogame so it allows you to enter the fantastic SBK championship. The game is fully licensed and simulates every aspect of this world, from the physics (that give to you the sensation to really ride a racing motorbike) to the behaviour of the opponents and offers all the official races, sessions, teams and riders of the real series.Everybody has the possibility to improve the performances of his bike, managing and tuning a lot of aspects like top speed, gear ratios, suspension stiffness and choosing the better set of tires for the single race. Fetures 22 bikes and 22 racers simultaneously on track (14 on PSP version); 11 official Superbike Championship tracks (10 on PSP version); 4 game modes: Quick Race, Race weekend, Championship and Challenge; 4 variable weather conditions\rAccurate  physics model built on real data and validated with Superbike support; Realistic riders behaviours; Quick and intuitive settings. A unique rewarding system including: racers, tracks, bonus video, historical features. And all the beautiful Pit Girls of Superbike World Championship. [Black Bean Games]… Expand"}, {"name": "Ghostbusters: Spirits Unleashed", "details_link": "https://www.metacritic.com/game/playstation-5/ghostbusters-spirits-unleashed", "publisher": "IllFonic", "release_date": "Oct 18 2022", "developers": ["IllFonic"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/fb19d33e0432ca15609ff1f543040f49-98.jpg", "descriptions": "Ghostbusters: Spirits Unleashed is coming to a platform near you. As a Ghostbuster, join with other Ghostbusters to chase and trap ghosts in museums, prisons, hotels, and more, and capture the ghosts before they can fully haunt the areas. Or, as the Ghost, hide, sneak, surprise, scare, andGhostbusters: Spirits Unleashed is coming to a platform near you. As a Ghostbuster, join with other Ghostbusters to chase and trap ghosts in museums, prisons, hotels, and more, and capture the ghosts before they can fully haunt the areas. Or, as the Ghost, hide, sneak, surprise, scare, and of course, slime Ghostbusters and civilians until the everything has gone completely spooky. Use trickery, deception, and Ectoplasm to gain the upper hand and drive the Ghostbusters out.… Expand"}, {"name": "Serial Cleaners", "details_link": "https://www.metacritic.com/game/pc/serial-cleaners", "publisher": "505 Games", "release_date": "Sep 22 2022", "developers": ["Draw Distance"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/d1e0f8ca1892a55a74581264885db69d-98.jpg", "descriptions": "New York City, New Year's Eve 1999. An unlikely team of four professional cleaners for the mob gathers to drink and reminisce about their careers at the turn of the millenium. As the details of their stories stop matching up, the ugly truth behind their cooperation begins to reveal itself.New York City, New Year's Eve 1999. An unlikely team of four professional cleaners for the mob gathers to drink and reminisce about their careers at the turn of the millenium. As the details of their stories stop matching up, the ugly truth behind their cooperation begins to reveal itself. What starts as a celebration of a decade of shared history slowly turns into a tense and dangerous standoff.\r An homage to 90s cinema - from Tarantino's classics through cult crime thrillers to B-movie action favorites and more - Serial Cleaners remixes those familiar places, characters and scenes into its own unique spin on a decade full of brightly colored optimism... and the grime underneath it all. \r\rChoose your path through the non-linear story by picking the part of the narrative you want to hear next, and then approach each mission as carefully or brazenly as you like. Utilize stealth, exploration and speed as the situation and your preferred experience warrants it. Get rid of the bodies and other damning evidence to wipe the decade's slate clean before the new millenium comes!… Expand"}, {"name": "Espire 1: VR Operative", "details_link": "https://www.metacritic.com/game/pc/espire-1-vr-operative", "publisher": "Tripwire Interactive", "release_date": "Nov 22 2019", "developers": ["Digital Lode"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/a6ab713a6f72957c51e5c9ca78af686f-98.jpg", "descriptions": "The definitive VR stealth experience, Espire 1: VR Operative drafts players as drone operators of the future. Players become “Espire Agents” and use cutting edge Virtual Reality hardware to remote-operate the Espire model 1 from the safety of their “Control Theatre.”"}, {"name": "Mercenaries Saga Chronicles", "details_link": "https://www.metacritic.com/game/switch/mercenaries-saga-chronicles", "publisher": "CIRCLE Entertainment", "release_date": "Feb  8 2018", "developers": ["RideonJapan,Inc."], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Compilation", "Tactics"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/26185f10b3f4ae7f47f1d7d4a0a8a98d-98.jpg", "descriptions": "Featuring Mercenaries Saga: Will of the White Lions, Mercenaries Saga 2: Order of the Silver Eagle and Mercenaries Saga 3: Gray Wolves of War, Mercenaries Saga Chronicles assembles the heroes from this fantastic series in one collection."}, {"name": "One Piece: Unlimited World Red - Deluxe Edition", "details_link": "https://www.metacritic.com/game/playstation-4/one-piece-unlimited-world-red---deluxe-edition", "publisher": "Bandai Namco Games", "release_date": "Aug 25 2017", "developers": ["Ganbarion"], "platforms": ["PC", "Switch", "PlayStation 4"], "genres": ["Action", "Action Adventure", "General"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/9500b6cb32701c42baa79fe536e2ba84-98.jpg", "descriptions": "Set sail on this grand One Piece adventure. A unique One Piece adventure to be enjoyed in co-op, with characters designed by Eiichiro Oda and a game-exclusive scenario.\r The Straw Hat Pirates encounter and befriend a cheerful yet mysterious raccoon named Pato who possesses a shadowy powerSet sail on this grand One Piece adventure. A unique One Piece adventure to be enjoyed in co-op, with characters designed by Eiichiro Oda and a game-exclusive scenario.\r The Straw Hat Pirates encounter and befriend a cheerful yet mysterious raccoon named Pato who possesses a shadowy power to create anything drawn onto a leaf. In order to help their new friend, the Straw Hat Pirates agree to assist Pato on an ambiguous mission to meet someone Pato then leads the crew to the Forgotten Island where all the Straw Hat Pirates except Luffy are successively kidnapped by a wicked pirate named The Red Count, who had escaped the lower depths of Impel Down two years ago. With Pato's help, Luffy must fight to recover his crew from the enemy's grasp and find out exactly what The Red Count's evil plots are...… Expand"}, {"name": "Inside My Radio", "details_link": "https://www.metacritic.com/game/pc/inside-my-radio", "publisher": "Iceberg Interactive", "release_date": "May 11 2015", "developers": ["Seaven Studio"], "platforms": ["PlayStation 4", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/ab85f9fb8ae8e4891bb7a06304ebb165-98.jpg", "descriptions": "Can you beat the beat? Journey as a green LED mysteriously trapped inside a dying boombox and play the ultimate musical experience. In this rhythmic platform adventure where your every action needs to be right on the beat, bring electro, dub and disco music back to life."}, {"name": "Silent Hill: Downpour", "details_link": "https://www.metacritic.com/game/xbox-360/silent-hill-downpour", "publisher": "Konami", "release_date": "Mar 13 2012", "developers": ["Konami"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/1081b67a6d9a0a9c413adf86dda00686-98.jpg", "descriptions": "The survival horror experience begins after a prison transport vehicle careens off the road, leaving lone inmate Murphy Pendleton stranded in Silent Hill.  Gamers will encounter mind-bending puzzles, as well as horrific creatures and other world terrors using everyday objects from woodenThe survival horror experience begins after a prison transport vehicle careens off the road, leaving lone inmate Murphy Pendleton stranded in Silent Hill.  Gamers will encounter mind-bending puzzles, as well as horrific creatures and other world terrors using everyday objects from wooden chairs to glass bottles to fend off their enemies.  The natural response, fight or flight is left to the player as they unravel a dark, thought-provoking storyline which will appeal to fans of the early, classic Silent Hill series, as well as anyone who enjoys a deep, psychological horror experience.  In addition to the main storyline, players will also be presented with variable side quests along the way that can change depending on their play style, revealing unknown evils within the town.… Expand"}, {"name": "Nikopol: Secrets of the Immortals", "details_link": "https://www.metacritic.com/game/pc/nikopol-secrets-of-the-immortals", "publisher": "Got Game Entertainment", "release_date": "Sep 20 2008", "developers": ["White Birds Productions"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 68, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/fb57e98903ebd6ad6d17224406f1152b-98.jpg", "descriptions": "A father returns. A son searches. Gods rule. From the art and stories of famed graphic novelist and filmmaker Enki Bilal, and the studio created by adventure game legend Benoit Sokal comes Nikopol: Secrets of the Immortals. As Nikopol you find yourself in a suspenseful adventure to find yourA father returns. A son searches. Gods rule. From the art and stories of famed graphic novelist and filmmaker Enki Bilal, and the studio created by adventure game legend Benoit Sokal comes Nikopol: Secrets of the Immortals. As Nikopol you find yourself in a suspenseful adventure to find your father and thwart a dangerous conspiracy. Entangled in political intrigue you are caught between two worlds, one of anarchy and one of Immortality. [Got Game Entertainment]… Expand"}, {"name": "UEFA EURO 2008", "details_link": "https://www.metacritic.com/game/psp/uefa-euro-2008", "publisher": "Electronic Arts", "release_date": "May 19 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/dbbbcae5c2abe98f9842b320d2c5a3eb-98.jpg", "descriptions": "UEFA EURO 2008 captures the look and feel of the journey from qualification to the finals with rain and mud dynamics that impact playing conditions, real-time player ratings that change based on player performance, and a penalty kick mode that re-creates the elation and agony of a penaltyUEFA EURO 2008 captures the look and feel of the journey from qualification to the finals with rain and mud dynamics that impact playing conditions, real-time player ratings that change based on player performance, and a penalty kick mode that re-creates the elation and agony of a penalty shoot-out as if you were on the pitch. Experience the thrill of scoring the goal that sends your country through to the next round and then choose how to celebrate it with all-new interactive user-controlled celebrations. Captain your country, play alongside your heroes, and inspire them to championship glory in the official videogame of UEFA EURO 2008. A new game mode called Captain Your Country enables gamers to customize them on the pitch and wear the shirt of their national team. Work through eight status levels to earn the captaincy of your team and then lead your country into battle for championship glory against your rivals. Go online in Battle of the Nations to earn status points for yourself and your country in a competition for global supremacy. Go for the biggest upsets to earn the most points and then watch you and your country move up the leader boards. Face the challenge and pressure of competing in the championship rounds in the EURO Online Knockout Draw to test your skills against the world's best. [Electronic Arts]… Expand"}, {"name": "The Technomancer", "details_link": "https://www.metacritic.com/game/xbox-one/the-technomancer", "publisher": "Focus Home Interactive", "release_date": "Jun 28 2016", "developers": ["Spiders"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Western-Style"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/a2b9165f85926c453e78535132c43425-98.jpg", "descriptions": "Spiders are back with The Technomancer, a new post-apocalyptic RPG set in a cyberpunk world for PlayStation 4, Xbox One and PC set on Mars during the War of Water, where an aspiring Technomancer faces a myriad of questions as his future grows threatened by the secrets of his past."}, {"name": "Gungnir", "details_link": "https://www.metacritic.com/game/psp/gungnir", "publisher": "Atlus", "release_date": "Jun 12 2012", "developers": ["Sting"], "platforms": "PSP", "genres": ["Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/6c04584c0c4ffc3fb48f7ca2447ff16f-98.jpg", "descriptions": "In a land ravaged by disparity where the impoverished must battle for survival, the fate of all is thrust into uncertainty when rebels happen upon custody of a young female noble and a magical spear of immeasurable power falls from the heavens.  Now, hunted by incumbent powers desperate toIn a land ravaged by disparity where the impoverished must battle for survival, the fate of all is thrust into uncertainty when rebels happen upon custody of a young female noble and a magical spear of immeasurable power falls from the heavens.  Now, hunted by incumbent powers desperate to reclaim the girl and armed with a weapon capable of reshaping the realm, the Resistance must wage war to deliver themselves from the tyranny of their oppressors.\r As original as its narrative, Gungnir's strategy RPG mechanics offer a number of fresh twists on an expertly honed formula.  Building upon the traditional action queue of turn-based strategy RPGs, actions in Gungnir all have a numerical wait interval associated with them.  Faster actions bear smaller numbers, allowing them to precede slower preexisting attacks.  Should the player wish, they may sacrifice tactical points, which afford them more combat options, in order to accelerate actions.  This classic balance of risk and reward, a staple of Sting titles, enriches the Gungnir's deep strategic battles and gives the player far more critical decisions to weigh.… Expand"}, {"name": "Prinny 2: Dawn of Operation Panties, Dood!", "details_link": "https://www.metacritic.com/game/psp/prinny-2-dawn-of-operation-panties-dood!", "publisher": "NIS America", "release_date": "Jan 10 2011", "developers": ["Nippon Ichi Software"], "platforms": ["Switch", "PSP"], "num_players": "2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/fb128813daeaa8d62f56a2bd18ed9f21-98.jpg", "descriptions": "Prinny 2: Dawn of Operation Panties, Dood! is a sequel to Nippon Ichi Software's action game starring the unlikely hero Prinny."}, {"name": "Zoo Tycoon", "details_link": "https://www.metacritic.com/game/xbox-one/zoo-tycoon", "publisher": "Microsoft Game Studios", "release_date": "Nov 22 2013", "developers": ["Frontier Developments"], "platforms": ["Xbox 360", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Tycoon", "Strategy", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 68, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/5/fbbba053513d46dcad85219807fc466d-98.jpg", "descriptions": "Let your imagination go bananas with Zoo Tycoon. Build your dream zoo alone or with up to 4 of your friends on Xbox LIVE, choosing from over 100 visually stunning animals and a large, detailed selection of environments. Become a member of the community by uploading your creation to the cloudLet your imagination go bananas with Zoo Tycoon. Build your dream zoo alone or with up to 4 of your friends on Xbox LIVE, choosing from over 100 visually stunning animals and a large, detailed selection of environments. Become a member of the community by uploading your creation to the cloud and working together with other Tycoons to care for and share your animals. With intuitive, easy-to-use controls and Kinect-enabled features that allow your animals to recognize your voice and react to your movements, this zoo simulation will charm animal lovers of all ages. … Expand"}, {"name": "Cloudberry Kingdom", "details_link": "https://www.metacritic.com/game/xbox-360/cloudberry-kingdom", "publisher": "Ubisoft", "release_date": "Jul 31 2013", "developers": ["Pwnee Studios"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/581766bc218c9503f6a3bf2c98f217c6-98.jpg", "descriptions": "Cloudberry Kingdom, the land where good heroes go to die, and Bob is the best of them all. Bob sits on the precipice of retirement, recliner ready, but first he must get back what he lost years ago. Jump and dodge your way through billions of levels on a last ditch mission to conquerCloudberry Kingdom, the land where good heroes go to die, and Bob is the best of them all. Bob sits on the precipice of retirement, recliner ready, but first he must get back what he lost years ago. Jump and dodge your way through billions of levels on a last ditch mission to conquer infinity. The quest was never over. The princess was never saved. A challenge is waiting, are you ready?… Expand"}, {"name": "Rune Factory 5", "details_link": "https://www.metacritic.com/game/switch/rune-factory-5", "publisher": "XSEED Games", "release_date": "Mar 22 2022", "developers": ["Neverland", "HAKAMA"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/6b6346a10105300dc21ff4571bee5df0-98.jpg", "descriptions": "A new stage, a new adventure... The curtain rises on the next chapter in the Rune Factory series. Set off on a grand adventure in a fantasy world with the latest entry in the Rune Factory simulation RPG series. After losing their memory, the hero lands in a small town blessed by nature.A new stage, a new adventure... The curtain rises on the next chapter in the Rune Factory series. Set off on a grand adventure in a fantasy world with the latest entry in the Rune Factory simulation RPG series. After losing their memory, the hero lands in a small town blessed by nature. There, they are recruited into a band of peacekeeping rangers, and their new life begins. In addition to their normal duties, the hero can farm the land, cast a line into the nearby river, and so much more! Team up with townsfolk to battle monsters and unleash powerful combination attacksjust one of the features new to the series. The stage is set, and the curtain rises on an exciting new adventure in Rune Factory 5!\r Features:\r * Tame monsters or team up with townsfolk to explore a massive world\r* Defend the frontier and support your community as a member of a peacekeeping ranger\r* Unleash uniquely powerful combo attacks with your teammates \r* Cultivate crops in the fields\r* Find friendship, love, and family with a colorful cast of characters… Expand"}, {"name": "RPGolf Legends", "details_link": "https://www.metacritic.com/game/switch/rpgolf-legends", "publisher": "Kemco", "release_date": "Jan 20 2022", "developers": ["ArcticNet"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/f67b6780fb65ab751be3a94f3703f6e1-98.jpg", "descriptions": "Become the legend in this golf-action-adventure and save golf in the world!\r An evil force has sealed all the golf holes in the world! Join forces with the spirit of a golf club and embark on a fantastic action-golfing adventure to save golf in the world!\r\n\r\nTravel around in a uniqueBecome the legend in this golf-action-adventure and save golf in the world!\r An evil force has sealed all the golf holes in the world! Join forces with the spirit of a golf club and embark on a fantastic action-golfing adventure to save golf in the world!\r Travel around in a unique open-world where monsters and golf coexist, get your best scores in 6 unique environments and beat monsters! When you are resting, do not forget to help people with their quests... every encounter counts!\r Thanks to the class system, you will also get new skills, special items and a brand new look!\rWhether you spend your time golfing, fishing, crafting or exploring... is entirely up to you.\r A fantastic journey is about to start!\r… Expand"}, {"name": "Demon Turf", "details_link": "https://www.metacritic.com/game/pc/demon-turf", "publisher": "Fabraz", "release_date": "Nov  4 2021", "developers": ["Fabraz"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/a58729d31058bdc3969c74b22e02a83f-98.jpg", "descriptions": "The Demon World is inhabited by all kinds of nasties... Most of them lumped into gangs battling for dominion, each led by its own head honcho. Yet even these bad dudes are no match for the Demon King himself! Instead, the task falls to Beebz, a young demon barely a thousand years old, whoThe Demon World is inhabited by all kinds of nasties... Most of them lumped into gangs battling for dominion, each led by its own head honcho. Yet even these bad dudes are no match for the Demon King himself! Instead, the task falls to Beebz, a young demon barely a thousand years old, who decides it’s time for her to kick every turf leader’s butt and become the Demon Queen herself.… Expand"}, {"name": "Wallachia: Reign of Dracula", "details_link": "https://www.metacritic.com/game/switch/wallachia-reign-of-dracula", "publisher": "Pixelheart", "release_date": "Oct 29 2020", "developers": ["Migami Games"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/05074cb29113ee069936223e510970c1-98.jpg", "descriptions": "Fast-paced! Non-stop action! Retro-style! A platform game inspired by great video game classics (Castlevania). Full of shooting and deadly traps that will quench your thirst for blood.\r FEATURES:\r\n▪ 100% of retro,\r\n▪ 100% of action,\r\n▪ 7 action-packed levels,\r\n▪ story based on Vlad theFast-paced! Non-stop action! Retro-style! A platform game inspired by great video game classics (Castlevania). Full of shooting and deadly traps that will quench your thirst for blood.\r FEATURES:\r▪ 100% of retro,\r▪ 100% of action,\r▪ 7 action-packed levels,\r▪ story based on Vlad the Impaler,\r▪ waves of enemies to fight,\r▪ bosses that won't give you a chance,\r▪ minigames, unlockables and bonuses (e.g. exclusive bonus from Bloodstained Ritual of the Night),\r▪ full English voiceover by professional actors (Kira Buckland and Robert Belgrade),\r▪ unique & ultra ambient soundtrack!\r ABOUT THE GAME:\rWallachia: Reign of Dracula is an action & shooter platformer inspired by great video game classics (e.g. Castlevania).\rThe game will challenge your reflex, aim and agility skills.\rIt's unparalleled difficulty will satisfy fans of old-school, unforgiving and complex gameplay.\rWatch out for enemies attacking you from every direction, hidden traps and ruthless bosses!\rThe game has a full, professional voice-over by professional actors, Kira Buckland and Robert Belgrade.\rYou will enjoy a unique soundtrack and story revolving around the one and only true vampire - Vlad the Impaler.\r Thirsty for some blood?\rThen get ready for a brutal, yet satisfying adventure!\rTravel through the land of Wallachia and face the forces of Vlad Dracula!\r… Expand"}, {"name": "Stela", "details_link": "https://www.metacritic.com/game/pc/stela", "publisher": "SkyBox Labs", "release_date": "Mar 13 2020", "developers": ["SkyBox Labs"], "platforms": ["iPhone/iPad", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/9200bea67b3e14ec561a4916c5e91c16-98.jpg", "descriptions": "Stela is a cinematic, atmospheric platformer about a young woman witnessing the final days of a mysterious ancient world."}, {"name": "Call of Cthulhu: The Official Video Game", "details_link": "https://www.metacritic.com/game/switch/call-of-cthulhu-the-official-video-game", "publisher": "Focus Home Interactive", "release_date": "Oct  8 2019", "developers": ["Cyanide", "Saber3D"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Survival"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/bfb5ccdecfecef92ec64bcb431993708-98.jpg", "descriptions": "Plunge into Cyanide Studio's Call of Cthulhu, the official Cthulhu videogame inspired by Chaosium's classic pen and paper RPG. Uncover the chilling mysteries of this RPG-investigation game, descending deep into a world of cosmic horrors, creeping madness, and shrouded Old Gods withinPlunge into Cyanide Studio's Call of Cthulhu, the official Cthulhu videogame inspired by Chaosium's classic pen and paper RPG. Uncover the chilling mysteries of this RPG-investigation game, descending deep into a world of cosmic horrors, creeping madness, and shrouded Old Gods within Lovecraft's iconic universe.The Cthulhu Mythos has been fascinating audiences for generations, growing to become one of the largest shared universes ever envisioned and giving birth to countless stories, novels, movies, tabletop and videogames since the original publication of H.P. Lovecraft's The Call of Cthulhu. Adaptions and references have formed a widespread legacy stretching back to the very beginning of the 20th century, latching on to the key fear of the human psyche: that of the unknown. Now, Call of Cthulhu will bring the mythos to life like never before, on PlayStation 4, Xbox One and PC.In this world, nothing is as it seems. Sanity is an irregular bedfellow, all too often replaced by the whisperings in the dark. Strange creatures, weird science, and shadowy cults dominate the Cthulhu Mythos, intent on realizing their mad schemes to bring about the end of everything. Your mind will suffer -- balancing a razor-thin line between sanity and madness, your senses will be disrupted until you question the reality of everything around you. Trust no one. Creeping shadows hide lurking figures... and all the while, the Great Dreamer prepares for his awakening.… Expand"}, {"name": "Killing Floor: Incursion", "details_link": "https://www.metacritic.com/game/playstation-4/killing-floor-incursion", "publisher": "Tripwire Interactive", "release_date": "May  1 2018", "developers": ["Tripwire Interactive"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Shooter", "First-Person", "Light Gun", "Arcade"], "meta_score": 68, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/222513e6a463ab2e24eda944b750aaf2-98.jpg", "descriptions": "From Tripwire Interactive, makers of Red Orchestra and Killing Floor franchises, comes a multi-chapter, story-driven adventure made specifically for VR. Explore this detailed and immersive world alone or with a partner while fighting for your life with pistols, shotguns, axes, and even theFrom Tripwire Interactive, makers of Red Orchestra and Killing Floor franchises, comes a multi-chapter, story-driven adventure made specifically for VR. Explore this detailed and immersive world alone or with a partner while fighting for your life with pistols, shotguns, axes, and even the occasional leftover limb. Travel through diverse environments, from creepy farmhouses to mysterious catacombs, in order to uncover who or what is behind the Zed menace. Discover what the Horzine Corporation is really up to and be careful who you trust.When it's all over, invite a friend to go back with you and see if you can pull them through alive. Good luck!Key Features* Co-Op Play: When the going gets tough, bring a friend! Play co-op with a friend in both Story and Holdout modes.* Narrative Campaign: Play through the five-stage, fully voiced story campaign to uncover the secrets behind Horzine and their relationship with the Zeds.* Holdout - Endless Game Mode: See how long you can last against the Zeds in this endless mode! Increasingly tough groups of Zeds are thrown at you until you finally succumb. A new weapon, special power ups, and other mechanics are available in this mode.* Visceral Gore: The Zeds you attack don't just die; they get decapitated and dismembered as heads and limbs go flying, all covered in blood. You can even pick up these Zed bits and use them as weapons!* Immersive Environments: Five different environments to explore, from high tech virtual training facilities to dilapidated trailer parks, each with its own threats and story.* A Variety of Weapons: Chop, slash, shoot, and blast your way through hordes of Zeds with weapons ranging from fire axes to sniper rifles. Each level introduces new options for violence.* Terrifying Zeds: Some Zeds stumble, some crawl, some sprint, and some shoot at you with plasma cannons! Each Zed has its own tactics, strengths, and weaknesses that you must learn if you want to survive.* New control options: Now includes options to use Espire Control Theater as well as a new Free Move system.… Expand"}, {"name": "Black The Fall", "details_link": "https://www.metacritic.com/game/xbox-one/black-the-fall", "publisher": "Square Enix", "release_date": "Jul 11 2017", "developers": ["Sand Sailor Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/f271bc0e8c7fde7c906440552f23f753-98.jpg", "descriptions": "After decades of toil, an old machinist plots his escape from the oppressive grasp of the Communist regime. Through hidden passages, shadow and grief, he struggles. Ingenuity, reflexes and deception are his tools."}, {"name": "Heart&Slash", "details_link": "https://www.metacritic.com/game/xbox-one/heartslash", "publisher": "Badland Games", "release_date": "Jun 24 2016", "developers": ["AHEARTFULOFGAMES"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "General", "Beat-'Em-Up", "3D"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/aba8cb5e4687b0334d482b0ecec0273d-98.jpg", "descriptions": null}, {"name": "Q.U.B.E. Director's Cut", "details_link": "https://www.metacritic.com/game/wii-u/qube-directors-cut", "publisher": "Toxic Games", "release_date": "Sep 10 2015", "developers": ["Toxic Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Logic"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/157f4c78c6cbe4b401f6c98962ea5d52-98.jpg", "descriptions": "Q.U.B.E: Director's Cut is a brain-twisting first-person puzzler. Using special high-tech gloves, you manipulate the environment around you  build bridges, shift walls, open new paths - in order to journey deep into a mysterious giant cube hurtling through space towards Earth and destroy itQ.U.B.E: Director's Cut is a brain-twisting first-person puzzler. Using special high-tech gloves, you manipulate the environment around you  build bridges, shift walls, open new paths - in order to journey deep into a mysterious giant cube hurtling through space towards Earth and destroy it from within before it eradicates all life on our planet! This Directors Cut version contains an all new story and dialogue by the award-winning writer Rob Yescombe, and Against the Qlock time trials levels that will test your puzzle-solving skills as well as your speed and adaptability.\r- Story by the award-winning Rob Yescombe\r- Challenging and unusual puzzles\r- New time-trial mode with 10 levels\r- Brand new original music score… Expand"}, {"name": "Master Spy", "details_link": "https://www.metacritic.com/game/pc/master-spy", "publisher": "TURBOGUN", "release_date": "Sep  8 2015", "developers": ["TURBOGUN"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/0d5cedd393849986b4cb0b09850a3ce4-98.jpg", "descriptions": "Master Spy is a stealth-based precision platformer with retro cut-scenes full of espionage, intrigue, and betrayal."}, {"name": "Shad'O", "details_link": "https://www.metacritic.com/game/pc/shado", "publisher": "Okugi Studio", "release_date": "Sep  4 2012", "developers": ["Okugi Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "Defense"], "meta_score": 68, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/98c5f52df5377a4aedd323732ca33a32-98.jpg", "descriptions": "Shad'O is a unique Tower defense game that will immerse you in the story of William, a 9-year-old boy lost in his own mind, fighting to save his memory. He will get help from his luminous companions in his struggle to remember what happened to him."}, {"name": "Castlevania: Harmony of Despair", "details_link": "https://www.metacritic.com/game/playstation-3/castlevania-harmony-of-despair", "publisher": "Konami", "release_date": "Sep 27 2011", "developers": ["Konami"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/281dcd72cc52ead40bb77b4d408f5e7a-98.jpg", "descriptions": "Dracula returns in Castlevania Harmony of Despair, with the second launch of the title this time for PlayStation Network. Featuring the classic fast paced 2D, side scrolling action the series is known for, fan favorite vampire hunters from across the series will join forces to returnDracula returns in Castlevania Harmony of Despair, with the second launch of the title this time for PlayStation Network. Featuring the classic fast paced 2D, side scrolling action the series is known for, fan favorite vampire hunters from across the series will join forces to return Dracula, the Lord of Darkness, to his eternal slumber.\r The game allows up to 6 friends to play together via online co-op story mode or see who the best vampire hunter is in Survival Mode, which challenges players to fend off their friends while fighting for their very survival. Utilize your co-op skills to explore the levels with your friends in order to find hidden locations with special items and equipment or team up in battle to let loose destructive attacks on the hordes of attacking creatures.… Expand"}, {"name": "F1 2009", "details_link": "https://www.metacritic.com/game/psp/f1-2009", "publisher": "Codemasters", "release_date": "Nov 16 2009", "developers": ["Sumo Digital"], "platforms": ["iPhone/iPad", "PSP"], "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/608dc28efdac9806d1065219d62c2e80-98.jpg", "descriptions": "(Also known as \"Formula One 2009\")  F1 2009 offers a fully authentic FIA Formula One championship experience with all the teams, drivers, cars and tracks from the 2009 season."}, {"name": "Stoked", "details_link": "https://www.metacritic.com/game/xbox-360/stoked", "publisher": "Destineer", "release_date": "Feb 26 2009", "developers": ["Bongfish"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/8696e8b0b03c26c7496925a6f2ade0ea-98.jpg", "descriptions": "Head into the backcountry and experience Stoked, the open-world snowboarding game that lets you choose where, when and in what conditions you want to ride as you work your way up the ranks of the sports to become the hottest rider in the world! Every single inch of five huge mountains can beHead into the backcountry and experience Stoked, the open-world snowboarding game that lets you choose where, when and in what conditions you want to ride as you work your way up the ranks of the sports to become the hottest rider in the world! Every single inch of five huge mountains can be explored, complete with dynamic weather conditions that change how and where you can ride. Set a trend with Style Crafting as other riders on the mountain adapt to mimic how you ride and how you dress.… Expand"}, {"name": "Sherlock Holmes: The Silver Earring", "details_link": "https://www.metacritic.com/game/pc/sherlock-holmes-the-silver-earring", "publisher": "Ubisoft", "release_date": "Sep 28 2004", "developers": ["Frogwares"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 68, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/b33551e0ddf217b24acb4f739f49a14b-98.jpg", "descriptions": "(Also known as \"Sherlock Holmes: The Case of the Silver Earring\")  London 1895: A wealthy construction tycoon lies dead in his mansion. Join Sherlock Holmes and Dr. Watson as they interview suspects, investigate the crime scene and uncover family secrets that might point to the murderer.(Also known as \"Sherlock Holmes: The Case of the Silver Earring\")  London 1895: A wealthy construction tycoon lies dead in his mansion. Join Sherlock Holmes and Dr. Watson as they interview suspects, investigate the crime scene and uncover family secrets that might point to the murderer. Play one of the most intriguing and captivating plots ever created for the Sherlock Holmes character. Clues will take players to Brazil, India, and more than 40 19th-century London locations. Developed by Frogwares Studio, Secret of the Silver Earring allows players to experience a new murder-mystery adventure featuring the investigative skills of world?s most famous detective, Sherlock Holmes.  The game features over 30 investigating hours and five graphically rich levels that bring the fog-laced streets of London to life. Each level requires players to question witnesses, investigate potential suspects and uncover clues. Players will consider the evidence at the end of each level and put their powers of deduction to the test. Play as Sherlock Holmes and Dr. Watson in an original storyline inspired by Arthur Conan Doyle?s \"The Adventures of Sherlock Holmes.\" [Ubisoft]… Expand"}, {"name": "Earth Defense Force 2025", "details_link": "https://www.metacritic.com/game/xbox-360/earth-defense-force-2025", "publisher": "D3Publisher", "release_date": "Feb 18 2014", "developers": ["Sandlot"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Shooter", "Sci-Fi", "Action", "Shooter", "Third-Person", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/56ef2bf0cd38054346a696f46890c847-98.jpg", "descriptions": "Earth Defense Force 2025 is the long awaited follow-up in the Earth Defense Force (EDF) series from Japanese developer Sandlot. The insects return from dormancy to end humanity with over-the-top action and massive city-leveling explosions that will entrench the EDF and the citizens of EarthEarth Defense Force 2025 is the long awaited follow-up in the Earth Defense Force (EDF) series from Japanese developer Sandlot. The insects return from dormancy to end humanity with over-the-top action and massive city-leveling explosions that will entrench the EDF and the citizens of Earth into a state of emergency.… Expand"}, {"name": "Utawarerumono: Mask of Deception", "details_link": "https://www.metacritic.com/game/playstation-4/utawarerumono-mask-of-deception", "publisher": "Aqua Plus", "release_date": "May 23 2017", "developers": ["Aqua Plus"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "genres": ["Strategy", "Adventure", "Turn-Based", "General"], "meta_score": 68, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/524569d28e8c1638390420746269f283-98.jpg", "descriptions": "Utawarerumono: Mask of Deception is a grand tale that will enchant the hearts and minds of players as it takes them on an incredible journey. With a beautiful visual novel story experience, intriguing characters, fast-paced SRPG combat, world-class soundtrack, and more, the game is theUtawarerumono: Mask of Deception is a grand tale that will enchant the hearts and minds of players as it takes them on an incredible journey. With a beautiful visual novel story experience, intriguing characters, fast-paced SRPG combat, world-class soundtrack, and more, the game is the perfect escape for adventure gamers!\r Mask of Deception begins atop a snowy mountain where the protagonist awakens in an unfamiliar wilderness, surrounded by deadly creatures, with nothing but a hospital gown and a splitting headache. However, hes rescued by a beautiful girl named Kuon, who sports both adorable animal ears and a beastlike tail. Finding that the hapless man has no memory of anything, Kuon decides to take the amnesiac into her care, naming him Haku. As their journey takes them across the land, Haku will encounter colorful characters, build deep relationships, battle ruthless enemies, and find himself inexorably dragged into the political machinations of the mighty nation of Yamato.… Expand"}, {"name": "Joust", "details_link": "https://www.metacritic.com/game/xbox-360/joust", "publisher": "Midway", "release_date": "Nov 22 2005", "developers": ["Digital Eclipse"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/7ff8a7a648ddde6315101001044b4794-98.jpg", "descriptions": "[Xbox Live Arcade]  Mount thy noble ostrich and ride forth into battle in the classic arcade game Joust! If you choose to venture with a friend, your companion shall ride a proud stork. Together, defeat three types of enemy knights: red Bounders, silver Hunters, and dark blue Shadow Lords.[Xbox Live Arcade]  Mount thy noble ostrich and ride forth into battle in the classic arcade game Joust! If you choose to venture with a friend, your companion shall ride a proud stork. Together, defeat three types of enemy knights: red Bounders, silver Hunters, and dark blue Shadow Lords. As these villains fly through the caves atop swift-winged buzzards, strike them from above with your trusty lance. Capture the resulting eggs before they hatch or even stronger foes will emerge. Watch for the pterodactyls that infest these caverns - if your quest takes too long, they will attack. And as the lava pit rises higher and higher, flap mightily to stay aloft ... far from the grasp of the troll that would drag you down to the fiery depths. [Xbox.com]… Expand"}, {"name": "Dynasty Warriors 8", "details_link": "https://www.metacritic.com/game/playstation-3/dynasty-warriors-8", "publisher": "Tecmo Koei America Corp.", "release_date": "Jul 16 2013", "developers": ["Omega Force"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/3b7c2d288aca2515e48197cde25ef0d5-98.jpg", "descriptions": "Dynasty Warriors 8 is a tactical action game that follows the stories of the kingdoms of Wei, Wu, Shu and Jin through the actions of historical military and political figures of the time as they fight to gain control over the Three Kingdoms of China."}, {"name": "SNK Arcade Classics Vol. 1", "details_link": "https://www.metacritic.com/game/psp/snk-arcade-classics-vol-1", "publisher": "SNK Playmore", "release_date": "May  5 2008", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "PSP"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/56f66c62ae76a758013cfc50ec8fc848-98.jpg", "descriptions": "ART OF FIGHTING - The first game in SNK's second fighting-game franchise, set in the same universe as FATAL FURY. BASEBALL STARS 2 - The sequel to SNK's popular baseball arcade game. BURNING FIGHT - New York detectives battle organized crime in this fighter. FATAL FURY - First released inART OF FIGHTING - The first game in SNK's second fighting-game franchise, set in the same universe as FATAL FURY. BASEBALL STARS 2 - The sequel to SNK's popular baseball arcade game. BURNING FIGHT - New York detectives battle organized crime in this fighter. FATAL FURY - First released in 1991, FATAL FURY introduced the two-plane fighting system. KING OF FIGHTERS '94 - The first game in the popular KING OF FIGHTERS series. KING OF THE MONSTERS - In KING OF THE MONSTERS, giant monsters fight for power in epic battles. LAST RESORT - A challenging futuristic shooter. MAGICIAN LORD - Players help the wizard Elta save his homeworld in this platformer. METAL SLUG - Known for its humor and fast- moving gameplay, this run-and-gun side-scroller was the first in the popular series. NEO TURF MASTERS - A golf game which debuted on the Neo Geo Pocket Color in 1999. SAMURAI SHODOWN - Set in the 18th century, SAMURAI SHODOWN features bladed-weapon combat and an international cast of characters. SENGOKU - In SENGOKU, players face off against undead feudal Japanese armies. SHOCK TROOPERS - In this run-and-gun adventure, players save a scientist and his granddaughter from the Bloody Scorpions. SUPER SIDEKICKS 3 - A soccer game featuring teams from all over the world. TOP HUNTER - Bounty hunters protect colonists from space pirates in this futuristic action game. WORLD HEROES - This classic fighter pits players against historical figures in a tournament enabled by time travel. [SNK Playmore USA]… Expand"}, {"name": "Overlord: Dark Legend", "details_link": "https://www.metacritic.com/game/wii/overlord-dark-legend", "publisher": "Codemasters", "release_date": "Jun 23 2009", "developers": ["Climax Group", "Climax Studios"], "platforms": "Wii", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/fc0ca439185ceb69d11036b88ac479e7-98.jpg", "descriptions": "Designed and developed exclusively for Wii, Overlord Dark Legend is a brand new action adventure steeped in fairy tale lore with sinister, satirical twists. Set in a time before the original game, players take the role of a new young Overlord. As he revels in command of the Minions, ourDesigned and developed exclusively for Wii, Overlord Dark Legend is a brand new action adventure steeped in fairy tale lore with sinister, satirical twists. Set in a time before the original game, players take the role of a new young Overlord. As he revels in command of the Minions, our trainee tyrant will be able to take his growing pains out on the local fairy tale inhabitants as he protects his castle and lands. Connecting players to the game world in three dimensions, the use of the Wii Remote gives unprecedented control over the minions. For example, individual Minions can be plucked from the horde, held by the neck and then, by vigorously shaking the Wii Remote, throttled to imbue him with some Overlordly power and turn him into a manic minion missile. With a now-explosive body, the insane little critter can be guided into enemies with hilarious, if rather fatal, consequences. Backed by a rich, tongue-in-cheek story from award-winning games author Rhianna Pratchett, the game features Overlord favourites including Halflings, trolls, elves, and dwarves and introduces wicked witches, gingerbread men and Lil' Red Riding Hood, the seeming sweet girl with a very personal lupine secret. [Codemasters]… Expand"}, {"name": "Kinect Rush: A Disney-Pixar Adventure", "details_link": "https://www.metacritic.com/game/xbox-360/kinect-rush-a-disney-pixar-adventure", "publisher": "Microsoft Game Studios", "release_date": "Mar 20 2012", "developers": ["Asobo Studio"], "platforms": ["PC", "Xbox One", "Xbox 360"], "genres": ["Adventure", "General", "General"], "meta_score": 68, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/20aae1d83e8fadc28200856a95f96a46-98.jpg", "descriptions": "\"Kinect Rush: A Disney-Pixar Adventure,\" an exciting racing adventure game, invites families and fans of all ages to experience the worlds of five beloved Disney-Pixar films like never before. Through the magic of Kinect for Xbox 360, become part of one of five Disney-Pixar worlds\"Kinect Rush: A Disney-Pixar Adventure,\" an exciting racing adventure game, invites families and fans of all ages to experience the worlds of five beloved Disney-Pixar films like never before. Through the magic of Kinect for Xbox 360, become part of one of five Disney-Pixar worlds and team up with characters from \"The Incredibles,\" \"Ratatouille,\" \"Up,\" \"Cars\" and \"Toy Story\" to race against time and solve time-based challenges without ever leaving your living room.  … Expand"}]