[{"name": "Spartacus Legends", "details_link": "https://www.metacritic.com/game/xbox-360/spartacus-legends", "publisher": "Ubisoft", "release_date": "Jun 26 2013", "developers": ["Kung Fu Factory"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "Fighting", "Fighting", "3D", "3D"], "meta_score": 45, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/d317d762fcf4ad580846f94f5dccdb91-98.jpg", "descriptions": "Featuring thousands of ruthless weapon combinations and a robust skill system, Spartacus Legends delivers a variety of tools for gamers to customize their gladiators and dismember their foes. Gamers will be able to fight as Spartacus, Crixus or one of their own created gladiators as theyFeaturing thousands of ruthless weapon combinations and a robust skill system, Spartacus Legends delivers a variety of tools for gamers to customize their gladiators and dismember their foes. Gamers will be able to fight as Spartacus, Crixus or one of their own created gladiators as they battle with friends offline or in online multiplayer to join the ranks on the worldwide leaderboards.… Expand"}, {"name": "DreamWorks Madagascar 3: The Video Game", "details_link": "https://www.metacritic.com/game/xbox-360/dreamworks-madagascar-3-the-video-game", "publisher": "D3Publisher", "release_date": "Jun  5 2012", "developers": ["D3Publisher"], "platforms": ["3DS", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General"], "meta_score": 45, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/187911b342e6655314959476c446986f-98.jpg", "descriptions": "In Madagascar 3: The Video Game, players of all ages will get to experience the adventures of Alex the Lion, Marty the Zebra, Gloria the Hippo, and Melman the Giraffe trying to find a way home through the perfect cover: a traveling circus. Travel across Europe and promote the circus byIn Madagascar 3: The Video Game, players of all ages will get to experience the adventures of Alex the Lion, Marty the Zebra, Gloria the Hippo, and Melman the Giraffe trying to find a way home through the perfect cover: a traveling circus. Travel across Europe and promote the circus by completing missions and putting on an amazing mini-game based show to take the gang back to the states!… Expand"}, {"name": "Tennis World Tour", "details_link": "https://www.metacritic.com/game/playstation-4/tennis-world-tour", "publisher": "Bigben Interactive", "release_date": "May 22 2018", "developers": ["Breakpoint"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 45, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/3/0e90dbff7ed0d9b4915263bd8b102f7f-98.jpg", "descriptions": "The new standard developed by veterans of tennis simulations: play as one of 30 professional tennis players, learn all the shots, master each type of surface and experience a realistic career mode. Define your style of play and tactics to become n°1 in the world!"}, {"name": "Without Warning", "details_link": "https://www.metacritic.com/game/xbox/without-warning", "publisher": "Capcom", "release_date": "Nov  1 2005", "developers": ["CiRCLE"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 45, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/4/a0c1483098525e60c2112ee4bfe43655-98.jpg", "descriptions": "In Without Warning, a radical terrorist group has targeted and seized the Peterson-Daniels Chemical Facility, a vulnerable location that jeopardizes millions of people from the devastating ecological hazard it imposes if destroyed. Pleas are useless and any direct military assault would beIn Without Warning, a radical terrorist group has targeted and seized the Peterson-Daniels Chemical Facility, a vulnerable location that jeopardizes millions of people from the devastating ecological hazard it imposes if destroyed. Pleas are useless and any direct military assault would be too great a risk. As terrified hostages fearfor their lives, their only hope lies with a covert operations team, whose goal is to infiltrate the plant and eliminate the merciless enemy. The harrowing events unfold over a 12 hour period, featuring a unique gameplay dynamic which enables the six central characters to experience events across the same timeline but from their own distinct viewpoints. The player controls each character individually, with the focus automatically shifting to a new character at key moments which are unfolded throughcut scenes. By switching between the characters, their individual tales are woven together to create an overall picture of the events that happened during the crisis. The player will also retrospectively view events through the eyes of another character and is therefore not only a participant in the events, but a spectator as well. Furthermore, actions performed as one character affect the progress of others and players must successfully utilize the strengths of each in order to advance.… Expand"}, {"name": "Wacky World of Sports", "details_link": "https://www.metacritic.com/game/wii/wacky-world-of-sports", "publisher": "Sega", "release_date": "Sep 22 2009", "developers": ["Tabot"], "platforms": "Wii", "genres": ["Sports", "General", "General"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/00c2a8922c182fd0e653d88db9c33f4b-98.jpg", "descriptions": "The wackiest sports come together in an all-new Wii Party Game. Enter the world's wildest, craziest sports tournament and compete in some of the most outlandish games from around the globe, such as Tuna Tossing, Furniture Racing, Mud Sliding and more! Challenge a zany group of the world'sThe wackiest sports come together in an all-new Wii Party Game. Enter the world's wildest, craziest sports tournament and compete in some of the most outlandish games from around the globe, such as Tuna Tossing, Furniture Racing, Mud Sliding and more! Challenge a zany group of the world's most skilled Wacky Sport athletes in 10 off-the-wall events. With Wacky World of Sports, the wide world of eccentric sporting events is delivered in an all-new, original Wii title that the whole family can play either in the single player Tour mode or four person multi-player! 10 Wacky Sports to Play - Participate in some of the wildest and craziest sporting events. Test your skills in a variety of insane challenges, such as Ice Golf, Card Boxing, Extreme Ironing, and more! Compete in Multiplayer Mode against family and friends for non-stop hilarious action. Tour Mode - Challenge yourself in Tour Mode and travel the globe competing in international Wacky Sports challenges. Unlocking a variety of other unique characters. Crazy Characters - Four main playable characters, eight enemy characters and one wild boss all combine to create the wildest cast of characters to ever hit the sporting world. Wii Gone Wacky - Wacky sports utilizes the Wii Remote to the fullest, delivering wacky excitement through true-to-life gestures. [Sega]… Expand"}, {"name": "NCAA Final Four 2004", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-final-four-2004", "publisher": "SCEA", "release_date": "Nov 11 2003", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/bfa1cd5643cd8aa94d3146f5ed04651e-98.jpg", "descriptions": "Combining true, authentic NCAA college basketball action with updated graphics and an all-new Online Mode, NCAA Final Four 2004 delivers spirit and pageantry of college hoops. NCAA Final Four 2004 features more than 300 Division IA teams, multiple modes of play including Practice, DynastyCombining true, authentic NCAA college basketball action with updated graphics and an all-new Online Mode, NCAA Final Four 2004 delivers spirit and pageantry of college hoops. NCAA Final Four 2004 features more than 300 Division IA teams, multiple modes of play including Practice, Dynasty and Career, state-of-the-art artificial intelligence (AI) and compatibility with 989SportsOnline, the revolutionary central online lobby linking all 989 Sports online titles with features including roster updates, a real-time sports ticker, tournaments, message boards, voice chat, and more. [Sony]… Expand"}, {"name": "Swashbucklers: Blue vs. Grey", "details_link": "https://www.metacritic.com/game/playstation-2/swashbucklers-blue-vs-grey", "publisher": "Atari", "release_date": "Nov 20 2007", "developers": ["Akella"], "platforms": "PlayStation 2", "genres": ["Action Adventure", "Historic"], "meta_score": 45, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/427a9a039718497f2e50506b00e0387b-98.jpg", "descriptions": "Swashbucklers: Blue vs. Grey is a Naval Action/RPG set in time of the American Civil War – the time of last pirate renaissance on the Caribbean. The Union fleet blockaded the Southern ports, rupturing all the trading connections of the Confederacy. In return, Confederate government startedSwashbucklers: Blue vs. Grey is a Naval Action/RPG set in time of the American Civil War – the time of last pirate renaissance on the Caribbean. The Union fleet blockaded the Southern ports, rupturing all the trading connections of the Confederacy. In return, Confederate government started giving out the privateer patents, thus building a powerful fleet of commercial raiders, the best example of which was the legendary captain Raphael Semmes. Also, smuggling the goods through the blockade became very profitable, though risky, business and attracted numerous traders to attempts of running the blockade. Abraham Gray, the main character, starts the game as a captain of a privately-owned vessel, but soon becomes involved into the story of blockade-running, military espionage and the ultimately powerful ironclad, built in Liverpool for the Confederacy. This ironclad alone could have change the course of war and bring the victory to the Rebel states. Then Abraham can join either Confederacy as a raider, or a Union as a spy. The player is free to sail across the game’s world – from southern coasts of the USA and Florida to Jamaica and North Caribbean. He can trade and smuggle goods between nineteen ports – both free and blockaded, raid the cargo ships, battle the warships and ironclads and complete quests for either Union or Confederacy. Aside from naval combat, Swashbucklers features strong on-foot gameplay, in which Abraham slashes his way through in various locations, confronting dozens of various enemies and bosses. The game’s role-playing system, based of three main characteristics and numerous perks, allows the player to develop the main character in various ways. He can improve his naval skills, learn new combos and shooting modes, or become the best trader in the Caribbean. Also, there are numerous options to upgrade the ship with Gatling guns, heavy weaponry, steam engines, or better sails. [1C Company]… Expand"}, {"name": "Tournament of Legends", "details_link": "https://www.metacritic.com/game/wii/tournament-of-legends", "publisher": "Sega Europe", "release_date": "Jul  6 2010", "developers": ["High Voltage Software"], "platforms": "Wii", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 45, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/5fb53d0a080d20c2367b457b1d1b4437-98.jpg", "descriptions": "Become a legend in epic 3D duels against the greatest fighters of world mythology. Wield mythic weapons and unleash special animated attacks. Wield two weapons at the same time with the Wii Remote and Nunchuk Controller. Sharpen your skills in the interactive training level. [Sega]"}, {"name": "Star Trek The Video Game", "details_link": "https://www.metacritic.com/game/playstation-3/star-trek-the-video-game", "publisher": "Namco Bandai Games America", "release_date": "Apr 23 2013", "developers": ["Digital Extremes"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 45, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/8/1dc15a41acb9c4122aa277cceea2063a-98.jpg", "descriptions": "Assume the role of one of the greatest science-fiction heroes of TV and film -- Kirk and Spock – in STAR TREK, an original co-op gaming experience that builds on the Star Trek universe. Set in the 23rd Century world of the Star Trek reboot, this cover-based shooter inserts players in anAssume the role of one of the greatest science-fiction heroes of TV and film -- Kirk and Spock – in STAR TREK, an original co-op gaming experience that builds on the Star Trek universe. Set in the 23rd Century world of the Star Trek reboot, this cover-based shooter inserts players in an original story and action-based combat.… Expand"}, {"name": "Top Gear RPM Tuning", "details_link": "https://www.metacritic.com/game/xbox/top-gear-rpm-tuning", "publisher": "Kemco", "release_date": "Feb 16 2005", "developers": ["Babylon Software"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 45, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/8311647f20d0bb9941e95b34d988e90e-98.jpg", "descriptions": "Now you can immerse yourself in the street racing culture with Top Gear RPM Tuning. Select a vehicle, and then start the customization process...from the spoilers and hood to the color and decals. Next, take your car to the streets to see how it compares to the competition. The game featuresNow you can immerse yourself in the street racing culture with Top Gear RPM Tuning. Select a vehicle, and then start the customization process...from the spoilers and hood to the color and decals. Next, take your car to the streets to see how it compares to the competition. The game features multiple modes, such as adventure and wager. In adventure mode, you can watch more than 56 cutscenes while racing to the forefront of the street racing scene. In wager mode, you can accumulate money for further customizations.… Expand"}, {"name": "Mushroom Men: Rise of the Fungi", "details_link": "https://www.metacritic.com/game/ds/mushroom-men-rise-of-the-fungi", "publisher": "Gamecock Media Group", "release_date": "Dec  2 2008", "developers": ["Red Fly Studio"], "platforms": "DS", "num_players": "2  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 45, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/11f4e0e9f40e7decdf7de9be1533f81e-98.jpg", "descriptions": "Mushroom Men gives players the opportunity to jump into the fantastic microcosm that is the backyard battlefield. Take control of the crusade, creating devastating weapons from everyday items and teaming up with other sentient plant forms that'll leave the enemy sliced and diced. Let theMushroom Men gives players the opportunity to jump into the fantastic microcosm that is the backyard battlefield. Take control of the crusade, creating devastating weapons from everyday items and teaming up with other sentient plant forms that'll leave the enemy sliced and diced. Let the stylus be your rapier and the Wii Remote your bazooka as you cut down the multitude of household pests that threaten our very existence! [Gamecock Media]… Expand"}, {"name": "Iron Man", "details_link": "https://www.metacritic.com/game/xbox-360/iron-man", "publisher": "Sega", "release_date": "May  2 2008", "developers": ["Secret Level"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 45, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/8f8680a71c93ad7ae358e38460bcd520-98.jpg", "descriptions": "Iron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in IronIron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in Iron Man's suits of armour, gamers can take advantage of the wide array of high-impact weapons to strategically annihilate any enemy force standing in their way. Before tackling stunning and immense open battlefields, players can customise their armour suit as they encounter progressively more vicious enemies, and fight in epic battles that could challenge even the toughest Super Heroes. [Sega]… Expand"}, {"name": "War World", "details_link": "https://www.metacritic.com/game/xbox-360/war-world", "publisher": "Ubisoft", "release_date": "Oct  1 2008", "developers": ["Third Wave Games"], "platforms": ["PC", "Xbox 360"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 45, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/cb25300570cdc87d88518a971dd0b7ed-98.jpg", "descriptions": "[Xbox Live Arcade]  War World is a fast-paced third-person shooter that combines a unique blend of heart-pumping action and tactical gameplay, introducing an entirely new genre to XLA. War World throws players directly into combat on the battlefield of a war-torn planet. Control one of 10[Xbox Live Arcade]  War World is a fast-paced third-person shooter that combines a unique blend of heart-pumping action and tactical gameplay, introducing an entirely new genre to XLA. War World throws players directly into combat on the battlefield of a war-torn planet. Control one of 10 different Mechanoids, each with special abilities, and wreak havoc throughout the 100-level single-player campaign. Imagine a planet dedicated just to the art of war. This third-person shooter combines both single-player and multiplayer into one action-packed downloadable game. The game features four multiplayer game modes for up to eight players (Capture the Flag, Bomb Assault, Death Match, and Team Death Match) and a huge single-player campaign War World. [Ubisoft]… Expand"}, {"name": "Ugly Americans: Apocalypsegeddon", "details_link": "https://www.metacritic.com/game/xbox-360/ugly-americans-apocalypsegeddon", "publisher": "Comedy Central Games", "release_date": "Aug 31 2011", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 45, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/101d82e822005e7ea97bc1817873de56-98.jpg", "descriptions": "With four-player top-down co-op gameplay that hearkens back to such classics as Gauntlet and Robotron, “Ugly Americans: Apocalypsegeddon” features four playable characters, each with their own unique abilities, weapons and strengths.  Players must comb the streets of New York City and pacifyWith four-player top-down co-op gameplay that hearkens back to such classics as Gauntlet and Robotron, “Ugly Americans: Apocalypsegeddon” features four playable characters, each with their own unique abilities, weapons and strengths.  Players must comb the streets of New York City and pacify raving demons, delinquent man birds and zombies by lactating fire or hurling wacky objects like flying demon skulls, fish, baseballs and wrenches.  Investigate case files from the Department of Integration and battle devastating and distinctive bosses at the end of each mission, each bringing you one step closer to finding out who is trying to bring about the end of days!… Expand"}, {"name": "Sniper: Ghost Warrior", "details_link": "https://www.metacritic.com/game/xbox-360/sniper-ghost-warrior", "publisher": "City Interactive", "release_date": "Jun 29 2010", "developers": ["City Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 45, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/0f7b11296663515a403f57553014bd24-98.jpg", "descriptions": "The democratic government of Isla Trueno has been overthrown and a military regime comes into power. The country becomes a theatre of influence war. You are sent as one of the covert commandos to support the rebels fighting their oppressor. [City Interactive]"}, {"name": "Deus Ex: The Fall", "details_link": "https://www.metacritic.com/game/pc/deus-ex-the-fall", "publisher": "Square Enix", "release_date": "Mar 17 2014", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 45, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/2/44c165a29130285ff8519690fa3c90db-98.jpg", "descriptions": "Deus Ex: The Fall is set in 2027– a golden era for science, technology and human augmentation, but also a time of great social divide and global conspiracy. Powerful corporations have seized control from governments and command the drug supply needed by augmented humans to survive."}, {"name": "Ghostbusters: Sanctum of Slime", "details_link": "https://www.metacritic.com/game/xbox-360/ghostbusters-sanctum-of-slime", "publisher": "Atari", "release_date": "Mar 23 2011", "developers": ["Behavior Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Modern", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 45, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/7/b2e0a88490a3b61796eb67b1d3b52483-98.jpg", "descriptions": "Sanctum of Slime is a top-down action adventure following the star of 2009's Ghostbusters revamp."}, {"name": "NFL Tour", "details_link": "https://www.metacritic.com/game/playstation-3/nfl-tour", "publisher": "Electronic Arts", "release_date": "Jan  8 2008", "developers": ["EA Tiburon"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/f5afa06a17478bb88bad57983920484c-98.jpg", "descriptions": "NFL Tour brings the spectacle of a traveling NFL road show alive, with intuitive controls, fast-paced gameplay, and visually stunning graphics - NFL Tour is action-packed. NFL Tour is an NFL licensed video game that offers players a fun and engaging experience with the NFL and its talentedNFL Tour brings the spectacle of a traveling NFL road show alive, with intuitive controls, fast-paced gameplay, and visually stunning graphics - NFL Tour is action-packed. NFL Tour is an NFL licensed video game that offers players a fun and engaging experience with the NFL and its talented players. Gamers embark on a fictional NFL road show. With real NFL players as teammates, players travel across the country to play against each of the NFL teams in newly designed stadiums.  As players defeat each of the NFL squads, they come one step closer to winning an NFL contract. [Electronic Arts]… Expand"}, {"name": "LA Cops", "details_link": "https://www.metacritic.com/game/pc/la-cops", "publisher": "LA Cops Ltd", "release_date": "Mar 13 2015", "developers": ["Modern Dream"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 45, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/3d3fd76406d9d4437e782aac2459c011-98.jpg", "descriptions": "LA Cops is an action-packed 3D top down shooter set in 1970s LA with police trying to do a tough job in a tough town."}, {"name": "Interpol: The Trail of Dr. Chaos", "details_link": "https://www.metacritic.com/game/xbox-360/interpol-the-trail-of-dr-chaos", "publisher": "Microsoft Game Studios", "release_date": "Jan  7 2009", "developers": ["Tik Games", "LLC", "TikGames"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Hidden Object", "General", "Puzzle", "General"], "meta_score": 45, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/0/0ef4a3f85142c8a18cfd562951b4209f-98.jpg", "descriptions": "[Xbox Live Arcade]  Track down the evil and destructive fugitive Dr. Chaos, as you hunt down clues in the exciting seek and find game Interpol: The Trail of Dr. Chaos. As an elite agent for Interpol, it is your mission to eradicate his trail of corruption as it takes you around the world[Xbox Live Arcade]  Track down the evil and destructive fugitive Dr. Chaos, as you hunt down clues in the exciting seek and find game Interpol: The Trail of Dr. Chaos. As an elite agent for Interpol, it is your mission to eradicate his trail of corruption as it takes you around the world from one international city to the next. Use your investigative skills to quickly gather the evidence needed to bring him to justice. [TikGames]… Expand"}, {"name": "Rock of the Dead", "details_link": "https://www.metacritic.com/game/playstation-3/rock-of-the-dead", "publisher": "Conspiracy Entertainment", "release_date": "Oct 19 2010", "developers": ["Epicenter Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/865d7098870db4048376f1c2d3058859-98.jpg", "descriptions": "With the guitar as your weapon of choice you'll journey through terrifying graveyards and sewers, battle the undead to protect your trailer park home, and even rock in front of the camera as you do battle at the television station. Use the power of rock to unleash a sonic blast on a group ofWith the guitar as your weapon of choice you'll journey through terrifying graveyards and sewers, battle the undead to protect your trailer park home, and even rock in front of the camera as you do battle at the television station. Use the power of rock to unleash a sonic blast on a group of flesh eaters, raise the guitar to the heavens to power a protective shield, or just strum the hard and heavy tunes as you riff your way through the infected masses to the sound of a rocking soundtrack. The fate of the world, as well as rock and roll itself, is in your hands.… Expand"}, {"name": "CSI: Crime Scene Investigation", "details_link": "https://www.metacritic.com/game/xbox/csi-crime-scene-investigation", "publisher": "Ubisoft", "release_date": "Dec 14 2004", "developers": ["369 Interactive"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Adventure", "First-Person", "Modern"], "meta_score": 45, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/ae6c722719815f854931f24c02f9003f-98.jpg", "descriptions": "What do a murdered woman, a slain police officer, and a mysterious arson case have in common?  Enter the gritty world of CSI and search for the answer with Grissom, Catherine, and the entire Crime Scene Investigation team.  As a new recruit, you'll have to learn how to use all of theWhat do a murdered woman, a slain police officer, and a mysterious arson case have in common?  Enter the gritty world of CSI and search for the answer with Grissom, Catherine, and the entire Crime Scene Investigation team.  As a new recruit, you'll have to learn how to use all of the investigator tools, including cotton swabs, rubber gloves, and plaster molds.  Armed with high-powered forensic equipment and razor-sharp wits, delve deep into the mysteries of five baffling crime scenes to reveal the truth.  … Expand"}, {"name": "Bubsy: The Woolies Strike Back", "details_link": "https://www.metacritic.com/game/playstation-4/bubsy-the-woolies-strike-back", "publisher": "Accolade", "release_date": "Oct 31 2017", "developers": ["Black Forest Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 45, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/3bb4483c1a7b1e0c8994912cfdbdaa43-98.jpg", "descriptions": "Our Bobcat is making a triumphant return 20 years after virtually disappearing from the world stage. Yes, that’s right, Bubsy is back and starring in an all new adventure, Bubsy: The Woolies Strike Back!"}, {"name": "Soldier of Fortune: Payback", "details_link": "https://www.metacritic.com/game/pc/soldier-of-fortune-payback", "publisher": "Activision Value", "release_date": "Nov 14 2007", "developers": ["Activision", "Cauldron Ltd."], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 45, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Soldier of Fortune Payback evolves the signature gameplay of its predecessors with refined controls, tension-packed warzones, and an enemy damage system that may be shocking to even experienced FPS players.  Boasting more weapons options than any previous Soldier of Fortune installment,Soldier of Fortune Payback evolves the signature gameplay of its predecessors with refined controls, tension-packed warzones, and an enemy damage system that may be shocking to even experienced FPS players.  Boasting more weapons options than any previous Soldier of Fortune installment, Soldier of Fortune Payback's impressive arsenal includes an array of more than 30 weapons including sub-machine guns, assault rifles, sniper rifles, projectile explosives, weapon attachments and cutting-edge tactical weapons. The game features many of players' favorite online multiplayer modes including Deathmatch, Team Deathmatch, Elimination, Team Elimination, Capture the Flag, and Demolition. Additional online options include maps tuned specifically for multiplayer action, persistent stat-tracking throughout the gamer’s online career, and many server settings for custom online play. The storyline reflects the practice of \"outsourcing\" wars. When a routine escort mission goes horribly wrong, freelance mercenary Thomas Mason finds himself battling an insidious enemy that knows no boundaries. Traditional armies can not handle these extremists – only underground guns for hire can fight a war this dirty and get results. [Activision]… Expand"}, {"name": "The Cursed Crusade", "details_link": "https://www.metacritic.com/game/playstation-3/the-cursed-crusade", "publisher": "Atlus", "release_date": "Oct 25 2011", "developers": ["Kylotonn"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 45, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/3/c900da6dfc6506ffb493fc629d3db4d7-98.jpg", "descriptions": "The Cursed Crusade marries medieval Europe with adventure and dark fantasy."}, {"name": "Hysteria Hospital: Emergency Ward", "details_link": "https://www.metacritic.com/game/ds/hysteria-hospital-emergency-ward", "publisher": "O-Games", "release_date": "Jun 16 2009", "developers": ["Gameinvest"], "platforms": "DS", "genres": ["Action", "Strategy", "General", "General", "Management", "Business / Tycoon"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/4f8464ba1d181e6c18a6061597364a59-98.jpg", "descriptions": "Reach for your stethoscope and grab your nurse's outfit as Oxygen Games announces the arrival of Hysteria Hospital: Emergency Ward. At Hysteria Hospital, life proves to be a manic challenge. Players have several levels of the hospital to navigate, and they have to reach desperate patientsReach for your stethoscope and grab your nurse's outfit as Oxygen Games announces the arrival of Hysteria Hospital: Emergency Ward. At Hysteria Hospital, life proves to be a manic challenge. Players have several levels of the hospital to navigate, and they have to reach desperate patients and demanding doctors within a set period of time. The frenzy inside the hospital increases as the game progresses with more and more demanding patients desperate to be cured. You play as a female or male nurse and organise the ward and direct the patients to treat their conditions as quickly as possible. You can design and improve your ward for life-saving efficiency to be the best head nurse in America and save the Hospital from being overrun. Each of the patients have many humorous conditions, all with cures using the latest, bleeding-edge treatment machines ranging from basic X-Ray's to steam therapy to the hilarious De-Stress machine. There are 7 different wards to run, from a local Maryville clinic through to New York Central Hospital; over 60 levels including the 'Endless' mode that steadily increases in challenge as you progress. [Oxygen Interactive]… Expand"}, {"name": "7 Days to Die", "details_link": "https://www.metacritic.com/game/playstation-4/7-days-to-die", "publisher": "Telltale Games", "release_date": "Jun 28 2016", "developers": ["Iron Galaxy Studios", "The Fun Pimps"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Action Adventure", "Shooter", "Survival", "Sandbox", "First-Person", "Arcade"], "meta_score": 45, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/93b8a6ca2501bcd657bcd51c32181542-98.jpg", "descriptions": "It’s an open-world sandbox game to play alone, via splitscreen, or online, that gives you an enormous amount of freedom to choose how to survive in a post-apocalyptic world. You’re dropped into a harsh environment with almost nothing – not even clothes on your back. Through scavenging,It’s an open-world sandbox game to play alone, via splitscreen, or online, that gives you an enormous amount of freedom to choose how to survive in a post-apocalyptic world. You’re dropped into a harsh environment with almost nothing – not even clothes on your back. Through scavenging, crafting, and hunting, you’ll eventually put together the basic items you’ll need to live. You’ll have to deal with cold, heat, hunger and thirst, and there are wild animals that see you as prey. But that’s not the worst, because you’re not alone — the undead wander all around you. Slow and relatively easy to avoid by day, at night they become merciless, fast-moving killers, hungry for your flesh.… Expand"}, {"name": "Stronghold: Crusader Extreme", "details_link": "https://www.metacritic.com/game/pc/stronghold-crusader-extreme", "publisher": "Gamecock Media Group", "release_date": "Jun  2 2008", "developers": ["FireFly Studios"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Miscellaneous", "Real-Time", "Compilation", "Historic"], "meta_score": 45, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/7a788a223f9345ba1fa3efcebbdee530-98.jpg", "descriptions": "Stronghold Crusader Extreme takes the addictive Crusader gameplay to a new level. Featuring massive battles, new outposts and tactical powers to master, Extreme carries on from where Crusader left off. The all new Extreme trail will provide a stiff challenge to any hardened Crusader player.Stronghold Crusader Extreme takes the addictive Crusader gameplay to a new level. Featuring massive battles, new outposts and tactical powers to master, Extreme carries on from where Crusader left off. The all new Extreme trail will provide a stiff challenge to any hardened Crusader player. For those new to Crusader, the original game has been provided too, in an updated form and with all the previously released limited edition content, such as the second crusader trail and all 8 new AI opponents. [FireFly Studios]… Expand"}, {"name": "The Ant Bully", "details_link": "https://www.metacritic.com/game/wii/the-ant-bully", "publisher": "Midway", "release_date": "Dec  5 2006", "developers": ["Artificial Mind and Movement"], "platforms": ["PC", "PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 45, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/48cee654bdbe33bf7e88f5f184dd513f-98.jpg", "descriptions": "Go pick on someone your own size! After bullying an innocent ant colony, a young boy named Lucas is magically shrunk down to ant size and embarks on a remarkable adventure. Play as Lucas, experiencing the dangerous and thrilling life of an ant as you battle, explore and forge new friendshipsGo pick on someone your own size! After bullying an innocent ant colony, a young boy named Lucas is magically shrunk down to ant size and embarks on a remarkable adventure. Play as Lucas, experiencing the dangerous and thrilling life of an ant as you battle, explore and forge new friendships with natives and other species in his new ant world. Based on exciting moments from the upcoming digitally animated family adventure The Ant Bully, and featuring all-new challenges created especially for the game, help Lucas evolve from recluse to hero in his quest to save the colony from extermination. [Midway]… Expand"}, {"name": "Golden Axe: Beast Rider", "details_link": "https://www.metacritic.com/game/xbox-360/golden-axe-beast-rider", "publisher": "Sega", "release_date": "Oct 14 2008", "developers": ["Secret Level"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 45, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/a3a97640419f3df61202a641ff34848c-98.jpg", "descriptions": "Golden Axe: Beast Rider delivers action-RPG thrills as a small band of Riders embark on an epic adventure to recruit allies, expose the enemy and prevent the annihilation of their breed. Delivering an intense and unique combat experience, players charge into battle on the backs of ferociousGolden Axe: Beast Rider delivers action-RPG thrills as a small band of Riders embark on an epic adventure to recruit allies, expose the enemy and prevent the annihilation of their breed. Delivering an intense and unique combat experience, players charge into battle on the backs of ferocious beasts or take their chances with the enemy while on foot. Fighting skill, wits and even magic are all called into action as players immerse themselves in the struggle to defeat an evil intent on enslaving the remains of civilization. [Sega]… Expand"}, {"name": "D1 Professional Drift Grand Prix Series", "details_link": "https://www.metacritic.com/game/playstation-2/d1-professional-drift-grand-prix-series", "publisher": "Yuke's Company of America", "release_date": "Aug 15 2006", "developers": ["Yuke's"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 45, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/3ffe9da5db4c762d6ce2004973d9f8ee-98.jpg", "descriptions": "D1 Grand Prix recreates the exhilarating art of drifting, including all the cars, tracks, drivers and physics that has made the D1 Grand Prix the pinnacle series in drift racing. Players select from 39 American and Japanese drivers, as well as vehicles from Toyota, Honda, Mazda, Subaru,D1 Grand Prix recreates the exhilarating art of drifting, including all the cars, tracks, drivers and physics that has made the D1 Grand Prix the pinnacle series in drift racing. Players select from 39 American and Japanese drivers, as well as vehicles from Toyota, Honda, Mazda, Subaru, Pontiac, and more. 13 Driving Circuits from past D1 competitions including Odaiba, Tsukuba Circuit, Autopolis, SUGO, Fuji Speedway, Irwindale, and more. In-depth tutorial teaches players the art of drifting. Official D1 Grand Prix car stats, rules, racers and racing circuits. Compete in both day and night, clear or rainy day races. Enhanced commentary engine lets players hear what the three judges have to say in real time. Six modes of play: D1 Series, X-Treme, Time Attack, Survival Mode, Battle Mode, D1 Theater (unlockable movies of actual footage of the D1 Grand Prix, as well as in-game replays of the players' best runs). [Yuke's]… Expand"}, {"name": "Reservoir Dogs: Bloody Days", "details_link": "https://www.metacritic.com/game/pc/reservoir-dogs-bloody-days", "publisher": "Big Star Games", "release_date": "May 18 2017", "developers": ["Big Star Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 45, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/b3e5303e9a3999aa639c5e5d5daeae5b-98.jpg", "descriptions": "Reservoir Dogs: Bloody Days is a top-down tactical-action strategy game based on the 1992 film."}, {"name": "Maize", "details_link": "https://www.metacritic.com/game/playstation-4/maize", "publisher": "Finish Line Games", "release_date": "Sep 12 2017", "developers": ["Finish Line Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "General"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/33a473a119970cdbc331d43928264c74-98.jpg", "descriptions": "Maize is what happens when two scientists misinterpret a memo from the U.S. Government and end up creating, uh, sentient corn. And did we mention the angry condescending Russian robotic teddy bear or the unhinged albino corn stalk with an underbite? It’s a lot to take in."}, {"name": "The Huntsman: Winter's Curse", "details_link": "https://www.metacritic.com/game/playstation-4/the-huntsman-winters-curse", "publisher": "Desert Owl Games LLC", "release_date": "Aug 16 2016", "developers": ["Desert Owl Games LLC"], "platforms": ["PC", "PlayStation 4"], "genres": ["Role-Playing", "General"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/055fd0591ca281be4a03db7aebb6d1ae-98.jpg", "descriptions": "Winter is approaching as Queen Freya’s army marches on relentlessly. Under the shadow of that deadly war, Elisabeth’s life on her family’s farm in Vardhelm comes to an abrupt end. Join her to find her missing brothers as you explore the Huntsman universe and encounter both familiar faces andWinter is approaching as Queen Freya’s army marches on relentlessly. Under the shadow of that deadly war, Elisabeth’s life on her family’s farm in Vardhelm comes to an abrupt end. Join her to find her missing brothers as you explore the Huntsman universe and encounter both familiar faces and new dangers, all while discovering the secret Elisabeth herself carries in this wintery adventure. [Playstation.com]… Expand"}, {"name": "Red Bull X-Fighters", "details_link": "https://www.metacritic.com/game/xbox-360/red-bull-x-fighters", "publisher": "Konami", "release_date": "Sep 14 2011", "developers": ["Xendex"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Sports", "General", "General", "Individual", "Biking"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/2b3231c6da01659d470dac01ceae43b0-98.jpg", "descriptions": "With Red Bull X-Fighters, gamers around the world can now experience the thrill and excitement of the best Freestyle Motocross riders in the world on Xbox LIVE Arcade and PC. The game puts you, the player, on centre stage of the Red Bull X-Fighters World Tour. Take your bike, launch fromWith Red Bull X-Fighters, gamers around the world can now experience the thrill and excitement of the best Freestyle Motocross riders in the world on Xbox LIVE Arcade and PC. The game puts you, the player, on centre stage of the Red Bull X-Fighters World Tour. Take your bike, launch from huge ramps and pull off truly stunning and jaw-dropping tricks while up to 40 feet in the air. Do you have what it takes to wow the crowd and pull out all stops in the attempt to finish as overall champion? But don’t expect this to be an easy challenge. You’ve got to master the right level of acceleration and braking, balance your body and all the while performing death-defying maneuvers on 100-foot leaps - don’t crash or it will ruin your run.… Expand"}, {"name": "Football Mogul 2007", "details_link": "https://www.metacritic.com/game/pc/football-mogul-2007", "publisher": "Enlight Software", "release_date": "Dec 15 2006", "developers": ["Sports Mogul"], "platforms": "PC", "genres": ["Sports", "Traditional", "Team", "Football", "Management", "Management", "Sim"], "meta_score": 45, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/3dd44153ba0c8f47301b3721602a0c06-98.jpg", "descriptions": "With new features and improvements to Football Mogul 2007, players now have the opportunity to take advantage of a new roster editor which allows for personnel customization of your offensive and defensive packages, to maximize the production of your talent. Players will also be able to takeWith new features and improvements to Football Mogul 2007, players now have the opportunity to take advantage of a new roster editor which allows for personnel customization of your offensive and defensive packages, to maximize the production of your talent. Players will also be able to take advantage of the new play calling engine which gives you complete control over the plays being called. Football Mogul 2007 offers an extreme amount of realism and flexibility with thousands of combinations to choose from. Your success in the game depends heavily on your play calling ability as opposed to simply reacting after the ball is snapped. The game gives players the ability to formulate a strategy around your team’s strengths and exploit opponent mismatches these strengths expose.  The addition of updated year-by-year stats and customized ratings for every team's complete 2006 roster, gives players full control over everything including personnel, rosters, finances, trade negotiations, and even this year’s draft picks. Building your franchise into a dynasty means taking on the role of president, general manager and head coach simultaneously, making every decision a crucial one. [Enlight Software]… Expand"}, {"name": "Brothers in Arms: Double Time", "details_link": "https://www.metacritic.com/game/wii/brothers-in-arms-double-time", "publisher": "Ubisoft", "release_date": "Sep 23 2008", "developers": ["Gearbox Software"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Shooter", "Shooter", "Compilation", "First-Person", "Historic", "Arcade"], "meta_score": 45, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/1cfb7f339dc9a2b5e37940d09b6b0277-98.jpg", "descriptions": "Brothers In Arms: Double Time brings this WWII action franchise to the Wii system, while adding the use of innovative gameplay with the Wii Remote. Combining All 31 Playable Levels: Play as Sergeants Matt Baker and Joe Hartsock, leading your squad behind enemy lines through the NormandyBrothers In Arms: Double Time brings this WWII action franchise to the Wii system, while adding the use of innovative gameplay with the Wii Remote. Combining All 31 Playable Levels: Play as Sergeants Matt Baker and Joe Hartsock, leading your squad behind enemy lines through the Normandy invasion. Fight actual Airborne Infantry battles of D-Day accurately recreated using thousands of official photos, maps, After-Action Reports and eyewitness accounts under the direction of Military and Historical Director, Col. John Antal. Featuring close-quarter urban environments and a next-generation artificial intelligence system, Brothers In Arms: Double Time takes authentic military action to the next level on the Wii system. Issue orders and perform military gestures to command and lead your team using the Wii Remote. [Ubisoft]… Expand"}, {"name": "Major League Eating: The Game", "details_link": "https://www.metacritic.com/game/wii/major-league-eating-the-game", "publisher": "Mastiff", "release_date": "Jul 14 2008", "developers": ["Mastiff", "Sensory Sweep"], "platforms": "Wii", "num_players": "2  Online", "genres": ["Action", "General", "General"], "meta_score": 45, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/20a032151ad64957862cedb892041f38-98.jpg", "descriptions": "[WiiWare]  The ultimate chomp-off is about to begin. Grab your Wii Remote controller and dig into 12 different foods as you compete against the greatest major-league eaters in the world. This isn't just a race to stuff your face-you'll need strategy to master a smorgasbord of digestive[WiiWare]  The ultimate chomp-off is about to begin. Grab your Wii Remote controller and dig into 12 different foods as you compete against the greatest major-league eaters in the world. This isn't just a race to stuff your face-you'll need strategy to master a smorgasbord of digestive attacks, defenses and counters. These include the Mega Burp, Gas Attack, Antacid and more. And don't forget to keep an eye on your Barf-O-Meter, because if the food hits the plate twice, you're out. Unlock more than 10 characters in single-player career mode, go gut-to-gut against your friends in versus mode, or compete online using Nintendo Wi-Fi Connection. Online play supports friend codes, random matchmaking and leader boards. [Nintendo]… Expand"}, {"name": "WWE 2K20", "details_link": "https://www.metacritic.com/game/xbox-one/wwe-2k20", "publisher": "2K Games", "release_date": "Oct 22 2019", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 45, "users_score": 1.3, "image": "https://static.metacritic.com/images/products/games/9/c82e50380b43a97915d8ded50d3e9602-98.jpg", "descriptions": "For the first time ever in WWE 2K, play as both a male and female MyPLAYER in MyCAREER as you journey through the twists, turns and storylines on the path to WWE excellence - featuring cutscenes and voiceovers from your favorite Superstars."}, {"name": "PDC World Championship Darts 2009", "details_link": "https://www.metacritic.com/game/ds/pdc-world-championship-darts-2009", "publisher": "O-Games", "release_date": "Jun 16 2009", "developers": ["Rebellion"], "platforms": "DS", "genres": ["Sports", "Alternative", "Individual", "Other", "Other"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/1ebb4bbde0c73d5b95328b5b4645fc97-98.jpg", "descriptions": "Completely rewritten by award winning studio Rebellion PDC World Championship Darts 2009 promises to be the best darts game to date. PDC Darts 2009 has 18 top pro's featured in the game, new walk ins, licensed darts music, all new venues, brand new commentary, player editor, new controlCompletely rewritten by award winning studio Rebellion PDC World Championship Darts 2009 promises to be the best darts game to date. PDC Darts 2009 has 18 top pro's featured in the game, new walk ins, licensed darts music, all new venues, brand new commentary, player editor, new control systems with multiple assist modes, new career modes, female darts players and much much more. Fancy stepping up to the oche and taking on the pro's...Game on! Pro darts players included in the game :- Phil Taylor, Mark Dudbridge, Raymond van Barneveld, Roland Scholten, Peter Manley, Ronnie Baxter, Wayne Mardle, Terry Jenkins, Dennis Priestley, Kevin Painter, Adrian Lewis, Andy Hamilton, Alan Warriner-Little, Andy Jenkins, John Part , James Wade, Colin Lloyd and Alan Tabern. [Oxygen Interactive]… Expand"}, {"name": "N3II: Ninety-Nine Nights", "details_link": "https://www.metacritic.com/game/xbox-360/n3ii-ninety-nine-nights", "publisher": "Konami", "release_date": "Jun 29 2010", "developers": ["Phantagram", "FeelPlus"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 45, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/5fa6b5874a135840b80862cb4b46ba9b-98.jpg", "descriptions": "Ninety-Nine Nights II (N3II) is a high-energy action adventure game featuring epic battles against massive armies in a unique fantasy realm. In a mystical world of miracles and magic, humans co-exist alongside many other races including the elves, goblins, and ogres. But when the \"Lord ofNinety-Nine Nights II (N3II) is a high-energy action adventure game featuring epic battles against massive armies in a unique fantasy realm. In a mystical world of miracles and magic, humans co-exist alongside many other races including the elves, goblins, and ogres. But when the \"Lord of the Night\" suddenly appears, in a mere 3 months the fertile fields of the land are reduced to scorched earth. Before long, Orphea, the sacred land to the north, is besieged by the Army of the Night. Amidst the roar of battle, one man thunderously bursts through the ranks of a legion like a bolt of lightning - he is \"Galen,\" the ultimate warrior. Alone, he storms forward as he lays waste to the dark forces, letting nothing stop him in his path to Orphea Castle. Galen must battle through the hordes of enemies that await him and this onslaught escalates with imposing monstrous creatures that join the fray. Centering on \"the inheritance of life,\" a new battle between light and dark begins! [Konami]… Expand"}, {"name": "Heaven & Hell (2003)", "details_link": "https://www.metacritic.com/game/pc/heaven-hell-2003", "publisher": "cdv Software", "release_date": "Aug 31 2003", "developers": ["MadCat Interactive Software"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "General", "Fantasy"], "meta_score": 45, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/c65804ef3a204394f86454a9106e61fd-98.jpg", "descriptions": "...And lead us not into temptation - But that's the whole point! Indulge yourself. Take on the amusing role of a soul snatcher who wields omniscient power. Play Heaven & Hell: convince the cute and cuddly Earth dwellers that you're the long-awaited Redeemer who'll bring salvation to their...And lead us not into temptation - But that's the whole point! Indulge yourself. Take on the amusing role of a soul snatcher who wields omniscient power. Play Heaven & Hell: convince the cute and cuddly Earth dwellers that you're the long-awaited Redeemer who'll bring salvation to their chaotic world. Let no one doubt the truthfulness of your message. Your faithful fanatics launch rotten fruits and vegetables at opposing prophets, while your prophets pummel doubters into holy submission. Alternatively, use miracles and plagues to lead the disbelieving unto the path of the righteous. In this way, your flock shall grow and grow and grow... [CDV Software]… Expand"}, {"name": "007 Legends", "details_link": "https://www.metacritic.com/game/xbox-360/007-legends", "publisher": "Activision", "release_date": "Oct 16 2012", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 45, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/3/20179d002417a64ba0e656c66e0f3edb-98.jpg", "descriptions": "007 Legends features an original, overarching storyline that explores Bond's journey from a newly-minted secret agent to the most beloved, or hated, spy legend there has ever been. Players experience the conscience and gritty evolution of James Bond by tying together 5 classic Bond007 Legends features an original, overarching storyline that explores Bond's journey from a newly-minted secret agent to the most beloved, or hated, spy legend there has ever been. Players experience the conscience and gritty evolution of James Bond by tying together 5 classic Bond movie-inspired missions: Moonraker, On Her Majesty's Secret Service, Die Another Day, Licence to Kill, and Goldfinger.  A 6th mission based on this year’s SKYFALL is available post-launch as DLC.… Expand"}, {"name": "Stop Stress: A Day of Fury", "details_link": "https://www.metacritic.com/game/wii/stop-stress-a-day-of-fury", "publisher": "Abylight", "release_date": "Dec  7 2009", "developers": ["Abylight"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 45, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/8/47330ccc14d7ec2543769efadafdfa32-98.jpg", "descriptions": "[WiiWare]  Jack's dreams have become a nightmare, and only you can help him to get out. Climb into the skin of the most stressed-out man in the world, grab the baseball bat and prepare to let off more steam than ever before. Destroy everything around you, beat a path through traffic or at[WiiWare]  Jack's dreams have become a nightmare, and only you can help him to get out. Climb into the skin of the most stressed-out man in the world, grab the baseball bat and prepare to let off more steam than ever before. Destroy everything around you, beat a path through traffic or at the office, and face off against incredible hallucinations. How far will a day of fury take you? [Nintendo]… Expand"}, {"name": "Racquet Sports", "details_link": "https://www.metacritic.com/game/playstation-3/racquet-sports", "publisher": "Ubisoft", "release_date": "Sep 14 2010", "developers": ["Asobo Studio"], "platforms": "PlayStation 3", "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "General", "Individual", "Tennis", "Other", "Tennis"], "meta_score": 45, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/27ec7e0106c921a9a6c67edbbc9e279d-98.jpg", "descriptions": "Racquet Sports engages players in 30 rich graphical environments in iconic locations inspired by real-world landmarks, including the beach of Copacabana, the foot of Mount Fuji and the skyline of Dubai. The playing fields come to life with animated backgrounds, dynamic sound mixes and dayRacquet Sports engages players in 30 rich graphical environments in iconic locations inspired by real-world landmarks, including the beach of Copacabana, the foot of Mount Fuji and the skyline of Dubai. The playing fields come to life with animated backgrounds, dynamic sound mixes and day and night environments. Players have the option to perform with eleven different athletes, each having a distinct personality and flair. Each athlete is customizable with a total of over 30 outfits, 30 hairstyles and 15 different racquets available in the game.\t… Expand"}, {"name": "Napoleon Dynamite: The Game", "details_link": "https://www.metacritic.com/game/ds/napoleon-dynamite-the-game", "publisher": "Crave", "release_date": "Oct 23 2007", "developers": ["7 Studios"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Party / Minigame", "General"], "meta_score": 45, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/f2ff498058064212c8f99bf4f8a06b8e-98.jpg", "descriptions": "Step into the moon boots of Napoleon Dynamite and relive some flippin sweet movie moments like dancing to Z-Kwon, throwing the pigskin a quarter mile with Uncle Rico, smashing piñatas with Pedro and many more! Napoleon Dynamite brings 20 mini games for the DS and 30 for the PSP that reallyStep into the moon boots of Napoleon Dynamite and relive some flippin sweet movie moments like dancing to Z-Kwon, throwing the pigskin a quarter mile with Uncle Rico, smashing piñatas with Pedro and many more! Napoleon Dynamite brings 20 mini games for the DS and 30 for the PSP that really need you to use all your good skills to pass…even your bow-hunting skills for when you're hunting Wolverines with your uncle in Alaska! So hurry up and play already and all your wildest dreams will come true. Gosh! [Crave]… Expand"}, {"name": "NPPL Championship Paintball 2009", "details_link": "https://www.metacritic.com/game/playstation-3/nppl-championship-paintball-2009", "publisher": "Activision", "release_date": "Nov 18 2008", "developers": ["FUN Labs"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 14 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 45, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/5a6b411fb6b707399a8cbf7bdf314ed6-98.jpg", "descriptions": "The intensity of first-person-shooters and extreme sports collide in NPPL's Championship Paintball 2009. Feel the adrenaline of intense tournament and woodsball action as you take your game to the next level. Features over 35 tournaments including official NPPL and Millennium field locationsThe intensity of first-person-shooters and extreme sports collide in NPPL's Championship Paintball 2009. Feel the adrenaline of intense tournament and woodsball action as you take your game to the next level. Features over 35 tournaments including official NPPL and Millennium field locations and layouts; Huntington Beach, Commander's Cup, Toulouse, Malaga, and more; Plus intense woodsball levels; Includes Career, Quickplay, Multiplayer, Tutorial, and Training modes; Over 110+ pieces of officially licensed gear; JT Sports, Tippmann, Spyder, Smart Parts and many others! 3-D modeled using same technology used for Call of Duty weaponry. Upgradeable and unlockable markers, barrels, hoppers and protective gear. [Activision]… Expand"}, {"name": "Splat Renegade Paintball", "details_link": "https://www.metacritic.com/game/pc/splat-renegade-paintball", "publisher": "Take-Two Interactive", "release_date": "Oct 11 2005", "developers": ["Cat Daddy Games"], "platforms": "PC", "num_players": "14  Online", "genres": ["Sports", "Alternative", "Individual", "Other", "Other"], "meta_score": 45, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/d945ece27332d61480bdf0cdfd08f78b-98.jpg", "descriptions": "Splat Magazine Renegade Paintball challenges players with over 25 white-knuckle single player Tournament and Fieldball matches. For those who want more than single player competition, the game offers online multiplayer action via Xbox Live and System Link as well as Two Player Split Screen,Splat Magazine Renegade Paintball challenges players with over 25 white-knuckle single player Tournament and Fieldball matches. For those who want more than single player competition, the game offers online multiplayer action via Xbox Live and System Link as well as Two Player Split Screen, and Internet and LAN play for PC. Multiplayer and single player gamers can even design and customize their levels with the expansive Field Editor game feature. This option allows the player to create the ultimate paintball field to “gog” their opponents including choosing from 13 distinct indoor and outdoor environments such as arenas, stadiums, cities, hills, Wild West, military testing ground, and more. Additionally, hundreds of themed objects like trees; bushes, forts, buildings, junked cars and even a helicopter are available to be placed wherever needed. Adjust the size and texture of placed objects to increase the variety in the paintball arena. The ability to place power-ups such as: invincibility, ricochet, rapid fire, cannonball, sniper and ghost adds to the action and increase the competition. [Global Star Software]… Expand"}, {"name": "Narcos: Rise of the Cartels", "details_link": "https://www.metacritic.com/game/pc/narcos-rise-of-the-cartels", "publisher": "Curve Digital", "release_date": "Nov 19 2019", "developers": ["Kuju Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 45, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/9/0ba97e63010f3e6d93c3c5346568de00-98.jpg", "descriptions": "Welcome to Colombia, 1980's -- the fires of El Patron's empire have been lit, its influence spanning borders, and expansion unabated. Influence and corruption is rife; cops, guards, politicians and those in between are falling into the pocket of the Medellín Cartel, and after years ofWelcome to Colombia, 1980's -- the fires of El Patron's empire have been lit, its influence spanning borders, and expansion unabated. Influence and corruption is rife; cops, guards, politicians and those in between are falling into the pocket of the Medellín Cartel, and after years of production, America is finally taking notice.Narcos: Rise of the Cartels tells the story of the hit Netflix TV series, of the rise and fall of El Patron. Choose your side and ally with the DEA or conversely side with the Narcos. Explore recognisable locations from the show and take a role in pivotal world-altering events and battles that will define and shift the war on drugs.Form your team from a variety of class-specific roles, join leading characters, upgrade your skills and take part in brutal turn-based combat, where your actions will have consequence. Plata o Plomo?… Expand"}, {"name": "Project Root", "details_link": "https://www.metacritic.com/game/playstation-4/project-root", "publisher": "Reverb Triple XP", "release_date": "Apr 28 2015", "developers": ["Pablo Testa"], "platforms": ["PC", "PlayStation Vita", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 45, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/ad026dc4166fb116ebcb39d2a94bd17e-98.jpg", "descriptions": "Ending Demetrio Watts is in the hands of a group of unknowns. Depends on Arcturus. The classic choot-em-'up scenario."}, {"name": "Fantastic Four: Rise of the Silver Surfer", "details_link": "https://www.metacritic.com/game/xbox-360/fantastic-four-rise-of-the-silver-surfer", "publisher": "2K Games", "release_date": "Jun 15 2007", "developers": ["Visual Concepts"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 45, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/05d40dcf95e873f0ee85779a7b2c0e6e-98.jpg", "descriptions": "Marvel's first family of Super Heroes face its greatest challenge yet as the enigmatic, intergalactic herald, The Silver Surfer, comes to Earth to prepare it for destruction. Transform into any member of the Fantastic Four to fight enemies from the Fantastic Four Universe including SilverMarvel's first family of Super Heroes face its greatest challenge yet as the enigmatic, intergalactic herald, The Silver Surfer, comes to Earth to prepare it for destruction. Transform into any member of the Fantastic Four to fight enemies from the Fantastic Four Universe including Silver Surfer, Super Skrull and more. Battle in 4-player co-op with easy pick up and play ability. Combine super powers for devastating team attacks with the new Fusion Attack System. Truly destructible environments: smash, wreck, wreak havoc. Loads of unlockables including alternate Fantastic Four costumes, historical comic covers, and more. [2K Games]… Expand"}, {"name": "Supercar Street Challenge", "details_link": "https://www.metacritic.com/game/pc/supercar-street-challenge", "publisher": "Activision", "release_date": "Oct 30 2001", "developers": ["Exakt"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Simulation", "Arcade", "GT / Street", "Automobile"], "meta_score": 45, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/bbb48f2471fe36d94a5b0e67c5c792f1-98.jpg", "descriptions": "Design your own exotic supercar in the Styling Studio or choose one of 9 elite vehicles including the Salem S7 and the Lotus Concept Vehicle M220 to race on 23 courses in 7 cities, each with multiple routes and shortcuts. [Activision]"}, {"name": "Aliens: Colonial Marines", "details_link": "https://www.metacritic.com/game/pc/aliens-colonial-marines", "publisher": "Sega", "release_date": "Feb 11 2013", "developers": ["Gearbox Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 45, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/7/08dc0b441dbaa06099616407b2e73ed7-98.jpg", "descriptions": "In Aliens: Colonial Marines, players are part of a United States Colonial Marine squad and must prepare to face an Aliens assault more intense and horrific than ever before. Driven by an original story penned by renowned writers Bradley Thompson and David Weddle, Aliens: Colonial MarinesIn Aliens: Colonial Marines, players are part of a United States Colonial Marine squad and must prepare to face an Aliens assault more intense and horrific than ever before. Driven by an original story penned by renowned writers Bradley Thompson and David Weddle, Aliens: Colonial Marines retains the atmospheric look and feel of the original films while leveraging next-generation technology to create an entirely new interactive Aliens experience. Packing classic Aliens weaponry ranging from pulse rifles to flamethrowers as well as brand-new equipment and skills all within a squad-based combat system, players become an elite United States Colonial Marine. Featuring claustrophobic environments, a brooding soundtrack, and a multitude of surprises and shocks, players battle against menacing alien hordes in levels that include the stark interiors of the abandoned Sulaco and unique environments created specifically for the game. Aliens: Colonial Marines features a story driven single-player mode and an all-new four player co-op mode allowing players to share the chilling experience with three friends. In co-op mode, each player assumes the persona of a United States Colonial Marine and have a distinct role to play in the completion of every mission. [Sega]… Expand"}, {"name": "Made Man: Confessions of the Family Blood", "details_link": "https://www.metacritic.com/game/playstation-2/made-man-confessions-of-the-family-blood", "publisher": "Aspyr", "release_date": "Apr  2 2007", "developers": ["Silverback Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/037e91a3015fdbc972113796569da85b-98.jpg", "descriptions": "Made Man is based on real-world events and will allow players to assume the role of Joey Verola as he is indoctrinated into the dark world of organized crime and relive his life - every moment, every kill - as he rises through the ranks to become a \"Made Man\". Game created in conjunctionMade Man is based on real-world events and will allow players to assume the role of Joey Verola as he is indoctrinated into the dark world of organized crime and relive his life - every moment, every kill - as he rises through the ranks to become a \"Made Man\". Game created in conjunction with David Fisher, an accomplished author and respected authority on the Mafia, who possesses unparalleled knowledge and access into the inner workings of organized crime; Authentic Mafia-inspired gameplay scenarios, including bookmaking, racketeering, loan sharking, hijacking, assassinations, numbers running and high body count family wars; Over 25 weapons to master, including a Beretta, shotgun, machine gun and more; Full complement of melee weapons - chairs, pool cues and balls, bats, telephones - in the environments that can be used to wreak havoc, unleash pain and gain respect; Human shield/disarm mechanics for taking cover and getting out of sticky situations; Picture in Picture system, providing the player with greater awareness of the in-game action; and 20 diverse and fully-deformable environments. [Acclaim]… Expand"}, {"name": "Fighting Fantasy: The Warlock of Firetop Mountain", "details_link": "https://www.metacritic.com/game/ds/fighting-fantasy-the-warlock-of-firetop-mountain", "publisher": "Aspyr", "release_date": "Nov 23 2009", "developers": ["Big Blue Bubble Inc."], "platforms": ["iPhone/iPad", "DS"], "genres": ["Role-Playing", "Action RPG", "General"], "meta_score": 45, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/57710b5b4ca7c0e7d457dfb22a8b0bef-98.jpg", "descriptions": "Fighting Fantasy: The Warlock of Firetop Mountain is an elaborate roleplaying game based on the legendary book series by Steve Jackson and Ian Livingstone. The ancient Dwarven Keep at Firetop Mountain has been held by the sinister warlock Zagor for decades. Many have tried to plunder theFighting Fantasy: The Warlock of Firetop Mountain is an elaborate roleplaying game based on the legendary book series by Steve Jackson and Ian Livingstone. The ancient Dwarven Keep at Firetop Mountain has been held by the sinister warlock Zagor for decades. Many have tried to plunder the fabled riches hidden deep within the mountain, and none have returned. Only the evil scourge of the warlock and his minions stand in the way of your prize. [Aspyr Media]… Expand"}, {"name": "Call of Juarez: The Cartel", "details_link": "https://www.metacritic.com/game/playstation-3/call-of-juarez-the-cartel", "publisher": "Ubisoft", "release_date": "Jul 19 2011", "developers": ["Techland"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Modern", "Arcade"], "meta_score": 45, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/fda7057fe3aa181da122e4a5e1cc9f64-98.jpg", "descriptions": "Call of Juarez: The Cartel is the third game from the Call of Juarez series."}, {"name": "Dead Horde", "details_link": "https://www.metacritic.com/game/pc/dead-horde", "publisher": "DNS Development", "release_date": "Jul 27 2011", "developers": ["DNS Development"], "platforms": "PC", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 45, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/880370f1c3bf3b4b8ab63ef859a2ef3e-98.jpg", "descriptions": "As a survivor of the mutant virus together with a comrade or alone, you must make your way through the city levels, every new area uncovering new challenges to overcome and mutants to destroy. With a large variety of weapons at your disposal, together you must wipe out the hordes of fleshAs a survivor of the mutant virus together with a comrade or alone, you must make your way through the city levels, every new area uncovering new challenges to overcome and mutants to destroy. With a large variety of weapons at your disposal, together you must wipe out the hordes of flesh eating mutants. On the way you can use vehicles and clever puzzles must be solved, but teamwork is the key to survive the DEAD HORDE...… Expand"}, {"name": "Mr. Driller Online", "details_link": "https://www.metacritic.com/game/xbox-360/mr-driller-online", "publisher": "Namco Bandai Games", "release_date": "Apr  2 2008", "developers": ["Namco Bandai Games"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 45, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/ed22c8618b2a3dc50b00290de96f5139-98.jpg", "descriptions": "[Xbox Live Arcade]  Namco's popular Mr. Driller character comes to Xbox LIVE Arcade in Mr. DRILLER Online. Featuring the same addictive single player drilling action from the classic arcade game, Mr. DRILLER Online now includes online play. Drill down through the colored blocks to meet your[Xbox Live Arcade]  Namco's popular Mr. Driller character comes to Xbox LIVE Arcade in Mr. DRILLER Online. Featuring the same addictive single player drilling action from the classic arcade game, Mr. DRILLER Online now includes online play. Drill down through the colored blocks to meet your goal, but make sure you have enough air. All the drilling action you remember from the original arcade game is faithfully recreated in the Xbox LIVE version, with colorful graphics and challenging gameplay. Play the single-player Standard Driller or Quest Driller modes and keep up your air supply. Online modes: Take the game online with the split-screen Solo Battle, or try out the team-based Tag Battle. Simple controls and deep gameplay make for an addictive gaming experience, suitable for players of all ages and skill levels. [Microsoft]… Expand"}, {"name": "Infinity Runner", "details_link": "https://www.metacritic.com/game/playstation-4/infinity-runner", "publisher": "Wales Interactive", "release_date": "Apr 21 2015", "developers": ["Wales Interactive"], "platforms": ["PC", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Platformer", "Arcade", "3D"], "meta_score": 45, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/bbc5388e9be225483fb086ad4ce8fab9-98.jpg", "descriptions": "The Infinity is the grandest spaceship ever built by mankind; thrust into the void of space to secure humanity a new home among the stars. However, instead of discovering paradise, the inhabitants of The Infinity unlocked the door to a long-forgotten nightmare."}, {"name": "Grooverider Slot Car Thunder", "details_link": "https://www.metacritic.com/game/xbox/grooverider-slot-car-thunder", "publisher": "Encore Software, Inc.", "release_date": "Sep 26 2003", "developers": ["King of the Jungle"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 45, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/85df25e4f6140751e8a8a048fe5771b7-98.jpg", "descriptions": "Slot car racing isn't just for kids anymore. Set in a fantasy penthouse, Grooverider: Slot Car Thunder lets you experience quick lane changes, 360-degree loops, and crazy twists and turns on 20 slot car tracks. If you're a smart racer, you'll be sure to grab extra power-ups for a boost orSlot car racing isn't just for kids anymore. Set in a fantasy penthouse, Grooverider: Slot Car Thunder lets you experience quick lane changes, 360-degree loops, and crazy twists and turns on 20 slot car tracks. If you're a smart racer, you'll be sure to grab extra power-ups for a boost or blasting power. If you're not, then the tracks' spikes, mines, and other booby traps will surely be your downfall. In single- or multiplayer modes, you can get behind the wheel of any racecar, ranging from 1920s British cars to American stock cars. … Expand"}, {"name": "Generation Zero", "details_link": "https://www.metacritic.com/game/playstation-4/generation-zero", "publisher": "Avalanche Studios", "release_date": "Mar 26 2019", "developers": ["Avalanche Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 45, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/6ca9c7036d78660dc04bf8ad92c4e715-98.jpg", "descriptions": "Experience an explosive game of cat and mouse set in a vast open world - rendered with the award-winning Apex game engine. Experience an explosive game of cat and mouse set in a vast open world. In this reimagining of 1980’s Sweden, hostile machines have invaded the serene countryside, andExperience an explosive game of cat and mouse set in a vast open world - rendered with the award-winning Apex game engine. Experience an explosive game of cat and mouse set in a vast open world. In this reimagining of 1980’s Sweden, hostile machines have invaded the serene countryside, and you need to fight back while unraveling the mystery of what is really going on. By utilizing battle-tested guerilla tactics, you’ll be able to lure, cripple, or destroy enemies in intense, creative sandbox skirmishes.… Expand"}, {"name": "Hard Truck: Apocalypse", "details_link": "https://www.metacritic.com/game/pc/hard-truck-apocalypse", "publisher": "cdv Software", "release_date": "Jun 26 2006", "developers": ["Buka Entertainment", "Targem Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 45, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/eda3ad28afc75c5367a80b3b7d196e2c-98.jpg", "descriptions": "The plot puts you in a post-apocalyptic world. Enter the reality of the year 223 since Great Cataclysm. The world we knew was erased as the result of a mysterious accident. In less than one hour the most part of the world population disappeared.  Those who survived try to adapt to newThe plot puts you in a post-apocalyptic world. Enter the reality of the year 223 since Great Cataclysm. The world we knew was erased as the result of a mysterious accident. In less than one hour the most part of the world population disappeared.  Those who survived try to adapt to new conditions. There are new cities and settlements with trading alliances and mobsters. The vital transport hubs are controlled by gangsters and pillagers. Hence, armored heavy truck drivers have become the only resisting force against the \"shadow\" elements. You are to drive through dangerous regions of the new Earth with its mysterious places and hostile habitants.  Your ultimate goal is to reveal the guarded secrets of the lost civilization.  Your heavy truck is the only hope. You will need it to travel, earn your lining and fight your way through the perilous areas. It… Expand"}, {"name": "Hard Rock Casino", "details_link": "https://www.metacritic.com/game/playstation-2/hard-rock-casino", "publisher": "Crave", "release_date": "Nov 27 2006", "developers": ["Farsight Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 45, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/bbdc56d0e1d144abe93b2d26d8b12ded-98.jpg", "descriptions": "Become a high stakes roller at The Hard Rock Casino!  Challenge your luck at over 20 different casino games including Black Jack, Roulette, Craps, Pai Gow, Let It Ride, Texas Hold'em and more. 4 uniquely themed casinos, each with different house rules, table limits and games.\rOver 20Become a high stakes roller at The Hard Rock Casino!  Challenge your luck at over 20 different casino games including Black Jack, Roulette, Craps, Pai Gow, Let It Ride, Texas Hold'em and more. 4 uniquely themed casinos, each with different house rules, table limits and games.\rOver 20 different casino games: 9 Table Games; 5 Machine games (10+ varieties); 4 Poker Room Games; 4 Sports to Bet on. Game Tutorials that will give basic instructions, winning strategies and tips for each game. 3 different Tournaments to participate in, including Slots, Poker, Black Jack and other Table Games. Fully customizable player characters that offer many of options. Game Sharing via wireless play with one disc PSP system. [Crave]… Expand"}, {"name": "Hyperdimension Neptunia", "details_link": "https://www.metacritic.com/game/playstation-3/hyperdimension-neptunia", "publisher": "NIS America", "release_date": "Feb 15 2011", "developers": ["Idea Factory", "Compile Heart"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 45, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/c2de5fa918b84c3fa1f43d228ed09638-98.jpg", "descriptions": "This unique RPG features game consoles personified as goddesses, CPUs (Console Patron Units), who you can customize visually with equipment to enhance their stats. Players take the role of Neptune and follow her quest to save the captive Histoire. This leads her to face the corrupt monstersThis unique RPG features game consoles personified as goddesses, CPUs (Console Patron Units), who you can customize visually with equipment to enhance their stats. Players take the role of Neptune and follow her quest to save the captive Histoire. This leads her to face the corrupt monsters ravaging the world of Gamindustri unleashed by the evil Arfoire.… Expand"}, {"name": "Bravo Team", "details_link": "https://www.metacritic.com/game/playstation-4/bravo-team", "publisher": "Sony Interactive Entertainment", "release_date": "Mar  6 2018", "developers": ["Supermassive Games"], "platforms": "PlayStation 4", "num_players": "2 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 45, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/4/ebbfd115ed3a7367298bc3995392bfe6-98.jpg", "descriptions": "Bravo Team is set in a fictional modern day Eastern European city. When your escort mission goes awry and results in the President’s assassination, a country threatens to tear itself apart...and your team along with it. Teamwork is at the core of the game. Bravo Team has been developed toBravo Team is set in a fictional modern day Eastern European city. When your escort mission goes awry and results in the President’s assassination, a country threatens to tear itself apart...and your team along with it. Teamwork is at the core of the game. Bravo Team has been developed to allow both single player and online 2 player co-op where you and your teammate must use everything at your disposal to survive. Communication is essential...should you split-up? Who takes that weapon? What can you see? Together you’ll need to work out a strategy to succeed and make your escape. [Playstation.com]\r… Expand"}, {"name": "Rodea the Sky Soldier", "details_link": "https://www.metacritic.com/game/3ds/rodea-the-sky-soldier", "publisher": "NIS America", "release_date": "Nov 10 2015", "developers": ["Prope", "Kadokawa"], "platforms": ["Wii U", "3DS"], "genres": ["Action", "Platformer", "3D"], "meta_score": 45, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/b4897b8743ffaa85e12ca4f53fc7565b-98.jpg", "descriptions": "A thousand years ago, Emperor Geardo of the Naga Empire sent an army of machine soldiers to invade the sky kingdom of Garuda. Thanks to the efforts of Princess Cecilia and Rodea, a machine soldier who promised to protect Garuda, Emperor Geardo's assault was thwarted. In present day, aA thousand years ago, Emperor Geardo of the Naga Empire sent an army of machine soldiers to invade the sky kingdom of Garuda. Thanks to the efforts of Princess Cecilia and Rodea, a machine soldier who promised to protect Garuda, Emperor Geardo's assault was thwarted. In present day, a spirited inventor named Ion discovers an abandoned robot that has fallen into disrepair in the heart of a scorching desert. Upon completing her repairs, the robot stirs to life and reveals itself to be none other than Rodea. Stunned to find himself in the future, Rodea learns that the Naga Empire is no more and that Garuda has known peace for a thousand years. But this peace was not meant to last, for the forces of Naga have returned to wage war against Garuda. Remembering the promise he made 1,000 years ago, Rodea takes to the skies to defend Garuda from the Naga Empire once again. [NIS America]… Expand"}, {"name": "Smart Bomb", "details_link": "https://www.metacritic.com/game/psp/smart-bomb", "publisher": "Eidos Interactive", "release_date": "May 10 2005", "developers": ["Core Design Ltd."], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 45, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/db73f1320b1d769c804c3eb3c478e7b7-98.jpg", "descriptions": "Smart Bomb delivers a tense gameplay experience as players are faced with a series of fast paced, challenging 3D puzzles based around diffusing sophisticated AI bombs. Gamers are faced with a series of bomb modules split into tiers and each tier must be disabled to unlock the next. As a tierSmart Bomb delivers a tense gameplay experience as players are faced with a series of fast paced, challenging 3D puzzles based around diffusing sophisticated AI bombs. Gamers are faced with a series of bomb modules split into tiers and each tier must be disabled to unlock the next. As a tier is disabled the player moves closer to the detonator at the core of the bomb which must be deactivated before moving onto a new challenge. Single player action includes story, arcade and challenge modes while multiplayer mode challenges four players in a series of head to head gaming action. [Eidos Enteractive]… Expand"}, {"name": "Yet Another Zombie Defense HD", "details_link": "https://www.metacritic.com/game/xbox-one/yet-another-zombie-defense-hd", "publisher": "Awesome Games Studio", "release_date": "Jun 22 2018", "developers": ["Awesome Games Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 45, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/43066e57e465a56502b101a64158f0f5-98.jpg", "descriptions": "Yet Another Zombie Defense HD is all about defending yourself against hordes of darkness attacking you every single night. You know this is a lost cause, enemy forces are overwhelming and sooner or later your time will come. So, if you gonna go, do it with style, and pave yourself throughYet Another Zombie Defense HD is all about defending yourself against hordes of darkness attacking you every single night. You know this is a lost cause, enemy forces are overwhelming and sooner or later your time will come. So, if you gonna go, do it with style, and pave yourself through piles of fallen monsters before they squash you. There’s just one thing that matters - how long can YOU survive? Yet Another Zombie Defense HD is a top-down arcade zombie shooter with tactical/strategy elements. Prepare yourself before the night falls - build some defensive barricades, buy guns and ammo, set up turrets and stay alive as long as you can. Each night puts your skills to the test, as darkness forces become stronger with each wave. Make them remember you and shoot your way to a glorious end. [Microsoft]… Expand"}, {"name": "Catwoman", "details_link": "https://www.metacritic.com/game/xbox/catwoman", "publisher": "EA Games", "release_date": "Jul 20 2004", "developers": ["EA Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 45, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/7/38598ca23a83071bf7ffe1bb1c111cb9-98.jpg", "descriptions": "A classic story of betrayal and revenge unravels in Catwoman, which is based on the film from Warner Bros. Pictures. You'll control Catwoman, a woman brought back to life by a rare Egyptian cat, as she sets out to discover the truth about herself and her murderer. With Catwoman's catlikeA classic story of betrayal and revenge unravels in Catwoman, which is based on the film from Warner Bros. Pictures. You'll control Catwoman, a woman brought back to life by a rare Egyptian cat, as she sets out to discover the truth about herself and her murderer. With Catwoman's catlike skills, you can leap across roofs, run up walls, pounce on prey, and avoid enemy bullets. In addition, your can use her whip to swing through the air and use the interactive environments to knock your foes unconscious. … Expand"}, {"name": "Earthworm Jim 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/earthworm-jim-2", "publisher": "Majesco Games", "release_date": "May 31 2002", "developers": ["Super Empire"], "platforms": ["PC", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 45, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/ed351f006d631b5582c20f06c3ee4551-98.jpg", "descriptions": "Earthworm Jim returns in a madcap chase across the galaxy saving cows and thwarting lawyers all the way. Whip, run, jump and Snot swing your way through 10 of the most outrageous and untraditional levels anywhere. Returning favorite characters include; Princess What's-Her-Name, Psy-Crow,Earthworm Jim returns in a madcap chase across the galaxy saving cows and thwarting lawyers all the way. Whip, run, jump and Snot swing your way through 10 of the most outrageous and untraditional levels anywhere. Returning favorite characters include; Princess What's-Her-Name, Psy-Crow, Peter Puppy, Bob the Goldfish, and several new villains as well!… Expand"}, {"name": "Shadow the Hedgehog", "details_link": "https://www.metacritic.com/game/playstation-2/shadow-the-hedgehog", "publisher": "Sega", "release_date": "Nov 15 2005", "developers": ["Sonic Team"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 45, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/e971c667a3666fcf46d85cd5ce10cea4-98.jpg", "descriptions": "Shadow The Hedgehog allows players to collect an arsenal of weapons, vehicles, and objects to rocket through more than 50 unique missions. In his feature debut, Shadow is tormented by a dark past, struggling to discover his true identity. He is caught in a complex battle between aliens, theShadow The Hedgehog allows players to collect an arsenal of weapons, vehicles, and objects to rocket through more than 50 unique missions. In his feature debut, Shadow is tormented by a dark past, struggling to discover his true identity. He is caught in a complex battle between aliens, the G.U.N. army, and Dr. Eggman, and discovers that he may be the very element that will tip the scales between good and evil forever.  Is he an android created by Dr. Eggman? Is he the original Shadow simply suffering from amnesia? Or is there an even more sinister explanation? Now, gamers will decide in a race against time by choosing between any number of routes by which to unveil the secrets of his past. Multiple endings reflect critical decisions at every stage of the game. Gamers have ultimate control over Shadow's past, with the potential to rewrite his history time and time again. [Sega]… Expand"}, {"name": "Crash: Mind Over Mutant", "details_link": "https://www.metacritic.com/game/ds/crash-mind-over-mutant", "publisher": "Activision", "release_date": "Oct  7 2008", "developers": ["TOSE"], "platforms": ["Xbox 360", "DS"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 45, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/9/25ad9999628832e5c0468ab801a9002a-98.jpg", "descriptions": "In Crash Bandicoot: Mind over Mutant, a rejuvenated Neo Cortex is taking over the world one brain at a time!  Cortex and N. Brio devise a new kind of evil - a text-messaging, do-anything device which controls both mutant and bandicoot minds. Armed with his quick-wits and lightening agility,In Crash Bandicoot: Mind over Mutant, a rejuvenated Neo Cortex is taking over the world one brain at a time!  Cortex and N. Brio devise a new kind of evil - a text-messaging, do-anything device which controls both mutant and bandicoot minds. Armed with his quick-wits and lightening agility, Crash must free his friends, the titans and save the day. Not only does Crash gain the ability to control his enemies when he jacks them – now he can store his favorite monsters in his pocket, upgrade them and utilize their powers when they are most advantageous. Wumpa Island  becomes a \"free-romping\" environment, allowing players to travel and explore through intersecting worlds, with different gameplay options available depending on what creature you've brought along for the ride. Your co-op partner is Crash's sister, Coco, playable for the first time in the cooperative mode. Not only does Coco make the game that much more inviting for girls to pick up and play, she also brings with her a new tactile \"treasure hunt\" ability. [Sierra Entertainment]… Expand"}, {"name": "Battlestar Galactica", "details_link": "https://www.metacritic.com/game/pc/battlestar-galactica", "publisher": "Sierra Online", "release_date": "Oct 23 2007", "developers": ["Auran"], "platforms": ["Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 45, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/9/8af5eec952731797d42afdb288047e64-98.jpg", "descriptions": "Sign up to defend the Galactica, or play as the ruthless Cylons as they seek to remove the Human Race from existence. Pilot iconic ships from the Viper II to the Heavy Raider and lead your squadron in enormous fast-action multiplayer space combat (with up to eight players online) or playSign up to defend the Galactica, or play as the ruthless Cylons as they seek to remove the Human Race from existence. Pilot iconic ships from the Viper II to the Heavy Raider and lead your squadron in enormous fast-action multiplayer space combat (with up to eight players online) or play through the exciting single-player campaign. Play online with up to eight players in this relentless space-based action shooter in Firefight, Skirmish, and Domination modes. Pilot four human and four Cylon ships, from the Viper II to the Heavy Raider, each with unique weapon capabilities. Special weapons: Coordinate attacks with an arsenal of destructive weapons including missiles, guns, and more. Defensive maneuvers: Avoid annihilation with the barrel roll, quick turnabouts, and other aerial moves. [Microsoft]… Expand"}, {"name": "Rodea the Sky Soldier", "details_link": "https://www.metacritic.com/game/wii-u/rodea-the-sky-soldier", "publisher": "NIS America", "release_date": "Nov 10 2015", "developers": ["Prope", "Kadokawa"], "platforms": ["3DS", "Wii U"], "genres": ["Action", "Platformer", "3D"], "meta_score": 45, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/52bb66067a5e057fdc57fca0ff1b9962-98.jpg", "descriptions": "A thousand years ago, Emperor Geardo of the Naga Empire sent an army of machine soldiers to invade the sky kingdom of Garuda. Thanks to the efforts of Princess Cecilia and Rodea, a machine soldier who promised to protect Garuda, Emperor Geardo's assault was thwarted. In present day, aA thousand years ago, Emperor Geardo of the Naga Empire sent an army of machine soldiers to invade the sky kingdom of Garuda. Thanks to the efforts of Princess Cecilia and Rodea, a machine soldier who promised to protect Garuda, Emperor Geardo's assault was thwarted. In present day, a spirited inventor named Ion discovers an abandoned robot that has fallen into disrepair in the heart of a scorching desert. Upon completing her repairs, the robot stirs to life and reveals itself to be none other than Rodea. Stunned to find himself in the future, Rodea learns that the Naga Empire is no more and that Garuda has known peace for a thousand years. But this peace was not meant to last, for the forces of Naga have returned to wage war against Garuda. Remembering the promise he made 1,000 years ago, Rodea takes to the skies to defend Garuda from the Naga Empire once again. [NIS America]… Expand"}, {"name": "Warriors: Legends of Troy", "details_link": "https://www.metacritic.com/game/playstation-3/warriors-legends-of-troy", "publisher": "Koei Tecmo Games", "release_date": "Mar 15 2011", "developers": ["Tecmo Koei Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 44, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/0cbc436beb674f3f1813bd151209b048-98.jpg", "descriptions": "Three thousand years ago, a poet sang of heroes strong enough to stand alone against an army. For love, they sailed the world. For family, they made the greatest sacrifices. For honor, they stood and faced the will of gods and fought a war that shook the earth..."}, {"name": "Ford Bold Moves Street Racing", "details_link": "https://www.metacritic.com/game/xbox/ford-bold-moves-street-racing", "publisher": "Eidos Interactive", "release_date": "Sep 25 2006", "developers": ["Razorworks Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/6bb49c792aee0bd3982703112b1f9e37-98.jpg", "descriptions": "Ford Street Racing takes you to the sun-bleached streets of LA for a unique fast-and-furious team racing experience. Ford Street Racing has a unique team feature, putting you in control of your own racing team. Whilst racing through the dangerous streets of LA, switch between your three carsFord Street Racing takes you to the sun-bleached streets of LA for a unique fast-and-furious team racing experience. Ford Street Racing has a unique team feature, putting you in control of your own racing team. Whilst racing through the dangerous streets of LA, switch between your three cars racing and issuing commands to your team-mates to gain both a tactical and positional advantage. Block, draft and challenge your opponents as you get behind the wheel of any of the 18 officially licensed high performance Ford vehicles - from the classic 1970 Mk 1 Capri RS2600 to the recently announced 2007 Shelby Cobra GT500.… Expand"}, {"name": "Darkest of Days", "details_link": "https://www.metacritic.com/game/xbox-360/darkest-of-days", "publisher": "Valcon Games", "release_date": "Sep 10 2009", "developers": ["8Monkey Labs"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 44, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/7/214d93b1ae523b6dfbb1664d3ec10d86-98.jpg", "descriptions": "In Darkest of Days, you'll get to experience some of the most varied gameplay ever released in one title. Thigns will never get stale as you travel to distant times and fight alongside people from that time period. Fighting in Antietam (the bloodiest day of the American Civil War) feels muchIn Darkest of Days, you'll get to experience some of the most varied gameplay ever released in one title. Thigns will never get stale as you travel to distant times and fight alongside people from that time period. Fighting in Antietam (the bloodiest day of the American Civil War) feels much different than fighting on the side of the Russians at Tannenberg (where the Russians withstood 140,000 casualties in WWI). [Phantom EFX]… Expand"}, {"name": "The Scourge Project: Episodes 1 and 2", "details_link": "https://www.metacritic.com/game/pc/the-scourge-project-episodes-1-and-2", "publisher": "BITBOX S.L.", "release_date": "Apr  9 2010", "developers": ["Tragnarion Studios"], "platforms": "PC", "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 44, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/0/8578748f35f1e03a0d22b2ef676a3cfc-98.jpg", "descriptions": "Set in the near future, The Scourge Project throws you into the boots of Echo Squad, an elite group of mercenaries hired by The Tarn Initiative to deal a decisive blow against the power-hungry Nogari Corporation. Your mission: First, to locate and rescue Dr Reisbeck, Tarn's double-agentSet in the near future, The Scourge Project throws you into the boots of Echo Squad, an elite group of mercenaries hired by The Tarn Initiative to deal a decisive blow against the power-hungry Nogari Corporation. Your mission: First, to locate and rescue Dr Reisbeck, Tarn's double-agent inside Nogari; Second, to recover a piece of the meteorite fragment that Nogari has used to develop Ambrosia, the powerful new energy source with which they now control the world economy. Stranded on Nogari Island shortly after being mysteriously attacked during your covert insertion, and surrounded on all sides by hostile forces, you'll need all of your skill to stay alive as you fight your way through the chaos that has consumed the alien-infested facilities that lie before you... The Scourge Project is a 3rd-Person Shooter created using Unreal Engine 3 to deliver exciting single, co-op, and multiplayer game play. [Tragnarion Studios]… Expand"}, {"name": "Remothered: Broken Porcelain", "details_link": "https://www.metacritic.com/game/playstation-4/remothered-broken-porcelain", "publisher": "Modus Games", "release_date": "Oct 13 2020", "developers": ["Stormind Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 44, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/53b38e444f203bff50a54d43fc270be7-98.jpg", "descriptions": "Broken Porcelain brings an abundance of welcome changes to the series, introducing new gameplay and storytelling elements that breathe new life into the characters and an unprecedented level of immersion in this haunting adventure – perfect for both new and returning fans to the series."}, {"name": "Sword of the Stars II: Lords of Winter", "details_link": "https://www.metacritic.com/game/pc/sword-of-the-stars-ii-lords-of-winter", "publisher": "Paradox Interactive", "release_date": "Oct 28 2011", "developers": ["Kerberos Productions"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "General", "Sci-Fi", "Sci-Fi"], "meta_score": 44, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/9/140527ebfbc7948e26f8be440992b065-98.jpg", "descriptions": "In Sword of the Stars 2, gamers will be reaquianted with the original six races from Swords of the Stars I and its expansions as well as reveal the dark secret of the original series, the Suul’ka - an ancient race that is responsible for tampering with the Liir, Zuul, and other races in theIn Sword of the Stars 2, gamers will be reaquianted with the original six races from Swords of the Stars I and its expansions as well as reveal the dark secret of the original series, the Suul’ka - an ancient race that is responsible for tampering with the Liir, Zuul, and other races in the SotS universe! Not limited to another entire new race and their unique drive technology, SotS2 will be a major step forward in the SotS approach to 4X gameplay, taking the easy-to-learn-hard-to-master philosophy set out in SotS1 and following that path to a new standard in space strategy games.… Expand"}, {"name": "Zoo Tycoon DS", "details_link": "https://www.metacritic.com/game/ds/zoo-tycoon-ds", "publisher": "THQ", "release_date": "Oct 11 2005", "developers": ["Altron"], "platforms": ["PC", "DS"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 44, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/4a67ecd9ee235ac32398bf9a68fce663-98.jpg", "descriptions": "Encounter the ultimate zoo experience in Zoo Tycoon DS. Create the zoo of your dreams as you select your favorite animals and re-create their natural habitats. Get up close and personal while collecting and caring for the world’s most popular animals from every continent. Manage yourEncounter the ultimate zoo experience in Zoo Tycoon DS. Create the zoo of your dreams as you select your favorite animals and re-create their natural habitats. Get up close and personal while collecting and caring for the world’s most popular animals from every continent. Manage your environment properly and achieve the ultimate goal of a zoo full of happy animals and customers. [THQ]… Expand"}, {"name": "Watchmen: The End Is Nigh Part 2", "details_link": "https://www.metacritic.com/game/pc/watchmen-the-end-is-nigh-part-2", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jul 29 2009", "developers": ["Deadline Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 44, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/03cf44e3217998bcccb32aebb372038e-98.jpg", "descriptions": "[Downloadable Game]  It's June 1977, and any day now the passage of the Keene Act will outlaw all masked vigilantes not sanctioned by the government. Rorschach has uncovered a mysterious missing person's case. Together with the help of Nite Owl, the pair has set out to find the young girl in[Downloadable Game]  It's June 1977, and any day now the passage of the Keene Act will outlaw all masked vigilantes not sanctioned by the government. Rorschach has uncovered a mysterious missing person's case. Together with the help of Nite Owl, the pair has set out to find the young girl in Watchmen: The End is Nigh Part 2. Their search takes them deep into the depraved, sleazy corners of the city, and eventually face-to-face with the mysterious Twilight Lady. The seedy underbelly of New York beckons … will you take the call? The journey continues: Rorschach and Nite Owl once again prowl the back alleys of the city in their quest for justice. Play as either character throughout the game. Voice acting: Patrick Wilson and Jackie Earl Haley reprise their roles as Nite Owl and Rorschach from the film, supplying voiceovers for the characters. Game modes: Play in single player or split-screen co-op multiplayer mode and bring justice to the city. [Warner Bros.]… Expand"}, {"name": "Teenage Mutant Ninja Turtles: Mutants in Manhattan", "details_link": "https://www.metacritic.com/game/playstation-4/teenage-mutant-ninja-turtles-mutants-in-manhattan", "publisher": "Activision", "release_date": "May 24 2016", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 44, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/99ca20c49ee0665b62741c13686c8293-98.jpg", "descriptions": "Battle with your brothers through the sewers, subways, and streets of New York to defeat Shredder and Krang’s evil organization, Foot by Foot. Unleash custom combat skills and powerful team combos to save Manhattan from the overwhelming dark forces growing in the shadows."}, {"name": "Dinotopia: The Sunstone Odyssey", "details_link": "https://www.metacritic.com/game/xbox/dinotopia-the-sunstone-odyssey", "publisher": "TDK Mediactive", "release_date": "Aug  5 2003", "developers": ["Vicious Cycle"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/1b85d2be16d4f0ae6c983a89238aa021-98.jpg", "descriptions": "A lawless band, known as the Outsiders, has threatened Dinotopia. They have invaded the towns, enraged the carnosaurs, and revived the mechanical strutters, and they have even taken your family hostage. Now it's your job to defend Dinotopia against dangerous foes. You'll travel through 24A lawless band, known as the Outsiders, has threatened Dinotopia. They have invaded the towns, enraged the carnosaurs, and revived the mechanical strutters, and they have even taken your family hostage. Now it's your job to defend Dinotopia against dangerous foes. You'll travel through 24 challenging levels on foot, in the air, and in vehicles. Dinotopia: The Sunstone Odyssey takes you on an adventure that blends hand-to-hand fighting, puzzle-solving, and exploration on a mysterious island.… Expand"}, {"name": "Superman: The Man of Steel", "details_link": "https://www.metacritic.com/game/xbox/superman-the-man-of-steel", "publisher": "Atari", "release_date": "Nov 19 2002", "developers": ["Circus Freak"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 44, "users_score": 0.8, "image": "https://static.metacritic.com/images/products/games/1/0d599217b1604200fa5af3f8b87c0722-98.jpg", "descriptions": "Assume the role of Superman as he tries to avert disaster in Metropolis. Back for vengeance and determined to control Metropolis, Brainiac 13 has unleashed an unstoppable army of robotic drones that destroys everything in its path. To stop these drones from creating a giant Brainiac 13Assume the role of Superman as he tries to avert disaster in Metropolis. Back for vengeance and determined to control Metropolis, Brainiac 13 has unleashed an unstoppable army of robotic drones that destroys everything in its path. To stop these drones from creating a giant Brainiac 13 monolith, you must travel to the far reaches of space and into the depths of the Phantom Zone. With Superman's powers and combat skills, you can destroy enemy robots, rescue civilians, and fly around lush environments.… Expand"}, {"name": "ESPN National Hockey Night", "details_link": "https://www.metacritic.com/game/playstation-2/espn-national-hockey-night", "publisher": "Konami", "release_date": "Mar 25 2001", "developers": ["Kush Games"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/824ea4390cfffb1ecabbcca2e48665a8-98.jpg", "descriptions": "Konami's first NHL game for the PS2 includes exhibition, season, playoffs and create-a-player modes with a full statistical package."}, {"name": "Watchmen: The End Is Nigh Part 2", "details_link": "https://www.metacritic.com/game/xbox-360/watchmen-the-end-is-nigh-part-2", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Aug 26 2009", "developers": ["Deadline Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 44, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/38346a001ae0e9952f6cd5af99a67f19-98.jpg", "descriptions": "[Xbox Live Arcade]  It's June 1977, and any day now the passage of the Keene Act will outlaw all masked vigilantes not sanctioned by the government. Rorschach has uncovered a mysterious missing person's case. Together with the help of Nite Owl, the pair has set out to find the young girl in[Xbox Live Arcade]  It's June 1977, and any day now the passage of the Keene Act will outlaw all masked vigilantes not sanctioned by the government. Rorschach has uncovered a mysterious missing person's case. Together with the help of Nite Owl, the pair has set out to find the young girl in Watchmen: The End is Nigh Part 2. Their search takes them deep into the depraved, sleazy corners of the city, and eventually face-to-face with the mysterious Twilight Lady. The seedy underbelly of New York beckons … will you take the call? The journey continues: Rorschach and Nite Owl once again prowl the back alleys of the city in their quest for justice. Play as either character throughout the game. Voice acting: Patrick Wilson and Jackie Earl Haley reprise their roles as Nite Owl and Rorschach from the film, supplying voiceovers for the characters. Game modes: Play in single player or split-screen co-op multiplayer mode and bring justice to the city. [Warner Bros.]… Expand"}, {"name": "Hummer Badlands", "details_link": "https://www.metacritic.com/game/xbox/hummer-badlands", "publisher": "2K Games", "release_date": "Apr 14 2006", "developers": ["Eutechnyx"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 44, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/31b16913d9d00ca90bd1a8a05e48c310-98.jpg", "descriptions": "Swap paint like never before as you drive every Hummer vehicle available, customized with incredible add-ons! Battle head-to-head in multi-player mode or pit Hummer against Hummer in extreme off-road challenges! Features include being able to drive every Hummer available, multiple gameSwap paint like never before as you drive every Hummer vehicle available, customized with incredible add-ons! Battle head-to-head in multi-player mode or pit Hummer against Hummer in extreme off-road challenges! Features include being able to drive every Hummer available, multiple game modes, racing on or off-road, as well as many others for hours of enjoyment!… Expand"}, {"name": "TMNT: Mutant Melee", "details_link": "https://www.metacritic.com/game/gamecube/tmnt-mutant-melee", "publisher": "Konami", "release_date": "Mar 16 2005", "developers": ["Konami Computer Entertainment Hawaii"], "platforms": ["PC", "GameCube"], "num_players": "2  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 44, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/061fc1be2c5cc85b08e9bb2838aeb23e-98.jpg", "descriptions": "The Teenage Mutant Ninja Turtles return in their first party game experience. Gather your friends to join you in a variety of minigames and adventures that feature more than 20 playable characters, including all four turtles, Casey Jones, April O'Neil, Master Splinter, and even the evilThe Teenage Mutant Ninja Turtles return in their first party game experience. Gather your friends to join you in a variety of minigames and adventures that feature more than 20 playable characters, including all four turtles, Casey Jones, April O'Neil, Master Splinter, and even the evil Shredder. TMNT Mutant Melee features two modes--adventure story and melee match--which are playable either solo or with up to three other players. In each mode, you can collect tokens to unlock additional content.… Expand"}, {"name": "Last Rebellion", "details_link": "https://www.metacritic.com/game/playstation-3/last-rebellion", "publisher": "NIS America", "release_date": "Feb 23 2010", "developers": ["Hit Maker"], "platforms": "PlayStation 3", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 44, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/3/5c016fbfc08406269b52778e8bd327f2-98.jpg", "descriptions": "In Last Rebellion, assume the roles of Nine and Aisha who share a single body in the cursed world of Junovald, a land where two gods govern life and death. Decimate your enemies using an intuitive, turn-based battle system which allows you to target individual body parts, as you protect theIn Last Rebellion, assume the roles of Nine and Aisha who share a single body in the cursed world of Junovald, a land where two gods govern life and death. Decimate your enemies using an intuitive, turn-based battle system which allows you to target individual body parts, as you protect the world from demons and seek revenge for your father's death. Junovald's forsaken landscape truly comes to life through this title's beautiful artwork and its morose, gothic soundtrack. [NIS America]… Expand"}, {"name": "Chronovolt", "details_link": "https://www.metacritic.com/game/playstation-vita/chronovolt", "publisher": "Playerthree", "release_date": "Dec 31 2012", "developers": ["Playerthree"], "platforms": "PlayStation Vita", "genres": ["Puzzle", "Action", "General", "General"], "meta_score": 44, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/6/d4af69ba1d147b68cba95dc14b6aee49-98.jpg", "descriptions": "A puzzle-platformer with steampunk influences."}, {"name": "Dead Island: Ryder White", "details_link": "https://www.metacritic.com/game/xbox-360/dead-island-ryder-white", "publisher": "Deep Silver", "release_date": "Feb  1 2012", "developers": ["Techland"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 44, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/293f7841abf6153bce665e1a51f0e58b-98.jpg", "descriptions": "The DLC stars Ryder White as a newly playable character and offers a single player campaign with several hours of story content with twists and turns that will shed new light on the game's happenings. Two blueprints and weapons will further expand the already impressive arsenal of Dead Island."}, {"name": "The Mummy Returns", "details_link": "https://www.metacritic.com/game/playstation-2/the-mummy-returns", "publisher": "Universal Interactive", "release_date": "Oct  3 2001", "developers": ["Blitz Games"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 44, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/ad4a28bd5a5ac6d7a928b4b1909d677c-98.jpg", "descriptions": "Battle Imhotep and his legions of mummies! Avoid torrents of water and death-defying traps! Go on a wild blimp ride and fight atop a double-decker bus! But can you survive long enough to face The Scorpion King? [Universal]"}, {"name": "State of Emergency 2", "details_link": "https://www.metacritic.com/game/playstation-2/state-of-emergency-2", "publisher": "SouthPeak Games", "release_date": "Feb 14 2006", "developers": ["DC Studios"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 44, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/92079513a180a49906509a7b3d676b74-98.jpg", "descriptions": "Spanky and his gang of revolutionaries are back, and this time they're bigger and badder! A new, high-performance graphics engine puts you in the middle of hundreds of chaotic rioters, AND, this time, you control the riot. A deeper and more engaging Story Mode allows you to switch betweenSpanky and his gang of revolutionaries are back, and this time they're bigger and badder! A new, high-performance graphics engine puts you in the middle of hundreds of chaotic rioters, AND, this time, you control the riot. A deeper and more engaging Story Mode allows you to switch between the principal characters and take advantage of each character's unique abilities, such as MacNeil's sharp-shooting or Spanky's gang control. Ten years have passed and the Corporation has re-emerged, stronger and more brutal than ever. Join Spanky and his cohorts to ignite the flames of revolution against the oppressive Corporation and create a full-blown State of Emergency! A new, high performance graphics engine which can render up to 500 characters in each level. Features bigger and better weapons, including rocket launchers, mines, grenades, C-4, Molotov cocktails, as well as various clubs, knives, and numerous guns. Features a Multi-Player Arcade Mode which will enable players to riot for hours with their friends.… Expand"}, {"name": "AeternoBlade II", "details_link": "https://www.metacritic.com/game/switch/aeternoblade-ii", "publisher": "Corecell Technology", "release_date": "Oct 11 2019", "developers": ["Corecell Technology"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 44, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/6/0eebfd4b0fcc069c05804f5e68beb6e9-98.jpg", "descriptions": null}, {"name": "Fimbul", "details_link": "https://www.metacritic.com/game/switch/fimbul", "publisher": "EuroVideo Medien", "release_date": "Feb 28 2019", "developers": ["Zaxis"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/214eedc168b2b33653cc86bbf42f12c2-98.jpg", "descriptions": "Fimbul combines intense Vikingbattles with a deep story that unfolds through in-game comics to bring the frozen world of the Norse sagas to life. Immerse yourself in the blistering winter preceding Ragnarok -- The Fimbul Winter."}, {"name": "Golden Axe: Beast Rider", "details_link": "https://www.metacritic.com/game/playstation-3/golden-axe-beast-rider", "publisher": "Sega", "release_date": "Oct 14 2008", "developers": ["Secret Level"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 44, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/734fdab4444103a5884c4845f5be88af-98.jpg", "descriptions": "Golden Axe: Beast Rider delivers action-RPG thrills as a small band of Riders embark on an epic adventure to recruit allies, expose the enemy and prevent the annihilation of their breed. Delivering an intense and unique combat experience, players charge into battle on the backs of ferociousGolden Axe: Beast Rider delivers action-RPG thrills as a small band of Riders embark on an epic adventure to recruit allies, expose the enemy and prevent the annihilation of their breed. Delivering an intense and unique combat experience, players charge into battle on the backs of ferocious beasts or take their chances with the enemy while on foot. Fighting skill, wits and even magic are all called into action as players immerse themselves in the struggle to defeat an evil intent on enslaving the remains of civilization. [Sega]… Expand"}, {"name": "MotoGP 08", "details_link": "https://www.metacritic.com/game/wii/motogp-08", "publisher": "Capcom", "release_date": "Mar 24 2009", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 44, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/eeceaff7d1f80531d0ba37e616c768b7-98.jpg", "descriptions": "The official game of the 2008 Season, Moto GP 08 features all the official riders, bikes and tracks from this year's event providing the definitive 2 wheeled racing experience. For the first time you can race as yourself in a team against the world's elite riders, across 125cc, 250cc and GPThe official game of the 2008 Season, Moto GP 08 features all the official riders, bikes and tracks from this year's event providing the definitive 2 wheeled racing experience. For the first time you can race as yourself in a team against the world's elite riders, across 125cc, 250cc and GP class bikes. You'll also get an opportunity to race in teh new circuits of Indianapolis in the US an drace at night in Qatar. Be successful and you'll earn rider points that you can then use to upgrade your bike. [Capcom]… Expand"}, {"name": "Hard Rock Casino", "details_link": "https://www.metacritic.com/game/psp/hard-rock-casino", "publisher": "Crave", "release_date": "Apr 24 2007", "developers": ["Farsight Studios"], "platforms": ["PlayStation 2", "PSP"], "num_players": "8  Online", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/c734c67527a05555fe8e85ab31d9e414-98.jpg", "descriptions": "Become a high stakes roller at The Hard Rock Casino!  Challenge your luck at over 20 different casino games including Black Jack, Roulette, Craps, Pai Gow, Let It Ride, Texas Hold'em and more. 4 uniquely themed casinos, each with different house rules, table limits and games.\rOver 20Become a high stakes roller at The Hard Rock Casino!  Challenge your luck at over 20 different casino games including Black Jack, Roulette, Craps, Pai Gow, Let It Ride, Texas Hold'em and more. 4 uniquely themed casinos, each with different house rules, table limits and games.\rOver 20 different casino games: 9 Table Games; 5 Machine games (10+ varieties); 4 Poker Room Games; 4 Sports to Bet on. Game Tutorials that will give basic instructions, winning strategies and tips for each game. 3 different Tournaments to participate in, including Slots, Poker, Black Jack and other Table Games. Fully customizable player characters that offer many of options. Game Sharing via wireless play with one disc PSP system. [Crave]… Expand"}, {"name": "Balan Wonderworld", "details_link": "https://www.metacritic.com/game/playstation-4/balan-wonderworld", "publisher": "Square Enix", "release_date": "Mar 26 2021", "developers": ["Square Enix", "Arzest", "Balan Company"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 44, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/d0308368fcfcbfc6c70e128307b1be32-98.jpg", "descriptions": "Balan Wonderworld is a wondrous action-platformer game themed around a mysterious musical theatre. The stars of the show will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land of Wonderworld. Here memories and vistas from theBalan Wonderworld is a wondrous action-platformer game themed around a mysterious musical theatre. The stars of the show will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land of Wonderworld. Here memories and vistas from the real world mix with the things that people hold dear. Twelve different tales await our stars in Wonderworld, each with their own unique quirks. They will explore all corners of these labyrinthine stages, using all the tricks and gimmicks hidden along the way, to get to the heart of each touching story.… Expand"}]