[{"name": "Fable II: See the Future", "details_link": "https://www.metacritic.com/game/xbox-360/fable-ii-see-the-future", "publisher": "Microsoft Game Studios", "release_date": "May 12 2009", "developers": ["Lionhead Studios"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 62, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/ae2806c55955d7d0e2025c31f1377925-98.jpg", "descriptions": "(Downloadable Content)  See the Future is an action-packed journey that requires you to lift the curses placed on three mysterious items that have come into the possession of Murgo the Trader. In See the Future, heed the call for a hero to restore color and balance to the world, or let(Downloadable Content)  See the Future is an action-packed journey that requires you to lift the curses placed on three mysterious items that have come into the possession of Murgo the Trader. In See the Future, heed the call for a hero to restore color and balance to the world, or let Albion fall to the wayside. Those who emerge victorious will receive the ultimate reward - a quest that provides a vision of Albion's future and what lies ahead for those born into the heroic bloodline. The fantastical new quests in See the Future will bring you face to face with new characters, creatures, events and legendary artifacts. Get ready to meet new characters and creatures. Murgo: Remember him from the childhood sequence of Fable II? Murgo returns to Bowerstone Market to bring an amazing array of new wares, including potions that can transform canine companions into new breeds. The Ghosts of the Snowglobe Quest: Holding a disturbing secret, the small model village inside it was once a real town in Albion. The people who once inhabited it are now ghosts condemned to endless torment until the shadowy threat that cursed them is defeated. The Cursed Knight Quest: Forever banished to a land beyond the dead, the Cursed Knight awaits a hero who has the strength and will to dress up in convincing costumes, even imitating a hobbe or balverine, to save him from his fate. The Colosseum: The Colosseum puts even the Crucible to shame. Only the greatest heroes have triumphed here. Your abilities will be put to the test to prove yourself in combat once and for all, to win the ultimate in prizes. [Microsoft]… Expand"}, {"name": "Hot Wheels Stunt Track Challenge", "details_link": "https://www.metacritic.com/game/playstation-2/hot-wheels-stunt-track-challenge", "publisher": "THQ", "release_date": "Nov 10 2004", "developers": ["Climax Group"], "platforms": "PlayStation 2", "num_players": "6  Online", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/af39a438742256edb529810a6fea3459-98.jpg", "descriptions": "In the Hot Wheels Stunt Track Challenge videogames, players are thrust into competition on a hot new extreme game show -- on which they must complete perilous stunts and win intense races. The goal is to beat opponents and impress the audience with fearless maneuvers, in order to advanceIn the Hot Wheels Stunt Track Challenge videogames, players are thrust into competition on a hot new extreme game show -- on which they must complete perilous stunts and win intense races. The goal is to beat opponents and impress the audience with fearless maneuvers, in order to advance into other 'episodes' and win better cars. At the end of the season, the driver with the most courage and best stunt skills will cruise away in a gold-plated car as the Hot Wheels Champion. Players will choose from 30 authentic Hot Wheels cars to compete in 24 stunt challenges on 12 different tracks set in environments such as Buccaneer Bay, Jurassic Jam, Zero Gravity Zone, Tiki Island, Spider Alley and Lava Land. Before each race, players can enter the garage to customize their cars with unique colors, wheels and decals. [THQ]… Expand"}, {"name": "Yu-Gi-Oh! Capsule Monster Coliseum", "details_link": "https://www.metacritic.com/game/playstation-2/yu-gi-oh!-capsule-monster-coliseum", "publisher": "Konami", "release_date": "Oct 26 2004", "developers": ["WinkySoft"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 62, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/350d33526c2b1e8dee7a54a49440684f-98.jpg", "descriptions": "Yet another Yu-Gi-Oh! Strategy Board Game.  Prove your skills in heated battles on a multitude of game boards to attain the title of King of Capsule Monsters, the supreme rank of strength at the Coliseum. Move the monsters across the map and destroy the enemy. Map mutations can suddenly turnYet another Yu-Gi-Oh! Strategy Board Game.  Prove your skills in heated battles on a multitude of game boards to attain the title of King of Capsule Monsters, the supreme rank of strength at the Coliseum. Move the monsters across the map and destroy the enemy. Map mutations can suddenly turn the tides of battle. Collect monsters to round out your deck and strengthen your army. Evolve and fuse your monsters to make your deck more powerful.… Expand"}, {"name": "Wildlife Park", "details_link": "https://www.metacritic.com/game/pc/wildlife-park", "publisher": "Encore Software, Inc.", "release_date": "Nov 14 2003", "developers": ["B-Alive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Business / Tycoon"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/048d7bea47e4a8e2e7082f86e06052af-98.jpg", "descriptions": "Here is your chance to create a giant and beautiful zoo. A park so amazing, it would be impossible to build in real life. In Wildlife Park you must build an animal park from scratch, managing it so your visitors will spend their money. You begin with just the park area, a ticket booth andHere is your chance to create a giant and beautiful zoo. A park so amazing, it would be impossible to build in real life. In Wildlife Park you must build an animal park from scratch, managing it so your visitors will spend their money. You begin with just the park area, a ticket booth and some money. From there you can buy animals, build the zoo, hire employees and then open the gates and let the visitors come. [Encore Software]… Expand"}, {"name": "Auto Modellista", "details_link": "https://www.metacritic.com/game/gamecube/auto-modellista", "publisher": "Capcom", "release_date": "Sep 30 2003", "developers": ["Capcom"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 62, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/98cf5b8ecde111b666926e7598300ddb-98.jpg", "descriptions": "Handle the road like a pro with your own customizable racing machine or your choice of more than 60 top-of-the-line models. Race vehicles from manufacturers, including Toyota, Nissan, Honda, Subaru, and Mitsubishi, against up to eight drivers online or up to two drivers in split-screen mode.Handle the road like a pro with your own customizable racing machine or your choice of more than 60 top-of-the-line models. Race vehicles from manufacturers, including Toyota, Nissan, Honda, Subaru, and Mitsubishi, against up to eight drivers online or up to two drivers in split-screen mode. You'll tear past spectators, maneuver your way through tight mountain passes, and round each corner of the race track in your dream car at lightning speeds. … Expand"}, {"name": "X2: Wolverine's Revenge", "details_link": "https://www.metacritic.com/game/gamecube/x2-wolverines-revenge", "publisher": "Activision", "release_date": "Apr 14 2003", "developers": ["GenePool"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/7f4d890d628cf78d599e88a12d8c7895-98.jpg", "descriptions": "X-Men's most dangerous weapon is out for vengeance.  In X2 Wolverine's Revenge, you play as Wolverine as he rushes to find the antidote to a virus that was implanted into his body.  Unsheathe your razor-sharp claws, unleash lethal combo attacks, and use accelerated healing powers as you tearX-Men's most dangerous weapon is out for vengeance.  In X2 Wolverine's Revenge, you play as Wolverine as he rushes to find the antidote to a virus that was implanted into his body.  Unsheathe your razor-sharp claws, unleash lethal combo attacks, and use accelerated healing powers as you tear into intense action and stealth scenarios.  Face off with Sabretooth, Wendigo, Juggernaut, and Magneto, while Professor X and Beast help you search for a cure. As Wolverine, you can become the ultimate fighting machine.… Expand"}, {"name": "Project Nomads", "details_link": "https://www.metacritic.com/game/pc/project-nomads", "publisher": "cdv Software", "release_date": "Nov  1 2002", "developers": ["Radon Labs"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Adventure", "Real-Time", "3D", "Fantasy", "Third-Person", "General", "Fantasy"], "meta_score": 62, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/87fff46a15b507d2a927228b03ec008c-98.jpg", "descriptions": "Catastrophe, first part: The planet of the Nomads burst. Catastrophe, second part: A few survivors drift on rocky islands through space and time. Anyway, the catastrophe has its good sides as well: 1.) A fascinating world in airy spaces was created. 2.) The game character you choose -Catastrophe, first part: The planet of the Nomads burst. Catastrophe, second part: A few survivors drift on rocky islands through space and time. Anyway, the catastrophe has its good sides as well: 1.) A fascinating world in airy spaces was created. 2.) The game character you choose - mysterious Susie, clever John or strong Goliath - has survived. 3.) You have a task: Destroy the originators of the catastrophe and other creeps. 4.) Get ready for the final countdown. With magic items, you can transform your island to a battle giant teeming with weapons. You also use these items to produce heavily armed flight devices for the search of further artefacts and in order to gain raw materials for energy supply. There's heaps to do. Snap to it! [CDV]… Expand"}, {"name": "Stuart Little 2", "details_link": "https://www.metacritic.com/game/playstation/stuart-little-2", "publisher": "SCEA", "release_date": "Jul 17 2002", "developers": ["Magenta Software"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/44c51e19df111a5cf3b60abb0be332c5-98.jpg", "descriptions": "Join Stuart Little on his fun-filled journey through grand Manhattan. The evil Falcon has stolen some of the city's most precious jewelry and it's up to Stuart to get them back! Luckily, Stuart wants your help and with it, the sinister Falcon doesn't stand a chance!"}, {"name": "Rock Manager", "details_link": "https://www.metacritic.com/game/pc/rock-manager", "publisher": "DreamCatcher Interactive", "release_date": "Jun 30 2002", "developers": ["DreamCatcher Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/90820f02593d51d6d9322fa602a8cef0-98.jpg", "descriptions": "Rock Manager puts you in complete control of a rock band. Your task is simple; make them stars! Bribe the local radio station to get more airplay for your band, or buy up all your records to create increased demand. Use any means necessary to make the band climb the charts - anything goes inRock Manager puts you in complete control of a rock band. Your task is simple; make them stars! Bribe the local radio station to get more airplay for your band, or buy up all your records to create increased demand. Use any means necessary to make the band climb the charts - anything goes in this strung-out world of swindle, lies and rock n' roll. [Dreamcatcher]… Expand"}, {"name": "Wave Rally", "details_link": "https://www.metacritic.com/game/playstation-2/wave-rally", "publisher": "Eidos Interactive", "release_date": "Nov 26 2001", "developers": ["Opus"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Snow / Water"], "meta_score": 62, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/8/6c3e7411ee63d89b4e556bbff6b7081c-98.jpg", "descriptions": "Welcome to Jet Ski® Riders - Experience the thrill of competitive Jet Ski® racing as you launch off realistic crashing waves, speed over jump ramps and perform spectacular freestyle tricks. Race through the beaches of Florida, the fjords of New Zealand, the canals of Venice and more. [EidosWelcome to Jet Ski® Riders - Experience the thrill of competitive Jet Ski® racing as you launch off realistic crashing waves, speed over jump ramps and perform spectacular freestyle tricks. Race through the beaches of Florida, the fjords of New Zealand, the canals of Venice and more. [Eidos Interactive]… Expand"}, {"name": "High Heat Major League Baseball 2002", "details_link": "https://www.metacritic.com/game/game-boy-advance/high-heat-major-league-baseball-2002", "publisher": "3DO", "release_date": "Sep 16 2001", "developers": ["Mobius Entertainment"], "platforms": "Game Boy Advance", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/1d92ef6f0c2748f984721091ce45d9ba-98.jpg", "descriptions": "It's a decent freshman effort, but a lack of gameplay details and multiplayer features and substandard visuals limit the game's appeal to die-hard MLB fans only."}, {"name": "Hogs of War", "details_link": "https://www.metacritic.com/game/playstation/hogs-of-war", "publisher": "Infogrames", "release_date": "Sep  5 2000", "developers": ["Infogrames Sheffield"], "platforms": "PlayStation", "genres": ["Strategy", "General"], "meta_score": 62, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/f2962baa09c26a27c2f84ce022cddb1f-98.jpg", "descriptions": "With four people joining in, the number of onscreen explosions, pig-speech comments, and all-around nuttiness nearly lifts the game into the same sphere of quality as Worms or Bomberman."}, {"name": "Tork: Prehistoric Punk", "details_link": "https://www.metacritic.com/game/xbox/tork-prehistoric-punk", "publisher": "Ubisoft", "release_date": "Jan 12 2005", "developers": ["Tiwak"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/a67072b93980feea8ad9df7f3eba1ea3-98.jpg", "descriptions": "Not even time can stand in the way of Tork. This cave boy must travel through time to find those responsible for kidnapping his father and destroying his village. Not your ordinary hero, Tork can change into three spirit animals: a yeti, an armadillo, or a flying squirrel. As Tork, you mustNot even time can stand in the way of Tork. This cave boy must travel through time to find those responsible for kidnapping his father and destroying his village. Not your ordinary hero, Tork can change into three spirit animals: a yeti, an armadillo, or a flying squirrel. As Tork, you must face dinosaurs, gargoyles, robots, and more as you fight your way from the Stone Age to the Age of Fantastical Machines. Dodge avalanches, volcanoes, and machines in a variety of fantastic environments.… Expand"}, {"name": "Super Neptunia RPG", "details_link": "https://www.metacritic.com/game/switch/super-neptunia-rpg", "publisher": "Idea Factory", "release_date": "Jun 25 2019", "developers": ["Compile Heart", "Artisan Studios"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 62, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/4babf74e6ddc4f95e2f280abff6c5499-98.jpg", "descriptions": "There was once a primitive form of entertainment software that ruled the world: 2D games.In one of infinite dimensions, the world of Gamindustri exists...\na world where 2D games reign supreme.\n\nAn organization fiercely devoted to these games rules over this vibrant world.\nThey are known asThere was once a primitive form of entertainment software that ruled the world: 2D games.In one of infinite dimensions, the world of Gamindustri exists...a world where 2D games reign supreme.An organization fiercely devoted to these games rules over this vibrant world.They are known as Bombyx Mori and their devotion comes with a heavy price.Citizens of Gamindustri are forced to offer 2D games to Bombyx Mori as taxes.Those who dare to use new technologies or create games that don't meettheir standards risk being banished to the Trial Grounds.It is in this Gamindustri, a dark world with no real future in sight, that a girl wakes from her sleep.Her name is Neptune, and with a strange book in hand, she sets off on the journey of a Hero.… Expand"}, {"name": "Tiny Troopers: Joint Ops", "details_link": "https://www.metacritic.com/game/xbox-one/tiny-troopers-joint-ops", "publisher": "Wired Productions", "release_date": "Feb 26 2016", "developers": ["Kukouri Mobile Entertainment", "Epiphany Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 62, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/f17452664bc00a460852cb2f682c4425-98.jpg", "descriptions": "Fire yourself into an epic bite-sized arcade shooter, filled to the brim with action-packed mini maps of mayhem. Miniature warfare on a massive scale. Take control of your tiny troopers as you battle evil adversaries from around the world with a multitude of weapons and specialist soldiers.Fire yourself into an epic bite-sized arcade shooter, filled to the brim with action-packed mini maps of mayhem. Miniature warfare on a massive scale. Take control of your tiny troopers as you battle evil adversaries from around the world with a multitude of weapons and specialist soldiers. Collect medals, dog tags and intel during the course of each mission to ensure victory.… Expand"}, {"name": "LEGO City Undercover: The Chase Begins", "details_link": "https://www.metacritic.com/game/3ds/lego-city-undercover-the-chase-begins", "publisher": "Nintendo", "release_date": "Apr 21 2013", "developers": ["Traveller's Tales"], "platforms": "3DS", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 62, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/b9e16bd465ed02c22bfd91bd41f22714-98.jpg", "descriptions": "LEGO City Stories is an open world game for the Wii U and 3DS."}, {"name": "Absolver", "details_link": "https://www.metacritic.com/game/xbox-one/absolver", "publisher": "Devolver Digital", "release_date": "Jan  7 2019", "developers": ["Sloclap"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/c1fa643613745b3b1b56d49c3fc80972-98.jpg", "descriptions": "Absolver puts players behind the mask of a Prospect, who has taken a sacred vow and chosen to join the Absolvers, an elite corps of combatants fighting to maintain stability in the world."}, {"name": "Armageddon Riders", "details_link": "https://www.metacritic.com/game/playstation-3/armageddon-riders", "publisher": "Targem Games", "release_date": "May 30 2011", "developers": ["Targem Games"], "platforms": ["PC", "PlayStation 3"], "genres": ["Driving", "Racing", "Demolition Derby", "Arcade", "Demolition Derby", "Automobile"], "meta_score": 62, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/8f75c2b5e1dc7958d0108a9f02670f53-98.jpg", "descriptions": "Drive and kill in a bloody car battle with no rules and no brakes on PS3."}, {"name": "DreamWorks Shrek Forever After", "details_link": "https://www.metacritic.com/game/xbox-360/dreamworks-shrek-forever-after", "publisher": "Activision", "release_date": "May 18 2010", "developers": ["Xpec"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 62, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/5/f39c90645b41949e77737b3424d5e1db-98.jpg", "descriptions": "Gamers adventure through a variety of locations from the Shrek universe, solve challenging puzzles and battle exciting new enemies as they morph between Shrek’s normal world and his alternate reality…and ultimately conquer that crafty Rumpelstiltskin!  The game offers a fun-filled social andGamers adventure through a variety of locations from the Shrek universe, solve challenging puzzles and battle exciting new enemies as they morph between Shrek’s normal world and his alternate reality…and ultimately conquer that crafty Rumpelstiltskin!  The game offers a fun-filled social and collaborative experience with its co-operative multiplayer mode, allowing up to four players to work together through the single player story.  [Activision]… Expand"}, {"name": "Knights of Pen & Paper +1 Edition", "details_link": "https://www.metacritic.com/game/pc/knights-of-pen-paper-+1-edition", "publisher": "Behold Studios", "release_date": "Jun 18 2013", "developers": ["Behold Studios"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 62, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/8220dd2d1baeb088aa9615e45f74ad81-98.jpg", "descriptions": "Manager of a pen and paper RPG table with turn based battles!\rKnights of Pen & Paper is an indie turn-based retro style pixel-art RPG. Inspired by the great titles of the 90's, play this game feels like you are playing a traditional pen and paper RPG.\r\r\nThe player gets to control theManager of a pen and paper RPG table with turn based battles!\rKnights of Pen & Paper is an indie turn-based retro style pixel-art RPG. Inspired by the great titles of the 90's, play this game feels like you are playing a traditional pen and paper RPG.\r The player gets to control the playing characters AND the dungeon master, and you choose what battles to fight. Put together a bunch of monsters to make it a challenging fight and your rewards will be equally great!\r With 12 different classes (6 unlockables) and 17 characters (5 unlockables) to choose from, more than 100 quests, 50 monsters, 100 items and equipment, blacksmith, enchanter, mining, gathering, hidden treasures and a lot more. Knights of Pen & Paper gives the player lots of room to personalize your gameplay experience.\r Launching with 2 whole campaigns and many more are coming up! Each time a new game is created you can choose a different campaign and have a brand new game experience.… Expand"}, {"name": "PixelJunk Racers", "details_link": "https://www.metacritic.com/game/playstation-3/pixeljunk-racers", "publisher": "SCEA", "release_date": "Sep 13 2007", "developers": ["Q-Games"], "platforms": "PlayStation 3", "num_players": "1-6 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 62, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/b716190ce29b08516ef4f5ea65f79cb2-98.jpg", "descriptions": "[Downloadable Game]  PixelJunk Racers is an addictive slot car racing game that supports 1080p and features single player and multiplayer fun (up to 7 players simultaneously offline!). Intuitive controls, 32 different race modes, and online rankings provide hours of racing mayhem. 16 core[Downloadable Game]  PixelJunk Racers is an addictive slot car racing game that supports 1080p and features single player and multiplayer fun (up to 7 players simultaneously offline!). Intuitive controls, 32 different race modes, and online rankings provide hours of racing mayhem. 16 core racing modes with varying degrees of difficulty for a total of 32 modes, including an in-depth single-player tournament and offline multiplayer modes (up to 7 players!). SIXAXIS Wireless Controller - Use the controller's left and right buttons on the D-pad to steer through traffic, master cornering, and overtake rival vehicles. Global Online Ranking – Play for your personal best in Score Attack and see how you stack up against other racers worldwide. [Sony]… Expand"}, {"name": "Metal Gear Survive", "details_link": "https://www.metacritic.com/game/xbox-one/metal-gear-survive", "publisher": "Konami", "release_date": "Feb 20 2018", "developers": ["Konami"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 62, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/6/a7e1c7a658b5260a6b0f4fe0f1c65135-98.jpg", "descriptions": "Metal Gear Survive picks up from the ending of METAL GEAR SOLID V: GROUND ZEROES, to an alternate timeline caused by unexplained wormholes forming in the sky."}, {"name": "DreamWorks Madagascar: Escape 2 Africa", "details_link": "https://www.metacritic.com/game/xbox-360/dreamworks-madagascar-escape-2-africa", "publisher": "Activision", "release_date": "Nov  4 2008", "developers": ["Toys for Bob"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/e93fcf04361894f2d46cce389e44e0d5-98.jpg", "descriptions": "Join Alex the lion, Marty the Zebra, Melman the Giraffe, Gloria the Hippo and their entire madcap MadagascarTM crew on a whole new action-packed journey to save the African savannah in the Madagascar: Escape 2 Africa video game. Your favorite characters from Madagascar return and you canJoin Alex the lion, Marty the Zebra, Melman the Giraffe, Gloria the Hippo and their entire madcap MadagascarTM crew on a whole new action-packed journey to save the African savannah in the Madagascar: Escape 2 Africa video game. Your favorite characters from Madagascar return and you can play them all! In addition to Alex, Marty, Gloria, and Melman, you also get to play as the crafty penguins, the wacky King Julien and new hippo character Moto Moto! Learn all the moves of each character and choose which character is best for the situation at hand. Adventure through 12 levels and 10 tournament mini-games from othe movie and beyond. Experience the characters, settings and situations established in Dreamworks Animation’s new Madagascar movie. Unique new environments include the Watering Hole, a free roaming area that’s been expanded for the game, the volcano and the plane wreck. Master new and expanded tournament mini-games including twice as much multiplayer action as the first Madagascar! [Activision]… Expand"}, {"name": "Giraffe and Annika", "details_link": "https://www.metacritic.com/game/switch/giraffe-and-annika", "publisher": "NIS America", "release_date": "Aug 25 2020", "developers": ["Atelier Mimina"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/19c76b048be3da2c6e696fd5399f332e-98.jpg", "descriptions": "After waking from a strange dream, Annika finds herself stranded on the island of Spica, having no recollection of her past. With the help of a boy named Giraffe, she must find three special star fragments on the island in order to uncover her memories. A Magical Journey - Immerse yourselfAfter waking from a strange dream, Annika finds herself stranded on the island of Spica, having no recollection of her past. With the help of a boy named Giraffe, she must find three special star fragments on the island in order to uncover her memories. A Magical Journey - Immerse yourself in the vivid and enchanting world of Spica, and watch this grand tale unfold through comic book-style cutscenes.\r Rhythmic Rumble - Challenge a colorful cast of bosses to rhythm-based combat, and groove along to a fun and whimsical game soundtrack.\r Seeker of Secrets - Explore unique dungeons, discover charming collectibles, and unravel the mysteries of the island.… Expand"}, {"name": "Kingdom Under Fire II", "details_link": "https://www.metacritic.com/game/pc/kingdom-under-fire-ii", "publisher": "Gameforge", "release_date": "Nov 18 2019", "developers": ["Phantagram", "Blueside"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 62, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/7f1cb13abf33a843b395b38bac798b06-98.jpg", "descriptions": "The next entry in the Kingdom Under Fire series hopes to blaze new territory as a massively multiplayer online real-time strategy game."}, {"name": "Warparty", "details_link": "https://www.metacritic.com/game/pc/warparty", "publisher": "Warcave", "release_date": "Mar 28 2019", "developers": ["Warcave"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "Command"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/d8e17176ced153c35da8fbf357ff5bab-98.jpg", "descriptions": "Warparty is a real-time strategy game set in the stone-age era. You will build your base, recruit and control a group of soldiers, fight and tame fierce dinosaurs and direct the flow of combat. Proper management of resources, skills and map awareness will lead you to victory."}, {"name": "TurtlePop: Journey to Freedom", "details_link": "https://www.metacritic.com/game/switch/turtlepop-journey-to-freedom", "publisher": "DigiPen Game Studios", "release_date": "Mar  9 2018", "developers": ["Zengami"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/eee2e25878b1fa0c6d5ebda7c57376b2-98.jpg", "descriptions": "TurtlePop: Journey to Freedom is a platform puzzle game that introduces Bebo, Deephi, Slimmie, Smarts, Willis and Sparky the Turtle. Master new gameplay with multi-character control and turtle-linking, environment manipulation, item deployment and match 3 mechanics that make challenges evenTurtlePop: Journey to Freedom is a platform puzzle game that introduces Bebo, Deephi, Slimmie, Smarts, Willis and Sparky the Turtle. Master new gameplay with multi-character control and turtle-linking, environment manipulation, item deployment and match 3 mechanics that make challenges even more fresh, intense and fun. [Nintendo]… Expand"}, {"name": "Etherium", "details_link": "https://www.metacritic.com/game/pc/etherium", "publisher": "Focus Home Interactive", "release_date": "Mar 25 2015", "developers": ["Tindalos Interactive"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/8e783ba643ea2f0e84f07fd25c83e06b-98.jpg", "descriptions": "In Etherium, three empires are locked in a ruthless struggle to control a distant planet and its moons; this planet contains etherium, a mysterious and precious resource. The player will take the lead of one of the three factions, each with its individual characteristics, strengths,In Etherium, three empires are locked in a ruthless struggle to control a distant planet and its moons; this planet contains etherium, a mysterious and precious resource. The player will take the lead of one of the three factions, each with its individual characteristics, strengths, weaknesses, technologies and special skills, such as climate control, espionage and precognition.… Expand"}, {"name": "Pineapple Smash Crew", "details_link": "https://www.metacritic.com/game/pc/pineapple-smash-crew", "publisher": "RichMakeGame", "release_date": "Feb  2 2012", "developers": ["RichMakeGame"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/ef1458f621862b1b8424e2b5e96d4a42-98.jpg", "descriptions": "Developed by lone designer Rich Edwards with music created by legendary chiptune artist Syphus, Pineapple Smash Crew is a fast paced tactical blast-em-up! PSC features tight squad formation shooting, aliens, robots, zombies and grenades- loads and loads of grenades! Level up and chooseDeveloped by lone designer Rich Edwards with music created by legendary chiptune artist Syphus, Pineapple Smash Crew is a fast paced tactical blast-em-up! PSC features tight squad formation shooting, aliens, robots, zombies and grenades- loads and loads of grenades! Level up and choose wisely from an assortment of devastating grenade-launched weaponry...PSC's unique modern-retro flavour will take you back to the classics of old then smash you back into the present with a 'ka-boom!'… Expand"}, {"name": "Rainbow Islands: Towering Adventure!", "details_link": "https://www.metacritic.com/game/xbox-360/rainbow-islands-towering-adventure!", "publisher": "Taito Corporation", "release_date": "Oct 28 2009", "developers": ["Taito Corporation"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Action", "General", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/a951cfc6ce836bfe00f2fd7b4f2acd5f-98.jpg", "descriptions": "Rainbow Islands: Towering Adventure! is platform gaming at its most colorful. Control the rainbows to take you through the game's 10 seamlessly connected areas, as you climb from the earth to the far reaches of space. Conquer all 10 Areas in four different game modes, and customize yourRainbow Islands: Towering Adventure! is platform gaming at its most colorful. Control the rainbows to take you through the game's 10 seamlessly connected areas, as you climb from the earth to the far reaches of space. Conquer all 10 Areas in four different game modes, and customize your character's outfit with a range of quirky costumes that you can earn in the game. [Taito]… Expand"}, {"name": "WRC 4: FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/xbox-360/wrc-4-fia-world-rally-championship", "publisher": "Big Ben Interactive", "release_date": "Oct 25 2013", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/351ece5ba8e14ce505ec03de92861bcb-98.jpg", "descriptions": "Official locations, official rally cars and official drivers - everything in WRC FIA World Rally Championship is designed to give the player the full experience of taking part in one of the most ferocious and challenging motorsports. WRC FIA World Rally Championship features \"Road to theOfficial locations, official rally cars and official drivers - everything in WRC FIA World Rally Championship is designed to give the player the full experience of taking part in one of the most ferocious and challenging motorsports. WRC FIA World Rally Championship features \"Road to the WRC\" , an unrivaled career mode that will allow players to hit the dirt to win the ultimate championship. With advanced car tuning, stunning car damage effects and the opportunity to race against heroes of the sport, WRC FIA World Rally Championship is the closest you can get to being one of the most skilled and fearless drivers in the world.… Expand"}, {"name": "Gabrielle's Ghostly Groove 3D", "details_link": "https://www.metacritic.com/game/3ds/gabrielles-ghostly-groove-3d", "publisher": "Natsume", "release_date": "Oct  4 2011", "developers": ["Santa Entertainment"], "platforms": "3DS", "genres": ["Action", "Miscellaneous", "Adventure", "General", "Rhythm", "Music", "Music"], "meta_score": 62, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/374684e3f56fa2451b380b9a41b9bad9-98.jpg", "descriptions": "Gabrielle's having a bad day. She sneezed her soul right out of her body! She'll have to travel to Monster Town, the home of all things that go bump in the night, to get help. Only by busting out the ghostliest dance moves and thrilling and chilling people will she be able to scare up theGabrielle's having a bad day. She sneezed her soul right out of her body! She'll have to travel to Monster Town, the home of all things that go bump in the night, to get help. Only by busting out the ghostliest dance moves and thrilling and chilling people will she be able to scare up the power she needs to get herself back into her body! It's a spooktacular rhythm adventure!… Expand"}, {"name": "Cooking Mama: World Kitchen", "details_link": "https://www.metacritic.com/game/wii/cooking-mama-world-kitchen", "publisher": "Majesco Games", "release_date": "Nov 18 2008", "developers": ["Cooking Mama Limited"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "General", "General", "Virtual", "Career"], "meta_score": 62, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/93b2c99a35dae8c12626743a19ff1182-98.jpg", "descriptions": "Mama is still cookin'! In her Wii sequel, Mama brings a lot more to the table, including all new 3D graphics, new recipes, comedic kitchen minigames, new gameplay modes and much more. The Wii Remote is your universal cooking utensil, putting you in total control of the cooking action as youMama is still cookin'! In her Wii sequel, Mama brings a lot more to the table, including all new 3D graphics, new recipes, comedic kitchen minigames, new gameplay modes and much more. The Wii Remote is your universal cooking utensil, putting you in total control of the cooking action as you chop, grate, slice, stir, roll and much more! Hold and point it in many different ways depending on the task to get the real sensation of cooking in a kitchen. Mama and friends look glorious in all new 3D graphics. More than 50 all new recipes including: parfait, French fries/Onion Rings, Nestle Toll House Chocolate Chip Cookies, Ratatouille, pancakes, boiled flounder and many more. New gameplay mechanic integrates Wii Remote utensil play with additional rhythm and motion that makes cooking easier and more enjoyable. [Majesco]… Expand"}, {"name": "Death Rally (2012)", "details_link": "https://www.metacritic.com/game/pc/death-rally-2012", "publisher": "Nordic Games Publishing", "release_date": "Aug  3 2012", "developers": ["Remedy Entertainment"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 62, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/dd132114cd7fbfe9a7a1d1ba1d14aa72-98.jpg", "descriptions": "Load your guns, start your engines...THE CLASSIC IS BACK! Brought to you from Remedy, renowned developers of Max Payne and Alan Wake, Remedy's Death Rally classic top down racer is back, stronger and more vicious than ever. This is no Sunday Drive. This is Death Rally, so be prepared to beLoad your guns, start your engines...THE CLASSIC IS BACK! Brought to you from Remedy, renowned developers of Max Payne and Alan Wake, Remedy's Death Rally classic top down racer is back, stronger and more vicious than ever. This is no Sunday Drive. This is Death Rally, so be prepared to be blown away, literally.… Expand"}, {"name": "Polar Panic", "details_link": "https://www.metacritic.com/game/playstation-3/polar-panic", "publisher": "Valcon Games", "release_date": "Dec 22 2009", "developers": ["Eiconic Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/462d80f80ce6bd9001629fcdb94b93c5-98.jpg", "descriptions": "[Playstation Network]  Polar Panic has you playing through 50 challenging levels to battle Mr. Big in Story Mode. Or work your way through all 50 of the fiendish block-based puzzles. Survive against never-ending waves of trappers in Survivor Mode. Play on your own or with two to four players[Playstation Network]  Polar Panic has you playing through 50 challenging levels to battle Mr. Big in Story Mode. Or work your way through all 50 of the fiendish block-based puzzles. Survive against never-ending waves of trappers in Survivor Mode. Play on your own or with two to four players against the trappers and each other in Kills, Points, or Last Man Standing variations. [Valcon Games]… Expand"}, {"name": "Lords of EverQuest", "details_link": "https://www.metacritic.com/game/pc/lords-of-everquest", "publisher": "Sony Online Entertainment", "release_date": "Dec  1 2003", "developers": ["Rapid Eye Entertainment"], "platforms": "PC", "num_players": "1-12 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 62, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/0093afe1f57f6445c93ddf57d18ab884-98.jpg", "descriptions": "Lords of EverQuest is a revolutionary Real-Time Strategy game inspired by the lore of the online gaming phenomenon EverQuest. Control Lords and colossal armies as you battle for total domination of the lands of Antonica. Unparalleled Graphics - State of the art custom 3D engine that bringsLords of EverQuest is a revolutionary Real-Time Strategy game inspired by the lore of the online gaming phenomenon EverQuest. Control Lords and colossal armies as you battle for total domination of the lands of Antonica. Unparalleled Graphics - State of the art custom 3D engine that brings characters and environments to life. ALL Units Grow in Power - For the first time, every unit in the game can level up and grow in skills and abilities. Hundreds of Magical Items - Discover magical artifacts to arm your troops as you become a force to be reckoned with. Superior Multiplayer Features - Enhanced multiplayer capabilities allow up to 12 players to challenge each other through an upcoming matchmaking service. [Sony Online]… Expand"}, {"name": "DemiKids: Light Version", "details_link": "https://www.metacritic.com/game/game-boy-advance/demikids-light-version", "publisher": "Atlus Co.", "release_date": "Oct  6 2003", "developers": ["Multimedia Intelligence Transfer"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 62, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/ec79f2628e09d86a3af5d9d78477a46b-98.jpg", "descriptions": "Prepare yourself for a world that's rife with evil demons, special powers, and magic spells. Jin (the main character of Light Version), Akira (the main character of Dark Version), and Lena have accidentally released demonic creatures, and now it's up to you to capture them all. Follow thesePrepare yourself for a world that's rife with evil demons, special powers, and magic spells. Jin (the main character of Light Version), Akira (the main character of Dark Version), and Lena have accidentally released demonic creatures, and now it's up to you to capture them all. Follow these characters as they collect more than 350 demons, and unlock demons from other versions of the game. The Demon Fusion system lets you create new demons or strengthen existing ones. You can also link two Game Boy Advances to enhance your assortment of demon allies. … Expand"}, {"name": "Tube Slider", "details_link": "https://www.metacritic.com/game/gamecube/tube-slider", "publisher": "NEC Interchannel", "release_date": "Apr 17 2003", "developers": ["Nd Cube"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/c6d9dc23ccffc9d88da7c26833e0a6e8-98.jpg", "descriptions": "Sometime in the middle of the 21st century, shortly following the development of hydrogen-based power, a global treaty prohibiting the use of fossil fuels was passed which banned all motor sports. Although the world established a culture of peace and environmental preservation, people wantedSometime in the middle of the 21st century, shortly following the development of hydrogen-based power, a global treaty prohibiting the use of fossil fuels was passed which banned all motor sports. Although the world established a culture of peace and environmental preservation, people wanted a sport that would whet their appetites for speed and competition...\r Get your adrenaline fix as you race at incredible speeds in hover vehicles that slide through futuristic gravity-defying race courses enclosed in tubes... reaching speeds over 1,000 miles per hour! The future of championship formula racing is faster, sleeker, and more dangerous. You may be able to finish a race, but can you take home a championship?… Expand"}, {"name": "RollerCoaster Tycoon", "details_link": "https://www.metacritic.com/game/xbox/rollercoaster-tycoon", "publisher": "Atari", "release_date": "Mar 25 2003", "developers": ["Atari"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Strategy", "Tycoon"], "meta_score": 62, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/3e2ddfc02591a368b7791b7334d3cb90-98.jpg", "descriptions": "If you think thrill rides aren't thrilling enough, then here's your chance to make your own. RollerCoaster Tycoon lets you build your park from scratch, or you can improve and expand an existing park with new rides and attractions. You'll have an array of roller coaster designs, landscapes,If you think thrill rides aren't thrilling enough, then here's your chance to make your own. RollerCoaster Tycoon lets you build your park from scratch, or you can improve and expand an existing park with new rides and attractions. You'll have an array of roller coaster designs, landscapes, shops, decorations, and theme options to choose from. Accurate coaster-motion dynamics and physics can result in thrilling rides or the ultimate disaster. Be sure to analyze your guests' thoughts and feelings to help manage your park's success.… Expand"}, {"name": "Looney Tunes: Space Race", "details_link": "https://www.metacritic.com/game/playstation-2/looney-tunes-space-race", "publisher": "Infogrames", "release_date": "May 27 2002", "developers": ["Tantalus"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 62, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/09e86b76e0486c1d46f70a3f50ef40f3-98.jpg", "descriptions": "It?s fast, furious, futuristic racing excitement the Looney Tunes way! Take off in a rocket-powered space racer in this crazy, no-holds-barred, winner-takes-all contest that spans the galaxy! Loaded with outrageous pranks, gags and hilarious ACME devices, this is the craziest racing thisIt?s fast, furious, futuristic racing excitement the Looney Tunes way! Take off in a rocket-powered space racer in this crazy, no-holds-barred, winner-takes-all contest that spans the galaxy! Loaded with outrageous pranks, gags and hilarious ACME devices, this is the craziest racing this side of the universe! [Infogrames]… Expand"}, {"name": "Age of Sail II", "details_link": "https://www.metacritic.com/game/pc/age-of-sail-ii", "publisher": "TalonSoft", "release_date": "Feb  1 2001", "developers": ["Akella"], "platforms": "PC", "num_players": "Up to 16 ", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/c95327d4d8db2eeedb0dc63971eb63ee-98.jpg", "descriptions": "The invading armada drifts on the horizon, preparing for war. On your order, the battle begins. Explosions break the peaceful atmosphere as the smoke distorts the scene. It was a time when nations fought for naval dominance ... a time of true adventure ... a time unlike no other. It was theThe invading armada drifts on the horizon, preparing for war. On your order, the battle begins. Explosions break the peaceful atmosphere as the smoke distorts the scene. It was a time when nations fought for naval dominance ... a time of true adventure ... a time unlike no other. It was the Age Of Sail!  [TalonSoft]… Expand"}, {"name": "Sno-Cross Championship Racing", "details_link": "https://www.metacritic.com/game/dreamcast/sno-cross-championship-racing", "publisher": "Crave", "release_date": "Nov 30 2000", "developers": ["UDS"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "Snow / Water"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/3aaf1eee1b3d745beb96bb9049faaef2-98.jpg", "descriptions": "Sno-Cross Championship Racing was a valiant effort on the PlayStation, on the Dreamcast it falls far short of standards and expectations."}, {"name": "Urban Empire", "details_link": "https://www.metacritic.com/game/pc/urban-empire", "publisher": "Kalypso", "release_date": "Jan 20 2017", "developers": ["Fragment Production Ltd", "Reborn Games Inc."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 62, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/68bf63cf53229d845007d51213058d4f-98.jpg", "descriptions": "Urban Empire is a ‘City Ruler’, pioneering a new breed of strategy game that combines city builder features with political scheming and adds profound social and historical events into the mix, creating a whole new gameplay experience."}, {"name": "Fuse", "details_link": "https://www.metacritic.com/game/xbox-360/fuse", "publisher": "Electronic Arts", "release_date": "May 28 2013", "developers": ["Insomniac Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General"], "meta_score": 62, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/73300dac3e7b1b885b25291913a4b19d-98.jpg", "descriptions": "What happens when human beings access powerful alien technology they were never meant to have been exposed to? When a volatile energy source they call Fuse falls into the wrong hands, the CIA calls upon an elite contact team to retrieve it, known as Overstrike 9. Congregate with up to 3What happens when human beings access powerful alien technology they were never meant to have been exposed to? When a volatile energy source they call Fuse falls into the wrong hands, the CIA calls upon an elite contact team to retrieve it, known as Overstrike 9. Congregate with up to 3 friends in team-based co-op play as you take down the rogue paramilitary corporation behind the theft. Use lethal teamwork, orchestrate devastating attacks, and provide cover for one another with fringe-tech weapons and gadgets. The unique LEAP feature lets you instantly shift from agent to agent during combat, allowing you to take advantage of each one’s special arsenal. You will need your partners and their arsenal to stop a global arms race from spinning out of control. … Expand"}, {"name": "NASCAR 2011: The Game", "details_link": "https://www.metacritic.com/game/xbox-360/nascar-2011-the-game", "publisher": "Activision", "release_date": "Mar 29 2011", "developers": ["Eutechnyx"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "Stock Car", "Automobile"], "meta_score": 62, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/5/cd376e623e3c1db1637b9ff90c5aac3b-98.jpg", "descriptions": "The Big Mutha Truckers and Ferrari challenge developer is relaunching the racing series featuring the US's top stock-car circuit."}, {"name": "Moon Hunters", "details_link": "https://www.metacritic.com/game/pc/moon-hunters", "publisher": "Kitfox Games", "release_date": "Mar 10 2016", "developers": ["Kitfox Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 62, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/01eff16b39dd99066eddf2a2a663cb11-98.jpg", "descriptions": "Play alone or with friends. A co-op personality-test RPG about exploring an ancient, occult world that's different every time. How will you be remembered?"}, {"name": "Torchlight III", "details_link": "https://www.metacritic.com/game/playstation-4/torchlight-iii", "publisher": "Perfect World Entertainment", "release_date": "Oct 13 2020", "developers": ["Echtra Games", "Inc."], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 62, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/1/e0808650dd1ee17229f8e52d6a2f3220-98.jpg", "descriptions": "It's been a century since the events of Torchlight II, and the Ember Empire is in decline. In Torchlight III, Novastraia is again under threat of invasion and it's up to you to defend against the Netherim and its allies. Gather your wits and brave the frontier to find fame, glory, and newIt's been a century since the events of Torchlight II, and the Ember Empire is in decline. In Torchlight III, Novastraia is again under threat of invasion and it's up to you to defend against the Netherim and its allies. Gather your wits and brave the frontier to find fame, glory, and new adventures!Travel the FrontierExplore the wilderness, party with friends, gather materials to craft gear, or use magic to enter unknown dungeons! There's always something to do in the new frontier.Build & Upgrade Your FortIt's time to rebuild and that includes you! Enjoy your very own fort, where you can upgrade gear and renovate your fort to show off to your friends and the world. Collect Epic GearWhether it's armor, weapons, dyes, recipes, ember cores, or even new pets...there's always more to find as you battle through dungeons and take on dangerous foes. Pets Are BackFight your way to fame and glory with your loyal companion! Add skills and equip them with gear to make them stronger. Each species comes in a myriad of colors and styles, so make sure to collect them all! Build Your HeroWith four unique classes to choose from, players can utilize class-specific mechanics to maximize damage and their odds of survival. Combine epic gear, Relic powers, and class abilities to customize your playstyle.… Expand"}, {"name": "Sniper Elite: Nazi Zombie Army", "details_link": "https://www.metacritic.com/game/pc/sniper-elite-nazi-zombie-army", "publisher": "Rebellion", "release_date": "Feb 28 2013", "developers": ["Rebellion"], "platforms": "PC", "genres": ["Action", "General", "Shooter", "Shooter", "Third-Person", "Tactical", "Historic", "Historic"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/3179934d238c41ccc6dec22b5ce60b05-98.jpg", "descriptions": "One man is utterly alone amidst the chaos of war. But there are worse things to fear than bombs and bullets here..."}, {"name": "Elex", "details_link": "https://www.metacritic.com/game/xbox-one/elex", "publisher": "Nordic Games Publishing", "release_date": "Oct 17 2017", "developers": ["Piranha Bytes"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/e0628b18dcf69e33b0080d367a104c14-98.jpg", "descriptions": "Advanced in technology, civilized and with a population of billions, Magalan was a planet looking to the future. Then the meteor hit. Those who survived are now trapped in a battle to survive, a struggle to decide the fate of a planet. At the center of this fight is the element \"Elex\". AAdvanced in technology, civilized and with a population of billions, Magalan was a planet looking to the future. Then the meteor hit. Those who survived are now trapped in a battle to survive, a struggle to decide the fate of a planet. At the center of this fight is the element \"Elex\". A precious, limited resource that arrived with the meteor, Elex can power machines, open the door to magic, or re-sculpt life into new, different forms. But which of these choices should be the future of Magalan? Can technology, or magic save this world? Or will this new power destroy all those left alive amongst the ruins? \r\rElex is an action, role-playing open world game for PC and Consoles, developed by Piranha Bytes, creators of the award winning Gothic series and is set in a brand new, post-apocalyptic, Science-Fantasy universe where magic meets mechs.… Expand"}, {"name": "Little Nightmares: The Depths", "details_link": "https://www.metacritic.com/game/playstation-4/little-nightmares-the-depths", "publisher": "Bandai Namco Games", "release_date": "Jul  7 2017", "developers": ["Tarsier Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["General", "Action Adventure", "Linear"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/36ffdb0d84417a2a444839a0d6383fe2-98.jpg", "descriptions": "Others lead the escape but the Kid drops down into the Depths of the Maw. Little does he know that this murky place is home to The Granny - abandoned to decay and rage she will let no-one go. He must struggle on if he wants to survive, leap from floating debris to avoid being pulled into theOthers lead the escape but the Kid drops down into the Depths of the Maw. Little does he know that this murky place is home to The Granny - abandoned to decay and rage she will let no-one go. He must struggle on if he wants to survive, leap from floating debris to avoid being pulled into the treacherous waters, and find a way to create a path through the depths.… Expand"}, {"name": "Malicious Fallen", "details_link": "https://www.metacritic.com/game/playstation-4/malicious-fallen", "publisher": "Sony Interactive Entertainment", "release_date": "Feb 21 2017", "developers": ["Alvion"], "platforms": "PlayStation 4", "genres": ["Action", "General"], "meta_score": 62, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/1e8bda7c60715335374eb2ea7deab13d-98.jpg", "descriptions": "When the forces of ultimate evil are unleashed on the world, only the Spirit Vessel can hope to subdue them. Malicious Fallen includes the complete story so far and adds two brand new chapters, Pursuit and Demise. Experience the thrilling finale of the Malicious saga, remastered, enhanced,When the forces of ultimate evil are unleashed on the world, only the Spirit Vessel can hope to subdue them. Malicious Fallen includes the complete story so far and adds two brand new chapters, Pursuit and Demise. Experience the thrilling finale of the Malicious saga, remastered, enhanced, and expanded for PS4.… Expand"}, {"name": "Senran Kagura: Bon Appetit! - Full Course", "details_link": "https://www.metacritic.com/game/pc/senran-kagura-bon-appetit!---full-course", "publisher": "XSEED Games", "release_date": "Nov 10 2016", "developers": ["Meteorise"], "platforms": ["PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 62, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/4c014315c67769e6e0abcad30765c45d-98.jpg", "descriptions": "Many speak of it, but rarely have human mouths ever tasted it: the pinnacle of culinary perfectionthe Super Dish. Few shinobi have ever been able to prepare a dish so exquisite, but legendary shinobi and sushi chef Hanzo thinks that perhaps his students and their rivals are up to the task.Many speak of it, but rarely have human mouths ever tasted it: the pinnacle of culinary perfectionthe Super Dish. Few shinobi have ever been able to prepare a dish so exquisite, but legendary shinobi and sushi chef Hanzo thinks that perhaps his students and their rivals are up to the task. He holds a contest to see which of the girls can hone her Ninja Arts best for cooking as opposed to combat. The competition is fierce; the one who presents the old shinobi master with the Super Dish will obtain a Secret Ninja Art Scroll that will make real her most fervent desire. Whosoever can prove her knife to be as suitable for cooking as for combat will emerge the victor, while all her friends and rivals wind up as mere dessert...\r A rhythm spin-off of the ninja busty brawler series, SENRAN KAGURA, Bon Appetit! features cooking battles rather than shinobi showdowns, with emphasis on outrageous humor, delicious food, and gratuitous images of the series lovely ladies. This culinary warfare is carried out through an array of rhythm battles, where tapping the correct buttons in time with the beat will rack up combos and determine the size and quality of the resulting dish. The soundtrack consists of a variety of catchy tunes encompassing all genres from jazz to classical, with special Japanese vocal tracks sung by the leader of each faction. This Full Course edition includes all DLC and 22 buxom ninja between the two original PlayStation Vita releases, rewarding players who can overcome the challenge of creating the ultimate Super Dish with a special feast for the eyes as well.\r KEY FEATURES:\r *    Rhythm spin-off of the popular SENRAN KAGURA series\rThe infamous, voluptuous ninja series ventures into a new genre as all of the bouncy babes from SENRAN KAGURA Burst and SENRAN KAGURA SHINOVI VERSUS return, taking a break from physical combat to make culinary war instead in this tasty yet truly tasteless adventure.\r *    The Dressing Room returns with even more stylish options\rLike other SENRAN KAGURA titles, the Dressing Room makes another appearance with multiple ways to customize characters outfitsbut be careful! Peep too much and you risk the wrath of a full-fledged shinobi\r * Three different modes of play plus online leaderboards\rStory Mode progresses through the main game, Free Mode allows for customized cooking showdowns, and Arcade Mode includes comprehensive online leaderboards to see how you stack up against your already pretty stacked competition.\r *    Includes original Hanzo x Crimson Squad, additional Gessen x Hebijo pack, and all additional DLC\r Includes both games which were released separately on PlayStation(r)Vita, as well as all DLC in between, now in 1080p resolution and running at 60fps.… Expand"}, {"name": "F1 Race Stars", "details_link": "https://www.metacritic.com/game/pc/f1-race-stars", "publisher": "Codemasters", "release_date": "Nov 13 2012", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PlayStation 3", "Wii U", "Xbox 360", "PC"], "genres": ["Formula One", "Driving", "Racing", "Arcade", "Kart", "Formula One", "Automobile"], "meta_score": 62, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/edc9be972f9bc8527eb20d614e89120d-98.jpg", "descriptions": "Get ready to experience FORMULA ONE cars, teams and circuits with F1 Race Stars from Codemasters Racing, the home of the series of HD official FORMULA ONE games. Coming this November, F1 RACE STARS is a fast-to-the-fun arcade racing game for all ages featuring the official FORMULA ONE cars,Get ready to experience FORMULA ONE cars, teams and circuits with F1 Race Stars from Codemasters Racing, the home of the series of HD official FORMULA ONE games. Coming this November, F1 RACE STARS is a fast-to-the-fun arcade racing game for all ages featuring the official FORMULA ONE cars, teams and circuits as they've never been seen before. Drivers including Lewis Hamilton, Fernando Alonso and Sebastian Vettel have been transformed into personality-packed heroes and FORMULA ONE locations have become vibrant racing theme parks designed for speed and wheel-to-wheel competition.… Expand"}, {"name": "WRC 3", "details_link": "https://www.metacritic.com/game/xbox-360/wrc-3", "publisher": "Milestone S.r.l", "release_date": "Oct 12 2012", "developers": ["Milestone S.r.l"], "platforms": "Xbox 360", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 62, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/e19788f021d1b3654ff2ba7402b0618b-98.jpg", "descriptions": "In WRC 3 the graphic aspects have been reworked to give the player the best experience in a Rally Game. Thanks to the new Spikengine new lighting effects, shadows, particle effects are featured in the game to offer the maximum level of realism to each player. And mind the new surfaces andIn WRC 3 the graphic aspects have been reworked to give the player the best experience in a Rally Game. Thanks to the new Spikengine new lighting effects, shadows, particle effects are featured in the game to offer the maximum level of realism to each player. And mind the new surfaces and the weather conditions.… Expand"}, {"name": "El Tigre: The Adventures of Manny Rivera", "details_link": "https://www.metacritic.com/game/playstation-2/el-tigre-the-adventures-of-manny-rivera", "publisher": "THQ", "release_date": "Oct 29 2007", "developers": ["Blue Tongue Entertainment"], "platforms": "PlayStation 2", "genres": ["Action", "Platformer", "2D"], "meta_score": 62, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/46caccc20b496a517a8f730464a56014-98.jpg", "descriptions": "From deep underground, Mikla, Prince of Doom, and his AzTechs attack Miracle City. Mikla turns the city’s super-villains against each other so he can take over. The Rivera Family gets into some trouble when Puma Loco and White Pantera are kidnapped. El Tigre must enlist of friends Frida andFrom deep underground, Mikla, Prince of Doom, and his AzTechs attack Miracle City. Mikla turns the city’s super-villains against each other so he can take over. The Rivera Family gets into some trouble when Puma Loco and White Pantera are kidnapped. El Tigre must enlist of friends Frida and Black Cuervo to save his Dad and Grandpapi! [THQ]… Expand"}, {"name": "Mad Tracks", "details_link": "https://www.metacritic.com/game/xbox-360/mad-tracks", "publisher": "D3Publisher", "release_date": "May 30 2007", "developers": ["Load Inc."], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/7ee3aed990977e4ee64fbd204bbe7904-98.jpg", "descriptions": "[Xbox Live Arcade]  Mad Tracks is a racing game that takes its inspiration from the pull-back-and-go toy cars of gamers’ youth. Races take place in everyday environments such as toy stores, mini golf parks, and restaurants. Extra challenges add to this car arcade party game's fast-moving[Xbox Live Arcade]  Mad Tracks is a racing game that takes its inspiration from the pull-back-and-go toy cars of gamers’ youth. Races take place in everyday environments such as toy stores, mini golf parks, and restaurants. Extra challenges add to this car arcade party game's fast-moving fun. Play with friends on a split-screen, and gather up to 12 crazy achievements. Six races, 9 mini-games and up to 12 original achievements will keep you racing. Twelve different cars and 12 different power-ups, including rockets and oil slicks, keep the racing fresh. There are lots of ways to play including Arcade Mode (both Solo and Split Screen), Championship Mode, and 4-player Live Mode complete with in-game audio chat, multiple leaderboards and weekly resets. There's a try before you buy demo, 2 free Gamerpics, and soon, 2 new craze-packed downloadable add-ons of 15 challenges each. [Microsoft]… Expand"}, {"name": "Worms Battlegrounds", "details_link": "https://www.metacritic.com/game/playstation-4/worms-battlegrounds", "publisher": "Team17", "release_date": "Jun  3 2014", "developers": ["Team17"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Wargame", "Artillery"], "meta_score": 62, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/82b29e7dc7a8dd1fba72e69aebff9e6e-98.jpg", "descriptions": "Worms Battlegrounds features an extensive single player campaign spanning 25 story missions and 10 “Worm-Ops” time-attack missions, which are set across five stunning environments (Inca, Viking, Feudal Japan and Industrial Revolution) with new day-to-night lighting transitions."}, {"name": "Sacred Citadel", "details_link": "https://www.metacritic.com/game/playstation-3/sacred-citadel", "publisher": "Deep Silver", "release_date": "Apr 16 2013", "developers": ["Deep Silver"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 3 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/6d638deccf6287c04fefdfe238d5161c-98.jpg", "descriptions": "Sacred Citadel lets you and your friends join the resistance in order to defeat the evil Ashen empire that has enslaved its population and is using the orc-like Grimmoc to wipe out the Seraphim, who swore to protect it."}, {"name": "Saint Seiya: Sanctuary Battle", "details_link": "https://www.metacritic.com/game/playstation-3/saint-seiya-sanctuary-battle", "publisher": "Namco Bandai Games America", "release_date": "Mar 16 2012", "developers": ["Dimps Corporation"], "platforms": "PlayStation 3", "genres": ["Action", "Fighting", "3D"], "meta_score": 62, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/f4721f5c5dda0c95650138f95b141085-98.jpg", "descriptions": "SAINT SEIYA - Sanctuary Battle immerses players in the most popular drama from Saint Seiya: the Sanctuary, as Seiya and his companions fight side by side to defeat the gold saints of the twelve palaces and protect Athena. As players complete quests and progress through the twelve levels,SAINT SEIYA - Sanctuary Battle immerses players in the most popular drama from Saint Seiya: the Sanctuary, as Seiya and his companions fight side by side to defeat the gold saints of the twelve palaces and protect Athena. As players complete quests and progress through the twelve levels, they can inflict tremendous damage on their foes with fast-paced Cosmo power-up attacks. [Namco Bandai UK]… Expand"}, {"name": "Leisure Suit Larry: Magna Cum Laude", "details_link": "https://www.metacritic.com/game/xbox/leisure-suit-larry-magna-cum-laude", "publisher": "VU Games", "release_date": "Oct  5 2004", "developers": ["High Voltage Software"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Modern"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/bfb20cec4e9418fd42886040f68fa272-98.jpg", "descriptions": "When a TV dating show comes to campus, Larry Lovage, a typical college student, gets a chance for national exposure. If he can make any girl on campus swoon, he will become a campus legend. Follow Larry's exploits and misadventures as he attempts to develop relationships with femaleWhen a TV dating show comes to campus, Larry Lovage, a typical college student, gets a chance for national exposure. If he can make any girl on campus swoon, he will become a campus legend. Follow Larry's exploits and misadventures as he attempts to develop relationships with female characters. Take a break from your conversations in a variety of minigames, including Quarters, Tapper, Trampoline, and Whack-a-mole. Leisure Suit Larry: Magna Cum Laude lets you explore 25 different locations around the college campus and adjoining parts of town. … Expand"}, {"name": "Naruto Shippuden: Ultimate Ninja Storm Revolution", "details_link": "https://www.metacritic.com/game/xbox-360/naruto-shippuden-ultimate-ninja-storm-revolution", "publisher": "Bandai Namco Games", "release_date": "Sep 16 2014", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/fb3cb35c79eb848463c5a8bebdb0498d-98.jpg", "descriptions": "Naruto Shippuden: Ultimate Ninja Storm Revolution is a 3D ninja fighting action with a roster reaching 100 playable characters that spans the entire Naruto and Naruto Shippuden anime arcs."}, {"name": "Balls of Fury", "details_link": "https://www.metacritic.com/game/ds/balls-of-fury", "publisher": "DSI Games", "release_date": "Sep 27 2007", "developers": ["Black Lantern Studios"], "platforms": "DS", "genres": ["Sports", "Alternative", "Individual", "Other", "Other"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/92caeb5e49b89a5c55e2dac7eb150c3b-98.jpg", "descriptions": "In the unsanctioned, underground and unhinged world of extreme Ping-Pong, the competition is brutal and the stakes are deadly. Down-and-out former professional Ping-Pong phenom Randy Daytona is sucked into this maelstrom when FBI Agent Rodriguez recruits him for a secret mission. Randy isIn the unsanctioned, underground and unhinged world of extreme Ping-Pong, the competition is brutal and the stakes are deadly. Down-and-out former professional Ping-Pong phenom Randy Daytona is sucked into this maelstrom when FBI Agent Rodriguez recruits him for a secret mission. Randy is determined to bounce back and recapture his former glory, and to smoke out his father’s killer – one of the FBI’s Most Wanted, arch-fiend Feng. Balls of Fury, the hit movie starring Christopher Walken, is now an action-packed ping pong game for the DS. In Balls of Fury, you actually play table tennis using the touch screen. You will need to keep up with the ball as the pace gets faster and the opponents get tougher. There are many fun ways to play Balls of Fury including Exhibition mode, Arcade mode, and Story mode. Play wireless on the DS against a friend. [DSI Games]… Expand"}, {"name": "Splatterhouse", "details_link": "https://www.metacritic.com/game/xbox-360/splatterhouse", "publisher": "Namco Bandai Games America", "release_date": "Nov 23 2010", "developers": ["Namco Bandai Games America", "Namco Bandai Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 62, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/1b1e40eb77a7e8149f40c008e9d22539-98.jpg", "descriptions": "Inspired by the landmark 1988 arcade hit, Splatterhouse combines visceral, adrenaline-soaked combat with horror elements to deliver an original gaming experience that defies the boundaries of the traditional action category with over-the-top gore and shocking new gameplay mechanics.Inspired by the landmark 1988 arcade hit, Splatterhouse combines visceral, adrenaline-soaked combat with horror elements to deliver an original gaming experience that defies the boundaries of the traditional action category with over-the-top gore and shocking new gameplay mechanics. Splatterhouse follows college student Rick Taylor as he tries to rescue his girlfriend, Jennifer, who has disappeared after entering the mysterious and run-down West Mansion. Confronted by horrific other-worldly creatures, Rick comes across a mystical sentient mask that promises to give him the power to find Jennifer. Full of desperation and rage, Rick puts on the \"Terror Mask\" and is transformed into a juggernaut of pure violence and destruction. Featuring an original storyline by critically-acclaimed comic book writer Gordon Rennie (Necronauts, Judge Dredd), Splatterhouse takes Rick beyond the mansion as he scours the ends of the world to rescue his beloved Jennifer. Embodying the unfiltered, primal aggression of its namesake, Splatterhouse gives players countless ways to decimate the mansion's assortment of demons, monstrosities and abominations. Featuring a dynamic combat system, Rick can use his brute strength to perform bone-crushing melee combos, savage grapples and wield an assortment of makeshift weapons including the series' trademark 2x4 and even limbs and heads ripped from enemies themselves. Players can also reanimate the corpses of fallen enemies to fight alongside Rick, imparting strategic depth to the game's battle and unique puzzle systems. More agile than ever before, Rick can now leap great distances and propel himself to out of reach areas by swinging from outcroppings in the environment, adding an all-new level of exploration to the series. [Namco Bandai Games]… Expand"}, {"name": "Predator: Hunting Grounds", "details_link": "https://www.metacritic.com/game/pc/predator-hunting-grounds", "publisher": "Sony Interactive Entertainment", "release_date": "Apr 24 2020", "developers": ["IllFonic"], "platforms": ["PlayStation 4", "PC"], "num_players": "Up to 5 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 62, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/d8b1d83042d6c64bd20bd5bd84869f41-98.jpg", "descriptions": "Hunt or Be HuntedPredator: Hunting Grounds is an immersive asymmetrical shooter set in remote areas around the world, where the Predator stalks the most challenging prey. Play as a member of an elite Fireteam and complete paramilitary operations before the Predator finds you. Or, play asHunt or Be HuntedPredator: Hunting Grounds is an immersive asymmetrical shooter set in remote areas around the world, where the Predator stalks the most challenging prey. Play as a member of an elite Fireteam and complete paramilitary operations before the Predator finds you. Or, play as the Predator to hunt the most worthy prey, choosing from your vast array of deadly alien tech to collect your trophies, one by one.… Expand"}, {"name": "Buzz! Quiz World", "details_link": "https://www.metacritic.com/game/psp/buzz!-quiz-world", "publisher": "SCEA", "release_date": "Dec 17 2009", "developers": ["Curve Studios"], "platforms": ["PlayStation 3", "PSP"], "num_players": "4  Online", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/19323da83d238f54ac2fc4da5982c6fc-98.jpg", "descriptions": "For the first time ever on PSP, you’ll be able to download new quiz content from PSN as well as MyBUZZ! user-generated quizzes. Your question bank is virtually limitless! Be sure to go online to MyBUZZQuiz.com and check out all of the fun holiday quizzes that the BUZZ! community have beenFor the first time ever on PSP, you’ll be able to download new quiz content from PSN as well as MyBUZZ! user-generated quizzes. Your question bank is virtually limitless! Be sure to go online to MyBUZZQuiz.com and check out all of the fun holiday quizzes that the BUZZ! community have been creating to get yourself in the festive spirit, or make your own quizzes to share with your friends and family. [Sony]… Expand"}, {"name": "NHL 2K11", "details_link": "https://www.metacritic.com/game/wii/nhl-2k11", "publisher": "2K Sports", "release_date": "Sep 15 2009", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "Wii"], "genres": ["Sports", "Traditional", "General", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 62, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/bc7d11e546919ea3b58f3237404607fd-98.jpg", "descriptions": "Taking video game hockey to a new level, Wii MotionPlus brings revolutionary stick control to your Wii Remote with the ability to execute real-time (one-to-one) dekes, puck juggling, shooting and defensive maneuvers."}, {"name": "Warriors Orochi", "details_link": "https://www.metacritic.com/game/psp/warriors-orochi", "publisher": "Koei", "release_date": "Mar 25 2008", "developers": ["Omega Force", "Koei Canada"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/6e881201c08d9f29dae1ab14e2eadb37-98.jpg", "descriptions": "Without warning, the venomous Serpent King Orochi descended from the heavens. Using his unworldly powers to shatter time and space, Orochi kidnapped the strongest, wisest and most courageous warriors from Ancient China and Feudal Japan in a scheme to test his might against the heroes ofWithout warning, the venomous Serpent King Orochi descended from the heavens. Using his unworldly powers to shatter time and space, Orochi kidnapped the strongest, wisest and most courageous warriors from Ancient China and Feudal Japan in a scheme to test his might against the heroes of these ages. In Warriors Orochi the characters from both the Dynasty Warriors and Samurai Warriors franchises must team-up to wage war against this new, yet powerful force. The game boasts an amazing roster of 79 playable characters, while four action-packed \"crossover\" storylines feature amazing team-ups and some long-awaited confrontations between characters from both series. Warriors Orochi for PSP boasts the massive seamless battlefields of the console versions, while previous games in the series for handheld platforms had combat taking place on battlefields divided into smaller \"cells\". The handheld release includes all 79 playable characters, and features 2-player co-op play via wireless (ad-hoc). [Koei]… Expand"}, {"name": "Muscle March", "details_link": "https://www.metacritic.com/game/wii/muscle-march", "publisher": "Namco Bandai Games", "release_date": "Jan 18 2010", "developers": ["NBGI"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 62, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/54b52af3e1070894dd943d89b3e8c2af-98.jpg", "descriptions": "[WiiWare]  Muscle March is a quirky Japanese action game stuffed full of macho bodybuilders. The all mighty protein powder has been stolen, so it's up to Tony and his muscle-bound crew to catch the thieves. Choose from a variety of perfectly molded superstars and bring these terrible[WiiWare]  Muscle March is a quirky Japanese action game stuffed full of macho bodybuilders. The all mighty protein powder has been stolen, so it's up to Tony and his muscle-bound crew to catch the thieves. Choose from a variety of perfectly molded superstars and bring these terrible villains to justice. As the thieves attempt escape, they will smash through walls while making a variety of poses. You must match these poses to fit through the holes and catch up to the thieves. The protein powder will be yours again! Flex your muscles by yourself or with up to three friends in turn-based macho excitement. Posing for a few minutes not enough? Enjoy Endless Rush mode until your muscles bulge and explode! Muscle March will also be the first WiiWare title to offer a polar bear in tight swimwear! [Nintendo]… Expand"}, {"name": "Fracture", "details_link": "https://www.metacritic.com/game/playstation-3/fracture", "publisher": "LucasArts", "release_date": "Oct  7 2008", "developers": ["Day 1 Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/552b48601b5f8e00c06070107479b8dd-98.jpg", "descriptions": "Amidst a backdrop of worldwide ecological and seismological chaos in the mid-2100s, the United States has been split in two by the \"Great Flood\". As a result of the polar ice cap melting, the Mississippi River has destroyed the central portion of the United States, causing an ill-equippedAmidst a backdrop of worldwide ecological and seismological chaos in the mid-2100s, the United States has been split in two by the \"Great Flood\". As a result of the polar ice cap melting, the Mississippi River has destroyed the central portion of the United States, causing an ill-equipped Federal Government to fail and literally cutting the country in half. These two halves are left to fend for themselves in the aftermath. The East, now known as the Atlantic Alliance, symbolic of their union with Europe, puts its faith in surviving this new world in cybernetics, an established yet evolving technology now more than 150 years old. On the other side of the flooded continent, the Western states, now called the Republic of Pacifica and having allied with Asia, resort to solving their problems at the genetic level, effectively restructuring the DNA of its inhabitants -- a method the Atlantic Alliance finds morally reprehensible. By 2161, it only takes a hint of unauthorized military preparation in Pacifica for the newly restored president to order a strike in the heart of Pacifican territory -- an outpost in the now dry San Francisco Bay. This strike leads to the unthinkable: an epic conflict with global implications fought on U.S. soil. As a soldier in this struggle, Mason Briggs uses explosive, terrain-deforming weaponry to change the face of battle: He not only destroys the land in his path, he outright transforms it to gain the strategic advantage in completely unscripted ways no game has ever seen. With such a devastating arsenal at hand, Briggs never leaves any battlefield the way he found it. In addition to weaponry that allows players to do things previously only imagined, each side of the conflict, Pacifica and the Atlantic Alliance, boast soldiers with powers beyond those of ordinary men. Genetic augmentations provide Pacifican forces with amazing abilities, while Atlantic Alliance soldiers like Briggs counter the threat with the more \"traditional\" method: cybernetics. The differing states of superhumanity result in balanced yet stylistically different combat tactics that have never been seen before. [LucasArts]… Expand"}, {"name": "Gretzky NHL 06", "details_link": "https://www.metacritic.com/game/playstation-2/gretzky-nhl-06", "publisher": "SCEA", "release_date": "Sep 20 2005", "developers": ["Page 44 Studios"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/c4b003a214635204a47005a29ecebf96-98.jpg", "descriptions": "Gretzky NHL 2006 for PlayStation 2 retakes the virtual ice with popular gameplay options including Practice Mode, Exhibition Mode, and Online Mode with 64-team tournaments.  Additionally, an overhauled Franchise Mode lets gamers run the show as owners of NHL and AHL teams, while an expandedGretzky NHL 2006 for PlayStation 2 retakes the virtual ice with popular gameplay options including Practice Mode, Exhibition Mode, and Online Mode with 64-team tournaments.  Additionally, an overhauled Franchise Mode lets gamers run the show as owners of NHL and AHL teams, while an expanded Rivalry Mode tracks and records statistics from head-to-head battles over the lifetime of the rivalry.  For gamers who want to get in the game, EyeToy functionality offers the opportunity for gamers to take a snapshot of themselves, put their face into the game and suit up as or against their favorite NHL player. [SCEA]… Expand"}, {"name": "Arcade Darts", "details_link": "https://www.metacritic.com/game/psp/arcade-darts", "publisher": "Icon Games", "release_date": "Jun 29 2010", "developers": ["Icon Games"], "platforms": "PSP", "genres": ["Sports", "General", "General", "Individual", "Other"], "meta_score": 62, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/b7fb9be44d8a762c4810222269a5ec7c-98.jpg", "descriptions": "[PSP Minis]  Put your dart skills to use - but on your PSP."}, {"name": "World's End Club", "details_link": "https://www.metacritic.com/game/switch/worlds-end-club", "publisher": "NIS America", "release_date": "May 28 2021", "developers": ["Izanagi Games", "Too Kyo Games"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 62, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/9679255302bfe7fe3a6261576fb11b87-98.jpg", "descriptions": "Renowned game writers Kotaro Uchikoshi and Kazutaka Kodaka return with a brand-new game that’s easy to dive into and full of twists and turns. This charming and vivid story of friendship and mystery will captivate new and experienced players alike. The “Go-Getters Club,” a group of misfitRenowned game writers Kotaro Uchikoshi and Kazutaka Kodaka return with a brand-new game that’s easy to dive into and full of twists and turns. This charming and vivid story of friendship and mystery will captivate new and experienced players alike. The “Go-Getters Club,” a group of misfit students from all over Japan, find themselves trapped in a strange theme park during a class trip. In order to unravel the mystery of their circumstances and find an escape, they must take part in a “Game of Fate” that will test their bonds of friendship! With colorful visuals, charming characters, accessible gameplay, and a compelling story, this is an experience you will never forget.… Expand"}, {"name": "Bientot l'ete", "details_link": "https://www.metacritic.com/game/pc/bientot-lete", "publisher": "Tale of Tales", "release_date": "Feb  6 2013", "developers": ["Tale of Tales"], "platforms": "PC", "genres": ["Simulation", "General", "General"], "meta_score": 62, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/bd175cc12b4ab58fa9f1d9a18c9a67b6-98.jpg", "descriptions": "Bientôt l’été is a videogame for two players. Two players who pretend to be lovers. They pretend to be lovers separated from each other by lightyears of deep space. They have lonely walks along the shore of a simulated ocean, thinking wistful thoughts of each other.Bientôt l’été is a videogame for two players. Two players who pretend to be lovers. They pretend to be lovers separated from each other by lightyears of deep space. They have lonely walks along the shore of a simulated ocean, thinking wistful thoughts of each other. Thoughts from ancient Earth literature by Marguerite Duras.\r The empty beach, the strong wind, the gentle music and a small colony of electric seagulls are their only companions. Yet their heart is full and their mind confused. Walk along the shore, until they meet the emptiness.\r When it all becomes too much, they run towards each other. Enabled by intergalactic networks, they touch each other’s holographic bodies in cyberspace. A surreal game of chess becomes the apparatus through which they, man and woman, can talk. The words they have were given to them, as they have always been to lovers everywhere.\r The sea remains, tugging at their hearts when not at their hairs and clothes, as it itself is tugged by the virtual moon. And as great as the desire for the other may be, they cannot stay away from the wind and the waves and the sand. Every time they find a new treasure. An abandoned tennis field. An heap of coal. A dead dog. Ordinary. Absurd. Meaningless. Yet comforting.\r Enter a café, exit a villa, enter a casino, exit the ruin of an ancient colonial mansion. We know this is not real. So it doesn’t surprise us. Nothing surprises us. It doesn’t matter when you feel the pain of love. Of being in love, of falling in love, of leaving in love. There is no such thing as time. There is only love. And it never stops. No matter how much it hurts.… Expand"}, {"name": "Jagged Alliance: Back in Action", "details_link": "https://www.metacritic.com/game/pc/jagged-alliance-back-in-action", "publisher": "Kalypso", "release_date": "Feb  8 2012", "developers": ["Kalypso"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Real-Time", "General", "Modern", "Modern", "Tactics"], "meta_score": 62, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/9b53070c92e25e6e54ee7d64f78bac90-98.jpg", "descriptions": "Jagged Alliance: Back in Action revives the top-selling Jagged Alliance series of mercenary-themed strategy games with significant updates to visuals and gameplay. Back in Action will showcase a fully updated experience, with modernized gameplay, state-of-the-art graphics and premiumJagged Alliance: Back in Action revives the top-selling Jagged Alliance series of mercenary-themed strategy games with significant updates to visuals and gameplay. Back in Action will showcase a fully updated experience, with modernized gameplay, state-of-the-art graphics and premium production values. … Expand"}, {"name": "Tower Bloxx Deluxe", "details_link": "https://www.metacritic.com/game/xbox-360/tower-bloxx-deluxe", "publisher": "Digital Chocolate", "release_date": "Oct 21 2009", "developers": ["Digital Chocolate"], "platforms": ["PC", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 62, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/d4598fe8826b7e638069b3b084baed32-98.jpg", "descriptions": "[Xbox Live Arcade]  Get the full version and discover all 6 massive game modes of this addictive smash-hit! The action-puzzle phenomenon is played by millions on the web, but Xbox Live players get the full HD experience with revolutionary social scoring, avatar support, power ups, and even[Xbox Live Arcade]  Get the full version and discover all 6 massive game modes of this addictive smash-hit! The action-puzzle phenomenon is played by millions on the web, but Xbox Live players get the full HD experience with revolutionary social scoring, avatar support, power ups, and even multiplayer. Get ready for edge of your seat action that'll have you creating swaying, tipping and tumbling towers sky-high. [Microsoft]… Expand"}, {"name": "Contrast (2013)", "details_link": "https://www.metacritic.com/game/pc/contrast-2013", "publisher": "Focus Home Interactive", "release_date": "Nov 15 2013", "developers": ["Compulsion Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/84765f89041433b2625e993ea2a02df9-98.jpg", "descriptions": "Contrast is a 2D/3D puzzle platformer in which you can shift between the striking 3D fantasy world and the mysterious 2D shadowscape."}, {"name": "Yu-Gi-Oh! RUSH DUEL: Dawn of the Battle Royale!!", "details_link": "https://www.metacritic.com/game/switch/yu-gi-oh!-rush-duel-dawn-of-the-battle-royale!!", "publisher": "Konami", "release_date": "Dec  7 2021", "developers": ["Konami"], "platforms": "Switch", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/c4fd21c58b9c606970a6630a17cf6037-98.jpg", "descriptions": "Get ready to d-d-d-d-d-d-d-duel!Yu-Gi-Oh! Rush Duel: Saikyou Battle Royale!! is a turn-based card game set in the world of Yu-Gi-Oh! SEVENS anime that follows the \"Rush Duel\" rule invented by the main character Yuga Ohdo.\n\nEnjoy an original game story that features characters from theGet ready to d-d-d-d-d-d-d-duel!Yu-Gi-Oh! Rush Duel: Saikyou Battle Royale!! is a turn-based card game set in the world of Yu-Gi-Oh! SEVENS anime that follows the \"Rush Duel\" rule invented by the main character Yuga Ohdo.Enjoy an original game story that features characters from the anime. Get ready to meet familiar faces such as Yuga and Luke during your Yu-Gi-Oh! Rush Duel: Saikyou Battle Royale!! adventure.Explore the world of Yu-Gi-Oh! SEVENS and get into a battle with the characters from the anime with the use of the 350 cards available in the game.… Expand"}, {"name": "Adventure Time: Pirates of the Enchiridion", "details_link": "https://www.metacritic.com/game/playstation-4/adventure-time-pirates-of-the-enchiridion", "publisher": "Bandai Namco Games", "release_date": "Jul 17 2018", "developers": ["Bandai Namco Games", "Climax Studios"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Japanese-Style", "Open-World"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/2e3bf6d2b88a8e9a87757cc41e021059-98.jpg", "descriptions": "It's Adventure Time! Finn and Jake have saved the Land of Ooo more times than they can count -- but, this time, they might be in over their heads. Somebody's up to bad biscuits. They got their hands on another Enchiridion, and they've somehow used it to flood the Land of Ooo. Help Finn andIt's Adventure Time! Finn and Jake have saved the Land of Ooo more times than they can count -- but, this time, they might be in over their heads. Somebody's up to bad biscuits. They got their hands on another Enchiridion, and they've somehow used it to flood the Land of Ooo. Help Finn and Jake as they take to the high seas to solve this latest mystery and save the kingdoms of Ooo in this all-new third-person puzzle adventure. Freely explore unknown waters and familiar kingdoms with your crew of Adventure Time buddies. Unleash your heroes' unique abilities in exciting tactical battles on land and sea, and interrogate pirates and other suspicious characters as you try to figure out what son of a blee blop is behind this disastrous series of events.… Expand"}, {"name": "Conception II: Children of the Seven Stars", "details_link": "https://www.metacritic.com/game/playstation-vita/conception-ii-children-of-the-seven-stars", "publisher": "Atlus", "release_date": "Apr 15 2014", "developers": ["Spike", "Spike Chunsoft"], "platforms": ["3DS", "PC", "PlayStation Vita"], "genres": ["Role-Playing", "Console-style RPG", "Japanese-Style"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/abe562fad6c49ab4f3dc7a09fc607063-98.jpg", "descriptions": "Monsters have invaded the world of Aterra, and only a few special individuals, imbued with the power of the Star God, are equipped to fight it. With only a small group of warriors and a narrow window of time in which their powers are at their peak, the solution is clear: combine your StarMonsters have invaded the world of Aterra, and only a few special individuals, imbued with the power of the Star God, are equipped to fight it. With only a small group of warriors and a narrow window of time in which their powers are at their peak, the solution is clear: combine your Star power to make magical Star Children to boost up your forces in battle. The life of a student can be complicated when youre exploring dungeons, fighting monsters, AND trying to maintain a high school lifestyle. Learn to balance your activities because the deeper the bond you have with your classmates, the stronger the Star Children youll make! In this stimulating JRPG, youll be able to create bonds with 7 different female Disciples and create 24 classes of Star Children, so you must learn how to create the perfect Star Children for any situation. In no time, youll have dozens of powerful kids with different skills that can take on everything the monsters throw at you.\r -Combine Star power to make magical Star Children\r-Create bonds with 7 different female Disciples\r-Save Aterra, venture through dungeons & defeat monsters… Expand"}, {"name": "Deadpool", "details_link": "https://www.metacritic.com/game/xbox-360/deadpool", "publisher": "Activision", "release_date": "Jun 25 2013", "developers": ["High Moon Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Fighting", "3D", "Action", "Action Adventure", "Beat-'Em-Up", "Shooter", "Beat-'Em-Up", "Linear", "Third-Person", "3D", "Arcade"], "meta_score": 62, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/988ec8104626f3b7def763ae37e19d05-98.jpg", "descriptions": "Deadpool speaks: \"There are a few important things I need to say before you crack into my insanely sweet game. (Oof. Here we go again.) I'm a mercenary with an accelerated healing factor. I've been described as unstable, which is just plain coo-coo. (Wait, do sane people say coo-coo?) I'mDeadpool speaks: \"There are a few important things I need to say before you crack into my insanely sweet game. (Oof. Here we go again.) I'm a mercenary with an accelerated healing factor. I've been described as unstable, which is just plain coo-coo. (Wait, do sane people say coo-coo?) I'm gonna battle for the safety of humans and mutants. (And even mumans.) Be prepared for just about anything. (Holla!) • I made sure to capture all my good sides, so I made my game a third-person action-shooter. (Yep, you get to look at my heinie.) • Keep a look out cuz some of my X-Men pals (Whoa, what pals?!) are making an appearance. (Hope you don't mind picking hair out of your tacos.) • I'm really good at killing, so I made it a blast stringing together combos, and totally eviscerating my enemies. (Ev-is-cer-a-ting!) • I brought my skills and a buttload of my favorite things. Katanas (check), guns (bang!) explosives (boom), duct tape (quack) and of course, yours truly - ME! (Checkmate!)\"… Expand"}, {"name": "Resident Evil Code: Veronica X", "details_link": "https://www.metacritic.com/game/gamecube/resident-evil-code-veronica-x", "publisher": "Capcom", "release_date": "Dec  3 2003", "developers": ["Nex Entertainment"], "platforms": ["PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 62, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/d31f4000a1f6be4a2c057353c61826a8-98.jpg", "descriptions": "Experience another terrifying chapter in the Resident Evil series with Resident Evil: Code Veronica X.  After narrowly surviving the horrific onslaught in Raccoon City, Claire Redfield now seeks clues in search of her missing brother, Chris.  Join Claire as she uncovers the insidiousExperience another terrifying chapter in the Resident Evil series with Resident Evil: Code Veronica X.  After narrowly surviving the horrific onslaught in Raccoon City, Claire Redfield now seeks clues in search of her missing brother, Chris.  Join Claire as she uncovers the insidious activities of the Umbrella Corporation.   Avoid or eliminate flesh-eating zombies and horrific beasts.  Use a variety weapons, items, and clues scattered around Raccoon City to help you survive the nightmare and make sure the virus doesn't spread any farther.… Expand"}, {"name": "Mace Griffin Bounty Hunter", "details_link": "https://www.metacritic.com/game/playstation-2/mace-griffin-bounty-hunter", "publisher": "VU Games", "release_date": "Jun 20 2003", "developers": ["Warthog"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 62, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/39076acb0ab91a000bce2c9fa8c28d4f-98.jpg", "descriptions": "Unknown forces have set in motion a chain of events that could eliminate every living being in the Vagner System. The Rangers, an elite law enforcement organization, pose the only real threat to this sinister plot. To thwart their investigations, the conspirators orchestrate a campaign toUnknown forces have set in motion a chain of events that could eliminate every living being in the Vagner System. The Rangers, an elite law enforcement organization, pose the only real threat to this sinister plot. To thwart their investigations, the conspirators orchestrate a campaign to undermine the Rangers with infiltration, sabotage, and false incrimination. Ranger Mace Griffin is framed in such a set-up and sentenced to ten years on Penal Colony Delta. In prison, Mace becomes introverted and embittered, and swears to take revenge on those who have wronged him. With the dissolution of the Rangers, law enforcement is left to the Enforcers, who prove incapable of controlling the Vagner System's criminal element. To deal with the rising wave of crime, a new organization emerges: the Guild of Bounty Hunters. A group of both terrans and aliens, it includes former members of the police and military, along with known criminals. The guild is not particular about who joins?as long as they have proven combat ability. Intent on revenge, Mace Griffin sets up as a bounty hunter. The benefits are threefold: a constant stream of cash, access to classified information, and a license to explore the Vagner Frontier System and find out who was behind his downfall and that of the Rangers. [Vivendi Universal]… Expand"}, {"name": "Crash Bandicoot: The Wrath of Cortex", "details_link": "https://www.metacritic.com/game/gamecube/crash-bandicoot-the-wrath-of-cortex", "publisher": "VU Games", "release_date": "Sep 17 2002", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/92efed6291036da5ddf06d190d0f1fe4-98.jpg", "descriptions": "The fifth Crash adventure features engaging gameplay, quirky characters and exotic locales.  Still smarting from his last defeat, Dr. Neo Cortex has developed a new diabolical plan to steal ancient crystals and unleash destructive gods on Crash and the planet Earth.  With Crash and hisThe fifth Crash adventure features engaging gameplay, quirky characters and exotic locales.  Still smarting from his last defeat, Dr. Neo Cortex has developed a new diabolical plan to steal ancient crystals and unleash destructive gods on Crash and the planet Earth.  With Crash and his sister Coco, it's now up to you to find and return all the crystals across dangerous levels, including a volcanic island, a Japanese village, and the jungles of Africa.  You'll find many ways to move around, whether you maneuver a Jeep, fly a hang glider, or pilot a Crash-Mech.  But don't marvel too long at the new inventions, because you might find yourself in a heap of destruction.… Expand"}, {"name": "Driver 2", "details_link": "https://www.metacritic.com/game/playstation/driver-2", "publisher": "Infogrames", "release_date": "Nov 13 2000", "developers": ["Reflections Interactive"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 62, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/ec78d9e8520d2172c003d186a52f47c5-98.jpg", "descriptions": "The crime world's fastest getaway driver is back on the streets in Driver 2, the sequel to the action-packed Driver.  Like its predecessor, Driver 2 is an adrenalin-fueled, high-speed car chase through the streets of four cities, where you, as Tanner, infiltrate the criminal underworld,The crime world's fastest getaway driver is back on the streets in Driver 2, the sequel to the action-packed Driver.  Like its predecessor, Driver 2 is an adrenalin-fueled, high-speed car chase through the streets of four cities, where you, as Tanner, infiltrate the criminal underworld, using your driving skills as well as your cunning to disrupt their plans.  All the true-to-life features of Driver; such as realistic car handling, complete with damage modeling and true, real-world physics reactions on all cars; extensive production, giving the cities an amazing realism, featuring recognizable landmarks; new features such as foot missions, dual player, and the enhanced cut scenes make this game a real adrenalin rush.  … Expand"}, {"name": "Vendetta Online", "details_link": "https://www.metacritic.com/game/pc/vendetta-online", "publisher": "Strategy First", "release_date": "Nov  4 2004", "developers": ["Guild Software"], "platforms": ["iPhone/iPad", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 62, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/0df1f333ed02a791bc8c23faa78edd29-98.jpg", "descriptions": "Vendetta Online is a massively multiplayer game, debuting this summer, which will permit thousands of players to interact as the pilots of spaceships in a vast universe. Users may build their characters in any direction they desire, becoming rich captains of industry, military heros, orVendetta Online is a massively multiplayer game, debuting this summer, which will permit thousands of players to interact as the pilots of spaceships in a vast universe. Users may build their characters in any direction they desire, becoming rich captains of industry, military heros, or outlaws. A fast-paced, realtime \"twitch\" style combat model gives intense action, coupled with the backdrop of RPG gameplay in a massive online galaxy. Three major player factions form a delicate balance of power, with several NPC sub-factions creating situations of economic struggle, political intrigue and conflict. The completely persistent universe and detailed storyline add to the depth of immersion, resulting in a unique online experience. [Guild Software]… Expand"}, {"name": "Conception Plus: Maidens of the Twelve Stars", "details_link": "https://www.metacritic.com/game/playstation-4/conception-plus-maidens-of-the-twelve-stars", "publisher": "Spike Chunsoft", "release_date": "Nov  5 2019", "developers": ["Spike Chunsoft"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 62, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/1/b954b2d56ad4b13065276c9a38c8ad91-98.jpg", "descriptions": "The baby boom is back as this Star-Filled RPG is reborn on Steam!The main protagonist, Itsuki Yuge, is suddenly summoned to the magical world of Granvania to save it from evil Impurities. As the savior from another world known as \"God's Gift,\" Itsuki and his Star Children, born between himThe baby boom is back as this Star-Filled RPG is reborn on Steam!The main protagonist, Itsuki Yuge, is suddenly summoned to the magical world of Granvania to save it from evil Impurities. As the savior from another world known as \"God's Gift,\" Itsuki and his Star Children, born between him and the 12 Star Maidens, are the only ones capable of banishing these Impurities. To return to his own world, he must save this one with the help of his Star Children!KEY FEATURES* The Stars Have Aligned Deepen your bonds with the 12 Star Maidens to birth a new generation of Star Children with updated graphics!* Bred to Fight Form a party up to 13 characters strong and fight through stimulating positioning-based battles!* Adapt and Conquer with the Power of the Stars Featuring Stardust Labyrinths that transform every time you step inside!* The More, the Merrier Flourish a new bond with a newly conceived character, Alfie the trainer!… Expand"}, {"name": "Blood Stone: 007", "details_link": "https://www.metacritic.com/game/xbox-360/blood-stone-007", "publisher": "Activision", "release_date": "Nov  2 2010", "developers": ["Bizarre Creations"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Driving", "Mission-based", "Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 62, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/91b922c335674fc93fde2e29dd2790ac-98.jpg", "descriptions": "Bizarre Creations is crafting a James Bond-branded game that will feature racing and vehicular combat elements."}, {"name": "MySims SkyHeroes", "details_link": "https://www.metacritic.com/game/playstation-3/mysims-skyheroes", "publisher": "Electronic Arts", "release_date": "Sep 28 2010", "developers": ["Electronic Arts"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 62, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/0/bae1ba5809d18a4b1f0a9b33283ba7da-98.jpg", "descriptions": "In MySims SkyHeroes, players take to the sky to lead the resistance against Morcubus and his drone army and to stop his plans to take over the skyways. Starting as an unknown pilot, players fight to become a celebrated hero as they defeat dangerous enemies in aerial combat, test theirIn MySims SkyHeroes, players take to the sky to lead the resistance against Morcubus and his drone army and to stop his plans to take over the skyways. Starting as an unknown pilot, players fight to become a celebrated hero as they defeat dangerous enemies in aerial combat, test their reflexes in fast-paced speed challenges, and take on massive enemy bosses that demand all their skills as a pilot to survive. As they progress, players build, customize and tune their aircraft to give them an edge in combat – upgrade wings for swifter maneuvers, switch out the engine for a speed boost, or change the paint job to camouflage the plane and avoid enemy fire.… Expand"}, {"name": "Barnyard", "details_link": "https://www.metacritic.com/game/playstation-2/barnyard", "publisher": "THQ", "release_date": "Aug  1 2006", "developers": ["Blue Tongue Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 62, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/be212b7b28a140b471dfb2f7ce6ad521-98.jpg", "descriptions": "Welcome to the yard where the world of Nickelodeon's Barnyard movie will come to life. Players start off as the 'new cow on the block,' form alliances with fellow animals, taking on challenges and sporting competitions, protecting the farm from coyote invaders, and doing lots of goofing offWelcome to the yard where the world of Nickelodeon's Barnyard movie will come to life. Players start off as the 'new cow on the block,' form alliances with fellow animals, taking on challenges and sporting competitions, protecting the farm from coyote invaders, and doing lots of goofing off on the side. Players will be able to explore a fully interactive, 3D world and prove that they have what it takes to be the biggest party animal of all. Interact with your favorite Barnyard characters from the movie as you form alliances, join teams, go on quests and play mini-games. Competitive and co-operative multi-player mini-game action for up to four players. Free-form gameplay through areas like Walnut Woods, Dankweed Pond and the Barnyard itself. Environment and gameplay change as nights and days of the week pass on the farm. [THQ]… Expand"}, {"name": "Fantastic 4", "details_link": "https://www.metacritic.com/game/xbox/fantastic-4", "publisher": "Activision", "release_date": "Jun 27 2005", "developers": ["7 Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/471f869791ddd6fb01d45851800e9613-98.jpg", "descriptions": "Based on the 2005 movie of the same name, Fantastic Four lets you control the team of superheroes known as the Fantastic 4. Each character possesses a unique set of abilities that you can use and combine in the hunt for Doctor Doom. The game includes single-player, cooperative, andBased on the 2005 movie of the same name, Fantastic Four lets you control the team of superheroes known as the Fantastic 4. Each character possesses a unique set of abilities that you can use and combine in the hunt for Doctor Doom. The game includes single-player, cooperative, and two-player versus modes. … Expand"}, {"name": "Hero Defense", "details_link": "https://www.metacritic.com/game/xbox-one/hero-defense", "publisher": "Headup Games", "release_date": "Aug 15 2018", "developers": ["Happy Tuesday"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 62, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/963e08f147beca8cd2589e59b2c5646f-98.jpg", "descriptions": "To destroy the world’s most powerful vampire, your team of slayers must impale, slash, tear and burn through legions of undead hell-bent on world domination."}, {"name": "Dynasty Warriors 6 Empires", "details_link": "https://www.metacritic.com/game/playstation-3/dynasty-warriors-6-empires", "publisher": "Koei", "release_date": "Jun 23 2009", "developers": ["Omega Force"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/c6d1ab5a71f48070dd8d76f3e2f05db5-98.jpg", "descriptions": "Designed for the legions of Dynasty Warriors fans, DYNASTY WARRIORS 6: Empires is game that brings together the best aspects of the action and strategy genres. In this latest edition, players can experience Ancient China’s greatest and most glorious war as an all-powerful lord or as anDesigned for the legions of Dynasty Warriors fans, DYNASTY WARRIORS 6: Empires is game that brings together the best aspects of the action and strategy genres. In this latest edition, players can experience Ancient China’s greatest and most glorious war as an all-powerful lord or as an officer. As a lord, gamers must think strategically. By deciding when to attack, when to resist invasion, or when to initiate policies, a lord can expand their power and influence. An easy-to-learn card collecting system lets players enact policies that will increase their empire’s strength, improve the abilities of their forces, and more. The cards that a player receives will depend on the attributes of the officers and their army. Players can also pledge their allegiance to a kingdom to become an officer. As an officer, players can suggest policies in the kingdom’s war council, complete missions for rewards, or even turn against their ruler should relations sour. Most eagerly awaited by fans is a game mode that allows players to create their own warrior. DYNASTY WARRIORS 6: Empires features an extensive character editing system with options to customize a warrior’s gender, build, skin tone, facial features, voice, clothing, weapon and more. Whomever players choose to be, they can now use mountain ledges and waterways to infiltrate enemy bases and launch surprise attacks on supply depots to change the flow of battle. [Koei]… Expand"}, {"name": "Betrayer", "details_link": "https://www.metacritic.com/game/pc/betrayer", "publisher": "Blackpowder Games", "release_date": "Aug 14 2013", "developers": ["Blackpowder Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Modern", "Adventure", "3D", "First-Person"], "meta_score": 62, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/1dd2b46df1548bb8cf5cd402e4130352-98.jpg", "descriptions": "Betrayer washes you ashore in the New World in 1604, where you’re expecting to join a struggling English colony on the Virginia coast. Instead you find only ghosts and mysteries in a land drained of color and life. You’ll build up an arsenal of weaponry including muskets, crossbows andBetrayer washes you ashore in the New World in 1604, where you’re expecting to join a struggling English colony on the Virginia coast. Instead you find only ghosts and mysteries in a land drained of color and life. You’ll build up an arsenal of weaponry including muskets, crossbows and throwing axes, collecting untold treasures along the way. Chart your own course through an untamed wilderness teeming with danger and discovery as you search for survivors and unravel the colony’s many mysteries, including the identity of the strange, silent woman in red who helps from afar.… Expand"}, {"name": "WWE 2K15", "details_link": "https://www.metacritic.com/game/playstation-4/wwe-2k15", "publisher": "2K Sports", "release_date": "Nov 18 2014", "developers": ["Yuke's"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Sports", "Fighting", "Individual", "Combat", "Wrestling"], "meta_score": 62, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/1/58c1e06619abf530dc09f92bff9b2866-98.jpg", "descriptions": "For the first time, guide your custom Superstar through an authentic WWE career in the MyCareer Mode. From NXT to RAW, make your way up to the WWE Championship and live the life of an actual WWE Superstar.  By using new motion capture technology, 2K15 includes many more new animations thanFor the first time, guide your custom Superstar through an authentic WWE career in the MyCareer Mode. From NXT to RAW, make your way up to the WWE Championship and live the life of an actual WWE Superstar.  By using new motion capture technology, 2K15 includes many more new animations than any previous WWE title. The game also includes a new chain wrestling system.… Expand"}, {"name": "Fatal Fury: First Contact", "details_link": "https://www.metacritic.com/game/switch/fatal-fury-first-contact", "publisher": "SNK Corporation", "release_date": "Dec 23 2020", "developers": ["Code Mystics Inc.", "SNK Corporation"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/006376c15be3deea40ef8679ac38ba1c-98.jpg", "descriptions": "The popular Fatal Fury series in its NEOGEO POCKET debut! The legendary lone wolves are spitting sparks in their latest adventure! Can you survive this explosive battle?!"}, {"name": "Raging Justice", "details_link": "https://www.metacritic.com/game/switch/raging-justice", "publisher": "Team17", "release_date": "May  8 2018", "developers": ["MakinGames"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 62, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/d18bc5d4b6541d220888ae88801a5ffc-98.jpg", "descriptions": "The city is in chaos. Crime and corruption is at an all-time high, with thugs wreaking havoc on every corner. It's up to you to punch, kick and brawl your way through the deadly streets, to bring those punks to justice."}, {"name": "Crystal Defenders R1", "details_link": "https://www.metacritic.com/game/wii/crystal-defenders-r1", "publisher": "Square Enix", "release_date": "Apr 20 2009", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1 Player", "genres": ["Simulation", "General", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/61c906a3cd2768cb6f7f3986a681bcb0-98.jpg", "descriptions": "[WiiWare]  In Crystal Defenders R1, you must deploy various units such as Soldiers and Black Mages to stop wave after wave of encroaching monsters from escaping the area with your party's crystals. There are many different types of units to choose from, some specializing in powerful[WiiWare]  In Crystal Defenders R1, you must deploy various units such as Soldiers and Black Mages to stop wave after wave of encroaching monsters from escaping the area with your party's crystals. There are many different types of units to choose from, some specializing in powerful short-range attacks, some wielding far-reaching magicks, and still others equipped with bows that enable them to bring down aerial foes. Deploy units in strategic locations to take full advantage of their traits. Each time an enemy breaches your defenses and reaches a map's exit, your party will lose crystals. When all your crystals are gone, the game is over. Crystal Defenders R1 comes complete with a plethora of exciting stages, each varying in layout and difficulty. Can you defend them all without losing a single crystal? [Nintendo]… Expand"}, {"name": "Space Force: Rogue Universe", "details_link": "https://www.metacritic.com/game/pc/space-force-rogue-universe", "publisher": "DreamCatcher Interactive", "release_date": "Jun  5 2007", "developers": ["Provox Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Space", "Large Spaceship", "Large Spaceship", "Civilian"], "meta_score": 62, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/cf6deb7ed0df863f5f9dae6e0445fab5-98.jpg", "descriptions": "SpaceForce is an RPG space simulation with a heavy focus on ship development, an immersive universe, and freedom of choice. Players have the opportunity to engage in trade, exploration, combat, crafting, questing, and diplomacy in addition to ship development and player activities. PlayersSpaceForce is an RPG space simulation with a heavy focus on ship development, an immersive universe, and freedom of choice. Players have the opportunity to engage in trade, exploration, combat, crafting, questing, and diplomacy in addition to ship development and player activities. Players can choose between 10 professions and more than 14 spacecraft. They can earn money and experience points in order to advance to higher levels. Since A.I. plays a crucial part in SpaceForce, it will create a unique playing experience throughout the game. [DreamCatcher Interactive]… Expand"}, {"name": "Pogo Island", "details_link": "https://www.metacritic.com/game/ds/pogo-island", "publisher": "EA Games", "release_date": "Mar 26 2007", "developers": ["EA Canada"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/55ad54cd0fe2c280a62278bbf623df04-98.jpg", "descriptions": "Pogo Island offers an easy to learn but challenging to master level of enjoyment that will make hours feel like fleeting minutes. Each of the games -- Word Whomp, Poppit!, Phlinx, Tri-Peaks Solitaire and Squelchies -- is skinned to a playful island theme that transports you to an islandPogo Island offers an easy to learn but challenging to master level of enjoyment that will make hours feel like fleeting minutes. Each of the games -- Word Whomp, Poppit!, Phlinx, Tri-Peaks Solitaire and Squelchies -- is skinned to a playful island theme that transports you to an island getaway. Above and beyond the five puzzle games is a fun and unique meta-game that sets players on an island-wide adventure mission to reunite with stranded Pogo mascots. Along the way, players will collect tokens which can either be translated into bragging rights amongst peers or transferred to Pogo.com, where players can reap the benefits of being a token guru. [Electronic Arts]… Expand"}, {"name": "The Complex", "details_link": "https://www.metacritic.com/game/pc/the-complex", "publisher": "Wales Interactive", "release_date": "Mar 31 2020", "developers": ["Wales Interactive"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 62, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/d4ae61289086faf76c3cc7c0e2435880-98.jpg", "descriptions": "The Complex is an interactive sci-fi thriller movie from the publishers of Late Shift and The Bunker. After a major bio-weapon attack on London, two scientists find themselves in a locked-down laboratory with time, and air, running out. Your actions and your relationship with otherThe Complex is an interactive sci-fi thriller movie from the publishers of Late Shift and The Bunker. After a major bio-weapon attack on London, two scientists find themselves in a locked-down laboratory with time, and air, running out. Your actions and your relationship with other characters will lead you to one of eight suspenseful endings.… Expand"}]