[{"name": "Castlevania: Order of Ecclesia", "details_link": "https://www.metacritic.com/game/ds/castlevania-order-of-ecclesia", "publisher": "Konami", "release_date": "Oct 21 2008", "developers": ["Konami"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Platformer", "Platformer", "Action RPG", "2D", "2D", ""], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/da2503c566a69653cc1bbf0a8ea00685-98.jpg", "descriptions": "The legendary Castlevania series is back in its 3rd installment on the Nintendo DS. This time you play as a member of the Ecclesia, an organization that has sworn to defeat the evil forces of Dracula. Use the brand new Glyph attack system which has more than 100 different combinations toThe legendary Castlevania series is back in its 3rd installment on the Nintendo DS. This time you play as a member of the Ecclesia, an organization that has sworn to defeat the evil forces of Dracula. Use the brand new Glyph attack system which has more than 100 different combinations to battle Dracula and his minions throughout 20 explorable areas. Take part in side quests and collect items to power up your character in the next great Castlevania game produced by Koji Igarashi. Castlevania: The Order of Ecclesia features intense side-scrolling action gameplay as you quest to collect elements that will help you in your quest against Dracula. Explore all-new outdoor areas from the forests to the ocean. Compete head-to-head via the Nintendo DS Wi-Fi Connection. Sell and buy items and equipment you have found while playing with other players utilizing Nintendo DS Wi-Fi Connection. Utilize multiple abilities and attacks simultaneously with the all-new Glyph attack system. Replay more than once to discover multiple endings. [Konami]… Expand"}, {"name": "Batman: Arkham City - Armored Edition", "details_link": "https://www.metacritic.com/game/wii-u/batman-arkham-city---armored-edition", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 18 2012", "developers": ["Rocksteady Studios", "WB Games Montreal"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "Fantasy", "Open-World"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/d25020edb124de834beae83921e3a089-98.jpg", "descriptions": "Developed by WB Games Montreal, Batman: Arkham City Armored Edition is the enhanced version of the game created by Rocksteady Studios. The Wii U version delivers the same impactful story and gameplay as the original title, this time with enhanced gameplay mechanics and features made possibleDeveloped by WB Games Montreal, Batman: Arkham City Armored Edition is the enhanced version of the game created by Rocksteady Studios. The Wii U version delivers the same impactful story and gameplay as the original title, this time with enhanced gameplay mechanics and features made possible with the Wii U and its unique GamePad. Batman: Arkham City is set in the new maximum security “home” for all of Gotham City’s thugs, gangsters and insane criminal masterminds. Featuring an vast Rogues Gallery of Gotham City’s most dangerous criminals including Catwoman, The Joker, The Riddler, Two-Face, Harley Quinn, The Penguin, Mr. Freeze and many others, the game allows players to genuinely experience what it feels like to be The Dark Knight delivering justice on the streets of Gotham City. … Expand"}, {"name": "Borderlands: The Secret Armory of General Knoxx", "details_link": "https://www.metacritic.com/game/playstation-3/borderlands-the-secret-armory-of-general-knoxx", "publisher": "2K Games", "release_date": "Feb 25 2010", "developers": ["Gearbox Software"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/c219d4522c5c662d96618d826d5ddbe2-98.jpg", "descriptions": "(Downloadable Content)  Borderlands goes to ELEVEN! You may have seen some games raise their level cap by 5, or maybe even 10, but with The Crimson Lance Assassination Squads wreaking havoc and Crawmerax the Invincible being all invulnerable and stuff we knew you'd need more than just 10.(Downloadable Content)  Borderlands goes to ELEVEN! You may have seen some games raise their level cap by 5, or maybe even 10, but with The Crimson Lance Assassination Squads wreaking havoc and Crawmerax the Invincible being all invulnerable and stuff we knew you'd need more than just 10. And that's why Borderlands goes to ELEVEN! The Secret Armory of General Knoxx is an add-on pack for Borderlands that adds new guns, new Class Mods, new vehicles, new missions, new enemy types, and increases the level cap to 61. [Xbox.com]… Expand"}, {"name": "Tactics Ogre: Reborn", "details_link": "https://www.metacritic.com/game/switch/tactics-ogre-reborn", "publisher": "Square Enix", "release_date": "Nov 11 2022", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 85, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/ce21536ec107ced98a38d24848a59b82-98.jpg", "descriptions": "Based on the 2010 release, the game features improved graphics and sound, as well as updated game design, bringing to life a new Tactics Ogre that remains true to its roots. Tactics Ogre veterans will experience a game that surpasses their fondest memories, while players new to Tactics OgreBased on the 2010 release, the game features improved graphics and sound, as well as updated game design, bringing to life a new Tactics Ogre that remains true to its roots. Tactics Ogre veterans will experience a game that surpasses their fondest memories, while players new to Tactics Ogre will discover a game unlike any they've ever played. Reborn and deeper than ever, the game enables players to immerse themselves in the world and intrigue of Tactics Ogre like never before. The Valerian Isles, jewels of the Obero Sea. Long a center of naval commerce, the people of the isles struggled throughout history for dominion over her shores. Finally there rose a man to put an end to this conflict: Dorgalua Oberyth. But history would know him as the \"Dynast-King.\" King Dorgalua strove to stamp out the hatred among the people of the isles, and for fully half a century, Valeria knew prosperity. Yet upon the king's death, civil war erupted anew as three factions vied for control: the Bakram, who comprised much of Valeria's nobility; the Galgastani, whose people made up the majority of the isles' population; and the Walister, who numbered but few. The isles were soon divided between the Bakram and Galgastani, and an uneasy peace settled across the land. Yet none believed the calm would last...… Expand"}, {"name": "PlayerUnknown's Battlegrounds", "details_link": "https://www.metacritic.com/game/xbox-one/playerunknowns-battlegrounds", "publisher": "Microsoft Game Studios", "release_date": "Sep  4 2018", "developers": ["Bluehole", "Inc."], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 85, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/3/449a1f340d860767d01f0c042c549f7c-98.jpg", "descriptions": "Battlegrounds (PUBG), the tactical, high-octane battle royale phenomenon, debuted footage from two new maps: Sanhok, a smaller-scale, action-packed map inspired by the islands that dot the Southeast Pacific Ocean, and a snow-covered map currently in development. New footage also debuted ofBattlegrounds (PUBG), the tactical, high-octane battle royale phenomenon, debuted footage from two new maps: Sanhok, a smaller-scale, action-packed map inspired by the islands that dot the Southeast Pacific Ocean, and a snow-covered map currently in development. New footage also debuted of War Mode, a deathmatch-style battle royale gaming experience and the world premiere debut of the Ballistic Shield, a new tool for setting up quick cover for explosive and close-distance attacks. [Xbox.com]… Expand"}, {"name": "Chime Sharp", "details_link": "https://www.metacritic.com/game/pc/chime-sharp", "publisher": "Chilled Mouse", "release_date": "Jul 19 2016", "developers": ["Twistplay", "Ste Curran"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 85, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/0416a11153d6d6689af20875451efe7f-98.jpg", "descriptions": "Place pieces, paint the board, make music. Chime Sharp is an sequel to 2009's Chime, a music puzzle game with an addictive, ambient heartbeat. You tessellate shapes to cover a grid, while a beatline reads those shapes as notes. As you cover the board the music builds to a beautiful crescendoPlace pieces, paint the board, make music. Chime Sharp is an sequel to 2009's Chime, a music puzzle game with an addictive, ambient heartbeat. You tessellate shapes to cover a grid, while a beatline reads those shapes as notes. As you cover the board the music builds to a beautiful crescendo of your own design. The only way to discover Chime is to play it, but if you want a glimpse, consider what it might feel like to cross Tetris, a music sequencer and a hypnotic dream about your favourite pop song.… Expand"}, {"name": "Shantae and the Pirate's Curse", "details_link": "https://www.metacritic.com/game/wii-u/shantae-and-the-pirates-curse", "publisher": "WayForward", "release_date": "Dec 25 2014", "developers": ["WayForward"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/ed136b125a4e668d13a84a62aee96d5b-98.jpg", "descriptions": "Embark on a brand new adventure which teams Shantae with her arch nemesis, Risky Boots! When a curse falls upon Sequin Land, Risky Boots and Shantae must join forces to battle unimaginable evil. Shantae must give up her job as Scuttle Towns \"Guardian Genie\" and become a pirate ifEmbark on a brand new adventure which teams Shantae with her arch nemesis, Risky Boots! When a curse falls upon Sequin Land, Risky Boots and Shantae must join forces to battle unimaginable evil. Shantae must give up her job as Scuttle Towns \"Guardian Genie\" and become a pirate if she hopes to get her magic back and save the day. As a pirate, Shantae gains new weapons and tools to advance her quest and power through monsters!\r *    Flintlock Pistol (blast enemies and switches from afar)\r*    Pirate Hat (glide on the wind using this enormous headwear)\r*    Risky's Boots (run at super speeds! Chain your attacks as you dash through enemies & over lava)\r*    Cannon (blast yourself into the air on a belch of black powder)\r Core Gameplay Components:\r *    Whipping! Destroy monsters, topple bosses, and solve puzzles with your hair\r*    Platforming! Run and jump through deviously designed levels\r*    Exploring! Navigate a world of interconnected levels and Labyrinths\r*    Belly Dancing! Dance with your Magic Lamp to suck up magic and items\r*    Customizing! Earn new abilities, unlock stat-boosting artifacts, magic & costumes\r*    Storytelling! Flirtatious characters and wonderfully off-beat humor… Expand"}, {"name": "Trials Evolution: Gold Edition", "details_link": "https://www.metacritic.com/game/pc/trials-evolution-gold-edition", "publisher": "Ubisoft", "release_date": "Mar 21 2013", "developers": ["RedLynx"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Driving", "Racing", "Arcade", "Motorcycle", "Other", "Motocross", "Motocross"], "meta_score": 85, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/d93e875fd8e06e333a48b7a52c600b4d-98.jpg", "descriptions": "The Gold Edition will also include everything from Trials HD - the XBLA predecessor to Trials Evolution - doubling the amount of content being offered in the return of Trials to the PC. Altogether, Trials Evolution: Gold Edition will contain more than 120 tracks, skill games, and multiplayer levels."}, {"name": "Prince of Persia", "details_link": "https://www.metacritic.com/game/playstation-3/prince-of-persia", "publisher": "Ubisoft", "release_date": "Dec  2 2008", "developers": ["Ubisoft Montreal"], "platforms": ["3DS", "PC", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/ccd94cf22e2838f5ae1ccdd8bb207e21-98.jpg", "descriptions": "Set in a land rooted in ancient Persian mythology, the Prince finds himself caught in an epic battle between the primal forces of light and darkness: the God of Light, Ormazd versus his brother Ahriman, the destructive God of Darkness. The Prince arrives just in time to witness theSet in a land rooted in ancient Persian mythology, the Prince finds himself caught in an epic battle between the primal forces of light and darkness: the God of Light, Ormazd versus his brother Ahriman, the destructive God of Darkness. The Prince arrives just in time to witness the destruction of the legendary Tree of Life - an act which threatens to plunge the entire world into eternal darkness. Manifested in the form of the Corruption, a dark substance that physically contaminates the land and the skies, the Prince must partner with Elika, a deadly companion, to heal the world from the evil Corruption. [Ubisoft]… Expand"}, {"name": "Moss", "details_link": "https://www.metacritic.com/game/playstation-4/moss", "publisher": "Sony Interactive Entertainment", "release_date": "Feb 27 2018", "developers": ["Polyarc"], "platforms": ["PC", "PlayStation 5", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/7ad14a0363f9581134322eeadf05db63-98.jpg", "descriptions": "Meet Quill, a young mouse with dreams of greatness beyond the confines of her quiet settlement. One day while exploring the woods, she finds a mysterious stone and an ancient magic is awakened. Dramatic events quickly unfold as a distant evil extends its reach. With her uncle now in graveMeet Quill, a young mouse with dreams of greatness beyond the confines of her quiet settlement. One day while exploring the woods, she finds a mysterious stone and an ancient magic is awakened. Dramatic events quickly unfold as a distant evil extends its reach. With her uncle now in grave danger, Quill must embark on an epic journey—and she needs you there by her side. Together, you'll travel to forgotten realms, solve challenging puzzles, and battle menacing enemies. Alone, no one can conquer what you're up against. But united, you just may defeat even the darkest of villains. Immerse yourself in the world of Moss to help write the story of a hero in the making. [Playstation.com]… Expand"}, {"name": "Bionic Commando: Rearmed", "details_link": "https://www.metacritic.com/game/xbox-360/bionic-commando-rearmed", "publisher": "Capcom", "release_date": "Aug 13 2008", "developers": ["GRIN"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/93aa268e32a8194ba1702b424ef88b53-98.jpg", "descriptions": "[Xbox Live Arcade]  Bionic Commando Rearmed sees a return of the intense 2-D side-scrolling, shooting, and grappling action from the much-loved 1988 Bionic Commando. Bionic Commando Rearmed brings the gameplay up to date with stunning new visuals, new weapons, online rankings, and a reworked[Xbox Live Arcade]  Bionic Commando Rearmed sees a return of the intense 2-D side-scrolling, shooting, and grappling action from the much-loved 1988 Bionic Commando. Bionic Commando Rearmed brings the gameplay up to date with stunning new visuals, new weapons, online rankings, and a reworked musical score just for starters. Bionic Commando Rearmed delivers two-player co-op, a frenetic multiplayer mode for up to four players, and a series of over 50 devious challenge rooms to test your swinging skills. Wire-tapping the enemy communication in Bionic Commando Rearmed gives you access to information about weaknesses for the newly-designed Imperial bosses in the game. Play Bionic Commando Rearmed to unlock the original NES character costume and use it in Bionic Commando. [Capcom]… Expand"}, {"name": "Sid Meier's Civilization Revolution", "details_link": "https://www.metacritic.com/game/playstation-3/sid-meiers-civilization-revolution", "publisher": "2K Games", "release_date": "Jul  8 2008", "developers": ["Firaxis Games"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/b2f455449a43add0dcfae60b8670e3dd-98.jpg", "descriptions": "Civilization Revolution offers players a chance to experience the epic empire-building world of Civilization in an all new accessible, visually immersive, and action-packed world specifically designed for the console and handheld gamer. Delivering Civilization's renowned epic single-playerCivilization Revolution offers players a chance to experience the epic empire-building world of Civilization in an all new accessible, visually immersive, and action-packed world specifically designed for the console and handheld gamer. Delivering Civilization's renowned epic single-player campaigns featuring vast re-playability and unmatched addictive gameplay as well as revolutionary features like real-time interaction with leaders and advisors, extensive multiplayer capabilities and integrated video and voice chat, it transports the Civilization series to a level of gameplay that fans have never seen before. Some of the key features that resonate with fans of strategy games and the Civilization franchise include 16 civilizations to master and lead to victory, an array of famous historical leaders to play as or compete against, and accessible maps and streamlined time scale for quicker games, intense combat, and constant action. In online multiplayer mode, players compete for world conquest and glory among their peers as they battle in teams, head-to-head or epic free-for-all matches. In addition, auto-matching, ranked games, leaderboards, achievements, downloadable extra content and integrated video and voice chat make the online play more versatile and fun than any previous version of Civilization and will allow players to see where they stand against the competition. Finally, the position of ruler of the world can be settled online. [2K Games]… Expand"}, {"name": "ESPN NBA 2K5", "details_link": "https://www.metacritic.com/game/xbox/espn-nba-2k5", "publisher": "Sega", "release_date": "Sep 28 2004", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/be4003470d119dfb3e2e756bd14dbdf5-98.jpg", "descriptions": "This year's installment in the ESPN NBA series features a host of gameplay improvements. Now a player's ability and physical makeup determine how fast he can run up the court on a fast break, how well he can cut to the basket off his opponent, and more. IsoMotion2 gives you more control overThis year's installment in the ESPN NBA series features a host of gameplay improvements. Now a player's ability and physical makeup determine how fast he can run up the court on a fast break, how well he can cut to the basket off his opponent, and more. IsoMotion2 gives you more control over dribbling moves and makes it easier to handle overaggressive ball handlers. Develop your created player's career in a revamped 24/7 mode, or take on your friends in new multiplayer games.… Expand"}, {"name": "Death Stranding: Director's Cut", "details_link": "https://www.metacritic.com/game/playstation-5/death-stranding-directors-cut", "publisher": "Sony Interactive Entertainment", "release_date": "Sep 24 2021", "developers": ["Kojima Productions"], "platforms": ["PC", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/10195976cd50e4ab98b9580b9addbc7c-98.jpg", "descriptions": "From legendary game creator Hideo Kojima comes a genre-defying experience, now expanded and remastered for the PlayStation 5 console in this definitive Director’s Cut. In the future, a mysterious event known as the Death Stranding has opened a doorway between the living and the dead, leadingFrom legendary game creator Hideo Kojima comes a genre-defying experience, now expanded and remastered for the PlayStation 5 console in this definitive Director’s Cut. In the future, a mysterious event known as the Death Stranding has opened a doorway between the living and the dead, leading to grotesque creatures from the afterlife roaming the fallen world marred by a desolate society. Take on the trials of Sam Bridges with advanced combat, more character actions and a competitive ranking system for special player challenges.* Make use of additional weapons and vehicles, take on new enemy types and explore new locations such as the Firing Range and Racetrack, featuring extra missions and minigames. Experience an extended storyline through new missions in an expanded area. … Expand"}, {"name": "The Walking Dead: The Telltale Definitive Series", "details_link": "https://www.metacritic.com/game/xbox-one/the-walking-dead-the-telltale-definitive-series", "publisher": "Skybound Games", "release_date": "Sep 10 2019", "developers": ["Telltale Games", "Skybound Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/743d6efd5cf58b4930b010083ece8b29-98.jpg", "descriptions": "The Walking Dead: The Telltale Definitive Series contains all 4 Seasons, 400 Days, and The Walking Dead: Michonne, which includes over 50 hours of gameplay across 23 unique episodes. With graphical enhancements, behind the scenes bonus features and faithful recreations of classic menus, thisThe Walking Dead: The Telltale Definitive Series contains all 4 Seasons, 400 Days, and The Walking Dead: Michonne, which includes over 50 hours of gameplay across 23 unique episodes. With graphical enhancements, behind the scenes bonus features and faithful recreations of classic menus, this is the definitive way to experience Clementine's journey and find out how her story ends.… Expand"}, {"name": "Monster Boy and the Cursed Kingdom", "details_link": "https://www.metacritic.com/game/xbox-one/monster-boy-and-the-cursed-kingdom", "publisher": "FDG Entertainment", "release_date": "Dec  4 2018", "developers": ["FDG Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/6d1c64704064a0c8a907479fadbf4207-98.jpg", "descriptions": "A legendary game series returns with an all-new adventure and in HD. Monster Boy is a colorful side-scrolling action adventure created in cooperation with Ryuichi Nishizawa, the creator of the famous Wonder Boy in Monster World series. Monster Boy is being created to bring back the enjoymentA legendary game series returns with an all-new adventure and in HD. Monster Boy is a colorful side-scrolling action adventure created in cooperation with Ryuichi Nishizawa, the creator of the famous Wonder Boy in Monster World series. Monster Boy is being created to bring back the enjoyment of the classic games that shine by simplicity. Exciting gameplay, upbeat music and smooth graphics. You'll need to overcome huge bosses, find hidden passages, discover powerful equipment and use all your wits and skills to remove a powerful curse. Transform into 6 different creatures, each with their own skills and abilities. Take advantage of all the unique powers to open new paths and advance in an epic story.… Expand"}, {"name": "Warhammer 40,000: Dawn of War - Winter Assault", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-dawn-of-war---winter-assault", "publisher": "THQ", "release_date": "Sep 21 2005", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/791c0bfd0f9e7148eedc04724ef8ce7a-98.jpg", "descriptions": "Lost amongst the ruins of a leveled city lies an Emperor Class Titan, a war vessel of untold power forged in the planet-wide furnaces of Mars, and revered by billions as the epitome of Imperial dominance. The one who controls it will command the power to destroy, or defend, a world. TheLost amongst the ruins of a leveled city lies an Emperor Class Titan, a war vessel of untold power forged in the planet-wide furnaces of Mars, and revered by billions as the epitome of Imperial dominance. The one who controls it will command the power to destroy, or defend, a world. The Imperials will summon it to overcome great evil, Chaos will corrupt it for their own designs, Orks will destroy it in their bloodlust and Eldar will disregard it in their arrogance. The expansion pack to the award winning Warhammer 40,000: Dawn of War will build upon the most exciting, visceral, front-line battlefield ever seen in an RTS game. Winter Assault promises to be one of the biggest expansion packs ever. [THQ]… Expand"}, {"name": "Silent Hill 3", "details_link": "https://www.metacritic.com/game/playstation-2/silent-hill-3", "publisher": "Konami", "release_date": "Aug  6 2003", "developers": ["KCET"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/abadd784bdc3c69e83d890d9ab24ca3c-98.jpg", "descriptions": "Silent Hill 3 continues the series' trademark brand of psychological horror and terrifying gameplay. As a teenage girl named Heather, players must explore and unravel the mysterious connection between the god-forsaken town and her inner fears. With enhanced graphical detail, a more complexSilent Hill 3 continues the series' trademark brand of psychological horror and terrifying gameplay. As a teenage girl named Heather, players must explore and unravel the mysterious connection between the god-forsaken town and her inner fears. With enhanced graphical detail, a more complex storyline, and even more grotesque monsters than the previous games, Silent Hill 3 promises to be the best horror adventure ever. Features new monsters, items and weapons, including a submachine gun. [Konami]… Expand"}, {"name": "Terraria", "details_link": "https://www.metacritic.com/game/playstation-vita/terraria", "publisher": "505 Games", "release_date": "Dec 17 2013", "developers": ["Engine Software"], "platforms": ["3DS", "iPhone/iPad", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Stadia", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation Vita"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "Platformer", "Platformer", "Sandbox", "2D", "2D"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/8c0b359ebf1cd5cf126887b5ca8ab659-98.jpg", "descriptions": "Terraria is a side-scrolling, action-adventure sandbox game with an emphasis on crafting and exploration set in vast and vibrant worlds."}, {"name": "Outer Wilds", "details_link": "https://www.metacritic.com/game/pc/outer-wilds", "publisher": "Annapurna Interactive", "release_date": "May 30 2019", "developers": ["Mobius Digital", "LLC"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/319a746f6007e5b8b28eddca24f26d94-98.jpg", "descriptions": "Outer Wilds is an open world mystery about a solar system trapped in an endless time loop."}, {"name": "Shovel Knight Dig", "details_link": "https://www.metacritic.com/game/switch/shovel-knight-dig", "publisher": "Yacht Club Games", "release_date": "Sep 23 2022", "developers": ["Yacht Club Games", "Nitrome"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/6811e703fbd3492cb7b71a62316c8aa2-98.jpg", "descriptions": "When Drill Knight and his dastardly digging crew blast apart Shovel Knight's peaceful campsite and steal his loot, he grabs his trusty Shovel Blade and starts tunnelling after them. Meet new friends and foes, visit strange lands, and outfit yourself in your quest to keep the entire land fromWhen Drill Knight and his dastardly digging crew blast apart Shovel Knight's peaceful campsite and steal his loot, he grabs his trusty Shovel Blade and starts tunnelling after them. Meet new friends and foes, visit strange lands, and outfit yourself in your quest to keep the entire land from collapsing underfoot! Jump, slash, and dig your way down an ever-changing chasm of mystery in Shovel Knight Dig, an all-new Shovel Knight adventure!… Expand"}, {"name": "Trials Rising", "details_link": "https://www.metacritic.com/game/xbox-one/trials-rising", "publisher": "Ubisoft", "release_date": "Feb 26 2019", "developers": ["RedLynx"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 85, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/b5f45ba8dd823b2d6159f02dff9d05a2-98.jpg", "descriptions": "Explore challenging tracks around the world, from Yellowstone Park to the peaks of Mt. Everest and everywhere in between. New Tandem Bike mode allows two riders to control one bike. Hone your racing skills and level up from local backyard competitions to stadium races. Make a statement withExplore challenging tracks around the world, from Yellowstone Park to the peaks of Mt. Everest and everywhere in between. New Tandem Bike mode allows two riders to control one bike. Hone your racing skills and level up from local backyard competitions to stadium races. Make a statement with customizable outfits and bike skins. … Expand"}, {"name": "Tomb Raider: Definitive Edition", "details_link": "https://www.metacritic.com/game/playstation-4/tomb-raider-definitive-edition", "publisher": "Square Enix", "release_date": "Jan 28 2014", "developers": ["Crystal Dynamics", "Nixxes Software"], "platforms": ["Stadia", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Modern", "Action Adventure", "General", "Modern", "Linear"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/5a581e1833f5a63a0177be6dee00b333-98.jpg", "descriptions": "Armed with only the raw instincts and physical ability to push beyond the limits of human endurance, Tomb Raider delivers an intense and gritty story into the origins of Lara Croft and her ascent from a frightened young woman to a hardened survivor."}, {"name": "Tunic", "details_link": "https://www.metacritic.com/game/xbox-series-x/tunic", "publisher": "Finji", "release_date": "Mar 16 2022", "developers": ["ISOMETRICORP Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/c368b89ba86e0cbbef267ad33f065475-98.jpg", "descriptions": "TUNIC is an action adventure game about a tiny fox in a big world where you don't belong. Presented by Finji.\r Developed by Andrew Shouldice, TUNIC is a game shrouded in mystery and intrigue. Crafted to evoke feelings of classic action adventure games, TUNIC stars a heroic little fox asTUNIC is an action adventure game about a tiny fox in a big world where you don't belong. Presented by Finji.\r Developed by Andrew Shouldice, TUNIC is a game shrouded in mystery and intrigue. Crafted to evoke feelings of classic action adventure games, TUNIC stars a heroic little fox as they explore a foreign land that hides danger around every corner. Discover unique items, new combat techniques, and arcane secrets as our hero forges their way through intriguing new world.… Expand"}, {"name": "Starcraft Remastered", "details_link": "https://www.metacritic.com/game/pc/starcraft-remastered", "publisher": "Blizzard Entertainment", "release_date": "Aug 14 2017", "developers": ["Blizzard Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Command"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/d6682d1dd279cbce2598c0eb7668d855-98.jpg", "descriptions": "StarCraft®: Remastered upgrades the essential sci-fi strategy experience from beginning to end. Welcome back to the original game and its award-winning expansion, StarCraft: Brood War."}, {"name": "DmC: Devil May Cry", "details_link": "https://www.metacritic.com/game/playstation-3/dmc-devil-may-cry", "publisher": "Capcom", "release_date": "Jan 15 2013", "developers": ["Ninja Theory"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 85, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/78ff1f4ba35e434b06b182d6e790cab2-98.jpg", "descriptions": "In a society infused with demons, only The Order can, in Platonic style, see the world as it truly is. Join Dante in this stylish action experience; chain together multiple combos with flair and send the demonic spawn back to hell – reveal the truth behind the lies. Delve into Dante’s darkIn a society infused with demons, only The Order can, in Platonic style, see the world as it truly is. Join Dante in this stylish action experience; chain together multiple combos with flair and send the demonic spawn back to hell – reveal the truth behind the lies. Delve into Dante’s dark past confronting some the most familiar faces in the DmC universe. Harness unimaginable powers combined with Dante’s notorious arsenal of weapons: sword, scythe, axe, pistols and more.… Expand"}, {"name": "NBA 2K18", "details_link": "https://www.metacritic.com/game/xbox-one/nba-2k18", "publisher": "2K Games", "release_date": "Sep 15 2017", "developers": ["2K Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 85, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/2/a589fa3746fa90f0c056b0c858a646cd-98.jpg", "descriptions": "The highest rated* annual sports title of this console generation returns with NBA 2K18, featuring unparalleled authenticity and improvements on the court.\r *According to 2008 - 2016 Metacritic.com"}, {"name": "Shadow Tactics: Blades of the Shogun", "details_link": "https://www.metacritic.com/game/playstation-4/shadow-tactics-blades-of-the-shogun", "publisher": "Daedalic Entertainment", "release_date": "Aug  1 2017", "developers": ["Mimimi Productions"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/840626852f192736492277c32f216c39-98.jpg", "descriptions": "The tactical game with stealth elements Shadow Tactics: Blades of the Shogun is a cooperative endeavor of Daedalic Entertainment and Mimimi Productions. The game is a special take on the genre: it takes place during the Edo-Era of Japan in 1615. Within a playtime of roughly 25 hours, 5The tactical game with stealth elements Shadow Tactics: Blades of the Shogun is a cooperative endeavor of Daedalic Entertainment and Mimimi Productions. The game is a special take on the genre: it takes place during the Edo-Era of Japan in 1615. Within a playtime of roughly 25 hours, 5 characters will face challenging missions, each protagonist with their own special field of expertise. Only if you know the positive and negative qualities of your characters and play tactically and with finesse, will you master the challenges ahead.… Expand"}, {"name": "Planescape: Torment - Enhanced Edition", "details_link": "https://www.metacritic.com/game/pc/planescape-torment---enhanced-edition", "publisher": "Beamdog", "release_date": "Apr 11 2017", "developers": ["Beamdog"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/34337f7c7b08cd16cf9395e2d9fc24f1-98.jpg", "descriptions": "Uncover secrets of past lives in this story-rich, tactical roleplaying game set in Sigil, a dark fantasy city at the heart of the Dungeons & Dragons multiverse. Explore the planes, survive combat alongside a party of bizarre companions, and solve puzzles unlike any ever seen in the genre."}, {"name": "Super Meat Boy", "details_link": "https://www.metacritic.com/game/playstation-4/super-meat-boy", "publisher": "Team Meat", "release_date": "Oct  6 2015", "developers": ["Team Meat"], "platforms": ["PC", "PlayStation Vita", "Switch", "Wii U", "Xbox 360", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 85, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/737f1b26342b6fc4d5ab05f0a191519e-98.jpg", "descriptions": "Super Meat Boy is a tough as nails platformer where you play as an animated cube of meat who's trying to save his girlfriend (who happens to be made of bandages) from an evil fetus in a jar wearing a tux."}, {"name": "Pyre", "details_link": "https://www.metacritic.com/game/playstation-4/pyre", "publisher": "Supergiant Games", "release_date": "Jul 25 2017", "developers": ["Supergiant Games"], "platforms": ["PC", "PlayStation 4"], "genres": ["Role-Playing", "General"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/2d4d7fb110a28b787877f15f1e1ba77c-98.jpg", "descriptions": "Pyre is a party-based RPG from the creators of Bastion and Transistor. Lead your band of exiles to freedom through a series of mystical competitions in the Campaign, or challenge a friend to a fast-paced ritual showdown in the head-to-head Versus Mode."}, {"name": "Tony Hawk's Underground 2", "details_link": "https://www.metacritic.com/game/pc/tony-hawks-underground-2", "publisher": "Activision", "release_date": "Oct  4 2004", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "PC"], "num_players": "8  Online", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/e9cd4b9ecb47168ddfb2c402067649ab-98.jpg", "descriptions": "You've been chosen by Tony Hawk to take on Bam Margera as your teams go on a World Destruction Tour. It's time to go globetrotting on an insane road trip. THUG 2 grinds in with a hilarious story mode, an unprecedented level of customization, and more moves than the Skate Gods could dream of.You've been chosen by Tony Hawk to take on Bam Margera as your teams go on a World Destruction Tour. It's time to go globetrotting on an insane road trip. THUG 2 grinds in with a hilarious story mode, an unprecedented level of customization, and more moves than the Skate Gods could dream of. Grab your board, an arsenal of spray-paint... jump into the tour van and wreak havoc across the globe. World Destruction Tour: Hawk recruits YOU onto his team for a no rules, no limits world tour versus Bam Margera. You invade international cities and wreak havoc, proving yourself to the pros as you live the ultimate skateboard adventure. All New Team Play: Team Hawk versus Team Bam. Play as yourself or switch to play one of your teammates or a special guest skater ? over 20 unique characters. Unparalleled Customization: Create your own logo for use in graffiti tags, skate stickers with the all new \"Create-A-Graphic\" feature. Familiar Hawk customization continues with \"Create-A-Goal,\" \"Create-A-Park\" and the revolutionary \"Face In The Game\" feature. More Player Control Than Ever Before: Tear it up with sticker slaps, projectiles, crazy vehicles, hilarious tantrums, and slow-motion Focus Control. 2 Games In 1: Team up and wreak havoc in Story Mode or switch and play 15 levels in Classic Mode. Complete your all-time favorite goals like S-K-A-T-E, Secret Tape, and High Score against a 2-minute timer.… Expand"}, {"name": "FIFA 17", "details_link": "https://www.metacritic.com/game/playstation-4/fifa-17", "publisher": "Electronic Arts", "release_date": "Sep 27 2016", "developers": ["EA Sports", "EA Vancouver"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 85, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/8/d302ac5eee79085267fa544104527643-98.jpg", "descriptions": "EA SPORTS FIFA 17 The Journey isa new game mode powered by Frostbite. Immersed in The Journey, fans live their story on and off the pitch as Premier League prospect, Alex Hunter who is looking to make his mark. Fans visit new football worlds, meet new characters full of depth, and navigateEA SPORTS FIFA 17 The Journey isa new game mode powered by Frostbite. Immersed in The Journey, fans live their story on and off the pitch as Premier League prospect, Alex Hunter who is looking to make his mark. Fans visit new football worlds, meet new characters full of depth, and navigate emotional highs and lows of their unique story arc through decisions off the pitch, their performance on it, and character interactions throughout the 2016/17 season while playing for any of the 20 Premier League clubs. [Electronic Arts]… Expand"}, {"name": "Manifold Garden", "details_link": "https://www.metacritic.com/game/pc/manifold-garden", "publisher": "William Chyr Studio LLC", "release_date": "Oct 20 2020", "developers": ["William Chyr Studio LLC"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/e2f5df0f286e6c17cb674a3d5a520338-98.jpg", "descriptions": "Manifold Garden is a game that reimagines physics and space. Explore a world of beautiful Escher-esque architecture where the laws of physics are different. Geometry repeats infinitely in every direction and falling down leads you back to where you started. Manipulate gravity to change yourManifold Garden is a game that reimagines physics and space. Explore a world of beautiful Escher-esque architecture where the laws of physics are different. Geometry repeats infinitely in every direction and falling down leads you back to where you started. Manipulate gravity to change your perspective and see the world in new ways. Master the rules of the universe and restore a barren world with vegetation and life. … Expand"}, {"name": "Outer Wilds", "details_link": "https://www.metacritic.com/game/xbox-one/outer-wilds", "publisher": "Annapurna Interactive", "release_date": "May 30 2019", "developers": ["Mobius Digital", "LLC"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/abdf2d2541db22662b9f5240c5d1c253-98.jpg", "descriptions": "An open world mystery about a solar system trapped in an endless time loop. As the newest recruit in the Space Program of Outer Wilds Ventures, a fledgling space program searching for answers in a strange, constantly evolving solar system, you’ll have to discover what lurks in the heart ofAn open world mystery about a solar system trapped in an endless time loop. As the newest recruit in the Space Program of Outer Wilds Ventures, a fledgling space program searching for answers in a strange, constantly evolving solar system, you’ll have to discover what lurks in the heart of the ominous Dark Bramble and to see if the endless time loop can be stopped.… Expand"}, {"name": "Trine 2", "details_link": "https://www.metacritic.com/game/playstation-3/trine-2", "publisher": "Atlus", "release_date": "Dec 20 2011", "developers": ["Frozenbyte", "Inc."], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 3 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/85f0d1b74ffe98cda7e65e522e57e839-98.jpg", "descriptions": "Trine 2 is the sequel to the 2009 downloadable PlayStation 3 and PC action platformer."}, {"name": "inFamous", "details_link": "https://www.metacritic.com/game/playstation-3/infamous", "publisher": "SCEA", "release_date": "May 26 2009", "developers": ["Sucker Punch"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Sci-Fi", "Sci-Fi", "Open-World"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/e3143cb870660e20ba504a976872f5f5-98.jpg", "descriptions": "A massive explosion rips through six square blocks of Empire City, leveling everything and everyone in its path. At the center of the blast crater a lone man stands up miraculously unharmed... gifted with incredible powers. From the creators of the award-winning Sly Cooper series, SuckerA massive explosion rips through six square blocks of Empire City, leveling everything and everyone in its path. At the center of the blast crater a lone man stands up miraculously unharmed... gifted with incredible powers. From the creators of the award-winning Sly Cooper series, Sucker Punch brings you inFAMOUS, the first open-world action/adventure title by SCEA for the PS3. Players experience what happens when a real person suddenly starts developing super powers. Exact revenge? Protect the innocent? Maybe a little of both? These are the situations you'll face as you play inside of a richly interactive and organic living city. A place where your actions create broader reactions in the citizens and landscape around you. inFAMOUS lets you unravel an evolving mystery, experience fame and/or infamy and battle powerful, iconic villains... all the while giving you the feeling of becoming a modern day superhero. [Sony]… Expand"}, {"name": "Desperados III", "details_link": "https://www.metacritic.com/game/xbox-one/desperados-iii", "publisher": "THQ Nordic", "release_date": "Jun 16 2020", "developers": ["Mimimi Productions"], "platforms": ["PC", "PlayStation 4", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/4922a8be01dfa37bc4e6a59b43c3ca6d-98.jpg", "descriptions": "On his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and aOn his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and a mysterious lady from New Orleans. They make their way from the mountains of Colorado to the heart of Louisiana, then finally to New Mexico, right back into Cooper's past.You take control of this ragtag band becoming a highly functional group of unlikely heroes and heroines. The leader of his team is Cooper, drifter and gunslinger, who can kill quietly with a knife or take out multiple foes with his revolvers. Strongman Hector carries a giant beartrap and can slay the toughest opponents with his trusty axe. Cold-blooded bounty hunter McCoy likes to be methodical, using lures, knockout gas, poison syringes and a custom long-range pistol. Kate can fool almost any man with the right outfit and kill discretely with her hidden gun.Combine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real-time to sneak past your enemies while remaining undetected.… Expand"}, {"name": "Final Fantasy X / X-2 HD Remaster", "details_link": "https://www.metacritic.com/game/switch/final-fantasy-x-x-2-hd-remaster", "publisher": "Square Enix", "release_date": "Apr 16 2019", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/82334e6818ce94e25c0e86648e802cdc-98.jpg", "descriptions": "Two of the Most Celebrated RPGs of their Generation - Now in Beautiful High Definition!\r Over 200 hours of gameplay, including the International version content never before released in North America.\r Relive the fateful journey with fully remastered HD visuals and rearranged music."}, {"name": "Papers, Please", "details_link": "https://www.metacritic.com/game/pc/papers-please", "publisher": "3909", "release_date": "Aug  8 2013", "developers": ["Lucas Pope"], "platforms": ["iPhone/iPad", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/d6dd553940db0afd8bead17644d31f02-98.jpg", "descriptions": "The communist state of Arstotzka has just ended a 6-year war with neighboring Kolechia and reclaimed its rightful half of the border town, Grestin. Your job as immigration inspector is to control the flow of people entering the Arstotzkan side of Grestin from Kolechia. Among the throngs ofThe communist state of Arstotzka has just ended a 6-year war with neighboring Kolechia and reclaimed its rightful half of the border town, Grestin. Your job as immigration inspector is to control the flow of people entering the Arstotzkan side of Grestin from Kolechia. Among the throngs of immigrants and visitors looking for work are hidden smugglers, spies, and terrorists. Using only the documents provided by travelers and the Ministry of Admission's primitive inspect, search, and fingerprint systems you must decide who can enter Arstotzka and who will be turned away or arrested.… Expand"}, {"name": "DOOM", "details_link": "https://www.metacritic.com/game/pc/doom", "publisher": "Bethesda Softworks", "release_date": "May 13 2016", "developers": ["id Software"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 12 ", "genres": ["Sci-Fi", "Action", "Shooter", "First-Person", "Third-Person", "Arcade"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/469ace5fefe46bdf030ee19820432c3e-98.jpg", "descriptions": "There is no taking cover or stopping to regenerate health in campaign mode as you beat back Hell’s raging demon hordes. Combine your arsenal of futuristic and iconic guns, upgrades, movement and an advanced melee system to knock-down, slash, stomp, crush, and blow apart demons in creativeThere is no taking cover or stopping to regenerate health in campaign mode as you beat back Hell’s raging demon hordes. Combine your arsenal of futuristic and iconic guns, upgrades, movement and an advanced melee system to knock-down, slash, stomp, crush, and blow apart demons in creative and violent ways. In multiplayer, dominate your opponents in DOOM’s signature, fast-paced arena-style combat. In both classic and all-new game modes, annihilate your enemies utilizing your personal blend of skill, powerful weapons, vertical movement, and unique power-ups that allow you to play as a demon. DOOM SnapMap is an easy-to-use game and level editor that allows for limitless gameplay experiences on every platform. Anyone can snap together and customize maps, add pre-defined or custom gameplay, and edit game logic to create new modes. Instantly play your creation or make it available to players around the world. [ID/Bethesda]… Expand"}, {"name": "DiRT 4", "details_link": "https://www.metacritic.com/game/playstation-4/dirt-4", "publisher": "Codemasters", "release_date": "Jun  6 2017", "developers": ["Codemasters"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/ff9515f23eb403d0024a084f5cbe621a-98.jpg", "descriptions": "Dirt 4 puts you at the wheel of the most powerful machines ever made as you face the toughest roads and circuits on the planet in rally, rallycross, and landrush."}, {"name": "Space Invaders Extreme", "details_link": "https://www.metacritic.com/game/ds/space-invaders-extreme", "publisher": "Square Enix", "release_date": "Jun 17 2008", "developers": ["Taito Corporation"], "platforms": ["PC", "Xbox 360", "DS"], "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Vertical"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/f631bf4eaf27a6bf5f3c4025d404c7c9-98.jpg", "descriptions": "New Look: The classic design of the original SPACE INVADERS, now with revamped graphics and new background movies that add to the game’s excitement. New Music: Get in the groove with up-beat techno tunes that are synched to gameplay. New Mini-Games: Experience varied gameplay with mini-gamesNew Look: The classic design of the original SPACE INVADERS, now with revamped graphics and new background movies that add to the game’s excitement. New Music: Get in the groove with up-beat techno tunes that are synched to gameplay. New Mini-Games: Experience varied gameplay with mini-games (Rounds) that are launched mid-game – they add to the fun, and are a good way to rack up points. New Twists: Discover exciting twists to the classic game that provide swift, fast-paced game play. New Multiplayer Element: Battle against a friend with the all-new multiplayer element, available on both platforms. [Taito]… Expand"}, {"name": "Tiger Woods PGA Tour 12: The Masters", "details_link": "https://www.metacritic.com/game/wii/tiger-woods-pga-tour-12-the-masters", "publisher": "Electronic Arts", "release_date": "Mar 29 2011", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 85, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/35fa5ffadbf39b529bf3e1465535fd12-98.jpg", "descriptions": "For the first time in franchise history, players will be able to step onto the grounds of Augusta National and begin their own journey to capture the most sought-after prize in professional golf - the Green Jacket."}, {"name": "Radiant Historia: Perfect Chronology", "details_link": "https://www.metacritic.com/game/3ds/radiant-historia-perfect-chronology", "publisher": "Atlus", "release_date": "Feb 13 2018", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/55d6aeadf84a7fb506108687ef0e3e03-98.jpg", "descriptions": "In the midst of an unending war for dominance between two super-powers, Special Intelligence Agent Stocke is assigned to a routine escort mission that goes horribly awry."}, {"name": "Star Wars: The Old Republic", "details_link": "https://www.metacritic.com/game/pc/star-wars-the-old-republic", "publisher": "Electronic Arts", "release_date": "Dec 20 2011", "developers": ["LucasArts", "BioWare"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Sci-Fi", "Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi"], "meta_score": 85, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/04b6e74a7b54169011382fb88bb6d5ef-98.jpg", "descriptions": "In Star Wars: The Old Republic, players explore an age thousands of years before the rise of Darth Vader when war between the Old Republic and the Sith Empire divides the galaxy. Players can choose to play as Jedi, Sith, or a variety of other classic Star Wars roles, defining their personalIn Star Wars: The Old Republic, players explore an age thousands of years before the rise of Darth Vader when war between the Old Republic and the Sith Empire divides the galaxy. Players can choose to play as Jedi, Sith, or a variety of other classic Star Wars roles, defining their personal story and determining their path down the light or dark side of the Force. Along the way, players befriend courageous companions who fight at their side or possibly betray them, based on the players’ actions. Players can also choose to team up with friends to battle enemies and overcome incredible challenges using dynamic Star Wars combat. [LucasArts]… Expand"}, {"name": "Skate", "details_link": "https://www.metacritic.com/game/playstation-3/skate", "publisher": "EA Games", "release_date": "Sep 24 2007", "developers": ["EA Black Box"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/a0daffbab57d592d384d13d32e5973ab-98.jpg", "descriptions": "SKATE delivers the feel of skating through innovative controls, authentic cameras and a fully reactive skateboarding city. The game features professional skaters such as Danny Way and PJ Ladd, as well as a reactive city and relevant in-game cameras. SKATE's unique control scheme captures theSKATE delivers the feel of skating through innovative controls, authentic cameras and a fully reactive skateboarding city. The game features professional skaters such as Danny Way and PJ Ladd, as well as a reactive city and relevant in-game cameras. SKATE's unique control scheme captures the true feel of skating versus the typical button mashing gameplay of past skating games. Featuring physics-driven animations, gamers will have a unique gaming experience every time they pick up the controller since no two tricks will ever be the same. [Electronic Arts]… Expand"}, {"name": "Mario + Rabbids: Kingdom Battle", "details_link": "https://www.metacritic.com/game/switch/mario-+-rabbids-kingdom-battle", "publisher": "Ubisoft", "release_date": "Aug 29 2017", "developers": ["Ubisoft", "Ubisoft Paris", "Ubisoft Milan"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/6dbc2eea84890a1acfe8bc934a94fd5e-98.jpg", "descriptions": "Welcome to the story of an unexpected encounter between Mario and the irreverent Rabbids. To bring order back to a splintered Mushroom Kingdom, Mario, Luigi, Princess Peach, and Yoshi team up with Rabbids heroes in a journey through four different worlds. Outwit unpredictable enemies inWelcome to the story of an unexpected encounter between Mario and the irreverent Rabbids. To bring order back to a splintered Mushroom Kingdom, Mario, Luigi, Princess Peach, and Yoshi team up with Rabbids heroes in a journey through four different worlds. Outwit unpredictable enemies in dynamic turn-based combat and co-op challenges, and solve puzzles along the way. Discover a feel-good and modern combat adventure designed exclusively for the Nintendo Switch system, playable anywhere, anytime, with anyone. [Ubisoft]… Expand"}, {"name": "Far Cry 2", "details_link": "https://www.metacritic.com/game/xbox-360/far-cry-2", "publisher": "Ubisoft", "release_date": "Oct 21 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 85, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/bb3d4b14a6283f4a99f6a14032302c18-98.jpg", "descriptions": "Caught between two rival factions in war-torn Africa, you are sent to take out \"The Jackal,\" a mysterious character who has rekindled the conflict between the warlords, jeopardizing thousands of lives. In order to fulfil your mission you will have to play the factions against each other,Caught between two rival factions in war-torn Africa, you are sent to take out \"The Jackal,\" a mysterious character who has rekindled the conflict between the warlords, jeopardizing thousands of lives. In order to fulfil your mission you will have to play the factions against each other, identify and exploit your their weaknesses, and neutralize their superior numbers and firepower with surprise, subversion, cunning and, of course, brute force. Real-time story telling, systemic auto-healing, minimal in-game interface are just few of the features that make you feel the tension of being alone against barbarous warlords that threaten thousands of innocent lives. Choose from a wide range of weapons to make your way to your primary target. Meet the fight head-on with your machine-gun, go berserk with your machete or make stealth kills as a Sniper. If you feel that the atmosphere is not warm enough, light up your flamethrower and let your enemies and everything around them feel the heat. [Ubisoft]… Expand"}, {"name": "Crash Bandicoot 4: It's About Time", "details_link": "https://www.metacritic.com/game/playstation-4/crash-bandicoot-4-its-about-time", "publisher": "Activision", "release_date": "Oct  2 2020", "developers": ["Toys for Bob"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/cdb88a36e4f8e9abf4824dd1475d089c-98.jpg", "descriptions": "The devious villains Neo Cortex and Dr. N. Tropy have finally escaped their interdimensional prison, leaving an evil scientist sized hole in the universe. Now they’ve got their eyes set on not only simply conquering this dimension, but ALL dimensions, and it’s up to Crash and Coco to saveThe devious villains Neo Cortex and Dr. N. Tropy have finally escaped their interdimensional prison, leaving an evil scientist sized hole in the universe. Now they’ve got their eyes set on not only simply conquering this dimension, but ALL dimensions, and it’s up to Crash and Coco to save the day. N. Sanity Beach is where Crash’s adventure first started, and where it begins in Crash 4. But there have definitely been changes since players first saw N. Sanity Beach all those years ago, and throughout Crash 4 you’ll notice changes to gameplay and even the art style. … Expand"}, {"name": "Disgaea 4 Complete+", "details_link": "https://www.metacritic.com/game/switch/disgaea-4-complete+", "publisher": "NIS America", "release_date": "Oct 29 2019", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/972c463146165859413036e4fdfe7cd5-98.jpg", "descriptions": "When the Corrupternment threatens to disrupt the way of life in Hades, Valvatorez finds himself at the helm of a fiery revolution. Dive into a tale of revolution and redemption, woven throughout a dark and hilarious realm of vampires, werewolves, and other devilish denizens. Engage inWhen the Corrupternment threatens to disrupt the way of life in Hades, Valvatorez finds himself at the helm of a fiery revolution. Dive into a tale of revolution and redemption, woven throughout a dark and hilarious realm of vampires, werewolves, and other devilish denizens. Engage in immersive and in-depth tactics-based gameplay brimming with over-the-top destructive action, and unload a horde of special features to take your Netherworldly adventures to another level. … Expand"}, {"name": "428: Shibuya Scramble", "details_link": "https://www.metacritic.com/game/playstation-4/428-shibuya-scramble", "publisher": "Spike Chunsoft", "release_date": "Sep  4 2018", "developers": ["Spike Chunsoft"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Visual Novel"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/ffb994d4e34ae3b0c87d918563e177c9-98.jpg", "descriptions": "A kidnapping in Shibuya brings together a detective, a journalist, a former gang leader, a big pharma researcher, and a part-timer stuck in a cat costume for a series of unexpected events. Can they–or the city itself–make it through the day?"}, {"name": "Enter The Gungeon", "details_link": "https://www.metacritic.com/game/xbox-one/enter-the-gungeon", "publisher": "Devolver Digital", "release_date": "Apr  5 2017", "developers": ["Dodge Roll"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/03149a0b7be9f44e9c3a6cfae805c623-98.jpg", "descriptions": "Enter the Gungeon is a gunfight dungeon crawler following a band of misfits seeking to shoot, loot, dodge roll and table-flip their way to personal absolution by reaching the legendary Gungeon’s ultimate treasure: the gun that can kill the past."}, {"name": "Gone Home: Console Edition", "details_link": "https://www.metacritic.com/game/playstation-4/gone-home-console-edition", "publisher": "The Fullbright Company", "release_date": "Jan 12 2016", "developers": ["The Fullbright Company", "Midnight City"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 85, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/6/213a3e94b2d4e4abfffdd98453b0a401-98.jpg", "descriptions": "The eldest daughter of the Greenbriar family returns after a year abroad. She expects her parents and sister to greet her. Instead she finds only a deserted house, filled with secrets. Where is everyone? And what's happened here? Find out for yourself in Gone Home, a first-person gameThe eldest daughter of the Greenbriar family returns after a year abroad. She expects her parents and sister to greet her. Instead she finds only a deserted house, filled with secrets. Where is everyone? And what's happened here? Find out for yourself in Gone Home, a first-person game entirely about exploration, mystery and discovery. The house is yours to explore as you see fit. Open any drawer or door to investigate what's inside. Piece together the mysteries from notes and clues woven into the house itself. Discover the story of a year in the life of the Greenbriar family. Dig deeper. Go home again.… Expand"}, {"name": "Ratchet & Clank: Size Matters", "details_link": "https://www.metacritic.com/game/psp/ratchet-clank-size-matters", "publisher": "SCEA", "release_date": "Feb 13 2007", "developers": ["High Impact Games"], "platforms": ["PlayStation 2", "PSP"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Platformer", "Shooter", "Third-Person", "3D", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/e627de0f9d06b3796b02d7cd8dd51b35-98.jpg", "descriptions": "While on a much needed vacation, Ratchet and Clank's rest and relaxation time is suddenly cut short as they soon find themselves lured into a mysterious quest. Following the trail of a kidnapped girl, Ratchet and Clank rediscover a forgotten race of genius inventors known as the Technomites.While on a much needed vacation, Ratchet and Clank's rest and relaxation time is suddenly cut short as they soon find themselves lured into a mysterious quest. Following the trail of a kidnapped girl, Ratchet and Clank rediscover a forgotten race of genius inventors known as the Technomites. They soon uncover a plot more dangerous than they could have imagined. Featuring new and returning weapons and gadgets, including the Shocker, Agents of Doom and Shrink Ray, Ratchet & Clank: Size Matters packs all of the combat and destruction fans have come to expect from the series. Players can utilize the all-new customizable armor system themed for various gameplay to gain upgrades and advance through challenging action-packed areas.  Gain access to different vehicles to compete in races and combat enemies in intense battlefield missions. With wireless multiplayer gaming, up to four players can connect for intense combat and head-to-head action. [SCEA]… Expand"}, {"name": "FIFA 07 Soccer", "details_link": "https://www.metacritic.com/game/xbox/fifa-07-soccer", "publisher": "EA Sports", "release_date": "Oct  3 2006", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/193c5898ab1c8b35d69de60df52a2923-98.jpg", "descriptions": "FIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new onlineFIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new online mode that enables you to pit your club against supporters of your real-world opponents. The online interactive leagues feature the F.A. Premier League, Bundesliga, French League and the Mexican 1st Division. Experience the future of online gaming as you play your games according to the real-world schedule. When they play, you play. Track your team's progress as the aggregate results determine your club's position in the league table. This year, new intelligent A.I. ensures that your 11 men on the pitch make realistic decisions, finding space and passing like professionals. A complete overhaul of the game engine now means that you have to employ real world tactics, make split-second decisions and think like a player in order to win matches. Watch as your players jostle and collide realistically while trying to win balls. Experience the realism of the world's superstars, who come to life with signature moves and authentic playing styles and a more sophisticated shooting mechanic that gives you greater control to produce finesse shots. Plus you now have the ability to apply topspin or backspin to the ball for more creative set-pieces.… Expand"}, {"name": "Fight Night 2004", "details_link": "https://www.metacritic.com/game/playstation-2/fight-night-2004", "publisher": "EA Sports", "release_date": "Apr  5 2004", "developers": ["EA Sports"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/32103f01bb90e6bd07b40841f400a762-98.jpg", "descriptions": "Built from the ground up to deliver all the drama and pageantry of a heavyweight title bout, EA SPORTS FIGHT NIGHT 2004 is the most authentic boxing experience to date, sporting a dramatic new-school attitude, a dynamic new cinematic approach, and revolutionary boxing gameplay. With TotalBuilt from the ground up to deliver all the drama and pageantry of a heavyweight title bout, EA SPORTS FIGHT NIGHT 2004 is the most authentic boxing experience to date, sporting a dramatic new-school attitude, a dynamic new cinematic approach, and revolutionary boxing gameplay. With Total Punch Control, EA SPORTS FIGHT NIGHT 2004 allows gamers to pummel their opponents with surgical precision, controlling both punch location and power to bring the hurt with style and strategy. Plus, an all-new defensive system gives players full body control as they make a run at the title. All-New Total Punch Control: Hammer the competition with this innovative new feature -- the right analog stick becomes an intuitive extension of your fists, giving you total control of every punch. Stick and Move: Use the analog sticks to bob and weave, block punches, and frustrate opponents by shutting down and countering their attacks. Be the Ultimate Fighting Machine: Create a fighter who looks exactly like you in Career Mode, and work your way from amateur to title contender to undisputed champion. Customize Your Ring Entrance: Psych out your opponent, show your personality, and win over the crowd with your hand-chosen music, special effects and entourage. Knock 'em Out Online: Step into the online ring and go toe-to-toe against other top fighters to see how you stack up against the nation's best. [EA Sports]… Expand"}, {"name": "Anarchy Online: Shadowlands", "details_link": "https://www.metacritic.com/game/pc/anarchy-online-shadowlands", "publisher": "Funcom", "release_date": "Sep  8 2003", "developers": ["Funcom"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/6892a25d939c3942cfc69cfa0aaa791a-98.jpg", "descriptions": "Shadowlands is the first expansion pack for the award-winning massively multiplayer online game Anarchy Online. Shadowlands introduces an impressive range of features; new and exciting playfields, professions, monsters and game-play improvements. Shadowlands is a dark, mystical realm whereShadowlands is the first expansion pack for the award-winning massively multiplayer online game Anarchy Online. Shadowlands introduces an impressive range of features; new and exciting playfields, professions, monsters and game-play improvements. Shadowlands is a dark, mystical realm where the laws of physics are changed, and everything you ever believed in, breaks and inverts. Underneath lies the remnants of an ancient civilisation, so advanced, so magnificent it challenges the myth of human authenticity. Ancient horrors and spiritual encounters unfold inside the dark and eerie dimension, and the epic struggle for control of Rubi-Ka evolves towards its zenith, inducing an experience truly unique to the MMORPG genre. [Funcom]… Expand"}, {"name": "Dark Age of Camelot: Shrouded Isles", "details_link": "https://www.metacritic.com/game/pc/dark-age-of-camelot-shrouded-isles", "publisher": "Mythic Entertainment", "release_date": "Dec  2 2002", "developers": ["Mythic Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/b4c0fdf7bd72754a1f610838602499de-98.jpg", "descriptions": "The first expansion pack available for Dark Age of Camelot players. It extends the story of the original game with new character classes, new races, and three new continents to explore - displayed in an all-new state-of-the-art graphics engine that make it look as advanced as any game on theThe first expansion pack available for Dark Age of Camelot players. It extends the story of the original game with new character classes, new races, and three new continents to explore - displayed in an all-new state-of-the-art graphics engine that make it look as advanced as any game on the market. [Mythic Entertainment]… Expand"}, {"name": "NASCAR: Dirt to Daytona", "details_link": "https://www.metacritic.com/game/gamecube/nascar-dirt-to-daytona", "publisher": "Atari", "release_date": "Nov 27 2002", "developers": ["Monster Games Inc."], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/30e22d81bbef19c61c442d6441e814b3-98.jpg", "descriptions": "Can you survive in the world of NASCAR?  NASCAR Dirt to Daytona challenges you to become the ultimate racer in four different NASCAR racing series.  Racing to win is the key for drivers hoping to advance from small town dirt tracks to modified cars, trucks, and eventually the highly prizedCan you survive in the world of NASCAR?  NASCAR Dirt to Daytona challenges you to become the ultimate racer in four different NASCAR racing series.  Racing to win is the key for drivers hoping to advance from small town dirt tracks to modified cars, trucks, and eventually the highly prized NASCAR Winston Cup cars.  Learn the harsh realities of the racing world where losing can cost drivers not only points in the standings but loss of money from a sponsor.  NASCAR Dirt to Daytona also features Single Races, Season Championships, Beat the Heat, and Pro Trainer modes rounding out a complete racing experience.… Expand"}, {"name": "Dave Mirra Freestyle BMX 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/dave-mirra-freestyle-bmx-2", "publisher": "Acclaim", "release_date": "Nov 25 2001", "developers": ["Full-Fat"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/73998ca3b5b64f6447cdccc2794ad460-98.jpg", "descriptions": "10-Time World Champion Dave Mirra is back. Grab big air, jump huge gaps and pull some of the SICKEST tricks imaginable as you embark on a ProQuest to become the top rider around -- even better than the Miracle Boy himself. The only thing holding you back is a little gravity."}, {"name": "NFL Blitz 2000", "details_link": "https://www.metacritic.com/game/nintendo-64/nfl-blitz-2000", "publisher": "Midway", "release_date": "Jul 31 1999", "developers": ["Midway"], "platforms": ["PC", "Nintendo 64"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/3544922c0828dc1afd22ff609a5c22fd-98.jpg", "descriptions": "It's back and it's better than ever! NFL Blitz 2000 adds 4-player support, new offensive and defensive plays, realistic weather conditions, new stadiums and a Tournament mode! Customize offensive and defensive plays to your liking. Call audibles at the line of scrimmage. You've got controlIt's back and it's better than ever! NFL Blitz 2000 adds 4-player support, new offensive and defensive plays, realistic weather conditions, new stadiums and a Tournament mode! Customize offensive and defensive plays to your liking. Call audibles at the line of scrimmage. You've got control now! Passing made easy with new \"Blitz Passing\" for one-touch long bombs! \"ON-FIRE\" mode gives super power performance to your players! With non-stop action and a \"pick-it-up-and-play\" learning curve, NFL BLITZ 2000 is THE game for every football fan!… Expand"}, {"name": "Obsidian", "details_link": "https://www.metacritic.com/game/pc/obsidian", "publisher": "SegaSoft", "release_date": "Jan 10 1997", "developers": ["Rocket Science Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 85, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/c261a7fa9851f29be127135d0b8d8a45-98.jpg", "descriptions": "You, as biochemical engineer Lilah Kerlin, and your partner Max Powers, an environmental engineer, have created the Ceres Project -- an orbiting satellite that releases nanobots into the atmosphere designed to restore the ozone layer and eliminate atmospheric pollution, which has reached aYou, as biochemical engineer Lilah Kerlin, and your partner Max Powers, an environmental engineer, have created the Ceres Project -- an orbiting satellite that releases nanobots into the atmosphere designed to restore the ozone layer and eliminate atmospheric pollution, which has reached a crisis point in the year 2066. After successfully engineering and launching Ceres, the project is left to operate under its own control. With the job complete Lilah and Max decide to go on a long overdue vacation. However, while vacationing they discover a strange black, crystalline growth that is becoming larger every day ? and somehow it seems to be eerily linked to the Ceres Project. [AdventureGamers.com]… Expand"}, {"name": "Battlefield: Bad Company", "details_link": "https://www.metacritic.com/game/playstation-3/battlefield-bad-company", "publisher": "EA Games", "release_date": "Jun 23 2008", "developers": ["EA DICE"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 24 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/5d9ef1c9a8fc47d9f2cf632547cf1bba-98.jpg", "descriptions": "Built from the ground-up for next-generation consoles using Digital Illusions' Frostbite game engine, Battlefield: Bad Company drops gamers behind enemy lines with a squad of renegade soldiers who risk it all on a personal quest for gold and revenge. Featuring a deep, cinematic single-playerBuilt from the ground-up for next-generation consoles using Digital Illusions' Frostbite game engine, Battlefield: Bad Company drops gamers behind enemy lines with a squad of renegade soldiers who risk it all on a personal quest for gold and revenge. Featuring a deep, cinematic single-player experience loaded with adventure and dark humor, the game delivers the series' trademark sandbox gameplay in a universe where nearly everything is destructible. Battlefield: Bad Company also features a full suite of the franchise's trademark multiplayer options with deep gameplay modes designed to take full advantage of the game's massively destructible environments.  [Electronic Arts]… Expand"}, {"name": "Mario Golf: Advance Tour", "details_link": "https://www.metacritic.com/game/game-boy-advance/mario-golf-advance-tour", "publisher": "Nintendo", "release_date": "Jun 22 2004", "developers": ["Camelot Software Planning"], "platforms": "Game Boy Advance", "num_players": "1-5 ", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/277357d9343caf51eebab4fc27c27a8e-98.jpg", "descriptions": "In Mario Golf Advance Tour, you can experience all the fun of golf with your favorite characters from the Mushroom Kingdom. Now you can hit fantastic courses in a variety of locales, while learning tips and tricks and interacting with locals at the clubhouse. Compete in singles and doublesIn Mario Golf Advance Tour, you can experience all the fun of golf with your favorite characters from the Mushroom Kingdom. Now you can hit fantastic courses in a variety of locales, while learning tips and tricks and interacting with locals at the clubhouse. Compete in singles and doubles tournaments against the pros, practice your swing at the golf clinics, and master side games. Hit all 18 holes with Mario, Peach, Donkey Kong, and more.… Expand"}, {"name": "Call of Duty: World at War", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-world-at-war", "publisher": "Activision", "release_date": "Nov 10 2008", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/d3e3788d7448f3f0ad0c0de6d6176da8-98.jpg", "descriptions": "Utilizing the Call of Duty 4: Modern Warfare engine, Call of Duty: World at War throws out the rulebook of war to transform WWII combat through a new enemy, new tactics and an uncensored experience of the climatic battles that gripped a generation. As U.S. Marines and Russian soldiers,Utilizing the Call of Duty 4: Modern Warfare engine, Call of Duty: World at War throws out the rulebook of war to transform WWII combat through a new enemy, new tactics and an uncensored experience of the climatic battles that gripped a generation. As U.S. Marines and Russian soldiers, players employ new features like cooperative gameplay, and weapons such as the flamethrower in the most chaotic and cinematically intense experience to date. Call of Duty: World at War introduces co-operative play, bringing fresh meaning to the \"No One Fights Alone\" mantra with up to four-players online for Xbox 360, PS3 and PC, or two-player local split-screen on consoles. Nintendo Wii will also support a unique co-op mode for two players. For the first time ever players can experience harrowing single-player missions together for greater camaraderie and tactical execution.  The co-op campaign allows players to rank up and unlock perks in competitive multiplayer by completing challenges and earning experience points, adding continuous re-playability and team-based gameplay. Whether playing competitively or cooperatively – if players are online with Call of Duty: World at War – they always gain experience points. Based on a player’s experience rank and rank of the player's friends, Call of Duty: World at War scales dynamically to provide a deeper level of challenge. [Activision]… Expand"}, {"name": "The Forgotten City", "details_link": "https://www.metacritic.com/game/pc/the-forgotten-city", "publisher": "Modern Storyteller", "release_date": "Jul 28 2021", "developers": ["Modern Storyteller"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/d9c119e0b4b01da45238a50f98d5af8a-98.jpg", "descriptions": "The Forgotten City is a mystery adventure game of exploration and deduction. Travel 2,000 years into the past and relive the final days of a cursed Roman city, where if one person sins, everyone dies.  Combat is an option, but violence will only get you so far. Only by questioning anThe Forgotten City is a mystery adventure game of exploration and deduction. Travel 2,000 years into the past and relive the final days of a cursed Roman city, where if one person sins, everyone dies.  Combat is an option, but violence will only get you so far. Only by questioning an intertwined community of colourful characters, cleverly exploiting the time loop, and making difficult moral choices can you hope to solve this epic mystery. Here, your decisions matter. The fate of the city is in your hands.\r… Expand"}, {"name": "DiRT Rally 2.0", "details_link": "https://www.metacritic.com/game/pc/dirt-rally-20", "publisher": "Codemasters", "release_date": "Feb 26 2019", "developers": ["Codemasters"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 84, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/71308cbcee9f9176abdcf7b8460259e9-98.jpg", "descriptions": "DiRT Rally 2.0 dares you to carve your way through a selection of iconic rally locations from across the globe, in the most powerful off-road vehicles ever made, knowing that the smallest mistake could end your stage. You will need to rely on your instincts with the most immersive and trulyDiRT Rally 2.0 dares you to carve your way through a selection of iconic rally locations from across the globe, in the most powerful off-road vehicles ever made, knowing that the smallest mistake could end your stage. You will need to rely on your instincts with the most immersive and truly focused off-road experience yet, including a new authentic handling model, tyre choice and surface deformation.\r Power your rally car through real-life off-road environments in New Zealand, Argentina, Spain, Poland, Australia and the USA, with only your co-driver and instincts to guide you. Race on eight official circuits from the FIA World Rallycross championship, complete with licensed Supercars and support series. Develop your team and cars around race strategies, and progress through a varied selection of Events and Championships in both a single player Career Campaign and a competitive online environment.… Expand"}, {"name": "Warhammer 40,000: Dawn of War II - Chaos Rising", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-dawn-of-war-ii---chaos-rising", "publisher": "THQ", "release_date": "Mar 10 2010", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/f23cfb8f15325f1dfa03ab4eabb5a34f-98.jpg", "descriptions": "Set in the grim, war-ravaged world of Games Workshop’s vast Warhammer 40,000 science fiction universe, Warhammer 40,000: Dawn of War II – Chaos Rising transports players into the midst of an intergalactic war between ancient enemies.  Warhammer 40,000: Dawn of War II – Chaos RisingSet in the grim, war-ravaged world of Games Workshop’s vast Warhammer 40,000 science fiction universe, Warhammer 40,000: Dawn of War II – Chaos Rising transports players into the midst of an intergalactic war between ancient enemies.  Warhammer 40,000: Dawn of War II – Chaos Rising introduces the Chaos Space Marines as a new playable army, continues the single player campaign from the original Dawn of War II, delivers all new wargear and raises the level cap from 20 to 30.  Relic Entertainment will also deliver new multiplayer maps and new units for the Orks, Eldar, Tyranids and Space Marines.  Veterans of the Dawn of War II single player campaign can use their existing squads’ accumulated wargear, abilities and experience to battle the traitorous Chaos Space Marines of the Black Legion throughout 20 new missions.  Newcomers to Dawn of War II will begin the single player campaign with a squad of Space Marines fully equipped to take on the malevolent forces of Chaos.  Powerful Chaos tainted wargear can be equipped and used against your enemy, but doing so could lead to dreadful consequences.  Will you risk corruption for power? [THQ]… Expand"}, {"name": "The Walking Dead: Episode 2 - Starved for Help", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-episode-2---starved-for-help", "publisher": "Telltale Games", "release_date": "Jun 29 2012", "developers": ["Telltale Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/b16686f4f85035168fc7cc8c4f9cc8b1-98.jpg", "descriptions": "Episode two of a five-part game series set in the same universe as Robert Kirkmans award-winning series. With starvation and bandit attacks becoming as much of a threat as the undead, the group finds themselves seeking help and food from strangers at a local dairy. \r\r- Feel what its likeEpisode two of a five-part game series set in the same universe as Robert Kirkmans award-winning series. With starvation and bandit attacks becoming as much of a threat as the undead, the group finds themselves seeking help and food from strangers at a local dairy. \r\r- Feel what its like to be a survivor, where choosing between necessities and whats right is a delicate matter.\r- Encounter human survivors who have gone down a truly horrific path.\r- Begin to see the pressures of Lillys responsibilities and get a glimpse of her tortured past as she starts to unravel as a leader.\r- Develop an understanding of what youre willing to resort to in order to ensure survival.\r- Live with the choices you made in Episode One as they continue to affect your experience in this episode.… Expand"}, {"name": "Saints Row: The Third", "details_link": "https://www.metacritic.com/game/pc/saints-row-the-third", "publisher": "THQ", "release_date": "Nov 14 2011", "developers": ["Volition Inc."], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/a0756d53dbaf33e713d683eb4de74df0-98.jpg", "descriptions": "Years after taking Stilwater for their own, the Third Street Saints have evolved from street gang to household brand name, with Saints sneakers, Saints energy drinks and Johnny Gat bobble head dolls all available at a store near you. The Saints are kings of Stilwater, but their celebrityYears after taking Stilwater for their own, the Third Street Saints have evolved from street gang to household brand name, with Saints sneakers, Saints energy drinks and Johnny Gat bobble head dolls all available at a store near you. The Saints are kings of Stilwater, but their celebrity status has not gone unnoticed. The Syndicate, a legendary criminal fraternity with pawns in play all over the globe, has turned its eye on the Saints and demands tribute. Refusing to kneel to the Syndicate, you take the fight to a new city, playing out the most outlandish gameplay scenarios ever seen. Strap it on. … Expand"}, {"name": "Bomberman Live", "details_link": "https://www.metacritic.com/game/xbox-360/bomberman-live", "publisher": "Hudson Entertainment", "release_date": "Jul 18 2007", "developers": ["Backbone Entertainment"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Miscellaneous", "Puzzle", "Action", "General", "Puzzle", "Action"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/1c5385f03b4751fc1985239903c22f12-98.jpg", "descriptions": "[Xbox Live Arcade]  Drop bombs with reckless abandon and blast your enemies into oblivion. Compete with up to eight players online as you battle through eight exotic arenas with your own customized Bomberman. Unleash your fury in ongoing tournaments to prove you're the best. Choose from any[Xbox Live Arcade]  Drop bombs with reckless abandon and blast your enemies into oblivion. Compete with up to eight players online as you battle through eight exotic arenas with your own customized Bomberman. Unleash your fury in ongoing tournaments to prove you're the best. Choose from any of eight all new arenas and start dropping your bombs, kick fiery surprises across the arena, and send your enemies to their doom. Ongoing tournaments will allow you to compete globally to determine who's the best Bomberman of all. Each Bomberman can have a custom head or hat, facial expressions and features, and a costume. There are over 10,000 custom possibilities, so you may never see another Bomberman exactly like yours. One of the greatest game series of all time comes to Xbox LIVE Arcade. Take control of your customized Bomberman and use your bombs to knock out your opponents, discover upgrades, and dominate the arena. [Microsoft]… Expand"}, {"name": "Ni no Kuni II: Revenant Kingdom", "details_link": "https://www.metacritic.com/game/playstation-4/ni-no-kuni-ii-revenant-kingdom", "publisher": "Level 5", "release_date": "Mar 23 2018", "developers": ["Level 5"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Japanese-Style"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/04009de7358a39e2a729ecf22c21b7a4-98.jpg", "descriptions": "Re-enter the animated world of Ni no Kuni in the sequel to the role-playing game developed by LEVEL-5. Explore the world and experience the story in an all-new RPG adventure. LEVEL-5 reunites with Yoshiyuki Momose on character design and Music created by Joe Hisaishi in the production of theRe-enter the animated world of Ni no Kuni in the sequel to the role-playing game developed by LEVEL-5. Explore the world and experience the story in an all-new RPG adventure. LEVEL-5 reunites with Yoshiyuki Momose on character design and Music created by Joe Hisaishi in the production of the next Ni no Kuni tale.… Expand"}, {"name": "Project CARS 2", "details_link": "https://www.metacritic.com/game/xbox-one/project-cars-2", "publisher": "Bandai Namco Games", "release_date": "Sep 22 2017", "developers": ["Bandai Namco Games", "Slightly Mad Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 84, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/209db3fc5a6232cbf56c7b22c77f2e70-98.jpg", "descriptions": "Project CARS 2 is the next evolution in the award-winning racing series, featuring the most iconic cars racing under the most thrilling conditions to deliver the Ultimate Driver Journey.\r Created by gamers, tested by world-class racing drivers from Team SMS-R, and the definitive choice ofProject CARS 2 is the next evolution in the award-winning racing series, featuring the most iconic cars racing under the most thrilling conditions to deliver the Ultimate Driver Journey.\r Created by gamers, tested by world-class racing drivers from Team SMS-R, and the definitive choice of Esports pros... Project CARS 2 captures the essence of real racing in the most beautiful, intense, authentic, and technically-advanced racing game on the planet.\r FEATURES:\r * Over 170 licensed cars from the most iconic brands.\r* The largest track roster of any console racing game including ice and dirt tracks.\r* New vehicle types and motorsport classes including Rallycross, IndyCar, and Oval.\r* Dynamic time of day, weather, and new seasonal conditions.\r* New Online Championships mode.\r* LiveTrack 3.0 powers dynamic surface conditions that affect vehicle performance and handling, and evolves the track over the course of a race weekend.\r* Esports built-in from day one with full ranking, and broadcasting / streaming functionality.\r* Bleeding-edge tire physics, advanced AI, and intuitive gamepad control.… Expand"}, {"name": "Statik", "details_link": "https://www.metacritic.com/game/playstation-4/statik", "publisher": "Tarsier Studios", "release_date": "Apr 24 2017", "developers": ["Tarsier Studios"], "platforms": "PlayStation 4", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/0901cb6a32163edd6cac8e2f076ddfff-98.jpg", "descriptions": "Statik is a VR game focused on solving puzzles in a place you're not familiar with, with a person you don’t recognize, and hands that aren’t completely yours."}, {"name": "Fallout: New Vegas", "details_link": "https://www.metacritic.com/game/pc/fallout-new-vegas", "publisher": "Bethesda Softworks", "release_date": "Oct 19 2010", "developers": ["Obsidian Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "First-Person", "First-Person", "Western-Style"], "meta_score": 84, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/0/529b1f0d432ab4fdefe5d99cfe3583d9-98.jpg", "descriptions": "The latest game in the post-nuclear RPG series is being developed by many members of the Fallout 1 and 2  team at Obsidian Entertainment using the Fallout 3 engine."}, {"name": "Keep Talking and Nobody Explodes", "details_link": "https://www.metacritic.com/game/switch/keep-talking-and-nobody-explodes", "publisher": "Steel Crate Games", "release_date": "Aug 16 2018", "developers": ["Steel Crate Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/0539a132763d8484a7adc46b96870b8d-98.jpg", "descriptions": "In Keep Talking and Nobody Explodes, one player is trapped in a room with a ticking time bomb they must defuse. The other players are the “Experts” who must give the instructions to defuse the bomb by deciphering the information found in the Bomb Defusal Manual. But there’s a catch: theIn Keep Talking and Nobody Explodes, one player is trapped in a room with a ticking time bomb they must defuse. The other players are the “Experts” who must give the instructions to defuse the bomb by deciphering the information found in the Bomb Defusal Manual. But there’s a catch: the Experts can’t see the bomb, so everyone will need to talk it out – fast. Rounds are fast-paced, tense, occasionally silly, and almost always loud. Puzzle solving and communication skills – and maybe a few friendships – will be put to the test as players race to defuse bombs while communicating quickly, clearly, and effectively. … Expand"}, {"name": "Shantae: Half-Genie Hero - Ultimate Edition", "details_link": "https://www.metacritic.com/game/switch/shantae-half-genie-hero---ultimate-edition", "publisher": "XSEED Games", "release_date": "May  8 2018", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/cfa1edd073f2410ecb32e792dec2b483-98.jpg", "descriptions": "Iconic genie Shantae is back in her most thrilling adventure yet! The award-winning 2D platforming series levels-up to stunning new heights thanks to an eye-popping new graphical style, an infectious soundtrack and incredible new game features. Transform into different creatures, danceIconic genie Shantae is back in her most thrilling adventure yet! The award-winning 2D platforming series levels-up to stunning new heights thanks to an eye-popping new graphical style, an infectious soundtrack and incredible new game features. Transform into different creatures, dance through dynamic, danger-filled stages, complete quests for friends and face-off against awesome screen-filling bosses in an action-packed thrill ride without equal.\r FEATURES:\r * The complete package! -- This Ultimate Edition contains the award-winning Shantae: Half-Genie Hero, plus three major expansions - Pirate Queen's Quest DLC, Friends To The End DLC and Costume Mode DLC -- all in one bumper package!\r * Day One Edition bonuses! -- Also includes the essential Shantae: Half-Genie Hero artbook, and the toe-tapping, 30-song Risky Beats soundtrack CD!\r * Incredible visuals! -- Eschewing the series' former pixel art look, 2D characters and 3D worlds combine seamlessly in Shantae: Half-Genie Hero for the most beautiful platformer yet.\r * Peerless adventuring! -- Revisit stages with new transformation abilities and morph into a wacky range of creatures (elephants! crabs! mice!) to uncover deeply hidden secrets and unexplored areas.\r * Play as the full gang! -- Shantae's got company! Take control of popular co-stars Sky, Bolo, Rottytops and even series antagonist Risky Boots herself, and use each character's unique skills to journey through new storylines and scenarios long after Shantae's quest is over!… Expand"}, {"name": "Valkyria Chronicles Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/valkyria-chronicles-remastered", "publisher": "Sega", "release_date": "May 17 2016", "developers": ["Sega"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/d9d409d1db4937ed01818fdd76cb178e-98.jpg", "descriptions": "The Principality of Gallia, a small neutral country between two superpower nations, suddenly faces invasion at the hands of the Empire. In the face of an overwhelming military power, the Gallian army has lost all hope. However, a ragtag volunteer militia has risen up against all odds toThe Principality of Gallia, a small neutral country between two superpower nations, suddenly faces invasion at the hands of the Empire. In the face of an overwhelming military power, the Gallian army has lost all hope. However, a ragtag volunteer militia has risen up against all odds to fight off the invading Imperial Army! Through various situations born of the extreme nature of war, this large-scale strategy RPG depicts themes such as living life to the fullest and the importance of human relationships. [Sega]… Expand"}, {"name": "Crash Team Racing: Nitro-Fueled", "details_link": "https://www.metacritic.com/game/xbox-one/crash-team-racing-nitro-fueled", "publisher": "Activision", "release_date": "Jun 21 2019", "developers": ["Beenox"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 84, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/2471d11be82219ce097d060cc1a97f46-98.jpg", "descriptions": "Start your engines with the original game modes, characters, tracks, power-ups, weapons and controls. Power slide to glory in additional karts and tracks from beyond the original game. Race online with friends and Crash the competition with online leader boards."}, {"name": "F1 2018", "details_link": "https://www.metacritic.com/game/playstation-4/f1-2018", "publisher": "Codemasters", "release_date": "Aug 24 2018", "developers": ["Codemasters"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/c77eed81a442ab909601d412a74223e7-98.jpg", "descriptions": "The 2018 season sees the return of the French Grand Prix for the first time since 2008, at the Circuit Paul Ricard, which last hosted the French Grand Prix in 1990. The German Grand Prix also returns to the Championship after not featuring last year, with the Hockenheimring hosting the raceThe 2018 season sees the return of the French Grand Prix for the first time since 2008, at the Circuit Paul Ricard, which last hosted the French Grand Prix in 1990. The German Grand Prix also returns to the Championship after not featuring last year, with the Hockenheimring hosting the race in July. F1 2018 features all of the official teams, the drivers and circuits of the 2018 season. [Codemasters]… Expand"}, {"name": "Assassin's Creed Valhalla", "details_link": "https://www.metacritic.com/game/playstation-5/assassins-creed-valhalla", "publisher": "Ubisoft", "release_date": "Nov 12 2020", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/c583cf0ba8e80f79804ec54352de5886-98.jpg", "descriptions": "Build your own Viking Legend. Become Eivor, a Viking raider raised to be a fearless warrior, and lead your clan from icy desolation in Norway to a new home amid the lush farmlands of ninth-century England. Find your settlement and conquer this hostile land by any means to earn a place inBuild your own Viking Legend. Become Eivor, a Viking raider raised to be a fearless warrior, and lead your clan from icy desolation in Norway to a new home amid the lush farmlands of ninth-century England. Find your settlement and conquer this hostile land by any means to earn a place in Valhalla. England in the age of the Vikings is a fractured nation of petty lords and warring kingdoms. Beneath the chaos lies a rich and untamed land waiting for a new conqueror. Will it be you? Write Your Viking Saga. Blaze your own path across England with advanced RPG mechanics. Fight brutal battles, lead fiery raids or use strategy and alliances with other leaders to bring victory. Every choice you make in combat and conversation is another step on the path to greatness. Lead Epic Raids. Lead a crew of raiders and launch lightning-fast surprise attacks against Saxon armies and fortresses. Claim the riches of your enemies' lands for your clan and expand your influence far beyond your growing settlement. ENGAGE IN VISCERAL COMBAT. Unleash the ruthless fighting style of a Viking warrior as you dual-wield axes, swords, or even shields against relentless foes. Decapitate opponents in close-quarters combat, riddle them with arrows, or assassinate them with your Hidden Blade. Grow Your Settlement. Your clan's new home grows with your legend. Customise your settlement by building upgradable structures. Unlock new features and quests by constructing a barracks, a blacksmith, a tattoo parlour, and much more. Share Your Custom Raider. Recruit mercenary Vikings designed by other players or create and customise your own to share online. Sit back and reap the rewards when they fight alongside your friends in their game worlds. A Dark Age Open World. Sail across the icy North Sea to discover and conquer the broken kingdoms of England. Immerse yourself in activities like hunting and drinking games or engage in traditional Norse competitions like flyting – or, as it's better known, verbally devastating rivals through the art of the Viking rap battle. [Ubisoft]… Expand"}, {"name": "Kentucky Route Zero: TV Edition", "details_link": "https://www.metacritic.com/game/xbox-one/kentucky-route-zero-tv-edition", "publisher": "Annapurna Interactive", "release_date": "Jan 28 2020", "developers": ["Cardboard Computer"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 84, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/6af7ce78618dba784269787232b74e1c-98.jpg", "descriptions": "KENTUCKY ROUTE ZERO is a magical realist adventure game about a secret highway running through the caves beneath Kentucky, and the mysterious folks who travel it. At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easyKENTUCKY ROUTE ZERO is a magical realist adventure game about a secret highway running through the caves beneath Kentucky, and the mysterious folks who travel it. At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easy to get lost. Those who are already lost may find their way to a secret highway winding through underground caves. The people who live and work along this highway are themselves a little strange at first, but soon seem familiar: the aging driver making the last delivery for a doomed antique shop; the young woman who fixes obsolete TVs surrounded by ghosts; the child and his giant eagle companion; the robot musicians; the invisible power company lurking everywhere, and the threadbare communities who struggle against its grip.… Expand"}, {"name": "Peggle: Dual Shot", "details_link": "https://www.metacritic.com/game/ds/peggle-dual-shot", "publisher": "PopCap", "release_date": "Feb 27 2009", "developers": ["Q Entertainment"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/4e2ffe8e6fd791231c60a4a876c61384-98.jpg", "descriptions": "Shoot and clear the orange pegs from 120 levels spanning two full Adventure modes including 10 all-new levels in the exclusive Bonus Underground. Wield 11 Magic Powers, score amazing style shots, and collect valuable gems and power-ups in the Bonus Underground. And the action doesn’t stopShoot and clear the orange pegs from 120 levels spanning two full Adventure modes including 10 all-new levels in the exclusive Bonus Underground. Wield 11 Magic Powers, score amazing style shots, and collect valuable gems and power-ups in the Bonus Underground. And the action doesn’t stop there - take your best shot in Multiplayer Duel and Quick Play modes, then put your skills to the ultimate test with 90 challenges. [PopCap Games]… Expand"}, {"name": "Disgaea: Hour of Darkness", "details_link": "https://www.metacritic.com/game/playstation-2/disgaea-hour-of-darkness", "publisher": "Atlus Co.", "release_date": "Aug 27 2003", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/9dbdea34e364e63b449aea8153c5225e-98.jpg", "descriptions": "The Netherworld - a realm darker than the deepest abyss, located far beneath where mortals tread. It is a cursed land where evil reigns and foul beings dwell. Nobody knows its whereabouts, but everybody fears its existence... The story takes place two years after the death of KingThe Netherworld - a realm darker than the deepest abyss, located far beneath where mortals tread. It is a cursed land where evil reigns and foul beings dwell. Nobody knows its whereabouts, but everybody fears its existence... The story takes place two years after the death of King Krichevskoy, the ruler of the Netherworld. His son Laharl awakens from a long sleep, unaware of his father's death. Meanwhile, scheming demons vie for supremacy over the Netherworld. With the help of his subordinate Etna and her underlings, the egocentric, self-absorbed Prince Laharl must fight to regain the throne and claim his birthright. [Atlus]… Expand"}, {"name": "Kingdom Hearts HD I.5 + II.5 Remix", "details_link": "https://www.metacritic.com/game/playstation-4/kingdom-hearts-hd-i5-+-ii5-remix", "publisher": "Square Enix", "release_date": "Mar 28 2017", "developers": ["Square Enix"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 84, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/9/38dda5f5b9a695b6fab1cab3bb25f502-98.jpg", "descriptions": "Kingdom Hearts HD 1.5 + 2.5 Remix is an HD remastered collection of 6 Kingdom Hearts experiences available for the first time on PS4."}, {"name": "Tiger Woods PGA Tour 11", "details_link": "https://www.metacritic.com/game/wii/tiger-woods-pga-tour-11", "publisher": "Electronic Arts", "release_date": "Jun  8 2010", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/61e572a99748438570f8caac12b546a4-98.jpg", "descriptions": "One of the most prestigious tournaments in golf, The Ryder Cup, is featured in Tiger Woods PGA TOUR 11. Gamers select a team and square off to try and bring home The Ryder Cup for their squad. The Ryder Cup is one of the last great sporting events to be founded in prestige rather than prizeOne of the most prestigious tournaments in golf, The Ryder Cup, is featured in Tiger Woods PGA TOUR 11. Gamers select a team and square off to try and bring home The Ryder Cup for their squad. The Ryder Cup is one of the last great sporting events to be founded in prestige rather than prize money.  Choose from the U.S. or European squad and participate in the various competition formats – foursomes where players hit alternate shots, fourballs and singles which traditionally bring the biennial event to a close with players going head to head. When playing The Ryder Cup mode offline, gamers have the option to swap matches, thus giving you the ultimate control over the outcomes of other matches. [Electronic Arts]… Expand"}, {"name": "Devil May Cry 5: Special Edition", "details_link": "https://www.metacritic.com/game/xbox-series-x/devil-may-cry-5-special-edition", "publisher": "Capcom", "release_date": "Nov 10 2020", "developers": ["Capcom"], "platforms": ["PlayStation 5", "Xbox Series X"], "num_players": "Up to 3 ", "genres": ["Action Adventure", "General"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/e69691e51cd78759a403231774cf6f63-98.jpg", "descriptions": "Devil May Cry is back. The legendary stylish action game is better than ever in the ultimate version of this multi-award winning hit.\r New features:\r\n\r\n- New playable character - Dante's brother and arch-rival, Vergil\r\n- Legendary Dark Knight mode - an extremely challenging horde modeDevil May Cry is back. The legendary stylish action game is better than ever in the ultimate version of this multi-award winning hit.\r New features:\r - New playable character - Dante's brother and arch-rival, Vergil\r- Legendary Dark Knight mode - an extremely challenging horde mode featuring huge numbers of enemies\r- Turbo Mode - make the game even more intense by playing at 1.2x speed\r- Ray-tracing support* - this next-generation graphics technology brings the already near-photorealistic world of DMC5 to a new level of unparalleled visual splendour\r- High Frame-Rate Mode - experience super-smooth action\r These new features and modes utilise the power of Xbox Series X to bring you the craziest, sexiest, most stylish Devil May Cry experience ever.… Expand"}, {"name": "The Movies", "details_link": "https://www.metacritic.com/game/pc/the-movies", "publisher": "Activision", "release_date": "Nov  8 2005", "developers": ["Lionhead Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/f263ede18b9fa814283b729a0e02f4a7-98.jpg", "descriptions": "The Movies gives you the opportunity to run your own Hollywood movie studio, ranging from 1920's silent films through to the present day and into the future. Whether you want to pioneer new technology or just make great movies, you'll be in charge of one of Hollywood's dream factories. YouThe Movies gives you the opportunity to run your own Hollywood movie studio, ranging from 1920's silent films through to the present day and into the future. Whether you want to pioneer new technology or just make great movies, you'll be in charge of one of Hollywood's dream factories. You decide such facets as content, sets, actors, costumes and more. Hire and fire the people you want as you make the best movies you can. Generate a short promotional trailer for every movie you make. Deal with Hollywood's brightest stars and biggest egos. Introduce special effects, new camera techniques and even 3D. Develop Web pages to hype your movie. Put you and your friends into the film world. Make a cheap, quick production or an epic blockbuster.… Expand"}, {"name": "Persona 4 Arena Ultimax", "details_link": "https://www.metacritic.com/game/playstation-3/persona-4-arena-ultimax", "publisher": "Atlus", "release_date": "Sep 30 2014", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox 360", "PlayStation 3"], "num_players": "Up to 3 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 84, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/1/d8b14c6c6aa6e22b1e7e4387d52b2dff-98.jpg", "descriptions": "In P4AU, the characters from Persona 4 and Persona 3 once again find themselves teaming up to face off in the P-1 Climax, a series of battles which must be won before the world ends. The original cast of characters from Persona 3 and 4 are back to discover the mastermind behind the wholeIn P4AU, the characters from Persona 4 and Persona 3 once again find themselves teaming up to face off in the P-1 Climax, a series of battles which must be won before the world ends. The original cast of characters from Persona 3 and 4 are back to discover the mastermind behind the whole tournament, while a few new faces join the fight, including Junpei Iori, Yukari Takeba, Rise Kujikawa, and more. But standing in their way is the dual katana-wielding Sho Minazuki, a huge threat to everyone involved in the P-1 Climax. Worse yet, there's a Sho lookalike who can wield a Persona...… Expand"}, {"name": "Crysis 2", "details_link": "https://www.metacritic.com/game/xbox-360/crysis-2", "publisher": "EA Games", "release_date": "Mar 22 2011", "developers": ["Crytek"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/f35332bd4955dc9d013511b56017a30c-98.jpg", "descriptions": "First-person shooter Crysis returns powered by CryEngline 3 and is coming to the PS3 and Xbox 360, as well as the PC."}, {"name": "Virtua Tennis: World Tour", "details_link": "https://www.metacritic.com/game/psp/virtua-tennis-world-tour", "publisher": "Sega", "release_date": "Oct  7 2005", "developers": ["Sumo Digital"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/eae805a9620df4f99e179b11eb6ce1fe-98.jpg", "descriptions": "Virtua Tennis World Tour features three core gameplay modes: World Tour, in which players travel the globe using a custom-created character to win cash; Exhibition, where players can take control of a pro tennis all-star for one-off matches; and Tournament, which puts players in knockoutVirtua Tennis World Tour features three core gameplay modes: World Tour, in which players travel the globe using a custom-created character to win cash; Exhibition, where players can take control of a pro tennis all-star for one-off matches; and Tournament, which puts players in knockout sessions where only the best will see victory. Play up against the best in the world or play as a star and challenge fellow professional players, including Roger Federer, Andy Roddick, Maria Sharapova, Venus Williams, Lindsay Davenport and Tim Henman, among others. Four unique court surfaces to play on. Play around the world on hard court, clay, grass and carpet. Multiplayer Wi-Fi function: Competition with other PSP system owners for up to four players. Three different play modes: World Tour, Exhibition and Tournament. Create your own player: Accessorise your character with the virtual cash you win in tournaments. [Sega]… Expand"}, {"name": "Rare Replay", "details_link": "https://www.metacritic.com/game/xbox-one/rare-replay", "publisher": "Microsoft Game Studios", "release_date": "Aug  4 2015", "developers": ["Rare Ltd.", "Code Mystics Inc."], "platforms": "Xbox One", "num_players": "Up to 32 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/21720eae0353b3ba70f2cab68285d96b-98.jpg", "descriptions": "Rare assembles the adventures of its iconic characters in a collection of thirty games that span the decades. From its earliest 2D classics to Xbox 360 hits, Rare Replay delivers a gaming array for veteran players and newcomers alike. Includes Perfect Dark, Killer Instinct Gold, Viva Pinata,Rare assembles the adventures of its iconic characters in a collection of thirty games that span the decades. From its earliest 2D classics to Xbox 360 hits, Rare Replay delivers a gaming array for veteran players and newcomers alike. Includes Perfect Dark, Killer Instinct Gold, Viva Pinata, Kameo, Banjo Kazooie, Conker's Bad Fur Day, Perfect Dark Zero, and a bunch more.… Expand"}, {"name": "Lonely Mountains: Downhill", "details_link": "https://www.metacritic.com/game/switch/lonely-mountains-downhill", "publisher": "Image & Form", "release_date": "May  7 2020", "developers": ["Megagon Industries"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Biking"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/c05abefb028295d3540cfeb9e6d2fb10-98.jpg", "descriptions": "Just you and your bike — take it on a thrilling ride down an unspoiled mountain landscape. Make your way through thick forests, narrow trails and wild rivers. Race, jump, slide and try not to crash — all the way from the peak to the valley."}, {"name": "Hitman 3", "details_link": "https://www.metacritic.com/game/playstation-5/hitman-3", "publisher": "Io Interactive", "release_date": "Jan 20 2021", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/481f3752b7117241d889292694a38165-98.jpg", "descriptions": "Death Awaits \r\rHITMAN 3 is the dramatic conclusion to the World of Assassination trilogy and takes players around the world on a globetrotting adventure to sprawling sandbox locations. Agent 47 returns as a ruthless professional for the most important contracts of his entire career.Death Awaits \r\rHITMAN 3 is the dramatic conclusion to the World of Assassination trilogy and takes players around the world on a globetrotting adventure to sprawling sandbox locations. Agent 47 returns as a ruthless professional for the most important contracts of his entire career.\r Supported by his Agency handler, Diana Burnwood, 47 joins forces with his long-lost friend Lucas Grey. Their ultimate mission is to eliminate the partners of Providence, but they are forced to adapt as their hunt intensifies. When the dust settles, 47 and the world he inhabits will never be the same again. \r\rTop of the World\rEvery mission location in HITMAN 3 is meticulously detailed and packed full of creative opportunities. Players will have unrivalled freedom to complete their objectives and the game world will react to everything they do. \r\rA Platform of Assassination\rThe World of Assassination trilogy is fully realised with HITMAN 3 as the ultimate place to play all three games. Players of previous HITMAN games will be pleased to know that it will be possible to 'import' locations that they own from the previous two HITMAN games into HITMAN 3, essentially putting all 20+ locations from the entire trilogy in one place.\r Playing the entire trilogy from beginning to end, from within HITMAN 3, also means that the progression systems in HITMAN 3 work across all locations. You can unlock an item in Dubai and take it with you to Paris, for example. HITMAN 2 players will have the option to carry over their hard-earned unlocks and progression into HITMAN 3.… Expand"}, {"name": "Tactics Ogre: Reborn", "details_link": "https://www.metacritic.com/game/pc/tactics-ogre-reborn", "publisher": "Square Enix", "release_date": "Nov 11 2022", "developers": ["Square Enix"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 84, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/3f7c454b6c58186beff0a19f15b1b114-98.jpg", "descriptions": "Based on the 2010 release, the game features improved graphics and sound, as well as updated game design, bringing to life a new Tactics Ogre that remains true to its roots. Tactics Ogre veterans will experience a game that surpasses their fondest memories, while players new to Tactics OgreBased on the 2010 release, the game features improved graphics and sound, as well as updated game design, bringing to life a new Tactics Ogre that remains true to its roots. Tactics Ogre veterans will experience a game that surpasses their fondest memories, while players new to Tactics Ogre will discover a game unlike any they've ever played. Reborn and deeper than ever, the game enables players to immerse themselves in the world and intrigue of Tactics Ogre like never before. The Valerian Isles, jewels of the Obero Sea. Long a center of naval commerce, the people of the isles struggled throughout history for dominion over her shores. Finally there rose a man to put an end to this conflict: Dorgalua Oberyth. But history would know him as the \"Dynast-King.\" King Dorgalua strove to stamp out the hatred among the people of the isles, and for fully half a century, Valeria knew prosperity. Yet upon the king's death, civil war erupted anew as three factions vied for control: the Bakram, who comprised much of Valeria's nobility; the Galgastani, whose people made up the majority of the isles' population; and the Walister, who numbered but few. The isles were soon divided between the Bakram and Galgastani, and an uneasy peace settled across the land. Yet none believed the calm would last...… Expand"}, {"name": "OlliOlli World", "details_link": "https://www.metacritic.com/game/playstation-5/olliolli-world", "publisher": "Private Division", "release_date": "Feb  8 2022", "developers": ["roll7"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/27546344bc41a4c8f289456e82c46b74-98.jpg", "descriptions": "OlliOlli World is a bold new skateboarding action-platformer that’s bursting with personality. Flip and flow through the vivid and vibrant world of Radlandia, meeting colorful characters as you grind, trick, and air your way to discover the mystical skate gods on your quest for Gnarvana.OlliOlli World is a bold new skateboarding action-platformer that’s bursting with personality. Flip and flow through the vivid and vibrant world of Radlandia, meeting colorful characters as you grind, trick, and air your way to discover the mystical skate gods on your quest for Gnarvana. Traverse a delightful and weird world as you take on missions, challenges, and make new friends along the way. Customize your character’s looks, tricks, and style while you experience explorable levels with multiple paths that provide an array of opportunities for player expression. Challenge the world in Leagues or dare a friend to beat your best tricks on one of millions of sharable levels. Experience the accessibility, depth, and player freedom as you dive into the signature flow state gameplay of OlliOlli World.\r OlliOlli World marks the third entry in the critically-acclaimed OlliOlli series from Roll7, the BAFTA and multi-award-winning independent studio.\r Key Features:\r • Welcome to Radlandia!: Take a trip across a lush skateboarding utopia that is filled to the brim with eccentric characters and vibrant locations that are begging to be explored. Find your grind in Inflatable Alley or blaze down Los Vulgas to discover new paths, fresh side quests, rad rewards, and epic trick opportunities. All perfectly complemented by a hand-picked compilation of IDM and Electronica tracks. \r\r• Play at your level: Super tight controls combine with highly refined gameplay to ensure a silky smooth ride. Not a Pro? Don’t worry – OlliOlli World welcomes you with open arms, allowing new players to tear down streets and pull off sick method grabs without fear of faceplanting the curb. Think you’ve got what it takes? Achieve mastery through millions of unique levels in sandbox mode or compete against rivals around the globe in leagues with a hugely deep combo system with over 100 moves to master and combine in your battle for the highest score.\r • Freedom of expression: Cruise through Radlandia's epic skate-haven and prove your skills to unlock special rewards that let you customize your character’s looks, tricks and style. Want to skate in your flip flops… go for it. Want to wear a bumble bee onesie …ok then… no judgement. In OlliOlli World as long as you’re on board anything goes! … Expand"}, {"name": "Mercenaries", "details_link": "https://www.metacritic.com/game/playstation-2/mercenaries", "publisher": "LucasArts", "release_date": "Jan 10 2005", "developers": ["Pandemic Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 84, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/ba30b0f7b33e0786321cb5011b6de66e-98.jpg", "descriptions": "Mercenaries is a revolutionary, 3rd person action-shooter game set in the near future and inspired by real world events. On the eve of a historic reunification of North and South Korea, a ruthless general stages a military coup to take control of North Korea and threatens the world withMercenaries is a revolutionary, 3rd person action-shooter game set in the near future and inspired by real world events. On the eve of a historic reunification of North and South Korea, a ruthless general stages a military coup to take control of North Korea and threatens the world with nuclear war. The international community launches a global task force to stabilize the region. However, when diplomatic efforts collapse and the region descends into anarchy they announce a one hundred million dollar bounty on the North Korean general and his top military and scientific advisors. The targets are identified in a ?most wanted? list in the form of a 52-card deck of playing cards. As one of the top operatives for a private mercenaries company called Executive Operations, you have been called in to collect on these bounties. [LucasArts]… Expand"}, {"name": "Neverwinter Nights: Hordes of the Underdark", "details_link": "https://www.metacritic.com/game/pc/neverwinter-nights-hordes-of-the-underdark", "publisher": "Atari", "release_date": "Dec  2 2003", "developers": ["BioWare"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/4206cd7e6f2179b3bb91e738e093224f-98.jpg", "descriptions": "The second expansion for the revolutionary role-playing game Neverwinter Nights. BioWare has created a dark and dangerous world of adventure set in the world of Dungeons & Dragons. Your hands are callused from many years of weapon play, your mind is sharp from hundreds of books studied, yourThe second expansion for the revolutionary role-playing game Neverwinter Nights. BioWare has created a dark and dangerous world of adventure set in the world of Dungeons & Dragons. Your hands are callused from many years of weapon play, your mind is sharp from hundreds of books studied, your feet are nimble from slipping unseen and unheard past thousands of guards and your faith is unshakable in the gods you worship... but will it be enough for this final terror? Will you stand once more for those who cannot? You are the last hope for the Forgotten Realms, you must face the unstoppable, you must decide the fate of all. You are a hero... but are you a legend? Epic levels, new prestige classes, new creatures, spells, feats, weapons and new tilesets to explore... endless adventure! [BioWare]… Expand"}, {"name": "Max Payne 2: The Fall of Max Payne", "details_link": "https://www.metacritic.com/game/xbox/max-payne-2-the-fall-of-max-payne", "publisher": "Rockstar Games", "release_date": "Nov 25 2003", "developers": ["Remedy Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/ea788a18259a31affabd39f25334e894-98.jpg", "descriptions": "A follow-up to 2001's Max Payne, Max Payne 2:  The Fall of Max Payne features an all-new intriguing story and more slick combat.  You play the role of Payne, a cop caught in a violent, film noir love story with a femme fatale murder suspect.  Experience Payne's signature slow-motion gunplayA follow-up to 2001's Max Payne, Max Payne 2:  The Fall of Max Payne features an all-new intriguing story and more slick combat.  You play the role of Payne, a cop caught in a violent, film noir love story with a femme fatale murder suspect.  Experience Payne's signature slow-motion gunplay with all new guns and new moves.  The game features fully interactive environments, characters with ragdoll physics, and believable enemies.  Max Payne 2 sets out to raise the bar for action game intensity once again.… Expand"}]