[{"name": "ITORAH", "details_link": "https://www.metacritic.com/game/pc/itorah", "publisher": "Grimbart Tales", "release_date": "Mar 21 2022", "developers": ["Grimbart Tales"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 61, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/9a4802d9d2c697faea57f83839e2fc22-98.jpg", "descriptions": "Guide Itorah through a fantastic world inhabited by strange masked beings.Mankind has vanished and Itorah seems to be the last of her kind! To uncover her past she will have to pick up her loud-mouthed axe and fight her way through lush forests, dangerous temples, stormy cliffs and moreGuide Itorah through a fantastic world inhabited by strange masked beings.Mankind has vanished and Itorah seems to be the last of her kind! To uncover her past she will have to pick up her loud-mouthed axe and fight her way through lush forests, dangerous temples, stormy cliffs and more hand-painted biomes.Their innocent quest for knowledge quickly turns into a mission to save this strange new world from its biggest threat: A mysterious plague that threatens to consume everything.… Expand"}, {"name": "Shadow Corridor", "details_link": "https://www.metacritic.com/game/switch/shadow-corridor", "publisher": "NIS America", "release_date": "Oct 26 2021", "developers": ["KazukiShiroma"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/f9ffbdf190e1eb526a2e4a82d0d96720-98.jpg", "descriptions": "Immerse yourself in the latest chapter of the popular, Japanese indie horror title, Kageroh: Shadow Corridor. Survive against the onslaught of horrors that lie in wait in eerie, traditional Japanese locales that change with every playthrough."}, {"name": "Evoland", "details_link": "https://www.metacritic.com/game/pc/evoland", "publisher": "Shiro Games", "release_date": "Apr  4 2013", "developers": ["Shiro Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "General"], "meta_score": 61, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/95b067e81a4de0bf385e432345ab93c1-98.jpg", "descriptions": "Evoland is a game and a story. The story of action adventure gaming as seen in the Zelda or Final Fantasy series, starting with the early age of action RPGs, when a few pixels were enough to make us dream for hours. New players will discover a bit of video game history and a very funEvoland is a game and a story. The story of action adventure gaming as seen in the Zelda or Final Fantasy series, starting with the early age of action RPGs, when a few pixels were enough to make us dream for hours. New players will discover a bit of video game history and a very fun gameplay, and veterans will also enjoy a host of references to legendary titles scattered along the game. [Shiro]… Expand"}, {"name": "Mutant Mudds", "details_link": "https://www.metacritic.com/game/pc/mutant-mudds", "publisher": "Renegade Kid", "release_date": "Aug 30 2012", "developers": ["Renegade Kid"], "platforms": ["3DS", "iPhone/iPad", "PC"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 61, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/8d8b835892a40008f127766a858b3141-98.jpg", "descriptions": "Mutant Mudds is a 12-bit action platformer for the Nintendo 3DS."}, {"name": "Infernal", "details_link": "https://www.metacritic.com/game/pc/infernal", "publisher": "Eidos Interactive", "release_date": "May  8 2007", "developers": ["Metropolis Software"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/b4624e627eb30c1494d92b6511ac870a-98.jpg", "descriptions": "Every thousand years a very rare planetary alignment makes Earth invisible to the Boss of the Bosses. Secret agencies of Heaven's and Hell's fighting each other for human souls, stop obeying any rules at all during that time. And even though Hell's agency traditionally does not obey rules,Every thousand years a very rare planetary alignment makes Earth invisible to the Boss of the Bosses. Secret agencies of Heaven's and Hell's fighting each other for human souls, stop obeying any rules at all during that time. And even though Hell's agency traditionally does not obey rules, the balance between good and evil becomes gravely endangered when their opponents from Heaven also stop observing the rules! Dark Eaville, is on a mission to stop Heaven's agency and bring back the delicate balance between good and evil. [Metropolis Software]… Expand"}, {"name": "Muppets Party Cruise", "details_link": "https://www.metacritic.com/game/playstation-2/muppets-party-cruise", "publisher": "TDK Mediactive", "release_date": "Nov 13 2003", "developers": ["Mass Media"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "General"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/1ec117dab2a1c50d06d62928570886d0-98.jpg", "descriptions": "Cruise with Kermit, Miss Piggy, Animal plus all your other favorite Muppets! Play 30 of the fast and fun action-packed mini-games as you earn your way to the first class deck! Funny, fast-paced and zany fun for 1-4 players of all ages! [TDK Mediactive]"}, {"name": "Robotech: The Macross Saga", "details_link": "https://www.metacritic.com/game/game-boy-advance/robotech-the-macross-saga", "publisher": "TDK Mediactive", "release_date": "Oct 27 2002", "developers": ["Lucky Chicken"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 61, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/7535a723484b569952a0a58c620e428b-98.jpg", "descriptions": "The Macross Saga would be forgettable if not for its strong license."}, {"name": "X-Men: Next Dimension", "details_link": "https://www.metacritic.com/game/playstation-2/x-men-next-dimension", "publisher": "Activision", "release_date": "Oct 15 2002", "developers": ["Paradox Development"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 61, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/3c51562f332473cd14d2ab669182e157-98.jpg", "descriptions": "Next Dimension plunges players into a powerful enemy's plot to rid the world of mutants. Leaving traditional arena-based fighting games in its wake, X-MEN: Next Dimension is the only console fighter that carries epic superhero showdowns across expansive 3-D levels. Players fight as 24Next Dimension plunges players into a powerful enemy's plot to rid the world of mutants. Leaving traditional arena-based fighting games in its wake, X-MEN: Next Dimension is the only console fighter that carries epic superhero showdowns across expansive 3-D levels. Players fight as 24 different X-MEN characters through interactive environments replete with combat-induced damage. [Activision]… Expand"}, {"name": "Future Tactics: The Uprising", "details_link": "https://www.metacritic.com/game/xbox/future-tactics-the-uprising", "publisher": "Crave", "release_date": "May 10 2004", "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Sci-Fi"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/f6ba56d946d3da62ee0f230cc7c8301a-98.jpg", "descriptions": "Welcome to the future--a place where creatures have forced humans to live in squalor, battling their overlords and waxing nostalgic for better days. Now, a young boy named Low, his sister, and a collection of fighters find themselves as mankind's only hope for blasting the creatures back toWelcome to the future--a place where creatures have forced humans to live in squalor, battling their overlords and waxing nostalgic for better days. Now, a young boy named Low, his sister, and a collection of fighters find themselves as mankind's only hope for blasting the creatures back to where they came from. You must guide this ragtag team of survivors through 19 levels of tactical combat while upgrading them with powerful weapons. In Battle mode, you can take on a friend in tactical warfare--complete with customizable handicaps, power-ups, and victory conditions. … Expand"}, {"name": "Fatal Inertia", "details_link": "https://www.metacritic.com/game/xbox-360/fatal-inertia", "publisher": "Koei", "release_date": "Sep 11 2007", "developers": ["Koei"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Futuristic"], "meta_score": 61, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/7/e0c087a9ac25605ac0a2be7643d1d53e-98.jpg", "descriptions": "Inspired by combat racing games such as \"Mario Kart\" this futuristic racing game positively encourages players, gathered around the TV or competing online, to be as devious and imaginative as possible in knocking your rivals out of 1st place. Taking advantage of the extra power that the XboxInspired by combat racing games such as \"Mario Kart\" this futuristic racing game positively encourages players, gathered around the TV or competing online, to be as devious and imaginative as possible in knocking your rivals out of 1st place. Taking advantage of the extra power that the Xbox 360 provides, Fatal Inertia enables players to bring rock falls down on their opponents, blast through layers of ice to dive into the water below for a sneaky shortcut and totally ruin someone's chance of victory with a little bit of cunning and a whole bunch of ingenious weapons. [KOEI]… Expand"}, {"name": "Windward", "details_link": "https://www.metacritic.com/game/pc/windward", "publisher": "Tasharen Entertainment", "release_date": "May 12 2015", "developers": ["Tasharen Entertainment"], "platforms": "PC", "genres": ["General", "Action", "General"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/7cf7716e56e27297d23e4ec52d77781d-98.jpg", "descriptions": "An action-adventure RPG in which you control a ship set in a large randomly generated world full of procedural content that will give you a different experience every time you start a new campaign."}, {"name": "Zombie Apocalypse", "details_link": "https://www.metacritic.com/game/playstation-3/zombie-apocalypse", "publisher": "Konami", "release_date": "Sep 24 2009", "developers": ["Nihilistic"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/ff358aaa47f08acbfcd1ecfbaa741a79-98.jpg", "descriptions": "[Playstation Network]  As the zombie infection spreads uncontrollably and the undead outnumber humans, a small band of heavily equipped gunslingers set out to destroy as many zombies as they can and try to save any of the remaining survivors in Zombie Apocalypse. Up to four players can try[Playstation Network]  As the zombie infection spreads uncontrollably and the undead outnumber humans, a small band of heavily equipped gunslingers set out to destroy as many zombies as they can and try to save any of the remaining survivors in Zombie Apocalypse. Up to four players can try and stop the zombie apocalypse with an arsenal of deadly weapons, such as an assault rifle, flame thrower, or grenade launcher, and when ammo is low a chainsaw will be your last line of defense against becoming one of the undead. This action packed, arcade-style shooter will test your dual analog stick shooting skills and ability to survive 55 days of relentless zombie attacks. Multiplayer action: Spill zombie guts side-by-side with up to four players in online or local multiplayer. Devastating weapons: Burn, saw, and dismember the undead with ten devastating weapons. Fatal hazards: Butcher the walking dead using jet turbines, wood chippers, and other fatal hazards. Survival strategy: Survive over 50 stages of brutal carnage in seven brain-splattering locations. Bonus game modes: Re-live the apocalypse with seven challenging unlockable game modes. [Konami]… Expand"}, {"name": "Siegecraft Commander", "details_link": "https://www.metacritic.com/game/xbox-one/siegecraft-commander", "publisher": "Blowfish Studios", "release_date": "Jan 17 2017", "developers": ["Blowfish Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Strategy", "Real-Time", "MOBA", "Defense"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/ce9836e9a315728553ec1635a71d6fe8-98.jpg", "descriptions": "Siegecraft Commander is the latest installment in the popular Siegecraft franchise. With a combination of twitch mechanics and positional tactics, the objective is to build a fortress in a branching structure with specialised towers connected with lofty indestructible walls. AlmostSiegecraft Commander is the latest installment in the popular Siegecraft franchise. With a combination of twitch mechanics and positional tactics, the objective is to build a fortress in a branching structure with specialised towers connected with lofty indestructible walls. Almost everything is performed by adjusting the angle and trajectory of projectiles. Fans of cult classic Moonbase Commander will appreciate the fresh look and overall improvements.… Expand"}, {"name": "MegaTagmension Blanc + Neptune VS Zombies", "details_link": "https://www.metacritic.com/game/playstation-vita/megatagmension-blanc-+-neptune-vs-zombies", "publisher": "Idea Factory", "release_date": "May 10 2016", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation Vita"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 61, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/6020fca1710e40796cb189da70efd572-98.jpg", "descriptions": "The prestigious Gamicademi — an academy of fading glory. To put it back in the spotlight, Blanc and friends decide to film a zombie flick on campus. All’s quiet on the set until real zombies start crawling out of the woodwork! Now they’ve got to send these zombies to detention in this hackThe prestigious Gamicademi — an academy of fading glory. To put it back in the spotlight, Blanc and friends decide to film a zombie flick on campus. All’s quiet on the set until real zombies start crawling out of the woodwork! Now they’ve got to send these zombies to detention in this hack ‘n’ slash — or else be history. [Playstation.com]… Expand"}, {"name": "White Night", "details_link": "https://www.metacritic.com/game/xbox-one/white-night", "publisher": "Activision", "release_date": "Mar  6 2015", "developers": ["OSome Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "General", "Action Adventure", "Survival"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/8918794b6a61c6956f4b90990c0dda01-98.jpg", "descriptions": "Explore the macabre past of an aging mansion in the 1930's and solve puzzles of light and shadows in this fully black & white survival horror. Players are trapped in this nightmare where darkness is a persistent threat."}, {"name": "PlayStation Move Fitness", "details_link": "https://www.metacritic.com/game/playstation-3/playstation-move-fitness", "publisher": "SCEA", "release_date": "Mar 26 2013", "developers": ["Coldwood Interactive"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/f924e2d38a0dd7668657869087c8a721-98.jpg", "descriptions": "Its time to get fit  the PlayStationMove way! \r\rGrab your PlayStationMove motion controllers, step into your own virtual gym and get in shape with over 25 fun, intense exercises and a personal trainer to guide and push you all the way. \r\rPlayStationMove Fitness is the ideal way to boostIts time to get fit  the PlayStationMove way! \r\rGrab your PlayStationMove motion controllers, step into your own virtual gym and get in shape with over 25 fun, intense exercises and a personal trainer to guide and push you all the way. \r\rPlayStationMove Fitness is the ideal way to boost your fitness in the comfort of your own home. With the precision of PlayStationMove motion controllers, exercises are easy to get into and highly rewarding; youll find yourself instantly ducking and weaving, hitting targets and performing punch combos. \r\rYou can set up your own tailor-made fitness program, pick your favorite exercises for a quick dose of fun and even work out to your own music collection. And when its time to let off some steam, PlayStationMove Fitness is also a great stress-buster, giving you the opportunity to pummel a destructible dummy, shoot some basketball hoops or play a game of dodgeball. \r\rNot a fan of training on your own? Then hook up with friends online, give them some encouragement or challenge them to beat your best scores  adding a little competition can really help you get results!… Expand"}, {"name": "Robocalypse: Beaver Defense", "details_link": "https://www.metacritic.com/game/wii/robocalypse-beaver-defense", "publisher": "Vogster", "release_date": "May 31 2010", "developers": ["Vogster"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Defense"], "meta_score": 61, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/21c71f0d2547e0a9179253b4ab48726e-98.jpg", "descriptions": "[WiiWare]  Set in a world of wisecracking, battling robots, Robocalypse - Beaver Defense offers madcap weaponry and uproarious destruction in a \"tower defense\"-style game. Players must create and strategically position towers to annihilate waves of enemy robots, while player-controlled Hero[WiiWare]  Set in a world of wisecracking, battling robots, Robocalypse - Beaver Defense offers madcap weaponry and uproarious destruction in a \"tower defense\"-style game. Players must create and strategically position towers to annihilate waves of enemy robots, while player-controlled Hero robots act as mobile weapons units, bringing heavy firepower to all areas of the battlefield. Players can experience the hilarious Story Mode or face the Beaver's never-ending supply of robots in Survival Mode.… Expand"}, {"name": "Star Wars: The Force Unleashed", "details_link": "https://www.metacritic.com/game/ds/star-wars-the-force-unleashed", "publisher": "LucasArts", "release_date": "Sep 16 2008", "developers": ["n-Space"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Switch", "Xbox 360", "DS"], "num_players": "6  Online", "genres": ["Action", "Action Adventure", "General", "General", "Shooter", "Linear", "Third-Person", "Arcade"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/02c67d528601948bcd4ce241d1ad0938-98.jpg", "descriptions": "Star Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode IIIStar Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode III Revenge of the Sith\" and \"Star Wars: Episode IV A New Hope.\" In it, players assist the iconic villain in his quest to rid the universe of Jedi - and face decisions that could change the course of their destiny. Unleash and upgrade the Secret Apprentice's four core Force powers - Force push, grip, repulse and lightning - throughout the course of the game, and combine them for ultra-destructive, never-before-seen combos. The Secret Apprentice doesn't just Force push enemies into walls - he Force pushes enemies through walls. The Secret Apprentice doesn't just Force grip foes to throw them aside - he Force grips them in midair, zapping them with lightning, then dropping them to the ground to explode like a bomb. In addition to new adversaries created just for the game, such as fugitive Jedi and Force-sensitive Felucians, players also confront and associate with familiar faces from the Star Wars films, including Darth Vader. Visit locations such as Episode III's Wookiee homeworld Kashyyyk and the floral Felucia, the junk planet Raxus Prime, plus an Imperial TIE fighter construction facility. Decisions made by players throughout the game determine the path of the story, including multiple endings that will rock Star Wars continuity as they know it. [LucasArts]… Expand"}, {"name": "Kirby Air Ride", "details_link": "https://www.metacritic.com/game/gamecube/kirby-air-ride", "publisher": "Nintendo", "release_date": "Oct 13 2003", "developers": ["HAL Labs"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 61, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/985936512bbdde8980f386a27893753c-98.jpg", "descriptions": "Prepare for fast and furious racing action as Kirby hits Warpstar speed.  Use simple controls to race and battle your friends in one of three hectic game modes.  In Air Ride mode, you'll race to the finish line against your friends or computer-controlled competition.  Top Ride mode lets upPrepare for fast and furious racing action as Kirby hits Warpstar speed.  Use simple controls to race and battle your friends in one of three hectic game modes.  In Air Ride mode, you'll race to the finish line against your friends or computer-controlled competition.  Top Ride mode lets up to four players race to the finish line using wild items like buzz saws, drills, and freeze fans to pester the competition.  In City Trial mode, you'll race around a gigantic fantasy city in a quest to build the ideal machine to use in a random challenge that occurs after a set time limit.  Don't let Kirby's cuteness fool you--Kirby Air Ride is crawling with tough challenges suitable for players of all ages.… Expand"}, {"name": "Playboy: The Mansion", "details_link": "https://www.metacritic.com/game/xbox/playboy-the-mansion", "publisher": "Arush Entertainment", "release_date": "Jan 25 2005", "developers": ["Cyberlore Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Strategy", "Tycoon"], "meta_score": 61, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/81415f38515a765e2d5310834e2e48c9-98.jpg", "descriptions": "Playboy: The Mansion blends social simulation with role-playing and empire-building gameplay. As Hugh Hefner, you build the Playboy Mansion and magazine into a cultural icon and a powerful brand. Rub shoulders with attractive women and celebrities as you pursue the ultimate PlayboyPlayboy: The Mansion blends social simulation with role-playing and empire-building gameplay. As Hugh Hefner, you build the Playboy Mansion and magazine into a cultural icon and a powerful brand. Rub shoulders with attractive women and celebrities as you pursue the ultimate Playboy lifestyle. Grow famous and gain exclusive access to the Playboy Archives, which include footage of the world-famous Playboy Mansion. You're rewarded for living the good life, having a positive sexual attitude, and promoting tolerance and individual freedom. … Expand"}, {"name": "Sunny Garcia Surfing", "details_link": "https://www.metacritic.com/game/playstation-2/sunny-garcia-surfing", "publisher": "Ubisoft", "release_date": "Oct 22 2001", "developers": ["Krome Studios"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Alternative", "Surfing"], "meta_score": 61, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/1414c3cdc409b3949252f701bda02ed7-98.jpg", "descriptions": "Drop-in on a gnarly Fiddlesticks 30-foot wave of have fun sessions with Sandy Beach?s 3-4 foot sets as one of 9 world-class surfers. Packed with ultra-realistic moves, players will be stoked as they pull off round-house cutbacks, lippers, floaters, and catch unreal barrel rides. [Ubi Soft]"}, {"name": "Sword Coast Legends", "details_link": "https://www.metacritic.com/game/pc/sword-coast-legends", "publisher": "Digital Extremes", "release_date": "Oct 19 2015", "developers": ["n-Space"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "General", "Western-Style"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/13a46a3a6288cbe3e8245efe8060017e-98.jpg", "descriptions": "Set in the lush and vibrant world of the Forgotten Realms, Sword Coast Legends offers a novel new way to enjoy the time-tested magic of playing Dungeons & Dragons as a shared storytelling experience."}, {"name": "Baja: Edge of Control", "details_link": "https://www.metacritic.com/game/playstation-3/baja-edge-of-control", "publisher": "THQ", "release_date": "Sep 22 2008", "developers": ["2XL Games"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 61, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/215599e81513730800568597f25c9c19-98.jpg", "descriptions": "From the core founding members of the MX vs. ATV franchise comes the next off-road racing experience: BAJA. Conquer the toughest terrain Mother Nature has to offer and build the ultimate off-road vehicle. Combining the best elements of the real-world sport with the right balance of arcadeFrom the core founding members of the MX vs. ATV franchise comes the next off-road racing experience: BAJA. Conquer the toughest terrain Mother Nature has to offer and build the ultimate off-road vehicle. Combining the best elements of the real-world sport with the right balance of arcade fun, BAJA transports players to the epic open worlds and unforgiving terrain found at the pinnacle of off-road racing. Stunning visuals, vertical environments, and unpredictable terrain are crossed in over 100 square miles of drive-to-horizon landscape. Master hill-climb, circuit, and rally races to earn career sponsorships on the path to off-road supremacy. Harness the horsepower of elite Trophy Trucks, 4x4’s and Buggies to finally compete in the definitive off-road endurance challenge, the Baja. Supercharged Vehicles: Harness the horsepower of over 40 elite Trophy Trucks, 4x4’s and Buggies across eight varied vehicle classes. Horizontal Racing: Suspension, torque and horsepo wer are perfectly balanced to create the ultimate edge-of-control racing experience. Fine-tune the roar of your off-road machine with over 200 authentic vehicle parts. Power past the competition in 4-player split screen and 8-player online racing. [THQ]… Expand"}, {"name": "Sega Casino", "details_link": "https://www.metacritic.com/game/ds/sega-casino", "publisher": "Sega", "release_date": "Oct 10 2005", "developers": ["TOSE"], "platforms": "DS", "num_players": "1-5 ", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/b439620e0bedf63dd651bfa3d10f314a-98.jpg", "descriptions": "SEGA Casino deals out plenty of gambling action for gamers on-the-go with a casino experience that features five games, and six unlockable games. Players can place their bets on SEGA Casino's Roulette, Craps, Baccarat, and other unlockable games, including Chuck-a-Luck, Keno, and three VideoSEGA Casino deals out plenty of gambling action for gamers on-the-go with a casino experience that features five games, and six unlockable games. Players can place their bets on SEGA Casino's Roulette, Craps, Baccarat, and other unlockable games, including Chuck-a-Luck, Keno, and three Video Poker variants (Jacks or Better, Double Bonus, and Deuces Wild). They can improve their skills by taking on AI opponents solo, or they can play wirelessly with up to four friends by using a single cartridge and downloading SEGA Casino temporarily onto other players' DS units. Card game fans will be able to challenge friends in heated rounds of Black Jack, Texas Hold 'em, and the unlockable 7 Card Poker. Adding variety, players can double-down on SEGA Casino's three gameplay styles: Free Mode, in which players can unlock games; Wireless Mode, which allows players to compete against four other friends in multiplayer card action via the Nintendo DS wireless connection; and Casino Mode, in which players attempt to turn $1,000 into millions by winning tournaments. Card sharks and big-spenders can even unlock higher-limit Casino Rooms. [Sega]… Expand"}, {"name": "Velvet Assassin", "details_link": "https://www.metacritic.com/game/pc/velvet-assassin", "publisher": "SouthPeak Games", "release_date": "Apr 30 2009", "developers": ["Replay Studios", "ML Enterprises"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Tactical", "Historic", "Historic"], "meta_score": 61, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/6d479fbb705df3d372db4476da50bb9d-98.jpg", "descriptions": "Velvet Assassin is a stealth-action game set in World War II and is inspired by real-life British secret agent Violette Szabo. Players assume the role of Violette Summer and head deep behind enemy lines with no support or official backing from the British Government. Violette risks her lifeVelvet Assassin is a stealth-action game set in World War II and is inspired by real-life British secret agent Violette Szabo. Players assume the role of Violette Summer and head deep behind enemy lines with no support or official backing from the British Government. Violette risks her life fighting to defeat the German war machine one stealth mission at a time. Velvet Assassin combines lush, surreal visuals and a ground-breaking stealth combat system to deliver a gaming experience which is truly the first of its kind. [Gamecock Media]… Expand"}, {"name": "Honeycomb Beat", "details_link": "https://www.metacritic.com/game/ds/honeycomb-beat", "publisher": "Hudson", "release_date": "Apr  2 2007", "developers": ["Hudson"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/394b9bf819529ad0637197b685ef76d9-98.jpg", "descriptions": "Honeycomb Beat puts your brain power to the test with a cool fusion of music and addictive puzzle action. Solve puzzles by clicking on honeycomb tiles to match their color to the playfield. Sounds easy? Multiple puzzles increase the challenge and fun for even the smartest of players. Easy toHoneycomb Beat puts your brain power to the test with a cool fusion of music and addictive puzzle action. Solve puzzles by clicking on honeycomb tiles to match their color to the playfield. Sounds easy? Multiple puzzles increase the challenge and fun for even the smartest of players. Easy to pick up and play with 200+ different puzzles to solve. Arcade-style Infinite mode - stop the honeycomb tiles from advancing to the top as you clear them away. Built-in Tutorial helps you learn basic rules and better techniques. Unlock new music, backgrounds and visualization themes as you advance. Rise through the ranks of \"Brain Evolution\" as you play better. [Konami]… Expand"}, {"name": "Ary and the Secret of Seasons", "details_link": "https://www.metacritic.com/game/xbox-one/ary-and-the-secret-of-seasons", "publisher": "Modus Games", "release_date": "Sep  1 2020", "developers": ["Exiin"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/b6c25c0151b821c06ad686f4f850ec01-98.jpg", "descriptions": "Ary and the Secret of Seasons is  adventure game following a young girl named Aryelle, or Ary, as she journeys across the great world of Valdi. By becoming the Guardian of Winter, Ary gains the ability to manipulate the seasons around her. Ary will learn to control the seasons and use themAry and the Secret of Seasons is  adventure game following a young girl named Aryelle, or Ary, as she journeys across the great world of Valdi. By becoming the Guardian of Winter, Ary gains the ability to manipulate the seasons around her. Ary will learn to control the seasons and use them to defeat enemies, overcome obstacles, and solve complex puzzles on her adventure across Valdi. Long ago, the world of Valdi was threatened by an evil mage. After a great struggle, he was defeated by the Legendary Warrior and sealed inside the Vault, imprisoned for all eternity. To ensure the mage's imprisonment, four great sages swore to keep watch and protect the Vault. They formed the original Guardians of Seasons, a secretive organization now steeped in history and legend. After a mysterious force throws the seasons of Valdi into disarray, Ary decides to assist the Guardians of Seasons and sets out to find the source of the mayhem. Using her wits and courage, Ary will have to overcome monstrous enemies, secret plots, and stuffy traditions to save Valdi and bring balance to the world once more. … Expand"}, {"name": "Asterix & Obelix XXL 2", "details_link": "https://www.metacritic.com/game/playstation-4/asterix-obelix-xxl-2", "publisher": "Microids", "release_date": "Nov 29 2018", "developers": ["Etranges Libellules"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/312478e801cff848d6c6ea041a515555-98.jpg", "descriptions": "Getafix, a traitor?So says Sam Shieffer, ex-super spy of the Roman Empire... Asterix & Obelix head off to Las Vegum, Caesar's gigantic theme park in the heart of Rome. Will our heroes manage to foil Caesar's plan?\n- 2 characters to control at a time\n- Action-packed combat\n- MultiplayerGetafix, a traitor?So says Sam Shieffer, ex-super spy of the Roman Empire... Asterix & Obelix head off to Las Vegum, Caesar's gigantic theme park in the heart of Rome. Will our heroes manage to foil Caesar's plan?- 2 characters to control at a time- Action-packed combat- Multiplayer possibility: 2 to 4 players can play wireless… Expand"}, {"name": "Voodoo Dice", "details_link": "https://www.metacritic.com/game/xbox-360/voodoo-dice", "publisher": "Ubisoft", "release_date": "May 26 2010", "developers": ["Exkee"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/279bd443eb183afc2e55179d94c21796-98.jpg", "descriptions": "[Xbox Live Arcade]  Roll the dice in a mystical world filled with exploration, puzzle solving, and adventure. Voodoo Dice is a puzzler that challenges you to solve puzzles in unique and interesting ways in a quest to conquer the voodoo universe. Experience a variety of game play with 60[Xbox Live Arcade]  Roll the dice in a mystical world filled with exploration, puzzle solving, and adventure. Voodoo Dice is a puzzler that challenges you to solve puzzles in unique and interesting ways in a quest to conquer the voodoo universe. Experience a variety of game play with 60 single-player levels, 20 multiplayer levels, and four multiplayer modes including Race Mode, Flag Mode, Tactic Mode, and Arcade Mode. Voodoo Dice promises to win you over with its immersive gameplay and Voodoo fun! [Ubisoft]… Expand"}, {"name": "Capcom Fighting Evolution", "details_link": "https://www.metacritic.com/game/xbox/capcom-fighting-evolution", "publisher": "Capcom", "release_date": "Jun 14 2005", "developers": ["Capcom"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Action", "Fighting", "2D"], "meta_score": 61, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/2ad4e1394dbd8dc0fb3e67c7a7c92dda-98.jpg", "descriptions": "Characters from Street Fighter and other Capcom series come together for intense two-on-two battles in Capcom Fighting Evolution. Now you can play as a diverse cast of players, as well as additional hidden characters from each of the following titles: Street Fighter II, Darkstalkers, StreetCharacters from Street Fighter and other Capcom series come together for intense two-on-two battles in Capcom Fighting Evolution. Now you can play as a diverse cast of players, as well as additional hidden characters from each of the following titles: Street Fighter II, Darkstalkers, Street Fighter III, Red Earth, and Street Fighter Alpha. Each character maintains his or her unique fighting style from his or her respective title, so players must strategically use each character's combat system to defeat an opponent.… Expand"}, {"name": "Arkanoid DS", "details_link": "https://www.metacritic.com/game/ds/arkanoid-ds", "publisher": "Square Enix", "release_date": "Jun 17 2008", "developers": ["Taito Corporation"], "platforms": "DS", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 61, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/970f1bafef96ed4f5e7accf5157369c5-98.jpg", "descriptions": "Explore three game modes that offer varied gameplay designed for a wide range of users. Compete against others with two or four person multiplayer options to claim the title of ARKANOID DS champion. Decorate ARKANOID DS with colorful designs by trading points gained through gameplay for funExplore three game modes that offer varied gameplay designed for a wide range of users. Compete against others with two or four person multiplayer options to claim the title of ARKANOID DS champion. Decorate ARKANOID DS with colorful designs by trading points gained through gameplay for fun backgrounds and icons. Rock to an irresistible soundtrack produced by Zuntata, TAITO’s award-winning sound team. [Taito]… Expand"}, {"name": "Build-A-Bear Workshop", "details_link": "https://www.metacritic.com/game/ds/build-a-bear-workshop", "publisher": "The Game Factory", "release_date": "Nov  5 2007", "developers": ["Neko Entertainment"], "platforms": ["iPhone/iPad", "DS"], "genres": ["Simulation", "General", "General"], "meta_score": 61, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/9/dabfce3d96993674850cc6d1391a18c6-98.jpg", "descriptions": "Make your own Build-A-Bear, dress it up, play with it in lots of funny activities and mini games! The Bear will be like a virtual extension of yourself and a personal companion you can love like a best friend. You must make sure you satisfy its daily needs as physical affection, fun, food,Make your own Build-A-Bear, dress it up, play with it in lots of funny activities and mini games! The Bear will be like a virtual extension of yourself and a personal companion you can love like a best friend. You must make sure you satisfy its daily needs as physical affection, fun, food, learning, social life and trendyness are all necessary elements for the Bear to be balanced and happy. A highly interactive and trans-generational game in the true Build-A-Bear spirit. Create and customise your very own Bear in the Workshop-part of the game. Here you get to pick out the Bear you want, choose a motto, stuff it, insert its special heart and whisper a secret into its ear. Next you stitch it together, fluff it, name it, dress it and take it home to its special house that you get to colour for it. There are 8 different Bear characters you can customise: Dimples Teddy, Mocha Bunny, Pink Poodle, Playfull Puppy, Velvet Teddy, Friendly Frog, Marvelous Monkey, Sassy Kitty. Build-A-Bear for Nintendo DS is a new, fun kind of relationship simulation game, which takes into account the Bear's evolution as much as the players' fun factor. The Build-A-Bear characters, graphical universe and lifestyles are respectfully adapted and enhanced by this new addition: the Virtual Bear, an extension of every Build-A-Bear fan around the world. [The Game Factory]… Expand"}, {"name": "Dragon Ball Z: Extreme Butoden", "details_link": "https://www.metacritic.com/game/3ds/dragon-ball-z-extreme-butoden", "publisher": "Bandai Namco Games", "release_date": "Oct 20 2015", "developers": ["Arc System Works"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/f4429724ba43745cfa8c4f14ae890c77-98.jpg", "descriptions": "Features over 100 characters from the Dragon Ball Z universe. Feel the chaotic power of bone-crushing blows as you execute and chain together multiple-hit combinations. Helm character specific move-sets and unleash epic Super Moves to deal devastating damage."}, {"name": "Star Wars Episode III: Revenge of the Sith", "details_link": "https://www.metacritic.com/game/xbox/star-wars-episode-iii-revenge-of-the-sith", "publisher": "LucasArts", "release_date": "May  4 2005", "developers": ["Double Helix Games"], "platforms": ["PlayStation 2", "Xbox"], "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 61, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/0e8e667dd6836ac73735f614be61e632-98.jpg", "descriptions": "Based on the third episode of the Star Wars trilogy, Star Wars Episode III: Revenge of the Sith promises an authentic Jedi experience. The third-person action game follows Anakin Skywalker and Obi-Wan Kenobi as they fight enemies, learn new skills, and pull off combo moves. In multiplayerBased on the third episode of the Star Wars trilogy, Star Wars Episode III: Revenge of the Sith promises an authentic Jedi experience. The third-person action game follows Anakin Skywalker and Obi-Wan Kenobi as they fight enemies, learn new skills, and pull off combo moves. In multiplayer duels, you can fight against Darth Vader and other challenging enemies.… Expand"}, {"name": "Shining Tears", "details_link": "https://www.metacritic.com/game/playstation-2/shining-tears", "publisher": "Sega", "release_date": "Mar 22 2005", "developers": ["Nex Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 61, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/fdb5ec44dc5514bb64f17f59274ebdf1-98.jpg", "descriptions": "Shining Tears tells the tale of a young man who has lost his memory and finds himself caught in a war he does not understand. The city he lives in is under siege, and the reason, he is told, revolves around two magical rings of power. In a journey of discovery, the boy and his friends soonShining Tears tells the tale of a young man who has lost his memory and finds himself caught in a war he does not understand. The city he lives in is under siege, and the reason, he is told, revolves around two magical rings of power. In a journey of discovery, the boy and his friends soon realize the terrifying truth about the world they live in. Along the way, they fortify themselves with ever more powerful weaponry, spells, and a rotating cast of allies. The game is a spiritual successor to \"Shining in the Darkness\" (Genesis) and the \"Shining Force\" trilogy (Genesis, Saturn). Whereas those classics offered first-person role-playing and strategy role-playing experiences (respectively), Shining Tears is an action role-playing game, featuring real-time battles and cooperative multiplayer game options. [Sega]… Expand"}, {"name": "Darkened Skye", "details_link": "https://www.metacritic.com/game/gamecube/darkened-skye", "publisher": "Simon & Schuster", "release_date": "Nov 16 2002", "developers": ["Boston Animation"], "platforms": ["PC", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/c6d5fb850d67833c3fde31d3dff5a47a-98.jpg", "descriptions": "YOU ARE SKYE OF LYNLORA,\rRECRUITED AS HERO #1 IN THE BATTLE AGAINST EVIL. \rWield Powerful Magic\rSolve Ancient Mysteries\rSave the World"}, {"name": "Silent Scope 3", "details_link": "https://www.metacritic.com/game/playstation-2/silent-scope-3", "publisher": "Konami", "release_date": "Oct 15 2002", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Rail"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/d2f7c210e462c03e78ce19beeebddd1e-98.jpg", "descriptions": "As the world's best sniper, prevent a terrorist organization from using cloning technology for global domination. Featuring expansive levels and diabolical bosses, it's time to silence the enemy threat. Silent Scope 3 delivers twice the gameplay by including the hit arcade game, Silent ScopeAs the world's best sniper, prevent a terrorist organization from using cloning technology for global domination. Featuring expansive levels and diabolical bosses, it's time to silence the enemy threat. Silent Scope 3 delivers twice the gameplay by including the hit arcade game, Silent Scope EX! [Konami]… Expand"}, {"name": "Asemblance", "details_link": "https://www.metacritic.com/game/playstation-4/asemblance", "publisher": "Nilo Studios", "release_date": "Jun 21 2016", "developers": ["Nilo Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 61, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/0/766c63c20bbd33f849bd08f0ea0707de-98.jpg", "descriptions": "Asemblance is a single-player, first-person, psychological thriller. You awake to find yourself trapped inside an experimental machine. A machine built to simulate memories. You have no idea how you got here… But to break the cycle, you must look into a past that you may not want to remember."}, {"name": "Zeno Clash II", "details_link": "https://www.metacritic.com/game/pc/zeno-clash-ii", "publisher": "Atlus", "release_date": "Apr 30 2013", "developers": ["ACE Team"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Role-Playing", "Adventure", "Action RPG", "Beat-'Em-Up", "Action RPG", "Beat-'Em-Up", "First-Person", "Fantasy", "3D"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/fa7e2f0839ab14ccae4271bb73e37771-98.jpg", "descriptions": "Building upon the daring visual design and gratifying first-person fisticuffs of the acclaimed original, Zeno Clash II is bigger, bolder, and better in every way.  Zenozoik comes alive like never before, an open world waiting to be explored, one rendered with breathtaking splendor.  As Ghat,Building upon the daring visual design and gratifying first-person fisticuffs of the acclaimed original, Zeno Clash II is bigger, bolder, and better in every way.  Zenozoik comes alive like never before, an open world waiting to be explored, one rendered with breathtaking splendor.  As Ghat, players can fully and freely explore every natural and architectural wonder his world has to offer.  In addition to most of the characters, enemies, and items from the first game all of which return with dramatic visual enhancement--Ghat can also expect to encounter awe-inspiring new sights, jaw-dropping new creature designs, and wildly creative new weapons and items.… Expand"}, {"name": "Fable: The Journey", "details_link": "https://www.metacritic.com/game/xbox-360/fable-the-journey", "publisher": "Microsoft Game Studios", "release_date": "Oct  9 2012", "developers": ["Lionhead Studios"], "platforms": "Xbox 360", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 61, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/9/4ecc6d4f846a3a0c5942afde0dd9e8a3-98.jpg", "descriptions": "Utilize magic as a deadly weapon while defending the fate of Albion. Embark on a perilous quest to unmask the evil that threatens the land as you learn how to harness your plentiful and mysterious powers. Give up your easy-going nomadic life and become heroic as you help decide the fate ofUtilize magic as a deadly weapon while defending the fate of Albion. Embark on a perilous quest to unmask the evil that threatens the land as you learn how to harness your plentiful and mysterious powers. Give up your easy-going nomadic life and become heroic as you help decide the fate of Albion. Assume the role of Gabriel and defend Albion from the dark Corruption in this story chock full of Fable's signature wry humor. Fable: The Journey thrusts you in a role-playing experience with a host of familiar faces and foes. In this action-packed adventure you’ll form a lasting bond with your horse through an emotional journey.… Expand"}, {"name": "Naruto Shippuden: Ultimate Ninja Heroes 3", "details_link": "https://www.metacritic.com/game/psp/naruto-shippuden-ultimate-ninja-heroes-3", "publisher": "Namco Bandai Games", "release_date": "May 11 2010", "developers": ["CyberConnect2"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 61, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/b0dc230bf71f71b02945c1f3a3c0756d-98.jpg", "descriptions": "Naruto Shippuden: Ultimate Ninja Heroes 3 puts players’ fighting spirits to the test with intense and frantic battles while using one of more than 50 characters.  New characters include Young Kakashi and Obito Uchiha from the Naruto Shippuden special, Kakashi Chronicles. For the first timeNaruto Shippuden: Ultimate Ninja Heroes 3 puts players’ fighting spirits to the test with intense and frantic battles while using one of more than 50 characters.  New characters include Young Kakashi and Obito Uchiha from the Naruto Shippuden special, Kakashi Chronicles. For the first time in the series’ history, Naruto Shippuden: Ultimate Ninja Heroes 3 expands upon the series’ trademark fighting engine and updates it for four-player brawls. Team up with a partner to unleash a devastatingly powerful Jutsu team attack on opponents, or interrupt an enemy’s Ultimate Jutsu to help or hinder another player.  [Namco Bandai Games]… Expand"}, {"name": "Drakengard 3", "details_link": "https://www.metacritic.com/game/playstation-3/drakengard-3", "publisher": "Square Enix", "release_date": "May 20 2014", "developers": ["Access Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 61, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/3e883fcaafa17e4375aca1fe5d8db29b-98.jpg", "descriptions": "A prequel to the original game, Drakengard 3 transports players to a medieval world where 6 sisters tout special magical abilities as the Intoners. These sisters have brought peace to the earth with their power to manipulate magic through song. Harmony is disrupted, however, when the eldestA prequel to the original game, Drakengard 3 transports players to a medieval world where 6 sisters tout special magical abilities as the Intoners. These sisters have brought peace to the earth with their power to manipulate magic through song. Harmony is disrupted, however, when the eldest sister, Zero, attempts to kill her younger sisters with the help of her dragon companion, Mikhail. As the story progresses, players find themselves in a battle to unravel the mystery of Zero and learn her true intentions.… Expand"}, {"name": "Super Contra", "details_link": "https://www.metacritic.com/game/xbox-360/super-contra", "publisher": "Konami", "release_date": "Jul 25 2007", "developers": ["Konami"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Shooter", "Platformer", "Shooter", "Scrolling", "2D", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 61, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/1f0f8b183ae5eddac3e755aa1c2ee854-98.jpg", "descriptions": "The fight for freedom continues in Super Contra! The alien menace, Red Falcon, has fought back and it's up to Lance and Bill to stop them. Play multiplayer over Xbox Live with upgraded graphics and sound. Do you have what it takes to save the world again? Enjoy the authentic originalThe fight for freedom continues in Super Contra! The alien menace, Red Falcon, has fought back and it's up to Lance and Bill to stop them. Play multiplayer over Xbox Live with upgraded graphics and sound. Do you have what it takes to save the world again? Enjoy the authentic original gameplay of the arcade classic. Super Contra features two player co-op gameplay, just like the original. Play co-op on the same console or on Xbox LIVE. Communicate with your buddy by voice using the Xbox 360 headset. Xbox LIVE Leaderboard statistics are kept for Arcade (single player—high score, all time and weekly) and Xbox LIVE co-op (high score—all time and weekly). Score 12 achievements worth 200 gamer points with a range of simple, challenging, and hard achievements. [Microsoft]… Expand"}, {"name": "Naruto: Ninja Destiny", "details_link": "https://www.metacritic.com/game/ds/naruto-ninja-destiny", "publisher": "D3Publisher", "release_date": "Feb 26 2008", "developers": ["DreamFactory", "Takara Tomy"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 61, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/3aa89150efeccde04526c428e0c8e72a-98.jpg", "descriptions": "Players can now take their ninja battles on the road with NARUTO: Ninja Destiny, the first 3D head-to-head NARUTO fighter for the Nintendo DS. Any aspiring ninja can unleash powerful jutsu and take advantage of items to brawl his way to victory against 16 different characters. Dual-screenPlayers can now take their ninja battles on the road with NARUTO: Ninja Destiny, the first 3D head-to-head NARUTO fighter for the Nintendo DS. Any aspiring ninja can unleash powerful jutsu and take advantage of items to brawl his way to victory against 16 different characters. Dual-screen combat will allow fierce battles to unfold on the top screen while power ups can be strategically unleashed on the touch screen for fast, frenetic action. Core fighting game fans and casual gamers alike will find plenty to enjoy, thanks to a combo move system that is both intuitive to pick-up and challenging to master. Featuring scenes, characters, and storylines from up to the 140th episode of the hit animated television series currently airing on Cartoon Network, NARUTO: Ninja Destiny offers an intense single-player story and versus mode, along with wireless multiplayer combat. [Tomy]… Expand"}, {"name": "StarDrone Extreme", "details_link": "https://www.metacritic.com/game/playstation-vita/stardrone-extreme", "publisher": "Beatshapers", "release_date": "Feb 22 2012", "developers": ["Beatshapers"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "PlayStation Vita"], "genres": ["Action", "General", "General", "Arcade"], "meta_score": 61, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/9/674a585378a1f4c205fcafd53b6548b3-98.jpg", "descriptions": "StarDrone is a high-speed action thriller with a mix of arcade action, pinball, breakout, physics and collect-the-objects. It is created for PlayStation Move motion controller and supports HDTV and stereoscopic 3D. The game features over 50 levels of unparalleled gaming experience andStarDrone is a high-speed action thriller with a mix of arcade action, pinball, breakout, physics and collect-the-objects. It is created for PlayStation Move motion controller and supports HDTV and stereoscopic 3D. The game features over 50 levels of unparalleled gaming experience and extraordinary replay value.\rCause your attackers to crash with rapid speed while collecting gems and power-up enhancements. Overcome perilous hazards and elude zillions of enemies in an effort to complete each stage with a record score. With simple gesture controls and unique, intuitive game play mechanics, StarDrone is friendly to beginners, at the same time challenging enough to bring you back for more and more.… Expand"}, {"name": "Air Conflicts: Secret Wars", "details_link": "https://www.metacritic.com/game/xbox-360/air-conflicts-secret-wars", "publisher": "Kalypso", "release_date": "Sep 28 2011", "developers": ["Games Farm"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/90757b6f87c75db85d055ba7536fc192-98.jpg", "descriptions": "In Air Conflicts: Secret Wars players can relive the most famous battles of the First and Second World War right up close. The game provides plenty of variety, as players can fly 16 meticulously detailed and accurate aircraft in nearly 50 exciting missions in the seven campaigns. The missionIn Air Conflicts: Secret Wars players can relive the most famous battles of the First and Second World War right up close. The game provides plenty of variety, as players can fly 16 meticulously detailed and accurate aircraft in nearly 50 exciting missions in the seven campaigns. The mission tasks are diverse and range from air space clearance operations to the bombardment of targets on the ground, attacks on enemy convoys and reconnaissance, escort and patrol flights. After each successful mission players can upgrade their skills to enable them to control their aircraft more expertly, make their aircraft more robust and select better co-pilots. There are two control modes for the combat aircraft: the controls are simplified in arcade mode and simulation mode offers a realistic control system that is true to the original. Besides the solo campaigns, Air Conflicts: Secret Wars can also offer several multiplayer modes for up to eight players that can be played on a local network and over the Internet.… Expand"}, {"name": "PictoImage", "details_link": "https://www.metacritic.com/game/ds/pictoimage", "publisher": "Sega", "release_date": "Sep  2 2008", "developers": ["Sega", "Skonec"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/43d50071cf9fae1021bf96c59c3c8cdb-98.jpg", "descriptions": "Whether you draw stick figures or virtual masterpieces, jump into 8-player battles where the first team to guess the image being drawn wins. Pick from a huge word list, even add in some of your own words, and show off your favorite drawings in the gallery. Battle it Out in a Match of Wits:Whether you draw stick figures or virtual masterpieces, jump into 8-player battles where the first team to guess the image being drawn wins. Pick from a huge word list, even add in some of your own words, and show off your favorite drawings in the gallery. Battle it Out in a Match of Wits: Fun multiplayer modes pit you against your friends in an intense battle. Eight different modes ensure the party never stops. Challenge Your Friends with the Ad Hoc Download Feature: Party it up with PictoImage – you only need one copy of the game for eight friends to join in the fun. Enhance Your Skills with Practice Mode: Featuring tips and tricks to help improve your game. Over ninety different practice examples to choose from guarantees you'll be the quickest on the draw. Show Off Your Masterpieces with the Picture Gallery: Become a regular Picasso using the gallery feature. Save your drawings to show off to your friends. It’s like having a digital sketch book in your pocket. [Sega]… Expand"}, {"name": "Impossible Mission", "details_link": "https://www.metacritic.com/game/ds/impossible-mission", "publisher": "Codemasters", "release_date": "Nov 15 2007", "developers": ["System 3"], "platforms": ["Switch", "DS"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 61, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/4/53d1180d2f5c4dcd6abe871ee234ec81-98.jpg", "descriptions": "(Currently available in the UK/EU only)  The gamer takes the role of a secret agent attempting to stop evil genius Professor Elvin Atombender who has been tampering with National Security Computers. Players must penetrate Atombender's base, attempting to recover parts of the system password(Currently available in the UK/EU only)  The gamer takes the role of a secret agent attempting to stop evil genius Professor Elvin Atombender who has been tampering with National Security Computers. Players must penetrate Atombender's base, attempting to recover parts of the system password whilst avoiding deadly robots in a race against time. Whilst the game has been re-written from the ground up and features new graphics, 3D objects, new Sound Effects and Music, the gameplay remains loyal with the game layout changing for every new game. There are now three main characters to choose from plus a brand new tutorial mode. The player can now chose from three game modes, new, original and for the purist; a hybrid mode with the original gameplay using the updated graphics.… Expand"}, {"name": "Phoning Home", "details_link": "https://www.metacritic.com/game/pc/phoning-home", "publisher": "ION LANDS", "release_date": "Feb  7 2017", "developers": ["ION LANDS"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/1096f565c82f66f8e144a2abab52425b-98.jpg", "descriptions": "Phoning Home is an open-world game of exploration and survival set on a strange, alien planet. It tells the story of two robots – ION and ANI – and their life-defining journey."}, {"name": "World Gone Sour", "details_link": "https://www.metacritic.com/game/playstation-3/world-gone-sour", "publisher": "Capcom", "release_date": "Apr 10 2012", "developers": ["Playbrains"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/e3749b8d55671326f2975e2513099dcf-98.jpg", "descriptions": "Gamers will take on the miniature role of a lost Sour Patch Kid in a stylized human-sized world, guiding the hero through the sticky floors of a movie theater, across the counter of a concession stand, and other unique and oversized environments.  Joining forces with fellow lost Sour PatchGamers will take on the miniature role of a lost Sour Patch Kid in a stylized human-sized world, guiding the hero through the sticky floors of a movie theater, across the counter of a concession stand, and other unique and oversized environments.  Joining forces with fellow lost Sour Patch Kids, players will use a combination of jumps, twists and puzzle-solving to negotiate and overcome larger than life obstacles. Along the way, they will battle unusual candy enemies, escape from deranged humans, and face-off against bizarre creatures including one very angry wad of sticky chewing gum.… Expand"}, {"name": "Sniper Elite V2 Remastered", "details_link": "https://www.metacritic.com/game/pc/sniper-elite-v2-remastered", "publisher": "Rebellion", "release_date": "May 14 2019", "developers": ["Rebellion"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/92166f2975c19dc27ff2f66f1043c8e1-98.jpg", "descriptions": "You are elite sniper Karl Fairburne, parachuted into Berlin amidst the Germans' final stand. Your mission is to prevent Nazi V2 rocket technology falling into the hands of the Red Army. You must aid key scientists keen to defect to the US, and terminate those who stand in your way.StealthYou are elite sniper Karl Fairburne, parachuted into Berlin amidst the Germans' final stand. Your mission is to prevent Nazi V2 rocket technology falling into the hands of the Red Army. You must aid key scientists keen to defect to the US, and terminate those who stand in your way.Stealth is key as you find yourself trapped between two desperate armies in a race against time. Master authentic weaponry, stalk your target, fortify your position, set up the shot, and use your skill, patience and cunning to achieve the mission.All new graphics and rendering technology gives you improved ball busting X-ray kill camera detail. Witness the terrifying power of your bullet as it enters an enemy's body.With all DLC missions included, take the fate of the war into your own hands, and hunt the Fuhrer himself.… Expand"}, {"name": "Asterix & Obelix XXL 2", "details_link": "https://www.metacritic.com/game/switch/asterix-obelix-xxl-2", "publisher": "Microids", "release_date": "Nov 29 2018", "developers": ["Etranges Libellules"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/72e414b166caed319dfc46fc620b86eb-98.jpg", "descriptions": "More than 10 years following their last appearance on games consoles and PC, Asterix and Obelix are back and in better shape than ever! Asterix & Obelix XXL 2 is a superb blend of action and adventure for all ages, with a winning combination of comedy and brawling. But where has GetafixMore than 10 years following their last appearance on games consoles and PC, Asterix and Obelix are back and in better shape than ever! Asterix & Obelix XXL 2 is a superb blend of action and adventure for all ages, with a winning combination of comedy and brawling. But where has Getafix gone? The long-bearded druid has disappeared after betraying his own people for Julius Caesar! The Gaulish village is in uproar! They must find out the truth! Always ready for a fight, Asterix and Obelix are sent to Rome on a mission by their chief Vitalstatistix. There, they find a new amusement park - Las Vegum - built by the famous Roman emperor. To what end? What is Getafix hiding? … Expand"}, {"name": "Senran Kagura: Bon Appetit!", "details_link": "https://www.metacritic.com/game/playstation-vita/senran-kagura-bon-appetit!", "publisher": "XSEED Games", "release_date": "Nov 11 2014", "developers": ["Meteorise"], "platforms": "PlayStation Vita", "genres": ["Action", "Miscellaneous", "Rhythm", "Music"], "meta_score": 61, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/b77878b565d4f805c9c8ab3accba806e-98.jpg", "descriptions": "Unlike earlier installments in the Senran Kagura series, Bon Appetit! strays from its beat ‘em up roots and into new territory. Players’ reflexes, memory, and reaction times are all put to the test, with fast-paced rhythm/action gameplay combined with Japanese music. [Playstation.com]"}, {"name": "RemiLore: Lost Girl in the Lands of Lore", "details_link": "https://www.metacritic.com/game/switch/remilore-lost-girl-in-the-lands-of-lore", "publisher": "Nicalis", "release_date": "Feb 26 2019", "developers": ["Pixellore"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 61, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/6a2938d5963199022f06a620844cd01e-98.jpg", "descriptions": "RemiLore is a \"rogue-lite\" anime style adventure set in a colorful world where players hack-and-slash their enemies and cast devastating magic attacks using Lore's special powers."}, {"name": "Schrodinger's Cat and the Raiders of the Lost Quark", "details_link": "https://www.metacritic.com/game/playstation-4/schrodingers-cat-and-the-raiders-of-the-lost-quark", "publisher": "Team17", "release_date": "May 12 2015", "developers": ["Italic Pig"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/7737fcf45b75237bd10db5c1b4d5fdbd-98.jpg", "descriptions": "Schrödinger’s Cat is a frantic, wacky and colourful puzzle-laden platform game. Following an emergency, the Particle Zoo is overrun with hungry leptons, sticky-fingered gluons and massive bosons. Schrödinger’s Cat must sort out this chaos."}, {"name": "Game & Wario", "details_link": "https://www.metacritic.com/game/wii-u/game-wario", "publisher": "Nintendo", "release_date": "Jun 23 2013", "developers": ["Intelligent Systems"], "platforms": "Wii U", "num_players": "1-5 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 61, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/765128550b7e85f601fc32e1d04dc01b-98.jpg", "descriptions": "Wario and his Diamond City friends are back in action. Game & Wario (working title) features a collection of games that use only the Wii U GamePad controller. The games retain the original flair and character of the micro-games from the WarioWare series."}, {"name": "Marvel Trading Card Game", "details_link": "https://www.metacritic.com/game/ds/marvel-trading-card-game", "publisher": "Konami", "release_date": "May 22 2007", "developers": ["1st Playable Productions"], "platforms": ["PC", "DS"], "num_players": "1-2 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 61, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/0fdd02ba611832de1b9ee1109e5a5239-98.jpg", "descriptions": "Marvel Trading Card Game features Marvel's complete roster of characters. Utilizing the popular Vs. System Trading Card Game from Upper Deck Entertainment, players can learn the basics of the game as a super hero or super villain in the game’s single player campaign mode. [Konami]"}, {"name": "Catan", "details_link": "https://www.metacritic.com/game/switch/catan", "publisher": "Asmodee", "release_date": "Jun 20 2019", "developers": ["exozet"], "platforms": ["PC", "Switch"], "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 61, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/7/0d28bbe6e3ce707ff91baecc32519c62-98.jpg", "descriptions": "Trade, Build, Settle on Nintendo Switch. Discover or re-discover all the fun of the strategic & social gameplay of the million-seller board game!. The island of CATAN ™ is an uninhabited land rich in resources for you to settle. Unfortunately, your opponents have the same plans. BuildTrade, Build, Settle on Nintendo Switch. Discover or re-discover all the fun of the strategic & social gameplay of the million-seller board game!. The island of CATAN ™ is an uninhabited land rich in resources for you to settle. Unfortunately, your opponents have the same plans. Build settlements, roads and cities strategically to gain supremacy on CATAN! Some resources you have in abundance, other resources are scarce. Trade resources wisely & skillfully to stack the odds in your favor and become the greatest settler of CATAN. [Nintendo]… Expand"}, {"name": "The King of Fighters Collection: The Orochi Saga", "details_link": "https://www.metacritic.com/game/psp/the-king-of-fighters-collection-the-orochi-saga", "publisher": "SNK Playmore", "release_date": "Oct 28 2008", "developers": ["SNK Playmore"], "platforms": ["PlayStation 2", "PlayStation 4", "PlayStation 4", "PSP"], "num_players": "2 ", "genres": ["Action", "Miscellaneous", "Fighting", "Compilation", "2D"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/0530d8cd8b383292215b4e7dda6a84f1-98.jpg", "descriptions": "The first ever collection of THE KING OF FIGHTERS, consisting of 5 complete games. KOF 94, 95, 96, 97, 98. [SNK Playmore]"}, {"name": "Spider-Man 2", "details_link": "https://www.metacritic.com/game/ds/spider-man-2", "publisher": "Activision", "release_date": "Nov 16 2004", "developers": ["Vicarious Visions"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Platformer", "2D"], "meta_score": 61, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/cd90b62d2b6b31cc8b74c46a99a531af-98.jpg", "descriptions": "Spider-Man 2 for the Nintendo DS follows the storyline of the summer smash hit Spider-Man 2 over the course of over a dozen missions. In addition to running into the movie's main meanie Doctor Octopus, classic Spider-Man villains such as Mysterio also make an appearance. Spider-Man 2'sSpider-Man 2 for the Nintendo DS follows the storyline of the summer smash hit Spider-Man 2 over the course of over a dozen missions. In addition to running into the movie's main meanie Doctor Octopus, classic Spider-Man villains such as Mysterio also make an appearance. Spider-Man 2's graphics are an impressive mix of 2D and 3D. As Spider-Man swings and springs through the city, the levels rotate as they scroll, which really adds a great feeling of depth to the action. Some encounters switch the viewpoint to first person, such as the epic battle with Doc Ock on top of the runaway train. It's great fun to be able to recreate virtually all of Spider-Man's moves from the Nintendo GameCube game, from his punishing attacks to his trademark web swinging specialties. Spider-Man 2 does an excellent job of mixing traditional gameplay elements with new touch-screen action. In one boss battle, for example, you have to guide Spidey to computer terminals on the upper screen, then use the touch screen to solve puzzles by moving switches with your finger or stylus. [Nintendo]… Expand"}, {"name": "Samurai Warriors Chronicles", "details_link": "https://www.metacritic.com/game/3ds/samurai-warriors-chronicles", "publisher": "Koei Tecmo Games", "release_date": "Mar 27 2011", "developers": ["Omega Force"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 61, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/eadeb6bd77a931a0d2eb9367ac474f47-98.jpg", "descriptions": "Samurai Warriors Chronicles brings multiple branching storylines and a living 3D battlefield to the 3DS."}, {"name": "Zoids Wild: Blast Unleashed", "details_link": "https://www.metacritic.com/game/switch/zoids-wild-blast-unleashed", "publisher": "Outright Games", "release_date": "Oct 16 2020", "developers": ["Takara Tomy"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/e772218a11cfba636f624a98e6e53d27-98.jpg", "descriptions": "Unleash the wild mecha power and animal instinct of Zoids, in spectacular head-to-head battles on Nintendo Switch. With stunning graphics faithful to the Zoids Wild anime, and an intuitive 3D combat system that lets you chain incredible combos instinctively, Zoids Wild: Blast Unleashed isUnleash the wild mecha power and animal instinct of Zoids, in spectacular head-to-head battles on Nintendo Switch. With stunning graphics faithful to the Zoids Wild anime, and an intuitive 3D combat system that lets you chain incredible combos instinctively, Zoids Wild: Blast Unleashed is the ultimate showdown between your favorite pilots and their Zoids. But are Zoids merely weapons, or your partners? Your skill in combat will decide who wins between warring factions including Arashi’s Team Freedom and the power-hungry Team Dark Metal, in a new Zoids story. So choose your hero, step on to the battlefield, and fight to awaken the greatest bond between human and Zoid – then use the hidden power known as Wild Blast to defeat your rivals!\rWith a huge choice of characters, Zoids and game modes, Zoids Wild: Blast Unleashed takes mecha combat to the next level. Settle scores in 2-player battles, challenge yourself in Mission Mode and Battle Tactics Mode, and hone your skills in Practice Mode. Are you ready to command the strongest lifeforms in the world?… Expand"}, {"name": "The Descendant", "details_link": "https://www.metacritic.com/game/pc/the-descendant", "publisher": "Gaming Corps AB", "release_date": "Mar 24 2016", "developers": ["Gaming Corps AB"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/7afe866c7f0a901f0e8edaeded41aee9-98.jpg", "descriptions": "In THE DESCENDANT, the end of the world is just the beginning. With what remains of humanity protected in underground Ark facilities, your mission is to keep survivors alive, while discovering a far greater conspiracy buried within Ark-01."}, {"name": "Minecraft: Story Mode - Episode 2: Assembly Required", "details_link": "https://www.metacritic.com/game/xbox-one/minecraft-story-mode---episode-2-assembly-required", "publisher": "Telltale Games", "release_date": "Oct 27 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "Adventure", "General", "Point-and-Click", "Linear"], "meta_score": 61, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/b68c646055052c6173395ef83b8ccf45-98.jpg", "descriptions": "Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon,Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your crew stumbles on something dreadful. Terror is unleashed, and your only hope is to track down the “Order of the Stone”, a fabled group of adventurers who slew the legendary Ender Dragon. But where are they? In a race against time, you will travel across the over-world, through the Nether, to The End, and beyond. [Telltale Games]… Expand"}, {"name": "Happy Wars", "details_link": "https://www.metacritic.com/game/xbox-360/happy-wars", "publisher": "Microsoft Game Studios", "release_date": "Oct 12 2012", "developers": ["Toylogic Inc.", "Toylogic"], "platforms": ["PC", "Xbox One", "Xbox 360"], "genres": ["Action", "General", "General"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/c5110ca5b72911617fa0109361445308-98.jpg", "descriptions": "Happy Wars is a casual multi-player action game in which a large number of players control comical characters in fun battles. In a variety of fantasy battlefields including grasslands, a dark world, and the ocean floor, players can control any of 3 types of characters: warrior, mage, andHappy Wars is a casual multi-player action game in which a large number of players control comical characters in fun battles. In a variety of fantasy battlefields including grasslands, a dark world, and the ocean floor, players can control any of 3 types of characters: warrior, mage, and cleric. Cooperate with friends to enjoy action on the grand scale, casting magic spells, attacking castles, and so on. For off-line fun, the player can take on missions in the solo campaign mode.… Expand"}, {"name": "SBK Generations", "details_link": "https://www.metacritic.com/game/xbox-360/sbk-generations", "publisher": "Black Bean Games", "release_date": "Jun  1 2012", "developers": ["MileStone Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/a37f6767092628fcb00969d411f9790b-98.jpg", "descriptions": "Play through the last 4 seasons of the SBK world championships, including the new 2012 season to become world champion or test your skills in the new SBK Experience mode. With SBK Generations, Milestone has developed what they consider to be the definitive motorcycle game, filled with overPlay through the last 4 seasons of the SBK world championships, including the new 2012 season to become world champion or test your skills in the new SBK Experience mode. With SBK Generations, Milestone has developed what they consider to be the definitive motorcycle game, filled with over 220+ riders, 60 bike models, 140+ teams, 17 circuits and up to 16 player online multi-player.… Expand"}, {"name": "Ben 10 Alien Force: Vilgax Attacks", "details_link": "https://www.metacritic.com/game/xbox-360/ben-10-alien-force-vilgax-attacks", "publisher": "D3Publisher", "release_date": "Oct 27 2009", "developers": ["Papaya Studios", "Papaya Studio"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 61, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/5d2b5988f637242fbe7679374a3493c9-98.jpg", "descriptions": "In Ben 10 Alien Force - Vilgax Attacks, players take control of Ben and 10 of his most popular alien forms: Echo Echo, Goop, Brain Storm, Chromastone, Big Chill, Humungousaur, Spidermonkey, Swampfire, Jet Ray, and Cannonbolt to manipulate fire, harness electricity, freeze enemies and more.In Ben 10 Alien Force - Vilgax Attacks, players take control of Ben and 10 of his most popular alien forms: Echo Echo, Goop, Brain Storm, Chromastone, Big Chill, Humungousaur, Spidermonkey, Swampfire, Jet Ray, and Cannonbolt to manipulate fire, harness electricity, freeze enemies and more. Players will also adventure as alien form Upchuck exclusively in the Nintendo DS version for additional powers to command and explore. will journey to exciting never-before-seen alien home planets on Ben’s first interactive intergalactic adventure to battle against a roster of Ben’s most infamous villains and foes, including his ultimate nemesis, Vilgax. Offering a solid blend of combat, puzzle solving and platform gameplay, Ben 10 Alien Force - Vilgax Attacks provides hours of gameplay for players of all skill levels. [D3Publisher]… Expand"}, {"name": "Watchmen: The End Is Nigh", "details_link": "https://www.metacritic.com/game/pc/watchmen-the-end-is-nigh", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar  4 2009", "developers": ["Deadline Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/a78a3154483520467b1931021f79eb24-98.jpg", "descriptions": "[Downloadable Game]  The episodic videogame based on the Watchmen film is a mature action-brawler, which delves into the past of characters from the film and adds new challenges and rivalries for players. The game provides gamers with visceral superhero combat as urban vigilantes Rorschach[Downloadable Game]  The episodic videogame based on the Watchmen film is a mature action-brawler, which delves into the past of characters from the film and adds new challenges and rivalries for players. The game provides gamers with visceral superhero combat as urban vigilantes Rorschach and Nite Owl. A complex, multi-layered mystery adventure, the film \"Watchmen\" is set in an 1985 America in which costumed superheroes are part of the fabric of everyday society, and the \"Doomsday Clock\" – which charts the USA's tension with the Soviet Union – is permanently set at five minutes to midnight. When one of his former colleagues is murdered, the washed up but no less determined masked vigilante Rorschach sets out to uncover a plot to kill and discredit all past and present superheroes. As he reconnects with his former crime-fighting legion – a ragtag group of retired superheroes, only one of whom has true powers – Rorschach glimpses a wide-ranging and disturbing conspiracy with links to their shared past and catastrophic consequences for the future. Their mission is to watch over humanity . . . but who is watching the Watchmen? [Warner Bros. Interactive]… Expand"}, {"name": "MX vs. ATV Untamed", "details_link": "https://www.metacritic.com/game/ds/mx-vs-atv-untamed", "publisher": "THQ", "release_date": "Dec 17 2007", "developers": ["Rainbow Studios"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/1f082c93ec904cef3413fa141cdfb633-98.jpg", "descriptions": "MX vs ATV kicks it up a notch and shifts into high gear as the best selling offroad franchise makes its debut on the Nintendo DS. MX vs ATV’s legendary Rhythm Racing lets players pre-load into massive jumps and clutch through hairpin turns at full speed all while retaining the smooth andMX vs ATV kicks it up a notch and shifts into high gear as the best selling offroad franchise makes its debut on the Nintendo DS. MX vs ATV’s legendary Rhythm Racing lets players pre-load into massive jumps and clutch through hairpin turns at full speed all while retaining the smooth and authentic feel not found in any other game. Attempt to own the offroad by dominating Race and Stunt Challenge events. Ten DS-exclusive Supercross tracks provide the perfect proving ground for the MX vs ATV rivalry. With two different MX and ATV vehicles to take control of, the competition is fierce in 3 massive Supercross stadiums. Up the ante by completing the MX vs ATV Championship, unlocking playable Sand Rail and Golf Buggy vehicles. Players can showcase their freestyle skills with combo extenders and over 25 airborne and ground stunts. Make sure to stick the landing, though; riders who bail will find the judges can be harsh on bad landings. [THQ]… Expand"}, {"name": "Ape Escape: Pumped & Primed", "details_link": "https://www.metacritic.com/game/playstation-2/ape-escape-pumped-primed", "publisher": "Ubisoft", "release_date": "Oct 20 2004", "developers": ["SCEI"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/81dddbccdf79bcf7ba26a0cd9455b82c-98.jpg", "descriptions": "(Also known as \"Gacha Mecha Stadium Saruvatore\" or \"Ape Escape: Gacha Mecha Athlete\" in Japan) Original characters of the Ape Escape series ? Spike, Natalie, Casi, Jake and the Professor ? have decided to enter the High Tech Tournament! Set in a computer-generated world, odd things start(Also known as \"Gacha Mecha Stadium Saruvatore\" or \"Ape Escape: Gacha Mecha Athlete\" in Japan) Original characters of the Ape Escape series ? Spike, Natalie, Casi, Jake and the Professor ? have decided to enter the High Tech Tournament! Set in a computer-generated world, odd things start happening when mysterious monkeys start to appear, along with archenemy Specter from Ape Escape 2. Trapped in the world by a new villain, our heroes must fight for their survival. Game features include: Two Game Modes: Play with up to two players in Story mode, consisting of 44 competing levels and eight boss battles, or Versus mode with 21 pre-made tournaments for up to four players. Additionally, players can create their own tournaments from the 28 stages in story mode. A Mix of Classic and New Characters from Ape Escape: Play original characters such as Natalie, Spike, the Professor or Jake. New characters include Pipotron, Helga and a mysterious new boss. Beat the Competition with a Wide Selection of Gadgets: Each character will have their own set of unique gadgets, including the Stunclub, Dragonfly, Slingshot, RC Car, Dash Hoop and WaterMech. More than 400 Unlockable Items: Special gadgets, clothes, fan emails, special summon abilities and movies. [Sony Computer Entertainment]… Expand"}, {"name": "Catwoman", "details_link": "https://www.metacritic.com/game/game-boy-advance/catwoman", "publisher": "EA Games", "release_date": "Jul 20 2004", "developers": ["Magic Pockets"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/c632a4c5d16ec79d56a792ea3030189e-98.jpg", "descriptions": "A classic story of betrayal and revenge unravels in Catwoman, which is based on the film from Warner Bros. Pictures. You'll control Catwoman, a woman brought back to life by a rare Egyptian cat, as she sets out to discover the truth about herself and her murderer. With Catwoman's catlikeA classic story of betrayal and revenge unravels in Catwoman, which is based on the film from Warner Bros. Pictures. You'll control Catwoman, a woman brought back to life by a rare Egyptian cat, as she sets out to discover the truth about herself and her murderer. With Catwoman's catlike skills, you can leap across roofs, run up walls, pounce on prey, and avoid enemy bullets. In addition, your can use her whip to swing through the air and use the interactive environments to knock your foes unconscious. … Expand"}, {"name": "Lifeline", "details_link": "https://www.metacritic.com/game/playstation-2/lifeline", "publisher": "Konami", "release_date": "Mar  2 2004", "developers": ["SCEJ"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 61, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/dd17709d40084344ecf4375b5efe12c7-98.jpg", "descriptions": "Put down the controller and speak up! In the first-ever voice activated action-adventure game, players will work together with the main character Rio by verbally guiding her through this heart-pounding adventure. Compatible with any USB headset peripheral, LifeLine's unprecedented technologyPut down the controller and speak up! In the first-ever voice activated action-adventure game, players will work together with the main character Rio by verbally guiding her through this heart-pounding adventure. Compatible with any USB headset peripheral, LifeLine's unprecedented technology features voice-recognition of over 5,000 words and 100,000 phrases such as \"Shoot!\", \"Run!\" and \"Dodge and reload!\" Compatible with any USB headset. [Konami]… Expand"}, {"name": "Spawn: Armageddon", "details_link": "https://www.metacritic.com/game/gamecube/spawn-armageddon", "publisher": "Namco", "release_date": "Nov 21 2003", "developers": ["Point of View"], "platforms": ["PlayStation 2", "GameCube"], "genres": ["Action Adventure", "Fantasy"], "meta_score": 61, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/a47e2ba350a33a4c8c68e877f35ff764-98.jpg", "descriptions": "Spawn: Armageddon, based on Todd McFarlane's creation, is a 3-D action adventure that gives players access to all of Spawn's distinctive abilities, superhuman strength, arsenal of weaponry, Hell Powers, and, of course, his living symbiotic costume.  Caught between the battle of Good vs.Spawn: Armageddon, based on Todd McFarlane's creation, is a 3-D action adventure that gives players access to all of Spawn's distinctive abilities, superhuman strength, arsenal of weaponry, Hell Powers, and, of course, his living symbiotic costume.  Caught between the battle of Good vs. Evil, he struggles to break free from the controlling influences of Heaven and Hell.… Expand"}, {"name": "Sherlock Holmes: The Mystery of the Mummy", "details_link": "https://www.metacritic.com/game/pc/sherlock-holmes-the-mystery-of-the-mummy", "publisher": "DreamCatcher Interactive", "release_date": "Dec 29 2002", "developers": ["Frogwares"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "First-Person", "Modern", "Modern"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/e343823a7e4de4b61bc4f3684ebe1eef-98.jpg", "descriptions": "Become Sherlock Holmes as you embark on a remarkable adventure. Investigate a mysterious case, full of suspense, of the disappearance of a famous archaeologist and a valuable Egyptian Mummy, in turn-of-the-century England. What begins as a simple case quickly becomes a web of intrigue,Become Sherlock Holmes as you embark on a remarkable adventure. Investigate a mysterious case, full of suspense, of the disappearance of a famous archaeologist and a valuable Egyptian Mummy, in turn-of-the-century England. What begins as a simple case quickly becomes a web of intrigue, robbery, priceless artifacts, and potentially, a murder. Prepare yourself for a great adventure. Elementary... I think not.  [DreamCatcher]… Expand"}, {"name": "Turok: Evolution", "details_link": "https://www.metacritic.com/game/playstation-2/turok-evolution", "publisher": "Acclaim", "release_date": "Aug 31 2002", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/7d734db3c20fc4575bd6518e5a54a750-98.jpg", "descriptions": "Turok: Evolution is a prequel that takes us back to the origins of the Turok lineage. In the beginning of the game, we see our hero, Tal'Set, fighting his nemesis Captain Tobias Bruckner in 1886 Texas. During the battle, a rift between their world and the Lost Lands opens and Tal'Set isTurok: Evolution is a prequel that takes us back to the origins of the Turok lineage. In the beginning of the game, we see our hero, Tal'Set, fighting his nemesis Captain Tobias Bruckner in 1886 Texas. During the battle, a rift between their world and the Lost Lands opens and Tal'Set is sucked into it. Tal'Set, injured and near death, is nursed back to health by the natives of the River Village, a colony in hiding from the Lost Land's greatest threat: the Lord Tyrannus and his reptilian hordes. Tal'Set becomes a reluctant participant in the brutal war that is raging in the Lost Land. Bent on a \"holy mission\" to purify the land through slaughter and misery, Tyrannus appoints a new general to his armies, and Tal'Set discovers to his horror that it is Bruckner, who was also swept into the Lost Lands through the rift. [Acclaim]… Expand"}, {"name": "Road to India: Between Hell and Nirvana", "details_link": "https://www.metacritic.com/game/pc/road-to-india-between-hell-and-nirvana", "publisher": "Microids", "release_date": "Sep 16 2001", "developers": ["Microids"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 61, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/1/1c2d24f065b6c54207775308d3911758-98.jpg", "descriptions": "When Fred Reynolds left his fiancée at the airport, he thought that she would be visiting her relatives in New Delhi for a few weeks. He never expected her to be kidnapped by Thugs: Kali worshippers bent on human sacrifices and overthrow of the Indian government. He must now make his way inWhen Fred Reynolds left his fiancée at the airport, he thought that she would be visiting her relatives in New Delhi for a few weeks. He never expected her to be kidnapped by Thugs: Kali worshippers bent on human sacrifices and overthrow of the Indian government. He must now make his way in a foreign land to find her and stop the evil cult before it is too late in this puzzle-driven adventure game.  [Microids]… Expand"}, {"name": "Gangsters 2: Vendetta", "details_link": "https://www.metacritic.com/game/pc/gangsters-2-vendetta", "publisher": "Eidos Interactive", "release_date": "Jun  5 2001", "developers": ["Hothouse Creations"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "General", "General"], "meta_score": 61, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/5d8849d537ffb27a4ac09b1a7c1ee52f-98.jpg", "descriptions": "As small-time mobster Joey Bane, you have the opportunity to avenge your father's death and rise to power by hiring a bunch of gangster henchmen with specialized skills such as bombing, kidnapping, and running illegal businesses to do your dirty work."}, {"name": "I Am Bread", "details_link": "https://www.metacritic.com/game/pc/i-am-bread", "publisher": "Bossa Studios", "release_date": "Apr  9 2015", "developers": ["Bossa Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "Platformer", "3D"], "meta_score": 60, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/5/93a9f2192f121648844306fac0a4947d-98.jpg", "descriptions": "The story of a solitary slice of bread's epic and emotional journey as it embarks upon a quest to become toasted."}, {"name": "Kinect Sports Rivals", "details_link": "https://www.metacritic.com/game/xbox-one/kinect-sports-rivals", "publisher": "Microsoft Game Studios", "release_date": "Apr  8 2014", "developers": ["Microsoft Game Studios"], "platforms": "Xbox One", "num_players": "Up to 4 ", "genres": ["General", "Sports", "General"], "meta_score": 60, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/4e6eb05ec7bdd2fe1416f7251e9bd10b-98.jpg", "descriptions": "Kinect Sports Rivals captures your likeness as a champion and plunges you into a world of sports competition. Take on your friends, rivals and the entire world. Xbox Ones high-res camera instantly scans and creates a detailed, digital you, then drops your champion into the rich world ofKinect Sports Rivals captures your likeness as a champion and plunges you into a world of sports competition. Take on your friends, rivals and the entire world. Xbox Ones high-res camera instantly scans and creates a detailed, digital you, then drops your champion into the rich world of intense sports. With tracking not only of limbs, but fingers, hands, even facial movements and expressions, Kinect Sports RIVALS creates responsive gameplay.… Expand"}, {"name": "Mass Effect 3: Omega", "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-3-omega", "publisher": "Electronic Arts", "release_date": "Nov 26 2012", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 60, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/c35b89047ace62d153e8e6770e5eae2a-98.jpg", "descriptions": "An unsteady alliance between Shepard and Aria initiates a deadly game of cat-and-mouse to wrest Omega from Cerberus’s control. Forced to rely on Aria’s special knowledge of the station and faced with her lust for revenge, how far will you go to retake Omega?"}, {"name": "Pacific Storm: Allies", "details_link": "https://www.metacritic.com/game/pc/pacific-storm-allies", "publisher": "cdv Software", "release_date": "Jan 28 2008", "developers": ["Lesta Studio"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/41a159b2a903c9c44648715587c41e6c-98.jpg", "descriptions": "Pacific Storm: Allies offers completely new experiences for those who played and liked Pacific Storm and the most intense hours of gameplay for those who didn't play the original game. Playing either for the United States, Imperial Japan, or a new playable nation - the UK, you walk through aPacific Storm: Allies offers completely new experiences for those who played and liked Pacific Storm and the most intense hours of gameplay for those who didn't play the original game. Playing either for the United States, Imperial Japan, or a new playable nation - the UK, you walk through a dramatic sequence of large-scale naval and air military operations. The perfect mix of genres remains on this standalone better than ever. Develop weaponry and technologies to improve your units, move your fleet and deploy it in the battlefield and send them to the combat as a general or become a pilot and control one of the planes or ships directly! Enjoy the exceptional depth and scale of the strategic mode, superior authenticity of the tactical mode and exciting dynamics of the simulator. New units to construct, new historical locations to visit, diplomatic system that allows you to form alliances and a brand new version of the engine that brings better graphics than ever... The improved multiplayer system will push the experience of playing with people over internet or under the same local net to the top of the realism. Every scenario, map, and element has been created based on historical archives. [Buka Entertainment]… Expand"}, {"name": "Yoshi Topsy-Turvy", "details_link": "https://www.metacritic.com/game/game-boy-advance/yoshi-topsy-turvy", "publisher": "Nintendo", "release_date": "Jun 13 2005", "developers": ["Artoon"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/86bae29bd8c1618b32501de9ac0bee48-98.jpg", "descriptions": "Get ready for a unique game experience that challenges you to tilt Yoshi through topsy-turvy worlds. By tilting the Game Boy Advance SP, you'll turn the environment around Yoshi to knock over enemies, swing pendulums, and help him run up walls and leap pits. Yoshi's Island is trapped in aGet ready for a unique game experience that challenges you to tilt Yoshi through topsy-turvy worlds. By tilting the Game Boy Advance SP, you'll turn the environment around Yoshi to knock over enemies, swing pendulums, and help him run up walls and leap pits. Yoshi's Island is trapped in a storybook, and only by meeting the challenges of each chapter will you succeed.… Expand"}, {"name": "Wii Play: Motion", "details_link": "https://www.metacritic.com/game/wii/wii-play-motion", "publisher": "Nintendo", "release_date": "Jun 13 2011", "developers": ["Nintendo", "Good-Feel"], "platforms": "Wii", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/4870052ad1da4359196c269b9138df18-98.jpg", "descriptions": "With the June 13 launch of Wii Play: Motion, Wii owners will be twisting, turning and enjoying themselves like never before, whether they're newcomers to the console or have already discovered the fun of the popular Wii Play game. From catching a gust of wind by tilting an umbrella toWith the June 13 launch of Wii Play: Motion, Wii owners will be twisting, turning and enjoying themselves like never before, whether they're newcomers to the console or have already discovered the fun of the popular Wii Play game. From catching a gust of wind by tilting an umbrella to fending off garden pests by swinging a mallet, each of the 12 included games will have players smiling wide as they use their Wii Remote Plus controller (or Wii Remote with Wii MotionPlus™ accessory) in a variety of interesting, sometimes unexpected ways. Wii Play: Motion comes packaged with a Wii Remote Plus controller – which combines the original Wii Remote controller with the precision of Wii MotionPlus – to deliver great value, precise motion control and immersive social fun that anyone in the household can pick up and instantly enjoy.… Expand"}, {"name": "Mega Man Star Force: Dragon", "details_link": "https://www.metacritic.com/game/ds/mega-man-star-force-dragon", "publisher": "Capcom", "release_date": "Aug  7 2007", "developers": ["Capcom"], "platforms": "DS", "num_players": "6  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 60, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/1fd2c6a00b4448c8380a2f96a5cabc61-98.jpg", "descriptions": "Mega Man Star Force introduces a new lead character, a boy named Subaru Hoshikawa, whose astronaut father has disappeared after a mysterious incident at the satellite station. Fond memories of spending time with his father have inspired Subaru's interests in the stars and what lies beyond.Mega Man Star Force introduces a new lead character, a boy named Subaru Hoshikawa, whose astronaut father has disappeared after a mysterious incident at the satellite station. Fond memories of spending time with his father have inspired Subaru's interests in the stars and what lies beyond. One day, Subaru heads to the observation deck and puts on a pair of \"visualizer\" glasses that had belonged to his father. These allow the wearer to see all the electric connections that exist between spaces. When he puts on these special goggles, a specific wave is triggered, summoning the presence of a mysterious alien life form named Warlock who had escaped from the planet FM. Dangerous creatures from that planet have come to attack Earth, so they must join together in order to defeat these menacing forces. Combining with Warlock enables Subaru to transform into Mega Man and enter the Wave Road. Features 2wo coexisting worlds – players can navigate the real world as Subaru and transform into Mega Man to travel across Wave Road. Three stellar versions call upon the power of the elements to offer distinct advantages: Pegasus – based on the water element, Ice Pegasus can instantly freeze an opponent with its special Ice Slash; Leo – turning up the heat, Fire Leo uses a special Flame Burner attack that can incinerate enemies in its path; Dragon – the ferocious Green Dragon draws upon the power of wood with a Wood Shot move that fires a cluster of razor sharp leaves to slash enemies to bits.… Expand"}, {"name": "Bratz: Rock Angelz", "details_link": "https://www.metacritic.com/game/playstation-2/bratz-rock-angelz", "publisher": "THQ", "release_date": "Oct  6 2005", "developers": ["Blitz Games"], "platforms": ["PC", "PlayStation 2"], "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/9a83e070a2af23a84dd98ea28d4e5f8d-98.jpg", "descriptions": "Bratz Rock Angelz empowers fans of the popular line of fashion dolls to explore their own \"passion for fashion\" in a unique interactive adventure game. Fans will be immersed in the Bratz World as they embark on a series of voyages in search of intriguing stories to inspire and create theirBratz Rock Angelz empowers fans of the popular line of fashion dolls to explore their own \"passion for fashion\" in a unique interactive adventure game. Fans will be immersed in the Bratz World as they embark on a series of voyages in search of intriguing stories to inspire and create their very own fashion magazine. Play as any of the four Bratz Girls while exploring different adventures. Customize all of the Bratz girls hair, make-up, and outfits as you shop for the latest fashions. Travel to exotic International locations to investigate the hottest stories to create your own fashion magazine. Chat face-to-face with the Bratz characters in their own world. [Nintendo]… Expand"}, {"name": "Tempest: Pirate Action RPG", "details_link": "https://www.metacritic.com/game/pc/tempest-pirate-action-rpg", "publisher": "HeroCraft", "release_date": "Aug 22 2016", "developers": ["Lion's Shade"], "platforms": ["iPhone/iPad", "PlayStation 4", "PC"], "genres": ["Simulation", "Marine", "Combat"], "meta_score": 60, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/0/cec529a25f2ac74bdac0b1454da76b95-98.jpg", "descriptions": "Hey Captain - Now that you’ve got the Jolly Roger fluttering in the wind over your ship, you’re ready to rove the seas, take on merchant ships loaded with booty and storm formidable fortresses. Set sail and get your hands on all those legendary treasures that are just waiting for the picking."}, {"name": "ER (2005)", "details_link": "https://www.metacritic.com/game/pc/er-2005", "publisher": "Legacy Interactive", "release_date": "May 31 2005", "developers": ["Legacy Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b42494fc7fe2e11fcbbdac52e34c83d1-98.jpg", "descriptions": "The ER game combines the best of the popular strategy/role-playing genre with the top-rated television franchise, ER. Players of the game will get to interact with their favorite stars in dramatic and engaging storylines reminiscent of the TV show. In the ER computer game, the player joinsThe ER game combines the best of the popular strategy/role-playing genre with the top-rated television franchise, ER. Players of the game will get to interact with their favorite stars in dramatic and engaging storylines reminiscent of the TV show. In the ER computer game, the player joins the cast of the TV show as a newly hired intern and handles a steady flow of patients with health issues ranging from minor cuts and bruises to serious injuries sustained from accidents and violence. Through it all, the player will have to navigate goals, dodge sticky politics, deal with gut-wrenching ethical dilemmas, and engage in steamy romances. With perseverance, the player will gain prestige among peers and supervisors and ascend the ranks of Chicago's County General Hospital. [Legacy Interactive]… Expand"}, {"name": "Moon Diver", "details_link": "https://www.metacritic.com/game/playstation-3/moon-diver", "publisher": "Square Enix", "release_date": "Mar 29 2011", "developers": ["FeelPlus"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/6850504871899cf8a657dc2b35c86f65-98.jpg", "descriptions": "At the dawn of the 22nd century, an evil power brought inanimate objects to life, and they turned on humanity. Bridges, cars, cups-the whole of humanity's creations turned on their makers. But hidden amongst humanity's survivors, an elite unit of specially trained ninja known as MoondiversAt the dawn of the 22nd century, an evil power brought inanimate objects to life, and they turned on humanity. Bridges, cars, cups-the whole of humanity's creations turned on their makers. But hidden amongst humanity's survivors, an elite unit of specially trained ninja known as Moondivers has been lying in wait for orders to reclaim the planet. Today, those orders arrived.… Expand"}, {"name": "Aka", "details_link": "https://www.metacritic.com/game/switch/aka", "publisher": "Neowiz", "release_date": "Dec 14 2022", "developers": ["Namra games", "Cosmo Gatto"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "3D", "Virtual", "Third-Person", "Virtual Life"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/4373982a5ca41591893246d15cd83b25-98.jpg", "descriptions": "Find inner peace in a top-down, small, open-world game.Make things better by growing plants, help others, craft and discover a carefully handcrafted island...but demons from your past might come back to remind you what you want to forget.\n\n***\nExplore different biomes, from cloud forestsFind inner peace in a top-down, small, open-world game.Make things better by growing plants, help others, craft and discover a carefully handcrafted island...but demons from your past might come back to remind you what you want to forget.***Explore different biomes, from cloud forests to snowy mountains.Connect with the island inhabitants.A farming experience inspired by permaculture.Gather resources to craft houses, musical instruments, clothes, etc.Cook and prepare medicines.Relax and the back of a giant monster, looking at the clouds or in hot springs under a cherry blossom tree.But your hardest task will be to find a way to talk to these poor souls who are wandering on the island. These war victims are waiting for your help.… Expand"}, {"name": "Stranger of Paradise: Final Fantasy Origin", "details_link": "https://www.metacritic.com/game/pc/stranger-of-paradise-final-fantasy-origin", "publisher": "Square Enix", "release_date": "Mar 18 2022", "developers": ["Team Ninja"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 3 ", "genres": ["Action Adventure", "Linear", "Role-Playing", "Action RPG"], "meta_score": 60, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/446632dd8a0a10f2ce3d76387918a599-98.jpg", "descriptions": "Players of the STRANGER OF PARADISE FINAL FANTASY ORIGIN TRIAL VERSION can explore this dark fantasy world as they battle an array of iconic monsters from the FINAL FANTASY series, using powerful spells and abilities from a sample of jobs including warrior, dragoon and black mage."}, {"name": "Super Cane Magic ZERO", "details_link": "https://www.metacritic.com/game/switch/super-cane-magic-zero", "publisher": "IntraGames", "release_date": "May 30 2019", "developers": ["STUDIO EVIL"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/a5cfcd9c09c02a83c5e4eaefce0558ae-98.jpg", "descriptions": "The planetoid of WOTF is in turmoil since magic went wild by the powers of the magic dog AAAH! Unlikely heroes fell from the sky and are guided by a giant talking strawberry cake to save the world. But first, they must find the six witches and wizards of the Academy of Poptarts... ExploreThe planetoid of WOTF is in turmoil since magic went wild by the powers of the magic dog AAAH! Unlikely heroes fell from the sky and are guided by a giant talking strawberry cake to save the world. But first, they must find the six witches and wizards of the Academy of Poptarts... Explore more than 50 levels full of secrets, monsters, and treasures and save the world from chaos. Embark in the weirdest video game adventure to save AAAH!… Expand"}, {"name": "BRAWL", "details_link": "https://www.metacritic.com/game/switch/brawl", "publisher": "QubicGames", "release_date": "Jan 12 2018", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Arcade"], "meta_score": 60, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/2/613bf280b19d02d1b83c7051d90eff6f-98.jpg", "descriptions": "Are you ready to face your darkest fears... with a bomb in your hand?    Step into the darkness of The Emporium with 8 unique characters, each with a rich back story and a surprising plot-twist. Fight your way to the end using different play styles, from pure brutality as a Wrestler toAre you ready to face your darkest fears... with a bomb in your hand?    Step into the darkness of The Emporium with 8 unique characters, each with a rich back story and a surprising plot-twist. Fight your way to the end using different play styles, from pure brutality as a Wrestler to hiding in shadows as an elusive Thief.    Play with up to 4 players on Multiplayer Mode with 20+ interactive maps. Fight against your opponents and environmental hazards in 5 game modes, featuring Sumo, Color Domination and Classic Brawl. Team up with a friend and take a challenge on 3 different Challenge Modes. Use powerups to upgrade your bombs and be even more deadly than usual.… Expand"}, {"name": "Trapt", "details_link": "https://www.metacritic.com/game/playstation-2/trapt", "publisher": "Tecmo", "release_date": "Nov  1 2005", "developers": ["Paon Corporation"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 60, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/b822a6b6afcf572928ad50e7aac9f6a0-98.jpg", "descriptions": "(Also known as \"Kagero 2: Dark Illusion\") Set in old Europe, the player takes on the role of the seductive Queen Allura, who after being framed for her father's murder, is forced to flee the castle to take refuge from those that are out to kill her. Allura, along with her maid Rachel, escape(Also known as \"Kagero 2: Dark Illusion\") Set in old Europe, the player takes on the role of the seductive Queen Allura, who after being framed for her father's murder, is forced to flee the castle to take refuge from those that are out to kill her. Allura, along with her maid Rachel, escape to the Black Forest, where an evil spell from the devil transforms Allura into a trap master, an evil temptress that uses deadly traps to avenge her enemies. Returning to the castle with the devil as her guide and on a mission of vengence, Allura uses her wicked strategy and skill to set up gruesome medieval traps to lure her enemies in and then destroy them. The game is equal parts action and strategy that will have gamers thinking in the most evil and manipulative ways to create the ultimate combination of traps in order to distinguish their enemies. Play as the sexy and beguiling Queen Alllura who looks so sweet, but is wickedly calculating and cursed by the devil.Full-View Map: Set up your traps via a full-view map of the castle. A Variety of Modes and Bonus Content: Play in Story Mode or Survival Mode, plus enjoy an even deeper story when you play in the Bonus Story Mode. [Tecmo]… Expand"}, {"name": "Namco Museum 50th Anniversary", "details_link": "https://www.metacritic.com/game/gamecube/namco-museum-50th-anniversary", "publisher": "Namco", "release_date": "Aug 30 2005", "developers": ["Backbone Vancouver"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 60, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/c3576c7d0e02a3cfa2fecb40d5ccfdbe-98.jpg", "descriptions": "Namco celebrates their 50th anniversary by packaging 14 of their best classic arcade games onto one disc. The interface lets you browse a virtual game hall with each game shown in its original arcade cabinet. The games included in this collection are: Pac-Man, Ms. Pac-Man, Galaga, Galaxian,Namco celebrates their 50th anniversary by packaging 14 of their best classic arcade games onto one disc. The interface lets you browse a virtual game hall with each game shown in its original arcade cabinet. The games included in this collection are: Pac-Man, Ms. Pac-Man, Galaga, Galaxian, Dig Dug, Pole Position, Pole Position II, Rolling Thunder, Rally X, Bosconian, Dragon Spirit, Sky Kid, Xevious, and Mappy.… Expand"}, {"name": "Beyond Eyes", "details_link": "https://www.metacritic.com/game/pc/beyond-eyes", "publisher": "Team17", "release_date": "Aug  4 2015", "developers": ["tiger & squid"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 60, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/d2a0d5389bfc8199d46c29c51603f1a0-98.jpg", "descriptions": "Beyond eyes shows you the imaginative world of Rae,  a  10 year-old girl, as she ventures outside her familiar surroundings in search of a fat cat named Nani. Rae isn't like most other girls. She lost her eyesight in an accident with fireworks when she was just a toddler and the experienceBeyond eyes shows you the imaginative world of Rae,  a  10 year-old girl, as she ventures outside her familiar surroundings in search of a fat cat named Nani. Rae isn't like most other girls. She lost her eyesight in an accident with fireworks when she was just a toddler and the experience left her traumatized. Fearing loud noises and public places, she hardly ever leaves her house, preferring to spend her free time in her special garden where everything smells pleasant and all is nice. Some people might feel sorry for Rae, being as isolated as she is, but Rae herself is perfectly content with her life especially after befriending a gorgeous full-figured stray feline she names Nani. When Nani goes missing Rae finally gains the courage to go outside for the first time on an wonderful and life changing journey to find her missing friend. The world outside is frightening and unfamiliar but, with the guidance of the player, Rae learns to overcome her fears and finds beauty and possible new friends outside of her golden cage. … Expand"}, {"name": "Cobra Kai: The Karate Kid Saga Continues", "details_link": "https://www.metacritic.com/game/xbox-one/cobra-kai-the-karate-kid-saga-continues", "publisher": "GameMill Entertainment", "release_date": "Oct 27 2020", "developers": ["GameMill Entertainment", "Flux Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 60, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/617888a7a91e5026b0580105d43d7635-98.jpg", "descriptions": "CHOOSE A SIDE. EMBRACE YOUR DESTINY. THE FIGHT IS IN YOUR HANDS NOW.Choose a side, master your moves, and embrace your destiny in an epic beat 'em up adventure inspired by the hit show. Take control of 8 playable characters with co-op multiplayer, deep move sets, combos, progression,CHOOSE A SIDE. EMBRACE YOUR DESTINY. THE FIGHT IS IN YOUR HANDS NOW.Choose a side, master your moves, and embrace your destiny in an epic beat 'em up adventure inspired by the hit show. Take control of 8 playable characters with co-op multiplayer, deep move sets, combos, progression, real-time character swaps, ultimate attacks, and much more! 34 years after the events of the 1984 All Valley Karate Tournament, the rivalry of Daniel LaRusso and Johnny Lawrence continues. The fight is in your hands now!Two-Fold Storyline Featuring an all-new storyline filled with unique cutscenes and dialog choose to take control of Daniel and his students at Miyagi-Do Karate through a storyline campaign. Or select their rivals, Johnny Lawrence and his disciples at Cobra Kai to play their side of the story. Completing both sides of the campaign unveils an ultimate ending.Live the Cobra Kai UniverseExplore Los Angeles in the Cobra Kai universe across 28 missions filled with characters and enemies from the show.Character Swap SystemChoose your Dojo then seamlessly swap between your favorite characters from the story.RPG-Like Dojo ProgressionMaster 40 unique skills and upgrade your characters' stats as you karate your way through enemies.… Expand"}, {"name": "Massira", "details_link": "https://www.metacritic.com/game/playstation-4/massira", "publisher": "Factoria Cultural Gestio, S.L.", "release_date": "Sep 16 2019", "developers": ["Frost Monkey Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 60, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/913b0a6dca3591103fabfa8f45c2b188-98.jpg", "descriptions": "“Massira” is a story driven, puzzle adventure game with a “low poly” style, where you will experience an unforgettable adventure in the shoes of a girl and her grandmother, who make a trip from Syria to Europe, all seen through the eyes of the little one. Oriented to a sensitive audience,“Massira” is a story driven, puzzle adventure game with a “low poly” style, where you will experience an unforgettable adventure in the shoes of a girl and her grandmother, who make a trip from Syria to Europe, all seen through the eyes of the little one. Oriented to a sensitive audience, with a taste for good stories, you can face reality while enjoying yourself as a child again thanks to its artistic style.… Expand"}, {"name": "Exorder", "details_link": "https://www.metacritic.com/game/pc/exorder", "publisher": "Fat Dog Games", "release_date": "Mar 19 2018", "developers": ["Solid9 Studio"], "platforms": ["Switch", "PC"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/e70cef5d75319ac90c79c2f4d6e889f5-98.jpg", "descriptions": "Exorder is one of those not overly-complicated tactical turn-based games with simple rules and dangerous depths. It features a single-player fantasy campaign and a multiplayer skirmishes, both online and offline."}, {"name": "Rogue Trooper Redux", "details_link": "https://www.metacritic.com/game/pc/rogue-trooper-redux", "publisher": "Rebellion", "release_date": "Oct 17 2017", "developers": ["TickTock Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 60, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/4530326c97ffacf9382cf917ce32922f-98.jpg", "descriptions": "A tactical shooter and comic book adaptation, Rogue Trooper is back, remastered in high definition. Experience combat and third person action in this tale of betrayal and revenge at the far reaches of the galaxy. You are the last Genetic Infantryman (GI). Bred for war and betrayed by yourA tactical shooter and comic book adaptation, Rogue Trooper is back, remastered in high definition. Experience combat and third person action in this tale of betrayal and revenge at the far reaches of the galaxy. You are the last Genetic Infantryman (GI). Bred for war and betrayed by your superiors at the Quartz Zone Massacre, you stalk the battlefield as a one-man squad, carrying the sentient biochips of three fallen soldiers in your rifle, pack and helmet. Your mission? Fight your way across the chemical-blasted wastes of Nu-Earth -- a planet ravaged by an endless apocalyptic war  in search of the Traitor General and payback.… Expand"}, {"name": "Pac-Man and the Ghostly Adventures 2", "details_link": "https://www.metacritic.com/game/xbox-360/pac-man-and-the-ghostly-adventures-2", "publisher": "Bandai Namco Games", "release_date": "Oct 14 2014", "developers": ["Vicious Cycle"], "platforms": ["3DS", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 60, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/786c08d4cd71c1b2f8b9d0c802108d84-98.jpg", "descriptions": "The gang is back! Following the colorful characters and world of the PAC-MAN and the Ghostly Adventures animated series,PAC-MAN and the Ghostly Adventures 2 will feature PAC-MAN, Spiral and Cylindria in an all-new storyline as they defendPacWorld from the ghoulish army of Lord Betrayus."}]