[{"name": "Hellboy: The Science of Evil", "details_link": "https://www.metacritic.com/game/psp/hellboy-the-science-of-evil", "publisher": "Konami", "release_date": "Jun 24 2008", "developers": ["Krome Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PSP"], "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "Beat-'Em-Up", "Linear"], "meta_score": 42, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/445caa314515dca5c9e6a1b936ba775c-98.jpg", "descriptions": "Hellboy provides players with fresh adventures featuring the acclaimed comic book's unmistakable fusion of action, atmosphere and humor. On the trail of a crazed witch, Hellboy uncovers a Nazi plot for world domination and must rush to defeat the crazed Hermann Von Klempt before he can exertHellboy provides players with fresh adventures featuring the acclaimed comic book's unmistakable fusion of action, atmosphere and humor. On the trail of a crazed witch, Hellboy uncovers a Nazi plot for world domination and must rush to defeat the crazed Hermann Von Klempt before he can exert his evil will upon a hapless world. As a visceral brawler, the game lets players unleash Hellboy's superhuman abilities as they smash their way through hordes of enemies with contextual use of the environment for added destructive power and strategy. An original storyline set in the Hellboy universe, filled with classic characters from the comic book. Explosive battle system with contextual grappling commands lets players experience Hellboy's supernatural might as he unleashes the Right Hand of Doom on his enemies. Use strategy to take down hordes of enemies - toss a straggler into the crowd or manipulate the environment to create more manageable groups of enemies. Play as series favorites Abe Sapein and Liz Sherman in cooperative multiplayer modes. [Konami]… Expand"}, {"name": "Spider-Man 2: The Game", "details_link": "https://www.metacritic.com/game/pc/spider-man-2-the-game", "publisher": "Activision", "release_date": "Jun 28 2004", "developers": ["Fizz Factor"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Open-World"], "meta_score": 42, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/7/7ee669b82181f86fee30ad345048cba7-98.jpg", "descriptions": "In Spider-Man 2, Manhattan becomes a gamer's playground as you take the role of Spider-Man in a battle against the nefarious Doc Ock. Based on the plot of the movie Spider-Man 2 and the heroes and villains created by Marvel, the game allows players to encounter unique and dangerous villainsIn Spider-Man 2, Manhattan becomes a gamer's playground as you take the role of Spider-Man in a battle against the nefarious Doc Ock. Based on the plot of the movie Spider-Man 2 and the heroes and villains created by Marvel, the game allows players to encounter unique and dangerous villains as they patrol the streets and rooftops of the biggest city created in any Super Hero game to date.… Expand"}, {"name": "Star Trek: Shattered Universe", "details_link": "https://www.metacritic.com/game/playstation-2/star-trek-shattered-universe", "publisher": "TDK Mediactive", "release_date": "Jan 13 2004", "developers": ["Starsphere Interactive"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Large Spaceship"], "meta_score": 42, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/4b3a019b5e258e2d6b8ac3240fe8bd0e-98.jpg", "descriptions": "An intense, edgy, high-energy space-combat action game set in the dark mirror universe of Star Trek: The Original Series classic-era setting, Star Trek Shattered Universe challenges the player to adapt to a new reality where everything once familiar is now a dark reflection - where the nobleAn intense, edgy, high-energy space-combat action game set in the dark mirror universe of Star Trek: The Original Series classic-era setting, Star Trek Shattered Universe challenges the player to adapt to a new reality where everything once familiar is now a dark reflection - where the noble Federation is now an evil and relentless foe. [TDK Mediactive]… Expand"}, {"name": "Iron Man 2", "details_link": "https://www.metacritic.com/game/wii/iron-man-2", "publisher": "Sega", "release_date": "May  4 2010", "developers": ["High Voltage Software"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 41, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/7cba083b89e3d87d62752c02118d0e02-98.jpg", "descriptions": "Packed with favorites from the movie and comic book worlds, Iron Man 2: The Video Game offers gamers a chance to choose between Iron Man and War Machine, as they battle through hugely destructible indoor and outdoor environments. Tony and Rhodey both come equipped with their own distinctPacked with favorites from the movie and comic book worlds, Iron Man 2: The Video Game offers gamers a chance to choose between Iron Man and War Machine, as they battle through hugely destructible indoor and outdoor environments. Tony and Rhodey both come equipped with their own distinct assortments of fully customizable, earth-shattering weapons, as well as vicious melee combat moves, all of which will come in handy against the likes of Crimson Dynamo and other classic Marvel foes. [Sega]… Expand"}, {"name": "Winter Sports 2: The Next Challenge", "details_link": "https://www.metacritic.com/game/xbox-360/winter-sports-2-the-next-challenge", "publisher": "Conspiracy Entertainment", "release_date": "Nov 18 2008", "developers": ["49Games"], "platforms": ["PlayStation 2", "Xbox 360"], "genres": ["Sports", "Alternative", "Individual", "Skiing", "Skiing", "Ski / Snowboard"], "meta_score": 41, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/649c228f8f5fca62c9ddc237b9870e2b-98.jpg", "descriptions": "WINTER SPORTS 2 is an arcade-oriented 3D simulation of only the most popular winter sports. The player is placed at the center of high level sporting events broadcast live around the world. The excitement of this major international competition is portrayed authentically with commentators,WINTER SPORTS 2 is an arcade-oriented 3D simulation of only the most popular winter sports. The player is placed at the center of high level sporting events broadcast live around the world. The excitement of this major international competition is portrayed authentically with commentators, TVTV cameras and immersive environments. 9 Sports with 15 different disciplines. New Snowboard half pipe contest. 13 all new levels and arenas + 19 classic levels. Campaign with 42 extra challenges across all disciplines. Multiplayer party fun: ’Hot Seat’ (4 players), split screen (2 players). [Conspiracy Entertainment]… Expand"}, {"name": "Deca Sports 3", "details_link": "https://www.metacritic.com/game/wii/deca-sports-3", "publisher": "Hudson Entertainment", "release_date": "Oct 26 2010", "developers": ["Hudson", "NATSUME ATARI Inc."], "platforms": "Wii", "num_players": "2 ", "genres": ["Sports", "General", "General", "Individual", "Athletics"], "meta_score": 41, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/ae14a1f1be4651893df0280de6eaf433-98.jpg", "descriptions": "DECA SPORTS, the hit sports compilation series that has over 2.5 million units sold through worldwide, is returning to Wii™ with 10 COMPLETELY NEW sporting events in DECA SPORTS 3! Simple controls let your entire family play together, while advanced controls let you take advantage of WiiDECA SPORTS, the hit sports compilation series that has over 2.5 million units sold through worldwide, is returning to Wii™ with 10 COMPLETELY NEW sporting events in DECA SPORTS 3! Simple controls let your entire family play together, while advanced controls let you take advantage of Wii MotionPlus™. Swing, flip, and spike your way to the winner’s circle across all of the included events: Indoor Volleyball, Racquetball, Air Racing, Freestyle Kayaking, Lacrosse, Fencing, Halfpipe (Snowboarding), Giant Slalom (Skiing), Springboard Diving, and even Log Cutting! This time around, you can play online in 4 events (Volleyball, Lacrosse, Racquetball, & Fencing)!… Expand"}, {"name": "Rugby 18", "details_link": "https://www.metacritic.com/game/playstation-4/rugby-18", "publisher": "Bigben Interactive", "release_date": "Oct 24 2017", "developers": ["Koch Media"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Team", "Rugby"], "meta_score": 41, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/6/c7fb106312d2c3ae7454b775b5713625-98.jpg", "descriptions": "Experience the full intensity of the biggest matches with Rugby 18, the most complete rugby game to date. Jump into the roles of the official players from the most prestigious teams and leagues of the 2017-2018 season: Aviva Premiership Rugby, Wales, England, Scotland... Dominate all theExperience the full intensity of the biggest matches with Rugby 18, the most complete rugby game to date. Jump into the roles of the official players from the most prestigious teams and leagues of the 2017-2018 season: Aviva Premiership Rugby, Wales, England, Scotland... Dominate all the game phases using intuitive controls, and enjoy innovative gameplay that faithfully reproduces each situation of the sport. On attack or defence, your teammates take their positions and move to develop the game depending on your decisions. Lead your favourite club to the top in Career mode, replay the biggest leagues and tournaments in League mode, and re-write history in the Match of the Week. Build up your dream team in My Squad mode by selecting your favourite players from all of the game's teams. Play one-on-one against a friend on the same console, or against players from around the world online.… Expand"}, {"name": "Legacy: Dark Shadows", "details_link": "https://www.metacritic.com/game/pc/legacy-dark-shadows", "publisher": "Tri Synergy", "release_date": "Nov 19 2004", "developers": ["Razbor Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 41, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/8/2027ffb6b03c7a4d0090d70b71dcd0e8-98.jpg", "descriptions": "In the year 1930 Japanese scientists discovered an unusual substance which when injected in human body starts to regenerate body cells stopping the process of aging. However, with the first few volunteers it became clear that something has gone wrong: after ten days the rejuvenation was soIn the year 1930 Japanese scientists discovered an unusual substance which when injected in human body starts to regenerate body cells stopping the process of aging. However, with the first few volunteers it became clear that something has gone wrong: after ten days the rejuvenation was so intense that a body couldn?t take that much of a shock. All of the subjects died of a stroke. In 1936 Japan and Germany sign the Anti-Comitern Pact. Hitler?s leading scientist Josef Mengele negotiated the terms of the cooperation with Japanese concerning the research of the regenerative substance. These negotiations lasted until 1941, when Germans realized that their soldiers aren?t able to bare the cold Russian climate. Japanese, concerned for their interests in Russia, decided to help them unconditionally. In December, 1941 the Institute for Hereditary Biology with its leading scientist dr. Mengele received a mysterious package from Japan. Only the chosen ones knew that it contained all records regarding the creation of the regenerative substance. To get to Germany as soon as possible, pilots of the cargo plane had to fly over the enraging Stalingrad front. [GMX Media]… Expand"}, {"name": "Planet of the Apes", "details_link": "https://www.metacritic.com/game/pc/planet-of-the-apes", "publisher": "Ubisoft", "release_date": "Sep 19 2001", "developers": ["Visiware Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 41, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/5/bb80245790aa5d223f6fabdff81e31e1-98.jpg", "descriptions": "Assume the role of Ulysses, a deep-space astronaut shipwrecked on a future planet populated with a breed of intelligent apes who rule the civilization.  Ulysses must infiltrate the simian society and halt general Ursus's genocidal plans."}, {"name": "Iron Man 2", "details_link": "https://www.metacritic.com/game/xbox-360/iron-man-2", "publisher": "Sega", "release_date": "May  4 2010", "developers": ["Sega Studios San Francisco"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 41, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/86eb8db25fb56a70c29d14b9bc06e125-98.jpg", "descriptions": "Packed with favorites from the movie and comic book worlds, Iron Man 2: The Video Game offers gamers a chance to choose between Iron Man and War Machine, as they battle through hugely destructible indoor and outdoor environments. Tony and Rhodey both come equipped with their own distinctPacked with favorites from the movie and comic book worlds, Iron Man 2: The Video Game offers gamers a chance to choose between Iron Man and War Machine, as they battle through hugely destructible indoor and outdoor environments. Tony and Rhodey both come equipped with their own distinct assortments of fully customizable, earth-shattering weapons, as well as vicious melee combat moves, all of which will come in handy against the likes of Crimson Dynamo and other classic Marvel foes. [Sega]… Expand"}, {"name": "Wayward Manor", "details_link": "https://www.metacritic.com/game/pc/wayward-manor", "publisher": "Moonshark", "release_date": "Jul 15 2014", "developers": ["Moonshark"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "General", "Adventure", "Puzzle", "Action", "Point-and-Click"], "meta_score": 41, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/8e2b1ce4e2e4b60d9a30e2b2db82950e-98.jpg", "descriptions": "Neil Gaiman & Wayward Manor invite you to jump into the afterlife of a disgruntled ghost, trying to reclaim his house from its newfound owners."}, {"name": "Things on Wheels", "details_link": "https://www.metacritic.com/game/xbox-360/things-on-wheels", "publisher": "Focus Home Interactive", "release_date": "May 12 2010", "developers": ["Load Inc."], "platforms": "Xbox 360", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 41, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/8d64e66da2c5965fed8ace5100702555-98.jpg", "descriptions": "[Xbox Live Arcade]  Things on Wheels is a racing game that will make you scream for more. Take your favorite RC car and race inside an Art Deco house, or around the huge park. Play for fun with your friends, or compete for victory with top-ranked experts. Slide around turns from the music[Xbox Live Arcade]  Things on Wheels is a racing game that will make you scream for more. Take your favorite RC car and race inside an Art Deco house, or around the huge park. Play for fun with your friends, or compete for victory with top-ranked experts. Slide around turns from the music room to the winter garden, and try three different racing experiences with vintage, muscle, and sports vehicles. Take your chances online and use our all-new race lobby, then use bonuses to bend the race to your advantage, and brag about it using audio chat. Don't be afraid to get ToWed away!… Expand"}, {"name": "Cyberball 2072", "details_link": "https://www.metacritic.com/game/xbox-360/cyberball-2072", "publisher": "Midway", "release_date": "Sep  5 2007", "developers": ["Digital Eclipse"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Sports", "General", "General", "Team", "Futuristic"], "meta_score": 41, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/4e8d286357e94ac685909242faa3d8a0-98.jpg", "descriptions": "[Xbox Live Arcade]  Rediscover the arcade classic game Cyberball 2072 on Xbox Live Arcade. Take control of your robotic team, and call the plays to move your downfield for a touchdown. But watch out. The ball gets hot if you don't keep moving. Keep your eye on the ball to make sure it[Xbox Live Arcade]  Rediscover the arcade classic game Cyberball 2072 on Xbox Live Arcade. Take control of your robotic team, and call the plays to move your downfield for a touchdown. But watch out. The ball gets hot if you don't keep moving. Keep your eye on the ball to make sure it doesn't go critical before you can score. Call more than 100 plays for your robotic team. The Beat the Coach mode enables you to go up against the A.I., simulating a live opponent. The special Challenge Mode tests your ability to make the play under pressure. Build up your win record, and buy upgraded robots to improve your roster. Fast football action with robots. The ball gets hotter with each play and can only be reset by moving past the 50-yard line or scoring a touchdown. [Microsoft]… Expand"}, {"name": "XIII (Remake)", "details_link": "https://www.metacritic.com/game/playstation-4/xiii-remake", "publisher": "Microids", "release_date": "Nov 10 2020", "developers": ["PlayMagic Ltd"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 41, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/0/298889efd7be044590a2125ad55b53cc-98.jpg", "descriptions": "XIII is a remake of the cult first-person action game that was initially released in 2003. You play as \"XIII\", a man without an identity, in a solo campaign with numerous twists and turns. Inspired by the eponymous graphic novel, the game features a completely reinvented and uniqueXIII is a remake of the cult first-person action game that was initially released in 2003. You play as \"XIII\", a man without an identity, in a solo campaign with numerous twists and turns. Inspired by the eponymous graphic novel, the game features a completely reinvented and unique cel-shading design. In XIII, players can also take part in fierce multi-player fights.The country remains in a state of shock following the assassination of President Sheridan. You wake up, wounded and with amnesia, on a deserted beach on the east coast. The only clues as to your identity are a tattoo of the number XIII near your collarbone and a locker key. Even though your memory is failing, you discover that you have the reflexes of a highly trained professional fighter. You set off in search of your past, discovering that you played a role in the murder of the President of the United States of America, and revealing the most astounding conspiracy ever hatched in the country's history.… Expand"}, {"name": "Transformers: Cybertron Adventures", "details_link": "https://www.metacritic.com/game/wii/transformers-cybertron-adventures", "publisher": "Activision", "release_date": "Jun 22 2010", "developers": ["Next Level Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 41, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/56091df0012e5ca8e53ef417d8d9234c-98.jpg", "descriptions": "Players can now take on the role of a Transformers character in the final, epic war that will determine the survival of their entire race."}, {"name": "25 to Life", "details_link": "https://www.metacritic.com/game/xbox/25-to-life", "publisher": "Eidos Interactive", "release_date": "Jan 17 2006", "developers": ["Ritual Entertainment", "Avalanche Software"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 41, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/0ebdcdb444200b7dcbd067ced14a8d59-98.jpg", "descriptions": "In 25 to Life, you can play as either a cop or a gangster. Set in the heart of today's cities, the game lets you experience the gritty lifestyles of police task forces or, as a gangster, survive the local neighborhood thugs while fighting your way up the ranks. You can even uphold the law orIn 25 to Life, you can play as either a cop or a gangster. Set in the heart of today's cities, the game lets you experience the gritty lifestyles of police task forces or, as a gangster, survive the local neighborhood thugs while fighting your way up the ranks. You can even uphold the law or defend your turf with up to 16 players over the Internet. Whether you bust out of prison or infiltrate the inner sanctum of the drug lord's mansion, your knowledge of the streets will be put to the test. … Expand"}, {"name": "Arcania: Fall of Setarrif", "details_link": "https://www.metacritic.com/game/pc/arcania-fall-of-setarrif", "publisher": "Nordic Games Publishing", "release_date": "Oct 24 2011", "developers": ["Spellbound"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "General", "Action RPG", "PC-style RPG"], "meta_score": 41, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/2/b58fbf506ed99d529076ef17d5abb6a3-98.jpg", "descriptions": "A new threat casts its shadow over the Southern Isles. A mysterious demon, consumed by hatred, terrifies the population and pools his force against the coastal city of Setarrif. The dramatic situation exacerbates after a volcanic eruption in the mountains nearby. The nameless hero joinsA new threat casts its shadow over the Southern Isles. A mysterious demon, consumed by hatred, terrifies the population and pools his force against the coastal city of Setarrif. The dramatic situation exacerbates after a volcanic eruption in the mountains nearby. The nameless hero joins forces with his strongest allies and courageously faces the new menace.… Expand"}, {"name": "Mana Khemia: Student Alliance", "details_link": "https://www.metacritic.com/game/psp/mana-khemia-student-alliance", "publisher": "NIS America", "release_date": "Mar 10 2009", "developers": ["Gust"], "platforms": ["PlayStation 2", "PSP"], "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 41, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/2351ae8d901c04c061a02b5e85c8231c-98.jpg", "descriptions": "Now you can enjoy the best RPG about an amnesiatic boy attending an alchemy academy in an isolated part of the world anywhere you please.Take Mana Khemia wherever you go, and battle alongside your friends with the all-new Multiplayer mode. And with the revolutionary Jump Start function,Now you can enjoy the best RPG about an amnesiatic boy attending an alchemy academy in an isolated part of the world anywhere you please.Take Mana Khemia wherever you go, and battle alongside your friends with the all-new Multiplayer mode. And with the revolutionary Jump Start function, loading times are a breeze. [NIS America]… Expand"}, {"name": "Damnation", "details_link": "https://www.metacritic.com/game/pc/damnation", "publisher": "Codemasters", "release_date": "May 22 2009", "developers": ["Blue Omega"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 41, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/3/bad0f27c2867066c6dbe18a3586cb760-98.jpg", "descriptions": "Evolving the shooter genre with its unique combination of fluid action and combat, Damnation features huge, open environments, frenetic combat, daredevil acrobatics and high-octane vehicle-based stunts. Presenting players with an intense test of reflexes, quick thinking and rapid-fireEvolving the shooter genre with its unique combination of fluid action and combat, Damnation features huge, open environments, frenetic combat, daredevil acrobatics and high-octane vehicle-based stunts. Presenting players with an intense test of reflexes, quick thinking and rapid-fire conflict, Damnation features vast, breathtaking landscapes, each covering miles of distance and thousands of vertical feet. Billed as a \"shooter gone vertical\" and visually inspired by iconic elements of American history, these massive streaming landscapes form the battlegrounds for a post-industrial conflict between humanity and an unstoppable arms dealer hell-bent on total world domination. Players choose their own paths and navigate the world by performing daredevil feats on the edge of human ability. Intelligent enemies give chase and engage players in frantic gun fights and attacks that can come from any direction. With up to three hours of actual gameplay stretching out in front of them per level, players need more than just muscle power to get across each level safely. Damnation offers players a selection of vehicles, from motorbikes capable of launching across seemingly infinite chasms, to huge, armour-piercing marvels that induce mayhem with every huge shell. The high action is supported by an epic and in-depth story which, while focusing on the exploits of the hero character Rourke, is truly an ensemble piece. Players meet and become involved in intricate story plots that reveal much more than the obvious. In addition to the single player experience, Damnation comes complete with a unique set of multiplayer options that take full advantage of the game’s expansive levels. [Codemasters]… Expand"}, {"name": "Wacky Races: Crash & Dash", "details_link": "https://www.metacritic.com/game/ds/wacky-races-crash-dash", "publisher": "Eidos Interactive", "release_date": "Jun 17 2008", "developers": ["Farmind Ltd"], "platforms": "DS", "num_players": "4  Online", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart"], "meta_score": 41, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/96596bd72f73eaec05db56577f4634ba-98.jpg", "descriptions": "Wacky Races: Crash & Dash is an action racing game with fun-filled environments, crazy cars and hilarious characters. The game features all the characters and cars from the TV series including old favorites: Turbo Terrific driven by Peter Perfect, the Ant Hill Mob in their Bullet Proof Bomb,Wacky Races: Crash & Dash is an action racing game with fun-filled environments, crazy cars and hilarious characters. The game features all the characters and cars from the TV series including old favorites: Turbo Terrific driven by Peter Perfect, the Ant Hill Mob in their Bullet Proof Bomb, Penelope Pitstop, and the Mean Machine driven by Dick Dastardly and his sidekick, Muttley. Players join Dick Dastardly and the gang, racing across a variety of action-packed and colorful cross-country rallies from the TV series. Racers watch out for traps and speed ahead to win the ultimate title of World’s Wackiest Racer. Wacky Widgets are collected during the race to gain “Wacky Powers,” as well as a character’s super-special “Way Out Wacky” power, which can be used to gain the upper hand over sly opponents. [Eidos Interactive]… Expand"}, {"name": "One Way Trip", "details_link": "https://www.metacritic.com/game/playstation-4/one-way-trip", "publisher": "Beret Applications LLC", "release_date": "Aug 30 2016", "developers": ["Beret Applications LLC"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Visual Novel"], "meta_score": 41, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/0/782994ded9369f00fa9afb816728d3db-98.jpg", "descriptions": "In One Way Trip, you and your brother Barry discover that you’ve been poisoned in a mass attack on the water supply that has left a large portion of the nation with only six hours left to live, during which time they will be constantly hallucinating. To put it another way, it’s anIn One Way Trip, you and your brother Barry discover that you’ve been poisoned in a mass attack on the water supply that has left a large portion of the nation with only six hours left to live, during which time they will be constantly hallucinating. To put it another way, it’s an atmospheric exploration of what it would be like to find out you and most everyone you love is about to die, and then have to process that while your limbs turn into cartoon dolphins.… Expand"}, {"name": "Alien Blast: The Encounter", "details_link": "https://www.metacritic.com/game/pc/alien-blast-the-encounter", "publisher": "Strategy First", "release_date": "Feb  9 2004", "developers": ["Made by Kiddies"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 41, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/2/43461b72648b83563b0b940891148046-98.jpg", "descriptions": "The year is 2060 and the action takes place on a remote and isolated planet. In the distant frontiers of space, a large allied force well beyond the reach of Earth maintains civilization. The aim is to conquer and defend distant planets for the new civilization. The crew of the commercialThe year is 2060 and the action takes place on a remote and isolated planet. In the distant frontiers of space, a large allied force well beyond the reach of Earth maintains civilization. The aim is to conquer and defend distant planets for the new civilization. The crew of the commercial starship MBK-03 has been alerted to investigate a distress call from an allied planet. After landing on the planet, the crew discovers that the signal is actually a warning. A warning to abandon the planet, but it is too late to turn back and the terror begins when they first encounter an alien during their investigation. Defend the allied planet against the alien raid ? this is the mission! Far from the reaches of your solar system, you are alone on an assignment to battle the alien horde. As a member of the allied forces, everyone is relying on you. Most of your allied forces have been destroyed, and this will be your most difficult mission yet. It's up to you to defend the planet. In this first-person view arcade shoot'em-up, you must gather up all your courage to defend yourself and defeat the enemy, the aliens. Alien Blast is an exciting sci-fi action combat game for everyone. [Strategy First]… Expand"}, {"name": "Robot Arena", "details_link": "https://www.metacritic.com/game/pc/robot-arena", "publisher": "WizardWorks", "release_date": "Apr  1 2001", "developers": ["Gabriel Interactive"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Breeding/Constructing", "General", "Breeding/Constructing"], "meta_score": 41, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/1dd3234753a40379303aa586ea1a5dc3-98.jpg", "descriptions": "Stop the bloodlust!  Instead, let's fight some cusomizable robots!  Build your bot from the chassis, and throw in a mobility system, weopons and other exciting extas before going to battle."}, {"name": "Rally Challenge 2000", "details_link": "https://www.metacritic.com/game/nintendo-64/rally-challenge-2000", "publisher": "SouthPeak Games", "release_date": "Jun 30 2000", "developers": ["Europress"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 41, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/7741dd7c9e6e69dd159f61ea7e6791f0-98.jpg", "descriptions": "RALLY CHALLENGE 2000 takes you on a scorching tour around the world. Get behind the wheel of one of nine authentic WRC cars, each with its own unique settings for speed, torque and steering. Experience road rage of global proportions. Nasty weather and wicked terrain make even straightawaysRALLY CHALLENGE 2000 takes you on a scorching tour around the world. Get behind the wheel of one of nine authentic WRC cars, each with its own unique settings for speed, torque and steering. Experience road rage of global proportions. Nasty weather and wicked terrain make even straightaways life-threatening. Go it alone or head-to-head with up to four players. Check out instant replay of all the action from multiple angles. Keep your road rage in check - collision damage could put you on the sidelines.… Expand"}, {"name": "Emergency Heroes", "details_link": "https://www.metacritic.com/game/wii/emergency-heroes", "publisher": "Ubisoft", "release_date": "May 27 2008", "developers": ["Ubisoft Barcelona", "Ubisoft Reflections"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 41, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/7b3bd394ff504f65656f54817fa7bbe6-98.jpg", "descriptions": "Emergency Heroes is an open world rescue driving game. Young rescuers can jump into 16 different variations of next-generation rescue vehicles as a police officer, firefighter or EMT and navigate through the sprawling streets of San Alto, keeping citizens safe along the way. Drive the nextEmergency Heroes is an open world rescue driving game. Young rescuers can jump into 16 different variations of next-generation rescue vehicles as a police officer, firefighter or EMT and navigate through the sprawling streets of San Alto, keeping citizens safe along the way. Drive the next generation of rescue vehicles. Pilot and command numerous hi-tech rescue vehicles designed specifically for ultra-high-risk, high-speed navigation. Choose between police, fire and EMT vehicles. Explore and protect the entire city. As an emergency hero, your mission is to protect the peaceful city of San Alto. Drive through stunning free-roaming open environments, rescuing the city from imminent danger at every turn. Two Player Co-Op. Challenge your friends or combine forces to form the ultimate rescue hero team to protect your city. Making full use of the Wii Remote, everyone in the family can enjoy being an emergency hero. Take advantage of Hero Mode and play like you mean it – the faster you drive, the faster you rise and gain access to powers of invincibility. [Ubisoft]… Expand"}, {"name": "7554", "details_link": "https://www.metacritic.com/game/pc/7554", "publisher": "Emobi Games", "release_date": "Jul 20 2012", "developers": ["Emobi Games"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Arcade"], "meta_score": 41, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/540c7d543667670d56aac2fc8a7dd115-98.jpg", "descriptions": "7554 is a first person shooter set against the historical backdrop of the climatic conclusion to the first Indochina War between the Vietnam Peopleâ€™s Army revolutionaries and the oppressing French army. The single player campaign puts gamers on the front line of a colonial7554 is a first person shooter set against the historical backdrop of the climatic conclusion to the first Indochina War between the Vietnam Peopleâ€™s Army revolutionaries and the oppressing French army. The single player campaign puts gamers on the front line of a colonial independence movement locked in battle against a technologically more advanced modern Western occupier.… Expand"}, {"name": "GT Pro Series", "details_link": "https://www.metacritic.com/game/wii/gt-pro-series", "publisher": "Ubisoft", "release_date": "Nov 14 2006", "developers": ["MTO"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 41, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/8964d2cca2fc72057b4b0dc93ef81a64-98.jpg", "descriptions": "GT Pro Series is an exclusive car-racing game for Nintendo’s Wii. With more than 80 licensed cars, tons of tuning options and its fluid drift-style controls and physics, GT Pro Series perfectly fits the Wii’s unique gameplay approach. It’s a fast-paced racing game that takes full advantageGT Pro Series is an exclusive car-racing game for Nintendo’s Wii. With more than 80 licensed cars, tons of tuning options and its fluid drift-style controls and physics, GT Pro Series perfectly fits the Wii’s unique gameplay approach. It’s a fast-paced racing game that takes full advantage of the Wii Remote. [Ubisoft]… Expand"}, {"name": "Timeline (2000)", "details_link": "https://www.metacritic.com/game/pc/timeline-2000", "publisher": "Eidos Interactive", "release_date": "Nov 12 2000", "developers": ["Timeline Computer Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 41, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/9/489c70af9c988924fedc5368fd2e22de-98.jpg", "descriptions": "Make your way through a challenging and perilous interactive world to rescue your professor. Characters come to life with innovative facial animations and full audio dialogue. Immerse yourself in diverse and realistic environments all modeled with historic accuracy to create an authenticMake your way through a challenging and perilous interactive world to rescue your professor. Characters come to life with innovative facial animations and full audio dialogue. Immerse yourself in diverse and realistic environments all modeled with historic accuracy to create an authentic experience.  [Eidos Interactive]… Expand"}, {"name": "MotionSports Adrenaline", "details_link": "https://www.metacritic.com/game/xbox-360/motionsports-adrenaline", "publisher": "Ubisoft", "release_date": "Nov  1 2011", "developers": ["Ubisoft Vancouver"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General"], "meta_score": 41, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/8223cff039e6f61219e1ad37bb007267-98.jpg", "descriptions": "MotionSports Adrenaline lets players have a chance to make a name for themselves in the world of extreme sports."}, {"name": "Harry Potter and the Deathly Hallows, Part 1", "details_link": "https://www.metacritic.com/game/wii/harry-potter-and-the-deathly-hallows-part-1", "publisher": "Electronic Arts", "release_date": "Nov 16 2010", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 41, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/1/b9ac3d21d492fb3be8db389fefb61a10-98.jpg", "descriptions": "Harry Potter takes a dark turn in this third-person shooter as he battles death eaters and dementors while fleeing for his life across the wilds of England."}, {"name": "The Golden Compass", "details_link": "https://www.metacritic.com/game/xbox-360/the-golden-compass", "publisher": "Sega", "release_date": "Dec  4 2007", "developers": ["Shiny Entertainment"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 41, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/0/d46e013425b65bf770ac26f33a816fe1-98.jpg", "descriptions": "The Golden Compass follows the screenplay adaptation of the first book in the acclaimed trilogy, capturing the fantasy adventure set in a parallel world where giant armored bears rule a kingdom, beautiful witches fly through the frozen skies, and human beings' deepest essence is manifest asThe Golden Compass follows the screenplay adaptation of the first book in the acclaimed trilogy, capturing the fantasy adventure set in a parallel world where giant armored bears rule a kingdom, beautiful witches fly through the frozen skies, and human beings' deepest essence is manifest as talking animals that remain their faithful companion for life – their daemon. Players can assume the role of Lyra, a young girl, along with her daemon Pantalaimon (Pan), as she journeys through the frozen wastes of the North to rescue a friend kidnapped by a mysterious organization known as The Gobblers and winds up on an epic quest to save not only her world, but ours as well. Gamers can also take on the character of Iorek Byrnison, a great armoured polar bear who joins the quest. As Lyra, players use their daemon and collaborate with in-game characters, collecting special items in order to explore, evade, and deceive their way through confrontations with the Gobblers, the Magisterium, and the horribly dangerous spy fly to find her friend. They can also do battle as Iorek with special attacks and a riding mechanic as he protects Lyra during the journey. Gamers can unlock secrets and mini-games using a mysterious, truth-telling golden compass device called an alethiometer. Players can explore 13 vast locations, including all-new breath-taking environments not seen in the film, on this massive journey of collaboration, exploration and the eternal struggle between good and evil. [Sega]… Expand"}, {"name": "Gungrave VR", "details_link": "https://www.metacritic.com/game/playstation-4/gungrave-vr", "publisher": "XSEED Games", "release_date": "Dec 11 2018", "developers": ["IGGYMOB"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 41, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/6/d36570a828783a61939dbd85d075da95-98.jpg", "descriptions": "The acclaimed Gungrave series is reborn on PlayStation VR! Gungrave VR and the standalone sequel Gungrave VR U.N are also available together in one complete set: Gungrave VR Loaded Coffin Edition."}, {"name": "JASF: Jane's Advanced Strike Fighters", "details_link": "https://www.metacritic.com/game/playstation-3/jasf-janes-advanced-strike-fighters", "publisher": "Maximum Family Games", "release_date": "Nov 15 2011", "developers": ["Trickstar Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 41, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/8/018001926d1d0620932e8b3eb4d371e2-98.jpg", "descriptions": "Experience an intense modern flight action sim in JASF: Jane's Advanced Strike Fighters."}, {"name": "Taito Legends Power-Up", "details_link": "https://www.metacritic.com/game/psp/taito-legends-power-up", "publisher": "Destineer", "release_date": "May 17 2007", "developers": ["Empire Oxford"], "platforms": ["PlayStation 2", "PSP"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 41, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/ef762f99d8befee2ef8042ef3558a6aa-98.jpg", "descriptions": "(Currently available in the UK/EU only)  To become a KAZooK super-star you have to make your way through the ultimate party games collection that can take you anywhere and bring to life your wildest dreams, or weirdest nightmares. Face killer Zombies, pilot out of control UFOs, fight with(Currently available in the UK/EU only)  To become a KAZooK super-star you have to make your way through the ultimate party games collection that can take you anywhere and bring to life your wildest dreams, or weirdest nightmares. Face killer Zombies, pilot out of control UFOs, fight with mad sweaty Sumo’s, cause mayhem at an outrageous pool party and encounter many other thrills and oddities. Kazook is a bizarre collection of 30 totally addictive mini-games set in a distinctly stylized world. With 16 wacky characters to choose from from cool skater kids to scary Goths, to hard-core gangster rappers and sexy beach babes - drive yourself crazy with excitement. 30 bizarre mini-games - simple shoot-em-ups to dance games, Fighting to Racing - Offering a variety of game styles, each with its own challenge – something for everyone. Take control of one of 16 characters – all-star rappers, skate-kids, wild Goths girls and cool street dudes among others as you take on the many challenges KAZooK has to offer. 3 solo game modes: Normal – Battle through each mini-game one-by-one, unlocking more levels and bonuses. Survival – Test your staying power – play through all the minigames, lasting as long as possible. Party – take on the challenge of completing all minigames to become the ultimate party superstar! Wi-Fi Multiplayer – 27 mini-games can be played 2 player using the PSP wi-fi feature and 6 can be played hot-seat on one PSP - beat, blast and race your friends. Are you KAZooK? Game Sharing – 5 of the minigames can be shared with other PSP’s using only one game UMD. Controls – Simple controls allows gamers of all abilities to pick it up and play but impossible to put down! [Xplosiv]… Expand"}, {"name": "Rapala Tournament Fishing!", "details_link": "https://www.metacritic.com/game/wii/rapala-tournament-fishing!", "publisher": "Activision", "release_date": "Nov 22 2006", "developers": ["MagicWand"], "platforms": ["Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Nature", "Fishing", "Fishing"], "meta_score": 41, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/d39f375b8846b77d2b932a0b5d66ce89-98.jpg", "descriptions": "Rapala Tournament Fishing  lets players embark on all new angling adventures in 16 of the world’s most desirable fishing locales utilizing authentic gear from Rapala, the world’s largest manufacturer of fishing lures and #1 fishing brand in the world. [Activision]"}, {"name": "DARK", "details_link": "https://www.metacritic.com/game/pc/dark", "publisher": "Kalypso", "release_date": "Jul  3 2013", "developers": ["Kalypso", "Realmforge Studios"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern", "Linear"], "meta_score": 41, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/1/31f5f6bcc01acc30c341806249029ab4-98.jpg", "descriptions": "DARK is a stealth action game with RPG elements that lets you slip into the role of the ultimate killer... a vampire. Stalk you enemies from the shadows then use powerful vampire abilities to attack and silently dispatch them! The exciting story of DARK immerses you in a world full of bloodDARK is a stealth action game with RPG elements that lets you slip into the role of the ultimate killer... a vampire. Stalk you enemies from the shadows then use powerful vampire abilities to attack and silently dispatch them! The exciting story of DARK immerses you in a world full of blood and darkness in which the hunter can become the hunted at any time. As you unravel the mystery behind the global conglomerate that seems omnipresent and all-powerful, continually improve your character by developing powerful skills to aid you in remaining unobserved, or make quick process of those unfortunate to take too keen an interest in you.… Expand"}, {"name": "Seduce Me", "details_link": "https://www.metacritic.com/game/pc/seduce-me", "publisher": "No Reply Games", "release_date": "Jan  2 2013", "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "General", "General"], "meta_score": 41, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/1/2ca800070a865ae5a7ab3822340982fa-98.jpg", "descriptions": "Having happened upon an invite to a wealthy socialite's holiday home, you find yourself in the Mediterranean exploring a luxury mansion by the sea and meeting an array of characters. From Pietra's flirtatious maid Esper, to the sexually aggressive divorcee, Cecelia, you'll find yourselfHaving happened upon an invite to a wealthy socialite's holiday home, you find yourself in the Mediterranean exploring a luxury mansion by the sea and meeting an array of characters. From Pietra's flirtatious maid Esper, to the sexually aggressive divorcee, Cecelia, you'll find yourself surrounded by temptation. Be careful how you act, the world reacts.… Expand"}, {"name": "Lets Fish! Hooked On", "details_link": "https://www.metacritic.com/game/playstation-vita/lets-fish!-hooked-on", "publisher": "Wired Productions", "release_date": "Jan 29 2013", "developers": ["SIMS"], "platforms": "PlayStation Vita", "genres": ["Sports", "Individual", "Nature", "Fishing", "Fishing"], "meta_score": 41, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/5e13e48b7c7ae64db33dfc8a98b5a1f1-98.jpg", "descriptions": "Developed by the team behind SEGA Bass Fishing and Ape Escape (PSP), Let's Fish! Hooked On invites you to tackle four challenging game modes as you take advantage of the unique capabilities of the PlayStation Vita. Cast, hook and reel numerous classes of fish, earn new lures and play throughDeveloped by the team behind SEGA Bass Fishing and Ape Escape (PSP), Let's Fish! Hooked On invites you to tackle four challenging game modes as you take advantage of the unique capabilities of the PlayStation Vita. Cast, hook and reel numerous classes of fish, earn new lures and play through 11 themed outdoor stages on your way to becoming World Champion.… Expand"}, {"name": "Brigade E5: New Jagged Union", "details_link": "https://www.metacritic.com/game/pc/brigade-e5-new-jagged-union", "publisher": "Strategy First", "release_date": "Oct 17 2006", "developers": ["Apeiron"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Modern", "General", "Modern"], "meta_score": 41, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/ef882e08e9ce4718ac714a67a5bbc1d3-98.jpg", "descriptions": "Brigade E5: New Jagged Union is set in the fictional, small tropical country of Palinero. Players are required to assemble a band of mercenaries and take control of a rapidly deteriorating situation in order to survive the imminent civil war and avoid having their country left in completeBrigade E5: New Jagged Union is set in the fictional, small tropical country of Palinero. Players are required to assemble a band of mercenaries and take control of a rapidly deteriorating situation in order to survive the imminent civil war and avoid having their country left in complete ruins. Brigade E5: New Jagged Union is a tactical strategy title. The story offers players the opportunity to experience three different viewpoints of the conflict, or work outside the political structure to achieve their own goals towards global domination. Game play for the title is based on an innovative combat system called SPM (Smart Pause Mode) that successfully blends together the elements of both real-time and turn-based games. [Strategy First, Inc.]… Expand"}, {"name": "Turtle Tale", "details_link": "https://www.metacritic.com/game/3ds/turtle-tale", "publisher": "Saturnine Games", "release_date": "May 22 2014", "developers": ["Saturnine Games"], "platforms": ["Wii U", "3DS"], "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 41, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/933dbd214d4d401611d182d95e042471-98.jpg", "descriptions": "Turtle Island has been invaded by pirates, and it's up to you to stop them!\r Captain O'Haire and his gang of Monkey Pirates have sailed in and taken over Turtle Island. Armed with his trusty water gun, Shelldon sets out on an adventure to reclaim his home, stopping anyone who gets in hisTurtle Island has been invaded by pirates, and it's up to you to stop them!\r Captain O'Haire and his gang of Monkey Pirates have sailed in and taken over Turtle Island. Armed with his trusty water gun, Shelldon sets out on an adventure to reclaim his home, stopping anyone who gets in his way!\r With intuitive controls and colorful graphics, Turtle Tale is a classic 2D platformer that fans of retro games will love.\r Features\r-Classic 2D gameplay, inspired by our favorite retro platformers!\r-Travel through five unique areas of Turtle Island.\r-Catchy and colorful soundtrack.… Expand"}, {"name": "Street Supremacy", "details_link": "https://www.metacritic.com/game/psp/street-supremacy", "publisher": "Konami", "release_date": "Feb 28 2006", "developers": ["Genki"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 41, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/31e67d6f7f66e330810a06dd322b2ca1-98.jpg", "descriptions": "Stepping away from the norm, Street Supremacy features innovative game modes that set it apart from other titles in the racing genre. This includes the unique 'Team Battle' mode, which doesn't utilize the traditional first, second and third place finishes. Players win the race by depletingStepping away from the norm, Street Supremacy features innovative game modes that set it apart from other titles in the racing genre. This includes the unique 'Team Battle' mode, which doesn't utilize the traditional first, second and third place finishes. Players win the race by depleting their rival's Spirit Points, which are decreased by contact with walls, cars and by falling behind other racers. Divided into 15 areas, two teams compete to dominate the game map through individual races between the different players. By earning points for each victory, players can judge how they stack up against their rivals and cherry-pick their competition from the player roster as they look to seize territories. Win and increase team loyalty, recruit defeated riders and increase your supremacy on the streets while being upgraded in the rankings. But lose, and learn quickly that there are no points for second place in street racing. In addition to Street Supremacy’s stunning racing action, the cars in the game can also be modified to add an edge to the duels. The game's authentically modeled Nissans, Mitsubishis and Subarus can all be enhanced with new exhausts, paint jobs and spoilers. These all prove vital in shaving seconds off the lap times, while stickers and fancy lights can also be used to enhance the car's aesthetics, adding a layer of gloss to an already entertaining racer video game. Additionally, Street Supremacy also takes advantage of the PSP system's wireless functionality by letting gamers compete against a second player in the Vs. mode for a gripping head-to-head racing experience. [Konami]… Expand"}, {"name": "Street Power Soccer", "details_link": "https://www.metacritic.com/game/playstation-4/street-power-soccer", "publisher": "Maximum Games", "release_date": "Aug 25 2020", "developers": ["SFL Interactive"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Team", "Soccer", "Arcade"], "meta_score": 41, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/52c274ab94133392cc1a81df9422202c-98.jpg", "descriptions": "(Also known as \"Street Power Football\") Sick style and high-energy action come together in this completely over-the-top football experience. Featuring six distinct game modes from open-ended Freestyle and Trick Shot modes to head-to-head competition in Panna and up to 3v3 matches in Street(Also known as \"Street Power Football\") Sick style and high-energy action come together in this completely over-the-top football experience. Featuring six distinct game modes from open-ended Freestyle and Trick Shot modes to head-to-head competition in Panna and up to 3v3 matches in Street Power mode, you've never played football quite like this.\r Join street football legend Sean Garnier and face off with freestyle football greats on crazy playgrounds and pitches around the world. You'll learn to run circles around your friends and pull off insane tricks as you grow your status to become Street King.… Expand"}, {"name": "Dragon's Lair", "details_link": "https://www.metacritic.com/game/xbox-360/dragons-lair", "publisher": "Digital Leisure Inc.", "release_date": "May 18 2012", "developers": ["Digital Leisure Inc.", "Digital Leisure"], "platforms": ["iPhone/iPad", "PC", "PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Adventure", "Interactive Movie", "General", "Arcade", "Interactive Movie"], "meta_score": 41, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/11585d6a1720afd9861221357af843fc-98.jpg", "descriptions": "Dragon's Lair, one of the most beloved arcade games of all time can now be enjoyed from the comfort of your couch. This fully arcade authentic version is fully playable with Kinect or the Xbox 360 controller so you can really show how well you wield Dirk's sword. Included with this ultimateDragon's Lair, one of the most beloved arcade games of all time can now be enjoyed from the comfort of your couch. This fully arcade authentic version is fully playable with Kinect or the Xbox 360 controller so you can really show how well you wield Dirk's sword. Included with this ultimate edition are bonus Avatar items, Gamerpics and even a full watch feature to sit back and enjoy Don Bluth's stunning animation. In Dragon's Lair, you play the heroic Dirk the Daring, a valiant knight on a quest to rescue the fair princess from the clutches of an evil dragon! Find your way through the castle of a dark wizard, who has enchanted it with treacherous monsters and obstacles. Lead on adventurer. Your quest awaits!… Expand"}, {"name": "American Idol", "details_link": "https://www.metacritic.com/game/playstation-2/american-idol", "publisher": "Codemasters", "release_date": "Nov 11 2003", "developers": ["Hothouse Creations"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 41, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/a6e0fdaf769b594c6535ee1dd87e5e97-98.jpg", "descriptions": "[Also known as \"Pop Idol\"] Complete with a computer generated Randy Jackson, Paula Abdul and Simon Cowell, with trademark insults, American Idol is a music-based, rhythm -action game that will allow you to style a contestant for the competition. Once you have created your Idol you?ll see[Also known as \"Pop Idol\"] Complete with a computer generated Randy Jackson, Paula Abdul and Simon Cowell, with trademark insults, American Idol is a music-based, rhythm -action game that will allow you to style a contestant for the competition. Once you have created your Idol you?ll see your contestant through the auditions, various heats and then fingers crossed make it to the grand finale. However, if your contestant squeals and howls out of tune then prepare for heartache as Simon delivers one of his famous comments before you get booted off the show.… Expand"}, {"name": "101-in-1 Sports Party Megamix", "details_link": "https://www.metacritic.com/game/wii/101-in-1-sports-party-megamix", "publisher": "Atlus", "release_date": "Jan 13 2011", "developers": ["Nordcurrent"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General"], "meta_score": 41, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/bb2ba6b1cccd222025c730ab3444d385-98.jpg", "descriptions": "Friends and family members of all ages will have hours of fun earning points by successfully completing challenges and spending their points to reveal dozens of exciting new sports games, striving to unlock more and more each time. Simple to play and addicting to master, these games willFriends and family members of all ages will have hours of fun earning points by successfully completing challenges and spending their points to reveal dozens of exciting new sports games, striving to unlock more and more each time. Simple to play and addicting to master, these games will keep players engrossed in competing head-to-head with friends, scoring goals, earning medals, winning races, and beating high scores. There is practically no end to the fast-paced sports action!… Expand"}, {"name": "007 Legends", "details_link": "https://www.metacritic.com/game/playstation-3/007-legends", "publisher": "Activision", "release_date": "Oct 16 2012", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 41, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/9/945893ef01271721ba03391f3bd21ac0-98.jpg", "descriptions": "Each of the 007 Legends movie-inspired missions include multiple levels based on a re-imaginings of some of the most iconic Bond films, showcasing state-of-the-art spy gadgets, an arsenal of weapons and tricked-out vehicles, exotic locales, and intense moments that require Bond’s dexterityEach of the 007 Legends movie-inspired missions include multiple levels based on a re-imaginings of some of the most iconic Bond films, showcasing state-of-the-art spy gadgets, an arsenal of weapons and tricked-out vehicles, exotic locales, and intense moments that require Bond’s dexterity to defeat notorious villains and their wily henchmen.… Expand"}, {"name": "Mall Tycoon", "details_link": "https://www.metacritic.com/game/pc/mall-tycoon", "publisher": "Take-Two Interactive", "release_date": "Feb  3 2002", "developers": ["Holistic Design", "Inc."], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 41, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/37d2cf71a9463bb38034b3239749dd4f-98.jpg", "descriptions": "Every mall goer's ideal simulation. Design, build, and manage your very own shopping mall. Conduct marketing campaigns to attract new shoppers, organize fashion shows, and research the latest products to drive your shoppers crazy! The Mall is yours to control. But be careful to balance outEvery mall goer's ideal simulation. Design, build, and manage your very own shopping mall. Conduct marketing campaigns to attract new shoppers, organize fashion shows, and research the latest products to drive your shoppers crazy! The Mall is yours to control. But be careful to balance out your stores, and make sure to pay attention to your customers, because in this world, they are always right! [Take 2 Interactive]… Expand"}, {"name": "Duke Nukem: Manhattan Project", "details_link": "https://www.metacritic.com/game/xbox-360/duke-nukem-manhattan-project", "publisher": "Microsoft Game Studios", "release_date": "Jun 23 2010", "developers": ["3D Realms"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Platformer", "Shooter", "First-Person", "2D", "Scrolling", "Shoot-'Em-Up", "Sci-Fi", "Horizontal"], "meta_score": 41, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/fb0f27f0c3416aaf098fbccbde39ca5e-98.jpg", "descriptions": "[Xbox Live Arcade]  Duke Nukem is back in Duke Nukem Manhattan Project. New York City is being overrun by a mutant menace and it's time to de-worm the Big Apple. This 3-D action game features the politically incorrect action hero defending the city that never sleeps, and its babes, from the[Xbox Live Arcade]  Duke Nukem is back in Duke Nukem Manhattan Project. New York City is being overrun by a mutant menace and it's time to de-worm the Big Apple. This 3-D action game features the politically incorrect action hero defending the city that never sleeps, and its babes, from the evil Mech Morphix across 24 levels from Chinatown to Space. A super-sized collection of weapons, enemies and bosses await. As Duke would say, “Babes, bullets, bombs. Man, I love this job!”… Expand"}, {"name": "Clash of the Titans: The Videogame", "details_link": "https://www.metacritic.com/game/playstation-3/clash-of-the-titans-the-videogame", "publisher": "Namco Bandai Games", "release_date": "Jul 27 2010", "developers": ["Game Republic"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 41, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/7/dfb53f6bd68fe738acfd5b46635b0d77-98.jpg", "descriptions": "Set in the timeless grandeur of Greek mythology, Clash of the Titans immerses players into the epic battle for dominance between the human race and the powerful gods Hades and Zeus. Through vast landscapes of swamps, mountains and the underworld, two modes of play let players embody Perseus’Set in the timeless grandeur of Greek mythology, Clash of the Titans immerses players into the epic battle for dominance between the human race and the powerful gods Hades and Zeus. Through vast landscapes of swamps, mountains and the underworld, two modes of play let players embody Perseus’ adventure from the film, or take on original new bosses in fresh, dynamic adaptations of one of the greatest mythological stories ever told. This action-adventure game play arms players with an ever-changing arsenal of weapons and powers. Players can journey solo or team up with friends to complete quests as they encounter a roster of legendary villains including Medusa and the sea monster known as The Kraken. [Namco Bandai Games]… Expand"}, {"name": "Babylon's Fall", "details_link": "https://www.metacritic.com/game/playstation-5/babylons-fall", "publisher": "Square Enix", "release_date": "Mar  3 2022", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General", "Role-Playing", "Action RPG"], "meta_score": 41, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/4/c6a70c991ed41ee3e60775adadcc2787-98.jpg", "descriptions": "Experience acclaimed developer PlatinumGames' signature combat in BABYLON’S FALL with up to 3 other players or take on the Tower of Babel alone, in this new cooperative action RPG. After the Babylonians perished, only their great tower “The Ziggurat” remained. Now a new Empire has come toExperience acclaimed developer PlatinumGames' signature combat in BABYLON’S FALL with up to 3 other players or take on the Tower of Babel alone, in this new cooperative action RPG. After the Babylonians perished, only their great tower “The Ziggurat” remained. Now a new Empire has come to pillage its ruins and uncover its fabled treasures. Join forces with other Sentinels, unwilling subjects forcibly implanted with Gideon Coffin, relics that grant the few survivors unrivalled powers. Ascend to greatness as you climb the looming Tower of Babel and uncover its fabled treasures. Only by mastering the powers of your Gideon Coffin, will you unlock your true potential and become strong enough to survive the summit and uncover the secrets that await. Pre-order BABYLON'S FALL to obtain a unique customization for your character, The Empress' Insignia. Show off to other Sentinels that you were one of the first to obtain a Gideon Coffin and become a Sentinel. … Expand"}, {"name": "0 Day Attack on Earth", "details_link": "https://www.metacritic.com/game/xbox-360/0-day-attack-on-earth", "publisher": "Square Enix", "release_date": "Dec 23 2009", "developers": ["Gulti"], "platforms": "Xbox 360", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 41, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/233df1a6c9feedc512edb2e001a13530-98.jpg", "descriptions": "[Xbox Live Arcade]  Earth is under attack by massive creatures from outer space. With a huge arsenal of heavy-power artillery at your disposal, climb into your fighter jet and wage fierce battles against these gruesome aggressors. The  Arcade exclusive 0 Day Attack on Earth gives you full[Xbox Live Arcade]  Earth is under attack by massive creatures from outer space. With a huge arsenal of heavy-power artillery at your disposal, climb into your fighter jet and wage fierce battles against these gruesome aggressors. The  Arcade exclusive 0 Day Attack on Earth gives you full range of motion and attack while you engage in air strikes over real-world cities, such as Tokyo, New York and Paris. Team up with—or battle against—players from around the world in online co-op. Only you can save Earth from complete annihilation! [Square Enix]… Expand"}, {"name": "Iron Man 2", "details_link": "https://www.metacritic.com/game/playstation-3/iron-man-2", "publisher": "Sega", "release_date": "May  4 2010", "developers": ["Sega Studios San Francisco"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 41, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/9/131a6399bdb155b9a385ad82708546fa-98.jpg", "descriptions": "Packed with favorites from the movie and comic book worlds, Iron Man 2: The Video Game offers gamers a chance to choose between Iron Man and War Machine, as they battle through hugely destructible indoor and outdoor environments. Tony and Rhodey both come equipped with their own distinctPacked with favorites from the movie and comic book worlds, Iron Man 2: The Video Game offers gamers a chance to choose between Iron Man and War Machine, as they battle through hugely destructible indoor and outdoor environments. Tony and Rhodey both come equipped with their own distinct assortments of fully customizable, earth-shattering weapons, as well as vicious melee combat moves, all of which will come in handy against the likes of Crimson Dynamo and other classic Marvel foes. [Sega]… Expand"}, {"name": "Dollhouse", "details_link": "https://www.metacritic.com/game/playstation-4/dollhouse", "publisher": "Soedesco", "release_date": "May 24 2019", "developers": ["Creazn", "Soedesco"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 41, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/9/cdc39a17486dac3c09f603cf7a830c1d-98.jpg", "descriptions": "This haunting horror game draws you into the mysterious atmosphere of film noir. Delve deep into the mind of Marie, a detective trying to unravel the secrets of her past, memory by memory. Use the ‘Focus’ feature to see through the eyes of your pursuer as you try to survive a suspensefulThis haunting horror game draws you into the mysterious atmosphere of film noir. Delve deep into the mind of Marie, a detective trying to unravel the secrets of her past, memory by memory. Use the ‘Focus’ feature to see through the eyes of your pursuer as you try to survive a suspenseful game of cat and mouse.… Expand"}, {"name": "Star Trek: Shattered Universe", "details_link": "https://www.metacritic.com/game/xbox/star-trek-shattered-universe", "publisher": "TDK Mediactive", "release_date": "Jan 14 2004", "developers": ["Starsphere Interactive"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Large Spaceship"], "meta_score": 41, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/6/516841c7d8b0b564bdb425481ece840c-98.jpg", "descriptions": "All hands to battle stations.  Get ready for a frenetic experience in an entirely new breed of Star Trek game: Star Trek: Shattered Universe.  An intense, edgy, high-energy space-combat action game set in the dark mirror universe of Star Trek: The Original Series classic-era setting, theAll hands to battle stations.  Get ready for a frenetic experience in an entirely new breed of Star Trek game: Star Trek: Shattered Universe.  An intense, edgy, high-energy space-combat action game set in the dark mirror universe of Star Trek: The Original Series classic-era setting, the game challenges you to adapt to a new reality where the noble Federation is now an evil and relentless foe.  Prepare to journey on a variety of missions featuring the most intense space-combat ever, where friends become enemies, enemies become allies and all the rules are broken.  You must master the deadly art of fighter combat to survive the dangerous journey ahead.… Expand"}, {"name": "Nickelodeon Kart Racers", "details_link": "https://www.metacritic.com/game/switch/nickelodeon-kart-racers", "publisher": "GameMill Entertainment", "release_date": "Oct 23 2018", "developers": ["Bamtang", "Maximum Games"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 41, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/5/2bab276249df2594b65392a396e4396d-98.jpg", "descriptions": "Hit the Slime-filled race tracks with Nickelodeon Kart Racers. Select a racer from one of your favorite Nickelodeon series, including SpongeBob, Patrick, and Sandy from SpongeBob SquarePants, Leonardo, Raphael, Michelangelo, and Donatello from Teenage Mutant Ninja Turtles, Arnold and HelgaHit the Slime-filled race tracks with Nickelodeon Kart Racers. Select a racer from one of your favorite Nickelodeon series, including SpongeBob, Patrick, and Sandy from SpongeBob SquarePants, Leonardo, Raphael, Michelangelo, and Donatello from Teenage Mutant Ninja Turtles, Arnold and Helga from Hey Arnold!, & Angelica, Tommy and Reptar from Rugrats. Race your friends in up to 4-player local multiplayer or check out the Battle Arena for a variety of challenges. Hit the road with racers from some of your favorite Nickelodeon series in a variety of Slime-filled tracks in the ultimate race to win cups and upgrades for your Kart! There's no slowing down there -- shift to the next gear and challenge your friends in split-screen racing and battle modes.… Expand"}, {"name": "Way of the Dogg", "details_link": "https://www.metacritic.com/game/xbox-360/way-of-the-dogg", "publisher": "505 Games", "release_date": "May  3 2013", "developers": ["Echo Peak"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "genres": ["General", "Action", "General"], "meta_score": 41, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/3/c2abc50fa304559a3fae381e85f60edc-98.jpg", "descriptions": "Train as AJ, pick a side, take your chances and find the way: The Way of the Dogg. Way of the Dogg is a brutal, rhythm-action combat adventure, set to Snoop Dogg’s music. Each level is a fresh fight against a different character in a new location defined by a Snoop Dogg track. As AJ, fightTrain as AJ, pick a side, take your chances and find the way: The Way of the Dogg. Way of the Dogg is a brutal, rhythm-action combat adventure, set to Snoop Dogg’s music. Each level is a fresh fight against a different character in a new location defined by a Snoop Dogg track. As AJ, fight your way through 14 levels, each a superbly choreographed beat-matched fight, set to Snoop's music, including 'Who am I?', 'Gz and Hustlas' and '10 Lil Crips' to name but a few.  Go head-to head with friends in multiplayer rhythm battles and follow Snoop's lead in the Temple Tutorials. Train with Snoop, pick a side, take your chances and find the way: The Way of the Dogg. … Expand"}, {"name": "4PM", "details_link": "https://www.metacritic.com/game/pc/4pm", "publisher": "4PM GAME", "release_date": "Jul  9 2014", "developers": ["Bojan Brbora"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 41, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/4/0fd2a68ee5481a61cd42268099544bea-98.jpg", "descriptions": "4PM is a short, narrative driven game, made by one person as an attempt to tell a real, thriller story in the form of an interactive experience. It has high production values and a cinematic style. It is, with your support, a first in a series of smaller, narrative driven experiences, that4PM is a short, narrative driven game, made by one person as an attempt to tell a real, thriller story in the form of an interactive experience. It has high production values and a cinematic style. It is, with your support, a first in a series of smaller, narrative driven experiences, that spare no expense on audio-visual style.… Expand"}, {"name": "WWII Aces", "details_link": "https://www.metacritic.com/game/wii/wwii-aces", "publisher": "Destineer", "release_date": "Mar 21 2008", "developers": ["Arcade Moon"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 41, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/54e2c66740b8cd37ba513bdf48125105-98.jpg", "descriptions": "Roll, loop, dodge and shoot like an Ace with simple motion controls in WWII Aces for the Wii™ system. Fly alone or with a friend via split-screen co-op as you join the ranks of the Royal Air Force, Soviet Air Force, or Luftwaffe and pilot 12 authentic airplanes through multiple campaignsRoll, loop, dodge and shoot like an Ace with simple motion controls in WWII Aces for the Wii™ system. Fly alone or with a friend via split-screen co-op as you join the ranks of the Royal Air Force, Soviet Air Force, or Luftwaffe and pilot 12 authentic airplanes through multiple campaigns based on real events. Or, take on your friend in thrilling competitive multiplayer! Published by Destineer and developed by Arcade Moon, World War II Aces immerses players in the intense dogfighting and acrobatic maneuvers that typified World War II via the most intuitive flight controls on the Wii yet. Execute barrel rolls, loops, and last-second dodges with a flick of the Wii Remote, or attach the Nunchuck addition for a more realistic control scheme. [Destineer]… Expand"}, {"name": "Delta Force: Xtreme 2", "details_link": "https://www.metacritic.com/game/pc/delta-force-xtreme-2", "publisher": "NovaLogic", "release_date": "May 27 2009", "developers": ["NovaLogic"], "platforms": "PC", "genres": ["Action", "General", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 40, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/8/0178116a765ae2d8e071296c853078ee-98.jpg", "descriptions": "The world's most deadly fighting force is back in all new multiplayer combat Delta Force: Xtreme 2 (DFX2) for the PC. The sequel to Delta Force: Xtreme is supported by the NovaWorld Community, a multiplayer network that provides smoother, faster and seamless gameplay for up to 150 playersThe world's most deadly fighting force is back in all new multiplayer combat Delta Force: Xtreme 2 (DFX2) for the PC. The sequel to Delta Force: Xtreme is supported by the NovaWorld Community, a multiplayer network that provides smoother, faster and seamless gameplay for up to 150 players per game. With 10 single-player missions and nine co-op missions within two campaigns, players immerse themselves into the Delta Force experience by battling enemies in Asia.  Now available for download from www.novalogic.com, Valve, Direct2Drive and RealNetworks and at retail locations nationwide, DFX2 carries the recession busting price of just $29.99 (MSRP). DFX2 offers intense military gameplay in stunning 1080p Full HD and Dolby 7.1 Surround sound, and with game servers placed strategically around the world, the NovaWorld Community provides the gameplay that fans demand.  Featuring 20 content-rich multiplayer maps, DFX2 supports five of the most popular game types: Deathmatch, Team Deathmatch, Team King of the Hill, Capture the Flag, and Flagball. Each detailed map has something for everyone, from large, vehicle heavy battlefields to small, intense engagement zones. In addition to the feature-loaded multiplayer experience, gamers of all skill levels can mix it up in two heart-pounding single-player or co-operative campaigns where  players assume the role of a Delta Force operator sent to Asia to bring a drug cartel and former Soviet mercenaries to justice. The NovaWorld Community allows every element of the gameplay, from the enhanced ballistics to the innovative in-vehicle spawn system, to be carefully coordinated to support a fully balanced experience where teamwork is deadlier than individual firepower, and in DFX2, intelligence and creativity are rewarded as much as fast-twitch reflexes. The game also ships with a powerful MED level editor, which will allow gamers full utilization of game assets to create their own levels, including additional multiplayer game types. [NovaLogic]… Expand"}, {"name": "Slain!", "details_link": "https://www.metacritic.com/game/pc/slain!", "publisher": "Digerati Distribution", "release_date": "Mar 24 2016", "developers": ["Wolf Brew Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 40, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/5bb9ac239008650cc82abb97442d6fa2-98.jpg", "descriptions": "Players control Bathoryn, a lycanthropic hero in a Gothic world, seeking to liberate seven great towers from 7 deadly overlords. Bathoryn must battle his way through a doomed land packed with gruesome pixel art foes before ascending (or sometimes descending) each tower, defeating puzzles,Players control Bathoryn, a lycanthropic hero in a Gothic world, seeking to liberate seven great towers from 7 deadly overlords. Bathoryn must battle his way through a doomed land packed with gruesome pixel art foes before ascending (or sometimes descending) each tower, defeating puzzles, traps and monsters alike.… Expand"}, {"name": "Alekhine's Gun", "details_link": "https://www.metacritic.com/game/pc/alekhines-gun", "publisher": "Maximum Games", "release_date": "Mar 11 2016", "developers": ["Maximum Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Action Adventure", "General"], "meta_score": 40, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/5/9dc5a61e91bd32ea7e2e2eed11c5a931-98.jpg", "descriptions": "It is the height of the Cold War, a time of global uncertainty and civil unrest. In this stealth shooter you play Agent Alekhine, a highly skilled Russian assassin driven by a moral compass that leads you headfirst into a covert operation unsanctioned by the country you serve. WorkingIt is the height of the Cold War, a time of global uncertainty and civil unrest. In this stealth shooter you play Agent Alekhine, a highly skilled Russian assassin driven by a moral compass that leads you headfirst into a covert operation unsanctioned by the country you serve. Working alongside American CIA agents, your mission is clear - though how you accomplish it is anything but - as the tension of a nuclear standoff grows with each passing minute. In a world where one wrong move could be the end of you, navigating a new direction comes at a price. … Expand"}, {"name": "Tank Beat", "details_link": "https://www.metacritic.com/game/ds/tank-beat", "publisher": "O3 Entertainment", "release_date": "Jun  1 2007", "developers": ["MileStone Inc."], "platforms": "DS", "num_players": "4  Online", "genres": ["Action", "Simulation", "General", "General", "Vehicle", "Combat"], "meta_score": 40, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/691fa610ddfcc0a52c15b573e9dffec0-98.jpg", "descriptions": "Tank Beat is entirely stylus-based. As you draw tracks and fire on the DS's bottom screen game map, your tank appears and responds on the top screen. Players engage in a variety of missions and commandeer a full range of tanks: from tiny scrappers, to missile carriers, to giant Panzers. TheTank Beat is entirely stylus-based. As you draw tracks and fire on the DS's bottom screen game map, your tank appears and responds on the top screen. Players engage in a variety of missions and commandeer a full range of tanks: from tiny scrappers, to missile carriers, to giant Panzers. The game will ship with three modes: Story, Skirmish, and Battle. In single player Story Mode, players progress through 27 levels of play and unlock various tanks as they achieve objectives. Skirmish Mode allows players to practice on any of the maps and tanks that were unlocked in Story Mode plus additional exclusive levels. Free-for-all Battle Mode pitches up to 4 players against each other in either wireless head to head action or via the Nintendo Wi-Fi connection. [O3 Entertainment]… Expand"}, {"name": "The Polar Express", "details_link": "https://www.metacritic.com/game/gamecube/the-polar-express", "publisher": "THQ", "release_date": "Nov  2 2004", "developers": ["Blue Tongue Entertainment"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 40, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/f208c43dff2ec7bef4df174da81a41bd-98.jpg", "descriptions": "In this adventure based on the Polar Express movie, you'll take a magical ride through eight chapters. A mysterious conductor shepherds you aboard a train to meet Santa Claus at the North Pole. Along the way, you'll meet all your favorite characters from the film, including the GirlIn this adventure based on the Polar Express movie, you'll take a magical ride through eight chapters. A mysterious conductor shepherds you aboard a train to meet Santa Claus at the North Pole. Along the way, you'll meet all your favorite characters from the film, including the Girl Know-it-All, Lonely Boy, the Hobo, Smokey & Steamer, and the Elves. Experience minigames, solve puzzles, and search for lost presents as you explore expansive environments.… Expand"}, {"name": "Around the World in 80 Days", "details_link": "https://www.metacritic.com/game/game-boy-advance/around-the-world-in-80-days", "publisher": "Hip Games", "release_date": "Jul  5 2004", "developers": ["Saffire"], "platforms": ["PC", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 40, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/5cf774c465fa5350ea1a2072bbb4db21-98.jpg", "descriptions": "Based on the new movie by Walden Media, Around the World in 80 Days takes you on a series of adventures. The story begins when the inventor Phileas Fogg takes on a bet against his nemesis, Lord Kelvin, that he can travel around the world in 80 days. As Passepartout, Fogg's French valet, youBased on the new movie by Walden Media, Around the World in 80 Days takes you on a series of adventures. The story begins when the inventor Phileas Fogg takes on a bet against his nemesis, Lord Kelvin, that he can travel around the world in 80 days. As Passepartout, Fogg's French valet, you must accompany Fogg on a journey that begins in the streets of London and continues in Paris, Turkey, India, China, the western US deserts, and New York. Your mission is to help your companions safely pass through exotic locations, while overcoming dangerous obstacles and enemies. … Expand"}, {"name": "Evil Dead: Hail to the King", "details_link": "https://www.metacritic.com/game/pc/evil-dead-hail-to-the-king", "publisher": "THQ", "release_date": "Mar 28 2001", "developers": ["Heavy Iron Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 40, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/5/a27f21296e1e58674a32664ebe6094cb-98.jpg", "descriptions": "Inspired by Sam Raimi and Bruce Campbell's cult horror trilogy -- \"Evil Dead,\" \"Evil Dead 2:  Dead by Dawn,\" and \"Army of Darkness,\" the PC version of the game again requires the player to bring back torn pages from the Necronomicon to rid the world of those pesky roaming monsters."}, {"name": "Naval Assault: The Killing Tide", "details_link": "https://www.metacritic.com/game/xbox-360/naval-assault-the-killing-tide", "publisher": "505 Games", "release_date": "Jun 15 2010", "developers": ["Artech Studios"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Simulation", "Submarine", "Submarine", "Marine", "Combat"], "meta_score": 40, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/6/634b31fdc413d4de688a927983fc9bb3-98.jpg", "descriptions": "Naval Assault: The Killing Tide follows a dramatic storyline of subterfuge inspired by the events of WWII where you command a fully armed submarine. Engage in sea warfare against enemy ships, subs and aircrafts, leading a daring US Naval Special Ops team across 30 levels that culminate in aNaval Assault: The Killing Tide follows a dramatic storyline of subterfuge inspired by the events of WWII where you command a fully armed submarine. Engage in sea warfare against enemy ships, subs and aircrafts, leading a daring US Naval Special Ops team across 30 levels that culminate in a spectacular sea battle. [505 Games]… Expand"}, {"name": "The Chaos Engine (2013)", "details_link": "https://www.metacritic.com/game/pc/the-chaos-engine-2013", "publisher": "Mastertronic", "release_date": "Aug 29 2013", "developers": ["Abstraction Games"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Shoot-'Em-Up", "Sci-Fi", "Sci-Fi", "Top-Down"], "meta_score": 40, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/7d6a3f03f4c2160d8f424acb761ba389-98.jpg", "descriptions": "The Chaos Engine is a classic Amiga top-down shooter game originally developed by The Bitmap Brothers that will be restored by Abstraction Games and brought to the PC, Mac, and Linux."}, {"name": "Space Raiders", "details_link": "https://www.metacritic.com/game/gamecube/space-raiders", "publisher": "Mastiff", "release_date": "Apr 19 2004", "developers": ["Taito Corporation"], "platforms": ["PC", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 40, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/b2f37f005953d8237a41c6104127a3b3-98.jpg", "descriptions": "Nothing bites like a sky filled with invading alien space craft busily destroying civilization. And it gets really personal when the invaders drop hordes of ground troops to kill you and the people you love.  Ask Justin the street gang leader hoping to find and rescue his friend alive,Nothing bites like a sky filled with invading alien space craft busily destroying civilization. And it gets really personal when the invaders drop hordes of ground troops to kill you and the people you love.  Ask Justin the street gang leader hoping to find and rescue his friend alive, Ashley the fashion photographer searching desperately for her boyfriend and Naji, a cop who wants his partner back. They're all playable characters fighting for their lives, to avenge those who have died and in the hope of finding disappeared friends.\r Space Raiders, from the people who brought you Space Invaders, features addictive play, immersive 3-D environments, monster designs that keeps the player wondering what's behind the next corner, and great game balance. The story features one player Story Mode and one or two player cooperative Survival Mode. … Expand"}, {"name": "Dr. Seuss' The Cat in the Hat", "details_link": "https://www.metacritic.com/game/game-boy-advance/dr-seuss-the-cat-in-the-hat", "publisher": "VU Games", "release_date": "Nov  5 2003", "developers": ["Digital Eclipse"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 40, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/a6debf5bd5cd338e4deaa019248e8510-98.jpg", "descriptions": "Go beyond the zany fun of the movie with an unbelievable adventure starring you as The Cat in the Hat.  The Cat's crate has been opened and Seussian magic has turned the house inside out. You'll encounter all the wacky characters from the movie as you race to restore order to the houseGo beyond the zany fun of the movie with an unbelievable adventure starring you as The Cat in the Hat.  The Cat's crate has been opened and Seussian magic has turned the house inside out. You'll encounter all the wacky characters from the movie as you race to restore order to the house before Mom comes home.  The Cat has his amazing umbrella, floating moves, and other tricks up his sleeve to help you through the 16 levels of pandemonium.  … Expand"}, {"name": "Ducati World Racing Challenge", "details_link": "https://www.metacritic.com/game/dreamcast/ducati-world-racing-challenge", "publisher": "Acclaim", "release_date": "Feb 13 2001", "developers": ["Attention To Detail"], "platforms": ["PC", "Dreamcast"], "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 40, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/0ea65d169610427d86f0f380148efab8-98.jpg", "descriptions": "Currently being developed by Attention to Detail and based on the renowned Ducati motorcycle brand, the game will include both a traditional arcade mode and a simulation mode."}, {"name": "Ace Banana", "details_link": "https://www.metacritic.com/game/playstation-4/ace-banana", "publisher": "Oasis Games", "release_date": "Oct 13 2016", "developers": ["TVR"], "platforms": "PlayStation 4", "genres": ["Action", "General"], "meta_score": 40, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/859371fbdb7e32d715ecf4ed26890263-98.jpg", "descriptions": "In the game, players assume the role of a Banana Archer, the world-famous protectors of bananas. In opposition are hordes of mischievous monkeys, set on stealing bananas from the player’s stash."}, {"name": "DRIV3R", "details_link": "https://www.metacritic.com/game/pc/driv3r", "publisher": "Atari", "release_date": "Mar 15 2005", "developers": ["Reflections Interactive"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Action Adventure", "Racing", "Mission-based", "Arcade", "Mission-based", "Open-World", "Automobile"], "meta_score": 40, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/4/99b718044aa20dead557ae8d7613d336-98.jpg", "descriptions": "DRIV3R is an action-packed driving adventure game that recreates the excitement of a Hollywood blockbuster and plays like an interactive movie. DRIV3R stays true to its roots, incorporating the cinematic gameplay and gritty street crime of its predecessors with ground breaking graphics andDRIV3R is an action-packed driving adventure game that recreates the excitement of a Hollywood blockbuster and plays like an interactive movie. DRIV3R stays true to its roots, incorporating the cinematic gameplay and gritty street crime of its predecessors with ground breaking graphics and three mammoth wide open city environments. Featuring Hollywood-level production values and a gripping, narrative story line, DRIV3R casts players once again as Tanner, a jaw breaking, no-holds-barred undercover cop and master \"Wheelman\" who does whatever it takes to bring the bad guys down. Tanner, alongside his longtime partner, Tobias, must infiltrate a global car theft ring in tire squealing chases and fierce on-foot firefights while tailing gangsters, chasing witnesses, stealing cars and unloading massive clips of ammo to bring the criminals to justice.… Expand"}, {"name": "Screwjumper!", "details_link": "https://www.metacritic.com/game/xbox-360/screwjumper!", "publisher": "THQ", "release_date": "Nov 14 2007", "developers": ["Frozen Codebase"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "General", "General"], "meta_score": 40, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/5/f0d7b36164acf21a29bd21fdb0da08a5-98.jpg", "descriptions": "[Xbox Live Arcade]  Take the plunge in Screwjumper! Freefall into the depths of the chaotic underworld as a Screwjumper, and drive the aliens back to their home world by destroying their precious mining equipment. Demolish structures in freefall as you increase your destructive power by[Xbox Live Arcade]  Take the plunge in Screwjumper! Freefall into the depths of the chaotic underworld as a Screwjumper, and drive the aliens back to their home world by destroying their precious mining equipment. Demolish structures in freefall as you increase your destructive power by increasing your velocity. Use dynamite to pick off hazards and high value targets. Destroy the mine core and jetpack out alive. Dead screwjumpers don't get paid. Multiple levels and characters: Descend and destroy 20 mines on four different planets with six different characters, including Skruii the foreman of the Screwjumpers Union, Filch the reckless thrill-seeker, Zyree the unpredictable, Xoona the aloof, Ula the mad, and Zomar the mysterious. Ultimate destruction: Chain your destruction by plunging through objects at ultra-terminal speeds. You're a screwjumper. Go for it. Single player modes: Risk your neck in four single-player modes including Destruction, Race, Time Trial, and Score. Multiplayer: Compete with your friends via split screen and Xbox LIVE multiplayer. [Microsoft]… Expand"}, {"name": "Made Man: Confessions of the Family Blood", "details_link": "https://www.metacritic.com/game/pc/made-man-confessions-of-the-family-blood", "publisher": "Aspyr", "release_date": "Apr 23 2007", "developers": ["Silverback Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 40, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/b5c5a6be448410a818f8613cd8882a0b-98.jpg", "descriptions": "Made Man is based on real-world events and will allow players to assume the role of Joey Verola as he is indoctrinated into the dark world of organized crime and relive his life - every moment, every kill - as he rises through the ranks to become a \"Made Man\". Game created in conjunctionMade Man is based on real-world events and will allow players to assume the role of Joey Verola as he is indoctrinated into the dark world of organized crime and relive his life - every moment, every kill - as he rises through the ranks to become a \"Made Man\". Game created in conjunction with David Fisher, an accomplished author and respected authority on the Mafia, who possesses unparalleled knowledge and access into the inner workings of organized crime; Authentic Mafia-inspired gameplay scenarios, including bookmaking, racketeering, loan sharking, hijacking, assassinations, numbers running and high body count family wars; Over 25 weapons to master, including a Beretta, shotgun, machine gun and more; Full complement of melee weapons - chairs, pool cues and balls, bats, telephones - in the environments that can be used to wreak havoc, unleash pain and gain respect; Human shield/disarm mechanics for taking cover and getting out of sticky situations; Picture in Picture system, providing the player with greater awareness of the in-game action; and 20 diverse and fully-deformable environments. [Acclaim]… Expand"}, {"name": "Chronus Arc", "details_link": "https://www.metacritic.com/game/3ds/chronus-arc", "publisher": "Kemco", "release_date": "Oct  1 2015", "developers": ["Kemco", "Hit-Point Co.", "Ltd."], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 40, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/64cf183f18dd1a3a0e43096685bd55ff-98.jpg", "descriptions": "Venture through puzzle-filled dungeons to bring the past back to the present!"}, {"name": "Adventure Time: Explore the Dungeon Because I DON'T KNOW!", "details_link": "https://www.metacritic.com/game/wii-u/adventure-time-explore-the-dungeon-because-i-dont-know!", "publisher": "D3Publisher", "release_date": "Nov 19 2013", "developers": ["WayForward"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360", "Wii U"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 40, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/d12f03fe64e7e5763d130e50d693d499-98.jpg", "descriptions": "Adventure Time: Explore the Dungeon Because I DON'T KNOW has you save the Candy Kingdom by exploring the mysteries surrounding a massive Secret Royal Dungeon deep below the Land of Ooo."}, {"name": "Emergency Mayhem", "details_link": "https://www.metacritic.com/game/wii/emergency-mayhem", "publisher": "Codemasters", "release_date": "Apr 15 2008", "developers": ["Supersonic Software"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 40, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/4/5314d7631eb2dcf6e76a5f7c82dcddfe-98.jpg", "descriptions": "Exclusively for Wii, Emergency Mayhem mixes fast and frantic driving action with hilarious arcade mini games. Take charge of the three Emergency Services, you’ll have to battle the traffic and shoot down shortcuts as you race from crazy catastrophe to daft disaster. At each incident, you'llExclusively for Wii, Emergency Mayhem mixes fast and frantic driving action with hilarious arcade mini games. Take charge of the three Emergency Services, you’ll have to battle the traffic and shoot down shortcuts as you race from crazy catastrophe to daft disaster. At each incident, you'll use the Wii Remote in wacky ways to solve unique crises, from disarming bombs to herding escaped penguins! Then it's on to the next emergency - no time to waste! [Codemasters]… Expand"}, {"name": "Protothea", "details_link": "https://www.metacritic.com/game/wii/protothea", "publisher": "Ubisoft", "release_date": "Jun  2 2008", "developers": ["Digital Builders", "Sabarasa Entertainment"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 40, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/aa77183c5144b953ad6283e5c75eab03-98.jpg", "descriptions": "[WiiWare]  Protothea is a 3D top-down vertical scrolling shooter game putting players in complete control of a last-generation spaceship via the Wii Remote and Nunchuk. The easy-to-play game introduces new concepts to a beloved classic game style while mixing genres and utilizing the full[WiiWare]  Protothea is a 3D top-down vertical scrolling shooter game putting players in complete control of a last-generation spaceship via the Wii Remote and Nunchuk. The easy-to-play game introduces new concepts to a beloved classic game style while mixing genres and utilizing the full capabilities of the Wii system, from graphics to controls. The storyline immerses players into an adventure where they need to destroy an asteroid called \"Maqno 01\" and sabotage the plans of a political faction called \"The Core.\" Players quickly jump right in and guide their ship through multiple missions on futuristic planets where enemy AI is dynamic and changes based on the player's actions - so there are no predictable enemy paths, and therefore always a different game play experience. Players have a wide range of eight different air-to-air weapons and two different air-to-ground bombs at their disposal, and can attack however they choose. In addition, there is a special power that decelerates time, allowing players to easily avoid enemy fire while they are able to move rapidly and attack enemies. [Ubisoft]… Expand"}, {"name": "Psychotoxic", "details_link": "https://www.metacritic.com/game/pc/psychotoxic", "publisher": "Whiptail Interactive", "release_date": "Feb 25 2005", "developers": ["NuClearVision"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 40, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/4/563e6661b2265ac75dff703a7355997e-98.jpg", "descriptions": "PsychoToxic places gamers in the shoes of heroine Angie Prophet who, unbeknownst to her, must save mankind from impending nuclear Armageddon. The year is 2022, the place is New York City and as Angie's role as savior unfolds so too does her understanding of why she is the only one thatPsychoToxic places gamers in the shoes of heroine Angie Prophet who, unbeknownst to her, must save mankind from impending nuclear Armageddon. The year is 2022, the place is New York City and as Angie's role as savior unfolds so too does her understanding of why she is the only one that stands in the way of the Fourth Horseman of the Apocalypse and the destruction of civilization. Throughout the game, Angie continues to discover a series of unique abilities, such as invisibility, the slowing of time and the infiltration of other's dreams, all of which aid her progress. [Whiptail Interactive]… Expand"}, {"name": "ShellShock 2: Blood Trails", "details_link": "https://www.metacritic.com/game/pc/shellshock-2-blood-trails", "publisher": "Eidos Interactive", "release_date": "Feb 13 2009", "developers": ["Rebellion"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Historic", "Historic", "Historic", "Arcade"], "meta_score": 40, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/ab13c54156f7cc17746a66943cf4ffbe-98.jpg", "descriptions": "ShellShock 2: Blood Trails is a violent, first-person, survival horror game set against the backdrop of the Vietnam War. Gameplay centers on the use of psychological horror and fear, relying on the power of suggestion, mood, tension and foreshadowing - implying the notion of danger,ShellShock 2: Blood Trails is a violent, first-person, survival horror game set against the backdrop of the Vietnam War. Gameplay centers on the use of psychological horror and fear, relying on the power of suggestion, mood, tension and foreshadowing - implying the notion of danger, potential danger, imminent danger, and horrifying acts that have or are implied to have occurred or will come to pass. On course for war torn Vietnam, a plane carrying a top-secret cargo known only as Whiteknight is lost over the uncharted jungles of Cambodia. The special ops squad sent in to retrieve it disappear wtihout trace. Until, a month later, one of them walks out. Something in the darkness has driven him insane... Something from the darkness has followed him out. [Eidos Interactive]… Expand"}, {"name": "Underground Pool", "details_link": "https://www.metacritic.com/game/ds/underground-pool", "publisher": "UFO Interactive", "release_date": "Jan 26 2007", "developers": ["FrontLine Studios"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 40, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/cdb93e3ad9c92fa7df1f12d91445873c-98.jpg", "descriptions": "(Also known as \"Actua Pool\")  Graphics and precision ball movement with touch screen capability. Underground Pool utilizes the power of the Nintendo DS touch screen feature to create accurate gameplay in the best pool halls in the world. 5 game modes - including: 8 ball and 9 ball.(Also known as \"Actua Pool\")  Graphics and precision ball movement with touch screen capability. Underground Pool utilizes the power of the Nintendo DS touch screen feature to create accurate gameplay in the best pool halls in the world. 5 game modes - including: 8 ball and 9 ball. Multiplayer Mode - up to 4 players. 8 tables with various speeds. 8 cool characters to choose from. Customized game options.… Expand"}, {"name": "Freedom: First Resistance", "details_link": "https://www.metacritic.com/game/pc/freedom-first-resistance", "publisher": "Red Storm Entertainment", "release_date": "Dec 14 2000", "developers": ["Red Storm Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "General"], "meta_score": 40, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/9/9bf1dcbcf2ccf2bd0951222511b31a93-98.jpg", "descriptions": "Earth has been invaded by aliens that have forced all humans into captivity. All but a small rebel group. Now it's up to you to guide this force of resistance against the aliens using your limited resources and unbreakable will. You're the final protector of Earth's most precious resource --Earth has been invaded by aliens that have forced all humans into captivity. All but a small rebel group. Now it's up to you to guide this force of resistance against the aliens using your limited resources and unbreakable will. You're the final protector of Earth's most precious resource -- its freedom.  [Red Storm Entertainment]… Expand"}, {"name": "Eureka Seven Vol. 2: The New Vision", "details_link": "https://www.metacritic.com/game/playstation-2/eureka-seven-vol-2-the-new-vision", "publisher": "Namco Bandai Games America", "release_date": "Apr 23 2007", "developers": ["Namco Bandai Games America"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 40, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/1e32ec3d4f010a273a970c8a73b7c8de-98.jpg", "descriptions": "After abandoning the corrupt military and becoming a professional lifter, Sumner Sturgeon has become disenchanted with the life of an air sport athlete. Fate intervenes when his lost love returns and enlists his help to discover and stop the creation of the dangerous CFS (Compact FeedbackAfter abandoning the corrupt military and becoming a professional lifter, Sumner Sturgeon has become disenchanted with the life of an air sport athlete. Fate intervenes when his lost love returns and enlists his help to discover and stop the creation of the dangerous CFS (Compact Feedback System). Join Sumner on his quest to find the truth, compete in lift races, and pilot over 17 powerful LFOs (Light Finding Operations) in a variety of thrilling gameplay modes such as Story Mode, Survival Mode, Dream Match and Conflict Mode. With a storyline that arrives at the dawn of the anime series, this anticipated title promises to deliver an enduring action-propelled experience. [Namco Bandai Games]… Expand"}, {"name": "Adventure Time: Explore the Dungeon Because I DON'T KNOW!", "details_link": "https://www.metacritic.com/game/playstation-3/adventure-time-explore-the-dungeon-because-i-dont-know!", "publisher": "D3Publisher", "release_date": "Nov 19 2013", "developers": ["WayForward"], "platforms": ["3DS", "PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 40, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/c3106a8ad4808f9468b73dc6571bf669-98.jpg", "descriptions": "Adventure Time: Explore the Dungeon Because I DON'T KNOW has you save the Candy Kingdom by exploring the mysteries surrounding a massive Secret Royal Dungeon deep below the Land of Ooo."}, {"name": "Xiaolin Showdown", "details_link": "https://www.metacritic.com/game/xbox/xiaolin-showdown", "publisher": "Konami", "release_date": "Nov 15 2006", "developers": ["BottleRocket Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 40, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/3379203e25318708d42b42a64310d8bc-98.jpg", "descriptions": "Lead a kung fu monk and his three martial arts warriors on an action packed quest to search and protect the Shen Gong Wu. Omi, a Kung Fu monk leads three young dragons-in-training on their globetrotting adventures to search and protect the Shen Gong Wu, mystical power objects that gives itsLead a kung fu monk and his three martial arts warriors on an action packed quest to search and protect the Shen Gong Wu. Omi, a Kung Fu monk leads three young dragons-in-training on their globetrotting adventures to search and protect the Shen Gong Wu, mystical power objects that gives its possessor super powers, from a band of villains led by Evil Boy Genius Jack Spicer, his army of robots and an ancient witch Wuya. They fight for the Shen Gong Wu one showdown at a time, where the universe transforms itself into a mystical, hyper-reality world. Our heroes have to rely on their superb martial arts skills, wits, and the mystical powers of the Shen Gong Wu to fight evil. Based on the WB Kids animated series players control 4 warriors, working closely to together to combine their mystical powers, as they advance on their quest. Find and collect Shen Wong Gu while progressing thru an environment filled with hazards, enemies, and collectables. Compete in \"Showdowns\" that transport your warriors and test your martial arts skills. Battle epic bosses in winner-take all arena style combat. Six playable characters with mystical kung-fu powers.… Expand"}, {"name": "Painkiller: Hell & Damnation", "details_link": "https://www.metacritic.com/game/playstation-3/painkiller-hell-damnation", "publisher": "Nordic Games Publishing", "release_date": "Nov 26 2013", "developers": ["The Farm 51"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 40, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/484b304fcfd1b37da98badaeeaa892df-98.jpg", "descriptions": "Powered by Epic's world-renowned and highly-respected Unreal Engine 3, Painkiller Hell & Damnation recreates the sensations and hardcore gameplay of the original Painkiller. Released in 2004, Painkiller won high praise and many accolades and fans for its fast and unique gameplay. KeepingPowered by Epic's world-renowned and highly-respected Unreal Engine 3, Painkiller Hell & Damnation recreates the sensations and hardcore gameplay of the original Painkiller. Released in 2004, Painkiller won high praise and many accolades and fans for its fast and unique gameplay. Keeping true to the old-school FPS ideology, lightning-fast movement enables skillful players to get into the heart of the fast-paced gameplay, topped off with stunning enormo-boss fights requiring sneaky tactics. … Expand"}, {"name": "Farming Simulator", "details_link": "https://www.metacritic.com/game/playstation-3/farming-simulator", "publisher": "Focus Home Interactive", "release_date": "Nov 19 2013", "developers": ["Giants Software"], "platforms": ["PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General", "Virtual", "Career"], "meta_score": 40, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/7/529589c4866bcf651f0d1fc834c0f2bd-98.jpg", "descriptions": "Farming Simulator 2013 keeps all the ingredients that make the staple of virtual farming, while incorporating many new machines, vehicles, crops, animals, and environments. Farming Simulator 2013 features equipment from the top 20 vehicle manufacturers. Dozens of new machines have foundFarming Simulator 2013 keeps all the ingredients that make the staple of virtual farming, while incorporating many new machines, vehicles, crops, animals, and environments. Farming Simulator 2013 features equipment from the top 20 vehicle manufacturers. Dozens of new machines have found their way into the game, such as the notable brand Case IH, as well as some gigantic farming machines, soon to be unveiled at Gamescom Cologne. … Expand"}, {"name": "Escape Dead Island", "details_link": "https://www.metacritic.com/game/playstation-3/escape-dead-island", "publisher": "Deep Silver", "release_date": "Nov 18 2014", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "Third-Person", "Modern"], "meta_score": 40, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/4/cd276e4102eb0d16f23f551345b3686f-98.jpg", "descriptions": "Narapela is chock full of areas for you to explore, but you must make sure you have the correct tools to access them and weapons to survive. Make sure you take pictures and look for clues. Cliff is on Narapela to get a story, and piecing together the evidence is the way to make sense of it all."}, {"name": "Inner Chains", "details_link": "https://www.metacritic.com/game/pc/inner-chains", "publisher": "IMGN.PRO", "release_date": "May 18 2017", "developers": ["Telepaths Tree"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 40, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/9/ac6eb771cbf92b7f1f9d2c41c1a8bfc6-98.jpg", "descriptions": "An FPS horror game set in a surreal, dark and deadly biomechanical world never seen before. Humankind is just a small part of a hostile universe. Want to survive? Discover its secrets."}, {"name": "The Warriors: Street Brawl", "details_link": "https://www.metacritic.com/game/xbox-360/the-warriors-street-brawl", "publisher": "Paramount Digital Entertainment", "release_date": "Sep 23 2009", "developers": ["CXTM"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 40, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/0d92ea4f0e626892da7895cd564c0f47-98.jpg", "descriptions": "[Xbox Live Arcade]  Warriors ... come out to play-ayyy! Relive the unforgettable cult classic movie and experience The Warriors: Street Brawl in a 3-D side-scrolling fight fest. Brawl it out old school style using your fists and a variety of weapons. Battle through 20 miles of gang-infested[Xbox Live Arcade]  Warriors ... come out to play-ayyy! Relive the unforgettable cult classic movie and experience The Warriors: Street Brawl in a 3-D side-scrolling fight fest. Brawl it out old school style using your fists and a variety of weapons. Battle through 20 miles of gang-infested Manhattan in order to get back to your home turf, Coney Island. Play as Swan, Cochise, Vermin, or Rembrandt and lead your gang all the way to the showdown against Luther and the Rogues. Brawling action: Lead The Warriors home to Coney Island for the final showdown with Luther and the Rogues. Fight up close and personal with knives, bats, crowbars, and pool cues. Multiple game modes: Play single player, local multiplayer with up to four players, or online multiplayer co-op over Xbox LIVE. For a special challenge, try Versus mode where you can go toe to toe with up to four of your fellow gang members to see who is the real Warchief. And in the unlockable Boss Mode, you must face off against a string of boss battles to become the city's top dog. King of the hill: Vie for the top slot on the leaderboards, and unleash the Warriors now. [Paramount]… Expand"}, {"name": "Brain Boost: Gamma Wave", "details_link": "https://www.metacritic.com/game/ds/brain-boost-gamma-wave", "publisher": "Majesco Games", "release_date": "Nov 17 2006", "developers": ["Interchannel", "HuneX"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 40, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/b5a36ff7c9b98901a84c2763961d15cf-98.jpg", "descriptions": "(Also known as \"The Professor's Brain Trainer: Logic\")  The game focuses on improving memory, concentration and judgment through progressively difficult brain training games where speed and accuracy count. The brain's gamma waves appear to be involved in higher mental activity, including(Also known as \"The Professor's Brain Trainer: Logic\")  The game focuses on improving memory, concentration and judgment through progressively difficult brain training games where speed and accuracy count. The brain's gamma waves appear to be involved in higher mental activity, including perception and problem solving. As such, Brain Boost: Gamma Wave includes training games for remembering Circumstances, Faces, Images, Numbers and Colors. [Majesco Games]… Expand"}, {"name": "MTV Sports: Skateboarding featuring Andy Macdonald", "details_link": "https://www.metacritic.com/game/playstation/mtv-sports-skateboarding-featuring-andy-macdonald", "publisher": "THQ", "release_date": "Sep 12 2000", "developers": ["Darkblack"], "platforms": ["PC", "PlayStation"], "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 40, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/e0ae4bff3bb241cf48ea6928864c2740-98.jpg", "descriptions": "MTV Skateboarding is a perfect example of cashing in on a recently established genre, yet unlike games like Street Sk8er 2 or Grind Session, it doesn't bring anything worthwhile to the table."}, {"name": "Zatch Bell! Mamodo Fury", "details_link": "https://www.metacritic.com/game/playstation-2/zatch-bell!-mamodo-fury", "publisher": "Namco Bandai Games America", "release_date": "Sep 19 2006", "developers": ["Mechanic Arms"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 40, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/1633956c2930cc479a11c22c5d54c774-98.jpg", "descriptions": "Players join Zatch, Kiyo and other characters from the hit manga and TV series ZATCHBELL! as they battle to become the mighty mamodo king. This time, up to four players can choose from more than 20 different playable teams. With three gameplay modes including Story Mode, VS mode and ArcadePlayers join Zatch, Kiyo and other characters from the hit manga and TV series ZATCHBELL! as they battle to become the mighty mamodo king. This time, up to four players can choose from more than 20 different playable teams. With three gameplay modes including Story Mode, VS mode and Arcade Mode, players can experience all the action in environments faithful to the TV series. All voice acting is even done by the U.S. TV show cast. [Namco Bandai]… Expand"}, {"name": "Blood Drive", "details_link": "https://www.metacritic.com/game/xbox-360/blood-drive", "publisher": "Activision", "release_date": "Nov  2 2010", "developers": ["Sidhe Interactive"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Simulation", "Driving", "Racing", "General", "General", "Vehicle", "Combat"], "meta_score": 40, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/25710dbe618e28124ccf9a4295610a0b-98.jpg", "descriptions": "In Blood Drive, contestants must use their motorized death steeds of steel in a televised game show where drivers battle each other and hordes of revolting flesh eaters in an all-out fight to the death. Face undead frat boys, cops, strippers and bachelorette partiers, each with their ownIn Blood Drive, contestants must use their motorized death steeds of steel in a televised game show where drivers battle each other and hordes of revolting flesh eaters in an all-out fight to the death. Face undead frat boys, cops, strippers and bachelorette partiers, each with their own special brand of death and devastation - and ways to die! While these rotting monsters wander the streets of a desert sin city craving sweet, succulent brains, your enemies have come equipped battle hardened armed vehicles, including heavily weaponized muscle cars, hot rods, and more. Amidst this gore-drenched mayhem contestants must use their head or lose it!… Expand"}, {"name": "Prison Break: The Conspiracy", "details_link": "https://www.metacritic.com/game/xbox-360/prison-break-the-conspiracy", "publisher": "Deep Silver", "release_date": "Apr  1 2010", "developers": ["ZootFly"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 40, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/67be1c9ddea9716121a580cec22a8170-98.jpg", "descriptions": "Prison Break - The Conspiracy takes you inside the Prison Break world like never before. You are Tom Paxton, a Company agent sent inside Fox River Penitentiary to observe and report on a prisoner named Michael Scofield... What you will find will change your Prison Break experience forever.Prison Break - The Conspiracy takes you inside the Prison Break world like never before. You are Tom Paxton, a Company agent sent inside Fox River Penitentiary to observe and report on a prisoner named Michael Scofield... What you will find will change your Prison Break experience forever. [Deep Silver]… Expand"}, {"name": "Freestyle Street Soccer", "details_link": "https://www.metacritic.com/game/xbox/freestyle-street-soccer", "publisher": "Acclaim", "release_date": "Mar 25 2004", "developers": ["Silicon Dreams"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 40, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/158afaf524f148d244c06c1bc49e9fd5-98.jpg", "descriptions": "Freestyle Street Soccer focuses on 10 individual gangs--all based on the different styles, fashions, and cultures found in the concrete jungle. These teams fiercely compete for each other's turf with the ultimate goal to gain control of the whole city. You'll join the battle as one of 40Freestyle Street Soccer focuses on 10 individual gangs--all based on the different styles, fashions, and cultures found in the concrete jungle. These teams fiercely compete for each other's turf with the ultimate goal to gain control of the whole city. You'll join the battle as one of 40 players with individual catchphrases, plus trick, combo, and special moves. As you conquer the challenges in five game modes, remember--on the streets, it's just as important to look cool as it is to score goals.… Expand"}, {"name": "Dragon Ball Z: Taiketsu", "details_link": "https://www.metacritic.com/game/game-boy-advance/dragon-ball-z-taiketsu", "publisher": "Atari", "release_date": "Nov 24 2003", "developers": ["Webfoot Technologies"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 40, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/8c5e9eb8a168d03aaae170836cbe7725-98.jpg", "descriptions": "Heroes and villains collide in the latest Dragon Ball Z brawler.  Dragon Ball Z: Taiketsu lets you play as one of 15 of the greatest warriors from the DBZ universe, including the mighty Broly, in a fight for dominance.  Unleash devastating combos and super moves alone or against friends inHeroes and villains collide in the latest Dragon Ball Z brawler.  Dragon Ball Z: Taiketsu lets you play as one of 15 of the greatest warriors from the DBZ universe, including the mighty Broly, in a fight for dominance.  Unleash devastating combos and super moves alone or against friends in huge multiplayer battles.  You can fight on land or in the air, but just don't be caught off guard.  … Expand"}, {"name": "Tamarin", "details_link": "https://www.metacritic.com/game/playstation-4/tamarin", "publisher": "Chameleon Games", "release_date": "Sep 10 2020", "developers": ["Chameleon Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 40, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/4df5f4004860a2aa68d35dff80b98837-98.jpg", "descriptions": "SAVE YOUR FAMILY FROM THE INSECT INVASIONExplore an incredible interconnected 3D world, brimming with primate platforming and bug-splattering shooter action. Leap with the agility of a tamarin as you journey into the Northern wilderness on scenic routes through forests, fjords andSAVE YOUR FAMILY FROM THE INSECT INVASIONExplore an incredible interconnected 3D world, brimming with primate platforming and bug-splattering shooter action. Leap with the agility of a tamarin as you journey into the Northern wilderness on scenic routes through forests, fjords and mountains. Along the way you will chase mysterious electrical fireflies, discover a secret underground world of dancing ants, rescue innocent birds, and restore the tamarins' once idyllic natural habitat.What kind of game is it?Tamarin features a unique gameplay mix that alternates between 3D-platforming and exploration, and third-person shooter gameplay. The game is inspired by the more open 3D adventures from Nintendo and Rare, and by nature and all the wonderful plants and animals in it.… Expand"}, {"name": "Family Guy: Back to the Multiverse", "details_link": "https://www.metacritic.com/game/playstation-3/family-guy-back-to-the-multiverse", "publisher": "Activision", "release_date": "Nov 20 2012", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 40, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/182559bcc7054a8fe206d223898e6f07-98.jpg", "descriptions": "Family Guy: Back to the Multiverse introduces an all-new original story written and voiced by Family Guy talent and influenced by the famous Family Guy season eight episode, Road to the Multiverse, where Stewie and Brian travel on an out-of-this-world journey through Quahog’s bizarreFamily Guy: Back to the Multiverse introduces an all-new original story written and voiced by Family Guy talent and influenced by the famous Family Guy season eight episode, Road to the Multiverse, where Stewie and Brian travel on an out-of-this-world journey through Quahog’s bizarre parallel universes.  Gamers travel through all-new settings on a mission to save Quahog and stop the destructive schemes of Bertram, Stewie’s nemesis.  Playing as either Stewie or Brian, each equipped with unique special weapons and abilities, gamers encounter an array of Family Guy characters, references and jokes.  Additionally, fans can share this hilarious experience and invite friends and family to jump into the wild Family Guy world through drop-in/drop-out co-op multiplayer mode and competitive multiplayer challenges. [Activision]… Expand"}, {"name": "The Golden Compass", "details_link": "https://www.metacritic.com/game/playstation-3/the-golden-compass", "publisher": "Sega", "release_date": "Dec  4 2007", "developers": ["Shiny Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 40, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/95b3f2c12b422a778009c0d3fd749d05-98.jpg", "descriptions": "The Golden Compass follows the screenplay adaptation of the first book in the acclaimed trilogy, capturing the fantasy adventure set in a parallel world where giant armored bears rule a kingdom, beautiful witches fly through the frozen skies, and human beings' deepest essence is manifest asThe Golden Compass follows the screenplay adaptation of the first book in the acclaimed trilogy, capturing the fantasy adventure set in a parallel world where giant armored bears rule a kingdom, beautiful witches fly through the frozen skies, and human beings' deepest essence is manifest as talking animals that remain their faithful companion for life – their daemon. Players can assume the role of Lyra, a young girl, along with her daemon Pantalaimon (Pan), as she journeys through the frozen wastes of the North to rescue a friend kidnapped by a mysterious organization known as The Gobblers and winds up on an epic quest to save not only her world, but ours as well. Gamers can also take on the character of Iorek Byrnison, a great armoured polar bear who joins the quest. As Lyra, players use their daemon and collaborate with in-game characters, collecting special items in order to explore, evade, and deceive their way through confrontations with the Gobblers, the Magisterium, and the horribly dangerous spy fly to find her friend. They can also do battle as Iorek with special attacks and a riding mechanic as he protects Lyra during the journey. Gamers can unlock secrets and mini-games using a mysterious, truth-telling golden compass device called an alethiometer. Players can explore 13 vast locations, including all-new breath-taking environments not seen in the film, on this massive journey of collaboration, exploration and the eternal struggle between good and evil. [Sega]… Expand"}]