[{"name": "Boogie", "details_link": "https://www.metacritic.com/game/wii/boogie", "publisher": "Electronic Arts", "release_date": "Aug  7 2007", "developers": ["EA Montreal"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 57, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/a91b8169464bd42262bc46d7a72593a2-98.jpg", "descriptions": "Players dance, sing and create music videos with this videogame party package that takes advantage of the innovative Wii controls getting gamers off their couch and playing to a new beat. Not only do gamer belt out their favorite tunes or dancing to the latest hit songs, players catch theirPlayers dance, sing and create music videos with this videogame party package that takes advantage of the innovative Wii controls getting gamers off their couch and playing to a new beat. Not only do gamer belt out their favorite tunes or dancing to the latest hit songs, players catch their best dance moves, record their own voice and make music videos with the easy-to-use music video creator. Fun mini-games, co-op gameplay, head-to-head dance battles and karaoke party make Boogie a complete entertainment package for gamers of all ages. The game ships to retail stores with a packed-in karaoke microphone peripheral and features new versions of tracks made popular by hit bands including The Jackson 5, Kool & The Gang, M.C. Hammer, The Village People, Cyndi Lauper and Britney Spears. [Electronic Arts]… Expand"}, {"name": "Corvette", "details_link": "https://www.metacritic.com/game/playstation-2/corvette", "publisher": "Global Star Software", "release_date": "Mar  9 2004", "developers": ["Steel Monkeys"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 57, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/5411fe0a6564d2d53d0e50b15fb87e16-98.jpg", "descriptions": "This is the only game that lets you race virtually every Corvette made in street and track settings. Over 80 incredibly rendered production Corvette models from '53 to '03---plus awesome show cars. Upgrade your 'Vette's engine and suspension---feel the effect of real car physics. Race onThis is the only game that lets you race virtually every Corvette made in street and track settings. Over 80 incredibly rendered production Corvette models from '53 to '03---plus awesome show cars. Upgrade your 'Vette's engine and suspension---feel the effect of real car physics. Race on various tracks and an obstacle filled Route 66 from Chicago to LA. The choice is yours...6 characters, 15 official production colors, multiple environments. Variable camera angles---and era-specific HUDs---enhance your race experience. Heritage mode allows you to \"test drive\" any stock production 'Vette. [TDK Mediactive]… Expand"}, {"name": "Spawn: Armageddon", "details_link": "https://www.metacritic.com/game/xbox/spawn-armageddon", "publisher": "Namco", "release_date": "Nov 21 2003", "developers": ["Point of View"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 57, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/4ad1aac8decdcb7990d9cb8a2d23cd08-98.jpg", "descriptions": "Spawn: Armageddon, based on Todd McFarlane's creation, is a 3-D action adventure that gives players access to all of Spawn's distinctive abilities, superhuman strength, arsenal of weaponry, Hell Powers, and, of course, his living symbiotic costume.  Caught between the battle of Good vs.Spawn: Armageddon, based on Todd McFarlane's creation, is a 3-D action adventure that gives players access to all of Spawn's distinctive abilities, superhuman strength, arsenal of weaponry, Hell Powers, and, of course, his living symbiotic costume.  Caught between the battle of Good vs. Evil, he struggles to break free from the controlling influences of Heaven and Hell.… Expand"}, {"name": "The King of Route 66", "details_link": "https://www.metacritic.com/game/playstation-2/the-king-of-route-66", "publisher": "Sega", "release_date": "Mar 18 2003", "developers": ["Sega"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/8bc5eacfb4f90f89b6549ca81b3853e0-98.jpg", "descriptions": "Prepare to climb inside the cab of a nitro-powered 18-wheeler and haul ass from Illinois to California in a mad dash for cash. But this big rig road trip isn't your ordinary out and back. The sinister Tornado Corporation has sent a rogues gallery of truck-ramming goons to keep you fromPrepare to climb inside the cab of a nitro-powered 18-wheeler and haul ass from Illinois to California in a mad dash for cash. But this big rig road trip isn't your ordinary out and back. The sinister Tornado Corporation has sent a rogues gallery of truck-ramming goons to keep you from succeeding. Upgrade your truck with more than 70 insane performance-enhancing parts to smoke the competition. But don't forget to stop and smell the flowers, because along the way you'll have the chance to win the hearts of eight scandalous interstate beauties known as the Queens of Route 66. These friendly gals are among more than three-dozen characters you'll encounter, each with their own story to tell. 4 modes of play including new story modes and short cuts. Two-player split screen mode and multiplayer battles. Fully customizable trucks and 70+ parts to build your truck. 40 unique characters. Truckloads of insane mini-game challenges. [Sega]… Expand"}, {"name": "The Partners", "details_link": "https://www.metacritic.com/game/pc/the-partners", "publisher": "Strategy First", "release_date": "Sep  9 2002", "developers": ["Monte Cristo Multimedia", "Monte Cristo"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Modern", "General", "Modern"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/3486aa046032176965238ef0b2d44159-98.jpg", "descriptions": "Partners, an original game, based on psychology and interactions between employees of a law firm. Discover The From now on: the world will look like a TV series, of which you are the writer! For the first time ever: recreate your own business life or imagine your colleagues the way YOU wantPartners, an original game, based on psychology and interactions between employees of a law firm. Discover The From now on: the world will look like a TV series, of which you are the writer! For the first time ever: recreate your own business life or imagine your colleagues the way YOU want them to be! But take care: the situation might change according to your characters' needs for love, friends, success, etc. [Monte Cristo]… Expand"}, {"name": "Endgame", "details_link": "https://www.metacritic.com/game/playstation-2/endgame", "publisher": "Empire Interactive", "release_date": "Jun  3 2002", "developers": ["Cunning Developments"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 57, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/646c4c240e157b139b937acbad478732-98.jpg", "descriptions": "The world has finally succumbed to the once-lauded technology of Virtual Reality. Young and old, rich and poor now use this technology for leisure and business. No one need leave the comfort of their homes. Virtual Reality is about to be updated, and there is something very wrong. Tyler knewThe world has finally succumbed to the once-lauded technology of Virtual Reality. Young and old, rich and poor now use this technology for leisure and business. No one need leave the comfort of their homes. Virtual Reality is about to be updated, and there is something very wrong. Tyler knew what, but EuroDream Technologies found out. Octavian, an Artificial Intelligence, knows how to stop them, but needs a human. Jade Cornell knows what to do, she's armed and ready. In a dual bid to track Tyler and activate Octavian, Jade blasts across the United States of Europe. The deeper she gets, the more ruthless EuroDream security becomes. And Jade still doesn't know the secret behind the security chief's identity, or even realise that Octavian is more complex than he seems. [Empire Interactive]… Expand"}, {"name": "ESPN Great Outdoor Games Bass 2002", "details_link": "https://www.metacritic.com/game/game-boy-advance/espn-great-outdoor-games-bass-2002", "publisher": "Konami", "release_date": "Nov 29 2001", "developers": ["KCEO"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 57, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/f1a8a1c14aaf7044da523b0819e9047d-98.jpg", "descriptions": "Pull on your waders, bait your fishing rod and gear up for the most reel-istic portable fishing game of all time! You'll play through 3 game modes, including Great Outdoor Games Tournament, Free Fishing Mode and Vs. Mode. Choose one of 7 locations, climb into your boat and see if you havePull on your waders, bait your fishing rod and gear up for the most reel-istic portable fishing game of all time! You'll play through 3 game modes, including Great Outdoor Games Tournament, Free Fishing Mode and Vs. Mode. Choose one of 7 locations, climb into your boat and see if you have the skills to catch the \"big\" one!… Expand"}, {"name": "Hey You, Pikachu!", "details_link": "https://www.metacritic.com/game/nintendo-64/hey-you-pikachu!", "publisher": "Nintendo", "release_date": "Nov  5 2000", "developers": ["Ambrella"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Adventure", "General"], "meta_score": 57, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/3ef17ec6dac9a13804922645d307b257-98.jpg", "descriptions": "For the first time ever, you can actually talk to your favorite Pokemon. Tag along with Pikachu as it goes through its daily routines, taking field trips, going fishing and having picnics, becoming better friends with each passing day. Pikachu will hear and react to the words you say. TheFor the first time ever, you can actually talk to your favorite Pokemon. Tag along with Pikachu as it goes through its daily routines, taking field trips, going fishing and having picnics, becoming better friends with each passing day. Pikachu will hear and react to the words you say. The more you speak the closer friends you'll be!… Expand"}, {"name": "NFL QB Club 2001", "details_link": "https://www.metacritic.com/game/nintendo-64/nfl-qb-club-2001", "publisher": "Acclaim", "release_date": "Aug 23 2000", "developers": ["High Voltage Software"], "platforms": "Nintendo 64", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 57, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/99305e78f85802416f8e351c90f27765-98.jpg", "descriptions": "All 31 NFL teams and 1,500 NFL players. Create and manage your own team. 31 team-specific playbooks or create your own. Play-by-play from Mike Patrick and Randy Cross. Precision artificial intelligence for real NFL gameplay. All-new Shoulder Charge feature for busting through defenders.All 31 NFL teams and 1,500 NFL players. Create and manage your own team. 31 team-specific playbooks or create your own. Play-by-play from Mike Patrick and Randy Cross. Precision artificial intelligence for real NFL gameplay. All-new Shoulder Charge feature for busting through defenders. Replay key moments of all 34 Super Bowls. All-new E-Z pass/catch controls. Incredibly detailed player models. Game speed maximized for the N64!… Expand"}, {"name": "Spy Hunter 2", "details_link": "https://www.metacritic.com/game/playstation-2/spy-hunter-2", "publisher": "Midway", "release_date": "Nov 20 2003", "developers": ["Angel Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 57, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/90f758c9cc694684f81dfaf9a90952f9-98.jpg", "descriptions": "SpyHunter 2 is the ultimate thrill ride, combining high-speed combat, global espionage, and mission-based gameplay. Take the helm of the world's most powerful counterintelligence combat vehicle, the completely redesigned G-8155 Interceptor complete with new vehicle transformations, includingSpyHunter 2 is the ultimate thrill ride, combining high-speed combat, global espionage, and mission-based gameplay. Take the helm of the world's most powerful counterintelligence combat vehicle, the completely redesigned G-8155 Interceptor complete with new vehicle transformations, including the sleek snowmobile and four-wheel drive off-road vehicle. Within a compelling story of global intrigue and international espionage, your mission is to uncover Nostra's sinister plans for world domination and discover the secrets of a mysterious female agent.  [Midway]… Expand"}, {"name": "Mobile Suit Gundam: Gundam vs. Zeta Gundam", "details_link": "https://www.metacritic.com/game/playstation-2/mobile-suit-gundam-gundam-vs-zeta-gundam", "publisher": "Bandai America Inc.", "release_date": "Jun 28 2005", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 57, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/0dba4794a4ae6d261155a087eab8515e-98.jpg", "descriptions": "Seven years after the end of the devastating One Year War... The victorious Earth Federation has become corrupt and oppressive, and the elite Titans police force has taken on dictatorial powers. As the A.E.U.G. rebel group struggles to defeat the Titans, the heroes and villains of theSeven years after the end of the devastating One Year War... The victorious Earth Federation has become corrupt and oppressive, and the elite Titans police force has taken on dictatorial powers. As the A.E.U.G. rebel group struggles to defeat the Titans, the heroes and villains of the original Mobile Suit Gundam series find themselves on the same side of this new conflict. The focus, however, is on a new hero named Kamille Bidan, the pilot of the transforming Zeta Gundam. [Bandai]… Expand"}, {"name": "Puzzle Chronicles", "details_link": "https://www.metacritic.com/game/xbox-360/puzzle-chronicles", "publisher": "Konami", "release_date": "Apr 21 2010", "developers": ["Infinite Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/42264fcb4b6cc344061e55f86f103226-98.jpg", "descriptions": "[Xbox Live Arcade]   Enter the dark and savage lands of the Ashurin Empire as you battle to avenge the atrocities the Empire brought upon your tribesmen in Puzzle Chronicles. On your heroic quest to topple the Empire, fight fierce beasts and battle-hardened warriors in this new[Xbox Live Arcade]   Enter the dark and savage lands of the Ashurin Empire as you battle to avenge the atrocities the Empire brought upon your tribesmen in Puzzle Chronicles. On your heroic quest to topple the Empire, fight fierce beasts and battle-hardened warriors in this new puzzle/role-playing hybrid game. Featuring an active puzzle combat mechanic, deep story, and robust character development, Puzzle Chronicles brings you into the next era of puzzle RPGs. [Konami]… Expand"}, {"name": "Mobile Suit Gundam Seed: Battle Assault", "details_link": "https://www.metacritic.com/game/game-boy-advance/mobile-suit-gundam-seed-battle-assault", "publisher": "Bandai", "release_date": "Aug 10 2004", "developers": ["Bandai"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 57, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/82b93c8e29db372b71d5fdde74d74570-98.jpg", "descriptions": "Gundam makes its debut on the Game Boy Advance with Gundam Seed: Battle Assault, an action game based on the animated series. Now you can take control of one of 12 different mobile suits and blast enemies with a variety of weaponry. Gameplay modes include solo missions and two-player versusGundam makes its debut on the Game Boy Advance with Gundam Seed: Battle Assault, an action game based on the animated series. Now you can take control of one of 12 different mobile suits and blast enemies with a variety of weaponry. Gameplay modes include solo missions and two-player versus mode, where you can link up to four Game Boy Advance systems for head-to-head action. Battle Assault also lets players adjust difficulty levels: Choose automatic or manual mode, and then adjust armor, HP, and energy gauges to maximize the challenge.… Expand"}, {"name": "The LEGO Movie 2 Videogame", "details_link": "https://www.metacritic.com/game/playstation-4/the-lego-movie-2-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb 26 2019", "developers": ["TT Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 57, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/9/b1c38d49511da7a2dcf82c727f3e4f27-98.jpg", "descriptions": "The alien monster invaders have left Bricksburg in ruins. It is now up to Emmet and a host of heroic characters to go beyond their world and save their friends from the strange inhabitants of the Systar System. Players can journey into outer space, discover new worlds, and test their MasterThe alien monster invaders have left Bricksburg in ruins. It is now up to Emmet and a host of heroic characters to go beyond their world and save their friends from the strange inhabitants of the Systar System. Players can journey into outer space, discover new worlds, and test their Master Building skills. … Expand"}, {"name": "Skater XL", "details_link": "https://www.metacritic.com/game/playstation-4/skater-xl", "publisher": "Easy Day Studios Pty Ltd", "release_date": "Jul 28 2020", "developers": ["Easy Day Studios Pty Ltd"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 57, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/7b9e216e80310c33e1889b01a2811db3-98.jpg", "descriptions": "Skater XL is a head first dive into the skateboarding world, where style, creativity and the perfect trick is yours to define. Create, combine, and style tricks with unparalleled board control as you hit iconic California locations where street legends have left their mark. Play as skatingSkater XL is a head first dive into the skateboarding world, where style, creativity and the perfect trick is yours to define. Create, combine, and style tricks with unparalleled board control as you hit iconic California locations where street legends have left their mark. Play as skating icons Tiago Lemos, Evan Smith, Tom Asta or Brandon Westgate on your way to becoming a skateboarding pro. Dive into the digital skate subculture, with featured community created mods, brands, 'zines, and maps. Hit more than 60 real skate spots connected by block after block of plazas, schools, pools, buildings, car parks and corridors.… Expand"}, {"name": "Captain America: Super Soldier", "details_link": "https://www.metacritic.com/game/wii/captain-america-super-soldier", "publisher": "Sega", "release_date": "Jul 19 2011", "developers": ["High Voltage Software"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 57, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/2fad81c291f39d85366de448df83c246-98.jpg", "descriptions": "Captain America: Super Soldier combines a highly athletic combat system with fluid platforming and a highly tuned suite of shield attacks, as Cap explores a massive castle turned military installation. His shield can be employed in numerous ways: taking out multiple enemies at once,Captain America: Super Soldier combines a highly athletic combat system with fluid platforming and a highly tuned suite of shield attacks, as Cap explores a massive castle turned military installation. His shield can be employed in numerous ways: taking out multiple enemies at once, deflecting incoming fire back at enemies, solving puzzles, and scaling walls. Players will be able to launch shield-first into the fray with the superior force of the world's first Super-Soldier at their fingertips and they'll need every bit of that strength to overcome a castle that's both an acrobatic playground for the Captain's physical prowess and a house of mystery with enemies and danger at every turn.… Expand"}, {"name": "SOL: Exodus", "details_link": "https://www.metacritic.com/game/pc/sol-exodus", "publisher": "Seamless Entertainment, Inc.", "release_date": "Jan 25 2012", "developers": ["Seamless Entertainment", "Inc."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "General", "General", "Space", "Combat"], "meta_score": 57, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/8142c168668a91a9236628fdaddbd1e7-98.jpg", "descriptions": "By the year 2500, Earth had become toxic and unsafe for human life. Pollution and overpopulation had ravaged the planet, forcing humanity to the stars. Colonies and settlements soon sprung up across the solar system, but man had not left its thirst for war behind. Then, they learned theirBy the year 2500, Earth had become toxic and unsafe for human life. Pollution and overpopulation had ravaged the planet, forcing humanity to the stars. Colonies and settlements soon sprung up across the solar system, but man had not left its thirst for war behind. Then, they learned their sun was dying, and everything changed. Only when faced with threat greater than each other did the nations of man finally come together. The United Colonies of SOL (UCS) was born, its first and only mission: to locate a new home for mankind, safely beyond the doomed borders of our solar system.… Expand"}, {"name": "Vector Thrust", "details_link": "https://www.metacritic.com/game/pc/vector-thrust", "publisher": "Iceberg Interactive", "release_date": "Jul  2 2015", "developers": ["timesymmetry"], "platforms": "PC", "genres": ["General", "Simulation", "Flight", "General", "Combat"], "meta_score": 57, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/0/5e89c7176aa1cae76e8f50576ee97032-98.jpg", "descriptions": "Vector Thrust is an action-arcade combat flight simulator, with a cel shaded art style for PC. With an extensive variety of game modes Vector Thrust aims to please both players wanting to get straight into the sky and those who love a flexible, diverse and customizable gaming experience."}, {"name": "Outlaw Volleyball Remixed", "details_link": "https://www.metacritic.com/game/playstation-2/outlaw-volleyball-remixed", "publisher": "Global Star Software", "release_date": "May 17 2005", "developers": ["Hypnotix"], "platforms": "PlayStation 2", "genres": ["Sports", "Traditional", "Volleyball"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/f7806ecc4035c223db0f774fc90e5fb9-98.jpg", "descriptions": "Choose your team, choose your court, choose your bikini and then serve up the attitude. Scantily-clad babes and seriously twisted dudes bring their famous \"Outlaw\" vibe onto the court as they bump, set, spike, AND throw punches on their way to total victory. Outlaw Volleyball provides fast,Choose your team, choose your court, choose your bikini and then serve up the attitude. Scantily-clad babes and seriously twisted dudes bring their famous \"Outlaw\" vibe onto the court as they bump, set, spike, AND throw punches on their way to total victory. Outlaw Volleyball provides fast, furious, and uncouth action via PS2's network adapter and everyone can experience the outrageous humor and fantastic gameplay that the \"Outlaw\" gang is known for. Features 17 half-naked characters with differing talents and playing styles; 12 offbeat courts including jailhouse, jungle, sewer, and of course, a beach; Over 50 skimpy outfits per character, including string bikinis; Powerful volleyball engine! Set, jump, spike with the best of them. Gain MOMENTUM for Turbo Moves by playing well or by literally beating up your opponents. Build your character's skills with unique mini-games and drills. [Global Star]… Expand"}, {"name": "Judge Dredd: Dredd VS Death", "details_link": "https://www.metacritic.com/game/xbox/judge-dredd-dredd-vs-death", "publisher": "Evolved Games", "release_date": "Feb 27 2005", "developers": ["Rebellion"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 57, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/901b6d4306766c8644aee31eef85c074-98.jpg", "descriptions": "Judge Dredd: Dredd Versus Death combines weapon management, fast-paced combat, and intense multiplayer action. Based on the comic book, the game puts you in the shoes of Judge Dredd, a no-holds-barred judge who is determined to clean up the streets of the futuristic Mega-City One. Armed withJudge Dredd: Dredd Versus Death combines weapon management, fast-paced combat, and intense multiplayer action. Based on the comic book, the game puts you in the shoes of Judge Dredd, a no-holds-barred judge who is determined to clean up the streets of the futuristic Mega-City One. Armed with an all-purpose LawGiver that features six types of ammo, you can shoot to wound, shoot to kill, or make an arrest--all while keeping an eye on your Lawmeter. Shoot an unarmed citizen, and your Lawmeter will drop; apprehend numerous criminals, and it will rise.… Expand"}, {"name": "The Lord of the Rings: Conquest", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-conquest", "publisher": "Electronic Arts", "release_date": "Jan 13 2009", "developers": ["Pandemic Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 57, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/7be4cbaa7c41abefffed916bfd31f9de-98.jpg", "descriptions": "For the first time, play as Evil characters in a brand new, 'Evil' campaign. Battle through scenarios after Frodo failed to destroy the One Ring; it’s good to be bad. Acclaimed Battlefront gameplay in a fantasy setting allows players to choose the way they fight, as Warrior, Archer, Mage orFor the first time, play as Evil characters in a brand new, 'Evil' campaign. Battle through scenarios after Frodo failed to destroy the One Ring; it’s good to be bad. Acclaimed Battlefront gameplay in a fantasy setting allows players to choose the way they fight, as Warrior, Archer, Mage or Scout in melee and ranged combat. Online multiplayer - pick your allegiance then battle in 16-player online clashes, or in 4-player co-op campaigns. Local multiplayer - split-screen with up to 4 players competitively or 2 player co-op. A massive cast of characters & weapons adds great depth to the gameplay: Heroes, Wargs, Ents, Oliphaunts, Cave-trolls, the Balrog, Nazgul, ballistae, and more. [Electronic Arts]… Expand"}, {"name": "Chronicles of Mystery: Curse of the Ancient Temple", "details_link": "https://www.metacritic.com/game/ds/chronicles-of-mystery-curse-of-the-ancient-temple", "publisher": "City Interactive", "release_date": "Nov  2 2009", "developers": ["City Interactive"], "platforms": "DS", "genres": ["Adventure", "General", "General"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/25cf7a6e185a1fcdb62e028a57923ddb-98.jpg", "descriptions": "Sylvie, a young archaeologist, is about to begin the greatest adventure of her life. Having received an invitation to France from her uncle, a reknowned historian, she arrives there only to discover he went missing. Apparently, it is connected to the recent discovery of a mysteriousSylvie, a young archaeologist, is about to begin the greatest adventure of her life. Having received an invitation to France from her uncle, a reknowned historian, she arrives there only to discover he went missing. Apparently, it is connected to the recent discovery of a mysterious underground chapel from the times of the Crusades, but how? And who tries to stop Sylvie from unveiling the truth? Save your uncle and be the first to discover the long forgotten secrets of the famed Knights Hospitaller order! Chronicles of Mystery is a game created especially for NDS, combining features of classic point and click adventure, logic games and hidden object games. [City Interactive]… Expand"}, {"name": "Destruction Derby Arenas", "details_link": "https://www.metacritic.com/game/playstation-2/destruction-derby-arenas", "publisher": "Gathering", "release_date": "Apr  1 2004", "developers": ["Studio 33"], "platforms": "PlayStation 2", "num_players": "1-16 ", "genres": ["Driving", "Demolition Derby"], "meta_score": 57, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/f2ed329ac1ab7c508cc5f2e8591b7055-98.jpg", "descriptions": "Throughout three explosive PS one titles, Destruction Derby strapped you into powerful cars and encouraged you to dash and smash your way to the chequered flag. At long last, the PS2 offspring rumbles out of the pits and as well as being a highly polished, purring powerhouse of stock-carThroughout three explosive PS one titles, Destruction Derby strapped you into powerful cars and encouraged you to dash and smash your way to the chequered flag. At long last, the PS2 offspring rumbles out of the pits and as well as being a highly polished, purring powerhouse of stock-car action, you can take on the world thanks to the online multiplayer option. Race to the finish or smash the opposition to pieces, but whichever you choose you can kiss goodbye to your No Claims Bonus. Fast and furious online or offline auto-madness. Up to 20 player motor-mayhem online. 17 insane courses to blaze through. 20 deadly drivers each with detailed backgrounds and on-going stories. Lobby chat via the USB headset. [SCEE]… Expand"}, {"name": "Spy Hunter 2", "details_link": "https://www.metacritic.com/game/xbox/spy-hunter-2", "publisher": "Midway", "release_date": "Nov 24 2003", "developers": ["Midway"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Take the helm of the world's most powerful counterintelligence combat vehicle, the completely redesigned G-8155 Interceptor. The Interceptor can take many forms, including a sleek snowmobile and a four-wheel-drive off-road vehicle, allowing you to cross multiple types of environments. YouTake the helm of the world's most powerful counterintelligence combat vehicle, the completely redesigned G-8155 Interceptor. The Interceptor can take many forms, including a sleek snowmobile and a four-wheel-drive off-road vehicle, allowing you to cross multiple types of environments. You can even arm your supercar with machine guns, mines, smokes screens, guided missiles, and more. With this vehicle, you must uncover Nostra's sinister plans for world domination and discover the secrets of a mysterious female agent.… Expand"}, {"name": "Drome Racers", "details_link": "https://www.metacritic.com/game/playstation-2/drome-racers", "publisher": "Electronic Arts", "release_date": "Nov 20 2002", "developers": ["Attention To Detail"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 57, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/be26a49b4833bced40ade73df4caf10f-98.jpg", "descriptions": "You are Max Axel, pacing your pit area, tensions high as you await the first stage of the Drome Championship. Prove you're a match for the inensity of multi-challenge racing-each race a seamless set of stages, mixing tracks from realistically stunning City, Mountain and Canyon worlds. WithYou are Max Axel, pacing your pit area, tensions high as you await the first stage of the Drome Championship. Prove you're a match for the inensity of multi-challenge racing-each race a seamless set of stages, mixing tracks from realistically stunning City, Mountain and Canyon worlds. With high-techj cars based on the 2002 LEGO Racers construction toy range, Drome Racers is a racing experience like no other. [LEGO]… Expand"}, {"name": "Dungeons & Dragons: Eye of the Beholder", "details_link": "https://www.metacritic.com/game/game-boy-advance/dungeons-dragons-eye-of-the-beholder", "publisher": "Infogrames", "release_date": "Oct 30 2002", "developers": ["Pronto Games"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 57, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/7eb9769e39195068dfbc44000f2ae093-98.jpg", "descriptions": "A new evil has fallen upon the peaceful city of Waterdeep. You have been called upon to uncover its source and destroy it. As you embark on an epic odyssey with a band of fearless adventurers, you'll need to prepare yourself for confrontation with countless enemies and obstacles."}, {"name": "Myst III: Exile", "details_link": "https://www.metacritic.com/game/playstation-2/myst-iii-exile", "publisher": "Ubisoft", "release_date": "Sep 22 2002", "developers": ["Presto Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Adventure", "First-Person", "Fantasy"], "meta_score": 57, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/480950179942b547793331f2b509cf76-98.jpg", "descriptions": "Myst III: Exile introduces a bitter villain whose home world was destroyed by Sirrus and Achenar, the sons of Atrus and Catherine, whom players originally encountered in Myst. Played by Academy Award nominee Brad Dourif, the villain has been hiding on Atrus' Ages, awaiting his chance to gainMyst III: Exile introduces a bitter villain whose home world was destroyed by Sirrus and Achenar, the sons of Atrus and Catherine, whom players originally encountered in Myst. Played by Academy Award nominee Brad Dourif, the villain has been hiding on Atrus' Ages, awaiting his chance to gain revenge. Inadvertently, Atrus himself has provided that chance by reestablishing contact with the D'ni providing the perfect impetus for a man whose heart seems bent completely on revenge. The player must track the villain through several surrealistic Ages, navigating puzzles to uncover the truth behind this new adversary. Only then can disaster be averted, and the fate of thousands ultimately determined.… Expand"}, {"name": "BASS Strike", "details_link": "https://www.metacritic.com/game/playstation-2/bass-strike", "publisher": "THQ", "release_date": "Sep 26 2001", "developers": ["THQ"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 57, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/3c38aa270c066cf05a4c0ae4ad0021d9-98.jpg", "descriptions": "Dynamic camera action, realistic fish behavior and beautiful graphics immerse players in \"hawg\" heaven. Experience intense tournament action as you strive to qualify as one of 50 anglers competing for the title of world champion. [THQ]"}, {"name": "Ducati World Racing Challenge", "details_link": "https://www.metacritic.com/game/pc/ducati-world-racing-challenge", "publisher": "Acclaim", "release_date": "Feb  9 2001", "developers": ["Attention To Detail"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/b0f189829ca762a106233c70978610d6-98.jpg", "descriptions": "While the game boasts about 40 different Ducati motorcycles, Ducati World Racing Challenge is severely hampered by its flawed control, obsolete graphics, and bad sound."}, {"name": "SVC Chaos: SNK vs. Capcom", "details_link": "https://www.metacritic.com/game/xbox/svc-chaos-snk-vs-capcom", "publisher": "SNK", "release_date": "Oct  7 2004", "developers": ["Playmore"], "platforms": "Xbox", "num_players": "2  Online", "genres": ["Action", "Fighting", "2D"], "meta_score": 57, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/17b3350440e370b0e1f8946c8d9b8656-98.jpg", "descriptions": "The clash between popular characters of SNK and Capcom continues. SVC Chaos: SNK vs. Capcom lets you play as any one of 36 characters from SNK and Capcom franchises, such as Fatal Fury, Samurai Shodown, The King of Fighters, and Street Fighter. In Arcade mode, you'll battle 16 bossThe clash between popular characters of SNK and Capcom continues. SVC Chaos: SNK vs. Capcom lets you play as any one of 36 characters from SNK and Capcom franchises, such as Fatal Fury, Samurai Shodown, The King of Fighters, and Street Fighter. In Arcade mode, you'll battle 16 boss characters and four hidden player characters. Challenge a friend in Versus mode and showcase each character's special or superspecial moves, which can reach three levels of power. Other new moves include the Forward Ground Step and Exceed, which inflicts the most damage.… Expand"}, {"name": "King's Bounty II", "details_link": "https://www.metacritic.com/game/playstation-4/kings-bounty-ii", "publisher": "1C Entertainment", "release_date": "Aug 24 2021", "developers": ["1C Entertainment", "1C-Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 57, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/332edfa5a1761345c0a238144c42ea40-98.jpg", "descriptions": "Offering a fresh take on the fantasy series, King’s Bounty 2 expands upon its tactical turn-based battles to offer players a truly immersive RPG experience that adds weight to their every decision, whether leading an army into battle against unliving horrors, or building relations with localOffering a fresh take on the fantasy series, King’s Bounty 2 expands upon its tactical turn-based battles to offer players a truly immersive RPG experience that adds weight to their every decision, whether leading an army into battle against unliving horrors, or building relations with local townsfolk. Experience a rich world that blends realism and fantasy, filled with compelling stories, memorable characters and moral choices aplenty. Taking on the mantle of one of three heroes – each with their own unique story – players embark on a non-linear, open-world adventure across a detailed and densely-packed fantasy landscape. Split into two distinct phases, players traverse the realm from a third-person perspective, picking up quests, exploring the wilderness, and getting to know the people they meet. When conflict arises, however, the perspective shifts to tactical, turn-based combat. Players must then make smart use of their units as they fight to win. Set in the vast realms of Antara, a great danger has arisen. A mysterious blight has descended upon its furthest reaches, corrupting the land and all who live there. Refugees from the affected regions have begun arriving in the kingdom of Nostria, putting food and resources in short supply. Once living souls, blight-distorted creatures now roam the countryside leaving chaos and destruction in their wake. The land itself fights for survival, giving your decisions greater weight than ever before. How will you forge Antara’s future?… Expand"}, {"name": "Rise of the Argonauts", "details_link": "https://www.metacritic.com/game/playstation-3/rise-of-the-argonauts", "publisher": "Codemasters", "release_date": "Dec 16 2008", "developers": ["Liquid Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 57, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/7bf4f777ed714952c5a940d858fbcea0-98.jpg", "descriptions": "Rise of the Argonauts immerses gamers in a gladiatorial adventure, set in wondrously imagined vision of ancient Greece. With deep exploration and epic quests, players live a life of brutal combat as they lead a team of iconic warriors - including Jason, Hercules and Atalanta - through aRise of the Argonauts immerses gamers in a gladiatorial adventure, set in wondrously imagined vision of ancient Greece. With deep exploration and epic quests, players live a life of brutal combat as they lead a team of iconic warriors - including Jason, Hercules and Atalanta - through a world ruled by mythological gods. [Codemasters]… Expand"}, {"name": "The Sims 2: Pets", "details_link": "https://www.metacritic.com/game/psp/the-sims-2-pets", "publisher": "EA Games", "release_date": "Dec 14 2006", "developers": ["Maxis"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 57, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/672f71a71cb829f65728966bddfb1175-98.jpg", "descriptions": "Sims Have New Friends - Pets! Sims can share their lives with their new pets and add more fun to the Sims experience. From dogs, cats, caged animals and more, your Sims share new friends to experience life's precious moments. With so many different animals to choose from, there’s no tellingSims Have New Friends - Pets! Sims can share their lives with their new pets and add more fun to the Sims experience. From dogs, cats, caged animals and more, your Sims share new friends to experience life's precious moments. With so many different animals to choose from, there’s no telling what unpredictable experiences could occur. Create-A-Pet: Choose from dozens of dog and cat breeds or customize features for a one-of-a-kind pet. You can even modify your pet's body shape by choosing from specific colors and unique markings. Don't like the way they act? Change their personality – from smart and sweet to silly and sloppy – anyone can create their ideal animal friend in The Sims 2 Pets. Your Sims can encourage and discipline pets, training them to shake, roll over, play dead, and more. Unruly pets might dig in the yard, claw the sofa, or topple the trash. Thankfully, a little training can go a long way. Create and control digital characters over a lifetime, setting their goals in life from popularity and romance, to fortune and family– their stories are in your hands. Use special codes to share unlockable pet accessories, fur types or markings with other The Sims 2 Pets players. Take your Sims and their pet for a romp at any of the nearby park areas, or head to the Central Town Park which is a favorite of pet owners.  While there, watch your pet play well with others while your Sim can meet others and socialize with fellow animal lovers. Visit the adjoining Town Center, a great gathering spot for Sims that evolves over time. Once you’ve seen the latest styles and decided on a purchase, deck your pet out in the latest clothing and accessories around. From geek to chic and cool to casual, your Sim can customize their pet’s look with one stop in the Town Center. [Electronic Arts]… Expand"}, {"name": "Walt Disney Pictures Bolt", "details_link": "https://www.metacritic.com/game/xbox-360/walt-disney-pictures-bolt", "publisher": "Disney Interactive Studios", "release_date": "Nov 18 2008", "developers": ["Avalanche Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 57, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/4cdb2b8540fc0ad1fa56a3075955dde2-98.jpg", "descriptions": "Players take on the heroic personas of the TV star dog, Bolt, and his owner, Penny, from the high-action television series featured within the Disney film. As Bolt, players can use his superpowers, including laser vision and his superbark, which sends out a sonic blast to devastatePlayers take on the heroic personas of the TV star dog, Bolt, and his owner, Penny, from the high-action television series featured within the Disney film. As Bolt, players can use his superpowers, including laser vision and his superbark, which sends out a sonic blast to devastate opponents, and as Penny, players utilize stealth, hacking skills and a wheelbar, inspired by her scooter seen in the movie, to outwit enemies. [Disney Interactive Studios]… Expand"}, {"name": "Deca Sports DS", "details_link": "https://www.metacritic.com/game/ds/deca-sports-ds", "publisher": "Hudson Entertainment", "release_date": "Mar  2 2010", "developers": ["Hudson Soft"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/8319210fab4c13cecee35ce884e2d134-98.jpg", "descriptions": "Single player – Play Open Match in one sport, a one-sport bracket-style Tournament, complete a Challenge, or the ultimate competition in the League vs. 6 teams in all 10 sports. Multiplayer – Use just one game card for game sharing as you take on friends and family in 2-6 player competitionSingle player – Play Open Match in one sport, a one-sport bracket-style Tournament, complete a Challenge, or the ultimate competition in the League vs. 6 teams in all 10 sports. Multiplayer – Use just one game card for game sharing as you take on friends and family in 2-6 player competition in Open Match, VS., and Tournament modes. Locker Room – Create your own team with the Team Editor: pick the name, colors, emblem, and the look and attributes of the players themselves! You can also learn the nuances of each sport in Tutorial mode here. [Hudson]… Expand"}, {"name": "Kao the Kangaroo Round 2", "details_link": "https://www.metacritic.com/game/gamecube/kao-the-kangaroo-round-2", "publisher": "Atari", "release_date": "Mar 29 2006", "developers": ["Tate Interactive"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 57, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/d6a709336d74a8848c21b2c9b38bbe6f-98.jpg", "descriptions": "Kao the kangaroo is on the run - he has to stop the evil hunter Barnaba, who has captured most of his friends. Starting deep in the forests of the beavers, your journey will bring you to fascinating locations like the thunder mountain, the sea land and even the lost treasure island. Lots ofKao the kangaroo is on the run - he has to stop the evil hunter Barnaba, who has captured most of his friends. Starting deep in the forests of the beavers, your journey will bring you to fascinating locations like the thunder mountain, the sea land and even the lost treasure island. Lots of adventures are waiting - use a snowboard to cross the frozen \"gap of no return\", win a breath-taking speed boat race and fly on the back of your pelican friend across the sea until you reach the legendary treasure island and the hideout of Barnaba.… Expand"}, {"name": "Avatar: The Last Airbender", "details_link": "https://www.metacritic.com/game/psp/avatar-the-last-airbender", "publisher": "THQ", "release_date": "Oct 10 2006", "developers": ["TOSE"], "platforms": ["PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 57, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/3b14d3cb32062c0e8ba5b55742283e1e-98.jpg", "descriptions": "Bring to life an adventure of intrigue, deceit and revelation in Avatar The Last Airbender. Play as Aang, Katara, Haru and Sokka as you grow your team into an unstoppable force making discoveries in a thrilling blend of magic and martial arts combat. Use your fully customizable bendingBring to life an adventure of intrigue, deceit and revelation in Avatar The Last Airbender. Play as Aang, Katara, Haru and Sokka as you grow your team into an unstoppable force making discoveries in a thrilling blend of magic and martial arts combat. Use your fully customizable bending powers to master the four elements of Earth, Air, Water and Fire and explore the beautifully detailed environments of the Avatar nations. Single-player game featuring unique martial arts style combat. Fully customizable \"bending powers\" mastering the four elements of Water, Air, Earth and Fire. Journey through all the Great Nations of the Avatar world. Enjoy environments and characters from the TV show plus never before seen enemies and creatures. [THQ]… Expand"}, {"name": "Teenage Mutant Ninja Turtles 3: Mutant Nightmare", "details_link": "https://www.metacritic.com/game/gamecube/teenage-mutant-ninja-turtles-3-mutant-nightmare", "publisher": "Konami", "release_date": "Nov  1 2005", "developers": ["Konami"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 57, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/f03301e45b00cc466a3eae8517cd92f0-98.jpg", "descriptions": "TMNT3 puts more of a focus on teamwork, character development and control than any other console Turtles game to date. Gamers can play as their favorite Turtle alone or with up to three friends, earning experience points along the way as they slash and bash Foot Ninjas and powerful,TMNT3 puts more of a focus on teamwork, character development and control than any other console Turtles game to date. Gamers can play as their favorite Turtle alone or with up to three friends, earning experience points along the way as they slash and bash Foot Ninjas and powerful, well-known bosses from the TMNT universe. These experience points allow players to improve and evolve their Turtles' traits and abilities for more varied, powerful attacks and moves. The Ninja Scroll System is another new feature on TMMT3. Being able to select which ninja scrolls to use allows the Turtles to use various special abilities strategically. Cooperative play lies at the heart of TMNT3 and gamers who team up with friends for multiplayer action are rewarded with exclusive features such as Cooperative Attack for even more shell shocking damage to enemies. The effect of this attack changes depending on the number of players working together (between 2-4 players). For even greater control, TMNT3 features a new combat system called the Target Attack system that lets gamers play more instinctively and strategically. With the Target Attack system, players will be able to lock onto specific enemies and block, dodge or counter attack accordingly for smoother and more maneuverable combat. Story Mode can be played with 1-4 players. Even when you have less than 4 players to play, the other Turtles will be at your side, controlled through AI. All the Turtles can participate in Cooperative Attack to beat enemies and players can give commands to the AI.… Expand"}, {"name": "Destiny 2: Curse of Osiris", "details_link": "https://www.metacritic.com/game/playstation-4/destiny-2-curse-of-osiris", "publisher": "Activision", "release_date": "Dec  5 2017", "developers": ["Bungie"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 57, "users_score": 1.5, "image": "https://static.metacritic.com/images/products/games/5/526d163e7e5486a1bf722925c138bd0a-98.jpg", "descriptions": "Destiny 2 – Expansion I: Curse of Osiris, takes place after the conclusion of the Destiny 2 campaign where you are dispatched to Mercury on a quest to find Osiris, the most powerful Warlock to have ever lived, to discover the answers humanity needs to fight back against the Vex. Curse ofDestiny 2 – Expansion I: Curse of Osiris, takes place after the conclusion of the Destiny 2 campaign where you are dispatched to Mercury on a quest to find Osiris, the most powerful Warlock to have ever lived, to discover the answers humanity needs to fight back against the Vex. Curse of Osiris adds a new chapter to the world of Destiny 2, expanding the universe by adding an all-new cinematic story with new and returning characters, a new destination to explore, Mercury and its Infinite Forest, a new social space to visit called the Lighthouse, new missions, new strikes, new raid content, new free roam activities, a world quest to complete, and more.… Expand"}, {"name": "Disney Epic Mickey 2: The Power of Two", "details_link": "https://www.metacritic.com/game/wii-u/disney-epic-mickey-2-the-power-of-two", "publisher": "Disney Interactive Studios", "release_date": "Nov 18 2012", "developers": ["Heavy Iron Studios", "Junction Point"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 57, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/d23f0ce007e0d48706e8b2f114d7ee36-98.jpg", "descriptions": "Disney Epic Mickey 2: The Power of Two brings Mickey Mouse and Oswald the Lucky Rabbit back to Wasteland, another world filled with eighty years of forgotten Disney characters and theme park attractions. For the first time, Mickey and Oswald join forces as true partners - Mickey with hisDisney Epic Mickey 2: The Power of Two brings Mickey Mouse and Oswald the Lucky Rabbit back to Wasteland, another world filled with eighty years of forgotten Disney characters and theme park attractions. For the first time, Mickey and Oswald join forces as true partners - Mickey with his magical paint brush that yields paint and thinner, and Oswald with his powerful remote control that allows him to control electricity. Wii U players utilize the GamePad to view a fully detailed, real-time map of Wasteland with waypoints and markers to guide them through the game and complete the various quests and side-quests. Players are also able to use the GamePad to access sketches and activate them to use in-game for a more engulfing experience. … Expand"}, {"name": "One Punch Man: A Hero Nobody Knows", "details_link": "https://www.metacritic.com/game/playstation-4/one-punch-man-a-hero-nobody-knows", "publisher": "Bandai Namco Games", "release_date": "Feb 28 2020", "developers": ["Bandai Namco Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 57, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/6/e2f0b88b62899e3c851d997c24cb9f5a-98.jpg", "descriptions": "Experience the world of ONE-PUNCH MAN for yourself in “ONE PUNCH MAN: A HERO NOBODY KNOWS”. Form a team of your favorite heroes and villains. Grow your techniques and see who reigns supreme in this ONE-PUNCH MAN game."}, {"name": "Gear.Club Unlimited 2", "details_link": "https://www.metacritic.com/game/switch/gearclub-unlimited-2", "publisher": "Microids", "release_date": "Dec  4 2018", "developers": ["Eden Games Mobile"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 57, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/d5da9f2a3577a4671969b8c3a7bc3d2d-98.jpg", "descriptions": "On the mountainside, through a nature park, in the middle of the desert or along the coast, defend your position over the course of more than 250 races, including championships, missions and challenges. As you progress through the races, admire the growing collection of cars in your personalOn the mountainside, through a nature park, in the middle of the desert or along the coast, defend your position over the course of more than 250 races, including championships, missions and challenges. As you progress through the races, admire the growing collection of cars in your personal garage. Gear.Club Unlimited 2 has more than 50 licensed cars from the world’s most famous manufacturers, such as the Porsche 718 Boxster, 918 Spyder, 911 GT2RS, Dodge Viper, Lotus 3-Eleven or McLaren 720s. … Expand"}, {"name": "Fossil Fighters: Frontier", "details_link": "https://www.metacritic.com/game/3ds/fossil-fighters-frontier", "publisher": "Nintendo", "release_date": "Mar 20 2015", "developers": ["RED Entertainment", "Spike Chunsoft"], "platforms": "3DS", "num_players": "2 ", "genres": ["Role-Playing", "General", "Trainer"], "meta_score": 57, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/74a0c9bd9ead9fe4ce9a457e733222b8-98.jpg", "descriptions": "Unearth extreme adventure!\r The latest game in the Fossil Fighters series delivers a first: Players can now hop into their vehicles and drive around exotic locations to excavate fossils, which transform into real-life dinosaurs known as Vivosaurs. Players battle their Vivosaur with wildUnearth extreme adventure!\r The latest game in the Fossil Fighters series delivers a first: Players can now hop into their vehicles and drive around exotic locations to excavate fossils, which transform into real-life dinosaurs known as Vivosaurs. Players battle their Vivosaur with wild Vivosaurs they encounter on digging adventures.\r FEATURES:\r *    While driving, set off radar blasts to help discover dinosaur fossils. Different buggies possess different features. A racing buggy, for example, goes fast and allows players to reach faraway places, while a carrier buggy is great for transporting more items.\r*    Unearth ancient dinosaur fossils that come to life and transform into Vivosaurs. Clean fossils using tools like hammers and drills on the Nintendo 3DS touch screen, but dont be hasty: Carefully cleaning fossils makes the transformed Vivosaur more effective when it comes time to battle.\r*    Using local online play, players can explore and excavate the dig sites as a three-player team.\r*    Bring the Vivosaur you are training to join six-player local and online Vivosaur battles*, fighting three-on-three in a stadium.… Expand"}, {"name": "Genesis Rising: The Universal Crusade", "details_link": "https://www.metacritic.com/game/pc/genesis-rising-the-universal-crusade", "publisher": "DreamCatcher Interactive", "release_date": "Mar 20 2007", "developers": ["Metamorf Studios"], "platforms": "PC", "num_players": "12  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 57, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/1544500821903a48163fb47ce9b08dda-98.jpg", "descriptions": "Genesis Rising: The Universal Crusade takes place in the very distant future, three thousand years after what humans believe was the arrival of \"the savior\". The human race has conquered most of the Universe. They consider themselves a divine race, and think of all aliens as inferior; thoseGenesis Rising: The Universal Crusade takes place in the very distant future, three thousand years after what humans believe was the arrival of \"the savior\". The human race has conquered most of the Universe. They consider themselves a divine race, and think of all aliens as inferior; those that do not obey are punished or destroyed. The dominion of the human race was insured by organids - genetically designed organic machines, easily adaptable to any enemy strategy. Only one part of the Universe remains unconquered. It is the galaxy where the Universal Heart, an enigmatic entity that spawned all life and matter into the universe, is hidden. At least, that's what the humans believe... The player will take on a role of captain Iconah, a battle-hardened fleet commander and a brilliant genetic designer, sent on a quest to explore and conquer the Universal Heart. [DreamCatcher Interactive]… Expand"}, {"name": "Gungrave G.O.R.E", "details_link": "https://www.metacritic.com/game/pc/gungrave-gore", "publisher": "Prime Matter", "release_date": "Nov 22 2022", "developers": ["IGGYMOB"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 57, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/5/b5e4956db74ee0fd855a9ca82b5ffade-98.jpg", "descriptions": "In Gungrave G.O.R.E, play the gun-wielding badass anti-hero of your dreams as you mow down tons of enemies in a gory ballet of bullets and experience a story of vengeance, love and loyalty, all in a beautiful third-person action shooter, combining the best that Eastern and Western gameIn Gungrave G.O.R.E, play the gun-wielding badass anti-hero of your dreams as you mow down tons of enemies in a gory ballet of bullets and experience a story of vengeance, love and loyalty, all in a beautiful third-person action shooter, combining the best that Eastern and Western game design have to offer.As the titular Gunslinger of Resurrection, you become the badass anti-hero of your dreams, an ultimate killing machine, brutalising your foes without mercy. Taking cover and retreating is not an option for Grave, he only ever goes full steam ahead, preferably right through his enemies.Stylish third-person shooting meets close-range martial arts, creating seamlessly flowing action as you crush your enemies in a gory ballet of bullets. Utilise your unlimited ammo Cerberus pistols and your transformable EVO-coffin to unleash devastating combos in pursuit of maximum damage and style.… Expand"}, {"name": "Gungrave G.O.R.E", "details_link": "https://www.metacritic.com/game/playstation-5/gungrave-gore", "publisher": "Koch Media", "release_date": "Nov 22 2022", "developers": ["IGGYMOB"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 57, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/2f22affb0e651e04f47687d9ccd3f67b-98.jpg", "descriptions": "In Gungrave G.O.R.E, play the gun-wielding badass anti-hero of your dreams as you mow down tons of enemies in a gory ballet of bullets and experience a story of vengeance, love and loyalty, all in a beautiful third-person action shooter, combining the best that Eastern and Western gameIn Gungrave G.O.R.E, play the gun-wielding badass anti-hero of your dreams as you mow down tons of enemies in a gory ballet of bullets and experience a story of vengeance, love and loyalty, all in a beautiful third-person action shooter, combining the best that Eastern and Western game design have to offer.\r As the titular Gunslinger of Resurrection, you become the badass anti-hero of your dreams, an ultimate killing machine, brutalising your foes without mercy. Taking cover and retreating is not an option for Grave, he only ever goes full steam ahead, preferably right through his enemies.\r Stylish third-person shooting meets close-range martial arts, creating seamlessly flowing action as you crush your enemies in a gory ballet of bullets. Utilise your unlimited ammo Cerberus pistols and your transformable EVO-coffin to unleash devastating combos in pursuit of maximum damage and style.… Expand"}, {"name": "DOLMEN", "details_link": "https://www.metacritic.com/game/xbox-series-x/dolmen", "publisher": "Deep Silver", "release_date": "May 20 2022", "developers": ["Massive Work Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 57, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/42ddb9da24b564c615516b70a2641652-98.jpg", "descriptions": "Cosmic Horror and Sci-Fi are two ways to talk about Dolmen. It is a third person action game with RPG elements but with a lovecraftian plot that calls players to find what's behind the darkest secret of the universe! A forgotten planet called Revion Prime will be the place where the actionCosmic Horror and Sci-Fi are two ways to talk about Dolmen. It is a third person action game with RPG elements but with a lovecraftian plot that calls players to find what's behind the darkest secret of the universe! A forgotten planet called Revion Prime will be the place where the action takes part. And it won't be easy: Adaptation and exploration will be your main weapons as you craft new items and equipments from your enemies' carcasses! Every step can be your last one!\r Use your experience points to improve yourself and face what no human has ever faced. After all, quoting David Hume: \"The life of man is of no greater importance to the universe than that of an oyster.\" Maybe he was right Or not.… Expand"}, {"name": "The Bunker", "details_link": "https://www.metacritic.com/game/pc/the-bunker", "publisher": "Green Man Gaming Publishing", "release_date": "Sep 20 2016", "developers": ["Slendy Interactive", "Splendy Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 57, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/a71b144f63105ad6afbf1c45a0c308c6-98.jpg", "descriptions": "The Bunker is a live action psychological horror game starring Adam Brown (The Hobbit) and Sarah Greene (Penny Dreadful, Assassin’s Creed 3) with a story written anddeveloped by gaming talent behind The Witcher, Broken Sword and SOMA."}, {"name": "ZHEROS", "details_link": "https://www.metacritic.com/game/xbox-one/zheros", "publisher": "Rimlight Studios", "release_date": "Jan 15 2016", "developers": ["Rimlight Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 57, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/447085cccfae9dbc711f4a3303005927-98.jpg", "descriptions": "ZHEROS is a 3D beat’em up, set on one goal: pure and fast action. Plenty of fights and an original style will take the player on a fascinating and twisted journey."}, {"name": "Onechanbara Z2: Chaos", "details_link": "https://www.metacritic.com/game/playstation-4/onechanbara-z2-chaos", "publisher": "XSEED Games", "release_date": "Jul 21 2015", "developers": ["Tamsoft", "D3Publisher"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 57, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/4aed028fca7154c4683b078982892d63-98.jpg", "descriptions": "This installment in the Onechanbara sexy zombie slayer series ups the ante with 2 sets of buxom vampire sisters and over a dozen stages of high-octane real-time swordplay featuring hordes of zombies—not to mention novel methods of dispatching these undead opponents. Players will be pittedThis installment in the Onechanbara sexy zombie slayer series ups the ante with 2 sets of buxom vampire sisters and over a dozen stages of high-octane real-time swordplay featuring hordes of zombies—not to mention novel methods of dispatching these undead opponents. Players will be pitted against the undead in various worldwide locations, with limbs and blood flying every which way by means of physical attacks and acrobatic maneuvers alike, occasionally transforming into a demon for short bursts of added power and speed at the cost of life energy. Each of the 4 members of this “Zombie Punitive Force” has her own unique abilities, and skillful play is rewarded with orbs that can be exchanged for upgraded weapons and outfits. For the first time in the series, players can enjoy the game with full English voice-acting or play through with the original Japanese performances. [Xseed]… Expand"}, {"name": "Final Exam", "details_link": "https://www.metacritic.com/game/xbox-360/final-exam", "publisher": "Focus Home Interactive", "release_date": "Nov  8 2013", "developers": ["Mighty Rocket Studio"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 57, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/ffc0289b9420663ff269df9d59ee42a6-98.jpg", "descriptions": "Playable alone and in cooperative mode (local & online), Obscure lets you play as one of four unlikely heroes; students, each with unique skills and abilities that develop throughout the adventure. Geared toward action and all-out brawling, Obscure's combat emphasizes combos, follow-upPlayable alone and in cooperative mode (local & online), Obscure lets you play as one of four unlikely heroes; students, each with unique skills and abilities that develop throughout the adventure. Geared toward action and all-out brawling, Obscure's combat emphasizes combos, follow-up attacks, and score-multipliers! Survive against packs of monsters trying to skin you alive, discover new weapons, and complete objectives throughout a variety of huge, non-linear levels. Overshooting the scores will earn you experience points to level your character up, unlocking new weapons, skills, and other devastating abilities! At any time, you can even get back to some of earlier levels to try your new toys and beat your scores! … Expand"}, {"name": "Art of Murder: Cards of Destiny", "details_link": "https://www.metacritic.com/game/pc/art-of-murder-cards-of-destiny", "publisher": "City Interactive", "release_date": "Feb 23 2010", "developers": ["City Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 57, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/469484dcc74cdb8dc179d633dcf97b54-98.jpg", "descriptions": "A mysterious package begins an epic duel of minds between FBI agent Nicole Bonnet and a ruthless serial killer, who leaves playing cards by the bodies of his victims as signature. Does Nicole have what it takes to understand the mind of a psychopath, as complicated as his puzzles? If not,A mysterious package begins an epic duel of minds between FBI agent Nicole Bonnet and a ruthless serial killer, who leaves playing cards by the bodies of his victims as signature. Does Nicole have what it takes to understand the mind of a psychopath, as complicated as his puzzles? If not, she can end up as his next trophy... Dark plot set in the best traditions of police thrillers. Pieces of evidence that Reed to be found and analyzed. Detailed locations in various places of the United States. [City Interactive]… Expand"}, {"name": "DreamWorks Shrek the Third", "details_link": "https://www.metacritic.com/game/psp/dreamworks-shrek-the-third", "publisher": "Activision", "release_date": "May 15 2007", "developers": ["Amaze Entertainment"], "platforms": ["PC", "Xbox 360", "PSP"], "num_players": "1-2 ", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 57, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/29d2270012141ee760b40f531ba68209-98.jpg", "descriptions": "Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies,Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies, and visit never before seen lands from the movie and beyond. [Activision]… Expand"}, {"name": "Carmen Sandiego: The Secret of the Stolen Drums", "details_link": "https://www.metacritic.com/game/gamecube/carmen-sandiego-the-secret-of-the-stolen-drums", "publisher": "Bam Entertainment", "release_date": "Sep 13 2004", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 57, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/8e1dcf48987e7203a29a4ca2b3b1739c-98.jpg", "descriptions": "Join A.C.M.E. agent-in-training, Cole Gannon, along with Jules Argent and Shadow Hawkins, in an all-new action adventure on the trail of Carmen Sandiego--the world's greatest thief. This case takes Cole around the world: from a museum in New York and the beaches of New Zealand to the IncanJoin A.C.M.E. agent-in-training, Cole Gannon, along with Jules Argent and Shadow Hawkins, in an all-new action adventure on the trail of Carmen Sandiego--the world's greatest thief. This case takes Cole around the world: from a museum in New York and the beaches of New Zealand to the Incan ruins of Machu Picchu. While on the case, you'll need to use acrobatics, stealth, martial arts, and most of all, your wit, to stop Carmen from unearthing the drums and making off with the lost treasure.… Expand"}, {"name": "World War II Online: Blitzkrieg", "details_link": "https://www.metacritic.com/game/pc/world-war-ii-online-blitzkrieg", "publisher": "Strategy First", "release_date": "Jun  4 2001", "developers": ["Cornered Rat"], "platforms": "PC", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 57, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/3cd6366f9ef5cb8d6474c24015f7d7e7-98.jpg", "descriptions": "It brings air, ground, and sea combat of WWII to life in an online, real-time, persistent, and massively multiplayer environment. You can command a variety of accurately modeled vehicles, aircraft, and ships or explore the world and fight as a foot soldier in first-person combat with andIt brings air, ground, and sea combat of WWII to life in an online, real-time, persistent, and massively multiplayer environment. You can command a variety of accurately modeled vehicles, aircraft, and ships or explore the world and fight as a foot soldier in first-person combat with and against thousands of others. [Strategy First]… Expand"}, {"name": "Merchant Prince II", "details_link": "https://www.metacritic.com/game/pc/merchant-prince-ii", "publisher": "Take-Two Interactive", "release_date": "Apr 30 2001", "developers": ["Holistic Design", "Inc."], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "General", "General"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/e62170ae372c35f3081341b54ddfa24c-98.jpg", "descriptions": "This turn-based strategy game focusing on the development of Venice and the establishment of Venitian commercial trade routes is really the third quite similar incarnation of the original \"Merchant Prince\" which debuted in 1993 (yes, 1993) and which reared it's head again in 1995 as \"Machiavelli.\""}, {"name": "Robotech: Invasion", "details_link": "https://www.metacritic.com/game/playstation-2/robotech-invasion", "publisher": "Global Star Software", "release_date": "Oct  5 2004", "developers": ["Vicious Cycle"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 57, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/400eb54b7a99ecd72e19eff89e950e43-98.jpg", "descriptions": "In the 21st century, humankind was freed from the confines of the solar system through the discovery of an alien technology known as Robotech. Contact with the stars also brought war with the Invid, a race of parasitic aliens bent on conquering and transforming the Earth into their new homeIn the 21st century, humankind was freed from the confines of the solar system through the discovery of an alien technology known as Robotech. Contact with the stars also brought war with the Invid, a race of parasitic aliens bent on conquering and transforming the Earth into their new home world. Now it is up to the battlehardened survivors of the Robotech Expedition to lead the way for one final attempt to liberate the Earth from the Invid Invaders! Play single player, two-player split-screen and online play: Up to 8 players via Xbox Live! or PlayStation 2 Online Pack. Freeform FPS action with expansive outdoor environments and clear objectives. Sophisticated enemy AI with different behavior patterns for each enemy type. 2 parallel scenarios: playing as the 2nd character reveals a new perspective and plot details. Control Cyclone vehicles with a realistic feeling of momentum, balance and traction. Hive raids, gang confrontations, protoculture searches and more. [Gathering]… Expand"}, {"name": "THE HOUSE OF THE DEAD: Remake", "details_link": "https://www.metacritic.com/game/switch/the-house-of-the-dead-remake", "publisher": "Forever Entertainment", "release_date": "Apr  7 2022", "developers": ["MegaPixel Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 57, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/a9af82c89971519b1180ff520cec3a8b-98.jpg", "descriptions": "Nobody leaves here alive!The House of the Dead: Remake is a remade version of the game introduced in 1997 in arcade platform. A classic arcade rail-shooter receives a whole new entourage and gameplay changes to suit modern gaming standards.\n\n* Hordes of the undead monstrosities in aNobody leaves here alive!The House of the Dead: Remake is a remade version of the game introduced in 1997 in arcade platform. A classic arcade rail-shooter receives a whole new entourage and gameplay changes to suit modern gaming standards.* Hordes of the undead monstrosities in a fast-paced rail-shooter. * True to the original gameplay. * Well know arcade classic with modern graphics and controls. * Multiple endings.… Expand"}, {"name": "Dynasty Warriors Vol. 2", "details_link": "https://www.metacritic.com/game/psp/dynasty-warriors-vol-2", "publisher": "Koei", "release_date": "Oct 24 2006", "developers": ["Omega Force"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 57, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/91f0895429213bd023d24e7499224412-98.jpg", "descriptions": "Ancient China's greatest warriors have rocked the foundations of heaven and earth for over 2,000 years. Now KOEI's 'Warriors Worth a Thousand' return in a sequel that eclipses the original with an exquisite array of features. For the first time, up to 4 players can engage in multiplayerAncient China's greatest warriors have rocked the foundations of heaven and earth for over 2,000 years. Now KOEI's 'Warriors Worth a Thousand' return in a sequel that eclipses the original with an exquisite array of features. For the first time, up to 4 players can engage in multiplayer combat including a Battle Royal mode. Players can now unlock up to 300 officers (three times as many as the original), and then wirelessly trade these officers with other players. Players can also manage a stable of up to 8 horses and elephants. Each mount will gain experience during battle and will prove a valuable military asset when setting out to conquer the game's more than 50 stages and 31 maps. Dynasty Warriors Vol. 2 includes the complete pantheon of all 48 Dynasty Warriors, with branching story paths for each kingdom. Game modes include Musou, Multiplayer and Free mode, plus a Camp mode where players can view detailed information on weapons, officers and stages. The game also gives players a full view of the battlefield action using the PSP system's wide-screen display. [Koei]… Expand"}, {"name": "Wanted: Dead", "details_link": "https://www.metacritic.com/game/playstation-5/wanted-dead", "publisher": "110 Industries", "release_date": "Feb 14 2023", "developers": ["110 Industries", "Soleil Ltd."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 57, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/9f1410be54cfc79cd94392aebd7405e3-98.jpg", "descriptions": "Wanted: Dead is a new hybrid slasher/shooter from the makers of Ninja Gaiden and Dead or Alive. The game follows a week in life of the Zombie Unit, an elite Hong Kong police squad on a mission to uncover a major corporate conspiracy. \r\rPlay as Lt. Hannah Stone, a hardboiled Hong Kong cop,Wanted: Dead is a new hybrid slasher/shooter from the makers of Ninja Gaiden and Dead or Alive. The game follows a week in life of the Zombie Unit, an elite Hong Kong police squad on a mission to uncover a major corporate conspiracy. \r\rPlay as Lt. Hannah Stone, a hardboiled Hong Kong cop, and plow through mercenaries, gang members and private military contractors in a spectacular cyberpunk adventure.… Expand"}, {"name": "Randal's Monday", "details_link": "https://www.metacritic.com/game/pc/randals-monday", "publisher": "Daedalic Entertainment", "release_date": "Nov 12 2014", "developers": ["Nexus Game Studio"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 57, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/94233c0fbcc457d3e6580a0f52a133f8-98.jpg", "descriptions": "Randal's Monday is a whacky space-time odyssey in classic adventure design, spiced up with a myriad geek culture references from the last thirty years."}, {"name": "Armikrog", "details_link": "https://www.metacritic.com/game/pc/armikrog", "publisher": "Versus Evil", "release_date": "Sep 30 2015", "developers": ["Pencil Test Studios"], "platforms": ["PlayStation 4", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "Point-and-Click"], "meta_score": 57, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/95e51b1a2bc97471404b47665c4bedab-98.jpg", "descriptions": "From the creators of the Earthworm Jim and The Neverhood games, comes a stop motion clay animated adventure game called Armikrog."}, {"name": "Double Dragon", "details_link": "https://www.metacritic.com/game/xbox-360/double-dragon", "publisher": "Empire Interactive", "release_date": "May  9 2007", "developers": ["Razorworks"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 4", "Switch", "Switch", "Xbox One", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/caccbf746706bd1e039700e0a3ae2147-98.jpg", "descriptions": "[Xbox Live Arcade]  Double Dragon re-introduces martial Arts masters, Billy and Jimmy Lee (AKA Hammer and Spike), who must defeat the savage street gang known as the Black Warriors to rescue Billy's girlfriend, Marian. Fight your way through four levels from the street and factory to[Xbox Live Arcade]  Double Dragon re-introduces martial Arts masters, Billy and Jimmy Lee (AKA Hammer and Spike), who must defeat the savage street gang known as the Black Warriors to rescue Billy's girlfriend, Marian. Fight your way through four levels from the street and factory to jungle/forest and castle, using every move available to you such as back-kicks, elbows, uppercuts and more. The Xbox Live Arcade version featurse a downloadable demo and original and graphical enhanced versions. Player action includes online co-op 2 player and one-on-one fighting for the final battle. The game also features the opportunity to score 12 achievement points for your online Xbox Live Arcade profile and an online leaderboard gives you the opportunity to show off your Double Dragon skills to your friends. [Empire Interactive]… Expand"}, {"name": "Blazing Angels: Squadrons of WWII", "details_link": "https://www.metacritic.com/game/wii/blazing-angels-squadrons-of-wwii", "publisher": "Ubisoft", "release_date": "Mar 20 2007", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 57, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/885bb88efd4d09ee24c61ed8b258bf1a-98.jpg", "descriptions": "As a squadron leader and ace fighter pilot, leverage the Wii controller to experience intense dog fighting in the famous air battles of WW II. During the course of the mission campaign, players evolve along with their wingmen into an ace fighting force. Spectacular graphics enhance theAs a squadron leader and ace fighter pilot, leverage the Wii controller to experience intense dog fighting in the famous air battles of WW II. During the course of the mission campaign, players evolve along with their wingmen into an ace fighting force. Spectacular graphics enhance the combat experience in true World War II battle sites such as England, Germany, France, Morocco, Pearl Harbor, Midway and Tokyo. The heroic storyline that follows the evolution of a single squadron and the cinematic presentation create moments reminiscent of classic World War II movies. Pilots fly in close to Germany’s industrial terrain during a bombing raid or emerge from the fog and cloud cover over London to engage the enemy. Up to 16 players online can engage online in head-to-head dogfights or cooperative team play between squadrons in 10 additional missions. [Ubisoft]… Expand"}, {"name": "Breach", "details_link": "https://www.metacritic.com/game/xbox-360/breach", "publisher": "Destineer", "release_date": "Jan 26 2011", "developers": ["Atomic Games"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 57, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/85fa2c2250a0f797c3ebe9eac4dc2944-98.jpg", "descriptions": "Breach is a multiplayer first-person shooter based on a CIA Special Activities Division."}, {"name": "Michael Jackson The Experience HD", "details_link": "https://www.metacritic.com/game/playstation-vita/michael-jackson-the-experience-hd", "publisher": "Ubisoft", "release_date": "Feb 15 2012", "developers": ["Ubisoft"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "Xbox 360", "PlayStation Vita"], "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 57, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/24c79bf6df99f3f7201e895da019a3ee-98.jpg", "descriptions": "Michael Jackson, one of the most widely beloved entertainers and the most popular global icons of all time, leaves an indelible imprint on popular music and culture. During his extraordinary career Jackson sold an estimated 750 million records worldwide, released 13 No.1 singles and becameMichael Jackson, one of the most widely beloved entertainers and the most popular global icons of all time, leaves an indelible imprint on popular music and culture. During his extraordinary career Jackson sold an estimated 750 million records worldwide, released 13 No.1 singles and became one of a handful of artists to be inducted twice into the Rock and Roll Hall of Fame. He won 13 Grammy Awards and received the American Music Award's Artist of the Century Award. His album \"Thriller\" is the world's best-selling album of all time with more than 110 million copies sold. … Expand"}, {"name": "The Legend of Spyro: Dawn of the Dragon", "details_link": "https://www.metacritic.com/game/ds/the-legend-of-spyro-dawn-of-the-dragon", "publisher": "Sierra Entertainment", "release_date": "Oct 21 2008", "developers": ["Etranges Libellules"], "platforms": ["PlayStation 3", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 57, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/d0b2dd1530faf7ef263cc6091f08573b-98.jpg", "descriptions": "Spyro: Dawn of the Dragon is the third chapter in the Legend of Spyro trilogy. Reprising their roles as the characters of Spyro and his mentor Ignitus, are two popular Hollywood leading men, Elijah Wood (Frodo Baggins in The Lord of the Rings trilogy) and Gary Oldman (Sirius Black from theSpyro: Dawn of the Dragon is the third chapter in the Legend of Spyro trilogy. Reprising their roles as the characters of Spyro and his mentor Ignitus, are two popular Hollywood leading men, Elijah Wood (Frodo Baggins in The Lord of the Rings trilogy) and Gary Oldman (Sirius Black from the Harry Potter films).  Joining the Spyro roster this year are Christina Ricci, Blair Underwood, Mark Hamill and Wayne Brady, rounding out an all-star voice cast. [Sierra]… Expand"}, {"name": "EyePet", "details_link": "https://www.metacritic.com/game/psp/eyepet", "publisher": "SCEA", "release_date": "Nov  2 2010", "developers": ["SCEE London Studio"], "platforms": ["PlayStation 3", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/57a33a0e8521ecf252808aa239144585-98.jpg", "descriptions": "EyePet is a virtual pet game that uses the PlayStation's Eye peripheral."}, {"name": "SpongeBob SquarePants: Creature from the Krusty Krab", "details_link": "https://www.metacritic.com/game/wii/spongebob-squarepants-creature-from-the-krusty-krab", "publisher": "THQ", "release_date": "Nov 13 2006", "developers": ["Blitz Games"], "platforms": ["PC", "PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 57, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/47abb93a6ff33a6f0a79debdf0c2cbf2-98.jpg", "descriptions": "Bikini Bottom will never be the same. SpongeBob SquarePants: Creature from the Krusty Krab brings the #1 kids gaming franchise and TV property into the bizarre and unusual, introducing never-before-seen art styles and brand new gameplay mechanics that will change your perception of BikiniBikini Bottom will never be the same. SpongeBob SquarePants: Creature from the Krusty Krab brings the #1 kids gaming franchise and TV property into the bizarre and unusual, introducing never-before-seen art styles and brand new gameplay mechanics that will change your perception of Bikini Bottom forever. Embark on a series of fantastic tales through nine visually unique levels. Experience five brand new gameplay mechanics including rampaging, flying, skydiving, chase and hot rod racing. Rampage through Bikini Bottom as gigantic Plankton. Fly through the savage jaw of the enormous bull worm as SpongeBob. Blast off into outer space and survive a hi-speed asteroid field as Patrick. Plunge into the pages of a comic book as Starfishman and become the hero of the seven seas. Speed through the metallic flames, chrome and smoke-filled world of Hot Rod racing. [THQ]… Expand"}, {"name": "FIFA Soccer 13", "details_link": "https://www.metacritic.com/game/playstation-vita/fifa-soccer-13", "publisher": "EA Sports", "release_date": "Sep 25 2012", "developers": ["Electronic Arts"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Wii U", "Xbox 360", "PlayStation Vita"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 57, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/4/d00e99b47bda83a1e87178d0d9bdfc52-98.jpg", "descriptions": "FIFA 13 is the next iteration in the football franchise - in handheld form."}, {"name": "Dead Space 2: Severed", "details_link": "https://www.metacritic.com/game/xbox-360/dead-space-2-severed", "publisher": "Electronic Arts", "release_date": "Mar  1 2011", "developers": ["Visceral Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 57, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/ccd80f641afbcd0eb2d10820db93256d-98.jpg", "descriptions": "Dead Space 2: Severed contains two new single-player chapters and new Achievements."}, {"name": "Nether", "details_link": "https://www.metacritic.com/game/pc/nether", "publisher": "Nether Productions", "release_date": "Jun  5 2014", "developers": ["Phosphor Games Studio", "LLC"], "platforms": "PC", "genres": ["Sci-Fi", "Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi"], "meta_score": 57, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/3/7a44eb535bee6c669882a82a3fcb2371-98.jpg", "descriptions": "In Nether, players are thrust into a decimated, post-apocalyptic city where the remaining human population has degenerated into a chaotic state of lawlessness. A pervasive sense of evil looms over the land as people struggle to survive and rumors circulate of vile, demonic creatures thatIn Nether, players are thrust into a decimated, post-apocalyptic city where the remaining human population has degenerated into a chaotic state of lawlessness. A pervasive sense of evil looms over the land as people struggle to survive and rumors circulate of vile, demonic creatures that roam the cities to claim any souls still living. As one of the few remaining survivors, players must decide if they will Prey or Pray as they use skill and cunning to obtain food, weapons and other supplies necessary for existence while trying to determine whether or not to approach and trust other players or go at it solo.… Expand"}, {"name": "ESPN NFL PrimeTime 2002", "details_link": "https://www.metacritic.com/game/xbox/espn-nfl-primetime-2002", "publisher": "Konami", "release_date": "Jan 22 2002", "developers": ["Farsight Technologies"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/2debb640653df69512e978c9ffda2d92-98.jpg", "descriptions": "ESPN NFL PrimeTime 2002 lets you control all the action of the NFL, from the field to the front office. You play the game while Berman and Jackson provide unparalelled commentary and play-by-play. It's the NFL with the personality you'd expect from the Worldwide Leader in Sports - ESPN."}, {"name": "Tomb Raider: Chronicles", "details_link": "https://www.metacritic.com/game/pc/tomb-raider-chronicles", "publisher": "Eidos Interactive", "release_date": "Nov 21 2000", "developers": ["Core Design Ltd."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Linear"], "meta_score": 57, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/d1d53858ccd37cb24b1c0a9513d10ef7-98.jpg", "descriptions": "Four new adventures take you from the rooftops of a high-tech city to the bowels of a German U-boat. Utilize new moves to overcome obstacles. Search through files, drawers, and shelves for useful inventory items. Enhanced inventory system for greater combination of a variety of weapons.Four new adventures take you from the rooftops of a high-tech city to the bowels of a German U-boat. Utilize new moves to overcome obstacles. Search through files, drawers, and shelves for useful inventory items. Enhanced inventory system for greater combination of a variety of weapons.  [Eidos Interactive]… Expand"}, {"name": "Sydney 2000", "details_link": "https://www.metacritic.com/game/playstation/sydney-2000", "publisher": "Eidos Interactive", "release_date": "Jul 31 2000", "developers": ["Attention To Detail"], "platforms": ["PC", "PlayStation"], "num_players": "1-2 ", "genres": ["Sports", "Olympic Sports"], "meta_score": 57, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/bcdfde13c405b1e13b849e0ac3f44144-98.jpg", "descriptions": "If you buy into the whole button-mashing mentality of track and field games, you'll find that Sydney 2000 turns in a solid, finger-numbing performance."}, {"name": "The First Templar", "details_link": "https://www.metacritic.com/game/pc/the-first-templar", "publisher": "Kalypso", "release_date": "May 12 2011", "developers": ["Haemimont", "Haemimont Games"], "platforms": ["Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Adventure", "General", "Historic", "General", "Historic"], "meta_score": 57, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/e64a958ffe1eea1b3a8c6080239f0d80-98.jpg", "descriptions": "The First Templar follows the story of two main characters – a French Templar, and his companion, a noble lady who has been proclaimed a heretic. Taking control over these two unlikely allies, the player must uncover the mysteries behind the Templar Order, play a role in a grand conspiracy,The First Templar follows the story of two main characters – a French Templar, and his companion, a noble lady who has been proclaimed a heretic. Taking control over these two unlikely allies, the player must uncover the mysteries behind the Templar Order, play a role in a grand conspiracy, and discover the secret of the Holy Grail. The heroes face powerful opponents at every turn, in the face of the Saracen, King Philip IV of France and the Inquisition.… Expand"}, {"name": "Astro Bears Party", "details_link": "https://www.metacritic.com/game/switch/astro-bears-party", "publisher": "QubicGames", "release_date": "Sep 28 2017", "developers": ["QubicGames"], "platforms": "Switch", "num_players": "Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "Party / Minigame"], "meta_score": 57, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/6e6699e4d833b850577bbc36b5679f7f-98.jpg", "descriptions": "Astro Bears Party is an easy-to-learn, hard-to-master game about running around a planet and avoiding each other's Magical Beary Ribbons. Jump and hover over Ribbons using a jetpack. Perform dashes to threaten your opponents. Be the last Bear standing. Choose one of 4 Bears with differentAstro Bears Party is an easy-to-learn, hard-to-master game about running around a planet and avoiding each other's Magical Beary Ribbons. Jump and hover over Ribbons using a jetpack. Perform dashes to threaten your opponents. Be the last Bear standing. Choose one of 4 Bears with different playstyles and battle between 2-4 players. Take a challenge in single player mode and beat your own record in Jetfish Hunting. [Nintendo]… Expand"}, {"name": "Legend: Hand of God", "details_link": "https://www.metacritic.com/game/pc/legend-hand-of-god", "publisher": "ValuSoft", "release_date": "Aug  1 2008", "developers": ["Master Creating"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 57, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/0984cc871d53bfc0aded7e11b42f5e92-98.jpg", "descriptions": "(Currently available in the UK/EU only)  Whether large or small, the main difference between enemies in modern action-oriented RPGs has always just been the number of their hitpoints. Legend – Hand of God, the new action RPG by dtp entertainment and Master Creating breaks with this(Currently available in the UK/EU only)  Whether large or small, the main difference between enemies in modern action-oriented RPGs has always just been the number of their hitpoints. Legend – Hand of God, the new action RPG by dtp entertainment and Master Creating breaks with this tradition, setting new standards. Thanks to the innovative Cinematic Combat System, orcs, ogres, trolls, goblins and their ilk will all be fought heroically in their own right. The Cinematic Combat System makes every monster brawl special. In Legend, gamers won't use their sword to tickle giant enemies at the knees anymore, but will fight them in a challenging and realistic manner – and in beautiful, spectacular 3D graphics. At the same time, Legend – Hand of God remains just as easy to control as other action RPGs. The impressive graphics are provided by an in-house engine, tailored specifically for the needs of an action RPG. Randomly generated dungeons and a manually crafted world on the surface bring the fantasy universe of Legend – Hand of God to life. A luminous spirit accompanies the players, giving them tips and clues, serving as the cursor and – thanks to real-time lighting – illuminating the dark corners of the world.… Expand"}, {"name": "Griefhelm", "details_link": "https://www.metacritic.com/game/pc/griefhelm", "publisher": "Thorrnet Publishing", "release_date": "Aug 20 2020", "developers": ["Johnny Dale Lonack"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Action", "General", "Fighting", "2D"], "meta_score": 57, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/e29caaa518c246b4396a14b443908e85-98.jpg", "descriptions": "Griefhelm is an award-winning tactical dueling game with lethal medieval weaponry. Skewer enemies, deflect blows, and push your advantage as you tactically overcome your foes in fast-paced duels. Prove yourself worthy of eternal reward."}, {"name": "Rugby 20", "details_link": "https://www.metacritic.com/game/xbox-one/rugby-20", "publisher": "Bigben Interactive", "release_date": "Jan 23 2020", "developers": ["Bigben Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Sports", "Team", "Rugby"], "meta_score": 57, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/9/781ba8aa3263313f21cb190af80d96fa-98.jpg", "descriptions": "Play with the best national teams and biggest leagues in intense single-player and multiplayer matches, local or online: Top 14, Pro D2, Gallagher Premiership and Pro 14. Experience tactical depth that recreates all the intricacies of the modern game. On the pitch, you can tweak your gamePlay with the best national teams and biggest leagues in intense single-player and multiplayer matches, local or online: Top 14, Pro D2, Gallagher Premiership and Pro 14. Experience tactical depth that recreates all the intricacies of the modern game. On the pitch, you can tweak your game plan, manage your line-out, initiate set moves, find spaces and give your side the winning edge.… Expand"}, {"name": "Wizardry: Labyrinth of Lost Souls", "details_link": "https://www.metacritic.com/game/playstation-3/wizardry-labyrinth-of-lost-souls", "publisher": "XSEED Games", "release_date": "May 16 2011", "developers": ["Acquire"], "platforms": ["PC", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 57, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/1414a585fc0c84f57827b6573acc89ad-98.jpg", "descriptions": "Following in the grand tradition of the Wizardry series is the very first version available for todayâ€™s Next-Gen gamers; Wizardry: Labyrinth of Lost Souls features a deceptively simple game system complementing deep and involving dungeon designs.  Hardcore RPG fans will find anFollowing in the grand tradition of the Wizardry series is the very first version available for todayâ€™s Next-Gen gamers; Wizardry: Labyrinth of Lost Souls features a deceptively simple game system complementing deep and involving dungeon designs.  Hardcore RPG fans will find an extensive and grueling 1st-person 3D grid-based dungeon crawl experience rendered in high-definition with hand-drawn characters and sprites by famous commercial artist Yuki Hayabusa. Players will develop a party of up to six members culled from a rich mix of five races and eight classes, and prepare to encounter over 120 different monsters. … Expand"}, {"name": "Zatch Bell! Mamodo Battles", "details_link": "https://www.metacritic.com/game/gamecube/zatch-bell!-mamodo-battles", "publisher": "Bandai", "release_date": "Oct 19 2005", "developers": ["Eighting"], "platforms": "GameCube", "genres": ["Action", "Fighting", "3D"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/0f319e40c43a16624fb7aef1f6e8d997-98.jpg", "descriptions": "Every one thousand years, one hundred mamodo descend upon the earth to conduct the ultimate battle for the mamodo throne! But to unlock the power of their spell books, the mamodo must find their human partners! Grab your spell book, choose your team and let the battles commence!"}, {"name": "Faery: Legends of Avalon", "details_link": "https://www.metacritic.com/game/xbox-360/faery-legends-of-avalon", "publisher": "Focus Home Interactive", "release_date": "Nov 10 2010", "developers": ["Spiders"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Role-Playing", "General", "General"], "meta_score": 57, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/ca7abbc8bc547dd66a4a00768bbc6fa8-98.jpg", "descriptions": "Faery: Legends of Avalon is a Role Playing / Adventure game packed with an original and unique atmosphere, and a graphics design close to illustration. The game immerses players in a fantasy world inhabited by many colourful characters and magical creatures."}, {"name": "Bomberman Land", "details_link": "https://www.metacritic.com/game/wii/bomberman-land", "publisher": "Hudson Entertainment", "release_date": "Jan 29 2008", "developers": ["Racjin"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 57, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/dd272def4f873e8dab4a251140d72988-98.jpg", "descriptions": "Bomberman Land brings together 3 exciting game modes into one. The series introduces a bevy of mini-games, where most can be played in multiplayer mode.  The PSP system version features 50 mini-games, the Wii features 50, and the DS has 40 unique mini-games. In addition, the Bomberman LandBomberman Land brings together 3 exciting game modes into one. The series introduces a bevy of mini-games, where most can be played in multiplayer mode.  The PSP system version features 50 mini-games, the Wii features 50, and the DS has 40 unique mini-games. In addition, the Bomberman Land series features a robust single-player Story Mode, where players can explore a fantasy land and solve quests and puzzles with the ultimate goal of restoring peace and tranquility to the beleaguered Bomberman world. Best of all, the game includes the Battle Pack Mode, the classic multiplayer Bomberman experience that gamers know and love. The PSP system and the DS versions both allow gamers to share one game cartridge and network with friends to create the ultimate party game. [Hudson Soft]… Expand"}, {"name": "Tour de France 2018", "details_link": "https://www.metacritic.com/game/playstation-4/tour-de-france-2018", "publisher": "Focus Home Interactive", "release_date": "Jun 28 2018", "developers": ["Cyanide", "Cyanide Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Sports", "Individual", "Biking"], "meta_score": 57, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/0621f95f0d275265552a47ba040b0742-98.jpg", "descriptions": "Embody the greatest champions and hit the official track of the Tour de France 2018. Enjoy all the intensity of this legendary race: attack, follow the best trajectories, and carry out the finest racing tactics to lead your team to victory and earn the mythical Yellow Jersey LCL."}, {"name": "Rocketmen: Axis of Evil", "details_link": "https://www.metacritic.com/game/xbox-360/rocketmen-axis-of-evil", "publisher": "Capcom", "release_date": "Mar  5 2008", "developers": ["A.C.R.O.N.Y.M. Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 57, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/6f5f0f025b521dd881a705fc1fff8533-98.jpg", "descriptions": "[Xbox Live Arcade]  In this arcade shooter, players join the heroes of the Alliance of Free Planets in their white-knuckled, frenzied struggle to free the Solar System from the tyrannical grip of the Legion of Terra. Up to four players will be able to cooperatively shoot their way through[Xbox Live Arcade]  In this arcade shooter, players join the heroes of the Alliance of Free Planets in their white-knuckled, frenzied struggle to free the Solar System from the tyrannical grip of the Legion of Terra. Up to four players will be able to cooperatively shoot their way through multiple levels, powering up their weapons, picking up bonuses and laying waste to anything that moves. Online multiplayer gameplay through a variety of mini games that let players instantly jump into existing games. Design and build your own character for both single and multi-player games, each with their own. Three races - Human, Mercurian or Venusian; Three classes - Fighter, Engineer, Outcast. Further character customization options through new items and abilities earned by progressing through a variety of quests. Multiple hours of gameplay with plenty of levels, hordes of enemies, huge bosses and engaging story for maximum replay value. Beautiful cartoon-like art style brings life to the characters and environments. Competitive online ranking system. [Capcom]… Expand"}, {"name": "Dynasty Warriors 5: Xtreme Legends", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-5-xtreme-legends", "publisher": "Koei", "release_date": "Nov 16 2005", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 57, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/743ec3f0e89070404c1ef4d703852607-98.jpg", "descriptions": "Series fans will enjoy an awesome collection of more than 18 untold stories in \"Legend Mode,\" an expanded \"Xtreme Mode\" for up to two players, and an \"Edit Mode\" with 20,000 possible character combinations. In the game's new \"Destiny Mode,\" players will begin as a foot soldier, and workSeries fans will enjoy an awesome collection of more than 18 untold stories in \"Legend Mode,\" an expanded \"Xtreme Mode\" for up to two players, and an \"Edit Mode\" with 20,000 possible character combinations. In the game's new \"Destiny Mode,\" players will begin as a foot soldier, and work their way up the ranks by completing a series of combat missions. Now, players will have a previously unheard of level of control over their character's destiny by choosing which officer they will serve and to which kingdom they will pledge allegiance. Additional features include two tough new \"Challenge\" courses, and the new \"Blacksmith\" system that allows players to upgrade their characters and weapons using special items. [KOEI]… Expand"}, {"name": "Neverland Card Battles", "details_link": "https://www.metacritic.com/game/psp/neverland-card-battles", "publisher": "Yuke's", "release_date": "Oct 27 2008", "developers": ["Idea Factory"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General", "Fantasy"], "meta_score": 57, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/5140798e89301e50f4fe996a645f6ff1-98.jpg", "descriptions": "The war between humans and demons is tearing Neverland apart, and the ensuing chaos threatens to free the evil god Hellgaia from his tomb. Now, the future rests solely in the hands of the Dominators, those who can wield the otherworldly power found within the land’s Spectral Cards. AsThe war between humans and demons is tearing Neverland apart, and the ensuing chaos threatens to free the evil god Hellgaia from his tomb. Now, the future rests solely in the hands of the Dominators, those who can wield the otherworldly power found within the land’s Spectral Cards. As Galahad, a young and brash Dominator, set forth on a quest to banish Hellgaia back to his shrine forever and save Neverland from judgment day. [Yuke's]… Expand"}, {"name": "Stronghold Legends", "details_link": "https://www.metacritic.com/game/pc/stronghold-legends", "publisher": "2K Games", "release_date": "Oct 23 2006", "developers": ["FireFly Studios"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 57, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/e886eb640d704730691bd3b5c10f705b-98.jpg", "descriptions": "Stronghold Legends is a dramatic addition to the series, combing a range of new gameplay innovations including a new strategic conquest style of play and exciting new multiplayer modes. Gamers can play as King Arthur and his Knights of the Round Table, Count Vlad Dracul or relive the heroicStronghold Legends is a dramatic addition to the series, combing a range of new gameplay innovations including a new strategic conquest style of play and exciting new multiplayer modes. Gamers can play as King Arthur and his Knights of the Round Table, Count Vlad Dracul or relive the heroic sagas of the mighty Siegfried of Germany in twenty-four missions that span across three unique campaigns. [2K Games]… Expand"}, {"name": "Warpath", "details_link": "https://www.metacritic.com/game/pc/warpath", "publisher": "Groove Games", "release_date": "Jul 18 2006", "developers": ["Digital Extremes"], "platforms": "PC", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/3197642f57f6ae7a01529309e20b0726-98.jpg", "descriptions": "Three distinct races have converged in a virtual Eden, in the outermost reaches of the galaxy, each with a unique reason for settling this new world. Conflict is inevitable, victory is not. WarPath is a fast-paced FPS game featuring a unique single player mode that allows gamers to battleThree distinct races have converged in a virtual Eden, in the outermost reaches of the galaxy, each with a unique reason for settling this new world. Conflict is inevitable, victory is not. WarPath is a fast-paced FPS game featuring a unique single player mode that allows gamers to battle for control of different territories, with each providing distinct strategic advantages. Once players have honed their skills in the single player missions, they can jump online and let the real action begin. 3 different races to choose from, each with their own unique weapon load-out and appearance. 4 land-based vehicles. 8 weapons, the Wolverine, Tyrant, Long Bow, Judge, Vanguard, Vibro Blade, and EMAC, allowing for a highly diversified range of play styles. Upgradeable weapons that unlock more functionality and greater destructive force with each new level. UNREAL engine and Karma physics technology providing stunning visuals and effects. In single player practice mode, gamers can go up against 32 bots for an adrenaline-filled multiplayer simulation. 4 Modes of high-speed, intensely addictive multiplayer action – Death Match, Team Death Match, Capture the Flag, and Frontline Assault. 25 Multiplayer levels that take players across the diverse indoor and outdoor environments of Kaladi. Support for 2-16 players via LAN or Online, allowing battles to be intimate grudge matches, or all out clan carnage. Access to all the weapons and upgrades that players unlocked and mastered in the single player campaign. [Groove Games]… Expand"}, {"name": "Black Mirror", "details_link": "https://www.metacritic.com/game/xbox-one/black-mirror", "publisher": "THQ Nordic", "release_date": "Nov 28 2017", "developers": ["THQ Nordic"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 57, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/8/cb5a231433c8046ebb0ce883fd6ec78c-98.jpg", "descriptions": "Scotland, 1926. Following the death of his father, David Gordon visits his ancestral home for the first time in his life. A life that is soon threatened by the dark secrets that claimed the sanity of many Gordons before him. Black Mirror Castle demands an offering."}, {"name": "Sumioni: Demon Arts", "details_link": "https://www.metacritic.com/game/playstation-vita/sumioni-demon-arts", "publisher": "XSEED Games", "release_date": "Mar 20 2012", "developers": ["Acquire"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 57, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/644b6f7f8ae8fd024428243964eb7922-98.jpg", "descriptions": "Sumioni: Demon Arts is set in a fantasy world where players guide an inked character through a colorful landscape portrayed in the classical Japanese \"sumi-e\" art style."}, {"name": "Prince of Persia: The Forgotten Sands", "details_link": "https://www.metacritic.com/game/ds/prince-of-persia-the-forgotten-sands", "publisher": "Ubisoft", "release_date": "May 18 2010", "developers": ["Ubisoft Casablanca"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 57, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/26efa5eab314df76e76350794f5b6ef0-98.jpg", "descriptions": "Prince of Persia: The Forgotten Sands is the next chapter in the Sands of Time universe. Visiting his brother's kingdom following his adventure in Azad, the Prince finds the royal palace under siege from a mighty army bent on its destruction. When the decision is made to use the ancientPrince of Persia: The Forgotten Sands is the next chapter in the Sands of Time universe. Visiting his brother's kingdom following his adventure in Azad, the Prince finds the royal palace under siege from a mighty army bent on its destruction. When the decision is made to use the ancient power of the Sand in a desperate gamble to save the kingdom from total annihilation, the Prince embarks on an epic adventure in which he learns to bear the mantle of true leadership, and discover that great power often comes with a great cost. [Ubisoft]… Expand"}, {"name": "Rocketmen: Axis of Evil", "details_link": "https://www.metacritic.com/game/playstation-3/rocketmen-axis-of-evil", "publisher": "SCEA", "release_date": "Mar  6 2008", "developers": ["A.C.R.O.N.Y.M. Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 57, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/c3f3374c67dc833edf29799f8d5066b8-98.jpg", "descriptions": "[Downloadable Game]  In this arcade shooter, players join the heroes of the Alliance of Free Planets in their white-knuckled, frenzied struggle to free the Solar System from the tyrannical grip of the Legion of Terra. Up to four players will be able to cooperatively shoot their way through[Downloadable Game]  In this arcade shooter, players join the heroes of the Alliance of Free Planets in their white-knuckled, frenzied struggle to free the Solar System from the tyrannical grip of the Legion of Terra. Up to four players will be able to cooperatively shoot their way through multiple levels, powering up their weapons, picking up bonuses and laying waste to anything that moves. Online multiplayer gameplay through a variety of mini games that let players instantly jump into existing games. Design and build your own character for both single and multi-player games, each with their own. Three races – Human, Mercurian or Venusian; Three classes – Fighter, Engineer, Outcast. Further character customization options through new items and abilities earned by progressing through a variety of quests. Multiple hours of gameplay with plenty of levels, hordes of enemies, huge bosses and engaging story for maximum replay value. Beautiful cartoon-like art style brings life to the characters and environments. Competitive online ranking system. [Capcom]… Expand"}, {"name": "Shrek the Third", "details_link": "https://www.metacritic.com/game/game-boy-advance/shrek-the-third", "publisher": "Activision", "release_date": "May 15 2007", "developers": ["Vicarious Visions"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 57, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/4418dcf9d999c58ee23180ab9bfd32c2-98.jpg", "descriptions": "Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies,Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies, and visit never before seen lands from the movie and beyond.… Expand"}, {"name": "Army Corps of Hell", "details_link": "https://www.metacritic.com/game/playstation-vita/army-corps-of-hell", "publisher": "Square Enix", "release_date": "Feb 21 2012", "developers": ["Entersphere", "Inc."], "platforms": "PlayStation Vita", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 57, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/14d3c8ecec79777434f2a2cf9b8c186d-98.jpg", "descriptions": "Army Corps of Hell brings vicious combat, dark humor and lightning-quick action to the PlayStation Vita. As the King of Hell you control an army of a hundred goblin soldiers with various classes and abilities to defeat a host of enemies in order to reclaim your throne. Take full advantage ofArmy Corps of Hell brings vicious combat, dark humor and lightning-quick action to the PlayStation Vita. As the King of Hell you control an army of a hundred goblin soldiers with various classes and abilities to defeat a host of enemies in order to reclaim your throne. Take full advantage of the unique control features of the PlayStation Vita to experience war like never before. [Sony]… Expand"}, {"name": "Spider-Man: Friend or Foe", "details_link": "https://www.metacritic.com/game/pc/spider-man-friend-or-foe", "publisher": "Activision", "release_date": "Oct  2 2007", "developers": ["Beenox"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "1-2 ", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 57, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/afd481c74c79648a054ba3f6a69b772d-98.jpg", "descriptions": "Spider-Man: Friend or Foe challenges players to defeat and then join forces with notorious movie nemeses including Doc Ock, Green Goblin, Venom and Sandman, and other classic Spider-Man characters. Players embark on a global quest to overcome an evil threat, by controlling Spider-Man and oneSpider-Man: Friend or Foe challenges players to defeat and then join forces with notorious movie nemeses including Doc Ock, Green Goblin, Venom and Sandman, and other classic Spider-Man characters. Players embark on a global quest to overcome an evil threat, by controlling Spider-Man and one of numerous Super Hero or Super Villain sidekicks, as they master unique fighting moves and styles while switching between characters to execute team combos and defeat foes. Spider-Man: Friend or Foe features a unique co-op mode in which a friend can join the game at any time and take control of Spidey’s sidekick as they battle through the game side-by-side and replay favorite levels. [Activision]… Expand"}, {"name": "Iro Hero", "details_link": "https://www.metacritic.com/game/switch/iro-hero", "publisher": "EastAsiaSoft", "release_date": "Jun  7 2018", "developers": ["Artax Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/401da037020273a812f647ec8309089e-98.jpg", "descriptions": "Iro Hero is a vertical shoot 'em up with beautiful pixel art graphics inspired by many old-school classics. Staged across 9 action-packed levels, Iro Hero features a unique and fresh approach to the popular color polarity mechanic, with interactive level elements, color zones, reflectiveIro Hero is a vertical shoot 'em up with beautiful pixel art graphics inspired by many old-school classics. Staged across 9 action-packed levels, Iro Hero features a unique and fresh approach to the popular color polarity mechanic, with interactive level elements, color zones, reflective surfaces and much more. Encounter 10 different types of enemies with over a hundred different behaviors, and defeat 10 final bosses in the vein of classic arcade games. Unlock special skills throughout the game to help you land a final blow or escape from desperate situations. … Expand"}, {"name": "Dead Island: Riptide", "details_link": "https://www.metacritic.com/game/xbox-360/dead-island-riptide", "publisher": "Deep Silver", "release_date": "Apr 23 2013", "developers": ["Techland"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/d0ec1ee27cdaaee23e75afd7c2f39a39-98.jpg", "descriptions": "Dead Island Riptide brings us to the island of Palanai on the Banoi archipelago, infested with bloodthirsty Zombies and only a few remaining Survivors still clinging to their lives. Introducing new terrifying enemies, deadly weapons, a new playable character, inter alia, Dead Island RiptideDead Island Riptide brings us to the island of Palanai on the Banoi archipelago, infested with bloodthirsty Zombies and only a few remaining Survivors still clinging to their lives. Introducing new terrifying enemies, deadly weapons, a new playable character, inter alia, Dead Island Riptide draws players back into a world that has grown corrupt - with the last vestiges of hope vanishing in rising tides.… Expand"}, {"name": "Eclipse: Edge of Light", "details_link": "https://www.metacritic.com/game/playstation-4/eclipse-edge-of-light", "publisher": "White Elk", "release_date": "Jan 14 2020", "developers": ["White Elk"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 57, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/9/82148aee90ee342a7eb18fdb5524cae3-98.jpg", "descriptions": "Crash-landed on a sentient planet, you awake to discover a dreamscape world, filled with alien wonder and the remains of a betrayed civilization. You find a powerful relic that can interact with ancient technology and grant you near-magical powers. Can you rise to the challenge and solve theCrash-landed on a sentient planet, you awake to discover a dreamscape world, filled with alien wonder and the remains of a betrayed civilization. You find a powerful relic that can interact with ancient technology and grant you near-magical powers. Can you rise to the challenge and solve the haunting riddle of this mysterious place?… Expand"}]