[{"name": "The Academy: The First Riddle", "details_link": "https://www.metacritic.com/game/pc/the-academy-the-first-riddle", "publisher": "Snapbreak Games AB", "release_date": "Jun 19 2020", "developers": ["Pine Studio"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/63a74b86ea8268310e33129accf180c7-98.jpg", "descriptions": "The Academy: The First Riddle is a puzzle-packed adventure set in a school filled with mystery. Leave your mark on Arbor's Academy and find out why it only welcomes the best and the brightest."}, {"name": "Warlander (2020)", "details_link": "https://www.metacritic.com/game/pc/warlander-2020", "publisher": "Clock Drive Games", "release_date": "Feb 26 2020", "developers": ["Clock Drive Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/cbe8b956af6e9b4f35c6cdbd66b5c992-98.jpg", "descriptions": "Would you sell your soul for vengeance? Would you be willing to become a servant of an immortal deity, to have your whole being transformed into a weapon of war and destruction?Immerse yourself in a Dark Souls meets Slay the Spire roguelike adventure. Play as a resurrected hero on the roadWould you sell your soul for vengeance? Would you be willing to become a servant of an immortal deity, to have your whole being transformed into a weapon of war and destruction?Immerse yourself in a Dark Souls meets Slay the Spire roguelike adventure. Play as a resurrected hero on the road of vengeance. Every path you explore in the procedurally generated world is different, full of dangers and opportunities alike. Aim precisely and slice through the flesh of your enemies in a unique take on stamina-based combat! Progress by becoming stronger and more skillful, either by chopping your way across the battlefield or by using abilities to turn the environment into a deadly weapon. Sacrifice enemies to appease the ancient god and get access to powers based on ancient druidic magic. If you die - you will be returned to life - at the cost of your progress and experience.You live to fight another day, over and over again so that eternally hungry deity may receive offerings in blood!… Expand"}, {"name": "Pillar", "details_link": "https://www.metacritic.com/game/playstation-4/pillar", "publisher": "MichaelArts", "release_date": "Feb 17 2015", "developers": ["MichaelArts"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 59, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/c682c6197089c5eb4421557629a96ff7-98.jpg", "descriptions": "Lost in an intimate snowy town, a palette of individuals are in search of a mysterious artifact said to bring great knowledge and understanding. Lead each character through their quest in this collection of minigames, each with unique personalities and challenges... maybe their paths aren'tLost in an intimate snowy town, a palette of individuals are in search of a mysterious artifact said to bring great knowledge and understanding. Lead each character through their quest in this collection of minigames, each with unique personalities and challenges... maybe their paths aren't so different after all.\r A Little Bit About Pillar:\r-A collection of minigames, each representing different personality traits (introversion, extroversion etc.) through gameplay mechanics.\r-Different people, different gameplay each part of the game will challenge you in a unique way.\r-Explore an intimate snowy town, beautifully hand-painted with attention to every detail.\r-A distinct soundtrack, composed hand-in-hand with the game's design, by the game's designer, to ensure a cohesive experience.… Expand"}, {"name": "Abyss", "details_link": "https://www.metacritic.com/game/wii-u/abyss", "publisher": "EnjoyUp Games", "release_date": "May  1 2014", "developers": ["EnjoyUp Games"], "platforms": ["PlayStation 5", "Switch", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/548c326b755bb5b0278d7831232166f9-98.jpg", "descriptions": "Explore the abyss!\r Earth, 3024.\r\n\r\nNatural resources are scarce and the survival of the human race is in danger. Desperate to find new energy resources, the ASAN creates a biomechanical robot called Nep2no that is capable of withstanding extreme depths in the hope of finding new energyExplore the abyss!\r Earth, 3024.\r Natural resources are scarce and the survival of the human race is in danger. Desperate to find new energy resources, the ASAN creates a biomechanical robot called Nep2no that is capable of withstanding extreme depths in the hope of finding new energy sources. After many years of exploration, a new energy source is found, code named \"Gaia\".\r Your mission will be to find the \"Gaia\" energy stones by exploring the depths. To do so, you must control Nep2no by counteracting gravity and the surrounding darkness with the aid of a Light that will go out little by little.… Expand"}, {"name": "Our World Is Ended.", "details_link": "https://www.metacritic.com/game/switch/our-world-is-ended", "publisher": "PQube", "release_date": "Apr 18 2019", "developers": ["RED Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/08be65b93827102e678c25aaf110916e-98.jpg", "descriptions": "A world between reality and fiction\r Explore a faithful recreation of Asakusa, one of Tokyo’s most iconic districts as elements from the game worlds will slowly manifest themselves and threaten to destroy the entire district itself..\r\n\r\nSplendid Artwork and Outstanding Visuals\r\n\r\nEnjoyA world between reality and fiction\r Explore a faithful recreation of Asakusa, one of Tokyo’s most iconic districts as elements from the game worlds will slowly manifest themselves and threaten to destroy the entire district itself..\r Splendid Artwork and Outstanding Visuals\r Enjoy stunning visuals and gorgeous CGs drawn in a distinctive and vibrant art style. The detailed environments bring Asakusa to life with a unique atmosphere.\r The interactive Selection Of Soul system\r When the main character, Reiji gets flustered, the S.O.S (Selection Of Soul) system will be triggered. His emotions will flow onto the screen before vanishing. Quickly react to these options and see how your choices will affect the dialogues.\r… Expand"}, {"name": "Skylar & Plux: Adventure on Clover Island", "details_link": "https://www.metacritic.com/game/playstation-4/skylar-plux-adventure-on-clover-island", "publisher": "Grip Games", "release_date": "May 19 2017", "developers": ["Grip Games", "Right Nice Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "3D"], "meta_score": 59, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/5826b88c9ce668c843c151cc9dd38237-98.jpg", "descriptions": "Skylar & Plux: Adventure on Clover Island sets two unlikely heroes on an adventure to prevent the villainous CRT from conquering their home and turning it into a wasteland."}, {"name": "Leisure Suit Larry: Magna Cum Laude", "details_link": "https://www.metacritic.com/game/pc/leisure-suit-larry-magna-cum-laude", "publisher": "VU Games", "release_date": "Oct  5 2004", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 59, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/4/89ee25c8377edff59c57ecf7c2910c82-98.jpg", "descriptions": "Larry Cum Laude! College is tough for Larry - between classes, fraternities, and odd jobs there's hardly time for parties and chasing girls. So when a dating show comes to campus, Larry knows that getting on TV is his best chance ever to lay more than groundwork. Can Larry get on TV, get theLarry Cum Laude! College is tough for Larry - between classes, fraternities, and odd jobs there's hardly time for parties and chasing girls. So when a dating show comes to campus, Larry knows that getting on TV is his best chance ever to lay more than groundwork. Can Larry get on TV, get the girl, and not flunk out of college? It's all up to you in Leisure Suit Larry: Magna Cum Laude! Magna Cum Laude brings back humor from the most respected funny brand on PC - Leisure Suit Larry. Updated for the 21st century with 3D graphics, engaging conversations, and a fully realized college campus, Larry is back to give gamers some loving. Coming to PC and consoles. [Vivendi Universal]… Expand"}, {"name": "Spirit of the North", "details_link": "https://www.metacritic.com/game/switch/spirit-of-the-north", "publisher": "Merge Games", "release_date": "May  7 2020", "developers": ["Infuse Studio"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/88e3c2ea9b8d3ed7d10f36843cd7b72a-98.jpg", "descriptions": "Spirit of the North is a single-player 3rd-person adventure game inspired by the breathtaking and mysterious landscapes of Iceland."}, {"name": "Dogfight 1942", "details_link": "https://www.metacritic.com/game/xbox-360/dogfight-1942", "publisher": "City Interactive", "release_date": "Sep  5 2012", "developers": ["City Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 59, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/8f9aebc2c4978b0cf2e1f2bb6f5469c2-98.jpg", "descriptions": "Previously announced as Combat Wings, Dogfight 1942 has been re-envisioned and recreated to feature more than 20 types of aircraft --from the fabled P-38 Lightning and Britain's Spitfire to the feared Messerschmitt 109 and Japanese Kate -- players are challenged with the same missions asPreviously announced as Combat Wings, Dogfight 1942 has been re-envisioned and recreated to feature more than 20 types of aircraft --from the fabled P-38 Lightning and Britain's Spitfire to the feared Messerschmitt 109 and Japanese Kate -- players are challenged with the same missions as real WWII pilots, ranging from bombing runs and dog fights to manning defensive positions such as a gunner on a bomber or anti-aircraft site.… Expand"}, {"name": "ColorZ", "details_link": "https://www.metacritic.com/game/wii/colorz", "publisher": "Exkee", "release_date": "Sep  7 2009", "developers": ["Exkee"], "platforms": "Wii", "num_players": "1-3 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/308bbb0bdb8576db5916970394cd752c-98.jpg", "descriptions": "[WiiWare]  With ColorZ, set forth in your spaceships on a mission to clean up virus-infested planets. Immerse yourself in a new gameplay experience that will reveal mind-hand-eye coordination skills you never knew you had! Absorb viruses of your own color, but steer clear of the others. If[WiiWare]  With ColorZ, set forth in your spaceships on a mission to clean up virus-infested planets. Immerse yourself in a new gameplay experience that will reveal mind-hand-eye coordination skills you never knew you had! Absorb viruses of your own color, but steer clear of the others. If you need to, you can cleverly merge your ships together to create new colors. Buzz past your enemies to keep your combo and clock up a new high-score record. Explore an extra dimension to the game with the multi-player mode and share the unique experience of cooperative play between friends. Pool your forces, synchronize your movements, and become a unified team (of up to 3 players) to meet the challenge together! [Exkee]… Expand"}, {"name": "Necromunda: Underhive Wars", "details_link": "https://www.metacritic.com/game/playstation-4/necromunda-underhive-wars", "publisher": "Focus Home Interactive", "release_date": "Sep  8 2020", "developers": ["Rogue Factor"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 59, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/3/8bc4cf3a986278301ce08b92d2d3cbfc-98.jpg", "descriptions": "Deep below the nightmarish, polluted hive cities of Necromunda, in the twisted, vertiginous, dark tunnels of the Underhive, rival gangs fight to the bitter end for personal power, wealth, survival and the honour of their Houses. Only the strongest survive. Lead, customize, and grow yourDeep below the nightmarish, polluted hive cities of Necromunda, in the twisted, vertiginous, dark tunnels of the Underhive, rival gangs fight to the bitter end for personal power, wealth, survival and the honour of their Houses. Only the strongest survive. Lead, customize, and grow your gangs of Escher, Goliath, and Orlock. Specialize each member and send them to battle in hazardous dystopian environments. Exploit the terrain in tactical gunfights: climb raised walkways to take advantage, set traps, and ambush foes to force them into bloody melee engagements. Learn new skills, loot equipment and bring your evolved gang to 4-player online gang fights.… Expand"}, {"name": "Dakar 18", "details_link": "https://www.metacritic.com/game/pc/dakar-18", "publisher": "Deep Silver", "release_date": "Sep 25 2018", "developers": ["Bigmoon Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/828ffdd3999faeb04c85f989d3f9eb73-98.jpg", "descriptions": "Dakar 18 is a simulation of the world-famous annual rally raid organized by Amaury Sport Organisation (A.S.O.) in South America, and features visuals and many vehicles including motorcycles, cars, trucks, quads and SxS."}, {"name": "Flash Focus: Vision Training in Minutes a Day", "details_link": "https://www.metacritic.com/game/ds/flash-focus-vision-training-in-minutes-a-day", "publisher": "Nintendo", "release_date": "Oct 15 2007", "developers": ["Nintendo", "Namco Bandai Games"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 59, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/8/ba94a9031286d334cef003ea1677011e-98.jpg", "descriptions": "(Also known as \"Sight Training: Enjoy Exercising and Relaxing Your Eyes\")  You've trained your brain with Brain Age--now sharpen your eye power with Flash Focus! Fast, fun activities and quick-play sports challenges give your eyes the challenging workout they need. The first time you play(Also known as \"Sight Training: Enjoy Exercising and Relaxing Your Eyes\")  You've trained your brain with Brain Age--now sharpen your eye power with Flash Focus! Fast, fun activities and quick-play sports challenges give your eyes the challenging workout they need. The first time you play Flash Focus, you'll complete a short series of activities to evaluate your Eye Age. Train every day to lower your Eye Age and challenge your Focus Ability in the five major categories: Hand-Eye Coordination, Peripheral Vision, Dynamic Visual Acuity, Momentary Vision, and Eye Movement. Flash Focus is designed to be played a little bit every day. Like the Brain Age games, it features a calendar that tracks the days you have completed your training by giving you stamps. By playing each day, you'll unlock more activities and sports-based tests. Each time you complete an activity, your results are added to line charts so you can easily follow your progress. [Nintendo]… Expand"}, {"name": "NBA 08", "details_link": "https://www.metacritic.com/game/playstation-2/nba-08", "publisher": "SCEA", "release_date": "Sep 26 2007", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 3", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/0b475f722e4d2374d029ae07eb586a34-98.jpg", "descriptions": "True NBA action once again returns to the courts with NBA 08 for the PlayStation 2. Featuring the third and final installment of \"The Life\" series, NBA 08 introduces \"The Life, Volume 3\", where players experience new challenges and storylines related to life in the league. In Vol. 3, NBA ’08True NBA action once again returns to the courts with NBA 08 for the PlayStation 2. Featuring the third and final installment of \"The Life\" series, NBA 08 introduces \"The Life, Volume 3\", where players experience new challenges and storylines related to life in the league. In Vol. 3, NBA ’08 focuses on Coach T.'s final season, the dynamic of team unity, and the journey to create a dynasty within the NBA. More than 60 different game scenarios are available in The Life, and players will have the opportunity to play each of the five starting positions, making The Life the most compelling addition to any NBA title to date. NBA 08 delivers all-new play-by-play commentary as well as improved artificial intelligence (A.I.), an updated user interface, and new on-court and crowd audio to enhance the overall gameplay experience. Returning features include the Smart Shot Indicator, to provide a visual gauge of defensive impact, and the Power Boarding System, an element that offers a 3D approach to position for rebounds. Additionally, \"Showtime Gameplay\" is back, providing players the opportunity to manage and balance a variety of game time elements including temperamental crowds, eager teammates, and individual basketball skills. [SCEA]… Expand"}, {"name": "Way of the Samurai 2", "details_link": "https://www.metacritic.com/game/playstation-2/way-of-the-samurai-2", "publisher": "Capcom", "release_date": "Jul  7 2004", "developers": ["Acquire"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 59, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/e0eba33055b3ab437a709eb8ff97cf56-98.jpg", "descriptions": "A peacful town finds itself victim to extreme violence and unrest. Gangs are spreading fear and tyranny among the townspeople, while the government is supressing justice with a brutal hand. A Lone warrior arrives with the ability to change the town's destiny. Experience life as a Samurai inA peacful town finds itself victim to extreme violence and unrest. Gangs are spreading fear and tyranny among the townspeople, while the government is supressing justice with a brutal hand. A Lone warrior arrives with the ability to change the town's destiny. Experience life as a Samurai in feudal Japan and battle to save the town of Amahara. Features multiple endings based on players decisions - help free the innocent or join the corrupt. Experience traditional Samurai techniques with realistic sword fighting - acrobatic ninja style, quick slash, twin swords and more... More than 60 swords to battle with - find famous and powerful swords among the townspeople. Tons of special moves to take over your enemy. [Capcom]… Expand"}, {"name": "Mortal Kombat Arcade Kollection", "details_link": "https://www.metacritic.com/game/playstation-3/mortal-kombat-arcade-kollection", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Aug 30 2011", "developers": ["Other Ocean Interactive", "NetherRealm Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Fighting", "Compilation", "2D"], "meta_score": 59, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/c8a3273725b6748d3dbcf47503eb7605-98.jpg", "descriptions": "Mortal Kombat Arcade Kollection will offer fans the chance to play through the games in their original arcade state and rediscover all their favorite characters, fatalities and environments as well as relive some of the franchise’s most memorable secrets.  In addition, this new collectionMortal Kombat Arcade Kollection will offer fans the chance to play through the games in their original arcade state and rediscover all their favorite characters, fatalities and environments as well as relive some of the franchise’s most memorable secrets.  In addition, this new collection will feature online play, leaderboards, achievements and trophies.… Expand"}, {"name": "Fist of the North Star: Ken's Rage", "details_link": "https://www.metacritic.com/game/xbox-360/fist-of-the-north-star-kens-rage", "publisher": "Koei Tecmo Games", "release_date": "Nov  2 2010", "developers": ["Koei"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/834e407e337631bab01203fdda40aaaf-98.jpg", "descriptions": "A ravaged Earth struggles to survive after a nuclear holocaust has left the world in ruins. Survivors band together in communities and villages, living off what little resources remain. In the wastelands beyond, vicious gangs prey on the survivors for their resources, or sometimes merely forA ravaged Earth struggles to survive after a nuclear holocaust has left the world in ruins. Survivors band together in communities and villages, living off what little resources remain. In the wastelands beyond, vicious gangs prey on the survivors for their resources, or sometimes merely for sport.\r A mysterious martial artist named Ken, a man with seven scars on his chest and the chosen successor of the legendary assassin's art Hokuto Shinken (The Divine Fist of the North Star) has sworn to protect the weak and innocent from the malicious gangs roaming the scorched planet.… Expand"}, {"name": "Disney's TRON: Evolution - Battle Grids", "details_link": "https://www.metacritic.com/game/wii/disneys-tron-evolution---battle-grids", "publisher": "Disney Interactive Studios", "release_date": "Dec  7 2010", "developers": ["n-Space"], "platforms": "Wii", "genres": ["Action", "Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 59, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/9c1fe3f594e2f91edc9dfd3ec1528135-98.jpg", "descriptions": "TRON: Evolution - Battle Grids for the Nintendo Wii is an action-packed multiplayer game set around the Game Grids of the TRON universe. Developed in a unique partnership with Propaganda Games, Battle Grids features more than 15 Game Grid challenges with iconic TRON weapons and vehicles suchTRON: Evolution - Battle Grids for the Nintendo Wii is an action-packed multiplayer game set around the Game Grids of the TRON universe. Developed in a unique partnership with Propaganda Games, Battle Grids features more than 15 Game Grid challenges with iconic TRON weapons and vehicles such as light cycles, light runners and light discs, with players competing with family and friends in local games for 1 to 4 players. Battle Grids also features an extensive story mode that allows users to create and evolve their own character in the quest to become the Game Grids Champion.… Expand"}, {"name": "The Chase: Felix Meets Felicity", "details_link": "https://www.metacritic.com/game/ds/the-chase-felix-meets-felicity", "publisher": "Atari", "release_date": "Jan 27 2009", "developers": ["Razorback Developments"], "platforms": "DS", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/e56e3a67a93775e7866a12f4728cfd17-98.jpg", "descriptions": "Join in the adrenaline rush by jumping in the shoes of Felix or Felicity to race across town in time to rendezvous. To make it unscathed, players need to deftly navigate a series of obstacle-laden environments without ever letting up the break-neck pace. Run, jump, dodge and slide throughJoin in the adrenaline rush by jumping in the shoes of Felix or Felicity to race across town in time to rendezvous. To make it unscathed, players need to deftly navigate a series of obstacle-laden environments without ever letting up the break-neck pace. Run, jump, dodge and slide through hectic scenarios while desperately trying to stay ahead of the clock and weather. The pick-up-and-play gameplay makes ingenious use of the Nintendo DS stylus to draw platforms to climb and hop across, dodging difficult barriers and any cold-hearted misanthropes who get in the way. Along the way our protagonists will draw, climb and jump their way through the city, zoo, carnival, park and beach, with each vibrant area packed with opportunities to impress your sweatheart by bowling over bad guys and collecting fruit and stars. Felix and Felicity will have no shortage of help in their date-race against the clock with sage love advice from worldly-wise characters you meet along the way and in-game power-ups including Time-Freeze, Love-Rush, Newton-Bomb and the explosive Love-Nuke. Let nothing stand in the way of true love. [Atari]… Expand"}, {"name": "Cuban Missile Crisis: The Aftermath", "details_link": "https://www.metacritic.com/game/pc/cuban-missile-crisis-the-aftermath", "publisher": "Strategy First", "release_date": "Dec 22 2005", "developers": ["G5 Software"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "General", "Historic", "Historic"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/1b8bb8e9d301c05a63bdbb373c5d0876-98.jpg", "descriptions": "Cuban Missile Crisis: The Aftermath thrusts players into a world ravaged by the military-political confrontation between the USA and USSR in 1962. The game offers a different interpretation of the events that followed the famous global standoff over the small island nation. In Cuban MissileCuban Missile Crisis: The Aftermath thrusts players into a world ravaged by the military-political confrontation between the USA and USSR in 1962. The game offers a different interpretation of the events that followed the famous global standoff over the small island nation. In Cuban Missile Crisis: The Aftermath, the two cold-war powerhouse nations unleash their nuclear arsenal on the world, leveling Cuba and turning it, along with the majority of the world, into a radioactive desert. The remaining world citizens thus find themselves in a war fighting for their very survival... Cuban Missile Crisis: The Aftermath is a real-time strategy game combined with a turn-based global strategy mode, forcing players to use tactical troop movements while managing their resources and armies. With all the gameplay one has come to expect from the Blitzkrieg engine, gamers’ that enjoyed such games as \"Sudden Strike\" and \"Blitzkrieg\" are going to jump right into this title. In Cuban Missile Crisis: The Aftermath,”not only will players’ be able to enjoy all their familiar tactics, they will be introduced to way more metal as they field post WWII armaments and weapons of mass destruction! [Strategy First]… Expand"}, {"name": "Disney Epic Mickey 2: The Power of Two", "details_link": "https://www.metacritic.com/game/xbox-360/disney-epic-mickey-2-the-power-of-two", "publisher": "Disney Interactive Studios", "release_date": "Nov 18 2012", "developers": ["Blitz Games Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 59, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/2df1b0371b0f17db2316698906bd0dbc-98.jpg", "descriptions": "In Disney Epic Mickey 2: The Power of Two, gamers play as Mickey Mouse & Oswald the Lucky Rabbit, Disney's first cartoon celebrity, in an all-new co-op adventure to save the magical world of Wasteland and alter it forever. Interact with these characters like never before in this heroic adventure."}, {"name": "Asterix & Obelix XXL 3: The Crystal Menhir", "details_link": "https://www.metacritic.com/game/playstation-4/asterix-obelix-xxl-3-the-crystal-menhir", "publisher": "Microids", "release_date": "Nov 28 2019", "developers": ["Anuman Interactive", "OSome Studio"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Linear", "3D"], "meta_score": 59, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/63696a8ff140fee8767a8fa86991c4b9-98.jpg", "descriptions": "The year is 50 B.C. Gaul is entirely occupied by the Romans. Well, not entirely... One small village of indomitable Gauls still holds out against the invaders. And life is not easy for the Roman legionaries who garrison the fortified camps of Totorum, Aquarium, Laudanum and Compendium.The year is 50 B.C. Gaul is entirely occupied by the Romans. Well, not entirely... One small village of indomitable Gauls still holds out against the invaders. And life is not easy for the Roman legionaries who garrison the fortified camps of Totorum, Aquarium, Laudanum and Compendium.Peace reigns in the small Armorican village, where the villagers go about their daily business. Our two heroes, Asterix and Obelix, hunt wild boar, the blacksmith and the fishmonger quarrel, and the village chief strolls around the village square atop his shield.One day, the village druid, Getafix, receives a strange letter. It is from Avina Gandir, the high priestess of Thule! She warns the druid of a grave threat to his people and asks him to take a mysterious Menhir out of its hiding place...Set off on an exciting adventure and immerse yourself in the world of Asterix! Alone or in co-op, explore the lands of the Roman empire and unravel the mystery of the Crystal Menhir and its incredible powers!… Expand"}, {"name": "The Inpatient", "details_link": "https://www.metacritic.com/game/playstation-4/the-inpatient", "publisher": "Sony Interactive Entertainment", "release_date": "Jan 23 2018", "developers": ["Supermassive Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/74c4d7129d779040273be4118bac874e-98.jpg", "descriptions": "Discover who you are before it’s too late in The Inpatient; a PS VR Exclusive set in the Blackwood Sanatorium, over 60 years prior to the 2016 BAFTA award-winning Until Dawn. With deep immersion that places YOU in the game, you take on the role of an amnesiac inpatient who must find out whoDiscover who you are before it’s too late in The Inpatient; a PS VR Exclusive set in the Blackwood Sanatorium, over 60 years prior to the 2016 BAFTA award-winning Until Dawn. With deep immersion that places YOU in the game, you take on the role of an amnesiac inpatient who must find out who you are and why you are in the Sanatorium. With a branching narrative, and different endings; every choice you make can drastically affect the way the game plays out.\r… Expand"}, {"name": "Crystal Key 2: The Far Realm", "details_link": "https://www.metacritic.com/game/pc/crystal-key-2-the-far-realm", "publisher": "DreamCatcher Interactive", "release_date": "Mar 19 2004", "developers": ["Earthlight Productions"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/8c100d1e21d6c272d65939c8584ca060-98.jpg", "descriptions": "(Known as \"Evany: Key to a Distant Land\" in the UK)  A malevolent power has stolen control of all the souls of Evany, and you alone have survived. With the help of a star portal left behind by a mysterious visitor, you escape your imprisoned planet and find yourself alone in a vast galaxy of(Known as \"Evany: Key to a Distant Land\" in the UK)  A malevolent power has stolen control of all the souls of Evany, and you alone have survived. With the help of a star portal left behind by a mysterious visitor, you escape your imprisoned planet and find yourself alone in a vast galaxy of unknown worlds, desperate to find help for your beleaguered home. Journey to an island of robots, a mysterious abandoned desert dwelling, and the sparkling glass towers of the Merari, an ancient sea people who are involved in the resistance against the Balial, to solve the mystery behind The Far Realm. [DreamCatcher Interactive]… Expand"}, {"name": "WarJetz", "details_link": "https://www.metacritic.com/game/playstation-2/warjetz", "publisher": "3DO", "release_date": "Jun 27 2001", "developers": ["3DO"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/b952e2449abb601c55d2a0e32d2d934b-98.jpg", "descriptions": "Welcome to Wednesday Night WarJetz, the year 2062's favorite post-nuclear war, televised aerial dogfighting extravaganza featuring fanatical pilots in nine different souped-up, artillery laden planes in 33 arenas which blast the living hell out of anything that moves, earning money en routeWelcome to Wednesday Night WarJetz, the year 2062's favorite post-nuclear war, televised aerial dogfighting extravaganza featuring fanatical pilots in nine different souped-up, artillery laden planes in 33 arenas which blast the living hell out of anything that moves, earning money en route to the WDL championship.… Expand"}, {"name": "KISS: Psycho Circus", "details_link": "https://www.metacritic.com/game/dreamcast/kiss-psycho-circus", "publisher": "Gathering", "release_date": "Oct 29 2000", "developers": ["Tremor Entertainment"], "platforms": "Dreamcast", "genres": ["Action", "General"], "meta_score": 59, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/958fe0e0f5734e50badb670c3f17f3a6-98.jpg", "descriptions": "Instead of fixing any of Psycho Circus' problems, or adding some Dreamcast-only levels, the programmers at Tremor have actually removed some key features of the PC version."}, {"name": "Evergrace", "details_link": "https://www.metacritic.com/game/playstation-2/evergrace", "publisher": "Agetec Inc.", "release_date": "Oct 24 2000", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/72f34bc4e6723f651e785f28dbcf1d56-98.jpg", "descriptions": "Enter a world of intense magic and thunderous battles - where your survival is determined on collecting powerful artifacts and fashioning them to your armour and weaponry. Two complete adventures await Darius and Sharline - heroes who must face an evil reborn. Begin your journey as eitherEnter a world of intense magic and thunderous battles - where your survival is determined on collecting powerful artifacts and fashioning them to your armour and weaponry. Two complete adventures await Darius and Sharline - heroes who must face an evil reborn. Begin your journey as either hero and discover unique characters and monsters for each adventurer. Master the art of arming yourself with items of incredible might and untold magical abilities to thwart the powers of darkness that have swept into your once peaceful land. … Expand"}, {"name": "AeternoBlade", "details_link": "https://www.metacritic.com/game/3ds/aeternoblade", "publisher": "Corecell Technology", "release_date": "Feb 18 2014", "developers": ["Corecell Technology"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "3DS"], "genres": ["Action", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/fd726b4193c692766a138516c8f6d8e0-98.jpg", "descriptions": "In the region of Awelsia, vengeful Freya travels with an unknown weapon called \"AeternoBlade\" to take revenge from Beladim, the Lord of the Mist who destroyed her village, Ridgerode, and killed her tribe. Her vengence is helped by Vernia , who has as much merit as Beladim. VerniaIn the region of Awelsia, vengeful Freya travels with an unknown weapon called \"AeternoBlade\" to take revenge from Beladim, the Lord of the Mist who destroyed her village, Ridgerode, and killed her tribe. Her vengence is helped by Vernia , who has as much merit as Beladim. Vernia taught Freya about the ablility of AeternoBlade.\r Freya has to venture in many world dimensions to find how to annihilate Beladim.\r What is AeternoBlade? and How can Freya take revenge from Beladim ? Solve tons ton of mysteries in her adventure!… Expand"}, {"name": "Playboy: The Mansion", "details_link": "https://www.metacritic.com/game/playstation-2/playboy-the-mansion", "publisher": "Arush Entertainment", "release_date": "Jan 25 2005", "developers": ["Cyberlore Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Strategy", "Tycoon"], "meta_score": 59, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/b385819fb4aba18a1c1568fceaee55b1-98.jpg", "descriptions": "Be Heff!  Playboy: The Mansion blends state-of-the-art social simulation with traditional role-playing and empire-building gameplay. As Hugh Hefner, you build the Playboy mansion and magazine into a dynamic cultural icon and powerful brand. Rub shoulders with stunning women and stimulatingBe Heff!  Playboy: The Mansion blends state-of-the-art social simulation with traditional role-playing and empire-building gameplay. As Hugh Hefner, you build the Playboy mansion and magazine into a dynamic cultural icon and powerful brand. Rub shoulders with stunning women and stimulating celebrities as you pursue the ultimate Playboy lifestyle. Grow famous and gain exclusive access to the Playboy Archives, including footage of the world-famous Playboy Mansion. This is the ultimate lifestyle game, allowing the gamer to \"Play Hef\" and live the good life.  The player is in charge of running the Playboy Empire and must put out a magazine each month. In order to generate content for the magazine, the Virtual Hef will throw incredible parties with celebrities and rockstars in tow.  The social management of the parties will enable the player to acquire content for the magazine, including the unique, sexy Photo Shoot feature which the gamer will use to get his or her cover shot.  With a broad depth of gameplay, and a simulation experience of the ultimate lifestyle, PTM lets a gamer Play Hef, build the dream and live the good life. [ARUSH]… Expand"}, {"name": "Murdered: Soul Suspect", "details_link": "https://www.metacritic.com/game/pc/murdered-soul-suspect", "publisher": "Square Enix", "release_date": "Jun  3 2014", "developers": ["Airtight Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Action Adventure", "General", "Horror", "Survival"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/116ab5b15baba40425fd757595732d69-98.jpg", "descriptions": "Detective Ronan O'Connor's life is brought to an end when a brutal killer confronts him during a burglary. This detective with a checked past now finds himself trapped in the afterlife, his only escape from this nether world of \"Dusk\" is to bring the truth of his death and his killer toDetective Ronan O'Connor's life is brought to an end when a brutal killer confronts him during a burglary. This detective with a checked past now finds himself trapped in the afterlife, his only escape from this nether world of \"Dusk\" is to bring the truth of his death and his killer to light using his newly developed supernatural abilities. As Ronan, you can explore the town of Salem for clues, battle demon spirits to save your soul, and unearth revelations about who is responsible for your untimely death.… Expand"}, {"name": "Victorious Boxers: Revolution", "details_link": "https://www.metacritic.com/game/wii/victorious-boxers-revolution", "publisher": "XSEED Games", "release_date": "Oct 23 2007", "developers": ["Cavia Inc.", "Grandprix Inc."], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 59, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/403da70d4727ce55f28ce0a636964ad1-98.jpg", "descriptions": "(Also known as \"Victorious Boxers Challenge\")  A boxing game with realistic boxing action and intuitive controls, Victorious Boxers: Revolution takes full advantage of the unique capabilities of the Wii Remote and Nunchuk to give players an authentic, real-life boxing experience. The various(Also known as \"Victorious Boxers Challenge\")  A boxing game with realistic boxing action and intuitive controls, Victorious Boxers: Revolution takes full advantage of the unique capabilities of the Wii Remote and Nunchuk to give players an authentic, real-life boxing experience. The various moves include punches like jabs, straights, uppercuts and hooks, as well as defensive maneuvers like ducks and sways. Players can enjoy several rounds with their friends or play through the deep and compelling Story Mode as they follow the story of Ippo Makunouchi, a high school student who is bullied by his classmates, as he rises to the top of the professional boxing ranks. Various control schemes allow eager players to punch and weave with their body to make the action appear onscreen for the full boxing experience, as well as less strenuous options and even Classic Controller compatibility. The viewpoint is positioned right behind the player's transparent fighter to further enhance the feeling of being right there in the heat of battle. [XSeed]… Expand"}, {"name": "Crysis Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/crysis-remastered", "publisher": "Crytek", "release_date": "Sep 18 2020", "developers": ["Saber Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 59, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/2/dcf8e6c989e4e087c61671170a4a9a2d-98.jpg", "descriptions": "The classic first person shooter from Crytek is back with the action-packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. \r\rWhat begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a North Korean islandThe classic first person shooter from Crytek is back with the action-packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. \r\rWhat begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a North Korean island chain. Armed with a powerful Nanosuit, players can become invisible to stalk enemy patrols, or boost strength to lay waste to vehicles. The Nanosuit's speed, strength, armor, and cloaking allow creative solutions for every kind of fight, while a huge arsenal of modular weaponry provides unprecedented control over play style. In the ever-changing environment, adapt tactics and gear to dominate your enemies, in an enormous sandbox world. \r\rSuit up: Your Nanosuit's speed, strength, armor, and cloaking allow creative solutions for every kind of fight.\r Adapt: In an ever-changing environment, adapt your tactics to dominate on battlefields ranging from frozen jungle to alien environments.\r Customize: A huge arsenal of modular weaponry provides unprecedented control over play style, with options ranging from the experimental to the alien.\r Conquer: Life-like enemy AI require a strategic and flexible playstyle, as new challenges including a zero-g battlefield require players to take the offensive and be proactive.\r Explore: Choose your own path through the open world of Crysis, destroying obstacles, driving vehicles, and using the environment itself against your enemies.… Expand"}, {"name": "The Bunker", "details_link": "https://www.metacritic.com/game/xbox-one/the-bunker", "publisher": "Wales Interactive", "release_date": "Sep 23 2016", "developers": ["Splendy Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 59, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/3b5a4956c6c7cc1cbaff19da8d8d2ad4-98.jpg", "descriptions": "As the last remaining survivor in a nuclear bunker, Johns daily routine is the one thing that keeps him sane. But when an alarm goes off, his mind starts to self-destruct. The Bunker is a live-action psychological horror game starring Adam Brown (The Hobbit) and Sarah Greene (Penny Dreadful)As the last remaining survivor in a nuclear bunker, Johns daily routine is the one thing that keeps him sane. But when an alarm goes off, his mind starts to self-destruct. The Bunker is a live-action psychological horror game starring Adam Brown (The Hobbit) and Sarah Greene (Penny Dreadful) with writing talent behind The Witcher, Broken Sword and SOMA.… Expand"}, {"name": "Disaster Report 4: Summer Memories", "details_link": "https://www.metacritic.com/game/switch/disaster-report-4-summer-memories", "publisher": "NIS America", "release_date": "Apr  7 2020", "developers": ["Irem"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 59, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/5e1c78605a0c72ae040a04704a6719f9-98.jpg", "descriptions": "Through the game, players can experience the fear brought on by an earthquake, and can learn that wisdom, bravery and people's bonding through mutual assistance are necessary for survival. Can players escape from the disaster?"}, {"name": "SG/ZH: School Girl Zombie Hunter", "details_link": "https://www.metacritic.com/game/playstation-4/sgzh-school-girl-zombie-hunter", "publisher": "Aksys Games", "release_date": "Nov 17 2017", "developers": ["Tamsoft"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 5 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/7807f34db8c149a6d217a8713c63d3b9-98.jpg", "descriptions": "Set in the Onechanbara universe and taking place at the prestigious Kirisaku High School (known for its balanced curriculum of sports and academics), this is a story of survival: five students cut off from the outside world and surrounded by a seemingly endless flood of zombie hordes."}, {"name": "Mount & Blade: Warband", "details_link": "https://www.metacritic.com/game/xbox-one/mount-blade-warband", "publisher": "Taleworlds Entertainment", "release_date": "Sep 16 2016", "developers": ["Taleworlds Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 32 ", "genres": ["Role-Playing", "Western-Style"], "meta_score": 59, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/3af22aff89d707f3cd27cf9b71423c49-98.jpg", "descriptions": "The first expansion pack for Mount & Blade introduces an array of brand-new features, highlighted by a multiplayer capability that allows up to 32 players to battle it out in team-deathmatch-style combat on a single map."}, {"name": "MX vs. ATV Untamed", "details_link": "https://www.metacritic.com/game/psp/mx-vs-atv-untamed", "publisher": "THQ", "release_date": "Dec 17 2007", "developers": ["Rainbow Studios", "Tantalus"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "4  Online", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 59, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/da6d8347d823b046c603e04561449d4e-98.jpg", "descriptions": "MX vs ATV kicks it up a notch and shifts into high gear as the best selling offroad franchise returns to the PSP. MX vs ATV’s legendary Rhythm Racing lets players pre-load into massive jumps and clutch through hairpin turns at full speed all while retaining the smooth and authentic feel notMX vs ATV kicks it up a notch and shifts into high gear as the best selling offroad franchise returns to the PSP. MX vs ATV’s legendary Rhythm Racing lets players pre-load into massive jumps and clutch through hairpin turns at full speed all while retaining the smooth and authentic feel not found in any other game. Attempt to own the offroad by dominating the MX vs ATV World Tour. The MX vs ATV World Tour brings together 8 unique racing series like Stunt Race, Hang-Time and Combo Challenges on the trail to offroad superiority. Brand new styles of racing are born as powerful vehicles tear through treacherous trails in the new Flag Challenge and Time Attack event modes. Players can take control of seven different vehicle types, including Monster and Trophy Trucks, as they blitz through lush terrains and blaze through desert dunes in one of 8 massive, open worlds. The competition stiffens in freestyle challenges with stunt extenders and over 15 airborne and ground stunts. Be the last vehicle standing as 4 players compete over WiFi online. [THQ]… Expand"}, {"name": "Guitar Hero: Van Halen", "details_link": "https://www.metacritic.com/game/playstation-3/guitar-hero-van-halen", "publisher": "Activision", "release_date": "Dec 22 2009", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 59, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/f7aa05347256e462388f20a5236ab1cd-98.jpg", "descriptions": "Guitar Hero returns with another band-focused title, Guitar Hero: Van Halen. The game features 25 classic Van Halen tracks, three signature Eddie Van Halen guitar solos, and 19 hand-picked guest acts. Play in eight original venues specifically designed for Guitar Hero: Van Halen. Rock aroundGuitar Hero returns with another band-focused title, Guitar Hero: Van Halen. The game features 25 classic Van Halen tracks, three signature Eddie Van Halen guitar solos, and 19 hand-picked guest acts. Play in eight original venues specifically designed for Guitar Hero: Van Halen. Rock around the globe, from a small club in Los Angeles to arenas around the world, including the iconic \"S-stage\" from the Rock and Roll Hall of Famer’s 2007 world tour. Play as one of the four members of Van Halen or create your own personalized superstar with Rock Star Creator and watch your superstar party on stage. Rock out with up to four players locally or battle other bands with up to 8 players. With tracks ranging from the high-energy \"Jump\" to the legendary guitar solo \"Eruption,\" the easy to play, difficult to master game play that Guitar Hero fans have grown to love is back in Guitar Hero: Van Halen. [Activision]… Expand"}, {"name": "Dying Light 2 Stay Human: Bloody Ties", "details_link": "https://www.metacritic.com/game/pc/dying-light-2-stay-human-bloody-ties", "publisher": "Techland", "release_date": "Nov 10 2022", "developers": ["Techland"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/36a9ab9df7a4ce0bb5490b7b42fa1d97-98.jpg", "descriptions": "The Nightrunners were a sign of better things to come. Unfortunately, all good things eventually come to an end, but for you, this is only the beginning. Get ready for the release of Chapter 1: In the Footsteps of a Nightrunner, the biggest free content update since the release. Get readyThe Nightrunners were a sign of better things to come. Unfortunately, all good things eventually come to an end, but for you, this is only the beginning. Get ready for the release of Chapter 1: In the Footsteps of a Nightrunner, the biggest free content update since the release. Get ready to meet Harper, a Nightrunner of old. Help him in his efforts to combat the Special Infected that are endangering the people of Villedor.… Expand"}, {"name": "Clid the Snail", "details_link": "https://www.metacritic.com/game/playstation-4/clid-the-snail", "publisher": "Weird Beluga", "release_date": "Aug 31 2021", "developers": ["Weird Beluga"], "platforms": ["PC", "PlayStation 5", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/98a7acd4786eb4ce406a84e1977e06dc-98.jpg", "descriptions": "Clid The Snail is an innovative top-down shooter with a narrative focus and a methodical, mindful approach to combat. Players will join the troublesome snail Clid and help him and a peculiar gang of outcasts defeat the slug plague that is ravaging their world. In addition to a delightfullyClid The Snail is an innovative top-down shooter with a narrative focus and a methodical, mindful approach to combat. Players will join the troublesome snail Clid and help him and a peculiar gang of outcasts defeat the slug plague that is ravaging their world. In addition to a delightfully grim environment ready to be explored, players will experience a vast array of weapons, mechanics, and puzzles that will encourage creative and strategic gunplay.… Expand"}, {"name": "Lost Ruins", "details_link": "https://www.metacritic.com/game/pc/lost-ruins", "publisher": "DANGEN Entertainment", "release_date": "May 13 2021", "developers": ["Altari Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Survival", "Metroidvania"], "meta_score": 59, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/3c2bc84ac93ab9943d8dac51a13960db-98.jpg", "descriptions": "Lost Ruins is a 2D side-scrolling survival action game, where you play as a young girl that has awoken in a strange and foreign place without her memories. Explore a dark and dangerous world, battle hideous monsters, and topple incredible bosses."}, {"name": "Space Crew", "details_link": "https://www.metacritic.com/game/pc/space-crew", "publisher": "Curve Digital", "release_date": "Oct 15 2020", "developers": ["Runner Duck"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Space", "Combat"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/8a540ef52112e3e84a0662c76cd4eb1b-98.jpg", "descriptions": "Space Crew is the brand new sequel to strategic survival simulation game Bomber Crew. Captain's Log, Star Date 2152. This is Space Crew. Its continuing mission: To defend Earth and humankind, to eliminate the extraterrestrial threat and to boldly go where no Crew has gone before."}, {"name": "Warlocks 2: God Slayers", "details_link": "https://www.metacritic.com/game/switch/warlocks-2-god-slayers", "publisher": "Fat Dog Games", "release_date": "Jun  7 2019", "developers": ["Frozen District"], "platforms": ["PC", "Switch"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/07e9f1e8a08fac99d88081411a340503-98.jpg", "descriptions": "Warlocks 2: God Slayers is a humorous action RPG game with online and local co-op up to 4 players. Challenge the vile gods and dethrone them in this action-packed hack n' slash experience with wizards and meteor showers.God Slayers is a brand new story, where our titled Warlocks now needWarlocks 2: God Slayers is a humorous action RPG game with online and local co-op up to 4 players. Challenge the vile gods and dethrone them in this action-packed hack n' slash experience with wizards and meteor showers.God Slayers is a brand new story, where our titled Warlocks now need to face the gods themselves, as apparently perishing the shadow monsters have angered them, to say the least. The Order of Warlocks has been called to challenge and dethrone the arrogant god from their thrones.… Expand"}, {"name": "I Am Bread", "details_link": "https://www.metacritic.com/game/xbox-one/i-am-bread", "publisher": "Bossa Studios", "release_date": "Jan 20 2017", "developers": ["Bossa Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Miscellaneous", "General", "Platformer", "3D"], "meta_score": 59, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/3/fdd453030b1db1baae98469cd7dd717e-98.jpg", "descriptions": "I am Bread is the epic story of a slice of breads journey to become toast. From the creators of Surgeon Simulator comes an adventure with a hero like no other. I am Bread is the epic story of a slice of breads journey to become toast. Take the intrepid, crumby adventurer on a journey fromI am Bread is the epic story of a slice of breads journey to become toast. From the creators of Surgeon Simulator comes an adventure with a hero like no other. I am Bread is the epic story of a slice of breads journey to become toast. Take the intrepid, crumby adventurer on a journey from his natural confines of the kitchen, through the home of an unsuspecting owner and into the outside world. This bread will be boldly going where no other bread has gone before . . .\r In addition to the deepest story ever seen in a videogame, about a slice of bread, there are a wealth of baked options to sink your teeth into. Additional game modes and other types of bread will cater for all tastes! Set speed records racing across the levels as a bagel; realise your destiny as crispbread in cheese hunt mode; relieve your stress as the baguette and smash everything in sight in rampage mode. Oh, and did we mention bread goes into space too?\r Embark on an epic journey to become toast! Take on all hazards to deliciousness as you embark on your adventure throughout the home of Bob. the unsuspecting owner: from the kitchen, through the house, to the lounge, and then venture outside into the garden and beyond. Is Bob going mad, or has a slice of bread really come to life?  You may even have met Bob before, he's the passive patient from Surgeon Simulator and this explores the story of his downfall that leads him to the operating table . . .\r Cheese Hunt: Realise the destiny of crisp-bread as you hunt down pieces of cheese to smother yourself in. Can you find all the pieces before you crack up? \r\rBagel Race: Satisfy your taste for speed and bagels as you race across the checkpoints in each level and complete the tracks in the fastest possible time. \r\rRampage: Cause as much destruction as possible throughout the house as you smash everything in sight as (possibly) angry baguette. Mon dieu!\r Zero-G: Literally bread in space! Make studious use of your bread boosters as you manoeuvre across environments with no gravity, avoiding all the floating hazards this entails in Zero-G mode. \r\rFree-play: Explore the world and play as any of the bread types you have unlocked, having crumby fun in your own sweet time.… Expand"}, {"name": "Rack N Ruin", "details_link": "https://www.metacritic.com/game/playstation-4/rack-n-ruin", "publisher": "LifeSpark Entertainment", "release_date": "Mar 31 2015", "developers": ["LifeSpark Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action", "Action Adventure", "General", "Open-World"], "meta_score": 59, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/ab07ef23d26d5cd90d316b70bff48fc1-98.jpg", "descriptions": "Rack N Ruin is a top-down, action adventure game melded with a classic shmup."}, {"name": "Dynasty Warriors 6", "details_link": "https://www.metacritic.com/game/playstation-3/dynasty-warriors-6", "publisher": "Koei", "release_date": "Feb 19 2008", "developers": ["Koei", "Omega Force"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 59, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/902f6be299081da16f52c87828e00ae6-98.jpg", "descriptions": "Set in Ancient China during the 3rd century, Dynasty Warriors 6 immerses gamers in a truly cinematic kung-fu action experience. Celebrated characters have been completely re-imagined with new weapons and fighting techniques motion-captured from some of today’s leading stuntmen and women inSet in Ancient China during the 3rd century, Dynasty Warriors 6 immerses gamers in a truly cinematic kung-fu action experience. Celebrated characters have been completely re-imagined with new weapons and fighting techniques motion-captured from some of today’s leading stuntmen and women in Asia. With the game’s new “Renbu” attack system and game controls, players can execute lightning-fast combos and the most dazzling fighting moves with ease. Developed from the ground up exclusively for next-generation platforms, the game's proprietary engine delivers the most chaotic and challenging Tactical Action experience to date. Players can use the landscape to elude the thousands of soldiers swarming the battlefield. But as players move and attack, adaptable enemy A.I. devises offensive and defensive combat tactics, and can retaliate with packs of fierce hunting dogs and patrol boats. All of the explosive action comes to life in high definition, 60 frames per second graphics. [KOEI]… Expand"}, {"name": "Tony Hawk's Downhill Jam", "details_link": "https://www.metacritic.com/game/playstation-2/tony-hawks-downhill-jam", "publisher": "Activision", "release_date": "May  8 2007", "developers": ["SuperVillain Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/4b5a9466c09793a93aa617a00f3bed98-98.jpg", "descriptions": "Tony Hawk's Downhill Jam delivers an innovative and unique skateboard experience focused on head-to-head racing. The game allows players to feel the breakneck speed of downhill competition as they tear up the world's steepest terrains while performing tricks and outmaneuvering opponents inTony Hawk's Downhill Jam delivers an innovative and unique skateboard experience focused on head-to-head racing. The game allows players to feel the breakneck speed of downhill competition as they tear up the world's steepest terrains while performing tricks and outmaneuvering opponents in such locations as San Francisco, Machu Picchu and Hong Kong. Taking on the role of Tony Hawk or one of nine characters, players compete in time-based challenges in one of three gameplay modes including race, trick and slalom. The game features four new single player events, three new multiplayer modes and three new playable characters who contend in the ultimate skateboard racing experience. [Activision]… Expand"}, {"name": "Surf's Up", "details_link": "https://www.metacritic.com/game/playstation-3/surfs-up", "publisher": "Ubisoft", "release_date": "May 30 2007", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Alternative", "Individual", "Surfing", "Surfing", "Surf / Wakeboard"], "meta_score": 59, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/546a3aaee939c52c119795aae253c711-98.jpg", "descriptions": "Surf's Up is an arcade surfing and extreme sports video game. The action is set at the annual \"Reggie Belafonte Big Z Memorial Surf Off,\" where surfers from around the world are ready to risk it all for glory. Players experience the rush and thrills of surfing in exotic surf spots around PenSurf's Up is an arcade surfing and extreme sports video game. The action is set at the annual \"Reggie Belafonte Big Z Memorial Surf Off,\" where surfers from around the world are ready to risk it all for glory. Players experience the rush and thrills of surfing in exotic surf spots around Pen Gu Island and can rip it up and play as one of 10 characters from the film, including Cody, the young challenger from Shiverpool; Tank, the merciless champion; or Big Z, the surfing legend from the past. Only by mastering and understanding the waves can the player become not only the new champion, but a true surf legend. Game features include: Innovative arcade and surf feeling with players performing a variety of impressive tricks in the air and learning to surf inside a tube. Win the championship in the single-player mode or challenge your friends in the multiplayer mode with easy pick-up-and-play game controls. Surf in a variety of locations, each with its own waves and obstacles. Train in the calm water of Shiverpool, ride your first tubes in Pen Gu Island, and try to surf on the explosive waters of the volcano area. [Ubisoft]… Expand"}, {"name": "Line Rider 2: Unbound", "details_link": "https://www.metacritic.com/game/ds/line-rider-2-unbound", "publisher": "Genius Products, Inc.", "release_date": "Sep 16 2008", "developers": ["InXile Entertainment"], "platforms": ["PC", "DS"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Action"], "meta_score": 59, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/6410c9d93c61007d43a3812264c94fad-98.jpg", "descriptions": "(Also known as \"Line Rider Freestyle\" in the UK/EU)   In Line Rider, the sled-stealing scumbag Chaz is up to no good and only you, as the clever and cunning Bosh, can defeat him. For Bosh to save his true love Bailey, players must solve over 40 mind-bending puzzles created by the #1 Line(Also known as \"Line Rider Freestyle\" in the UK/EU)   In Line Rider, the sled-stealing scumbag Chaz is up to no good and only you, as the clever and cunning Bosh, can defeat him. For Bosh to save his true love Bailey, players must solve over 40 mind-bending puzzles created by the #1 Line Rider player in the world, TechDawg. [Genius Products]… Expand"}, {"name": "DOOM 3: BFG Edition", "details_link": "https://www.metacritic.com/game/pc/doom-3-bfg-edition", "publisher": "Bethesda Softworks", "release_date": "Oct 15 2012", "developers": ["id Software"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "genres": ["Action", "Miscellaneous", "Shooter", "Shooter", "Compilation", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/22ecf421fa3ebe10bb88580d1678e9a2-98.jpg", "descriptions": "Re-mastered for Xbox 360 and PlayStation 3, this genre defining game and its expansion pack offers greatly enhanced graphics, deeply immersing the player in the demonic world of this terrifying horror masterpiece. Players will also experience a never-before-seen single-player story, 'TheRe-mastered for Xbox 360 and PlayStation 3, this genre defining game and its expansion pack offers greatly enhanced graphics, deeply immersing the player in the demonic world of this terrifying horror masterpiece. Players will also experience a never-before-seen single-player story, 'The Lost Mission,' featuring seven heart-pounding levels that will once again have them on the edge of their seats.… Expand"}, {"name": "Pokedex 3D Pro", "details_link": "https://www.metacritic.com/game/3ds/pokedex-3d-pro", "publisher": "Nintendo", "release_date": "Nov  8 2012", "developers": ["Creatures Inc."], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "General", "Application"], "meta_score": 59, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/b421d7660cf8142bb03934b52a5220a4-98.jpg", "descriptions": "Take a huge amount of Pokemon knowledge with you wherever you go with Pokedex 3D Pro! The Nintendo 3DS application has stats and information on every known Pokemon, including evolution paths and lists of moves each can learn. And of course, you can view all the Pokemon in incredible 3D!Take a huge amount of Pokemon knowledge with you wherever you go with Pokedex 3D Pro! The Nintendo 3DS application has stats and information on every known Pokemon, including evolution paths and lists of moves each can learn. And of course, you can view all the Pokemon in incredible 3D!\r Use Pokedex 3D Pro along with the Pokemon Black Version 2 and Pokemon White Version 2 games to become the best Pokemon Trainer you can be!… Expand"}, {"name": "Skylanders Giants", "details_link": "https://www.metacritic.com/game/3ds/skylanders-giants", "publisher": "Activision", "release_date": "Oct 21 2012", "developers": ["n-Space"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "3DS"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 59, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/4/c421a162e8b6e434eb82b9b23630cb54-98.jpg", "descriptions": "Skylanders Giants is an all-new adventure for existing Skylanders toys that will also add 20 new characters--including eight giant ones--to the roster."}, {"name": "Rise of the Argonauts", "details_link": "https://www.metacritic.com/game/pc/rise-of-the-argonauts", "publisher": "Codemasters", "release_date": "Dec 16 2008", "developers": ["Liquid Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 59, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/96ca47f2db8460c239fd04779663f807-98.jpg", "descriptions": "Rise of the Argonauts immerses gamers in a gladiatorial adventure, set in wondrously imagined vision of ancient Greece. With deep exploration and epic quests, players live a life of brutal combat as they lead a team of iconic warriors - including Jason, Hercules and Atalanta - through aRise of the Argonauts immerses gamers in a gladiatorial adventure, set in wondrously imagined vision of ancient Greece. With deep exploration and epic quests, players live a life of brutal combat as they lead a team of iconic warriors - including Jason, Hercules and Atalanta - through a world ruled by mythological gods. [Codemasters]… Expand"}, {"name": "Soltrio Solitaire", "details_link": "https://www.metacritic.com/game/xbox-360/soltrio-solitaire", "publisher": "Silver Creek Entertainment", "release_date": "May 16 2007", "developers": ["Silver Creek Entertainment"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 59, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/66ad01930515490dec53ab900e7815d5-98.jpg", "descriptions": "[Xbox Live Arcade]  In Soltrio Solitaire, play your favorite classic games like Spider, Klondike, FreeCell, and more, or play them with power-up bonuses, making your own playing cards in Voyage mode. Looking for some head-to-head action? Duel it out in heated solitaire games, or play[Xbox Live Arcade]  In Soltrio Solitaire, play your favorite classic games like Spider, Klondike, FreeCell, and more, or play them with power-up bonuses, making your own playing cards in Voyage mode. Looking for some head-to-head action? Duel it out in heated solitaire games, or play cooperative with multiplayer solitaire. Choose from 18 solitaire games, expandable to over 100 through downloadable content packs. Play competitive or cooperative multiplayer solitaire on Xbox Live or same console multiplayer. Make your own card backs in the game, and even show off your custom playing cards in multiplayer. [Microsoft]… Expand"}, {"name": "Minecraft: Story Mode - Episode 2: Assembly Required", "details_link": "https://www.metacritic.com/game/pc/minecraft-story-mode---episode-2-assembly-required", "publisher": "Telltale Games", "release_date": "Oct 27 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "Adventure", "General", "Point-and-Click", "Linear"], "meta_score": 59, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/6/17a02996ee1c11dec82b0f7e7d585b24-98.jpg", "descriptions": "Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon,Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your crew stumbles on something dreadful. Terror is unleashed, and your only hope is to track down the “Order of the Stone”, a fabled group of adventurers who slew the legendary Ender Dragon. But where are they? In a race against time, you will travel across the over-world, through the Nether, to The End, and beyond. [Telltale Games]… Expand"}, {"name": "Murdered: Soul Suspect", "details_link": "https://www.metacritic.com/game/playstation-4/murdered-soul-suspect", "publisher": "Square Enix", "release_date": "Jun  3 2014", "developers": ["Airtight Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Horror", "Survival"], "meta_score": 59, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/fa7b99577e50d2519866f81940caf4c8-98.jpg", "descriptions": "Detective Ronan O'Connor's life is brought to an end when a brutal killer confronts him during a burglary. This detective with a checked past now finds himself trapped in the afterlife, his only escape from this nether world of \"Dusk\" is to bring the truth of his death and his killer toDetective Ronan O'Connor's life is brought to an end when a brutal killer confronts him during a burglary. This detective with a checked past now finds himself trapped in the afterlife, his only escape from this nether world of \"Dusk\" is to bring the truth of his death and his killer to light using his newly developed supernatural abilities. As Ronan, you can explore the town of Salem for clues, battle demon spirits to save your soul, and unearth revelations about who is responsible for your untimely death.… Expand"}, {"name": "Monster Madness: Battle for Suburbia", "details_link": "https://www.metacritic.com/game/pc/monster-madness-battle-for-suburbia", "publisher": "SouthPeak Games", "release_date": "Jun 12 2007", "developers": ["Artificial Studios", "Immersion Software & Graphics"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/ed0f0a0b122c70310c9276f4742a0ec3-98.jpg", "descriptions": "Our story begins in a typical house on a Friday night, one seemingly like any other within the quiet, safe streets of Suburbia. Zack is at home on a \"study date\" with Carrie, though he is desperately trying to interest her in more than just his math skills. While Zack is preparing toOur story begins in a typical house on a Friday night, one seemingly like any other within the quiet, safe streets of Suburbia. Zack is at home on a \"study date\" with Carrie, though he is desperately trying to interest her in more than just his math skills. While Zack is preparing to proclaim his eternal devotion, his friend Andy busts in, pestering Zack to finish the design for a new rocket-powered skateboard. Before Zack can order him and others to leave, some unexpected guests suddenly arrive and these guys are hungry...FOR BRAINS! Zombies break through the front door, and Zack's house is soon swarming with the Undead. The four intrepid teenagers manage to contain their fright, and using all sorts of household weaponry they actually fend off this zombie assault. However now they must contend with a full-scale suburban invasion, and everything from Werewolves to Witches are on the rampage - Oh My! And where has everyone else gone? Together, Zack, Carrie, Andy, and Jennifer resolve to wage a Battle for Suburbia, rescue their missing neighbors, and discover the ultimate source of this monster onslaught. The secrets they'll uncover throughout this adventure will explain the shocking truth behind their little town. [SouthPeak Interactive]… Expand"}, {"name": "Bleach: The 3rd Phantom", "details_link": "https://www.metacritic.com/game/ds/bleach-the-3rd-phantom", "publisher": "Sega", "release_date": "Sep 15 2009", "developers": ["Sega", "Tom Create"], "platforms": "DS", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 59, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/b3ce21e315f254b47e72bd794f3778cd-98.jpg", "descriptions": "In this exclusive storyline, exciting details are revealed about the BLEACH universe from before the start of the anime series. The story highlights the close partnership between two fraternal twin Soul Reapers, Matsuri Kudo and her brother Fujimaru. In fierce battles. For the first time,In this exclusive storyline, exciting details are revealed about the BLEACH universe from before the start of the anime series. The story highlights the close partnership between two fraternal twin Soul Reapers, Matsuri Kudo and her brother Fujimaru. In fierce battles. For the first time, players create and command their own team of eight Soul Reapers. In team-based battles, players decide where to place their team on the campaign map and also how to customize their character’s powers with the experience points they received. With exciting revelations and a lot more choice, strategy and cooperative gameplay, BLEACH: The 3rd Phantom thrills fans and newcomers to the series. Developed exclusively for the Nintendo DS. Gamers choose between two playable lead characters for two unique gameplay experiences with over 30 hours of gameplay in Story mode alone. Team-based Gameplay. For the first time in the series players create and command their own team of eight Soul Reapers. After Experience Points are earned in battle, the player can choose how to grow their team’s special abilities in different ways. Tactical Turn-based Campaigns. Players strategize where to place their team members on the campaign map, and also what skills/strengths each of the seven characters will possess. There are over 50 characters that can be selected to join in battles, each with their own special attacks and some with Bankai. After completing Story mode, players continue to power up their team in BLEACH Tower mode which contains 30 levels. The game also contains a wireless multiplayer mode for two players. While playing through Story mode and BLEACH Tower mode, players find rare BLEACH items including Health Boosts, Spiritual Pressure enhancements, weapon items and hard-to-find BLEACH characters. [Sega]… Expand"}, {"name": "Amazing Island", "details_link": "https://www.metacritic.com/game/gamecube/amazing-island", "publisher": "Sega", "release_date": "Aug 25 2004", "developers": ["Hitmaker"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Strategy", "Breeding/Constructing"], "meta_score": 59, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/584cad0ae757450765c369ea14e51e45-98.jpg", "descriptions": "The Black Evil has taken over Amazing Island and captured its natives, the Maboo tribe. Now it's up to you to defeat the Black Evil, take back the land, and return it to its rightful owners. To do so, you must use your imagination to create your own monster and enter it in a series ofThe Black Evil has taken over Amazing Island and captured its natives, the Maboo tribe. Now it's up to you to defeat the Black Evil, take back the land, and return it to its rightful owners. To do so, you must use your imagination to create your own monster and enter it in a series of competitions involving timing, speed, and head-to-head battles. The victor receives magical orbs that hold the power of the island and the keys to returning peace and prosperity to Amazing Island.… Expand"}, {"name": "Disney Sports Snowboarding", "details_link": "https://www.metacritic.com/game/game-boy-advance/disney-sports-snowboarding", "publisher": "Konami", "release_date": "Feb  5 2003", "developers": ["Konami"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/79a54a32e7d6d2f7f086a52049e91535-98.jpg", "descriptions": "Guide Mickey Mouse, Minnie Mouse, Donald Duck, Goofy, Big Bad Pete, and Chip and Dale in snowboarding competition with four main gameplay modes (Race, Trick, Rally, and Time Trial)."}, {"name": "Men in Black - The Series: Crashdown", "details_link": "https://www.metacritic.com/game/playstation/men-in-black---the-series-crashdown", "publisher": "Infogrames", "release_date": "Nov  1 2001", "developers": ["Runecraft"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": null}, {"name": "Ship Simulator 2006", "details_link": "https://www.metacritic.com/game/pc/ship-simulator-2006", "publisher": "DreamCatcher Interactive", "release_date": "Aug 21 2006", "developers": ["VSTEP"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Ship", "Marine", "Civilian"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/00c352077c7b558be3ccb6ec06110438-98.jpg", "descriptions": "Ship Simulator 2006 is a game that puts players at the helm of some of the most varied and detailed ships to be found at sea, where they will need to perform a multitude of tasks, all set within a stunning 3D environment. Players take control of a wide array of ship types, from massive cargoShip Simulator 2006 is a game that puts players at the helm of some of the most varied and detailed ships to be found at sea, where they will need to perform a multitude of tasks, all set within a stunning 3D environment. Players take control of a wide array of ship types, from massive cargo ships to speedboats, yachts, water taxis and even the mighty Titanic. The waters you sail are also as varied as the ships, from the biggest harbours in the world, such as Rotterdam and Hamburg, to the calm aqua marine waters of the Thai Phi Phi Islands. Gamers will experience how challenging it is to steer the Titanic through shallow water, or just how it feels to navigate a cargo tanker or tug boat - including how diverse the controls are. [Lighthouse Interactive]… Expand"}, {"name": "Alpha Prime", "details_link": "https://www.metacritic.com/game/pc/alpha-prime", "publisher": "Meridian4", "release_date": "May  1 2007", "developers": ["Black Element"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/308e98460b2b50f468ab6d4c8b96cd06-98.jpg", "descriptions": "The player is dropped into the maze of rooms, halls, corridors, mining facilities and shafts of an apparently abandoned deep-space asteroid mining base, facing rebellious machinery of assorted robots and automatic systems, which he has to defeat and demolish, using his weapons and wits.The player is dropped into the maze of rooms, halls, corridors, mining facilities and shafts of an apparently abandoned deep-space asteroid mining base, facing rebellious machinery of assorted robots and automatic systems, which he has to defeat and demolish, using his weapons and wits. Strong story, fast paced shooting action. However, if you cannot shoot, then there is your RECON, hacking device enabling you to remotely control various devices you meet (robots, manipulators, surveillance cameras, security systems, weapons etc.) on your way through the dark halls and corridors of Alpha Prime. If that's not enough, you can drug your mind and sharpen your senses (bullet time) by injecting a small dose of hubbardium. And all the time you will be surrounded by physical world in a very literal sense, because almost everything that moves, moves thanks to advanced real-time physics algorithms. Features 10 levels full of action; 5 non-playable characters to help you; 14 different enemies including Special Forces soldiers, robots and crazy miners; 8 futuristic weapons including pistol, shotgun, machine gun, grenades etc.; Devices to hack - including a variety of robots and manipulators, surveillance cameras, security systems, doors, etc. [IDEA Games]… Expand"}, {"name": "Blade Kitten", "details_link": "https://www.metacritic.com/game/playstation-3/blade-kitten", "publisher": "Atari", "release_date": "Sep 21 2010", "developers": ["Krome Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Adventure", "General", "General"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/acdf0f16fe6d996166b5979356a4d5b2-98.jpg", "descriptions": "Blade Kitten the game begins with Kit tracking a local troublemaker named Terra-Li on the mysterious artificial planetoid Hollow Wish. But on her way to doing so Kit uncovers a dark secret about Hollow Wish and its inhabitants, little does she realize that her actions will affect the destinyBlade Kitten the game begins with Kit tracking a local troublemaker named Terra-Li on the mysterious artificial planetoid Hollow Wish. But on her way to doing so Kit uncovers a dark secret about Hollow Wish and its inhabitants, little does she realize that her actions will affect the destiny of an entire planet. Her tale is one of liberation. Her tail is pink.\r… Expand"}, {"name": "Road Redemption", "details_link": "https://www.metacritic.com/game/playstation-4/road-redemption", "publisher": "Tripwire Interactive", "release_date": "Nov  6 2018", "developers": ["Dark Seas Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 59, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/5d275fb19ceb0cd2435690006083383b-98.jpg", "descriptions": "Road Redemption is an action racing game where you lead your motorcycle gang on an epic journey of pursuit, blood, and speed. Through your travels, you will upgrade your character, bike, and weapons by completing races, assassinations, robberies, and more. You’ll need to use kicks, grabs,Road Redemption is an action racing game where you lead your motorcycle gang on an epic journey of pursuit, blood, and speed. Through your travels, you will upgrade your character, bike, and weapons by completing races, assassinations, robberies, and more. You’ll need to use kicks, grabs, counters, and other moves to stay alive. Death is a constant companion on the roads of the wasteland, but it is not an end if you are killed, you keep everything you’ve earned so you can get back in the race. Through local and online multiplayer, you can work together with your friends or grind them into road dust beneath your tires. You can play multiplayer online or through 2-4 player splitscreen.… Expand"}, {"name": "Final Fantasy XV: Episode Gladiolus", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-xv-episode-gladiolus", "publisher": "Square Enix", "release_date": "Mar 29 2017", "developers": ["Square Enix"], "platforms": ["Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/a5e1794e775b5896e035d1da3b0b2a4f-98.jpg", "descriptions": "FF XV's first slice of downloadable content."}, {"name": "Drive!Drive!Drive!", "details_link": "https://www.metacritic.com/game/playstation-4/drive!drive!drive!", "publisher": "Choice Provisions", "release_date": "Dec 13 2016", "developers": ["different cloth"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 59, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/865001564c9e82b6fd2aae3c9e55a29d-98.jpg", "descriptions": "A racing game in which players must drive their cars to victory across multiple tracks at the same time. To place well in every track you’re racing on, you’re going to have to hop track-to-track on a regular basis."}, {"name": "Deadly Premonition: The Director's Cut", "details_link": "https://www.metacritic.com/game/pc/deadly-premonition-the-directors-cut", "publisher": "Rising Star Games", "release_date": "Oct 29 2013", "developers": ["Access Games"], "platforms": ["PlayStation 3", "Switch", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Open-World"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/e2dfb9bcbb9b046e6be4b7f623576df9-98.jpg", "descriptions": "Deadly Premonition is a third-person survival horror action game which puts players in the role of the intuitive FBI Agent Francis York Morgan. In the process of investigating a murder, players will examine a series of interlocking mysteries in a remote rural town and will encounter an arrayDeadly Premonition is a third-person survival horror action game which puts players in the role of the intuitive FBI Agent Francis York Morgan. In the process of investigating a murder, players will examine a series of interlocking mysteries in a remote rural town and will encounter an array of complex characters pivotal to the unraveling of the storyline's mystery. Suspenseful action sequences will force players to make strategic moves, gliding by enemies in the shadows or engaging them with long-range weapons or hand-to-hand melee combat. From the unparalleled atmosphere, music and mysterious storyline to driving vehicles and exploring the entire town, Deadly Premonition will offer players a unique and haunting interactive gaming experience unlike any other.… Expand"}, {"name": "NBA Live 07", "details_link": "https://www.metacritic.com/game/xbox-360/nba-live-07", "publisher": "EA Sports", "release_date": "Sep 25 2006", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 59, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/5bbcc731b6c90d3bc8732d1ba722c22b-98.jpg", "descriptions": "NBA LIVE 07 plays as good as it looks with gameplay advancements that build upon the depth and authenticity that the NBA LIVE franchise has delivered for more than a decade. NBA LIVE 07 introduces the next generation of basketball gameplay with EA SPORTS Total Freestyle Control, a newNBA LIVE 07 plays as good as it looks with gameplay advancements that build upon the depth and authenticity that the NBA LIVE franchise has delivered for more than a decade. NBA LIVE 07 introduces the next generation of basketball gameplay with EA SPORTS Total Freestyle Control, a new feature that gives users more control over athletes than ever. By introducing a next generation AI system that is both intuitive and intelligent, combined with advancements to fan-favorite features like All-Star Weekend and Dynasty Mode, NBA LIVE 07 continues to deliver its award-winning gameplay experience. This year NBA LIVE 07 partners with the worldwide leader in sports to deliver more ESPN content in-game while you play than ever before. [Electronic Arts]… Expand"}, {"name": "Spider-Man: Friend or Foe", "details_link": "https://www.metacritic.com/game/wii/spider-man-friend-or-foe", "publisher": "Activision", "release_date": "Oct  2 2007", "developers": ["Next Level Games"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 59, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/b026d7f2355fd0fcbc12dfabd898ac11-98.jpg", "descriptions": "Spider-Man: Friend or Foe challenges players to defeat and then join forces with notorious movie nemeses including Doc Ock, Green Goblin, Venom and Sandman, and other classic Spider-Man characters. Players embark on a global quest to overcome an evil threat, by controlling Spider-Man and oneSpider-Man: Friend or Foe challenges players to defeat and then join forces with notorious movie nemeses including Doc Ock, Green Goblin, Venom and Sandman, and other classic Spider-Man characters. Players embark on a global quest to overcome an evil threat, by controlling Spider-Man and one of numerous Super Hero or Super Villain sidekicks, as they master unique fighting moves and styles while switching between characters to execute team combos and defeat foes. Spider-Man: Friend or Foe features a unique co-op mode in which a friend can join the game at any time and take control of Spidey’s sidekick as they battle through the game side-by-side and replay favorite levels. [Activision]… Expand"}, {"name": "GEON: emotions", "details_link": "https://www.metacritic.com/game/xbox-360/geon-emotions", "publisher": "Eidos Interactive", "release_date": "Sep 19 2007", "developers": ["Eidos Interactive", "Strawdog Studios"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "Miscellaneous", "Puzzle", "General", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 59, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/d3a33ba796e0573aa6f66b05de68490a-98.jpg", "descriptions": "[Xbox Live Arcade]  Love it? Hate it? Does it make you angry? Does it calm you down? Feel the energy of powerful emotions as you compete amongst your opponents to master the unique sport of Geon: Emotions. What's your strategy going to be? Will you choose to spread fear among the other[Xbox Live Arcade]  Love it? Hate it? Does it make you angry? Does it calm you down? Feel the energy of powerful emotions as you compete amongst your opponents to master the unique sport of Geon: Emotions. What's your strategy going to be? Will you choose to spread fear among the other players, or unleash a wave of bliss over them with the aim of subverting their cause? Play to your emotional strengths. Allow your dark side to dominate, or win through speed, courage, and style. You can be the master of Geon, but you must learn to use your emotions to your advantage. Geon: Emotions is something different, a fast-paced abstract sports game that lets you explore your emotions as you compete against opponents. The razor sharp visuals are accompanied by a pulse-pounding soundtrack. Perfect your skills in a head-to-head duel or try the time attack to win medals and unlock mini-games. Then, go multiplayer on Xbox LIVE with up to four players and let it all hang out on the emotional battlefield. [Microsoft]… Expand"}, {"name": "The Fast and the Furious", "details_link": "https://www.metacritic.com/game/playstation-2/the-fast-and-the-furious", "publisher": "Namco Bandai Games America", "release_date": "Sep 26 2006", "developers": ["Eutechnyx"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Driving", "Mission-based"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/4eabf116ef2ce52b3e4f5a68a4ef9e19-98.jpg", "descriptions": "Inspired by the events of Universal Pictures' upcoming film, \"The Fast & The Furious: Tokyo Drift,\" this game immerses players in the underground world of drift racing. Set in a world related to, yet separate from, the movie, the game features a drift mechanic that makes drifting accessibleInspired by the events of Universal Pictures' upcoming film, \"The Fast & The Furious: Tokyo Drift,\" this game immerses players in the underground world of drift racing. Set in a world related to, yet separate from, the movie, the game features a drift mechanic that makes drifting accessible to both beginning and veteran racing game drivers. Gameplay features revolutionary new systems like the Drift Indicator. Turn on the assists and feel like a pro, or turn them off and hone your drift skills. Focusing on the \"next big thing\" in underground street racing this video game utilizes Universal’s extensive sound library, an incredible context based camera code, a revolutionary context based rumble system that gives players the feeling of driving city streets at break neck speeds like no other. Immerse yourself in the world of the game. 10,000+ polygon model cars, cinematic camera angles straight from the movie, unique boss challenges, stunning visuals and an Advanced Rubber Band AI system. Tune your ride with a hundred licensed wheels, and over 500 body kits from real JDM companies. Tune your ride like never before from performance to appearance, and for the first time ever swap out your engine to truly push the limits of your vehicle. [Namco Bandai]… Expand"}, {"name": "Evasive Space", "details_link": "https://www.metacritic.com/game/wii/evasive-space", "publisher": "Yuke's", "release_date": "Feb 16 2009", "developers": ["High Voltage Software"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "General", "General"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/3f4c1de2df83065aa963bae1a3f8a672-98.jpg", "descriptions": "[WiiWare]  [WiiWare]  Twinkle, twinkle, little star, how I wonder WHERE you are. The universe is going dark and it's up to you Konki, Stellar Guardian, to put things right. Dr. Dark Matter and his roving band of space thieves have stolen many of the Constellation Stones that make up the[WiiWare]  [WiiWare]  Twinkle, twinkle, little star, how I wonder WHERE you are. The universe is going dark and it's up to you Konki, Stellar Guardian, to put things right. Dr. Dark Matter and his roving band of space thieves have stolen many of the Constellation Stones that make up the heavens. Some stones have been sold to unscrupulous space types while others were lost during the getaway. Whatever the situation, you must come through. Suit-up, power-up, and live up to the task at hand. Recover the lost Constellation Stones and once again bring light to the night sky. [High Votage Software]… Expand"}, {"name": "Lucius", "details_link": "https://www.metacritic.com/game/pc/lucius", "publisher": "Lace Mamba Global", "release_date": "Oct 26 2012", "developers": ["Shiver Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Horror", "General"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/1d911b8c90df8a136e4b083be0544420-98.jpg", "descriptions": "Lucius is the son of the devil who has to clear the mansion of it’s residents. To do this he must orcastrate “accidents” without anyone suspecting him of any foul play. The player starts as Lucius and must cleverly devise these incidents from simple household items. Every time he succeeds heLucius is the son of the devil who has to clear the mansion of it’s residents. To do this he must orcastrate “accidents” without anyone suspecting him of any foul play. The player starts as Lucius and must cleverly devise these incidents from simple household items. Every time he succeeds he will gain supernatural powers to help him take full control.… Expand"}, {"name": "MXGP2: The Official Motocross Videogame", "details_link": "https://www.metacritic.com/game/xbox-one/mxgp2-the-official-motocross-videogame", "publisher": "Milestone S.r.l", "release_date": "Jun 21 2016", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/8bb7f9035c8574c4db99ec34d087009d-98.jpg", "descriptions": "MXGP2 is the evolution of the Official Motocross Videogame experience, based on the FIM Motocross World Championship license with updated tracks and riders, including Glen Helen and the new Americas tracks. Players also have the chance to ride in two brand new indoor stadiums to test theirMXGP2 is the evolution of the Official Motocross Videogame experience, based on the FIM Motocross World Championship license with updated tracks and riders, including Glen Helen and the new Americas tracks. Players also have the chance to ride in two brand new indoor stadiums to test their riding abilities and take part, for the first time in a cross videogame, in the Monster Energy FIM Motocross of Nations. Customise every part of your bike, rider, and team, and hone your stills in test track performances. … Expand"}, {"name": "12 is Better Than 6", "details_link": "https://www.metacritic.com/game/switch/12-is-better-than-6", "publisher": "HypeTrain Digital", "release_date": "Mar  5 2019", "developers": ["Ink Stains Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 59, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/ca02991f607fa3851032fe575233e296-98.jpg", "descriptions": "It is 1873. An escaped slave is slowly walking through the desert, making his way from Mexico to Texas. He keeps a revolver close and is wearing the sombrero stolen from a dead man.\r Deadly gunfights:\r\n\r\nYou’ll need to cock the revolver with one trigger before being able to shoot by It is 1873. An escaped slave is slowly walking through the desert, making his way from Mexico to Texas. He keeps a revolver close and is wearing the sombrero stolen from a dead man.\r Deadly gunfights:\r You’ll need to cock the revolver with one trigger before being able to shoot by pressing another trigger. One false move and you’ll be overrun in an instant.\r Authentic weapons:\r Winchesters, double-barreled guns, revolvers and Gatling guns will gladly help you to destroy all of the gringos. By the way, we have a RAT with dynamite. … Expand"}, {"name": "PlayStation VR WORLDS", "details_link": "https://www.metacritic.com/game/playstation-4/playstation-vr-worlds", "publisher": "Sony Interactive Entertainment", "release_date": "Oct 10 2016", "developers": ["SCEE London Studio", "Sony Interactive Entertainment"], "platforms": "PlayStation 4", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 59, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/fca6e05b7071c873ced9d5f4f7971149-98.jpg", "descriptions": "The London Heist -Immerse yourself in London's gritty criminal underworld as you step into the shoes of an east-end gangster. Relive the dramatic heist shootout and survive a high speed getaway. Ocean Descent -Descend through the breath-taking layers of the ocean as a rookie diver andThe London Heist -Immerse yourself in London's gritty criminal underworld as you step into the shoes of an east-end gangster. Relive the dramatic heist shootout and survive a high speed getaway. Ocean Descent -Descend through the breath-taking layers of the ocean as a rookie diver and experience the incredible marine life all around you. VR Luge-Feel the exhilaration of an illegal street race down perilous roads as you lay inches off the ground on your luge board. Scavengers Odyssey -Board your dynamic all-terrain alien craft, explore a treacherous nebula and attempt to recover a highly coveted, ancient artefact. Danger Ball-Enter THE competitive sporting event of the future where victory is everything. Master your skills, destroy your rivals and survive to win the tournament. Win or be destroyed.… Expand"}, {"name": "Headhunter: Redemption", "details_link": "https://www.metacritic.com/game/xbox/headhunter-redemption", "publisher": "Sega", "release_date": "Sep 21 2004", "developers": ["Amuze"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/f9f047daa547f0bc13c2e759062d2194-98.jpg", "descriptions": "Twenty years after the devastation caused by the Bloody Mary Virus, a new order emerged based on two distinct, but totally independent worlds. As veteran headhunter Jack Wade or his sidekick, Lezza X, your job is to maintain law and societal order. Use each character's different abilitiesTwenty years after the devastation caused by the Bloody Mary Virus, a new order emerged based on two distinct, but totally independent worlds. As veteran headhunter Jack Wade or his sidekick, Lezza X, your job is to maintain law and societal order. Use each character's different abilities and weapons to survive intense combat environments. Headhunter: Redemption places you in two storylines based on two worlds, comprised of unique mission structures and objectives.… Expand"}, {"name": "Saw", "details_link": "https://www.metacritic.com/game/xbox-360/saw", "publisher": "Konami", "release_date": "Oct  6 2009", "developers": ["Zombie Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/ff8e08ee4bb46b5ebbcdf32bfc4f3a64-98.jpg", "descriptions": "Jigsaw has killed your partner and destroyed your life.  Now he has trapped you in an abandoned insane asylum that he alone controls. If you can defeat his brutal traps and survive, you may just discover the truth behind what drives this twisted serial killer. SAW is a third-personJigsaw has killed your partner and destroyed your life.  Now he has trapped you in an abandoned insane asylum that he alone controls. If you can defeat his brutal traps and survive, you may just discover the truth behind what drives this twisted serial killer. SAW is a third-person perspective, survival horror game based on the SAW film franchise.  The game features many of the deadly mechanical traps seen in the film, as well as terrifying new ones. Players pit their wits against Jigsaw as they navigate his world in an attempt to evade and escape his gruesome traps, while also struggling against his minions in brutal combat by using weapons found within the environment. SAW, the video game, is based on a treatment from Zombie Studios and the creators of the SAW franchise, Leigh Whannell and James Wan. The timeline for the game takes place between the movies: SAW and SAW II, giving the game its own story, yet fitting within the narratives of the movies.  The story centers on Detective David Tapp who awakens in a decrepit, abandoned asylum.  He has been captured by his longtime nemesis, Jigsaw. Obsessed with catching this serial killer, Tapp’s mission has consumed him and ruined his family, resulting in divorce, mental imbalance, and abandonment. Worse yet, this frantic hunt destroyed Tapp’s career while he watched his long-time friend and partner get killed by one of Jigsaw’s traps.  Now Jigsaw has the upper hand and has captured the detective. Tapp must play a deadly game - the likes of which he has been investigating for years - to escape, and in order to do so he must survive the lethal traps and puzzles that Jigsaw has put in place for him and others. But each victim has a dark connection to Tapp. Will Tapp save them? Can he survive his obsession to find the Jigsaw killer? [Konami]… Expand"}, {"name": "BigFest", "details_link": "https://www.metacritic.com/game/playstation-vita/bigfest", "publisher": "SCEA", "release_date": "Dec  1 2015", "developers": ["On The Metal Ltd"], "platforms": "PlayStation Vita", "genres": ["Action", "Strategy", "Rhythm", "Management", "Music", "Business / Tycoon"], "meta_score": 59, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/82700f3d31bf09f8c895f8672eb1fee8-98.jpg", "descriptions": "With the help of Big Dave and your trusty crew of roadies, in BigFest you design, build and manage the ultimate music festival, from a small field with 20 guests slow clapping, all the way up to multi-day, multi-stage, mega festivals."}, {"name": "Mage Knight: Destiny's Soldier", "details_link": "https://www.metacritic.com/game/ds/mage-knight-destinys-soldier", "publisher": "Namco Bandai Games", "release_date": "Sep 26 2006", "developers": ["Big Blue Bubble Inc."], "platforms": "DS", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 59, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/c9fef4065e995c88914f7eb117625075-98.jpg", "descriptions": "A turn-based strategy title based on the best-selling collectible miniature game from WizKids Games, Mage Knight: Destiny’s Soldier takes players to a time where war is rampant and the fate of the land rests in the hands of one brave warrior. Players take on the role of a warrior who isA turn-based strategy title based on the best-selling collectible miniature game from WizKids Games, Mage Knight: Destiny’s Soldier takes players to a time where war is rampant and the fate of the land rests in the hands of one brave warrior. Players take on the role of a warrior who is tasked to fight and rally as many troops as possible in an effort to restore peace and keep the Land alive. This warrior must prove himself by fighting hard and earning the respect of other soldiers by engaging in small battles along the way. The more respect a player earns, the more inclined others will be to fight alongside him in an all-out war against those trying to destroying the Land. Mage Knight: Destiny's Soldier provides players with a deep and structured combat system based on the established Mage Knight rules. Players can explore and conquer more than 80 maps including forests, mountains, villages, icy plains and other various types of terrain throughout the Land. Players can also build an unstoppable custom army by utilizing more than 90 different units of troops through recruitment and conquest. [Namco Bandai Games]… Expand"}, {"name": "Golem", "details_link": "https://www.metacritic.com/game/playstation-4/golem", "publisher": "Highwire Games", "release_date": "Nov 15 2019", "developers": ["Highwire Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 59, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/09750269bcad05f64abc6cc7c7d243dc-98.jpg", "descriptions": "Enter a mysterious storybook world and take the role of Twine, an adventurous kid who has been seriously injured in an accident. Even though you are unable to leave your bed during your recovery, you never stop dreaming of exploring the outside world. That is, until you discover that youEnter a mysterious storybook world and take the role of Twine, an adventurous kid who has been seriously injured in an accident. Even though you are unable to leave your bed during your recovery, you never stop dreaming of exploring the outside world. That is, until you discover that you have the ability to create and control stone creatures called golems, seeing through their eyes and controlling their actions.… Expand"}, {"name": "The Legend of Spyro: Dawn of the Dragon", "details_link": "https://www.metacritic.com/game/playstation-3/the-legend-of-spyro-dawn-of-the-dragon", "publisher": "Sierra Entertainment", "release_date": "Oct 21 2008", "developers": ["Etranges Libellules"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 59, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/ad9251d33027582e930bfb5e16d3ec2b-98.jpg", "descriptions": "In the final chapter of the Legend of Spyro trilogy, players find Sypro teaming up with an unlikely ally - Cynder, his former enemy, to face his most challenging mission to date. As the Dark Master's (voiced by Mark Hamill) evil envelopes the world like a plague, Spyro must fulfill hisIn the final chapter of the Legend of Spyro trilogy, players find Sypro teaming up with an unlikely ally - Cynder, his former enemy, to face his most challenging mission to date. As the Dark Master's (voiced by Mark Hamill) evil envelopes the world like a plague, Spyro must fulfill his destiny and unlock the true power of the purple dragon within him to stop the Dark Master in his tracks. The game introduces two never before seen elements into the Spyro universe: Spyro can now fly at any time and players can drop-in/drop-out with the new cooperative feature. The co-op feature allows players to have the option of completing the game as either Spyro or Cynder, giving them more freedom to explore Spyro's world in completely new ways. [Sierra Entertainment]… Expand"}, {"name": "Blightbound", "details_link": "https://www.metacritic.com/game/pc/blightbound", "publisher": "Devolver Digital", "release_date": "Jul 27 2021", "developers": ["Ronimo Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/9b9d400a304ee768ea82f6f43bc5025a-98.jpg", "descriptions": "Blightbound is a multiplayer dungeon crawler that tasks three heroes to venture down from their mountain refuge to face the abominations of the Blight - a mysterious and corrupting fog that enshrouds the land."}, {"name": "Crossroads Inn", "details_link": "https://www.metacritic.com/game/pc/crossroads-inn", "publisher": "Klabater", "release_date": "Oct 23 2019", "developers": ["Kraken Unleashed"], "platforms": ["Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/c9c5e13d29e7dd3a05c1033d76cf770d-98.jpg", "descriptions": "Crossroads Inn is a real time management sim set in an original fantasy world of Delcrys. Build and manage your tavern, make visiting adventurers happy, and make your services famous all over the land."}, {"name": "Empathy: Path of Whispers", "details_link": "https://www.metacritic.com/game/pc/empathy-path-of-whispers", "publisher": "Iceberg Interactive", "release_date": "May 16 2017", "developers": ["Pixel Night"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 59, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/866881538ba8a0759346753f80f66fbc-98.jpg", "descriptions": "Empathy: Path of Whispers is an atmospheric and surreal adventure game where you explore a seemingly abandoned world through the emotions and memories of the people who once inhabited it, trying to restore the world’s lost balance by journeying through its past."}, {"name": "Gladiator Begins", "details_link": "https://www.metacritic.com/game/psp/gladiator-begins", "publisher": "Aksys Games", "release_date": "Sep 13 2010", "developers": ["Acquire", "Goshow"], "platforms": "PSP", "genres": ["Action", "General", "General", "Fighting", "3D"], "meta_score": 59, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/08d3e499a31434411a2aaabeb0646294-98.jpg", "descriptions": "Customize your own Gladiator and win your freedom! Choose from several different builds, faces, hair styles and skin tones. Depending on which gender you pick, NPCs will react differently! Ad-Hoc Multiplayer action, battle a friend using the Ad-hoc multiplayer option. Weapons and ArmorCustomize your own Gladiator and win your freedom! Choose from several different builds, faces, hair styles and skin tones. Depending on which gender you pick, NPCs will react differently! Ad-Hoc Multiplayer action, battle a friend using the Ad-hoc multiplayer option. Weapons and Armor Galore with over 500 plus swords, shields, spears, clubs and axes. Refine blessed weapons to make them stronger at the blacksmith. … Expand"}, {"name": "Major League Baseball 2K8: Fantasy All-Stars", "details_link": "https://www.metacritic.com/game/ds/major-league-baseball-2k8-fantasy-all-stars", "publisher": "Take-Two Interactive", "release_date": "Apr 14 2008", "developers": ["Deep Fried Entertainment"], "platforms": "DS", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Arcade", "Arcade"], "meta_score": 59, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/7efc4b94d5ccbb0cbb906d4f2f5aaa49-98.jpg", "descriptions": "Utilizing the functionality of the Nintendo DS touch screen, Major League Baseball 2K8 Fantasy All-Stars will provide fans the unique opportunity to control the power and technique of their swings and the speed and accuracy of their pitch by performing specific gestures and intuitive usageUtilizing the functionality of the Nintendo DS touch screen, Major League Baseball 2K8 Fantasy All-Stars will provide fans the unique opportunity to control the power and technique of their swings and the speed and accuracy of their pitch by performing specific gestures and intuitive usage of the stylus. Fielding, baserunning and other controls will also utilize the DS touch screen, as players drag and trace lines to execute these specific baseball actions.… Expand"}, {"name": "Zoo Empire", "details_link": "https://www.metacritic.com/game/pc/zoo-empire", "publisher": "Enlight Software", "release_date": "Aug  1 2004", "developers": ["Enlight Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 59, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/5ea5abf70631f028027350edef6c4027-98.jpg", "descriptions": "It's a zoo out there, and you're in charge! Go wild with your imagination running the most exotic, fun and exciting zoo ever. Tend to your animals' health, happiness and nutrition by hiring employees, and adopt new animals as you unlock the numerous features hidden within the game. Attend toIt's a zoo out there, and you're in charge! Go wild with your imagination running the most exotic, fun and exciting zoo ever. Tend to your animals' health, happiness and nutrition by hiring employees, and adopt new animals as you unlock the numerous features hidden within the game. Attend to visitors by providing facilities for them to eat, drink and buy souvenirs from as they revel in your zoo. Sporting flexible gameplay, choose from either the sandbox mode where you establish the rules of the game, or accept the challenge of graduating from rookie zookeeper to wildlife whiz in the challenging career mode! Keep your animals, employees and visitors happy, keep the money rolling in, and path by path, animal by animal, exhibit by exhibit, build your very own Zoo Empire! [Enlight Software]… Expand"}, {"name": "Speed Kings", "details_link": "https://www.metacritic.com/game/gamecube/speed-kings", "publisher": "Acclaim", "release_date": "May 28 2003", "developers": ["Climax Group"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/6e5361e634a01ab572eb3b7f15b57d96-98.jpg", "descriptions": "It will take nerves of steel and lightning-fast reflexes to make your way through the crowded streets of Speed Kings. In the world of street motorcycle racing, you'll weave through traffic, pull off flashy stunts, run from police, and race to the finish line. Your high-performanceIt will take nerves of steel and lightning-fast reflexes to make your way through the crowded streets of Speed Kings. In the world of street motorcycle racing, you'll weave through traffic, pull off flashy stunts, run from police, and race to the finish line. Your high-performance bikes--including sport, road, touring, and custom models--each have their own type of handling and top speeds. Perform jumps, power-downs, skids, wheelies, and stoppies, but be careful--failed attempts at these tricks result in real-time damage to both bike and rider.… Expand"}, {"name": "Riding Spirits", "details_link": "https://www.metacritic.com/game/playstation-2/riding-spirits", "publisher": "Bam Entertainment", "release_date": "Aug 31 2002", "developers": ["Spike"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 59, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/dc64912905b8f45d7cedb12793f83c12-98.jpg", "descriptions": "Hit the road on 200 of the fastest two-wheel machines on the planet from companies like Yamaha, Honda and Suzuki in the most accurate motorcycle racing game ever created. Earn your chance to sit astride these racing rockets by speeding to victory, winning cash for taking races. Spend yourHit the road on 200 of the fastest two-wheel machines on the planet from companies like Yamaha, Honda and Suzuki in the most accurate motorcycle racing game ever created. Earn your chance to sit astride these racing rockets by speeding to victory, winning cash for taking races. Spend your winnings on new bikes and all the racing gear you'll need to make you look as good as you ride. Drop serious dollars in the shop, adding better wheels, tighter suspension and bigger engines to your bike, taking it from stock ride to tricked-out racing machine. Anyone can wheel a bike out of a dealership -- can you tune yours to be a winner? Test the limits of your abilities on courses where a split-second decision means the difference between victory or defeat. Start your career and begin building your rep, as you crank open the throttle across 16 different tracks in America, Japan and Europe. [BAM Entertainment]… Expand"}, {"name": "Outlive (2001)", "details_link": "https://www.metacritic.com/game/pc/outlive-2001", "publisher": "Take-Two Interactive", "release_date": "Mar 19 2001", "developers": ["Continuum"], "platforms": "PC", "num_players": "Up to 16 ", "genres": ["Strategy", "Real-Time", "General", "General", "Command"], "meta_score": 59, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/cfdb66a7b353fad3a5e1504c98221121-98.jpg", "descriptions": "A 2D battlefield game set during a 21st Century resource shortage which \"resembles\" the oft-imitated Starcraft. (Why imitate a game released in 1998, you ask?) Incidentally, the default graphics resolution of the game is 640x480, so if you have some old equipment, this might be the game for you."}, {"name": "Kingdom Under Fire: A War of Heroes", "details_link": "https://www.metacritic.com/game/pc/kingdom-under-fire-a-war-of-heroes", "publisher": "Gathering", "release_date": "Jan 18 2001", "developers": ["Phantagram", "Bloom Technology"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 59, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/b4eddef5bb34c777aedb92e56479f870-98.jpg", "descriptions": "KUF places players in the classic struggle between good and evil to control power, magic, and the land of Bersiah. Players build and control over 70 units and their resources -- gold, iron, and mana -- in order to increase combat strategy options, magical abilities, and the availability ofKUF places players in the classic struggle between good and evil to control power, magic, and the land of Bersiah. Players build and control over 70 units and their resources -- gold, iron, and mana -- in order to increase combat strategy options, magical abilities, and the availability of weapons.  [Gathering of Developers]… Expand"}, {"name": "Maximum Pool", "details_link": "https://www.metacritic.com/game/dreamcast/maximum-pool", "publisher": "Sierra Entertainment", "release_date": "Dec  4 2000", "developers": ["Dynamix"], "platforms": ["PC", "Dreamcast"], "genres": ["Miscellaneous", "Parlor", "Billiards"], "meta_score": 59, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/5130029c0e9eb483177ced1c22032847-98.jpg", "descriptions": "Rack 'em up with seven classic pool games featuring super-accurate physics, video-captured opponents, and online play. Earn access to five crazy bonus games by beating a tough opponent or joining an online game!"}, {"name": "Those Who Remain", "details_link": "https://www.metacritic.com/game/xbox-one/those-who-remain", "publisher": "Camel 101", "release_date": "May 28 2020", "developers": ["Camel 101"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 59, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/0/66f13011816102909bfc95a069152a24-98.jpg", "descriptions": "As the lights go out, the embers of darkness are stoked in the sleepy town of Dormont.\r Whispers of disappearances carry through the town as a burgeoning, uneasy and irrational fear begins to spread and darkness comes to be an unwelcome reflection to Those Who Remain.\r\n\r\nSome mistakesAs the lights go out, the embers of darkness are stoked in the sleepy town of Dormont.\r Whispers of disappearances carry through the town as a burgeoning, uneasy and irrational fear begins to spread and darkness comes to be an unwelcome reflection to Those Who Remain.\r Some mistakes should never happen, not when your life is complete – and yet they do. Edward had the good life, a beautiful wife and the perfect little girl, yet finds himself several whiskeys down and driving through the night of Dormont to end his secret affair – in a bid to fix his mistakes.\r As Edward pulls into the Golden Oak Motel, he is unaware just how much this night will change his life…\r The horrors and darkness that thrive in the corner of every eye are torn loose…\r Those Who Remain places you in an up-close, psychological horror story set in the sleepy town of Dormont – a town in a spiralling split from the fabric of reality, warped by darkness and the deeds of the Citizens who reside.\r Confront the uncomfortable horrors reflected by the darkness and survive the night of Dormont as Edward is confronted with a test of his sanity, morality and the shadows of evil that lurks below.\r… Expand"}, {"name": "Robotech: Invasion", "details_link": "https://www.metacritic.com/game/xbox/robotech-invasion", "publisher": "Global Star Software", "release_date": "Oct  5 2004", "developers": ["Vicious Cycle"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/8a0099a37f62a159cba312e8d881e862-98.jpg", "descriptions": "In the 21st century, humankind was freed from the confines of the solar system through the discovery of an alien technology known as Robotech. Now it's time to put that technology to good use as human survivors make one last attempt to liberate Earth from invaders. Jump into a mech suit orIn the 21st century, humankind was freed from the confines of the solar system through the discovery of an alien technology known as Robotech. Now it's time to put that technology to good use as human survivors make one last attempt to liberate Earth from invaders. Jump into a mech suit or inside a Cyclone vehicle, and then maneuver your way through hive raids, gang confrontations, protoculture searches, and more. Complete various objectives in single-player mode, or showcase your skills in two-player split-screen or online modes.… Expand"}, {"name": "Disney/Pixar Cars 3: Driven to Win", "details_link": "https://www.metacritic.com/game/switch/disneypixar-cars-3-driven-to-win", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 13 2017", "developers": ["Avalanche Software"], "platforms": ["PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "Switch"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 59, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/bd27b9a36d96fb8c0b79d515482efbc6-98.jpg", "descriptions": "Speed into the world of Cars as you determine your path to racing mastery in Cars 3: Driven to Win, the game inspired by the Disney Pixar film. Play with over 20 customizable characters including Lightning McQueen, Jackson Storm, Cruz Ramirez and the next generation of racers in over 20Speed into the world of Cars as you determine your path to racing mastery in Cars 3: Driven to Win, the game inspired by the Disney Pixar film. Play with over 20 customizable characters including Lightning McQueen, Jackson Storm, Cruz Ramirez and the next generation of racers in over 20 tracks set in iconic locations from the film such as Radiator Springs. Train and advance your abilities in 6 game modes and challenge your family and friends in the Battle Race to become the Ultimate Champion. On the road to becoming a Hall of Fame Driver, training and skill will give you an edge in a race that anyone can win.… Expand"}, {"name": "GunWorld 2", "details_link": "https://www.metacritic.com/game/xbox-one/gunworld-2", "publisher": "M07 Games", "release_date": "May 13 2016", "developers": ["M07 Games"], "platforms": ["PC", "Xbox One"], "genres": ["Action", "General"], "meta_score": 59, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/0268a9a2468d522e40b34f5608caeebc-98.jpg", "descriptions": "The sequel no one asked for, to the game that nobody liked! The Exaction Faction, an intergalactic troupe of super heroes, has come to arrest President Eagle! Explore GunWorld to level up, collect new gear, and hunt down the Faction members in this retro-inspired action/platformer/RPG hybrid."}, {"name": "Entwined", "details_link": "https://www.metacritic.com/game/playstation-4/entwined", "publisher": "SCEA", "release_date": "Jun  9 2014", "developers": ["Pixel Opus"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "General", "Arcade"], "meta_score": 59, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/a2862b99b0752f8651b3ce906f5e80a2-98.jpg", "descriptions": "It’s an abstract action/arcade game about two souls who are in love but that can’t be together. These souls are represented by a bird and a fish, which you must learn to control simultaneously. Over the course of nine lifetimes you will help these two characters come together with theIt’s an abstract action/arcade game about two souls who are in love but that can’t be together. These souls are represented by a bird and a fish, which you must learn to control simultaneously. Over the course of nine lifetimes you will help these two characters come together with the eventual goal of uniting them for eternity. This story was inspired by an ancient Chinese myth, and the theme of reincarnation lives in our level structure. [Playstation.com]… Expand"}, {"name": "Pokemon Rumble", "details_link": "https://www.metacritic.com/game/wii/pokemon-rumble", "publisher": "Nintendo", "release_date": "Nov 16 2009", "developers": ["Ambrella"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 59, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/04e3638949b806466276d64afd351671-98.jpg", "descriptions": "[WiiWare]  Available exclusively for the WiiWare service, Pokémon Rumble is an action game in which you control Toy Pokémon (referred to as \"Pokémon\") and take on wave after wave of other Pokémon in a variety of stages. You can befriend some of the defeated Pokémon along the way, which lets[WiiWare]  Available exclusively for the WiiWare service, Pokémon Rumble is an action game in which you control Toy Pokémon (referred to as \"Pokémon\") and take on wave after wave of other Pokémon in a variety of stages. You can befriend some of the defeated Pokémon along the way, which lets you add them to your collection and grants you the ability to use them in battle. Switch between collected Pokémon at any time, taking advantage of the fact that the amount of damage you deal depends on the type of move used and the type of Pokémon hit. Be the last one standing to gain the right to compete in the Battle Royale and test your skills against many Pokémon at once. You can also team up with three people for some multiplayer action (additional Wii Remote controllers required), working together to take down tough Bosses and earning points that can be used toward recruiting or training Pokémon. You can even save your favorite Pokémon to your Wii Remote controller for exchanges with friends. Combining beautiful cel-shaded graphics and exciting game-play features, this is one rumble you won't want to miss. [Nintendo]… Expand"}]