[{"name": "Doki-Doki Universe", "details_link": "https://www.metacritic.com/game/playstation-3/doki-doki-universe", "publisher": "SCEA", "release_date": "Dec 10 2013", "developers": ["SCEA"], "platforms": ["PlayStation 4", "PlayStation Vita", "PlayStation 3"], "genres": ["General", "Miscellaneous", "General"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/de0aae95825d420f2a3925d7ede01b1e-98.jpg", "descriptions": "Doki-Doki Universe is a charming interactive game that takes you on a journey to explore humanity and personal discovery.\r Doki-Doki Universe is a charming interactive game world that takes you on a journey to explore the concept of humanity. Players will travel to uniquely themed planetsDoki-Doki Universe is a charming interactive game that takes you on a journey to explore humanity and personal discovery.\r Doki-Doki Universe is a charming interactive game world that takes you on a journey to explore the concept of humanity. Players will travel to uniquely themed planets and asteroids to meet some of the most bizarre characters in an effort to learn more about them, and hopefully, learn a little bit more about themselves along the way.… Expand"}, {"name": "Rise of Industry", "details_link": "https://www.metacritic.com/game/pc/rise-of-industry", "publisher": "Kasedo Games", "release_date": "May  2 2019", "developers": ["Dapper Penguin Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Government", "Strategy", "Management", "Business / Tycoon"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/2d566be1f50fb07ef31eac109b440d5d-98.jpg", "descriptions": "Rise of Industry is a strategic tycoon game that puts you in the shoes of an early 20th-century industrialist. Build and manage your growing empire in a living, breathing, and procedurally generated world that is constantly evolving and adapting to your playstyle."}, {"name": "War of the Vikings", "details_link": "https://www.metacritic.com/game/pc/war-of-the-vikings", "publisher": "Paradox Interactive", "release_date": "Oct  1 2013", "developers": ["Fatshark AB"], "platforms": "PC", "genres": ["Action", "General", "General"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/db9abb7aaca21cdf5d2cb814146218c2-98.jpg", "descriptions": "Developed by Fatshark, War of the Vikings is a new standalone entry into the War-franchise that will pull players into the brutal and bloody Viking Age, challenging them to design a personalized warrior and sack England as a mighty Norseman - or defend it as a brave Saxon."}, {"name": "Poison Control", "details_link": "https://www.metacritic.com/game/playstation-4/poison-control", "publisher": "NIS America", "release_date": "Apr 13 2021", "developers": ["Nippon Ichi Software"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/c777855f2ac4e9436dfe015a9f16a7bf-98.jpg", "descriptions": "This shooter-meets-action title combines high-octane gameplay and a grim-yet-charming art style into one unforgettable adventure. Use Poisonette's powers to purify poison mires while blasting away enemies as her gunslinging vessel. You can also customize your gameplay experience by choosingThis shooter-meets-action title combines high-octane gameplay and a grim-yet-charming art style into one unforgettable adventure. Use Poisonette's powers to purify poison mires while blasting away enemies as her gunslinging vessel. You can also customize your gameplay experience by choosing between a male or female vessel, unlocking weapons and enhancements with each world you purify, and increasing certain stats of Poisonette through choice-based dialogue. A poisonous partnership: swap between the poison-absorbing Poisonette and her gun-wielding vessel, and combine firepower and zone control to destroy the creatures of the poison mires. Enigmatic encounters: uncover the mysterious circumstances that set Poisonette and her vessel on the poisonous path towards redemption. Corrupt and colorful: with an art style that's as grim as it is charming, this twisted tale practically jumps off the screen! From vivid stages to vibrant gameplay effects, this adventure is as much a visual experience as it is visceral. … Expand"}, {"name": "Destruction AllStars", "details_link": "https://www.metacritic.com/game/playstation-5/destruction-allstars", "publisher": "Sony Interactive Entertainment", "release_date": "Feb  2 2021", "developers": ["Lucid"], "platforms": "PlayStation 5", "num_players": "Up to 16 ", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 62, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/81853aba2acea589317909cd9d30a11c-98.jpg", "descriptions": "Destruction All Stars is an action-packed sports event that pits drivers against one another in an intense competition. The goal? Wreck as many cars as possible."}, {"name": "Lost Ember", "details_link": "https://www.metacritic.com/game/switch/lost-ember", "publisher": "Mooneye Studios", "release_date": "Sep 24 2020", "developers": ["Mooneye Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/45cc5d9ef14b6ebc1929ae2e820170ca-98.jpg", "descriptions": "A beautiful world holds the secrets of its past for you and your companion to uncover. Play any animal you meet to see the world from new perspectives and chase your destiny in the exploration adventure Lost Ember."}, {"name": "A Knight's Quest", "details_link": "https://www.metacritic.com/game/xbox-one/a-knights-quest", "publisher": "Curve Digital", "release_date": "Oct 11 2019", "developers": ["Sky9"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 62, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/16e5aacec77ceddc29b4bdfb53935859-98.jpg", "descriptions": "A gorgeous action adventure on an epic scale. Play as Rusty, a clumsy adventurer who accidentally sets about the end of the world. Solve mind-bending puzzles, fight challenging enemies, defeat huge bosses and platform your way through a fantastic open world."}, {"name": "The Coma: Recut", "details_link": "https://www.metacritic.com/game/switch/the-coma-recut", "publisher": "Digerati Distribution", "release_date": "Dec 21 2017", "developers": ["Devespresso Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/c47b31ab8431c896f206824d41a3c814-98.jpg", "descriptions": "The Coma: Recut is a Korean survival horror. You are Youngho, a hapless Korean student who, after drifting asleep during his final exam, wakes to find himself trapped in a twisted version of his school, Sehwa High. And he's not alone. Relentlessly pursued by a psychotic killer, Youngho mustThe Coma: Recut is a Korean survival horror. You are Youngho, a hapless Korean student who, after drifting asleep during his final exam, wakes to find himself trapped in a twisted version of his school, Sehwa High. And he's not alone. Relentlessly pursued by a psychotic killer, Youngho must evade his hunter while desperately searching for a way to escape the dread-filled corridors and classrooms.FEATURES:* A remastered version of indie cult classic The Coma: Cutting Class, the game has been rebalanced and 'recut' with new and updated animations, mechanics, cutscenes and art.* Hide: Crouch in the darkness or cower in a closet to stay out of sight and evade the killer.* Survive: Use your flashlight to search for useful items, but be warned - it can attract unwanted attention.* Mystery: Discover notes and clues to uncover the twisted history of Sehwa High's students and teachers.* Death: Beware the horrors lurking in the dark, lest you bleed out in some forgotten classroom.* The cast of characters and creepy corridors of Sehwa High are brought to life in a hand illustrated manhwa art style.* Inspired by the real-world plight of Korea's overworked high school students.… Expand"}, {"name": "Silent Hunter 5: Battle of the Atlantic", "details_link": "https://www.metacritic.com/game/pc/silent-hunter-5-battle-of-the-atlantic", "publisher": "Ubisoft", "release_date": "Mar  2 2010", "developers": ["Ubisoft Romania"], "platforms": "PC", "genres": ["Simulation", "Submarine", "Submarine", "Marine", "Combat"], "meta_score": 62, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/2/bcb734392543e777ecada9e4962bb601-98.jpg", "descriptions": "Silent Hunter 5 ventures into uncharted territory and takes players behind the periscope of a German U-boat to take on the Allied Forces in famous battles across the vast Atlantic Ocean and Mediterranean Sea.  For the first time in the history of the series, players can live the life of aSilent Hunter 5 ventures into uncharted territory and takes players behind the periscope of a German U-boat to take on the Allied Forces in famous battles across the vast Atlantic Ocean and Mediterranean Sea.  For the first time in the history of the series, players can live the life of a submarine captain from a first-person view and lead a crew in a critical campaign. VIEW AS A CAPTAIN: Walk through highly detailed submarines in the new first-person view and access every part of your U-boat. BECOME A REAL LEADER: Interact with your crew, watch them perform their daily jobs and experience the tension and fear inside the U-boat through the new advanced order system. WAR STRATEGIES: Choose your own strategy and select your targets with a new objective-driven, dynamic campaign. ENEMY REACTIONS: Open new locations, upgrades and resupply possibilities, while the Allied ships adjust dynamically to your approach. Your actions will directly impact the evolution of the campaign. NEW USER INTERFACE: Prowl the waters with a brand-new user interface. Now, every beginner can successfully command a sub while remaining free of confusion. In expert mode, experienced players will be provided all the necessary information and controls to command the sub completely on their own. CINEMATIC EXPERIENCE: Experience the most realistic and immersive Silent Hunter ever created. Improved environment graphics create a powerful level of immersion as you operate authentic, highly detailed U-boats and fight against surface ships. [Ubisoft]… Expand"}, {"name": "XIII Century: Death or Glory", "details_link": "https://www.metacritic.com/game/pc/xiii-century-death-or-glory", "publisher": "Atari", "release_date": "Mar 12 2008", "developers": ["Unicorn Games Studio"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/132ad64093f3880b3c9c4b97720a5453-98.jpg", "descriptions": "XIII Century is a real-time strategy game driven by an epic storyline torn from the pages of history. Players control European kings and dukes, Russian princes and boyars, and Mongolian khans and noyons. XIII Century features large-scale battles with thousands of soldiers clashing onXIII Century is a real-time strategy game driven by an epic storyline torn from the pages of history. Players control European kings and dukes, Russian princes and boyars, and Mongolian khans and noyons. XIII Century features large-scale battles with thousands of soldiers clashing on detailed, realistic battlefields. This historical simulation recreates actual conditions of these glorious battles, taking into account the effects of terrain and weather. Wage war through 30 battles across 5 campaigns for the nations of England, France, Mongolia, Germany, and Kievan Rus' (Russia). Recreate great battles that changed the course of medieval history, including the battle of Bouvines (July 27, 1214), the battle of Falkirk (July 22, 1298), the battle of Las Navas de Tolosa (July 16, 1212), and the battle on Lake Peipus (April 5, 1242). Many of the conflicts in XIII Century have never been featured in any PC game before, including the battle of Gelheim (July 2, 1298), battle of Taillebourg (July 22, 1242), and the siege of the stronghold Salvatierra (1211). [GamersGate]… Expand"}, {"name": "Chrome SpecForce", "details_link": "https://www.metacritic.com/game/pc/chrome-specforce", "publisher": "TopWare Interactive", "release_date": "Nov 30 2005", "developers": ["Techland"], "platforms": "PC", "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/23118215b6af89ac5f44d151f93e040e-98.jpg", "descriptions": "Chrome SpecForce, are an elite strike force unit of the FEC (Federal Expeditionary Corps), created with one sole purpose, to rid the planetary system of global hazards and crisis situations that endanger the Federation’s stability, or directly violate federal order. This elite strike forceChrome SpecForce, are an elite strike force unit of the FEC (Federal Expeditionary Corps), created with one sole purpose, to rid the planetary system of global hazards and crisis situations that endanger the Federation’s stability, or directly violate federal order. This elite strike force must undertake top secret missions such as high profile target assassination, espionage, infiltration and sabotage of enemy territory. Armed with the most up to date combat equipment, the SpecForce field agents are equipped with SPA4 Power Armour, along with various weaponry depending on their mission objectives. [Deep Silver]… Expand"}, {"name": "Necromunda: Hired Gun", "details_link": "https://www.metacritic.com/game/pc/necromunda-hired-gun", "publisher": "Focus Home Interactive", "release_date": "Jun  1 2021", "developers": ["Streum On Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Turn-Based", "Shooter", "First-Person", "Tactics", "Arcade"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/d9d0dcc06a7403e123ea245e92107e11-98.jpg", "descriptions": "Pick your contracts. Hunt your targets. Collect the bounty. Navigate an ocean of crime and corruption to balance the bloody ecosystem of Necromunda as a merciless hired gun. The money's good, the dog's loyal, and the gun's reliable but can you survive the hunt? Necromunda: Hired Gun is aPick your contracts. Hunt your targets. Collect the bounty. Navigate an ocean of crime and corruption to balance the bloody ecosystem of Necromunda as a merciless hired gun. The money's good, the dog's loyal, and the gun's reliable but can you survive the hunt? Necromunda: Hired Gun is a fast paced, violent, and thrilling FPS set in the darkest reaches of Warhammer 40,000's most infamous hive city. For the right price, eliminate the most notorious gangers and mutants. Your armory is a sprawling arsenal. Your body is enhanced with a dozen customizable augments to run on walls and leap over chasms. Your cyber mastiff will sniff out and eliminate enemies for you, while your grappling hook allows quick, agile traversal of the massive environments.… Expand"}, {"name": "Monster House", "details_link": "https://www.metacritic.com/game/ds/monster-house", "publisher": "THQ", "release_date": "Jul 18 2006", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "DS"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/833a4765ccba734dc03a9b7299aaea90-98.jpg", "descriptions": "Do you have what it takes to save the neighborhood? The Monster House allows players to experience key moments of the movie as they uncover the mysteries of the house in order to save their neighborhood. Players also take on unique adventures that were inspired by the film. With threeDo you have what it takes to save the neighborhood? The Monster House allows players to experience key moments of the movie as they uncover the mysteries of the house in order to save their neighborhood. Players also take on unique adventures that were inspired by the film. With three playable characters, fans of the film enjoy seeing the movie come to life in their living rooms. Explore a living, breathing house full of traps and mystery. Use water blasters to battle creatures created from a combination of different household objects. Spooky surprises and unexpected random events keep players constantly on their guard. Play \"Thou art dead\", the 2D arcade game that appears in the movie. [THQ]… Expand"}, {"name": "Mario Pinball Land", "details_link": "https://www.metacritic.com/game/game-boy-advance/mario-pinball-land", "publisher": "Nintendo", "release_date": "Oct  4 2004", "developers": ["Fuse Games Limited"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Miscellaneous", "Parlor", "Pinball"], "meta_score": 62, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/1086221224a8248af54483d98caa163b-98.jpg", "descriptions": "Jumping has always helped Mario perform heroic feats, but in Mario Pinball Land, the plumber must learn how to roll to rescue the princess. When Bowser kidnaps Peach and escapes to another dimension, a scientist transforms Mario into a ball to chase after the fiend. Now you must use yourJumping has always helped Mario perform heroic feats, but in Mario Pinball Land, the plumber must learn how to roll to rescue the princess. When Bowser kidnaps Peach and escapes to another dimension, a scientist transforms Mario into a ball to chase after the fiend. Now you must use your flippers to shoot a much rounder Mario into doors that lead to new areas. In his new form, Mario is also useful for knocking down enemies, picking up special bonuses, and finding power-ups.… Expand"}, {"name": "Odama", "details_link": "https://www.metacritic.com/game/gamecube/odama", "publisher": "Nintendo", "release_date": "Apr 10 2006", "developers": ["Vivarium"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Miscellaneous", "Parlor", "Pinball"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/13d544eb9174789d47923e520ebe0891-98.jpg", "descriptions": "Mix all the intensity of classic pinball with the sights, sounds, and savagery of war and what do you get? Odama -- the first pinball game that throws you into the midst of mighty clashes between armies on boards laid out like chaotic battlefields. Use the flippers to send Odama -- the giantMix all the intensity of classic pinball with the sights, sounds, and savagery of war and what do you get? Odama -- the first pinball game that throws you into the midst of mighty clashes between armies on boards laid out like chaotic battlefields. Use the flippers to send Odama -- the giant pinball -- to destroy the enemy's barracks and turrets. Hit enemy soldiers with the ball to make them join your ranks, dam rivers, liberate extra flippers, and clear the way to the enemy's gate.… Expand"}, {"name": "Chimparty", "details_link": "https://www.metacritic.com/game/playstation-4/chimparty", "publisher": "Sony Interactive Entertainment", "release_date": "Nov 13 2018", "developers": ["NapNok Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/83390c0f642598087d67e1c30e1c233d-98.jpg", "descriptions": "Grab your smart device and stake your claim as a jungle VIP in this multiplayer PlayLink game, where up to four players can battle it out across 18 wacky mini-games, with 90 levels between them.It doesn't matter whether you're new to gaming or the King Kong player among friends and family,Grab your smart device and stake your claim as a jungle VIP in this multiplayer PlayLink game, where up to four players can battle it out across 18 wacky mini-games, with 90 levels between them.It doesn't matter whether you're new to gaming or the King Kong player among friends and family, there's something for everyone here, from flinging your chimp into a hoop, to escaping your rivals in a manic tag contest.FEATURES:* Easy-to-learn gameplay -- Using your smart device as a controller, each mini-game is accessible and intuitive. Simply use one on-screen button with skill and timing, to jump, float, run, paint and more.* Enjoy five different themes -- Play across a prehistoric jungle, haunted castle, pirate harbour, alien landscape and wizard's manor, with changes in gravity, shape-changing antics and interactive elements to watch out for.* Customise your chimp champ -- Give your cheeky monkey the look of a winner, with selectable headgear, accessories and shoes, with the chance to unlock more as you play. And all your customisations and progress stays on the Chimparty app, no matter which PS4 you play on.… Expand"}, {"name": "PowerUp Forever", "details_link": "https://www.metacritic.com/game/xbox-360/powerup-forever", "publisher": "Namco Bandai Games", "release_date": "Dec 10 2008", "developers": ["Blitz Arcade"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 62, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/a665c35d57b6dbbf67803bbab2fe686a-98.jpg", "descriptions": "[Xbox Live Arcade]  Procedurally Generated Environments - Never experience the same game twice as all of the enemy types and locations are procedurally generated. Innovative Growth Mechanic - Adds a unique twist to the shooter genre and offers fun, exciting gameplay. Power Up your weapons -[Xbox Live Arcade]  Procedurally Generated Environments - Never experience the same game twice as all of the enemy types and locations are procedurally generated. Innovative Growth Mechanic - Adds a unique twist to the shooter genre and offers fun, exciting gameplay. Power Up your weapons - Power up cool new weapons, such as lasers, shields and bombs, that boost your arsenal as you evolve. High Definition Graphics - True next-gen graphical effects and an exciting abstract art-style provide eye-popping visuals. Multiple modes of play. Survival Mode - Survive relentless waves of non-stop enemies. Guardian Rush Mode - Defeat a series of guardians in the shortest length of time. Defender - How long can you survive only using a shield? Overkill Mode - Unlimited weapons! [Namco Bandai Games]… Expand"}, {"name": "Disney's Meet the Robinsons", "details_link": "https://www.metacritic.com/game/wii/disneys-meet-the-robinsons", "publisher": "Buena Vista Games", "release_date": "Mar 27 2007", "developers": ["Buena Vista Games"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/88e50f8e0a76e0425f4dae482b3c531a-98.jpg", "descriptions": "What if you could change the past? What if you could control the future? What if time was on your side? Play as Wilbur Robinson and experience the thrills of time travel adventure.  With a ton of crazy gadgets at your disposal, battle enemies and solve puzzles while in pursuit of theWhat if you could change the past? What if you could control the future? What if time was on your side? Play as Wilbur Robinson and experience the thrills of time travel adventure.  With a ton of crazy gadgets at your disposal, battle enemies and solve puzzles while in pursuit of the dastardly Bowler Hat Guy and his diabolical robotic hat, Doris. It's up to you to thward their evil plans and save the future! Explore ancient Egypt, the Robinsons' mansion, The Hive and other supercool locales. Break out the Charge Glove, the Disassembler, the Scanner, the family Album, the Havoc Gloves and the Leviathon device. [Buena Vista Games]… Expand"}, {"name": "Silverfall", "details_link": "https://www.metacritic.com/game/pc/silverfall", "publisher": "Atari", "release_date": "Mar 20 2007", "developers": ["Monte Cristo Multimedia", "Monte Cristo"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/6db59da5e715609e4a7be56d08dfbf36-98.jpg", "descriptions": "Set in a world of fantasy dominated by the great, opposing powers of technology and nature, Silverfall gamers must choose between these forces in order to conquer all forthcoming quests and save the principal city from falling. Two companions will accompany them on their journey through theSet in a world of fantasy dominated by the great, opposing powers of technology and nature, Silverfall gamers must choose between these forces in order to conquer all forthcoming quests and save the principal city from falling. Two companions will accompany them on their journey through the fascinating world of Nelwë. Decision-making is key throughout the game, as players’ choices impact both storyline and accumulation of skills. Features a vast, open fantasy universe offering complete freedom, from the flying zeppelin city of Cloudworks to the mage volcano of Brazer. 150+ creatures and bosses. Ability to create your own character from a choice of four races and release your inner beast by transforming into a fearsome, flesh rending were-beast. Capability of building your team of two from a choice of eight companions. Each of them has their own story, background, abilities and can endow you with quests. The way you treat them will alter their loyalties – they can become your friend for life or even a lover. Manage your character's evolution by choosing from 130+ skills and spells. Create precisely the character you want to play and adapt it to your style of play. Two multiplayer modes – the first allows the player to connect to any party, compose their team and play in co-op or PVP (up to eight players); the second sees the player compose a team at the beginning and play through the entire story together. [Atari]… Expand"}, {"name": "Mato Anomalies", "details_link": "https://www.metacritic.com/game/playstation-5/mato-anomalies", "publisher": "Prime Matter", "release_date": "Mar 10 2023", "developers": ["Arrowiz"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/6179255e654bc25636b29afeba7ee84e-98.jpg", "descriptions": "Mato Anomalies is a turn-based RPG that takes players on a journey across Mato, a fantasized neo-futuristic version of a bygone oriental city. Take control of the Dual Protagonists Doe and Gram to investigate strange anomalies around the city, or venture into rifts to battle demonicMato Anomalies is a turn-based RPG that takes players on a journey across Mato, a fantasized neo-futuristic version of a bygone oriental city. Take control of the Dual Protagonists Doe and Gram to investigate strange anomalies around the city, or venture into rifts to battle demonic abominations determined to bring about the city's downfall.Team up with unlikely companions and unravel the dark secrets in this story of Duty, Hope and Justice.… Expand"}, {"name": "Override: Mech City Brawl", "details_link": "https://www.metacritic.com/game/switch/override-mech-city-brawl", "publisher": "Modus Games", "release_date": "Oct 15 2019", "developers": ["Modus Studios Brazil"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/5256040b88d66721ea694490c78586a0-98.jpg", "descriptions": "No gears, no glory! Control gigantic fighting robots and duke it out across fantastic cityscapes in this 3D mech-based brawler! Epic and explosive battles await with anime-inspired mechs in local and online versus game modes, party co-op with two to four players, and a single-player campaign."}, {"name": "Giga Wrecker Alt.", "details_link": "https://www.metacritic.com/game/xbox-one/giga-wrecker-alt", "publisher": "Rising Star Games", "release_date": "May  2 2019", "developers": ["Game Freak"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/e44d311f538aa4db3c20da3f853b7bf4-98.jpg", "descriptions": "From legendary developer Game Freak. In the near future, where Earth has been ravaged by robot invaders, the fate of the planet rests on the shoulders of a young girl who becomes more than human. Saved from death and cursed with cybernetic powers beyond comprehension, it's up to ReikoFrom legendary developer Game Freak. In the near future, where Earth has been ravaged by robot invaders, the fate of the planet rests on the shoulders of a young girl who becomes more than human. Saved from death and cursed with cybernetic powers beyond comprehension, it's up to Reiko Rekkeiji to save humanity from the evil Ajeet!… Expand"}, {"name": "Blind", "details_link": "https://www.metacritic.com/game/playstation-4/blind", "publisher": "Surprise Attack", "release_date": "Sep 18 2018", "developers": ["Tiny Bull Studios"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 62, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/8bbd8f10bddd93b2591d84dcb0a641dd-98.jpg", "descriptions": "Blind is a narrative-driven psychological thriller for virtual reality where the player is blind and must explore their surroundings using echolocation."}, {"name": "The Infectious Madness of Doctor Dekker", "details_link": "https://www.metacritic.com/game/playstation-4/the-infectious-madness-of-doctor-dekker", "publisher": "Wales Interactive", "release_date": "Jun  5 2018", "developers": ["D'Avekki Studios Limited"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 62, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/0/89bda19bf7d19666560fe6730c4ec122-98.jpg", "descriptions": "Assume the role of a psychiatrist trying to solve a murder whilst treating the unusual patients of the recently deceased Doctor Dekker. Ask any questions and collect the evidence as you uncover the identity of the randomly generated murderer whilst trying to figure out the chaos that wasAssume the role of a psychiatrist trying to solve a murder whilst treating the unusual patients of the recently deceased Doctor Dekker. Ask any questions and collect the evidence as you uncover the identity of the randomly generated murderer whilst trying to figure out the chaos that was left behind.… Expand"}, {"name": "Moco Moco Friends", "details_link": "https://www.metacritic.com/game/3ds/moco-moco-friends", "publisher": "Aksys Games", "release_date": "Nov 17 2015", "developers": ["Racjin", "Nippon Columbia"], "platforms": "3DS", "genres": ["Role-Playing", "General", "Trainer"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/a35f4f97775c54f9bc1434a1ad9c6fab-98.jpg", "descriptions": "Join apprentice witch Moco and her friends on a journey of friendship, excitement, and adventure!\r Moco Moco Friends is an exciting twist on the adventure RPG genre. Build your skills and amass loads of cuddly monsters to become the ultimate Plushkin Master! Battle against your rivals,Join apprentice witch Moco and her friends on a journey of friendship, excitement, and adventure!\r Moco Moco Friends is an exciting twist on the adventure RPG genre. Build your skills and amass loads of cuddly monsters to become the ultimate Plushkin Master! Battle against your rivals, scavenge items, venture through massive dungeons, evolve your Plushkin monsters, and travel with your companions across the magical realm of Dreamtopia!… Expand"}, {"name": "Kane & Lynch 2: Dog Days", "details_link": "https://www.metacritic.com/game/playstation-3/kane-lynch-2-dog-days", "publisher": "Square Enix", "release_date": "Aug 17 2010", "developers": ["Io Interactive"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 62, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/54c6d5da428dcd22eef63aae56c07ccb-98.jpg", "descriptions": "Kane & Lynch 2: Dog Days is a raw and brutal crime shooter designed to take players on an even more intense story experience, following two of gaming's most disturbed criminals, through the gritty Shanghai underworld."}, {"name": "TNA iMPACT!", "details_link": "https://www.metacritic.com/game/xbox-360/tna-impact!", "publisher": "Midway", "release_date": "Sep  9 2008", "developers": ["Midway Studios - Los Angeles"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/0f3cccae85bee7daec78cec73c7e732d-98.jpg", "descriptions": "TNA iMPACT! is geared towards a quick paced, high-impact style of play, with less emphasis on submission moves. It also features straightforward, intuitive controls, with \"accurate\" and \"detailed\" character models. Actual scans of the wrestlers were used for the game in place of hand-paintedTNA iMPACT! is geared towards a quick paced, high-impact style of play, with less emphasis on submission moves. It also features straightforward, intuitive controls, with \"accurate\" and \"detailed\" character models. Actual scans of the wrestlers were used for the game in place of hand-painted textures to include small details, such as skin textures. Wrestling maneuvers are captured from actual TNA wrestlers in extensive motion capture sessions. Finishers are accessed by building up an \"Impact! meter\" displayed on the screen, the same place a color-coded damage indicator shows the condition of characters. The game also features mini-games for escaping pin attempts and submission holds. TNA's exclusive Ultimate X and King of the Mountain are playable match types alongside the more standard singles, tag team and Fatal Four-Way matches. The game is playable online, and supports tournaments. Eight different venues—including TNA's main home, the Florida Impact! Zone, and arenas in Japan and England—are be available to house matches, with the Impact! Zone having an increased ringside area for play and hotspots for player interaction. The game also features top wrestling talent such as Abyss, Kurt Angle, Christian Cage, Jeff Jarrett, Booker T, Samoa Joe, AJ Styles, Sting and more to deliver all of the excitement and action of the television show. [Midway]… Expand"}, {"name": "Dangerous Driving", "details_link": "https://www.metacritic.com/game/playstation-4/dangerous-driving", "publisher": "Maximum Games", "release_date": "Apr  9 2019", "developers": ["Three Fields Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 62, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/8/901346762a1b8bfed839f02a630dcbe6-98.jpg", "descriptions": "From the creative talent behind the genre-defining Burnout series, Dangerous Driving puts aggression back into the racing genre, recapturing the spirit of the past and taking it to a new place. Dangerous Driving is a game about real driving. The sort of driving you want to do when no oneFrom the creative talent behind the genre-defining Burnout series, Dangerous Driving puts aggression back into the racing genre, recapturing the spirit of the past and taking it to a new place. Dangerous Driving is a game about real driving. The sort of driving you want to do when no one else is looking. The sort of driving you’d love to do if only everyone else would get OUT OF THE DAMN WAY! This game gives you the chance to live out that fantasy. To floor it in everyday cars, at high speeds, weaving in and out of traffic and slamming the other cars right off the road. This is a game built in the spirit of the classic arcade racing games of the 80’s and 90’s. It’s about speed, driving skill and beautiful powerslides around epic corners. It’s also about all out aggression, instant retaliation and sweet, sweet revenge. The more dangerously you drive, the faster you can go.… Expand"}, {"name": "Scooby-Doo! Unmasked", "details_link": "https://www.metacritic.com/game/xbox/scooby-doo!-unmasked", "publisher": "THQ", "release_date": "Sep 12 2005", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/7572a45a58ad8495142216fe1d1a631e-98.jpg", "descriptions": "In this action adventure platform game, players assume the role of Scooby-Doo as he and the teenage sleuths of Mystery Inc. visit Fred's cousin Jed, a monster movie set designer. They find Jed has disappeared and his animatronics are out of control, sending mechanical monsters haywire andIn this action adventure platform game, players assume the role of Scooby-Doo as he and the teenage sleuths of Mystery Inc. visit Fred's cousin Jed, a monster movie set designer. They find Jed has disappeared and his animatronics are out of control, sending mechanical monsters haywire and making Jed the prime suspect. Players must stop the creepy costumed characters, unmask the truth and prove Jed's innocence. Scooby is able to don Kung Fu, bat and archer costumes so that he can karate chop, glide and aim plungers at monsters. The game consists of three sprawling worlds that each feature multiple levels and mini games with numerous cut scenes and climactic boss battles. Players recognize will the voice of the original Batman television series' Adam West as Winslow Stanton, the game's main villain, as well as authentic Scooby-Doo! cartoon voice actors. In addition, effects from the original cartoon, such as canned laughter and classic catch phrases, have been incorporated into the game.… Expand"}, {"name": "Gas Guzzlers Extreme", "details_link": "https://www.metacritic.com/game/xbox-one/gas-guzzlers-extreme", "publisher": "Iceberg Interactive", "release_date": "Nov  4 2016", "developers": ["Iceberg Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/693196604c5e4e917a25732f350bf1e2-98.jpg", "descriptions": "Gas Guzzlers Extreme is an action-packed, fast paced racing game with insane combat features. The game features a variety of cars, from humble superminis, to full on giant yank tanks! The player starts with a low performance vehicle and gradually works their way up by earning money through aGas Guzzlers Extreme is an action-packed, fast paced racing game with insane combat features. The game features a variety of cars, from humble superminis, to full on giant yank tanks! The player starts with a low performance vehicle and gradually works their way up by earning money through a series of uniquely challenging races.… Expand"}, {"name": "WireWay", "details_link": "https://www.metacritic.com/game/ds/wireway", "publisher": "Konami", "release_date": "Nov  3 2009", "developers": ["Konami", "Now Production"], "platforms": ["iPhone/iPad", "DS"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/91381a9eaba16b5fe3899cd6666cf530-98.jpg", "descriptions": "WireWay is an interactive action puzzle game that introduces a loveable, yet troublesome alien who has been dropped off by his ship and travels the planet jumping through wacky adventures. The player must take full advantage of DS' unique touch-screen and online capabilities to flick, rub,WireWay is an interactive action puzzle game that introduces a loveable, yet troublesome alien who has been dropped off by his ship and travels the planet jumping through wacky adventures. The player must take full advantage of DS' unique touch-screen and online capabilities to flick, rub, and draw as he helps the alien navigate through 60 interactive, pulse-pounding levels. Additionally, the game features wireless gameplay, the ability to create stages, and much more. In WireWay players utilize the touch-screen capabilities as they avoid dangerous obstacles - including falling rocks, eerie skulls, and spiky floors -- while they flick the alien with the wire using the stylus, rub the screen to create wind, and draw wires to assist the alien. As they break walls, open new paths, and collect stars to power up, players have as much time as they need to avoid the enemies and help the alien find his way home. Additionally, gamers can challenge up to four players wirelessly for an intense multiplayer race using the local wireless feature. [Konami]… Expand"}, {"name": "Kao the Kangaroo Round 2", "details_link": "https://www.metacritic.com/game/xbox/kao-the-kangaroo-round-2", "publisher": "Atari", "release_date": "Mar 21 2006", "developers": ["Tate Interactive"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Kao the kangaroo is on the run - he has to stop the evil hunter Barnaba, who has captured most of his friends. Starting deep in the forests of the beavers, your journey will bring you to fascinating locations like the thunder mountain, the sea land and even the lost treasure island. Lots ofKao the kangaroo is on the run - he has to stop the evil hunter Barnaba, who has captured most of his friends. Starting deep in the forests of the beavers, your journey will bring you to fascinating locations like the thunder mountain, the sea land and even the lost treasure island. Lots of adventures are waiting - use a snowboard to cross the frozen \"gap of no return\", win a breath-taking speed boat race and fly on the back of your pelican friend across the sea until you reach the legendary treasure island and the hideout of Barnaba.… Expand"}, {"name": "Digimon Racing", "details_link": "https://www.metacritic.com/game/game-boy-advance/digimon-racing", "publisher": "Bandai", "release_date": "Sep 13 2004", "developers": ["Griptonite Games"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/886aa02727f625961a069e8da109d85e-98.jpg", "descriptions": "If you thought Digimon didn't drive cars, you're wrong. In Digimon Racing, the Digimon crew just got their first set of wheels, and they're ready to tear up more than 15 tracks. As your favorite Digimon character from the animated TV series, you'll drive a kart through lava fields, jungles,If you thought Digimon didn't drive cars, you're wrong. In Digimon Racing, the Digimon crew just got their first set of wheels, and they're ready to tear up more than 15 tracks. As your favorite Digimon character from the animated TV series, you'll drive a kart through lava fields, jungles, and cities in a variety of game modes, including Single Race, Cup Race, Boss Challenges, and Time Trial. Link Game Boy Advance systems with a Game Link Cable for head-to-head action for up to four players.… Expand"}, {"name": "Pro Fishing Challenge", "details_link": "https://www.metacritic.com/game/xbox/pro-fishing-challenge", "publisher": "Atlus Co.", "release_date": "Aug 31 2004", "developers": ["Opus"], "platforms": "Xbox", "num_players": "8  Online", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 62, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/5a5b13d3dad97f2e32ecabc65e9d5ba9-98.jpg", "descriptions": "Cast your line, set your hook, and prepare for a realistic fishing simulation for the Xbox. Pro Fishing Challenge re-creates all the excitement and tension of fishing with four expansive lakes, simulated fish ecology, and variable environmental effects. Participate in a variety of TournamentCast your line, set your hook, and prepare for a realistic fishing simulation for the Xbox. Pro Fishing Challenge re-creates all the excitement and tension of fishing with four expansive lakes, simulated fish ecology, and variable environmental effects. Participate in a variety of Tournament modes and earn money to buy the latest tackle and equipment, including rods, lines, reels, and lures. With Xbox Live, you can challenge the best anglers around the world over the Internet.… Expand"}, {"name": "ESPN International Winter Sports 2002", "details_link": "https://www.metacritic.com/game/xbox/espn-international-winter-sports-2002", "publisher": "Konami", "release_date": "Feb 28 2002", "developers": ["Konami"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Olympic Sports"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/702484ab32a4d56e4c8e9eb3bfd5a07d-98.jpg", "descriptions": "Experience the intensity of international winter competition by Konami, the makers of the classic Track & Field series. With greater variety and more events than any other winter sports game, International Winter Sports 2002 is like getting ten games in one!"}, {"name": "WWF Road to Wrestlemania", "details_link": "https://www.metacritic.com/game/game-boy-advance/wwf-road-to-wrestlemania", "publisher": "THQ", "release_date": "Nov 18 2001", "developers": ["Natsume"], "platforms": "Game Boy Advance", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/1b0d8866b59ddb64c1fd4b44b6d25b5d-98.jpg", "descriptions": "For those who can overlook a little lack of polish, WWF: Road to Wrestlemania is an excellent addition to the wrestling enthusiast's game library."}, {"name": "Hood: Outlaws & Legends", "details_link": "https://www.metacritic.com/game/xbox-series-x/hood-outlaws-legends", "publisher": "Focus Home Interactive", "release_date": "May  7 2021", "developers": ["Sumo Newcastle"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "General"], "meta_score": 62, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/336096e08c77ce0c9564a3c06ed90111-98.jpg", "descriptions": "In a violent, medieval world, outplay rival gangs in intense PvPvE multiplayer heists. Moving in stealth to steal treasures unseen or dominating through loud and brutal combat, only the best will escape with hard-earned riches."}, {"name": "NEON STRUCT", "details_link": "https://www.metacritic.com/game/pc/neon-struct", "publisher": "Minor Key Games", "release_date": "May 20 2015", "developers": ["Minor Key Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/817e36a9fd493bed4c4f2abd991c7d4c-98.jpg", "descriptions": "Assume the role of Jillian Cleary: an ex-spy on the run, framed for treason and hunted by your former agency. You must move in secret, survive off the grid, and find a way to clear your name. Old friends and new allies will lend their support; but with the eyes of the world upon you, who canAssume the role of Jillian Cleary: an ex-spy on the run, framed for treason and hunted by your former agency. You must move in secret, survive off the grid, and find a way to clear your name. Old friends and new allies will lend their support; but with the eyes of the world upon you, who can you trust? … Expand"}, {"name": "Sonic Boom: Fire & Ice", "details_link": "https://www.metacritic.com/game/3ds/sonic-boom-fire-ice", "publisher": "Sega", "release_date": "Sep 27 2016", "developers": ["Sanzaru Games"], "platforms": "3DS", "genres": ["Action", "Platformer", "2D", "3D"], "meta_score": 62, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/6e728ef30867c99f84a5ac88d139fd55-98.jpg", "descriptions": "Sonic the Hedgehog is racing once again in Sonic Boom: Fire & Ice as the game introduces more adventure, speed, exploration, and an all-new fire and ice gameplay element that will help propel the action. The game also features the return of Sonic, Tails, Knuckles, Amy and Sticks. DevelopedSonic the Hedgehog is racing once again in Sonic Boom: Fire & Ice as the game introduces more adventure, speed, exploration, and an all-new fire and ice gameplay element that will help propel the action. The game also features the return of Sonic, Tails, Knuckles, Amy and Sticks. Developed by Sanzaru Games Inc., Sonic Boom: Fire & Ice is a single-player game with collaborative gameplay components that shares key characters, events and lore of the Sonic Boom universe. Players see Sonic and his friends in familiar settings as they embark on a brand new adventure to battle Dr. Eggman as well as an all-new super villain, D-Fekt. The team’s adventures brings them to locations both familiar and new as they explore, race and protect their world. To create an entirely new experience, Sonic Boom: Fire & Ice infuses fire and ice elements throughout gameplay, enabling new abilities to play out in special character moves and interactions with environments. The new title also delivers gameplay that enables players to run through the game at top speed, or take their time with deeper exploration and puzzle play. New to the title is the introduction of Bot Racing, a supplemental game tied to the single-player story that features multiplayer gameplay. The new Bot Racing feature is an extension of Sonic Boom: Fire & Ice that is purely about racing and speed, where a user unlocks character-themed Bots to challenge friends on fast courses or tracks. [Nintendo UK]… Expand"}, {"name": "Pokemon Mystery Dungeon: Blue Rescue Team", "details_link": "https://www.metacritic.com/game/ds/pokemon-mystery-dungeon-blue-rescue-team", "publisher": "Nintendo", "release_date": "Sep 18 2006", "developers": ["ChunSoft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Roguelike"], "meta_score": 62, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/08bcfab56669b710c1fa88164fbf1ad3-98.jpg", "descriptions": "For the first time ever, the player is a Pokémon, speaking and interacting with other characters in a world populated only by Pokémon! Features a deep, involving and dramatic story brings the player into a world of Pokémon not seen or experienced before. Strategic battles enhance theFor the first time ever, the player is a Pokémon, speaking and interacting with other characters in a world populated only by Pokémon! Features a deep, involving and dramatic story brings the player into a world of Pokémon not seen or experienced before. Strategic battles enhance the adventure. Randomly generated dungeons make every mission unique. One day the player awakens to find that he or she has been turned into a Pokémon. The land is being ravaged by natural disasters so the player decides to form a rescue team with a partner Pokémon. The player can interact with many different Pokémon on various missions while trying to uncover their true purpose and destiny. An engrossing story of adventure, redemption and, most of all, friendship. [Nintendo]… Expand"}, {"name": "Aedis Eclipse: Generation of Chaos", "details_link": "https://www.metacritic.com/game/psp/aedis-eclipse-generation-of-chaos", "publisher": "NIS America", "release_date": "Apr 24 2007", "developers": ["Neverland", "Idea Factory"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General", "Fantasy"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/fd988eda883734cadccce0e4078281ac-98.jpg", "descriptions": "The unique gaming experience offered by Aedis Eclipse comes from the combination of team customization and item crafting on one hand, to the dynamic combat multi-unit battle system, on the other. The PSP format allows gamers to briefly pick up their hand-held to enjoy strategic thinkingThe unique gaming experience offered by Aedis Eclipse comes from the combination of team customization and item crafting on one hand, to the dynamic combat multi-unit battle system, on the other. The PSP format allows gamers to briefly pick up their hand-held to enjoy strategic thinking anytime, anywhere. The world of Aedis Eclipse is divided into three worlds, the divine, upper, and lower. Each world has their own main character and story; therefore, players can experience three different stories at once. Depending on which world the player begins with, the difficulty level will differ. The lower world is regarded as the beginner’s stage with many tutorials to guide the player through the game. The higher the world you choose to play with, the more difficult it becomes. DIVINE WORLD: In a world where angels and demons lived together in peace, tragedy strikes as the king of demons is assassinated by a radical group of angels. Now, a war has broken out between the two factions and you must stop them from destroying the world. UPPER WORLD: A young knight has arrived in a kingdom ruled by a ruthless ruler. His fellow comrades have been captured by the royal army and you must rescue them before it is too late. LOWER WORLD: Another boring day of school is suddenly interrupted by a surprise bombardment. While most students flee for safety, you decide to watch the battle. In a bizarre turn of events, you are dragged into the bloody warfare. [NIS America]… Expand"}, {"name": "Mario Party 8", "details_link": "https://www.metacritic.com/game/wii/mario-party-8", "publisher": "Nintendo", "release_date": "May 29 2007", "developers": ["Hudson"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/9731e0983028b99cf10ee8e711351b46-98.jpg", "descriptions": "Play with motion control! Row your way down a river, punch a statue to pieces, steer race cars and mopeds, and handle a balancing pole while walking a tightrope. Play with the pointer. Drag and drop decorations onto cakes, shoot Boos in haunted house, quickly choose your answer in a gamePlay with motion control! Row your way down a river, punch a statue to pieces, steer race cars and mopeds, and handle a balancing pole while walking a tightrope. Play with the pointer. Drag and drop decorations onto cakes, shoot Boos in haunted house, quickly choose your answer in a game show. Mash those Wii Remote buttons. Jump and pummel your way through a football brawl, hop and run across an obstacle course of spinning platforms. Mario Party 8 includes six brand-new boards, dozens of minigames and many new modes. In a franchise first, you can collect special power-ups and transform your character into a boulder that smashes rivals or a coin-sucking vampire. Mario Party 8 includes \"extra-large\" minigames like Star Carnival Bowling and Table Menace. [Nintendo]… Expand"}, {"name": "Super Monkey Ball: Banana Blitz HD", "details_link": "https://www.metacritic.com/game/playstation-4/super-monkey-ball-banana-blitz-hd", "publisher": "Sega", "release_date": "Oct 29 2019", "developers": ["Sega", "Ryu ga Gotoku Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 62, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/14e8a31f847c237ec9de0f1682c2daf4-98.jpg", "descriptions": "\"Hold onto your bananas, because Super Monkey Ball: Banana Blitz HD is rolling your way! Experience the magic of one of the most beloved titles in the series, now remastered in HD!Head back into the fantastical world of Super Monkey Ball and take back your bananas from the space alien\"Hold onto your bananas, because Super Monkey Ball: Banana Blitz HD is rolling your way! Experience the magic of one of the most beloved titles in the series, now remastered in HD!Head back into the fantastical world of Super Monkey Ball and take back your bananas from the space alien pirate king, Captain Crabuchin. Race through over 100 colorful stages and challenge your friends and family to 10 fan-favorite Party Games! Feeling like the fastest, most maneuverable monkey around? Try out Time Attack mode or the grueling Decathlon endurance run! Will you make it onto the scoreboard?\"… Expand"}, {"name": "The Lost Child", "details_link": "https://www.metacritic.com/game/playstation-4/the-lost-child", "publisher": "NIS America", "release_date": "Jun 19 2018", "developers": ["Kadokawa"], "platforms": ["PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 62, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/9/1547b838517f1865d41088f9d4a29ef0-98.jpg", "descriptions": "Occult journalist Hayato Ibuki encounters a strange girl during his investigations into a series of mysterious suicides in Tokyo. She implores that Hayato must live, before bestowing upon him a mystical device that allows him to capture celestial and arcane creatures. He is now thrust into aOccult journalist Hayato Ibuki encounters a strange girl during his investigations into a series of mysterious suicides in Tokyo. She implores that Hayato must live, before bestowing upon him a mystical device that allows him to capture celestial and arcane creatures. He is now thrust into a world beyond our own, home to horrific monsters and celestial beings. In it, he must delve into dungeons called Layers and solve the mystery of the device. Where his journey leads him could decide the fate of our world...FEATURES:* Mythology Unbound -- Features 100+ astrals from myths and legends to capture, each with 3 unique forms to progress through.* Spread the Wealth of Knowledge -- There are more than 250+ skills to learn and distribute among your party of captured Astrals.* The Infinite Abyss Awaits -- Test yourself against massive dungeons with up to 99 floors of deadly dangers.… Expand"}, {"name": "Master Reboot", "details_link": "https://www.metacritic.com/game/playstation-3/master-reboot", "publisher": "Wales Interactive", "release_date": "Mar  4 2014", "developers": ["Wales Interactive"], "platforms": ["PC", "Wii U", "PlayStation 3"], "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/ea8c27c8465251ba78f730589afe0715-98.jpg", "descriptions": "Imagine a world where death is no longer final, where precious memories are saved to enjoy forever, where your soul is immortal, welcome to the Soul Cloud.\r Upload your soul to our dedicated servers and relax knowing that a part of you will live on, for eternity. That favourite holiday,Imagine a world where death is no longer final, where precious memories are saved to enjoy forever, where your soul is immortal, welcome to the Soul Cloud.\r Upload your soul to our dedicated servers and relax knowing that a part of you will live on, for eternity. That favourite holiday, happy moments from your childhood, meeting that special someone for the first time. All these memories saved for your digital soul and your family to revisit again and again.… Expand"}, {"name": "Angry Birds Trilogy", "details_link": "https://www.metacritic.com/game/3ds/angry-birds-trilogy", "publisher": "Activision", "release_date": "Sep 25 2012", "developers": ["Exient Entertainment"], "platforms": ["PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "3DS"], "genres": ["Action", "Miscellaneous", "General", "General", "Compilation"], "meta_score": 62, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/48ba2f4d138c516270ba44767089bec2-98.jpg", "descriptions": "Angry Birds Trilogy is a compilation of three blockbuster classics: Angry Birds, Angry Birds Seasons, and Angry Birds Rio."}, {"name": "Digimon World: Next Order", "details_link": "https://www.metacritic.com/game/switch/digimon-world-next-order", "publisher": "Bandai Namco Games", "release_date": "Feb 22 2023", "developers": ["Hyde", "B.B.Studio"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Trainer"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/0c68494642a16575c535c66b70d4fa8b-98.jpg", "descriptions": "The Digital World has run rampant with Machinedramon and is now in a state of utter chaos. As a Digidestined, it’s up to you to restore order to the world in Digimon World: Next Order, a monster-collecting RPG.\r Find and recruit as many faithful Digimon companions as possible to rebuildThe Digital World has run rampant with Machinedramon and is now in a state of utter chaos. As a Digidestined, it’s up to you to restore order to the world in Digimon World: Next Order, a monster-collecting RPG.\r Find and recruit as many faithful Digimon companions as possible to rebuild the Digital World. Will you be able to balance both training and exploration to stop the virus infected Digimon from causing complete destruction?… Expand"}, {"name": "Batman: Arkham Origins Blackgate - Deluxe Edition", "details_link": "https://www.metacritic.com/game/xbox-360/batman-arkham-origins-blackgate---deluxe-edition", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  1 2014", "developers": ["Armature Studio"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Fantasy", "", "Metroidvania"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/63efb0f247a11278e19113773ad86e48-98.jpg", "descriptions": "Batman: Arkham Origins Blackgate is a 2.5-D game developed by Armature Studio that brings the Batman Arkham experience for the first time to Nintendo and Sony handheld systems. A companion game to Batman: Arkham Origins, players can continue the storyline of the console version and discoverBatman: Arkham Origins Blackgate is a 2.5-D game developed by Armature Studio that brings the Batman Arkham experience for the first time to Nintendo and Sony handheld systems. A companion game to Batman: Arkham Origins, players can continue the storyline of the console version and discover more detalis of the Dark Knight's past.… Expand"}, {"name": "LEGO Batman 2: DC Super Heroes", "details_link": "https://www.metacritic.com/game/playstation-vita/lego-batman-2-dc-super-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 19 2012", "developers": ["TT Games"], "platforms": ["3DS", "PC", "PlayStation 3", "Wii U", "Xbox 360", "PlayStation Vita"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 62, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/1ab5701063f306c0a30367c45f530f0b-98.jpg", "descriptions": "Lego Batman 2: DC Super Heroes is a sequel to Lego Batman: The Videogame and includes appearances from the likes of Wonder Woman, Superman, and The Green Lantern."}, {"name": "Create", "details_link": "https://www.metacritic.com/game/wii/create", "publisher": "EA Games", "release_date": "Nov 16 2010", "developers": ["EA Bright Light"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/9a234aed557a40338a78d181639c0468-98.jpg", "descriptions": "The more players explore the game, solve level-based challenges, and customize their world, the more rewards will be unlocked. Creativity will be unleashed as players design environments with easy-to-use brushes and tools, including textures, props and animating objects that bring the sceneThe more players explore the game, solve level-based challenges, and customize their world, the more rewards will be unlocked. Creativity will be unleashed as players design environments with easy-to-use brushes and tools, including textures, props and animating objects that bring the scene to life. On the PlayStation 3, Xbox 360, PC, and MAC players can share any of their creations, solutions or challenges with the community through the console and also via the official Create website at www.create.ea.com. Friends can download and remix solutions and set challenges for other players to download and complete. Imaginations will run wild this holiday!… Expand"}, {"name": "Chantelise: A Tale of Two Sisters", "details_link": "https://www.metacritic.com/game/pc/chantelise-a-tale-of-two-sisters", "publisher": "Carpe Fulgur", "release_date": "Jul 29 2011", "developers": ["EasyGameStation"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/b41b26a6d8281bb340512015bcfb3781-98.jpg", "descriptions": "Five years ago, a witch's curse beneath the red moon turned Chante into a fairy. Now she and her sister Elise search for a way to transform her back into a human, and in their travels they come across a particular town, which is home to a number of nearby ruins, as well as a peculiarFive years ago, a witch's curse beneath the red moon turned Chante into a fairy. Now she and her sister Elise search for a way to transform her back into a human, and in their travels they come across a particular town, which is home to a number of nearby ruins, as well as a peculiar shopkeeper named Aira, and a strange, mercurial fortune-teller who calls herself Elma.… Expand"}, {"name": "The Falconeer", "details_link": "https://www.metacritic.com/game/xbox-one/the-falconeer", "publisher": "Wired Productions", "release_date": "Nov 10 2020", "developers": ["Tomas Sala"], "platforms": ["PC", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Combat"], "meta_score": 62, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/e8e5ae8f4838287b2fdd8119235c5a01-98.jpg", "descriptions": "Generations of poisonous decisions and treason swirl in the deep, as factions collide. Become the Falconeer and soar through the skies aboard a devastatingly powerful Warbird. Uncover secrets lost to the sea as you join or oppose different factions and clans scattered throughout The GreatGenerations of poisonous decisions and treason swirl in the deep, as factions collide. Become the Falconeer and soar through the skies aboard a devastatingly powerful Warbird. Uncover secrets lost to the sea as you join or oppose different factions and clans scattered throughout The Great Ursee. Take advantage of multiple Falconeer classes with individual stats, weapons and warbirds that can be upgraded through winning battles, completing quests, discovering secrets, or applying Mutagens or Chants. Use ocean thermals and energy to dive, dodge, barrel-roll, and twist to gain an advantage. The Falconeer is an open-world air combat game, featuring fast, brutal aerial dogfights and deep exploration of an incredible fantasy open-world set not only above the clouds, but also amongst the waves and down through the sunken, ocean depths.… Expand"}, {"name": "Romancing SaGa 2", "details_link": "https://www.metacritic.com/game/xbox-one/romancing-saga-2", "publisher": "Square Enix", "release_date": "Dec 15 2017", "developers": ["SquareSoft", "ArtePiazza"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 62, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/ce4dc4f9bad3c5434ac5c0ad54853615-98.jpg", "descriptions": "Romancing SaGa 2, originally released only in Japan in 1993, has been completely remastered and now receives its first ever official English translation!No two players will experience the story in the same way\n\nThe SaGa series is one of Square Enix's most beloved. The first three titlesRomancing SaGa 2, originally released only in Japan in 1993, has been completely remastered and now receives its first ever official English translation!No two players will experience the story in the same wayThe SaGa series is one of Square Enix's most beloved. The first three titles were originally branded overseas under the \"FINAL FANTASY LEGEND\" moniker , and garnered critical acclaim for their complex yet compelling combat system.Romancing SaGa 2 takes the varied gameplay of other entries in the series and combines it with an open-ended free-form scenario system whose story is as vast as the world in which it plays out. The player takes the role of a succession of emperors, painting the history of the world with each and every action.Familiar series hallmarks such as formations and glimmers make a return in this unique title.StoryIt all begins with the song of a lone bard in a bustling pub.Great nations such as the Varennes Empire, which had once ensured peace throughout the world, stagnated and atrophied over the course of centuries, and sinister forces started emerging in outlying areas.Ere long, peace spiraled into war and the common folk spoke in hushed words of the Seven Heroeshistorical figures who saved the world once and who, it was hoped, would do so again.Additional Elements*New dungeons*New classes: diviner and ninja*New Game+*Autosave*UI specifically designed for smartphonesAndroid 4.2.2 or above recommended.Not compatible with all devices.… Expand"}, {"name": "The Walking Dead: The Telltale Series - A New Frontier Episode 4: Thicker than Water", "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-the-telltale-series---a-new-frontier-episode-4-thicker-than-water", "publisher": "Telltale Games", "release_date": "Apr 25 2017", "developers": ["Telltale Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 62, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/1/c14b191437a6c4042d80028539bb7033-98.jpg", "descriptions": "The latest chapter continues to follow Javier and Clementine’s journeys through the zombie apocalypse."}, {"name": "Spider-Man: Edge of Time", "details_link": "https://www.metacritic.com/game/wii/spider-man-edge-of-time", "publisher": "Activision", "release_date": "Oct  4 2011", "developers": ["Beenox"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "Beat-'Em-Up", "Fantasy", "Third-Person", "Fantasy", "3D"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/462cbae0839427e170c0aa38a40a3f28-98.jpg", "descriptions": "Developed by Activision-owned studio Beenox, Spider-Man: Edge of Time challenges the player to take on the roles of both classic Amazing Spider-Man and Spider-Man 2099 to correct a timestream gone awry and prevent a catastrophic future brought on by the early and untimely death of Peter Parker."}, {"name": "Doc Clock: The Toasted Sandwich of Time", "details_link": "https://www.metacritic.com/game/pc/doc-clock-the-toasted-sandwich-of-time", "publisher": "Stickmen Studios", "release_date": "Oct 15 2010", "developers": ["Stickmen Studios"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/43c35360667846a853eeb89d61b11bdb-98.jpg", "descriptions": "Doc Clock: The Toasted Sandwich of Time is a creative quest for all ages, suitable for anyone who enjoys compelling problem-solving challenges and comical encounters,â€\u009d said Wil McLellan, CEO of Stickmen Studios."}, {"name": "Naruto: Path of the Ninja 2", "details_link": "https://www.metacritic.com/game/ds/naruto-path-of-the-ninja-2", "publisher": "Tomy Corporation", "release_date": "Oct 15 2008", "developers": ["TOSE"], "platforms": "DS", "num_players": "2  Online", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/89a09f43409fda496f8407ee647c8bf7-98.jpg", "descriptions": "NARUTO: Path of the Ninja 2 gives players a portable outlet for their inner ninja. A deep, original storyline allows players to access 30 major characters from the series, from standards such as Naruto and Sakura to unlikely allies like the weapons-based Tenten. The improved and intuitiveNARUTO: Path of the Ninja 2 gives players a portable outlet for their inner ninja. A deep, original storyline allows players to access 30 major characters from the series, from standards such as Naruto and Sakura to unlikely allies like the weapons-based Tenten. The improved and intuitive battle system makes it easy for even the newest fighters to get into the combat, using the DS Touch Screen to unleash devastating melee and jutsu attacks on any opponent foolish enough to get in their way. The new Squad Leader and Ninja Tag systems provide even more squad-building options, while the Wi-Fi multiplayer feature offers aspiring ninja the chance to take on challengers from around the world. [TOMY Corporation]… Expand"}, {"name": "Marathon: Durandal", "details_link": "https://www.metacritic.com/game/xbox-360/marathon-durandal", "publisher": "Microsoft Game Studios", "release_date": "Aug  1 2007", "developers": ["Freeverse"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 62, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/00efa86cebe60fc31bdc8d97a580f55d-98.jpg", "descriptions": "[Xbox Live Arcade]  Seventeen years ago, you survived a vicious Pfhor assault on the U.E.S.C. Marathon. Now you have been awakened by the enigmatic, sentient A.I. called Durandal and sent to an alien world to uncover the mysteries of their advanced technology. In Marathon: Durandal, armed[Xbox Live Arcade]  Seventeen years ago, you survived a vicious Pfhor assault on the U.E.S.C. Marathon. Now you have been awakened by the enigmatic, sentient A.I. called Durandal and sent to an alien world to uncover the mysteries of their advanced technology. In Marathon: Durandal, armed with only a pistol, you are humanity’s last champion Marathon: Durandal is a cult classic first-person shooter (FPS) that continues the tradition of great gameplay while remaining faithful to the spirit of Bungie lore as the predecessor to the Halo franchise. Upgraded visuals: All images in the game have been redrawn in high definition. Marathon: Durandal features a new modern networking layer built with Xbox LIVE in mind. The redesigned controls take full advantage of the Xbox 360 Controller and enhance playing a first-person shooter on a home console. [Microsoft]… Expand"}, {"name": "Sherlock Holmes vs. Jack the Ripper", "details_link": "https://www.metacritic.com/game/xbox-360/sherlock-holmes-vs-jack-the-ripper", "publisher": "DreamCatcher Interactive", "release_date": "Apr 23 2010", "developers": ["Frogwares"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/86b75622fee1be77cf6808ac665f5519-98.jpg", "descriptions": "Sherlock Holmes vs. Jack the Ripper allows you to play as the greatest detective of all in the London of 1888. A series of particularly horrible murders creates a real psychosis throughout the country. Atrociously mutilated prostitutes' bodies are found by the police without them being ableSherlock Holmes vs. Jack the Ripper allows you to play as the greatest detective of all in the London of 1888. A series of particularly horrible murders creates a real psychosis throughout the country. Atrociously mutilated prostitutes' bodies are found by the police without them being able to find a serious lead. Sherlock Holmes starts looking for clues in the dark and sinister alleys of Whitechapel in order to follow the macabre trail of the one the press now calls Jack the Ripper. During an adventure full of twists, Sherlock Holmes will try to bring out the true identity and the motives of the one who hides behind this scary alias. [Focus Home Interactive]… Expand"}, {"name": "Gravel", "details_link": "https://www.metacritic.com/game/pc/gravel", "publisher": "Milestone S.r.l", "release_date": "Feb 27 2018", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 62, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/40179c50ab9d6eb0dd2950b04229a129-98.jpg", "descriptions": "Destroy obstacles, take shortcuts, and forget any rules until the end to win."}, {"name": "Warhammer Age of Sigmar: Tempestfall", "details_link": "https://www.metacritic.com/game/pc/warhammer-age-of-sigmar-tempestfall", "publisher": "Carbon Studio", "release_date": "Nov 17 2021", "developers": ["Carbon Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/93cda6e971d429e8ea900947bfd2b1f1-98.jpg", "descriptions": "Battle the forces of Nighthaunt in this VR-exclusive action-adventure Warhammer Age of Sigmar game. Wield iconic weapons of a Lord-Arcanum and deliver Sigmar’s justice using motion-based abilities and magic across the realm of Death."}, {"name": "Terminator: Resistance Enhanced", "details_link": "https://www.metacritic.com/game/playstation-5/terminator-resistance-enhanced", "publisher": "Reef Entertainment", "release_date": "Apr 30 2021", "developers": ["Teyon"], "platforms": "PlayStation 5", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/c6167bccb2cc4e743ef45296597fbd83-98.jpg", "descriptions": "A standalone product and as a free upgrade for owners of the PS4 version. Features a range of graphical improvements as well as additional content."}, {"name": "Mable & The Wood", "details_link": "https://www.metacritic.com/game/pc/mable-amp-the-wood", "publisher": "Triplevision Games", "release_date": "Aug 23 2019", "developers": ["Triplevision Games"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Metroidvania"], "meta_score": 62, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/7f023bb718c3d7c2a2c8edde9f3f29a3-98.jpg", "descriptions": "Hunt down massive beasts and, upon destroying them, shapeshift into their forms in order to use their powers to save or destroy the world. Players with less violent intent can find secret paths to complete Mable without killing anything, including bosses."}, {"name": "Mario Sports Superstars", "details_link": "https://www.metacritic.com/game/3ds/mario-sports-superstars", "publisher": "Nintendo", "release_date": "Mar 24 2017", "developers": ["Nintendo", "Camelot Software Planning"], "platforms": "3DS", "num_players": "Up to 6 ", "genres": ["Sports", "General"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/4d12571cb6fa6a6505494c985453c91f-98.jpg", "descriptions": "Five full-on sports—Soccer, Tennis, Golf, Baseball, and Horse Racing—bring the challenge and depth you demand to Nintendo 3DS systems. Take on friends and rivals in local or online multiplayer*, hone skills in training, or tackle single-player tournaments. Whether you pick Mario, Waluigi, orFive full-on sports—Soccer, Tennis, Golf, Baseball, and Horse Racing—bring the challenge and depth you demand to Nintendo 3DS systems. Take on friends and rivals in local or online multiplayer*, hone skills in training, or tackle single-player tournaments. Whether you pick Mario, Waluigi, or one of sixteen others, you're on the road to superstardom. Before long, you'll have mastered the ins and outs of each sport: learn when to use an infield shift in Baseball, change your team’s formation in Soccer, and more. Even Horse Racing is surprisingly deep! Build a stable of horses and train them well to win the day in the first-ever horse races in series history. But remember: these aren't normal sports—they're Mario Sports. Expect unexpected thrills and power up to stomp the competition. [Nintendo]… Expand"}, {"name": "Orgarhythm", "details_link": "https://www.metacritic.com/game/playstation-vita/orgarhythm", "publisher": "XSEED Games", "release_date": "Oct 23 2012", "developers": ["Acquire"], "platforms": "PlayStation Vita", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/111d420dff7d3cf5a0f985c8a543df7a-98.jpg", "descriptions": "A hybrid rhythm/real-time strategy game through which you direct your own personal army by using the touchscreen to keep the beat."}, {"name": "The Incredibles", "details_link": "https://www.metacritic.com/game/playstation-2/the-incredibles", "publisher": "THQ", "release_date": "Oct 31 2004", "developers": ["Heavy Iron Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 62, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/d7a37bc146837299f09eb4f8659ba828-98.jpg", "descriptions": "Super strength. Super speed. Invisibility. Elasticity. These are your powers. Bombs. Bullets. Robots. Lasers. Your enemy controls them all. The only way to survive being The Incredibles is to truly be incredible. From the Academy Award-winning creators of \"Toy Story,\" \"Monsters, Inc.,\" andSuper strength. Super speed. Invisibility. Elasticity. These are your powers. Bombs. Bullets. Robots. Lasers. Your enemy controls them all. The only way to survive being The Incredibles is to truly be incredible. From the Academy Award-winning creators of \"Toy Story,\" \"Monsters, Inc.,\" and \"Finding Nemo\" comes a new movie written by Pixar Animation Studios' Brad Bird (Iron Giant, The Simpsons). The Incredibles tells the story of a family of undercover superheroes that are trying to live a quiet, suburban life, but are forced back into action in order to save the world. The action/adventure game from THQ is based on the plotline of the movie, allowing you to play as all the film's main characters. Live the film's action, adventure, and humor over 18 levels, which are packed with fighting, racing, and puzzle action/adventure gameplay featuring the characters' unique superpowers. [THQ]… Expand"}, {"name": "Monster of the Deep: Final Fantasy XV", "details_link": "https://www.metacritic.com/game/playstation-4/monster-of-the-deep-final-fantasy-xv", "publisher": "Square Enix", "release_date": "Nov 21 2017", "developers": ["Square Enix"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Nature", "Fishing"], "meta_score": 62, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/29cd99466b42172c1146df6a6d23f944-98.jpg", "descriptions": "The fishing feature of Final Fantasy XV has been revamped and revitalized for PS VR. Join Noctis, Ignis, Prompto, Gladio, and other familiar faces in a picturesque virtual reality backdrop en route to a thrilling encounter with the menace that lurks in the depths."}, {"name": "Assassin's Creed Liberation HD", "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed-liberation-hd", "publisher": "Ubisoft", "release_date": "Jan 15 2014", "developers": ["Ubisoft Sofia"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Stadia", "Xbox One", "Xbox 360"], "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 62, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/20ddf35f882aa7dc0489c451bbe11bed-98.jpg", "descriptions": "Liberation is set in New Orleans between 1765 and 1780, in the period between the end of the French and Indian War, up to the middle of the American Revolution. The game tells the story of Aveline; a female Assassin of mixed French and African heritage. Brought up in a world of privilege andLiberation is set in New Orleans between 1765 and 1780, in the period between the end of the French and Indian War, up to the middle of the American Revolution. The game tells the story of Aveline; a female Assassin of mixed French and African heritage. Brought up in a world of privilege and contrasts, Aveline becomes a strong willed woman and an avid opponent of slavery.… Expand"}, {"name": "Intruders: Hide and Seek", "details_link": "https://www.metacritic.com/game/playstation-4/intruders-hide-and-seek", "publisher": "Daedalic Entertainment", "release_date": "Feb 13 2019", "developers": ["Tessera Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 62, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/0af82372ab327f548646fcb9d8f36c07-98.jpg", "descriptions": "Intruders: Hide and Seek is a first-person stealth game, an intense thriller combining psychological terror with the point of view of a defenseless boy. Three dangerous intruders slip into the house, and your only option is… to hide."}, {"name": "Between Me and The Night", "details_link": "https://www.metacritic.com/game/pc/between-me-and-the-night", "publisher": "KISS Ltd.", "release_date": "Jan 22 2016", "developers": ["RainDance LX"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 62, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/4bb87d6eeceb9987fa1e429f9282cefb-98.jpg", "descriptions": "A surrealist action adventure game that walks the thin path between sanity and madness. Take on the role of a young boy and explore and interact with the mysterious house in which he lives."}, {"name": "Disintegration", "details_link": "https://www.metacritic.com/game/pc/disintegration", "publisher": "Private Division", "release_date": "Jun 15 2020", "developers": ["V1 Interactive"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 62, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/f1a9ca92566492774961dde369995cf0-98.jpg", "descriptions": "Dive into an action-drived first-person shooter, set in near-future sci-fi universe created by V1 Interactive, a newly-assembled studio of industry veterans. Journey into a vision of tomorrow where humankind is on the brink of extinction and has turned to technology in the hope of survival.Dive into an action-drived first-person shooter, set in near-future sci-fi universe created by V1 Interactive, a newly-assembled studio of industry veterans. Journey into a vision of tomorrow where humankind is on the brink of extinction and has turned to technology in the hope of survival. Using a process known as Integration, human minds are surgically implanted into robotic armatures creating a new form of sentient life. As a domineering enemy superpower known as the Rayonne emerges, take on the role of Romer Shoal, an expert Gravcycle pilot. Astride your heavily-modified craft (fitted with an armoured chassis and a powerful array of weapons), lead a small resistance force in the fight to save what remains of humanity.\r… Expand"}, {"name": "Disney/Pixar Ratatouille", "details_link": "https://www.metacritic.com/game/wii/disneypixar-ratatouille", "publisher": "THQ", "release_date": "Jun 26 2007", "developers": ["Asobo Studio"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/3044e0fb6ed255dc7a6e350ab51eafbc-98.jpg", "descriptions": "Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6 action-packed worlds filled with dangerous enemies, heists and perilous missions. Players can go head-to-head with their friends in multiplayer mini-games or navigate their way through a sensational rat race that turns the culinary world of Paris upside down. [THQ]… Expand"}, {"name": "Wanted: Weapons of Fate", "details_link": "https://www.metacritic.com/game/pc/wanted-weapons-of-fate", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar 23 2009", "developers": ["GRIN"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/15dd85e49f01a9a7e90941bead4514c2-98.jpg", "descriptions": "Based on Universal Pictures' action-thriller Wanted, this game promises to deliver the same fantastic visual style, in-your-face attitude and edge-of-your-seat action as the blockbuster motion picture. The game continues the story of hero Wesley Gibson, picking up the action where the filmBased on Universal Pictures' action-thriller Wanted, this game promises to deliver the same fantastic visual style, in-your-face attitude and edge-of-your-seat action as the blockbuster motion picture. The game continues the story of hero Wesley Gibson, picking up the action where the film leaves off and creating an entirely new chapter exploring both Wesley's journey to becoming an unmatched überassassin and the epic fiction of \"The Fraternity.\" Featuring intense third-person action, the Wanted video game will take combat to the next level with iconic moves -- such as \"Curving Bullets\" and \"Assassin Time\" -- drawn directly from the film, as well as an innovative, multi-layered cover mechanic.… Expand"}, {"name": "Wavey The Rocket", "details_link": "https://www.metacritic.com/game/pc/wavey-the-rocket", "publisher": "UpperRoom Games Ltd", "release_date": "May  7 2020", "developers": ["UpperRoom Games Ltd"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/2faf8508b2b63eadf99f03a15979ee66-98.jpg", "descriptions": "Play as Wavey the Rocket as he tries to stop the moon from being destroyed by an evil corporation that removes fizz from soda! A precision side scroller like no other, it's hand-crafted and set to some seriously funky hip hop."}, {"name": "Little King's Story", "details_link": "https://www.metacritic.com/game/pc/little-kings-story", "publisher": "XSEED Games", "release_date": "Aug  5 2016", "developers": ["Cingular mMode", "Cing"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 62, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/80b7cf989baf9b5d9da3a5a816e4c2c7-98.jpg", "descriptions": "A blend of RPG, simulation and light Real Time Strategy gameplay, the action in Little King's Story is all about improving your skill level and those of your followers as a means of gaining wealth and territory, which will in turn benefit the overall health of your subjects and your statusA blend of RPG, simulation and light Real Time Strategy gameplay, the action in Little King's Story is all about improving your skill level and those of your followers as a means of gaining wealth and territory, which will in turn benefit the overall health of your subjects and your status as king. As players enter their humble town after finding their crown, they are assisted by their advisors, especially Howzer, in taking on missions in the immediate area of town. With the success of each, as well as activities like farming and natural resources development, they will gain wealth in the form of in-game currency called 'Bol.' Once an essential infrastructure has been established in town a suggestion box is set up through which in-game characters can make quest suggestions to supplement those of your advisors. During quests players in the role of young King Corobo can control multiple subjects of his kingdom who follow and serve based on your kingly status. These subjects have different professions which come in handy in specific as well as general quest scenarios and should be chosen wisely. Additional training facilities can be constructed to retrain existing subjects as well as those that are added to your kingdom as it prospers and eventually needs to expand into surrounding territories. The world of Little King's Story is expansive and set on many levels. Although each level contains multiple possible boss battles, progression through the game levels always requires the defeat of a substantial boss. Battles become more intense as you set out to conquer the lands that surround your kingdom, although these are never too overbearing due to the game's easy to alter difficulty settings. As these campaigns against neighboring kingdoms proceed you are kept aware of the health and happiness of your subjects at home and that of your troops via an information bar at the top left, as well as a ticker scrolling across the screen. Balance their needs with the needs of an expanding kingdom and you may indeed become the best king ever.… Expand"}, {"name": "Morningstar: Descent to Deadrock", "details_link": "https://www.metacritic.com/game/pc/morningstar-descent-to-deadrock", "publisher": "Phoenix Online Publishing", "release_date": "Feb 17 2015", "developers": ["Red Herring Labs"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 62, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/c61fb9a3790b3df0cd082050399d8b19-98.jpg", "descriptions": "Morningstar: Descent to Deadrock is a chillingly alien and atmospheric sci-fi first person point-and-click adventure from Red Herring Labs and Phoenix Online Publishing."}, {"name": "Taz Wanted", "details_link": "https://www.metacritic.com/game/xbox/taz-wanted", "publisher": "Atari", "release_date": "Sep 18 2002", "developers": ["Blitz Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/c380f349b56a8388165e60e081b18242-98.jpg", "descriptions": "Taz has reached his boiling point in Taz: Wanted--and for good reason. Yosemite Sam locked Taz in a zoo and wants to turn his homeland into a tacky theme park. Now, as an escapee, Taz is on the run gobbling power-ups, using disguises, and leaving a wake of destruction across fourTaz has reached his boiling point in Taz: Wanted--and for good reason. Yosemite Sam locked Taz in a zoo and wants to turn his homeland into a tacky theme park. Now, as an escapee, Taz is on the run gobbling power-ups, using disguises, and leaving a wake of destruction across four hazard-filled worlds in an attempt to stop Sam. Guide Taz as he spins and bounces his way through more than 15 levels of puzzles, enemies, and destructible environments.… Expand"}, {"name": "Street Hoops", "details_link": "https://www.metacritic.com/game/playstation-2/street-hoops", "publisher": "Activision", "release_date": "Aug 12 2002", "developers": ["Black Ops Entertainment"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 62, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/56fd892831ef2675938fc1ce4cb3bf72-98.jpg", "descriptions": "Play as streetball legends Hot Sauce, Headache and more. Real Brand name apparel including And 1, Enyce and Sean John. Run on real courts around the world including Rucker Park, Venice Beach, and Shakespeare Park in New Orleans. Bet virtual cash on your team, then use the winnings to buy newPlay as streetball legends Hot Sauce, Headache and more. Real Brand name apparel including And 1, Enyce and Sean John. Run on real courts around the world including Rucker Park, Venice Beach, and Shakespeare Park in New Orleans. Bet virtual cash on your team, then use the winnings to buy new gear. [Activision]… Expand"}, {"name": "ESPN International Winter Sports 2002", "details_link": "https://www.metacritic.com/game/playstation-2/espn-international-winter-sports-2002", "publisher": "Konami", "release_date": "Jan 28 2002", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Olympic Sports"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/cab40c63e6d135d925a3c01f2dee785f-98.jpg", "descriptions": "Features 10 events including Downhill Alpine Skiing, Freestyle Mogul Skiing, Speed Skating, Bobsledding, and the fan-favorite, Curling, all with that ESPN twist."}, {"name": "Tom Clancy's Rainbow Six: Covert Ops Essentials", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six-covert-ops-essentials", "publisher": "Red Storm Entertainment", "release_date": "Sep 28 2000", "developers": ["Red Storm Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 62, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/5e5c44f338b3bb855fb57070b5e85655-98.jpg", "descriptions": "This title is an exciting overview covering the subject of counterterrorism from 1970 until the present. Players will be able to test their skills and knowledge through the \"Covert Exam\" testing, as well as by playing the especially created field game levels. [Red Storm Entertainment]"}, {"name": "Dex", "details_link": "https://www.metacritic.com/game/pc/dex", "publisher": "Dreadlocks Ltd", "release_date": "Aug 13 2014", "developers": ["Dreadlocks Ltd", "Dreadlocks"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/f1610e203a9e1f3d0b2c88d6dca89ca4-98.jpg", "descriptions": "Dex is a 2D, side-scrolling, open-world cyberpunk RPG with a focus on exploration and non-linear gameplay."}, {"name": "Jurassic World Aftermath Collection", "details_link": "https://www.metacritic.com/game/switch/jurassic-world-aftermath-collection", "publisher": "Coatsink Software", "release_date": "Nov 10 2022", "developers": ["Coatsink Software"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/c44bb010fd5917523f6d7dd6849db217-98.jpg", "descriptions": "Jurassic World Aftermath Collection is a suspenseful survival adventure. Crash-landing on Isla Nublar after the fall of Jurassic World, you find yourself trapped in a research facility when your mission to recover valuable information goes disastrously wrong. To survive, you’ll need toJurassic World Aftermath Collection is a suspenseful survival adventure. Crash-landing on Isla Nublar after the fall of Jurassic World, you find yourself trapped in a research facility when your mission to recover valuable information goes disastrously wrong. To survive, you’ll need to explore and solve puzzles while distracting and evading the three ferocious Velociraptors that stalk your every move.… Expand"}, {"name": "Twin Mirror", "details_link": "https://www.metacritic.com/game/xbox-one/twin-mirror", "publisher": "Bandai Namco Games", "release_date": "Dec  1 2020", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/97ce696bfaec13743d7c6fd4f6cec6ae-98.jpg", "descriptions": "Sam, a 33-year old man recovering from a recent break-up, returns to his hometown Basswood, West Virginia, for the funeral of his best friend. Understandably depressed and bitter, he feels completely out of sorts and out of place... But when he wakes up in his hotel room with a bloody shirtSam, a 33-year old man recovering from a recent break-up, returns to his hometown Basswood, West Virginia, for the funeral of his best friend. Understandably depressed and bitter, he feels completely out of sorts and out of place... But when he wakes up in his hotel room with a bloody shirt and no memory of his whereabouts the previous night, he embarks on a twisted investigation to find the truth.FEATURES:* Play a Thrilling Investigation -- Recall your memories and find the truth by exploring the dark undertones of a small town in West Virginia.* Embark on a Compelling Emotional Journey -- Sam's quest is also one of redemption in his journey to find himself again and heal his wounded heart.* Direct Sam's Fate -- Your choices and values decide Sam's place in life as you shape his relationships with the Basswood's inhabitants.… Expand"}, {"name": "PokePark Wii: Pikachu's Adventure", "details_link": "https://www.metacritic.com/game/wii/pokepark-wii-pikachus-adventure", "publisher": "Nintendo", "release_date": "Nov  2 2010", "developers": ["Creatures Inc."], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/3bb77ae99a2578f975eb0353cc822708-98.jpg", "descriptions": "PokePark Wii: Pikachu's Adventure is the first Pokemon adventure game for the Wii."}, {"name": "Sudoku Gridmaster", "details_link": "https://www.metacritic.com/game/ds/sudoku-gridmaster", "publisher": "Nintendo", "release_date": "Jun 26 2006", "developers": ["AI"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/3c5dd02e5352206945585da63c9e8be7-98.jpg", "descriptions": "Sudoku Gridmaster uses intuitive Touch Screen controls that make solving the puzzles faster and easier. Simply touch the square you want to fill in, then touch your answer on the number pad. You can also choose to forgo the number pad and write your answer directly on the Touch Screen.Sudoku Gridmaster uses intuitive Touch Screen controls that make solving the puzzles faster and easier. Simply touch the square you want to fill in, then touch your answer on the number pad. You can also choose to forgo the number pad and write your answer directly on the Touch Screen. Sudoku Gridmaster has plenty of helpful gameplay features to help you solve even the most complicated puzzles. Beginners will love the four in-depth tutorials that can be accessed at any time—even in the middle of a game. Experts will appreciate the ability to highlight entire rows and columns with a single touch. And everyone will wonder how they survived without the ability to highlight all instances of the same number at once. The game features puzzles in four difficulty settings (practice, easy, normal, and hard), and also has a fun unlockable system where you earn stars by performing well. If you gain enough stars, you'll be able to take a test and prove your skills. Pass the test to win a special award and open up even more puzzles. [Nintendo]… Expand"}, {"name": "Manhunt 2", "details_link": "https://www.metacritic.com/game/wii/manhunt-2", "publisher": "Rockstar Games", "release_date": "Oct 29 2007", "developers": ["Rockstar Toronto"], "platforms": ["PC", "PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/78a84769eb71a5eb31af2bbe118bf349-98.jpg", "descriptions": "An experiment at a secret research facility has gone catastrophically wrong. Daniel Lamb and Leo Kasper are the only surviving subjects. The Pickman Project will stop at nothing to hunt them down and stop the truth from getting out. Demented screams echo around the dank Dixmor asylum thatAn experiment at a secret research facility has gone catastrophically wrong. Daniel Lamb and Leo Kasper are the only surviving subjects. The Pickman Project will stop at nothing to hunt them down and stop the truth from getting out. Demented screams echo around the dank Dixmor asylum that has caged you for the last six years. You open your eyes. A white-coated body slumps to the floor through your shaking hands. A bloody syringe slips from your arm. Waves of confusion and paranoia crash over you.  You have no idea who you are or how you got here. The door to your cell is open. One choice. One chance. They took your life. Time to take it back. [Rockstar Games]… Expand"}, {"name": "Cube Tactics", "details_link": "https://www.metacritic.com/game/3ds/cube-tactics", "publisher": "Teyon", "release_date": "Mar 13 2014", "developers": ["Fun Unit Inc"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Action", "Strategy", "Real-Time", "General", "Defense"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/8717bc6d390a9fa867fa8b78b12158aa-98.jpg", "descriptions": "This is no ordinary war. This is the war of cubes!\r Fierce enemies roam the land of cubes, protecting their core and bringing their opponents to mercy. Begin your training with Sir Knight as you take to becoming a Cube Master to tackle these lethal enemies in this strategic and tacticalThis is no ordinary war. This is the war of cubes!\r Fierce enemies roam the land of cubes, protecting their core and bringing their opponents to mercy. Begin your training with Sir Knight as you take to becoming a Cube Master to tackle these lethal enemies in this strategic and tactical war-game with cubes.\r Perfect your skills with over 25 Quests to complete in Single Player mode and even more online Multiplayer battles with up to 3 enemies at one time! Trample your enemies and build your army with numerous cubes to earn medals not just for appearances but to equip and advance your army with even more power! The battle for power and position has begun in this tactical game of cubes!\r -Unique and strategic war-game with cubes\r-Battle against more lethal enemies with online Multiplayer mode and international rankings\r-Over 25 tactical Quests to complete in Single Player mode\r-Various cubes and fighters with unique combat abilities for thrilling battles\r-Multitudes of medals to collect and equip in-game for extra military power!… Expand"}, {"name": "Firegirl: Hack 'n Splash Rescue", "details_link": "https://www.metacritic.com/game/pc/firegirl-hack-n-splash-rescue", "publisher": "Thunderful", "release_date": "Dec 14 2021", "developers": ["Dejima"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/58aa71aadc75977ba17654931aa3eae8-98.jpg", "descriptions": "Assume the role of a young rescue officer starting her career. Armed with a trusty axe and high-pressure fire hose that also acts like a jetpack, Firegirl responds to emergency calls across the city. Can Firegirl save all the trapped civilians caught in each blaze?"}, {"name": "Wings Over Europe: Cold War Gone Hot", "details_link": "https://www.metacritic.com/game/pc/wings-over-europe-cold-war-gone-hot", "publisher": "Bold Games", "release_date": "May 24 2006", "developers": ["Third Wire"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Modern Jet", "Combat"], "meta_score": 62, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/6540dec7805f108ead662c4488fe5dcb-98.jpg", "descriptions": "(Also known as \"Wings Over Europe: Cold War Soviet Invasion\")  Wings Over Europe: Cold War Gone Hot is an air-combat game that delivers the excitement of a visceral, seat-of-your-pants dogfight experience -- flying in some of the most legenday jet fighters in history. Flyable aircraft(Also known as \"Wings Over Europe: Cold War Soviet Invasion\")  Wings Over Europe: Cold War Gone Hot is an air-combat game that delivers the excitement of a visceral, seat-of-your-pants dogfight experience -- flying in some of the most legenday jet fighters in history. Flyable aircraft include the: F-100 Super Sabre, F-105 Thunderchief, F-4 Phantom II,\rF-15 Eagle, A-10 Thunderbolt II, British Hunter, and the exciting vertical take-off and landing of the Harrier \"jump jet.\" Engage in blood-draining, G-pulling, action-packed dogfights against 13 different types of Cold War Soviet aircraft. Fly era-specific aircraft through Central Europe in three epic campaigns. From the developers of the highly successful European Air War, Strike Fighters: Project 1, and Wings Over Vietnam. Random mission generator provides maximum flexibility and replayability. Campaign missions also have a different outcome each time. Open architecture for mod support. Download thousands of user-created skins, aircraft, terrain, missions, campaigns, and editors already available on the Internet. [Bold Games]… Expand"}, {"name": "Metal Saga", "details_link": "https://www.metacritic.com/game/playstation-2/metal-saga", "publisher": "Atlus Co.", "release_date": "Apr 25 2006", "developers": ["Crea-Tech"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 62, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/065dc376b25f1331995b5aad8689ae38-98.jpg", "descriptions": "In the not so distant future... Desperate to find a way to save the earth from pollution, mankind created a gigantic supercomputer and named it Noah.  Noah’s solution, however, was to exterminate its creators. In a matter of days, civilization fell to terrifying weapons and monsters createdIn the not so distant future... Desperate to find a way to save the earth from pollution, mankind created a gigantic supercomputer and named it Noah.  Noah’s solution, however, was to exterminate its creators. In a matter of days, civilization fell to terrifying weapons and monsters created by Noah.  This cataclysmic event came to be known as the Great Destruction. As the years passed, the number of human survivors grew, slowly but steadily.  They formed villages and towns, living off of technology that they were able to salvage from the piles of wreckage. Among the survivors were those who rose up to fight Noah's robotic henchmen. To track down and eliminate these threats to humanity, they utilized the most powerful weapons still operable after the Great Destruction—tanks! As a sign of respect, people nicknamed them \"hunters.\" Noah, the cause of the Great Destruction, was in fact destroyed by one such hunter.  However, its ruthless offspring still roamed the world, striking fear in people’s hearts. Now, a young man prepares to set foot into the deadly desert wasteland to make a name for himself, as did his father, a veteran hunter... [Atlus]… Expand"}, {"name": "Planetary Annihilation", "details_link": "https://www.metacritic.com/game/pc/planetary-annihilation", "publisher": "Uber Entertainment", "release_date": "Jun 13 2013", "developers": ["Uber Entertainment", "Planetary Annihilation Inc"], "platforms": "PC", "num_players": "Up to 32 ", "genres": ["Sci-Fi", "Sci-Fi", "Strategy", "Real-Time", "Command"], "meta_score": 62, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/21169d83304358c689b83890905540c3-98.jpg", "descriptions": "Planetary Annihilation brings Real-Time Strategy to a new generation of gamers in a way they've never been seen before - taking large scale real time strategy games from the past to gameplay on a planetary scale."}, {"name": "Headhunter: Redemption", "details_link": "https://www.metacritic.com/game/playstation-2/headhunter-redemption", "publisher": "Sega", "release_date": "Sep 21 2004", "developers": ["Amuze"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/0d90d074576d1e8e08e16f152e4c8c3e-98.jpg", "descriptions": "Twenty years after the devastation caused by the Bloody Mary Virus, a new order has emerged, based on two distinct but totally independent worlds, divided by the ultimate consumerist society - 'Above' and 'Below'. Headhunter: Redemption continues the gripping story of Jack Wade, a veteranTwenty years after the devastation caused by the Bloody Mary Virus, a new order has emerged, based on two distinct but totally independent worlds, divided by the ultimate consumerist society - 'Above' and 'Below'. Headhunter: Redemption continues the gripping story of Jack Wade, a veteran Headhunter keeping order in a futuristic world overrun with unchecked consumerism, vicious organized crime and mind-controlling mass media. When Jack and his protégé, the sassy, streetwise Leeza X, stumble upon an arms smuggling operation that threatens the status quo, they must work together to deliver an oblivious world from impending catastrophe, confronting their darkest fears beneath a shroud of evil that blankets the city. [Sega]… Expand"}, {"name": "Conan Unconquered", "details_link": "https://www.metacritic.com/game/pc/conan-unconquered", "publisher": "Funcom", "release_date": "May 29 2019", "developers": ["Petroglyph"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["General", "Strategy", "Real-Time", "Command"], "meta_score": 62, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/412e2191cf8a9be23fd8a10be195974c-98.jpg", "descriptions": "Build your stronghold and assemble an unconquerable army to survive the savage hordes in this real-time survival strategy game set in the world of Conan the Barbarian. Developed by the Command & Conquer veterans at Petroglyph."}, {"name": "Gal*Gun 2", "details_link": "https://www.metacritic.com/game/switch/galgun-2", "publisher": "PQube", "release_date": "Apr 24 2018", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/d714237dd34ad8714ae73636e2099729-98.jpg", "descriptions": "Gal Gun is back for an adventure more outrageous than ever! A new army of girls has been overpowered by lust in THE FULL-FRONTAL SEQUEL to Japan's infamous shooter. Fend them off with your Pheromone Shot and use new gadgets to expel demons from their bodies in the most audacious first-personGal Gun is back for an adventure more outrageous than ever! A new army of girls has been overpowered by lust in THE FULL-FRONTAL SEQUEL to Japan's infamous shooter. Fend them off with your Pheromone Shot and use new gadgets to expel demons from their bodies in the most audacious first-person shooter you'll ever play!FEATURES:* The craziest shooter yet! -- Help swarms of girls exorcise their demon possessions by hitting their pleasure spots with your love gun until they explode in euphoria!* A gorgeous new cast! -- Woo a fresh set of girls in a brand-new Gal Gun story. With the aid of alluring angel Risu, become romantically entangled with girl-next-door Chiru and childhood sweetheart Nanako.* Fulfil each girl's desires! -- Manage your schedule to receive jobs from the academy's love-struck girls, and satisfy their requests to unlock new missions and story scenes.* Suck your way to Pantsu Paradise! -- Equip the Demon Sweeper, capable of vacuuming up Gal*Gun 2's pesky demon menaces... and sucking the dresses right off the girls' bodies!* Get up-close and very personal! -- Enter Doki Doki Mode, which returns in its biggest, boldest and bounciest guise ever, to rub, caress and poke your way to happiness!… Expand"}, {"name": "Sonic Forces", "details_link": "https://www.metacritic.com/game/xbox-one/sonic-forces", "publisher": "SegaSoft", "release_date": "Nov  7 2017", "developers": ["SegaSoft", "Sonic Team"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "3D"], "meta_score": 62, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/fe9637816e48c3fd0d8c01685ae5f503-98.jpg", "descriptions": "In Eggman's greatest victory to date, the evil doctor has conquered much of the world with a mysterious new power. A resistance comprised of Sonic's friends is formed to fight back, and in the midst of the chaos and destruction, an unlikely hero will rise up to help Modern and Classic SonicIn Eggman's greatest victory to date, the evil doctor has conquered much of the world with a mysterious new power. A resistance comprised of Sonic's friends is formed to fight back, and in the midst of the chaos and destruction, an unlikely hero will rise up to help Modern and Classic Sonic take back the world. Even these three heroes may have their work cut out for them, as Dr. Eggman has a new ally of his own...… Expand"}, {"name": "Ratchet & Clank: Size Matters", "details_link": "https://www.metacritic.com/game/playstation-2/ratchet-clank-size-matters", "publisher": "SCEA", "release_date": "Mar 11 2008", "developers": ["High Impact Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 62, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/73237cf9ec19226f4c65df78f822321d-98.jpg", "descriptions": "While on a much needed vacation, Ratchet and Clank's rest and relaxation time is suddenly cut short as they soon find themselves lured into a mysterious quest. Following the trail of a kidnapped girl, Ratchet and Clank rediscover a forgotten race of genius inventors known as the Technomites.While on a much needed vacation, Ratchet and Clank's rest and relaxation time is suddenly cut short as they soon find themselves lured into a mysterious quest. Following the trail of a kidnapped girl, Ratchet and Clank rediscover a forgotten race of genius inventors known as the Technomites. They soon uncover a plot more dangerous than they could have imagined. Set in the franchise's signature style sci-fi universe, players take on the roles of both Ratchet and Clank in a journey across the galaxy full of new destinations to explore and conquer. Features new and returning weapons and gadgets, including the Blitz Cannon, Agents of Doom and Shrink Ray. Players can utilize the all-new customizable armor system themed for various game play to gain upgrades and advance through challenging action-packed areas. Gain access to different vehicles to compete in races and combat enemies in intense battlefield missions. [SCEA]… Expand"}, {"name": "24: The Game", "details_link": "https://www.metacritic.com/game/playstation-2/24-the-game", "publisher": "2K Games", "release_date": "Feb 28 2006", "developers": ["SCE Studio Cambridge"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 62, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/8b41244cafa3c2cd96e71e0dd0cb39aa-98.jpg", "descriptions": "24: The Game is set between seasons two and three and provides the answers to many unanswered questions: who was really behind the assassination attempt on President Palmer? How did Kim Bauer get a job in the L.A. CTU? How did Jack Bauer and Chase Edmunds first start working together? The24: The Game is set between seasons two and three and provides the answers to many unanswered questions: who was really behind the assassination attempt on President Palmer? How did Kim Bauer get a job in the L.A. CTU? How did Jack Bauer and Chase Edmunds first start working together? The game has jaw-dropping revelations for '24' fans and thrilling, non-stop time-pressure gameplay. 24: The Game has multiple character plots and strands and over 100 missions covering multiple genres of game-play including: on-foot sections with shooting, stealth, puzzles and sniping; driving challenges varying from stealthy tailing to high-speed pursuits; interrogations where you have to coerce information out of suspects and gadget sections including decoding information and examining satellite images. [SCEE]… Expand"}, {"name": "Rumble Roses XX", "details_link": "https://www.metacritic.com/game/xbox-360/rumble-roses-xx", "publisher": "Konami", "release_date": "Mar 28 2006", "developers": ["Konami"], "platforms": "Xbox 360", "num_players": "1-4 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/0638ea6b6ff771a16cd0854309b08b47-98.jpg", "descriptions": "The vixens of wrestling are back. Sure Rumble Roses XX delivers the visual \"enhancements\" that you would expect for a next generation game, but this is more than just another pretty face. Get in the ring and unload submission holds, reversals, and an increased number of other new moves toThe vixens of wrestling are back. Sure Rumble Roses XX delivers the visual \"enhancements\" that you would expect for a next generation game, but this is more than just another pretty face. Get in the ring and unload submission holds, reversals, and an increased number of other new moves to take down your opponent. Go online and team up with another beauty in the all-new Tag Team mode or compete in a free-for-all to determine who is Queen in the all-new Battle Royal mode. Fight fair or fight dirty - humiliation is the name of the game. The first and only all-female wrestling experience for the Xbox 360. New gameplay modes include Tag Team, Battle Royal, Elimination and more. New moves: A wider variety of moves and combinations offer a more realistic wresting experience. Compete online as a team or go head-to-head. Choose from more than 20 wrestlers each with a variety of costume changes, and new moves. [Konami]… Expand"}, {"name": "The Old City: Leviathan", "details_link": "https://www.metacritic.com/game/pc/the-old-city-leviathan", "publisher": "PostMod Softworks", "release_date": "Dec  3 2014", "developers": ["PostMod Softworks"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Adventure", "3D", "First-Person"], "meta_score": 62, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/8137b16596fe3b8633325b1f6b464c9a-98.jpg", "descriptions": "The Old City: Leviathan is an experiment in first person exploration that focuses entirely on story. All that exists is you and the world. Set in a decaying city from a civilization long past, The Old City: Leviathan puts the player in the shoes of a sewer dwelling isolationist."}, {"name": "DreamWorks Madagascar: Escape 2 Africa", "details_link": "https://www.metacritic.com/game/wii/dreamworks-madagascar-escape-2-africa", "publisher": "Activision", "release_date": "Nov  4 2008", "developers": ["Toys for Bob"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 62, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/3203f2d360dae893900d1ca3454937f6-98.jpg", "descriptions": "Join Alex the lion, Marty the Zebra, Melman the Giraffe, Gloria the Hippo and their entire madcap MadagascarTM crew on a whole new action-packed journey to save the African savannah in the Madagascar: Escape 2 Africa video game. Your favorite characters from Madagascar return and you canJoin Alex the lion, Marty the Zebra, Melman the Giraffe, Gloria the Hippo and their entire madcap MadagascarTM crew on a whole new action-packed journey to save the African savannah in the Madagascar: Escape 2 Africa video game. Your favorite characters from Madagascar return and you can play them all! In addition to Alex, Marty, Gloria, and Melman, you also get to play as the crafty penguins, the wacky King Julien and new hippo character Moto Moto! Learn all the moves of each character and choose which character is best for the situation at hand. Adventure through 12 levels and 10 tournament mini-games from othe movie and beyond. Experience the characters, settings and situations established in Dreamworks Animation’s new Madagascar movie. Unique new environments include the Watering Hole, a free roaming area that’s been expanded for the game, the volcano and the plane wreck. Master new and expanded tournament mini-games including twice as much multiplayer action as the first Madagascar! [Activision]… Expand"}]