[
  {
    "name": "SingStar: Ultimate Party",
    "details_link": "https://www.metacritic.com/game/playstation-4/singstar-ultimate-party",
    "publisher": "SCEE",
    "release_date": "Oct 24 2014",
    "developers": [
      "SCEE"
    ],
    "platforms": "PlayStation 4",
    "genres": [
      "Miscellaneous",
      "Rhythm",
      "Music"
    ],
    "meta_score": 47,
    "users_score": 4.8,
    "image": "https://static.metacritic.com/images/products/games/4/aba0e792c5066b2bb1bfb862d5a40f5a-98.jpg",
    "descriptions": "Tracklist includes \"Call Me Maybe\" from Carly Rae Jepsen, \"Born This Way\" by Lady Gaga, \"Can't Get You Out Of My Head\" by Kylie Minogue, \"Telemery\" by Bella Novela, and \"Hello\" by Lionel Richie."
  },
  {
    "name": "Tempest",
    "details_link": "https://www.metacritic.com/game/xbox-360/tempest",
    "publisher": "Atari",
    "release_date": "Dec 19 2007",
    "developers": [
      "Stainless Games"
    ],
    "platforms": "Xbox 360",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Static",
      "Static",
      "Shoot-'Em-Up",
      "Top-Down"
    ],
    "meta_score": 47,
    "users_score": 4.5,
    "image": "https://static.metacritic.com/images/products/games/7/892d3be46f02113d13b8e9fb9da31153-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Tempest is one of the most well-known arcade games of all time, a true classic in the realm of video games. This intense shooter requires lots of skill and lightning-quick reflexes. Use unlimited firepower to shoot and destroy enemies in a large geometric battlefield.[Xbox Live Arcade]  Tempest is one of the most well-known arcade games of all time, a true classic in the realm of video games. This intense shooter requires lots of skill and lightning-quick reflexes. Use unlimited firepower to shoot and destroy enemies in a large geometric battlefield. Download the full version to play this classic arcade game in its original form and completely re-stylized versions featuring evolved graphics and newly introduced Throttle Monkey mode. Next-gen presentation: The game supports 4:3 and 16:9 aspect ratios, including HDTV, with full-screen anti-aliasing and Dolby Digital surround sound. Arcade integration: Check top scores on the Leaderboards and master 12 challenging Achievements. [Atari]… Expand"
  },
  {
    "name": "Transformers: The Game",
    "details_link": "https://www.metacritic.com/game/psp/transformers-the-game",
    "publisher": "Activision",
    "release_date": "Jun 19 2007",
    "developers": [
      "Savage Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "PSP"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 47,
    "users_score": 5.2,
    "image": "https://static.metacritic.com/images/products/games/2/9932295ecbea8ebe11bb155a75946b37-98.jpg",
    "descriptions": "Based on the 2007 live-action feature film, Transformers: The Game lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in DisguiseBased on the 2007 live-action feature film, Transformers: The Game lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in Disguise such as BumbleBee, Barricade and others. As the Transformers robot's war comes to Earth, gamers make the choice to join the Autobots in protecting our planet or to join the Decepticons in destroying it. With dual campaigns, the fate of the world is in players' hands. Instantly change from a larger than life robot to a high-powered vehicle such as a sports car, fighter jet or helicopter. Players crush, topple and wreck every object, including buildings and vehicles, in their path or use the objects as weapons. The PSP version features 20 playable Autobots and Decepticons from both the live-action film and previous generations that battle through an enhanced version of the film's storyline.  Players can customize their character by choosing more than 10 different weapon types in both single and adhoc multiplayer gameplay. [Activision]… Expand"
  },
  {
    "name": "James Cameron's Dark Angel",
    "details_link": "https://www.metacritic.com/game/xbox/james-camerons-dark-angel",
    "publisher": "Sierra Entertainment",
    "release_date": "Nov 20 2002",
    "developers": [
      "Radical Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 47,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/5430c7ec37978e7ada7e41acb897f09f-98.jpg",
    "descriptions": "Based on the hit series created by Academy Award® winner James Cameron and Charles H. Eglee. Dark Angel is the story of Max, a genetically enhanced soldier, who cunningly fights to reclaim her manipulated past and avoid capture through the underground landscape of post-apocalypticBased on the hit series created by Academy Award® winner James Cameron and Charles H. Eglee. Dark Angel is the story of Max, a genetically enhanced soldier, who cunningly fights to reclaim her manipulated past and avoid capture through the underground landscape of post-apocalyptic Seattle. Her streetwise instincts and fearless hand-to-hand combat skills are crucial to her survival. Trusted cyber-journalist Logan Cele aids Max's quest to defeat -|- Corp, the secret organization that rose out of the ashes of Manticore, her military creator, and discover the truth of her past.… Expand"
  },
  {
    "name": "And 1 Streetball",
    "details_link": "https://www.metacritic.com/game/xbox/and-1-streetball",
    "publisher": "Ubisoft",
    "release_date": "Jun  6 2006",
    "developers": [
      "Black Ops Entertainment"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Arcade"
    ],
    "meta_score": 46,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/1/ba074c5dd530d7d41193cd34a094ede0-98.jpg",
    "descriptions": "And 1 Streetball brings the flashy street-basketball style from the And 1 Mixtape tour to your home video game consoles. You can create a player from the ground up and take him through the trials of making the And 1 team. The game features a variety of moves inspired by real streetballAnd 1 Streetball brings the flashy street-basketball style from the And 1 Mixtape tour to your home video game consoles. You can create a player from the ground up and take him through the trials of making the And 1 team. The game features a variety of moves inspired by real streetball players and includes venues from around the country--each with its own regional soundtrack. You can choose the size of your games, ranging from one-on-one showdowns to full five-on-five action.… Expand"
  },
  {
    "name": "Star Wars The Clone Wars: Republic Heroes",
    "details_link": "https://www.metacritic.com/game/pc/star-wars-the-clone-wars-republic-heroes",
    "publisher": "LucasArts",
    "release_date": "Oct  6 2009",
    "developers": [
      "LucasArts",
      "Krome Studios"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 46,
    "users_score": 4.8,
    "image": "https://static.metacritic.com/images/products/games/6/8aba47325a14604a48ae8ad0aaf77c3a-98.jpg",
    "descriptions": "Star Wars The Clone Wars: Republic Heroes lets Star Wars fans young and old live out the sweeping galactic adventures of the Clone Wars. For the first time ever, players can fight as their favorite Jedi and clone troopers from the preeminent animated television series - from familiar facesStar Wars The Clone Wars: Republic Heroes lets Star Wars fans young and old live out the sweeping galactic adventures of the Clone Wars. For the first time ever, players can fight as their favorite Jedi and clone troopers from the preeminent animated television series - from familiar faces like Anakin Skywalker to new heroes like Clone Captain Rex. A brand-new storyline, which bridges the gap between season one and two, takes the player on a multi-faceted adventure to stop a mysterious techno assassin's destructive plot. Built around two-player cooperative action, the accessible controls and family-friendly gameplay bring Star Wars fans across generations together like never before to fight the evil Separatists and restore peace to the galaxy. Play as your favorite Jedi heroes including Anakin Skywalker, Obi-Wan Kenobi, Ahsoka Tano, Mace Windu, and Kit Fisto. Slice and dice your way through Separatist droids with your lightsaber and Force powers and use your agility to perform amazing leaps and navigate levels filled with interactivity. Turn your enemies into weapons as you commandeer droids and use their unique abilities to blast enemies and solve puzzles as a Jedi. Be part of an elite clone trooper squad with unique gameplay that puts firepower at your fingertips. Blast droids and unleash devastation with heavy weapons like rocket launchers and thermal detonators as Commander Cody, Captain Rex and all of your favorite clone troopers. Compete against a friend with in-level challenges for rewards and points to be spent to upgrade your character and unlock bonus items. [LucasArts]… Expand"
  },
  {
    "name": "Dungeons & Dragons: Daggerdale",
    "details_link": "https://www.metacritic.com/game/xbox-360/dungeons-dragons-daggerdale",
    "publisher": "Atari",
    "release_date": "May 25 2011",
    "developers": [
      "Bedlam Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Role-Playing",
      "Strategy",
      "Action RPG",
      "General",
      "Action RPG"
    ],
    "meta_score": 46,
    "users_score": 5.0,
    "image": "https://static.metacritic.com/images/products/games/3/1eb25f1301e326eaa89ada0208038126-98.jpg",
    "descriptions": "Dungeons & Dragons Daggerdale centers on the desperate struggle to defeat the evil Rezlus and his Zhentarim in their attempt to invade and conquer the Dalelands.  Dungeons & Dragons Daggerdale is an engaging multi-player experience that introduces a riveting narrative and treacherousDungeons & Dragons Daggerdale centers on the desperate struggle to defeat the evil Rezlus and his Zhentarim in their attempt to invade and conquer the Dalelands.  Dungeons & Dragons Daggerdale is an engaging multi-player experience that introduces a riveting narrative and treacherous new characters.  Players are charged with the task of restoring order to Nentir Vale by unlocking the secrets of the Mines of Tethyamar, defeating the evil within the treacherous Tower of the Void, leading to the final confrontation with Rezlus himself.… Expand"
  },
  {
    "name": "Major Minor's Majestic March",
    "details_link": "https://www.metacritic.com/game/wii/major-minors-majestic-march",
    "publisher": "Majesco Games",
    "release_date": "Apr  2 2009",
    "developers": [
      "NanaOn-Sha"
    ],
    "platforms": "Wii",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 46,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/5/cd401be1a5ca94bdeb98bf54c78f4c8b-98.jpg",
    "descriptions": "In a town where marching bands are prevalent and everyone is looking to be the best, Major Mike Minor is fairly ambivalent towards marches despite hailing from a long line of illustrious Drum Majors. After his parents present him with a \"special\" baton that magically attracts band members toIn a town where marching bands are prevalent and everyone is looking to be the best, Major Mike Minor is fairly ambivalent towards marches despite hailing from a long line of illustrious Drum Majors. After his parents present him with a \"special\" baton that magically attracts band members to fall into rhythm behind the leader, will Major Minor finally fulfill his potential and share the joy of marching with the world? Major Minor's Majestic March marks the return of the creative team behind the renowned PaRappa the Rapper franchise--legendary game designer and multimedia musician Masaya Matsuura and famed New York artist Rodney Alan Greenblat. Your Wii Remote is Major Minor's \"special\" bandleader baton, used to keep tempo, recruit new band members and pick-up valuable items. If your rhythm is unstable confusion will result; band members will drop out and you could ultimately fail the stage. March in 7 different whimsical locations that contain various hair-raising events. Use your best efforts to create the most impressive parade ever whilst nimbly avoiding obstacles. Add 15 different instruments to your procession, from brass to woodwinds to percussion.  As the makeup of the band changes, so does the performance; it all depends on which members you select! Try different combinations each time you play. Numerous modes of play. March and keep tempo to more than 30 well-known marching band tunes from around the world, composed into original medleys for each unique stage. Dazzle the crowd with your incredible baton-twirling displays during brief intermissions. [Majesco]… Expand"
  },
  {
    "name": "101-in-1 Explosive Megamix",
    "details_link": "https://www.metacritic.com/game/ds/101-in-1-explosive-megamix",
    "publisher": "Atlus",
    "release_date": "Apr 21 2009",
    "developers": [
      "Nordcurrent"
    ],
    "platforms": "DS",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Party / Minigame",
      "Action"
    ],
    "meta_score": 46,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/9/fb6702190df40a8d2b60b5d40b12d0e5-98.jpg",
    "descriptions": "Welcome to the home of 101 mind-blowing mini-games for all tastes! Whether you like puzzle games, sport games or fast-paced arcade action, you'll definitely find something to suit you here! You can play alone or team up with your friends in wireless VS battles.\rJump in - ten of hours ofWelcome to the home of 101 mind-blowing mini-games for all tastes! Whether you like puzzle games, sport games or fast-paced arcade action, you'll definitely find something to suit you here! You can play alone or team up with your friends in wireless VS battles.\rJump in - ten of hours of games await you! [Nordcurrent]… Expand"
  },
  {
    "name": "Red Ninja: End of Honor",
    "details_link": "https://www.metacritic.com/game/xbox/red-ninja-end-of-honor",
    "publisher": "VU Games",
    "release_date": "Mar 29 2005",
    "developers": [
      "Tranji"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Historic"
    ],
    "meta_score": 46,
    "users_score": 4.4,
    "image": "https://static.metacritic.com/images/products/games/8/2c542030cdb5d70ef9c2cacf243a16fa-98.jpg",
    "descriptions": "As the power of the samurai class fades, Japan turns to the ninja to uphold political power during chaotic times. One such ninja, Kurenai, lives to avenge her father's death and will go to any means necessary to destroy the Black Lizard Clan. Kurenai is a master of the tetsugen, a wireAs the power of the samurai class fades, Japan turns to the ninja to uphold political power during chaotic times. One such ninja, Kurenai, lives to avenge her father's death and will go to any means necessary to destroy the Black Lizard Clan. Kurenai is a master of the tetsugen, a wire weapon that can cut off an enemy's head or hang them from a tree, depending on the end attachments used and the length and strength of the weapon's wire. Aggressively employing such tactics as wearing disguises, using womanly wiles, and controlling Ninjutsu powers will help you to escape enemies.… Expand"
  },
  {
    "name": "Pokemon Dash",
    "details_link": "https://www.metacritic.com/game/ds/pokemon-dash",
    "publisher": "Nintendo",
    "release_date": "Mar 14 2005",
    "developers": [
      "Ambrella"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "On-foot",
      "Other",
      "On-foot"
    ],
    "meta_score": 46,
    "users_score": 5.3,
    "image": "https://static.metacritic.com/images/products/games/7/01904b23ca1afce17c76caddfe321ce0-98.jpg",
    "descriptions": "Help Pikachu race to the finish line in Pokemon Dash, the first Pokemon title for the Nintendo DS.  Using the touch screen, keep Pikachu running toward the finish line by rubbing the screen in the direction you want the Electric-type Pokemon to go. The faster you rub, the faster PikachuHelp Pikachu race to the finish line in Pokemon Dash, the first Pokemon title for the Nintendo DS.  Using the touch screen, keep Pikachu running toward the finish line by rubbing the screen in the direction you want the Electric-type Pokemon to go. The faster you rub, the faster Pikachu runs. The gameplay takes place from an overhead perspective, with on-screen arrows to guide you to Poké Ball checkpoints along the way. [Nintendo]… Expand"
  },
  {
    "name": "League of War: VR Arena",
    "details_link": "https://www.metacritic.com/game/playstation-4/league-of-war-vr-arena",
    "publisher": "MunkyFun, Inc.",
    "release_date": "Nov  7 2017",
    "developers": [
      "MunkyFun",
      "Inc."
    ],
    "platforms": "PlayStation 4",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "General"
    ],
    "meta_score": 46,
    "users_score": 5.0,
    "image": "https://static.metacritic.com/images/products/games/8/865b2c6265e04ebb5b989cb35e78ab71-98.jpg",
    "descriptions": "League of War: VR Arena is a hands-on, fast-paced war game. Deploy your tanks, choppers, and infantry onto a virtual battlefield, swiftly countering your opponent’s units as you drive towards destroying their base."
  },
  {
    "name": "Zoids Assault",
    "details_link": "https://www.metacritic.com/game/xbox-360/zoids-assault",
    "publisher": "Atlus",
    "release_date": "Sep  9 2008",
    "developers": [
      "Takara Tomy"
    ],
    "platforms": "Xbox 360",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 46,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/602d25ed2a66a83428229589c8e51441-98.jpg",
    "descriptions": "Zoids Assault is a gritty militaristic strategy RPG featuring enormous beasts of steel, exclusively for the Xbox 360. Manage a team of elite war machines through a campaign of intense military conflicts. Advanced upgrade and customization options combine with challenging objective-basedZoids Assault is a gritty militaristic strategy RPG featuring enormous beasts of steel, exclusively for the Xbox 360. Manage a team of elite war machines through a campaign of intense military conflicts. Advanced upgrade and customization options combine with challenging objective-based gameplay to offer a fresh new strategy RPG and a daring new vision of the long-running Zoids universe. Commanders, start your engines (of war)! [Atlus]… Expand"
  },
  {
    "name": "The Amazing Spider-Man 2",
    "details_link": "https://www.metacritic.com/game/xbox-one/the-amazing-spider-man-2",
    "publisher": "Activision",
    "release_date": "Apr 29 2014",
    "developers": [
      "Beenox"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Wii U",
      "Xbox 360",
      "Xbox One"
    ],
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "General",
      "Open-World"
    ],
    "meta_score": 46,
    "users_score": 4.9,
    "image": "https://static.metacritic.com/images/products/games/6/d004e56eeb8c2a20759acaeaf0c6b691-98.jpg",
    "descriptions": "The Amazing Spider-Man, this all-new third-person action-adventure video game builds on the story of the previous game with an alternative take on the events of the upcoming movie, while also giving players an enhanced, free-roaming web-slinging experience through a greatly expanded New York City."
  },
  {
    "name": "Starship Troopers",
    "details_link": "https://www.metacritic.com/game/pc/starship-troopers",
    "publisher": "Empire Interactive",
    "release_date": "Nov 15 2005",
    "developers": [
      "Strangelite"
    ],
    "platforms": "PC",
    "num_players": "Up to 32 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 46,
    "users_score": 5.9,
    "image": "https://static.metacritic.com/images/products/games/7/4ae8efe10cf3e2410244395f0164fc8c-98.jpg",
    "descriptions": "Starship Troopers introduces a terrifying assortment of enemy bugs for you to destroy, with an impressive range of weapons at your disposal, from the classic M2 Morita Rifle through to the infamous nuke launcher. Over 300 of your arachnid foe's can be tackled on screen at any given time.Starship Troopers introduces a terrifying assortment of enemy bugs for you to destroy, with an impressive range of weapons at your disposal, from the classic M2 Morita Rifle through to the infamous nuke launcher. Over 300 of your arachnid foe's can be tackled on screen at any given time. This has to be played to be believed! Become totally immersed in immense bug-blasting battles in both famous action-packed scenes from the movie and never-before-experienced settings and stories from the Starship Troopers universe. [Strangelite]… Expand"
  },
  {
    "name": "Summer Sports: Paradise Island",
    "details_link": "https://www.metacritic.com/game/wii/summer-sports-paradise-island",
    "publisher": "Destineer",
    "release_date": "Apr 15 2008",
    "developers": [
      "Destineer"
    ],
    "platforms": "Wii",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Olympic Sports",
      "Olympic Sports",
      "Individual",
      "Athletics"
    ],
    "meta_score": 46,
    "users_score": 4.8,
    "image": "https://static.metacritic.com/images/products/games/0/2952381de23428f6039f866069161d99-98.jpg",
    "descriptions": "Check into the Paradise Island Resort and explore the vast array of recreational activities in a lush tropical environment. Compete against friends in a collection of summer-themed games including Basketball, Croquet, Lawn Darts, Badminton, Volleyball, Horse Shoes, and Mini-Golf. Bump, set,Check into the Paradise Island Resort and explore the vast array of recreational activities in a lush tropical environment. Compete against friends in a collection of summer-themed games including Basketball, Croquet, Lawn Darts, Badminton, Volleyball, Horse Shoes, and Mini-Golf. Bump, set, spike, throw, putt, shoot, swing, and more – all with intuitive Wii Remote gestures.… Expand"
  },
  {
    "name": "Harvest Moon 3D: The Lost Valley",
    "details_link": "https://www.metacritic.com/game/3ds/harvest-moon-3d-the-lost-valley",
    "publisher": "Natsume",
    "release_date": "Nov  4 2014",
    "developers": [
      "Natsume"
    ],
    "platforms": "3DS",
    "genres": [
      "Strategy",
      "General",
      "Management",
      "Breeding/Constructing",
      "Business / Tycoon"
    ],
    "meta_score": 46,
    "users_score": 4.1,
    "image": "https://static.metacritic.com/images/products/games/4/d6f17f93706e8b848a533cd86eea08fb-98.jpg",
    "descriptions": "In Harvest Moon: The Lost Valley, players will experience the role-playing farm simulation in a three-dimensional setting for the first time. The game has a fully customizable world, and players can customize their field in any way they see fit: from a field full of tulips like you might seeIn Harvest Moon: The Lost Valley, players will experience the role-playing farm simulation in a three-dimensional setting for the first time. The game has a fully customizable world, and players can customize their field in any way they see fit: from a field full of tulips like you might see in Holland, to a valley filled with water like Venice, the choice is up to you. You've never played a Harvest Moon game quite like this!… Expand"
  },
  {
    "name": "My Street",
    "details_link": "https://www.metacritic.com/game/playstation-2/my-street",
    "publisher": "SCEA",
    "release_date": "Mar  9 2003",
    "developers": [
      "Idol Minds"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Miscellaneous",
      "Party"
    ],
    "meta_score": 46,
    "users_score": 3.6,
    "image": "https://static.metacritic.com/images/products/games/8/378b40cb4346521cd5f08c9778fb598f-98.jpg",
    "descriptions": "Be the best on your block playing Volleyball, RC Racing, Marbles, Dodgeball, Chemistry (a la \"Puyo Pop\"), Chicken Herding (quasi \"Chu Chu Rocket\"), and a kart-racer called Lawmowers."
  },
  {
    "name": "Fish Tycoon",
    "details_link": "https://www.metacritic.com/game/ds/fish-tycoon",
    "publisher": "Majesco Games",
    "release_date": "Oct 16 2007",
    "developers": [
      "LDW",
      "Big Fish Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "iPhone/iPad",
      "PC",
      "DS"
    ],
    "genres": [
      "Strategy",
      "Tycoon",
      "Management",
      "Tycoon",
      "Business / Tycoon"
    ],
    "meta_score": 46,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/8/706ad7f6294bc4716ef27216879733ca-98.jpg",
    "descriptions": "Staying alive even when the Nintendo DS is off, Fish Tycoon is a fish-breeding simulation that lets players raise fish in real-time virtual aquariums and crossbreed them to their liking to create new breeds to sell in their store. Selling fish provides funding for supplies, medicine, specialStaying alive even when the Nintendo DS is off, Fish Tycoon is a fish-breeding simulation that lets players raise fish in real-time virtual aquariums and crossbreed them to their liking to create new breeds to sell in their store. Selling fish provides funding for supplies, medicine, special chemicals, technology research and store advertising to attract more customers. Players start with a small selection of fish that they must nurture and breed as they work to discover the correct genetic combination for the “7 Magic Fish.” Special DS-only features: 7 exclusive fish yield nearly twice as many fish types as the PC version (over 750!); all new 3D environments and several new tank decorations; Extensive use of the Touch Screen to breed fish, make purchases and decorate tanks; Simulated real-time experience yields potential surprises every time you turn the game on. Choose from 4 speed options to dictate how time passes in game. Take regular care of your fish or watch your hard work get flushed down the drain! Set your own prices for specific fish based on prior sales and present needs; Buy fish tanks, decorations, plants, fish eggs, fish food, and medicine to enhance the aesthetic of your tank; Research environment, food, and advertising techniques to discover how to keep your rare fish healthy, feed more fish per feeding and attract additional customers. [Majesco Games]… Expand"
  },
  {
    "name": "Cooking Mama: Cookstar",
    "details_link": "https://www.metacritic.com/game/switch/cooking-mama-cookstar",
    "publisher": "Planet Entertainment",
    "release_date": "Mar 31 2020",
    "developers": [
      "1st Playable Productions",
      "Planet Entertainment"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "General",
      "Puzzle",
      "Simulation",
      "Virtual",
      "Career"
    ],
    "meta_score": 46,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/8/c03e285c925bc28013257046b47e48c5-98.jpg",
    "descriptions": "If you can’t stand the heat, get into Mama’s kitchen! Cooking Mama is back with her most fantastic and fun video game adventure ever. Introducing Cooking Mama: Cookstar. A brand-new Cooking Mama experience created specifically for Nintendo Switch™. Cooking Mama: Cookstar features over 90If you can’t stand the heat, get into Mama’s kitchen! Cooking Mama is back with her most fantastic and fun video game adventure ever. Introducing Cooking Mama: Cookstar. A brand-new Cooking Mama experience created specifically for Nintendo Switch™. Cooking Mama: Cookstar features over 90 incredible new recipes for players to master. Cook everything from classic Japanese recipes to today’s most tasty comfort foods. Cooking Mama Switch truly has a taste of everything. Not a carnivore? Not a problem! For the first time ever Cooking Mama will feature both a traditional cooking mode and a vegetarian cooking mode. Burritos, Bibimbap, Bubble Tea, Baked Alaska, Pokebowls and so much more. Explore the diverse menu to find what suits your taste. Don’t think you have the skills to become a master chef? Don’t worry, Mama will fix that! Just follow Mama’s instructions and create delicious and decadent treats that you can share with your friends. Chop, mince, slice, dice and roll! Precision motion controls immerse players right into the action. With Mama’s help, you will become the world’s greatest culinary artist. … Expand"
  },
  {
    "name": "Raid: World War II",
    "details_link": "https://www.metacritic.com/game/xbox-one/raid-world-war-ii",
    "publisher": "Starbreeze",
    "release_date": "Oct 10 2017",
    "developers": [
      "Starbreeze",
      "Lion Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 46,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/7/f47383519a373c175b71a08c4c9f61e5-98.jpg",
    "descriptions": "Raid: World War II is an action-packed four player cooperative shooter set during a time when the Nazi war machine was still winning, and hope was in short supply. \r\rDuring the worldwide fight against evil, four prisoners of war are found in a raid on a Gestapo jail. They have been freedRaid: World War II is an action-packed four player cooperative shooter set during a time when the Nazi war machine was still winning, and hope was in short supply. \r\rDuring the worldwide fight against evil, four prisoners of war are found in a raid on a Gestapo jail. They have been freed by a \"Mrs. White,\" a secret British intelligence agent, who needs someone to take down Hitler and his Third Reich once and for all. \r\rNot every part of the war effort is noble. In fact, Mrs. White has something else in mind for the squad. Players will fight for their freedom via sabotage, robberies and assassinations of the Nazi Party. If they're stealing from the Nazis, why not get rich on the side?… Expand"
  },
  null,
  {
    "name": "Shadow Assault -Tenchu-",
    "details_link": "https://www.metacritic.com/game/xbox-360/shadow-assault--tenchu-",
    "publisher": "From Software",
    "release_date": "Oct  8 2008",
    "developers": [
      "From Software"
    ],
    "platforms": "Xbox 360",
    "num_players": "4  Online",
    "genres": [
      "Action",
      "General",
      "General"
    ],
    "meta_score": 46,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/8/f5882c5306f166ddae83cef759ac0ecb-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Experience the Tenchu universe like never before in Shadow Assault Tenchu. Play single-player or with up to three other players in unique Japanese-themed environments as you employ stealth and strategy in an effort to take out your enemies. Single-player action: Different[Xbox Live Arcade]  Experience the Tenchu universe like never before in Shadow Assault Tenchu. Play single-player or with up to three other players in unique Japanese-themed environments as you employ stealth and strategy in an effort to take out your enemies. Single-player action: Different game modes require you to sneak through rooms avoiding the attention of guards, or require you to take out everyone on-screen by well-placed traps. Multiplayer: Play with up to three of your friends for both frantic and strategic action. Tenchu characters: All the characters from the Tenchu universe are here: Rikimaru, Ayame, Tesshu, and Rin. Achievements: Twelve new achievements are included for you to conquer. [Microsoft]… Expand"
  },
  {
    "name": "Nightcaster II: Equinox",
    "details_link": "https://www.metacritic.com/game/xbox/nightcaster-ii-equinox",
    "publisher": "Jaleco Entertainment",
    "release_date": "Dec 11 2002",
    "developers": [
      "Jaleco Entertainment"
    ],
    "platforms": "Xbox",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 46,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/1/f34233775ea23d4516a2fe430b644c0b-98.jpg",
    "descriptions": "Nightcaster II: Equinox is a vibrant 3D action spell-shooter set in a dark fantasy world.  Embark on your adventure as Madelyn, the warrior, or Arran, her husband and the hero of the first Nightcaster.  This fast moving adventure features multidirectional spell casting combined with intenseNightcaster II: Equinox is a vibrant 3D action spell-shooter set in a dark fantasy world.  Embark on your adventure as Madelyn, the warrior, or Arran, her husband and the hero of the first Nightcaster.  This fast moving adventure features multidirectional spell casting combined with intense melee combat to create an exhilarating and captivating gameplay experience.  With more than 35 types of goblins, trolls, dragons, and other enemies to decimate, you will certainly have your hands full.… Expand"
  },
  {
    "name": "Sega Classics Collection",
    "details_link": "https://www.metacritic.com/game/playstation-2/sega-classics-collection",
    "publisher": "Sega",
    "release_date": "Mar 22 2005",
    "developers": [
      "Sega"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 46,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/2/4d53ea9480bdb82ff3cccc79bfa6ecce-98.jpg",
    "descriptions": "Re-live the thrill and excitement of the SEGA classic games that changed the world of video games. Now with enhanced graphics and sound for a superior gameplay experience. The Sega Classics Collection includes: Outrun, Golden Axe, Space Harrier, Columns, Alien Syndrome, Fantasy Zone, MonacoRe-live the thrill and excitement of the SEGA classic games that changed the world of video games. Now with enhanced graphics and sound for a superior gameplay experience. The Sega Classics Collection includes: Outrun, Golden Axe, Space Harrier, Columns, Alien Syndrome, Fantasy Zone, Monaco GP, Virtua Racing, and Tant R & Bonanza Bros. [Sega]… Expand"
  },
  {
    "name": "The History Channel: Great Battles of Rome",
    "details_link": "https://www.metacritic.com/game/pc/the-history-channel-great-battles-of-rome",
    "publisher": "cdv Software",
    "release_date": "Oct 15 2007",
    "developers": [
      "Slitherine Software",
      "Slitherine"
    ],
    "platforms": "PC",
    "num_players": "1-2 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "General"
    ],
    "meta_score": 46,
    "users_score": 3.2,
    "image": "https://static.metacritic.com/images/products/games/4/62afb3471ba6e908f591e6e4a538c8b0-98.jpg",
    "descriptions": "(Currently available in the UK/EU only)  Merging action and strategy in a setting that replicates the atmosphere of the period, The History Channel: Great Battles of Rome allows players to take control of a series of campaigns against Barbarian hordes, while carving out the Roman Empire.(Currently available in the UK/EU only)  Merging action and strategy in a setting that replicates the atmosphere of the period, The History Channel: Great Battles of Rome allows players to take control of a series of campaigns against Barbarian hordes, while carving out the Roman Empire. Over 100 battles are available for play including the Punic and Samnite Wars, and Julius Caesar's conquest of Britain. Players can customize and control massive armies with an array of soldiers including gbraries, archers, cavalry and even mighty war-elephants. The game delivers battle realism in various environments, including steppe, forest, desert and coastline, with both day and night lighting. [Black Bean Games]… Expand"
  },
  {
    "name": "Elite Warriors: Vietnam",
    "details_link": "https://www.metacritic.com/game/pc/elite-warriors-vietnam",
    "publisher": "Bold Games",
    "release_date": "Mar 25 2005",
    "developers": [
      "Nfusion"
    ],
    "platforms": "PC",
    "num_players": "32  Online",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Historic",
      "Historic",
      "Arcade"
    ],
    "meta_score": 46,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/4/7e9693a2f1731ee08e641e168f0f0724-98.jpg",
    "descriptions": "The Vietnam War’s most highly classified special operations were performed by the Studies and Operations Group. Consisting primarily of U.S. Army Special Forces “Green Berets,” SOG warriors fought top secret missions deep behind enemy lines. Infiltrate deep into Laos with your Green BeretThe Vietnam War’s most highly classified special operations were performed by the Studies and Operations Group. Consisting primarily of U.S. Army Special Forces “Green Berets,” SOG warriors fought top secret missions deep behind enemy lines. Infiltrate deep into Laos with your Green Beret and Montagnard teammates, hunted by trackers and bloodhounds, outnumbered at times 100-to-1. Rescue downed pilots, ambush convoys, seize enemy prisoners, discover targets for air attacks, and direct air strikes. See why SOG veterans went on to found Delta Force and in the work of secret operations, remain stuff of legends. Operating in the most dangerous conditions imaginable SOG commandos matched wits with an unrelenting foe. Take part in the top secret world of \"Black Ops\" unconventional warfare. Engage in highly classified operations throughout Southeast Asia. Eight realistic campaigns that take place in multiple phases. Uses Combat Patrol techniques learned in Vietnam and still valid today. Team Building – Train and equip your team and then lead them on covert missions. [Bold Games]… Expand"
  },
  {
    "name": "Tony Hawk Ride",
    "details_link": "https://www.metacritic.com/game/xbox-360/tony-hawk-ride",
    "publisher": "Activision",
    "release_date": "Nov 17 2009",
    "developers": [
      "Robomodo"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Sports",
      "Alternative",
      "Individual",
      "Skateboarding",
      "Skateboarding",
      "Skate / Skateboard"
    ],
    "meta_score": 46,
    "users_score": 3.0,
    "image": "https://static.metacritic.com/images/products/games/9/987afb0480f437472e0bc82e6c3a9c63-98.jpg",
    "descriptions": "Players can experience skateboarding like never before in Tony Hawk: RIDE. For the first time, players have the ability to physically play the game using an innovative motion sensing skateboard controller, allowing for unprecedented freedom and movement. Tony Hawk: RIDE focuses on innovationPlayers can experience skateboarding like never before in Tony Hawk: RIDE. For the first time, players have the ability to physically play the game using an innovative motion sensing skateboard controller, allowing for unprecedented freedom and movement. Tony Hawk: RIDE focuses on innovation and fun, bringing the #1 best-selling action-sports franchise to the forefront with cutting-edge technology for the hardcore fans and accessibility for the mass audience. Tony Hawk: RIDE features a wireless skateboard controller designed in conjunction with the game to offer a dynamic gaming experience built from the ground up. Using a combination of accelerometers and motion sensors, the intuitive controller allows players to physically control the action by performing various movements and gestures on the board that directly translate into amazing tricks in the game.  Without complex button combinations or analog sticks, gamers of all skill levels can literally step on the board and play! [Activision]… Expand"
  },
  {
    "name": "Desert Child",
    "details_link": "https://www.metacritic.com/game/switch/desert-child",
    "publisher": "Akupara Games",
    "release_date": "Dec 11 2018",
    "developers": [
      "Oscar Brittain"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Racing",
      "Arcade",
      "Futuristic"
    ],
    "meta_score": 46,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/9/d4f6a0fca0b52eede53ec5da03a5735c-98.jpg",
    "descriptions": "Assume the role of a young hoverbike racer who needs to figure out how to scrape enough cash together through racing and odd jobs to punch your one-way ticket to the Red Planet to enter the biggest race in the universe, the Grand Prix."
  },
  {
    "name": "Spectral Force Genesis",
    "details_link": "https://www.metacritic.com/game/ds/spectral-force-genesis",
    "publisher": "Ignition Entertainment",
    "release_date": "Mar 12 2010",
    "developers": [
      "Neverland",
      "Idea Factory"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Strategy",
      "General",
      "General"
    ],
    "meta_score": 46,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/6/34d51ea2dea819ed1346fccc777d8351-98.jpg",
    "descriptions": "A very complete tactical RPG with One goal: conquer the world (you start as the ruler of a single country), Battle strategies, troop placements, and an extensive view of the battlefield."
  },
  {
    "name": "GTI Club Supermini Festa!",
    "details_link": "https://www.metacritic.com/game/wii/gti-club-supermini-festa!",
    "publisher": "Konami",
    "release_date": "Mar 16 2010",
    "developers": [
      "Konami"
    ],
    "platforms": "Wii",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 46,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/2/35c984e8ae2be3c82d0710712786055c-98.jpg",
    "descriptions": "Part of GTI Club Supermini Festa!'s unique racing experience lies in the marriage of content, competition and customization. Some of the world's most recognizable vehicles are ready to be raced including the ABARTH 500, MINI Cooper S, PEUGEOT 207 GTi, RENAULT Sport CLIO V6 and many more!Part of GTI Club Supermini Festa!'s unique racing experience lies in the marriage of content, competition and customization. Some of the world's most recognizable vehicles are ready to be raced including the ABARTH 500, MINI Cooper S, PEUGEOT 207 GTi, RENAULT Sport CLIO V6 and many more! Cars are also customizable so players can enter the garage and personalize their cars from ground up. Action-packed multiplayer games puts up to four players in hi-speed racing competitions via Nintendo Wi-Fi connection on Wii and via ad-hoc party for PSP. Players can also change the course of the competition with a variety of multiplayer party games including \"Tomato Festival\" and \"Bomb Tag.\" GTI Club Supermini Festa! will continue to keep fans clamoring for content, as free custom patterns for each car will be available for download via the Wii Wi-Fi Connection beginning at launch. [Konami]… Expand"
  },
  {
    "name": "BeachHead 2000",
    "details_link": "https://www.metacritic.com/game/pc/beachhead-2000",
    "publisher": "WizardWorks",
    "release_date": "Jun 14 2000",
    "developers": [
      "Digital Fusion Inc."
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "General",
      "Shooter",
      "First-Person",
      "Rail",
      "Arcade"
    ],
    "meta_score": 46,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/9/a0be7a9efca8fec04d2661419b3e4234-98.jpg",
    "descriptions": "As a lone gunner, you're the last defense against an onslaught of enemy fire. Keep a steady aim and blast away at land, sea, and air forces as they rush you from every direction. Engage yourself in limitless levels of white-knuckle action, stunning photo-realistic graphics, and earthshakingAs a lone gunner, you're the last defense against an onslaught of enemy fire. Keep a steady aim and blast away at land, sea, and air forces as they rush you from every direction. Engage yourself in limitless levels of white-knuckle action, stunning photo-realistic graphics, and earthshaking sound effects.  [WizardWorks]… Expand"
  },
  {
    "name": "WWII Tank Commander",
    "details_link": "https://www.metacritic.com/game/pc/wwii-tank-commander",
    "publisher": "Merscom LLC",
    "release_date": "Feb 14 2006",
    "developers": [
      "Sylum Entertainment"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Historic"
    ],
    "meta_score": 46,
    "users_score": 4.4,
    "image": "https://static.metacritic.com/images/products/games/1/090639c8af1f2afa581e6c63bd063cf1-98.jpg",
    "descriptions": "It's World War II, and from France to Germany, prepare to destroy the opposition and help free Europe from Nazi rule as you take command of a Sherman tank in General Patton’s Fourth Armored Division, Patton's best and most elite division. Cut off the enemy at the Brittany Peninsula, escortIt's World War II, and from France to Germany, prepare to destroy the opposition and help free Europe from Nazi rule as you take command of a Sherman tank in General Patton’s Fourth Armored Division, Patton's best and most elite division. Cut off the enemy at the Brittany Peninsula, escort Allied convoys, and smash Nazi forces across the Moselle. Rescue hostages, relieve the besieged 101st Airborne at Bastogne, cross the Rhine, and drive German forces out of France. [Got Game Entertainment]… Expand"
  },
  {
    "name": "Carrier Command: Gaea Mission",
    "details_link": "https://www.metacritic.com/game/xbox-360/carrier-command-gaea-mission",
    "publisher": "Rising Star Games",
    "release_date": "Oct  2 2012",
    "developers": [
      "Bohemia Interactive"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Adventure",
      "Real-Time",
      "3D",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Command"
    ],
    "meta_score": 46,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/7/904b46a439d6d9574d8db719905552ed-98.jpg",
    "descriptions": "Carrier Command: Gaea Mission, set in the Gaea Universe and based on a story adapted from the science fiction trilogy of novels, reinvents the classic gameplay of the original Carrier Command released in 1988 in next-gen experience."
  },
  {
    "name": "Arcade Sports",
    "details_link": "https://www.metacritic.com/game/wii/arcade-sports",
    "publisher": "Icon Games",
    "release_date": "Jun 14 2010",
    "developers": [
      "Icon Games"
    ],
    "platforms": "Wii",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "General",
      "General"
    ],
    "meta_score": 46,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/6/74a0b52835cdd29c4fe2d9a120cf11d0-98.jpg",
    "descriptions": "[WiiWare]  Arcade Sports consists of a selection of four full-featured arcade sports games including Air Hockey, Bowling, Pool and Snooker."
  },
  {
    "name": "Freedom Wings",
    "details_link": "https://www.metacritic.com/game/ds/freedom-wings",
    "publisher": "Natsume",
    "release_date": "Aug 21 2006",
    "developers": [
      "Beluga Computer"
    ],
    "platforms": "DS",
    "num_players": "1-4 ",
    "genres": [
      "Simulation",
      "Flight",
      "Civilian Plane",
      "Civilian Plane",
      "Combat"
    ],
    "meta_score": 46,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/0/893419795c2cd26593faae30fb12e957-98.jpg",
    "descriptions": "It was the age of aircraft. Due to the necessity of travel between the great many islands of the South Sea, aircrafts were the main choice of transportation. Some flew for adventure...Some flew for wealth...For whatever the reason many took to the air. And there were those that used aircraftIt was the age of aircraft. Due to the necessity of travel between the great many islands of the South Sea, aircrafts were the main choice of transportation. Some flew for adventure...Some flew for wealth...For whatever the reason many took to the air. And there were those that used aircraft to prey upon them...The government had to put a stop to these evil pirates. They selected the world's top pilots and set up the Air Patrol Association (A.P.A) in hopes of making the skies safe once again.Innovative combat system - beginning players can use AI COMBAT where the system will help lock on and fly the various planes or experienced players can use the MANUAL COMBAT where they control all the action. Use the Touch Screen to control your plane, lock-on to various enemies or plan your flight path. [Natsume]… Expand"
  },
  {
    "name": "Coffin Dodgers",
    "details_link": "https://www.metacritic.com/game/xbox-one/coffin-dodgers",
    "publisher": "Wales Interactive",
    "release_date": "May  6 2016",
    "developers": [
      "Milky Tea Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "genres": [
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 46,
    "users_score": 3.8,
    "image": "https://static.metacritic.com/images/products/games/4/0ad86f785b0c2bf44e5ade1751ac91ce-98.jpg",
    "descriptions": "Welcome to a suburban retirement village where all is not as it seems…\rAfter settling down to recover from the responsibilities of working life, the residents of Sunny Pines have been idling away the days, life could not be more tranquil. However, a creepy new resident, Mr Grim Reaper,Welcome to a suburban retirement village where all is not as it seems…\rAfter settling down to recover from the responsibilities of working life, the residents of Sunny Pines have been idling away the days, life could not be more tranquil. However, a creepy new resident, Mr Grim Reaper, looks set to turn retirement on its head… After years trawling the earth for souls to harvest, Mr Grim Reaper concludes Sunny Pines is where he’ll lay his hat; here he can harvest souls from the comfort of his rocking chair. However, seven of the sprightliest OAPs (old age pensioners) have other ideas and set out to prove that life for Grim at Sunny Pines definitely won’t be like shooting fish in a barrel.… Expand"
  },
  {
    "name": "Primal Carnage: Extinction",
    "details_link": "https://www.metacritic.com/game/playstation-4/primal-carnage-extinction",
    "publisher": "Panic Button",
    "release_date": "Oct 20 2015",
    "developers": [
      "Lukewarm Media",
      "Circle 5",
      "Circle 5 Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Action Adventure",
      "Sci-Fi",
      "General",
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 46,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/2/d389d5a7e39c9708f7b8ffa6eac13f5e-98.jpg",
    "descriptions": "Primal Carnage: Extinction is a class-based online multiplayer shooter featuring humans versus dinosaurs."
  },
  {
    "name": "Gravitronix",
    "details_link": "https://www.metacritic.com/game/wii/gravitronix",
    "publisher": "Medaverse Studios",
    "release_date": "Oct 12 2009",
    "developers": [
      "Medaverse Studios"
    ],
    "platforms": "Wii",
    "num_players": "1-8 ",
    "genres": [
      "Action",
      "General",
      "General"
    ],
    "meta_score": 46,
    "users_score": 5.0,
    "image": "https://static.metacritic.com/images/products/games/7/1ea1f5d8e94eeb61477eff5402058d4b-98.jpg",
    "descriptions": "[WiiWare]  It's time to claim your rightful place as the champion of the Gravitronix arena, but get ready to deal with up to seven other players who are all shooting for the same title. Vanquish your opponents with four different projectiles and the powerful beams of your gravity platform.[WiiWare]  It's time to claim your rightful place as the champion of the Gravitronix arena, but get ready to deal with up to seven other players who are all shooting for the same title. Vanquish your opponents with four different projectiles and the powerful beams of your gravity platform. Intercept attacks and take careful aim at exposed vulnerabilities. Deflect incoming projectiles or capture and charge them with energy for devastating explosive attacks. Team up with a friend and battle through campaign mode, or recruit up to eight players on a single Wii system in versus mode for an all-out battle. Customize your matches with a variety of different options, such as flooding the arena with projectiles or making the game insanely fast. No matter how you like to play, grab your friends and have a blast. [Medaverse Studios]… Expand"
  },
  {
    "name": "Tokyo Xtreme Racer DRIFT 2",
    "details_link": "https://www.metacritic.com/game/playstation-2/tokyo-xtreme-racer-drift-2",
    "publisher": "Crave",
    "release_date": "Apr 17 2007",
    "developers": [
      "Genki"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "GT / Street"
    ],
    "meta_score": 46,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/f2b2ebf60030eb3252aeaa708dee84e6-98.jpg",
    "descriptions": "The mountains of Japan are calling – and so are your racing rivals. With the mysterious disappearance of the reigning champion, the tournament crown is suddenly up for grabs.  Many will vie, only one can win.  Do you have what it takes to race, grind and drift your way to the ultimate racingThe mountains of Japan are calling – and so are your racing rivals. With the mysterious disappearance of the reigning champion, the tournament crown is suddenly up for grabs.  Many will vie, only one can win.  Do you have what it takes to race, grind and drift your way to the ultimate racing prize? Race in the dangerous mountains of Japan – Hakone, Niko, Haruna and Akagi - all faithfully recreated using the most advanced laser techniques to maintain every tight twist and hazardous turn. Enter your car in legal races held during the day for money - enter the underground races at night to defeat your bitter rivals.  The championship and glory are waiting. Race over 180 true-to-life cars from 16 manufactures. Hunt down rivals on the track and in off road rallies. Unleash your inner gearhead with unlimited engine alterations. Tweak your car to the exact specification for your race and driving style. Beware of changing weather that affects your race. Experience an engaging story as you race where drifting was born. [Crave Entertainment]… Expand"
  },
  {
    "name": "Grand Theft Auto: The Trilogy - The Definitive Edition",
    "details_link": "https://www.metacritic.com/game/switch/grand-theft-auto-the-trilogy---the-definitive-edition",
    "publisher": "Rockstar Games",
    "release_date": "Nov 11 2021",
    "developers": [
      "Rockstar Games",
      "Grove Street Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 46,
    "users_score": 0.9,
    "image": "https://static.metacritic.com/images/products/games/8/ae4662af408ad330a408c5f58090e10a-98.jpg",
    "descriptions": "Three iconic cities, three epic stories. Play the genre-defining classics of the original Grand Theft Auto Trilogy: Grand Theft Auto III, Grand Theft Auto: Vice City and Grand Theft Auto: San Andreas updated for a new generation, now with across-the-board enhancements including brilliant newThree iconic cities, three epic stories. Play the genre-defining classics of the original Grand Theft Auto Trilogy: Grand Theft Auto III, Grand Theft Auto: Vice City and Grand Theft Auto: San Andreas updated for a new generation, now with across-the-board enhancements including brilliant new lighting and environmental upgrades, high-resolution textures, increased draw distances, Grand Theft Auto V-style controls and targeting, and much more, bringing these beloved worlds to life with all new levels of detail.… Expand"
  },
  {
    "name": "Bus Simulator 16",
    "details_link": "https://www.metacritic.com/game/pc/bus-simulator-16",
    "publisher": "astragon",
    "release_date": "Mar  2 2016",
    "developers": [
      "Still Alive Studios"
    ],
    "platforms": "PC",
    "genres": [
      "Simulation",
      "Vehicle",
      "Civilian"
    ],
    "meta_score": 46,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/0/3fc5cb6637950833a813c625506083b2-98.jpg",
    "descriptions": "Win the daily battle with the clock—become a bus driver. In Bus Simulator, you'll assume the controls of one of 6 true-to-life city buses, licensed by companies such as MAN, and drive your passengers through 5 realistic districts of a city."
  },
  {
    "name": "Kakuto Chojin",
    "details_link": "https://www.metacritic.com/game/xbox/kakuto-chojin",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov 11 2002",
    "developers": [
      "DreamFactory"
    ],
    "platforms": "Xbox",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 46,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/8/743ee426b6b1b92f2d8f7a788dfefdfb-98.jpg",
    "descriptions": "From the burned out warehouses, darkened alleys, and gritty streets of Drasuka, Kakuto masters gather to prove themselves in the ultimate fight club. Enter Fist of Fire, the brutal underground tournament whose members erupt in savage fury to kick, gouge, and pummel their way to the top."
  },
  {
    "name": "The Mummy",
    "details_link": "https://www.metacritic.com/game/pc/the-mummy",
    "publisher": "Konami",
    "release_date": "Nov 17 2000",
    "developers": [
      "Rebellion"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "General"
    ],
    "meta_score": 46,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/5/3187b6dc93712023f797026527383789-98.jpg",
    "descriptions": "Konami hopes to mimic the state of the art visual effects of the film in their upcoming title, The Mummy. The game puts players in control of the film's heroes as they fight evil hordes in the ultimate quest to vanquish the guardian Mummy."
  },
  {
    "name": "RayStorm HD",
    "details_link": "https://www.metacritic.com/game/xbox-360/raystorm-hd",
    "publisher": "Taito Corporation",
    "release_date": "May  5 2010",
    "developers": [
      "Taito Corporation"
    ],
    "platforms": "Xbox 360",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Scrolling",
      "Scrolling",
      "Shoot-'Em-Up",
      "Vertical"
    ],
    "meta_score": 46,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/8/715d79e5ae43eb5cb2ccf3d5b8b9f90b-98.jpg",
    "descriptions": "[Xbox Live Arcade]  The classic shooting game returns with the original gameplay and newly updated graphics in RAYSTORM HD. You control the R-GRAY, a fighter plane equipped with a lock-on laser system, and battle your way through eight stages. A variety of game modes includes Arcade Mode and[Xbox Live Arcade]  The classic shooting game returns with the original gameplay and newly updated graphics in RAYSTORM HD. You control the R-GRAY, a fighter plane equipped with a lock-on laser system, and battle your way through eight stages. A variety of game modes includes Arcade Mode and Extra Mode, with four selectable planes including the untested new R-GEAR. Rankings can be registered, and replay data can be uploaded and downloaded online. [Xbox.com]… Expand"
  },
  {
    "name": "Inmates",
    "details_link": "https://www.metacritic.com/game/pc/inmates",
    "publisher": "Iceberg Interactive",
    "release_date": "Oct  5 2017",
    "developers": [
      "Iceberg Interactive",
      "Davit Andreasyan"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Adventure",
      "General",
      "3D",
      "First-Person"
    ],
    "meta_score": 46,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/5/b66e06bbacb635d4ca4ef947e377864e-98.jpg",
    "descriptions": "Inmates is a story-driven, atmospheric psychological horror game in which you must find out the truth behind your confinement and uncover the dark secrets of the run-down prison you find yourself in. Delve deep into your psyche while trying to stay sane, in this most disturbing of horror games."
  },
  {
    "name": "Alien Rage",
    "details_link": "https://www.metacritic.com/game/xbox-360/alien-rage",
    "publisher": "CI Games",
    "release_date": "Oct 18 2013",
    "developers": [
      "CI Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 46,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/2/6e9948aef4f24f82319beb5b0e520dd7-98.jpg",
    "descriptions": "Alien Fear is an Unreal Engine 3-powered arcade FPS that is coming to XBLA and Sony Entertainment Network."
  },
  {
    "name": "The Incredible Hulk",
    "details_link": "https://www.metacritic.com/game/wii/the-incredible-hulk",
    "publisher": "Sega",
    "release_date": "Jun  5 2008",
    "developers": [
      "Edge of Reality"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "General"
    ],
    "meta_score": 46,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/4/b1e1e4765c0b374364ec3ae67679e7c0-98.jpg",
    "descriptions": "Fast-paced and action-packed, the blockbuster franchise and comic book saga unfolds for the first time on next-generation platforms, as Banner scours the planet trying to find anything to help him fight his involuntary rage. Take the role of one of Marvel's most powerful Super Heroes in TheFast-paced and action-packed, the blockbuster franchise and comic book saga unfolds for the first time on next-generation platforms, as Banner scours the planet trying to find anything to help him fight his involuntary rage. Take the role of one of Marvel's most powerful Super Heroes in The Incredible Hulk, a third-person action video game. Gamers can demolish anything in their path, including lampposts, passing cars and even buildings. The fury-fueled game also features key moments from the film, as well as additional plotlines and characters from The Incredible Hulk universe. Players crash through New York City, battling gigantic enemies amidst soaring skyscrapers in a massive open world. [Sega]… Expand"
  },
  {
    "name": "Arc of Alchemist",
    "details_link": "https://www.metacritic.com/game/playstation-4/arc-of-alchemist",
    "publisher": "Idea Factory",
    "release_date": "Jan 30 2020",
    "developers": [
      "Compile Heart"
    ],
    "platforms": [
      "Switch",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 46,
    "users_score": 3.5,
    "image": "https://static.metacritic.com/images/products/games/3/9a00aef8bd2fa5f17cc3f3a66c0ca47d-98.jpg",
    "descriptions": "Quinn Bravesford and her squad are sent on a quest to find the Great Power — the key to save humanity. Is there hope within the desert or is it merely a mirage?"
  },
  {
    "name": "Predator: Concrete Jungle",
    "details_link": "https://www.metacritic.com/game/xbox/predator-concrete-jungle",
    "publisher": "VU Games",
    "release_date": "Apr 26 2005",
    "developers": [
      "Eurocom Entertainment Software"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Sci-Fi"
    ],
    "meta_score": 46,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/3/0c9f26549d837af5d099cdf3aa8c94a1-98.jpg",
    "descriptions": "In Predator: Concrete Jungle, you become the Predator who hunts the Earth for criminals using superhuman powers, different vision modes, and an array of alien weaponry. The tale of the alien's history on the Earth unfolds between two separate time periods (in the 1930s and in 2030) as youIn Predator: Concrete Jungle, you become the Predator who hunts the Earth for criminals using superhuman powers, different vision modes, and an array of alien weaponry. The tale of the alien's history on the Earth unfolds between two separate time periods (in the 1930s and in 2030) as you seek revenge upon an organized crime empire. To successfully complete your missions, you must master cloaking technology and extraterrestrial weapons, including wristblades, plasmacaster, combistick, speargun, and smart disk.… Expand"
  },
  {
    "name": "Rampage: Total Destruction",
    "details_link": "https://www.metacritic.com/game/wii/rampage-total-destruction",
    "publisher": "Midway",
    "release_date": "Nov 14 2006",
    "developers": [
      "Pipeworks Software",
      "Inc."
    ],
    "platforms": [
      "PlayStation 2",
      "Wii"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "General"
    ],
    "meta_score": 46,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/6/67d405f5de068a5ba2f7964443356f9b-98.jpg",
    "descriptions": "Rampage: Total Destruction offers a fresh take on an arcade classic complete with everyone's favorite monsters: George, Lizzie, and Ralph, along with a variety of new monsters to collect and play. Virtually everything in the environment can be damaged, broken, and utterly destroyed withRampage: Total Destruction offers a fresh take on an arcade classic complete with everyone's favorite monsters: George, Lizzie, and Ralph, along with a variety of new monsters to collect and play. Virtually everything in the environment can be damaged, broken, and utterly destroyed with plenty of hilarious results. Aided by power-ups, the Rampage: Total Destruction monsters are capable of acquiring a number of upgrades throughout the course of a single campaign. Players can annihilate cities all over the world in either one or two player mode in this reinvention of the Midway classic. [Midway]… Expand"
  },
  {
    "name": "Catwoman",
    "details_link": "https://www.metacritic.com/game/playstation-2/catwoman",
    "publisher": "EA Games",
    "release_date": "Jul 20 2004",
    "developers": [
      "Argonaut Games"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 46,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/2/b9ed23aa4d94d41c0189b677a316e12a-98.jpg",
    "descriptions": "Control Catwoman as you play the movie, utilizing her unique catlike skills, senses and cunning to defeat her enemies. Boasting incredible acrobatic skills, Catwoman can leap across roofs, run up walls, pounce on prey, utilize inimitable \"cat senses,\" and avoid enemy bullets with felineControl Catwoman as you play the movie, utilizing her unique catlike skills, senses and cunning to defeat her enemies. Boasting incredible acrobatic skills, Catwoman can leap across roofs, run up walls, pounce on prey, utilize inimitable \"cat senses,\" and avoid enemy bullets with feline grace. In addition, she can use her whip to swing through the air, and utilize the fully interactive environments to trap or knock her foes unconscious. The game takes you through numerous levels set in seven different locations from the movie. [Electronic Arts]… Expand"
  },
  {
    "name": "Disney's PK: Out of the Shadows",
    "details_link": "https://www.metacritic.com/game/gamecube/disneys-pk-out-of-the-shadows",
    "publisher": "Ubisoft",
    "release_date": "Dec  3 2002",
    "developers": [
      "Ubisoft"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 46,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/5/904d507df0c6ed870866e4454f65162e-98.jpg",
    "descriptions": "Enter the sci-fi world of Disney's PK- the superhero alter-ego of Donald Duck! Armed with his mega cyberdevice, you'll battle evil Evronian aliens, and discover explosively futuristic hardware."
  },
  {
    "name": "Army Men: Sarge's Heroes 2",
    "details_link": "https://www.metacritic.com/game/nintendo-64/army-men-sarges-heroes-2",
    "publisher": "3DO",
    "release_date": "Sep 26 2000",
    "developers": [
      "3DO"
    ],
    "platforms": [
      "PlayStation 2",
      "Nintendo 64"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Fantasy"
    ],
    "meta_score": 46,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/9/842559c3b8999d894c0b4a9c613e2058-98.jpg",
    "descriptions": "THE BOYS ARE BACK AND READY TO DO BATTLE! Sarge and the Bravo Company Commandos managed to foil the Tan Army's first assault, but do they have what it takes this time? General Plastro has teamed up with Brigitte Bleu, a diabolically treacherous Blue Spy, to destroy the Green Nation once andTHE BOYS ARE BACK AND READY TO DO BATTLE! Sarge and the Bravo Company Commandos managed to foil the Tan Army's first assault, but do they have what it takes this time? General Plastro has teamed up with Brigitte Bleu, a diabolically treacherous Blue Spy, to destroy the Green Nation once and for all. The adventure continues as Sarge and Vikki fight their way over pool tables, around a bedroom and across desktops to the final showdown against Plastro and his troops. Prepare for another gigantic battle! It's Real Combat. Plastic Men.… Expand"
  },
  {
    "name": "Samurai Shodown Sen",
    "details_link": "https://www.metacritic.com/game/xbox-360/samurai-shodown-sen",
    "publisher": "XSEED Games",
    "release_date": "Mar 30 2010",
    "developers": [
      "K2 LLC"
    ],
    "platforms": "Xbox 360",
    "num_players": "2 ",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 46,
    "users_score": 5.2,
    "image": "https://static.metacritic.com/images/products/games/2/1b2a7439a4436d79fedb46974da0da8b-98.jpg",
    "descriptions": "The Samurai Shodown series brings intense 2D fighting to the arcade and the Xbox 360 once more."
  },
  {
    "name": "Happy Feet",
    "details_link": "https://www.metacritic.com/game/wii/happy-feet",
    "publisher": "Midway",
    "release_date": "Nov 13 2006",
    "developers": [
      "Artificial Mind and Movement"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Wii"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Miscellaneous",
      "Adventure",
      "General",
      "Rhythm",
      "General",
      "Party / Minigame",
      "Music"
    ],
    "meta_score": 46,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/1/04876f7a387637aefa1324a590591d0e-98.jpg",
    "descriptions": "Play as Mumble in the ultimate adventure to win the heart of Gloria and save the Emperor penguin nation. Based on Warner Bros. Pictures' comedy adventure Happy Feet, Midway's immersive videogame puts the player in the \"tap shoes\" of Mumble, a young penguin born into a nation of EmperorPlay as Mumble in the ultimate adventure to win the heart of Gloria and save the Emperor penguin nation. Based on Warner Bros. Pictures' comedy adventure Happy Feet, Midway's immersive videogame puts the player in the \"tap shoes\" of Mumble, a young penguin born into a nation of Emperor penguins - where each needs a Heartsong to attract a soul mate. Unfortunately, Mumble is the worst singer in the world... however, as it happens, he is a brilliant tap dancer! [Midway]… Expand"
  },
  {
    "name": ".detuned",
    "details_link": "https://www.metacritic.com/game/playstation-3/detuned",
    "publisher": "SCEA",
    "release_date": "Oct 15 2009",
    "developers": [
      ".theprodukkt"
    ],
    "platforms": "PlayStation 3",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 46,
    "users_score": 3.7,
    "image": "https://static.metacritic.com/images/products/games/4/b57ecb569c2af665c551d6a986b0c174-98.jpg",
    "descriptions": "[Playstation Network]  Developed by .theprodukkt, .detuned is a personalized, interactive music experience which gives you the opportunity to create dynamic artwork in real-time to accompany your XMB music collection. Manipulate the given scene by interacting with and modifying its unique[Playstation Network]  Developed by .theprodukkt, .detuned is a personalized, interactive music experience which gives you the opportunity to create dynamic artwork in real-time to accompany your XMB music collection. Manipulate the given scene by interacting with and modifying its unique graphics using the DUALSHOCK 3 Wireless Controller. Plus you can change and tweak your own music to accompany the scene. Download .detuned today for an artistic music experience. [SCEA]… Expand"
  },
  {
    "name": "Le Tour de France",
    "details_link": "https://www.metacritic.com/game/xbox-360/le-tour-de-france",
    "publisher": "Focus Home Interactive",
    "release_date": "Oct 11 2016",
    "developers": [
      "Cyanide"
    ],
    "platforms": "Xbox 360",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Sports",
      "Alternative",
      "Individual",
      "Biking",
      "Biking"
    ],
    "meta_score": 46,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/6/92987934d3d69362cbab4ed2b62478a1-98.jpg",
    "descriptions": "Pro Cycling Manager: Tour de France 2011 is the next installment in the Tour de France series."
  },
  {
    "name": "One Piece: Unlimited Cruise SP",
    "details_link": "https://www.metacritic.com/game/3ds/one-piece-unlimited-cruise-sp",
    "publisher": "Nintendo",
    "release_date": "Feb 10 2012",
    "developers": [
      "Bandai Namco Games"
    ],
    "platforms": "3DS",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 46,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/9/c56c5bf157d2a98604f3c2b255837d74-98.jpg",
    "descriptions": null
  },
  {
    "name": "Lowrider",
    "details_link": "https://www.metacritic.com/game/playstation-2/lowrider",
    "publisher": "Jaleco Entertainment",
    "release_date": "Nov 20 2003",
    "developers": [
      "Pacific Century Cyber Works"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Rhythm",
      "Dancing"
    ],
    "meta_score": 46,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/1edb6608fd2ebcdb227b61e03aaeed0f-98.jpg",
    "descriptions": "Welcome to one of the world's hottest auto trends. Lowrider's club driven car culture jumps from the streets to the PS2. Timing and twitch make Lowrider simple to pick up and downright impossible to put down. For a quick fix, select a ride that fits your mood then choose to hop, dance orWelcome to one of the world's hottest auto trends. Lowrider's club driven car culture jumps from the streets to the PS2. Timing and twitch make Lowrider simple to pick up and downright impossible to put down. For a quick fix, select a ride that fits your mood then choose to hop, dance or street style your way to the next round by winning the love of the fans. Or start with a beater and bring it to glory with upgrades in hydraulics, batteries, suspension and custom paint jobs. [Jaleco]… Expand"
  },
  {
    "name": "Death Crimson OX",
    "details_link": "https://www.metacritic.com/game/dreamcast/death-crimson-ox",
    "publisher": "Sammy Studios",
    "release_date": "Aug  5 2001",
    "developers": [
      "Ecole"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Action",
      "Shooter",
      "Light Gun"
    ],
    "meta_score": 46,
    "users_score": 5.1,
    "image": "https://static.metacritic.com/images/products/games/6/f9fc3215730377c39dbc7631fe8de10b-98.jpg",
    "descriptions": "July 29, 2010. The beautiful city of Saronica is destroyed by the mysterious SMO. Agents, known as Subliminers, are placed throughout the city to oppress the populace. Survivors form The Resistance and fiercely engage SMO forces in battle. The Resistance is led by the elusive Lily, who alsoJuly 29, 2010. The beautiful city of Saronica is destroyed by the mysterious SMO. Agents, known as Subliminers, are placed throughout the city to oppress the populace. Survivors form The Resistance and fiercely engage SMO forces in battle. The Resistance is led by the elusive Lily, who also makes a mean dish of macaroni and cheese. Segue to agent Kou Yanami, tortured with doubt over his employer's policies. He seizes two pistols from SMO's arsenal and joins Resistance forces. His pistols are the Crimson, ancient super weapons. Lily attempts to shelter Kou from his dogged pursuers but in turn falls prey to SMO. Now, Kou Yanami and Lily's daughter, Yuri, set out to free her... and blow away any SMO Subliminers who get in their way!… Expand"
  },
  {
    "name": "B-17 Gunner: Air War Over Germany",
    "details_link": "https://www.metacritic.com/game/pc/b-17-gunner-air-war-over-germany",
    "publisher": "WizardWorks",
    "release_date": "May 20 2001",
    "developers": [
      "Sunstorm Interactive"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Flight",
      "WWII",
      "WWII",
      "Combat"
    ],
    "meta_score": 46,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/4/69b540782d4b3c74fda6daa380ac9ee7-98.jpg",
    "descriptions": "The 390th Bombardment Group in Tuscon, Arizona, was actually consulted on this budget-priced, arcade-style, airborne shooting gallery in which the player goes for high scores by nailing as many German planes as possible in a series of short \"mission\" stages."
  },
  {
    "name": "Raid: World War II",
    "details_link": "https://www.metacritic.com/game/playstation-4/raid-world-war-ii",
    "publisher": "Starbreeze",
    "release_date": "Oct 10 2017",
    "developers": [
      "Starbreeze",
      "Lion Games"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 46,
    "users_score": 3.7,
    "image": "https://static.metacritic.com/images/products/games/6/8e6cd4d4baeea5607896cbf2ece31c74-98.jpg",
    "descriptions": "Raid: World War II is an action-packed four player cooperative shooter set during a time when the Nazi war machine was still winning, and hope was in short supply. \r\rDuring the worldwide fight against evil, four prisoners of war are found in a raid on a Gestapo jail. They have been freedRaid: World War II is an action-packed four player cooperative shooter set during a time when the Nazi war machine was still winning, and hope was in short supply. \r\rDuring the worldwide fight against evil, four prisoners of war are found in a raid on a Gestapo jail. They have been freed by a \"Mrs. White,\" a secret British intelligence agent, who needs someone to take down Hitler and his Third Reich once and for all. \r\rNot every part of the war effort is noble. In fact, Mrs. White has something else in mind for the squad. Players will fight for their freedom via sabotage, robberies and assassinations of the Nazi Party. If they're stealing from the Nazis, why not get rich on the side?… Expand"
  },
  {
    "name": "Zenith (2016)",
    "details_link": "https://www.metacritic.com/game/playstation-4/zenith-2016",
    "publisher": "Badland Games",
    "release_date": "Sep 20 2016",
    "developers": [
      "Infinigon"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 46,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/9/279ac01966cdda84dcc4fdd5f4cac40e-98.jpg",
    "descriptions": "Zenith is an action RPG that combines that feel of the golden era RPG games with a generous dose of humor and parody. Adventuring, exploring ruins, accidentally unleashing the apocalypse, saving the world… you’ve done it all, and so has Argus. And, frankly, he’s a bit fed up with the wholeZenith is an action RPG that combines that feel of the golden era RPG games with a generous dose of humor and parody. Adventuring, exploring ruins, accidentally unleashing the apocalypse, saving the world… you’ve done it all, and so has Argus. And, frankly, he’s a bit fed up with the whole thing. He used to be a wizard, which was fine and all, but he’s in his 30s now, and he wants to settle down and get some peace and quiet.… Expand"
  },
  {
    "name": "The Golden Compass",
    "details_link": "https://www.metacritic.com/game/playstation-2/the-golden-compass",
    "publisher": "Sega",
    "release_date": "Dec  4 2007",
    "developers": [
      "Shiny Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 46,
    "users_score": 5.3,
    "image": "https://static.metacritic.com/images/products/games/2/5193af642dd49e5b2abb1e6f0d2452c6-98.jpg",
    "descriptions": "The Golden Compass follows the screenplay adaptation of the first book in the acclaimed trilogy, capturing the fantasy adventure set in a parallel world where giant armored bears rule a kingdom, beautiful witches fly through the frozen skies, and human beings' deepest essence is manifest asThe Golden Compass follows the screenplay adaptation of the first book in the acclaimed trilogy, capturing the fantasy adventure set in a parallel world where giant armored bears rule a kingdom, beautiful witches fly through the frozen skies, and human beings' deepest essence is manifest as talking animals that remain their faithful companion for life – their daemon. Players can assume the role of Lyra, a young girl, along with her daemon Pantalaimon (Pan), as she journeys through the frozen wastes of the North to rescue a friend kidnapped by a mysterious organization known as The Gobblers and winds up on an epic quest to save not only her world, but ours as well. Gamers can also take on the character of Iorek Byrnison, a great armoured polar bear who joins the quest. As Lyra, players use their daemon and collaborate with in-game characters, collecting special items in order to explore, evade, and deceive their way through confrontations with the Gobblers, the Magisterium, and the horribly dangerous spy fly to find her friend. They can also do battle as Iorek with special attacks and a riding mechanic as he protects Lyra during the journey. Gamers can unlock secrets and mini-games using a mysterious, truth-telling golden compass device called an alethiometer. Players can explore 13 vast locations, including all-new breath-taking environments not seen in the film, on this massive journey of collaboration, exploration and the eternal struggle between good and evil. [Sega]… Expand"
  },
  {
    "name": "Fear Effect Sedna",
    "details_link": "https://www.metacritic.com/game/xbox-one/fear-effect-sedna",
    "publisher": "Square Enix",
    "release_date": "Mar  6 2018",
    "developers": [
      "Sushee"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General"
    ],
    "meta_score": 46,
    "users_score": 3.9,
    "image": "https://static.metacritic.com/images/products/games/3/7e14990fc862eceaf0fc74dca2cf0956-98.jpg",
    "descriptions": "Be part of a new Fear Effect adventure with Fear Effect Sedna, a new game in the classic series made popular on the original PlayStation console. With a whole new story, and shifting to a pausable real-time tactical action style, players will be able to control the team strategically andBe part of a new Fear Effect adventure with Fear Effect Sedna, a new game in the classic series made popular on the original PlayStation console. With a whole new story, and shifting to a pausable real-time tactical action style, players will be able to control the team strategically and tackle enemies and puzzles alike.\r Fear Effect Sedna is set four years after the events of the original Fear Effect game, and things have changed for the team. Hana, freed from the Triad, lives with Rain in Hong Kong and works as an occasional mercenary, while Deke has grown apart from them since Glas returned to the US.\r Hana accepts a small mission for a shadowy organization asking for her services. Her target: a mysterious ancient statuette held by the Chinese ambassador in France. She sees it as a good opportunity to visit her birthplace... But this 'easy' mission is about to lead Hana to something way bigger than she expected.\r Meanwhile Glas is approached by a client who catches his attention enough that he soon sets out for Greenland.\r How will these events bring the old team back together?\r Fear Effect Sedna is dedicated to recreating the atmosphere and characters from the original Fear Effect. However, while there are familiar aspects of the game to previous incarnations of the franchise, you'll find yourself immersed in a completely unique and new world with Fear Effect Sedna - one that will appeal to fans both old and new. \r\rFeatures:\r *    New environments in isometric view: Explore the deep caves of Greenland, abandoned scientific complexes, underwater stations and ethereal realms based on Inuit mythology.\r*    A real-time tactical action game: Exploit your heroes' special abilities and combine them to maximize your team's effectiveness in attacks.\r*    A deep and mature story: Learn more about Fear Effect's iconic characters' past as they delve into this new mystery.\r*    Explore a whole new culture: Myths from the Inuit people are imbued with power of the elements and the cold sea. Meet and fight unexpected creatures from the spirit realm!… Expand"
  },
  {
    "name": "AereA",
    "details_link": "https://www.metacritic.com/game/playstation-4/aerea",
    "publisher": "Soedesco",
    "release_date": "Jun 30 2017",
    "developers": [
      "Triangle Studios",
      "Soedesco"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 46,
    "users_score": 4.5,
    "image": "https://static.metacritic.com/images/products/games/4/6fae92090079798d329897068dc9bb16-98.jpg",
    "descriptions": "AereA is an action RPG in which music is both your best friend and your worst enemy. As a disciple of the Great Maestro Guido, you have to unravel the mysteries of Aezir. Find out what happened to the world and return the nine primordial instruments to restore balance and bring peace to theAereA is an action RPG in which music is both your best friend and your worst enemy. As a disciple of the Great Maestro Guido, you have to unravel the mysteries of Aezir. Find out what happened to the world and return the nine primordial instruments to restore balance and bring peace to the world. [Playstation.com]… Expand"
  },
  {
    "name": "R-Type III: The Third Lightning",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/r-type-iii-the-third-lightning",
    "publisher": "Destination Software",
    "release_date": "Mar 16 2004",
    "developers": [
      "Raylight Studios"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Scrolling"
    ],
    "meta_score": 46,
    "users_score": 3.8,
    "image": "https://static.metacritic.com/images/products/games/6/109b72971a07d3dff9a54ef3ce3225b9-98.jpg",
    "descriptions": "The Evil Bydo Empire seeks to wipe out our species, and you're the only one who can stop the assault. As the last pilot on Earth, you must fly the untested R-90 against the Evil Bydo. Along the way, you can earn force pods (Round Force, Shadow Force, and Cyclone Force) that equip your vesselThe Evil Bydo Empire seeks to wipe out our species, and you're the only one who can stop the assault. As the last pilot on Earth, you must fly the untested R-90 against the Evil Bydo. Along the way, you can earn force pods (Round Force, Shadow Force, and Cyclone Force) that equip your vessel with different sets of weapons. Blast your way through intense levels filled with enemy inhabitants, large bosses, and challenging obstacles.… Expand"
  },
  {
    "name": "Gladiators of Rome",
    "details_link": "https://www.metacritic.com/game/pc/gladiators-of-rome",
    "publisher": "Activision Value",
    "release_date": "Oct 27 2002",
    "developers": [
      "Cat Daddy Games"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "General"
    ],
    "meta_score": 46,
    "users_score": 4.8,
    "image": "https://static.metacritic.com/images/products/games/3/32bf5bf68f7561883139ebc30acf8814-98.jpg",
    "descriptions": "You are in control of a gladiator troop in ancient Rome. You must recruit slaves, refine their character and mold them into fighting machines. Collect weaponry, chariots and armor all to enhance your gladiators' ability to move up the ranks and fight in larger coliseums for higher purses,You are in control of a gladiator troop in ancient Rome. You must recruit slaves, refine their character and mold them into fighting machines. Collect weaponry, chariots and armor all to enhance your gladiators' ability to move up the ranks and fight in larger coliseums for higher purses, just like ancient Rome! [Activision Value]… Expand"
  },
  {
    "name": "Woody Woodpecker Racing",
    "details_link": "https://www.metacritic.com/game/pc/woody-woodpecker-racing",
    "publisher": "Konami",
    "release_date": "Jan 31 2001",
    "developers": [
      "Syrox Developments"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Kart",
      "Other",
      "Kart"
    ],
    "meta_score": 46,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/8/58501ccad97ed5808dbdab94d44fb8de-98.jpg",
    "descriptions": "The biggest problem with Woody Woodpecker Racing is that it's just not fun."
  },
  {
    "name": "Pure Futbol",
    "details_link": "https://www.metacritic.com/game/playstation-3/pure-futbol",
    "publisher": "Ubisoft",
    "release_date": "Jun  1 2010",
    "developers": [
      "Ubisoft Vancouver"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Arcade",
      "Arcade"
    ],
    "meta_score": 46,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/8/8fb7fdeae7821017b3cbe722183dd299-98.jpg",
    "descriptions": "(Also known as \"Pure Football\" in the UK/EU)  Stop watching from the stands and discover what it’s like to play real soccer – raw and unfiltered. Through close-up camera angles and stunning audio & visual treatments, Pure Futbol captures the true on-field emotions. [Ubisoft]"
  },
  {
    "name": "Operation Darkness",
    "details_link": "https://www.metacritic.com/game/xbox-360/operation-darkness",
    "publisher": "Atlus",
    "release_date": "Jun 24 2008",
    "developers": [
      "Success"
    ],
    "platforms": "Xbox 360",
    "num_players": "Up to 4 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Historic",
      "General",
      "Historic"
    ],
    "meta_score": 46,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/9/b3b4fae841f3de7f66fa9f96766e2d07-98.jpg",
    "descriptions": "Enter an alternate WWII-era world where history and fantasy collide. Leading an army of ruthless officers and unearthly creatures, Adolf Hitler marches through Europe, leaving behind a trail of death and destruction. With his powers on the rise and his armies on the move, it falls on you andEnter an alternate WWII-era world where history and fantasy collide. Leading an army of ruthless officers and unearthly creatures, Adolf Hitler marches through Europe, leaving behind a trail of death and destruction. With his powers on the rise and his armies on the move, it falls on you and your team of elite soldiers to cut deep into the heart of the Third Reich and strike a fatal blow to Hitler's ever-growing legion of evil. Lead the Offensive. Brave dozens of missions, confront supernatural creatures, and discover mystical powers as you progress through a sweeping campaign of drama and mystery. A Strategy-RPG with an Emphasis on Tactics. With a vast arsenal of historical weapons and a large team of specialized characters at their disposal, players will have to consider every variable as they plan their method of attack – using the environment to your advantage is imperative. High-definition visuals, fully-voiced dialogue, and in-game cutscenes deliver a true next-generation experience. [Atlus USA]… Expand"
  },
  {
    "name": "ARK Park",
    "details_link": "https://www.metacritic.com/game/playstation-4/ark-park",
    "publisher": "Studio Wildcard",
    "release_date": "Mar 22 2018",
    "developers": [
      "Snail Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 46,
    "users_score": 4.6,
    "image": "https://static.metacritic.com/images/products/games/5/7db2c26d63fb713b40be5c24a43a281a-98.jpg",
    "descriptions": "A virtual reality adventure, allowing players to get up close and personal with dinosaurs and their immersive primal environments."
  },
  {
    "name": "World Series of Poker",
    "details_link": "https://www.metacritic.com/game/playstation-2/world-series-of-poker",
    "publisher": "Activision",
    "release_date": "Aug 31 2005",
    "developers": [
      "Activision"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "8  Online",
    "genres": [
      "Miscellaneous",
      "Parlor",
      "Gambling"
    ],
    "meta_score": 46,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/59c189353acafddf27f01361e9ba88e1-98.jpg",
    "descriptions": "World Series of Poker features the likenesses of poker professionals participating in the 2005 WSOP Tournament. The game offers players a truly unique experience unlike any other poker video game on the market today. For the first time ever, the 2005 WSOP Tournament will be held at Harrah'sWorld Series of Poker features the likenesses of poker professionals participating in the 2005 WSOP Tournament. The game offers players a truly unique experience unlike any other poker video game on the market today. For the first time ever, the 2005 WSOP Tournament will be held at Harrah's Rio Suites in Las Vegas, the same location simulated in the video game and the location of the 2005 Lifestyle Show. All the sanctioned poker various of the World Series of Poker are available, including Texas Hold 'Em, 7 Card Stud, Omaha, and 5 Card Draw. With the flexible character creator, the player can create his or her own poker face, wear Vegas-style threads and upgrade looks/clothes as he or she gains money. [Activision]… Expand"
  },
  {
    "name": "Sonic the Hedgehog",
    "details_link": "https://www.metacritic.com/game/xbox-360/sonic-the-hedgehog",
    "publisher": "Sega",
    "release_date": "Nov 14 2006",
    "developers": [
      "Sega",
      "Sonic Team"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "2D",
      "3D"
    ],
    "meta_score": 46,
    "users_score": 5.2,
    "image": "https://static.metacritic.com/images/products/games/7/3b8ec04bb4b018ac6730650e92c195db-98.jpg",
    "descriptions": "Sonic celebrates his 15th anniversary by blazing his way onto the next-generation consoles, with his first adventure set in the human world. Featuring interactive 3D environments and a large cast of returning and new characters, get ready for the reinvention of Sonic The Hedgehog, in hisSonic celebrates his 15th anniversary by blazing his way onto the next-generation consoles, with his first adventure set in the human world. Featuring interactive 3D environments and a large cast of returning and new characters, get ready for the reinvention of Sonic The Hedgehog, in his most intense, high velocity escapade to date. [Sega]… Expand"
  },
  {
    "name": "Babylon's Fall",
    "details_link": "https://www.metacritic.com/game/pc/babylons-fall",
    "publisher": "Square Enix",
    "release_date": "Mar  3 2022",
    "developers": [
      "PlatinumGames"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "PC"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "General",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 46,
    "users_score": 0.6,
    "image": "https://static.metacritic.com/images/products/games/6/1663f29f1735a04278fd9b8672131f2f-98.jpg",
    "descriptions": "Experience acclaimed developer PlatinumGames' signature combat in BABYLON’S FALL with up to 3 other players or take on the Tower of Babel alone, in this new cooperative action RPG. After the Babylonians perished, only their great tower “The Ziggurat” remained. Now a new Empire has come toExperience acclaimed developer PlatinumGames' signature combat in BABYLON’S FALL with up to 3 other players or take on the Tower of Babel alone, in this new cooperative action RPG. After the Babylonians perished, only their great tower “The Ziggurat” remained. Now a new Empire has come to pillage its ruins and uncover its fabled treasures. Join forces with other Sentinels, unwilling subjects forcibly implanted with Gideon Coffin, relics that grant the few survivors unrivalled powers. Ascend to greatness as you climb the looming Tower of Babel and uncover its fabled treasures. Only by mastering the powers of your Gideon Coffin, will you unlock your true potential and become strong enough to survive the summit and uncover the secrets that await. Pre-order BABYLON'S FALL to obtain a unique customization for your character, The Empress' Insignia. Show off to other Sentinels that you were one of the first to obtain a Gideon Coffin and become a Sentinel.… Expand"
  },
  {
    "name": "Soulblight",
    "details_link": "https://www.metacritic.com/game/switch/soulblight",
    "publisher": "My Next Games",
    "release_date": "Oct  4 2018",
    "developers": [
      "My Next Games"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Roguelike"
    ],
    "meta_score": 46,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/8/7258fcc7320cf94714d810af76276253-98.jpg",
    "descriptions": "Soulblight is a dark, unforgiving, top-down action roguelike luring you to cross the thin line between good and evil. Instead of XP grinding, it introduces a Tainting Mechanics. While traveling through the shattered reality of the Sanctuary, you will receive personality traits based on yourSoulblight is a dark, unforgiving, top-down action roguelike luring you to cross the thin line between good and evil. Instead of XP grinding, it introduces a Tainting Mechanics. While traveling through the shattered reality of the Sanctuary, you will receive personality traits based on your choices. These will be the main source of your strength. To harness them, you will have to act accordingly. Becoming an alcoholic means that you will be rewarded for getting drunk, but from that point being sober might prove to be unbearable.… Expand"
  },
  {
    "name": "Catwoman (2004)",
    "details_link": "https://www.metacritic.com/game/pc/catwoman-2004",
    "publisher": "EA Games",
    "release_date": "Jul 20 2004",
    "developers": [
      "Argonaut Games",
      "EA Games"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern"
    ],
    "meta_score": 46,
    "users_score": 3.5,
    "image": "https://static.metacritic.com/images/products/games/3/0181c1119be1ad2aa432be7bebd36514-98.jpg",
    "descriptions": "Control Catwoman as you play the movie, utilizing her unique catlike skills, senses and cunning to defeat her enemies. Boasting incredible acrobatic skills, Catwoman can leap across roofs, run up walls, pounce on prey, utilize inimitable \"cat senses,\" and avoid enemy bullets with felineControl Catwoman as you play the movie, utilizing her unique catlike skills, senses and cunning to defeat her enemies. Boasting incredible acrobatic skills, Catwoman can leap across roofs, run up walls, pounce on prey, utilize inimitable \"cat senses,\" and avoid enemy bullets with feline grace. In addition, she can use her whip to swing through the air, and utilize the fully interactive environments to trap or knock her foes unconscious. The game takes you through numerous levels set in seven different locations from the movie. [Electronic Arts]… Expand"
  },
  {
    "name": "Surfing H3O",
    "details_link": "https://www.metacritic.com/game/playstation-2/surfing-h3o",
    "publisher": "Rockstar Games",
    "release_date": "Oct 26 2000",
    "developers": [
      "Opus"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Surfing"
    ],
    "meta_score": 46,
    "users_score": 3.6,
    "image": "https://static.metacritic.com/images/products/games/7/6862562f16f26f8a16e8a6fedeb450c7-98.jpg",
    "descriptions": "Surrounded in beautiful scenery, you must master hardcore surfing techniques to handle epic waves. As real as you can get...without getting wet.\rBefore the present 128-bit days, surfing was limited to crude, two-dimensional mock-ups of the real thing. Because of the complex nature of water,Surrounded in beautiful scenery, you must master hardcore surfing techniques to handle epic waves. As real as you can get...without getting wet.\rBefore the present 128-bit days, surfing was limited to crude, two-dimensional mock-ups of the real thing. Because of the complex nature of water, a powerful system is needed to accurately render the oceanic environs. With the powerful capabilities of the PlayStation 2, Take 2's Surfing H30 ups the level of surfing games with its visual splendor and water physics. With six different locales full of sun and surf, 11 characters to ride the waves (all with their separate strengths and weaknesses), and a custom X-Board controller to more accurately reproduce the action with your Dual Shock 2, Surfing H30 aims to be the closest thing to surfing short of waxing up your own board and hitting the beach.… Expand"
  },
  {
    "name": "Winter Stars",
    "details_link": "https://www.metacritic.com/game/xbox-360/winter-stars",
    "publisher": "Deep Silver",
    "release_date": "Nov 15 2011",
    "developers": [
      "49Games"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Sports",
      "General",
      "General"
    ],
    "meta_score": 46,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/4/b53aacb483154d2b783ee853191b8a40-98.jpg",
    "descriptions": "Winter Stars, developed by 49 Games, entices gamers off their sofas with its high quality and easy-to-learn, exhilarating motion controls. The unique \"family mode\" allows each participant to choose his or her own individual difficulty level, thus making for a fun multiplayerWinter Stars, developed by 49 Games, entices gamers off their sofas with its high quality and easy-to-learn, exhilarating motion controls. The unique \"family mode\" allows each participant to choose his or her own individual difficulty level, thus making for a fun multiplayer experience with even chances for everyone. In single player mode, Winter Stars offers a campaign full of variety that allows players to experience all aspects of an athlete's career. … Expand"
  },
  {
    "name": "Donkey Kong: Barrel Blast",
    "details_link": "https://www.metacritic.com/game/wii/donkey-kong-barrel-blast",
    "publisher": "Nintendo",
    "release_date": "Oct  8 2007",
    "developers": [
      "Paon Corporation"
    ],
    "platforms": "Wii",
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Kart",
      "Other",
      "Kart"
    ],
    "meta_score": 46,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/1/6289be0d44719edc351188b7cbdc0287-98.jpg",
    "descriptions": "(Known as \"Donkey Kong Taru Jet Race\" in Japan; as \"Donkey Kong Jet Race\" in the UK/EU)  Donkey Kong and his pals have gotten their mitts on some high-powered Barrel Jets – incredible engines that boost when struck by a pilot. By beating on the DK Bongos controller, players can make their(Known as \"Donkey Kong Taru Jet Race\" in Japan; as \"Donkey Kong Jet Race\" in the UK/EU)  Donkey Kong and his pals have gotten their mitts on some high-powered Barrel Jets – incredible engines that boost when struck by a pilot. By beating on the DK Bongos controller, players can make their character swoop up, bank side to side and launch attacks on rivals. (The game also can be played using a Nintendo GameCube controller.) Players challenge the Kremlings or up to three pals on five worlds, each boasting 3-D aerial maps filled with countless obstacles and powerful items. With four people beating the bongos as they battle for the skies, this game is more party than race. [Nintendo]… Expand"
  },
  {
    "name": "Attack on Titan: Humanity in Chains",
    "details_link": "https://www.metacritic.com/game/3ds/attack-on-titan-humanity-in-chains",
    "publisher": "Atlus",
    "release_date": "May 12 2015",
    "developers": [
      "Spike Chunsoft"
    ],
    "platforms": "3DS",
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 46,
    "users_score": 4.4,
    "image": "https://static.metacritic.com/images/products/games/7/bd9dd8971fa8ab83a634040b246f610e-98.jpg",
    "descriptions": "Based on the hit Attack on Titan anime and manga, players will defend the three Walls from invading Titans as a member of the elite Scout Regiment with their omni-directional mobility gear and blades. Based on the upcoming Japanese remake of an earlier Attack on Titan game, Humanity inBased on the hit Attack on Titan anime and manga, players will defend the three Walls from invading Titans as a member of the elite Scout Regiment with their omni-directional mobility gear and blades. Based on the upcoming Japanese remake of an earlier Attack on Titan game, Humanity in Chains will be the first Attack on Titan game to reach North American shores, and will release exclusively on the Nintendo eShop for Nintendo 3DS in early 2015 with the original Japanese audio and English subtitles.\r The features for Attack on Titan: Humanity in Chains include:\r -Story Mode: As a member of the elite Scout Regiment, defending the outer walls from the Titans will push players to their very limits to save humanity. Enhanced Titan AI behavior will sap every ounce of ability from players as they make a last stand for the human race.\r-Familiar Characters, New Customizations: Eren Jaeger, Mikasa Ackermann and others will be familiar faces for players as they pick their favorite Scout member to defend the Walls. Several new additions will join the Scout Regiment, customizable with costumes, weapons and voices.\r-Online Co-op Mode: Defend the outer walls with up to three friends in the all-new online co-op mode with ranking and leaderboards.\r-Fresh Look: Updates to the UI, improvements in gameplay balance and support for the Circle Pad Pro and the C Stick on the New Nintendo 3DS XL take Humanity in Chains to the next level.… Expand"
  },
  {
    "name": "LEGO Brawls",
    "details_link": "https://www.metacritic.com/game/playstation-5/lego-brawls",
    "publisher": "Bandai Namco Games",
    "release_date": "Sep  2 2022",
    "developers": [
      "Red Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "General",
      "Fighting",
      "2D",
      "3D"
    ],
    "meta_score": 46,
    "users_score": 4.8,
    "image": "https://static.metacritic.com/images/products/games/1/2b0e3c383975693a000bbf009c8970de-98.jpg",
    "descriptions": "Dream up the ultimate minifig brawlers and bash your way through all of your favorite LEGO themes in the first team action brawler set in the LEGO universe.Design your ultimate LEGO Minifig hero with unique style, strategy and personality. A cactus with an attitude? A scrappy janitor ninjaDream up the ultimate minifig brawlers and bash your way through all of your favorite LEGO themes in the first team action brawler set in the LEGO universe.Design your ultimate LEGO Minifig hero with unique style, strategy and personality. A cactus with an attitude? A scrappy janitor ninja who happens to have fighting chickens? A sledgehammer-swinging clown with a few scores to settle? Sure! Build the ultimate brawler and level them up with unlockable content!From the swashbuckling shores of Barracuda Bay, to the waterlogged caverns of Ninjago Seabound, to a dusty wild west saloon and the mythical Monkie Kid jungle, all of your favorite LEGO themes are brawlable! Collect unlockable minifigs, power-ups, and emotes along the way.Battle to the top and track your rank against everyone else in the world! Do you have what it takes to be the best?… Expand"
  },
  {
    "name": "Inuyasha: Secret of the Divine Jewel",
    "details_link": "https://www.metacritic.com/game/ds/inuyasha-secret-of-the-divine-jewel",
    "publisher": "Namco Bandai Games America",
    "release_date": "Jan 23 2007",
    "developers": [
      "Art"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Console-style RPG",
      "Console-style RPG",
      "Japanese-Style"
    ],
    "meta_score": 46,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/0/7c0085201c0431ca0e00d013f7ed34ff-98.jpg",
    "descriptions": "Rumiko Takahashi's popular animated TV and comic series Inuyasha comes to life in this brand new adventure for the Nintendo DS. Players experience the intriguing origins and exciting stories of all-new characters as they join beloved well-known Inuyasha characters in the struggle to unlockRumiko Takahashi's popular animated TV and comic series Inuyasha comes to life in this brand new adventure for the Nintendo DS. Players experience the intriguing origins and exciting stories of all-new characters as they join beloved well-known Inuyasha characters in the struggle to unlock the mystery of the Divine Jewel. Utilizing and uniting familiar faces like Inuyasha, Kagome, Miroku, Sango and Shippo, players battle hordes of monstrous demons in this epic RPG. With an intuitive command-based control scheme and the new Cover Fellow System (CFS), players get Inuyasha and his friends to work together in ways never before seen. [Namco Bandai Games]… Expand"
  },
  {
    "name": "Squad Leader",
    "details_link": "https://www.metacritic.com/game/pc/squad-leader",
    "publisher": "Atari",
    "release_date": "Oct 24 2000",
    "developers": [
      "Random Games Inc."
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "General",
      "General"
    ],
    "meta_score": 46,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/2/cc44845d1d808b74fd87a0bc2387a4c1-98.jpg",
    "descriptions": "The success of this assault depends on your leadership, strategy, and the combined efforts of all your men. Putting yourself in harm's way, you create a diversion by opening fire. Your men seize the opportunity and move up to overtake the enemy. This is what it means to be a squad leader!The success of this assault depends on your leadership, strategy, and the combined efforts of all your men. Putting yourself in harm's way, you create a diversion by opening fire. Your men seize the opportunity and move up to overtake the enemy. This is what it means to be a squad leader!  [Microprose]… Expand"
  },
  {
    "name": "Backyard Wrestling 2: There Goes the Neighborhood",
    "details_link": "https://www.metacritic.com/game/playstation-2/backyard-wrestling-2-there-goes-the-neighborhood",
    "publisher": "Eidos Interactive",
    "release_date": "Nov 16 2004",
    "developers": [
      "Paradox Development"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "Wrestling"
    ],
    "meta_score": 46,
    "users_score": 4.7,
    "image": "https://static.metacritic.com/images/products/games/4/9b26e0571a80db6e638aba5fcdcaa791-98.jpg",
    "descriptions": "Backyard Wrestling Inc. has announced \"your town\" as the location of its first live pay per view. They've put a million dollars cash prize on the line for the wrestler who's got what it takes to destroy every obstacle in their way to the main event and ultimately the unified BYWBackyard Wrestling Inc. has announced \"your town\" as the location of its first live pay per view. They've put a million dollars cash prize on the line for the wrestler who's got what it takes to destroy every obstacle in their way to the main event and ultimately the unified BYW championship. A completely revamped wrestling and animation system raises the ability to inflict copious amounts of pain to an opponent to nearly infinite levels. Standing and ground based submissions, multi-position grappling, a block button body and an even deeper location-specific damage system all play into the carnage! Players will battle through both an enhanced single player experience, complete with death matches and a \"quest for the belt\" mode, or the ever popular, greatly expanded multi-player scenarios. The list of licensed backyard brawlers has grown immensely, including stars from the explosive home video series, as well as some of the craziest pro wrestlers to ever set foot in a ring. The completely redesigned Create-A-Wrestler System allows gamers to get creative and craft their own alter-ego with. The new robust C.A.W. allows for the customization of a backyard brawler from the ground up, including Tattoo's, Face Paint, Customized Clothing, and more! [Eidos Interactive]… Expand"
  },
  {
    "name": "Make War",
    "details_link": "https://www.metacritic.com/game/switch/make-war",
    "publisher": "No Gravity Games",
    "release_date": "Apr 16 2020",
    "developers": [
      "No Gravity Games"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General"
    ],
    "meta_score": 46,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/0/152461a5329c3e2ddcaa39dd31363362-98.jpg",
    "descriptions": "Do you want to lead great battles?\rMake War will give you the opportunity to play as aliens, which have access to the march of time.\r\r\nMake War is a tactical game with sandbox elements where you can place a great variety of weapons on the battlefield to perform a vast range of death andDo you want to lead great battles?\rMake War will give you the opportunity to play as aliens, which have access to the march of time.\r Make War is a tactical game with sandbox elements where you can place a great variety of weapons on the battlefield to perform a vast range of death and destruction.\r Begin from the Vikings and the ancient Romans and end up at the WWII and cyberpunk skirmishes.\rEach location offers its own set of weapons and tactics.\rYou are to study the armies' formation and the enemies' behaviour, in order to choose and place your weapons properly and achieve a blood-soaked victory.… Expand"
  },
  {
    "name": "Tom Clancy's Ghost Recon",
    "details_link": "https://www.metacritic.com/game/wii/tom-clancys-ghost-recon",
    "publisher": "Ubisoft",
    "release_date": "Nov 16 2010",
    "developers": [
      "Next Level Games"
    ],
    "platforms": "Wii",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Third-Person",
      "Tactical",
      "Modern",
      "Modern"
    ],
    "meta_score": 46,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/8/adcd91a9982a433bd526cca758d62fbc-98.jpg",
    "descriptions": "Developed by the award-winning team behind Tom Clancy's Ghost Recon Advanced Warfighter and Tom Clancy's Ghost Recon Advanced Warfighter 2, the game will feature cutting-edge technology, prototype high-tech weaponry, and state-of-the-art single-player and multiplayer modes. Tom Clancy'sDeveloped by the award-winning team behind Tom Clancy's Ghost Recon Advanced Warfighter and Tom Clancy's Ghost Recon Advanced Warfighter 2, the game will feature cutting-edge technology, prototype high-tech weaponry, and state-of-the-art single-player and multiplayer modes. Tom Clancy's Ghost Recon: Future Soldier will go beyond the core Ghost Recon franchise and deliver a fresh gameplay experience, with an unparalleled level of quality that will excite long-time fans and newcomers alike. … Expand"
  },
  {
    "name": "Animal Crossing: amiibo Festival",
    "details_link": "https://www.metacritic.com/game/wii-u/animal-crossing-amiibo-festival",
    "publisher": "Nintendo",
    "release_date": "Nov 13 2015",
    "developers": [
      "Nintendo",
      "Nd Cube"
    ],
    "platforms": "Wii U",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Board / Card Game"
    ],
    "meta_score": 46,
    "users_score": 4.0,
    "image": "https://static.metacritic.com/images/products/games/9/1dde651a842794c9d98a26a5eab34b3c-98.jpg",
    "descriptions": "The Animal Crossing: amiibo Festival game is a new way to play with your favorite Animal Crossing characters. Your amiibo figures are front-and-center in this party game, and you’ll get to utilize them with fun content. Bring to life an expansive and dynamic board game where the board isThe Animal Crossing: amiibo Festival game is a new way to play with your favorite Animal Crossing characters. Your amiibo figures are front-and-center in this party game, and you’ll get to utilize them with fun content. Bring to life an expansive and dynamic board game where the board is based on the months of the year like the core Animal Crossing series. The goal? Make your villager the happiest in town and party hard with your friends.… Expand"
  },
  {
    "name": "Verdun",
    "details_link": "https://www.metacritic.com/game/xbox-one/verdun",
    "publisher": "M2H",
    "release_date": "Mar  8 2017",
    "developers": [
      "Abstraction Games",
      "M2H",
      "Blackmill Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One"
    ],
    "num_players": "Up to 40 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical",
      "Arcade"
    ],
    "meta_score": 46,
    "users_score": 5.4,
    "image": "https://static.metacritic.com/images/products/games/8/5fbaf68af7df295456dc15b566aa8c65-98.jpg",
    "descriptions": "Verdun is a squad based multiplayer first person shooter set in the first world war. Inspired by the infamous battle of Verdun in 1916 players are able to take part in never seen before WWI action. Made by 3 indie developers from BlackMill and M2H."
  },
  {
    "name": "Starpoint Gemini",
    "details_link": "https://www.metacritic.com/game/pc/starpoint-gemini",
    "publisher": "Little Green Men",
    "release_date": "Dec 15 2010",
    "developers": [
      "Little Green Men"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Strategy",
      "Real-Time",
      "Ship",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 46,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/7/d1b10b9dcec3e416a7893b0b64c97f51-98.jpg",
    "descriptions": "Starpoint Gemini is a tactical space RPG set in a science-fiction universe, which focuses on the control and strengths of individual vessels and their captains."
  },
  {
    "name": "Dungeon Lords",
    "details_link": "https://www.metacritic.com/game/pc/dungeon-lords",
    "publisher": "DreamCatcher Interactive",
    "release_date": "May  5 2005",
    "developers": [
      "Heuristic Park"
    ],
    "platforms": "PC",
    "num_players": "8  Online",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 45,
    "users_score": 5.1,
    "image": "https://static.metacritic.com/images/products/games/2/ab40326771c51ce6d1688204c5ebd387-98.jpg",
    "descriptions": "Dungeon Lords is a new breed of epic Fantasy RPG, a unique combination of RPG and Fighter game action in full 3D, featuring a deep storyline shrouded in mystery, surprise, and betrayal. Dungeon Lords is loaded with quests, personal missions, extensive skills and special abilities forDungeon Lords is a new breed of epic Fantasy RPG, a unique combination of RPG and Fighter game action in full 3D, featuring a deep storyline shrouded in mystery, surprise, and betrayal. Dungeon Lords is loaded with quests, personal missions, extensive skills and special abilities for customizing your own character hero from a variety of races and multiple class specializations, as you journey through an enchanted land of ancient castles, dark forests, and dungeon lairs braving an army of diabolical foes in real time action packed combat to uncover the secrets lying hidden within the depths of an evolving storyline. Dungeon Lords can be played either single-player stand alone, or in multi-player group sessions. [DreamCatcher Interactive]… Expand"
  },
  {
    "name": "Saw II: Flesh & Blood",
    "details_link": "https://www.metacritic.com/game/playstation-3/saw-ii-flesh-blood",
    "publisher": "Konami",
    "release_date": "Oct 19 2010",
    "developers": [
      "Zombie Studios"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Survival"
    ],
    "meta_score": 45,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/6/5d98985594fe44525be119a8dcf46b29-98.jpg",
    "descriptions": "Step into the dark and tormented world of Saw 2 and experience the gruesome traps that Jigsaw has created to test your will to survive.  With new traps, puzzles, and combat system players will need to think fast and act quick to pass the rigors of the tests Jigsaw has engineered. Set betweenStep into the dark and tormented world of Saw 2 and experience the gruesome traps that Jigsaw has created to test your will to survive.  With new traps, puzzles, and combat system players will need to think fast and act quick to pass the rigors of the tests Jigsaw has engineered. Set between the Saw and  Saw II movies, the game follows Detective Tapp's estranged son Michael, who become Jigsaw's next subject while he is investigating father's recent death.   … Expand"
  },
  {
    "name": "Mobile Suit Gundam Seed: Never Ending Tomorrow",
    "details_link": "https://www.metacritic.com/game/playstation-2/mobile-suit-gundam-seed-never-ending-tomorrow",
    "publisher": "Bandai",
    "release_date": "Sep 29 2005",
    "developers": [
      "Bec"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Sci-Fi"
    ],
    "meta_score": 45,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/8/a1ae158e72c4923f846fd3e592f67ad3-98.jpg",
    "descriptions": "In the future world of the Cosmic Era, the human race is divided into genetically enhanced Coordinators and unmodified Naturals. In the year C.E. 70 the tensions between Naturals and Coordinators escalate into a global war, and Earth and space become battlefields for the robotic weaponsIn the future world of the Cosmic Era, the human race is divided into genetically enhanced Coordinators and unmodified Naturals. In the year C.E. 70 the tensions between Naturals and Coordinators escalate into a global war, and Earth and space become battlefields for the robotic weapons known as mobile suits. Two young warriors, Kira Yamato of the Earth Alliance and Athrun Zala of the ZAFT forces, enter the conflict at the controls of powerful Gundam mobile suits. But there are other stories than theirs, and in this fierce conflict, many other ace pilots are creating legends of their own. Featuring more than 50 playable mobile suits from the TV series. 4 game play modes including Story Mode, Mission Mode and 2 player Versus Mode. Featuring the combat system, unique weapons and attacks from the TV series; pick your favorite mobile suit and battle it out. 3D aerial-and-ground action: use thrusters to hover or fight mid-air or battle on the ground. Select a partner pilot to provide support and weapon upgrades. [Bandai]… Expand"
  },
  {
    "name": "Crime Stories: From the Files of Martin Mystere",
    "details_link": "https://www.metacritic.com/game/pc/crime-stories-from-the-files-of-martin-mystere",
    "publisher": "The Adventure Company",
    "release_date": "Mar 21 2006",
    "developers": [
      "Artematica"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Adventure",
      "3D",
      "Modern",
      "Third-Person",
      "Modern"
    ],
    "meta_score": 45,
    "users_score": 4.6,
    "image": "https://static.metacritic.com/images/products/games/7/e9b89794335ec1eb3a611ccfb78b4f1b-98.jpg",
    "descriptions": "(Also known as \"Martin Mystère: Operation Dorian Gray\")  Take on the role of Martin Mystère, a brilliant young F.B.I. agent, who has just been called upon to investigate the brutal murder of the highly reputed scientist, Professor Eulemberg. Your investigations into the murder will take you(Also known as \"Martin Mystère: Operation Dorian Gray\")  Take on the role of Martin Mystère, a brilliant young F.B.I. agent, who has just been called upon to investigate the brutal murder of the highly reputed scientist, Professor Eulemberg. Your investigations into the murder will take you all over the world as you are confronted with many dangerous and exhilarating adventures. Only you will be able to solve this horrific crime – that is if you act fast... and keep your wits about you! [Adventure Company]… Expand"
  },
  {
    "name": "Tank! Tank! Tank!",
    "details_link": "https://www.metacritic.com/game/wii-u/tank!-tank!-tank!",
    "publisher": "Namco Bandai Games",
    "release_date": "Nov 18 2012",
    "developers": [
      "Namco Bandai Games"
    ],
    "platforms": "Wii U",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "Simulation",
      "Driving",
      "Car Combat",
      "Car Combat",
      "Vehicle",
      "Combat"
    ],
    "meta_score": 45,
    "users_score": 5.9,
    "image": "https://static.metacritic.com/images/products/games/5/435e0367f4ade4bf0aefb11d2e5f7581-98.jpg",
    "descriptions": "Players will find an armament of tanks and weapons at their disposal to dispatch the enemy threat, including mechanical insects, gigantic dragons and even other players. Team up with three other friends to battle with or against each other in fully destructible environments in a variety ofPlayers will find an armament of tanks and weapons at their disposal to dispatch the enemy threat, including mechanical insects, gigantic dragons and even other players. Team up with three other friends to battle with or against each other in fully destructible environments in a variety of action-packed story and multiplayer modes where weapons are never in short supply and threats are hiding behind every corner. Players will be able to arm their tanks with lasers, machine guns, missile pods, the dreaded Colossus Missile along with power-ups scattered throughout each map.… Expand"
  },
  {
    "name": "Impire",
    "details_link": "https://www.metacritic.com/game/pc/impire",
    "publisher": "Paradox Interactive",
    "release_date": "Feb 13 2013",
    "developers": [
      "Cyanide"
    ],
    "platforms": "PC",
    "genres": [
      "Strategy",
      "General",
      "General"
    ],
    "meta_score": 45,
    "users_score": 5.4,
    "image": "https://static.metacritic.com/images/products/games/0/5041fc91ac33c140dbc0974509c39c82-98.jpg",
    "descriptions": "Developed by Cyanide in Montreal, Impire tells the sordid tale of Baal-Abaddon, a once-mighty horror from the Bottomless Pit, who finds himself summoned by the incompetent sorcerer, Oscar van Fairweather, and trapped in the form of a laughable imp. Using their cunning and an array of deviousDeveloped by Cyanide in Montreal, Impire tells the sordid tale of Baal-Abaddon, a once-mighty horror from the Bottomless Pit, who finds himself summoned by the incompetent sorcerer, Oscar van Fairweather, and trapped in the form of a laughable imp. Using their cunning and an array of devious tricks, players will help the demon lord break free, rebuild his proper hell-spawn body, and construct an impressive dungeon to form the seat of his new kingdom. Players will have to design, develop, and defend their demonic dungeon from would-be do-gooders in order to expand and triumph.… Expand"
  },
  {
    "name": "Without Warning",
    "details_link": "https://www.metacritic.com/game/playstation-2/without-warning",
    "publisher": "Capcom",
    "release_date": "Nov  1 2005",
    "developers": [
      "CiRCLE"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Modern"
    ],
    "meta_score": 45,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/1/2d717e276e807231ebcdde9616e9ce1f-98.jpg",
    "descriptions": "In Without Warning, a radical terrorist group has targeted and seized the Peterson-Daniels Chemical Facility, a vulnerable location that jeopardizes millions of people from the devastating ecological hazard it imposes if destroyed. Pleas are useless and any direct military assault would beIn Without Warning, a radical terrorist group has targeted and seized the Peterson-Daniels Chemical Facility, a vulnerable location that jeopardizes millions of people from the devastating ecological hazard it imposes if destroyed. Pleas are useless and any direct military assault would be too great a risk. As terrified hostages fearfor their lives, their only hope lies with a covert operations team, whose goal is to infiltrate the plant and eliminate the merciless enemy. The harrowing events unfold over a 12 hour period, featuring a unique gameplay dynamic which enables the six central characters to experience events across the same timeline but from their own distinct viewpoints. The player controls each character individually, with the focus automatically shifting to a new character at key moments which are unfolded throughcut scenes. By switching between the characters, their individual tales are woven together to create an overall picture of the events that happened during the crisis. The player will also retrospectively view events through the eyes of another character and is therefore not only a participant in the events, but a spectator as well. Furthermore, actions performed as one character affect the progress of others and players must successfully utilize the strengths of each in order to advance. [Capcom]… Expand"
  },
  {
    "name": "Unlimited Saga",
    "details_link": "https://www.metacritic.com/game/playstation-2/unlimited-saga",
    "publisher": "Square Enix",
    "release_date": "Jun 17 2003",
    "developers": [
      "SquareSoft"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 45,
    "users_score": 4.7,
    "image": "https://static.metacritic.com/images/products/games/5/449285e0e08486a3faf216bb72c0cf47-98.jpg",
    "descriptions": "The story is uniquely told through the eyes of seven different protagonists, each with their own motivations for seeking the seven grand menaces. The powers of the Seven Wonders of Lore have been released and a deity has emerged, heralding the advent of a new Golden Age. A group ofThe story is uniquely told through the eyes of seven different protagonists, each with their own motivations for seeking the seven grand menaces. The powers of the Seven Wonders of Lore have been released and a deity has emerged, heralding the advent of a new Golden Age. A group of adventurers led only by their belief in the legend journey out to solve the deity?s riddle. Their fates cross in a town during the hustle and bustle of a festival.… Expand"
  },
  {
    "name": "Arctic Thunder",
    "details_link": "https://www.metacritic.com/game/playstation-2/arctic-thunder",
    "publisher": "Midway",
    "release_date": "Sep 17 2001",
    "developers": [
      "Inland Productions"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "Snow / Water"
    ],
    "meta_score": 45,
    "users_score": 4.8,
    "image": "https://static.metacritic.com/images/products/games/1/e44556eeb592d4b9103230f34f797524-98.jpg",
    "descriptions": "Climb on for a little high-speed snowmobile racing (and some hand-to-hand combat) with 19 characters/sleds to choose from, and 12 available tracks to tear up within race, training, battle, and arcade modes."
  }
]