[{"name": "PixelJunk Shooter", "details_link": "https://www.metacritic.com/game/playstation-3/pixeljunk-shooter", "publisher": "SCEA", "release_date": "Dec 10 2009", "developers": ["Q-Games"], "platforms": ["PC", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 87, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/4336bebf81898fc69b28f9e5b3492b50-98.jpg", "descriptions": "[Playstation Network]  PixelJunk Shooter places you in the cockpit of a subterranean exploration vehicle to investigate the interior of diverse cave-like complexes where you must affect the surrounding and dynamic terrain to progress. Safely navigate through each vivid stage and rescue[Playstation Network]  PixelJunk Shooter places you in the cockpit of a subterranean exploration vehicle to investigate the interior of diverse cave-like complexes where you must affect the surrounding and dynamic terrain to progress. Safely navigate through each vivid stage and rescue survivors scattered about the cavernous environment, attempting to control various types of liquid, such as water and magma, and solid matter (including rock and earth) by destroying, manipulating or moving it. Strategy is paramount - a variety of enemies are out to get you while you attempt your rescue missions, and your craft is susceptible to overheating if you let it get to close to the hot liquids of the environment. Experience addictive gameplay blended with hypnotic, stylised High Definition visuals and original music. Change the terrain and environment around you to shape your levels. Share your scores and game footage with the world with online rankings. [SCEE]… Expand"}, {"name": "Warhammer 40,000: Dawn of War - Dark Crusade", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-dawn-of-war---dark-crusade", "publisher": "THQ", "release_date": "Oct  9 2006", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/d1fa31d779b529ade7369663aa9efa78-98.jpg", "descriptions": "Warhammer 40,000: Dawn of War: Dark Crusade is set in Games Workshop's world of Warhammer  40,000 - a dark, futuristic, fantasy universe where armies of technologically advanced warriors, fighting machines and hordes of implacable aliens wage constant war - and is traveled by millionsWarhammer 40,000: Dawn of War: Dark Crusade is set in Games Workshop's world of Warhammer  40,000 - a dark, futuristic, fantasy universe where armies of technologically advanced warriors, fighting machines and hordes of implacable aliens wage constant war - and is traveled by millions worldwide. As a hybrid expansion, the game offers a complete standalone experience, allowing gamers to play as all seven races, including the all-new, mysterious Tau and the chilling Necron. Fans who own the entire Dawn of War series can look forward to new units across each of the five original races, expansive bonus content and the ability to play as any of the seven races in multiplayer. [THQ]… Expand"}, {"name": "Dark Cloud 2", "details_link": "https://www.metacritic.com/game/playstation-2/dark-cloud-2", "publisher": "SCEA", "release_date": "Feb 17 2003", "developers": ["Level 5"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/a0bee551e87dd5d75528246f3e9001fc-98.jpg", "descriptions": "[Known as \"Dark Chronicle\" in the UK] Live the adventure of an inventive young man, visited by a protector of the future. Rely on your creative ability to rebuild destroyed worlds, invent equipment needed for your journey and repair weaponry damaged in battle. Your efforts will determine the[Known as \"Dark Chronicle\" in the UK] Live the adventure of an inventive young man, visited by a protector of the future. Rely on your creative ability to rebuild destroyed worlds, invent equipment needed for your journey and repair weaponry damaged in battle. Your efforts will determine the outcome of things to come.… Expand"}, {"name": "GRID", "details_link": "https://www.metacritic.com/game/xbox-360/grid", "publisher": "Codemasters", "release_date": "Jun  3 2008", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/708b638a0175ae010f007577f49b3fee-98.jpg", "descriptions": "(Also known as \"Race Dirver: GRID\")  GRID takes players to dramatic and beautifully realized race locations over three continents to compete in a variety of racing events. Packed with the most powerful race cars - new and classic, circuit and drift - players compete to conquer the most(Also known as \"Race Dirver: GRID\")  GRID takes players to dramatic and beautifully realized race locations over three continents to compete in a variety of racing events. Packed with the most powerful race cars - new and classic, circuit and drift - players compete to conquer the most prestigious official race tracks and championships then beyond to compete in challenging city-based competitions, and then on through to road events and urban street races. The drama, the rivalries, the aggression and the crashes; this is not a game about collecting cars or spending all of your time in the front-end tuning suspension settings or designing liveries. Codemasters wants to make racing exciting again. Gamers compete on Europe's greatest official race tracks in prestige Marques including Aston Martin, Koenigsegg and Pagani. Iconic cities across the U.S, including San Francisco, Washington DC and Detroit - each with their own atmosphere and events - play host to diverse street races, where high-performance V8 muscle cars set the pace in aggressive, closely fought pack competitions. And in the Far East, Japanese racing culture sets the tone where night races, including Drift racing, takes drivers through neon illuminated cities and to outlying mountain roads. There's also the opportunity to compete in races that operate on the fringes of legality in the back streets and industrial areas of Yokohama. [Codemasters]… Expand"}, {"name": "West of Loathing", "details_link": "https://www.metacritic.com/game/pc/west-of-loathing", "publisher": "Asymmetric Publications", "release_date": "Aug 10 2017", "developers": ["Asymmetric Publications"], "platforms": ["Stadia", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/7666cd3642162ffb568289b71d6fa78d-98.jpg", "descriptions": "West of Loathing — a slapstick comedy stick-figure wild west adventure role-playing game."}, {"name": "Tom Clancy's Splinter Cell Pandora Tomorrow", "details_link": "https://www.metacritic.com/game/playstation-2/tom-clancys-splinter-cell-pandora-tomorrow", "publisher": "Ubisoft", "release_date": "Jun 16 2004", "developers": ["Ubisoft Shanghai"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action Adventure", "Modern"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/16bd989937cedf41856e1a81a0337b0e-98.jpg", "descriptions": "Once again assume the role Sam Fisher as you defend and assist the U.S. troops who become emroiled in a conflict between East Timor and Indonesian guerillas. Immerse yourself into a deep, tangible, tension-packed techno-thriller without compare. Master your new arsenal of moves and gadgetsOnce again assume the role Sam Fisher as you defend and assist the U.S. troops who become emroiled in a conflict between East Timor and Indonesian guerillas. Immerse yourself into a deep, tangible, tension-packed techno-thriller without compare. Master your new arsenal of moves and gadgets to save the innocent from a global threat. Conceal yourself in real-time moving shadows for the first time.… Expand"}, {"name": "Iconoclasts", "details_link": "https://www.metacritic.com/game/pc/iconoclasts", "publisher": "Bifrost Entertainment", "release_date": "Jan 23 2018", "developers": ["Joakim Sandberg", "Konjak"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 87, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/2776f291ae9ae5a752931cead5bae103-98.jpg", "descriptions": "Join renegade mechanic Robin and uncover the secrets of a dying planet. Explore a big world filled with intricate puzzles, interesting characters and menacing bosses in a beautiful platform adventure that tells a personal story about faith, purpose and the challenge of helping people."}, {"name": "Kingdom Hearts II", "details_link": "https://www.metacritic.com/game/playstation-2/kingdom-hearts-ii", "publisher": "Square Enix", "release_date": "Mar 28 2006", "developers": ["Square Enix"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/5/1fe1bee5a6362c4089cdbed1c8786a9d-98.jpg", "descriptions": "It has been a year since the events of \"Kingdom Hearts.\" Sora and friends are joined by a vibrant new cast of characters, including the king himself. Together, they will face countless dangers in worlds both familiar and brand-new. It seems the Heartless still exist. A new villain alsoIt has been a year since the events of \"Kingdom Hearts.\" Sora and friends are joined by a vibrant new cast of characters, including the king himself. Together, they will face countless dangers in worlds both familiar and brand-new. It seems the Heartless still exist. A new villain also awaits - but is it an old foe behind the mask, or a new menace? This mystery and others will be solved as the story unfolds in a grand adventure.… Expand"}, {"name": "Iconoclasts", "details_link": "https://www.metacritic.com/game/switch/iconoclasts", "publisher": "Bifrost Entertainment", "release_date": "Aug  2 2018", "developers": ["Joakim Sandberg", "MP2 Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/de854580425cd1cefa34bfa06f17d13c-98.jpg", "descriptions": "Robin just wants to be a mechanic and help people, but without a license she's a sinner in Mother's eyes. Ever since picking up her wrench, the world has been going nuts and she's wanted to bolt it back together. Now Penance is raining down on everyone she loves and One Concern agents areRobin just wants to be a mechanic and help people, but without a license she's a sinner in Mother's eyes. Ever since picking up her wrench, the world has been going nuts and she's wanted to bolt it back together. Now Penance is raining down on everyone she loves and One Concern agents are after her.But something big is going on bigger than droughts of Ivory fuel and personal conflicts and Robin's in the thick of it.* Hours of nut-twisting platform action-adventure* Numerous densely detailed locations filled with fine-tuned action and puzzles* 20+ gear-grinding, screen-filling boss battles stand in your way* Three game-changing difficulty settings supported by a unique tweak system* A heart-wrenching epic can one mechanic fix the whole world?Iconoclasts is the masterwork of indie developer Joakim Sandberg, seven long years in the making. Iconoclasts delivers awesome action, hilarious hijinks and an emotional rollercoaster of deeply personal storytelling.… Expand"}, {"name": "Fallout 4", "details_link": "https://www.metacritic.com/game/playstation-4/fallout-4", "publisher": "Bethesda Softworks", "release_date": "Nov 10 2015", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Western-Style"], "meta_score": 87, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/cb580ff127697995b5613abcd28adff2-98.jpg", "descriptions": "As the sole survivor of Vault 111, you enter a world destroyed by nuclear war. Every second is a fight for survival, and every choice is yours. Only you can rebuild and determine the fate of the Wasteland. Welcome home."}, {"name": "NBA 2K14", "details_link": "https://www.metacritic.com/game/xbox-360/nba-2k14", "publisher": "2K Sports", "release_date": "Oct  1 2013", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 87, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/05a45a553f0dd8fda7c2b3491b8db6e8-98.jpg", "descriptions": "Face off against opposing crews online using your MyPLAYER. Create your logo and face off in 5v5 battles with other crews featuring leaderboards and stats. Play with 14 of the top European teams, featuring authentic uniforms and players. Player attributes and tendencies automatically updateFace off against opposing crews online using your MyPLAYER. Create your logo and face off in 5v5 battles with other crews featuring leaderboards and stats. Play with 14 of the top European teams, featuring authentic uniforms and players. Player attributes and tendencies automatically update daily to reflect true life hot and cold streaks. Now, each game played in the NBA can have an effect on your game.… Expand"}, {"name": "Bayonetta", "details_link": "https://www.metacritic.com/game/playstation-3/bayonetta", "publisher": "Sega", "release_date": "Jan  5 2010", "developers": ["PlatinumGames", "Nex Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "Fantasy", "Beat-'Em-Up", "Linear"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/4335fdd8969ff082e090004f4219fb58-98.jpg", "descriptions": "Bayonetta is a stylish and cinematic action game directed by creator Hideki Kamiya. A member of an ancient witch clan and possessing powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless ethereal enemies, many reaching epic proportions, in a game of 100%Bayonetta is a stylish and cinematic action game directed by creator Hideki Kamiya. A member of an ancient witch clan and possessing powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless ethereal enemies, many reaching epic proportions, in a game of 100% pure, unadulterated all-out action. Outlandish finishing moves are performed with balletic grace as Bayonetta flows from one fight to another. With over-the-top action taking place in stages that are a veritable theme park of exciting attractions, Bayonetta pushes the limits of the action genre, bringing to life its fast-paced, dynamic climax combat. [Sega]… Expand"}, {"name": "Ratchet & Clank Future: A Crack in Time", "details_link": "https://www.metacritic.com/game/playstation-3/ratchet-clank-future-a-crack-in-time", "publisher": "SCEA", "release_date": "Oct 27 2009", "developers": ["Insomniac Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/ffc0057bd1dd4845f48ff4031852c189-98.jpg", "descriptions": "Concluding the events set into motion by Ratchet & Clank Future: Tools of Destruction, Ratchet & Clank Future: A Crack in Time at long last answers some of the franchise fans' largest questions. After discovering that Clank's disappearance was engineered by Dr. Nefarious, Ratchet races toConcluding the events set into motion by Ratchet & Clank Future: Tools of Destruction, Ratchet & Clank Future: A Crack in Time at long last answers some of the franchise fans' largest questions. After discovering that Clank's disappearance was engineered by Dr. Nefarious, Ratchet races to rescue his best friend. Unfortunately, he discovers that Clank's capture is just the beginning of Nefarious's latest diabolical plot. In this follow-up to the best-selling series, Ratchet & Clank Future: A Crack in Time puts players into the role of both Ratchet and Clank as they attempt to reunite and save the universe. Along the way, both finally uncover the hidden truth behind their origins, and discover their ultimate destinies. As the duo come closer to reuniting, they have to ask themselves the biggest question of all: Do Ratchet and Clank's destinies lie with each other? Or is it finally time for the universe's greatest duo to separate for good? Players use new gadgets such as Ratchet’s Hoverboots to explore levels and can take off in Ratchet’s ship to discover nearby moons and planets. Clank use new abilities to manipulate time to try and stop Dr. Nefarious. [Sony]… Expand"}, {"name": "ESPN NBA Basketball", "details_link": "https://www.metacritic.com/game/xbox/espn-nba-basketball", "publisher": "Sega", "release_date": "Oct 22 2003", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/57fad5fcfad35edb5a2930a923b8b136-98.jpg", "descriptions": "Hit the hardwood with nonstop action and intense competition with ESPN NBA Basketball. Complete with all the detailed visuals, eye-catching callouts, and commentary, ESPN NBA Basketball presents all the excitement and quickness from a real NBA game. Not only can you unleash the most skilledHit the hardwood with nonstop action and intense competition with ESPN NBA Basketball. Complete with all the detailed visuals, eye-catching callouts, and commentary, ESPN NBA Basketball presents all the excitement and quickness from a real NBA game. Not only can you unleash the most skilled crossovers and unbelievable jukes with Isomotion control, but you can also completely lock down opponents with rock-solid D. Challenge current and legendary NBA players in real time--24 hours a day, seven days a week--with your own created player in 24/7 mode.… Expand"}, {"name": "MotoGP 2", "details_link": "https://www.metacritic.com/game/xbox/motogp-2", "publisher": "THQ", "release_date": "May 21 2003", "developers": ["Climax Group"], "platforms": ["PC", "Xbox"], "num_players": "1-16 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 87, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/114c2c3f9e4a422d2a974b3163ea6eb3-98.jpg", "descriptions": "MotoGP returns with challenging tracks, different gameplay modes, and online play. In MotoGP 2, you'll race against the top 20 riders in the world at speeds of 180mph around turns and corners with your knee inches from the ground. It's up to you to find the perfect combination of rider andMotoGP returns with challenging tracks, different gameplay modes, and online play. In MotoGP 2, you'll race against the top 20 riders in the world at speeds of 180mph around turns and corners with your knee inches from the ground. It's up to you to find the perfect combination of rider and bike to suit your style. Races take place on 16 tracks in all weather conditions. Challenge yourself to master these obstacles in all six single-player game modes and in online multiplayer matches for up to 16 players. … Expand"}, {"name": "Guilty Gear X2", "details_link": "https://www.metacritic.com/game/playstation-2/guilty-gear-x2", "publisher": "Sammy Studios", "release_date": "Feb  3 2003", "developers": ["Arc System Works"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/45e3588a9f36474cd2fd15fdff57e324-98.jpg", "descriptions": "Guilty Gear X2 revives the fighting tournament designed to find humans skilled enough to thwart the Gear threat. Take over 20 playable fighters, with 6 outrageous new characters. Use electrifying new moves and features, like Psych Burst, Faultless Defense, the all-new Burst Gauge system andGuilty Gear X2 revives the fighting tournament designed to find humans skilled enough to thwart the Gear threat. Take over 20 playable fighters, with 6 outrageous new characters. Use electrifying new moves and features, like Psych Burst, Faultless Defense, the all-new Burst Gauge system and more. Devastate your opponent with an arsenal of eye-popping, jaw-dropping moves and combos, including trademarks like Overdrive Attack, Gatling Combo, Roman Cancel and signature Instant Kills for each character! [Sammy]… Expand"}, {"name": "Sonic Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/sonic-advance", "publisher": "Sega", "release_date": "Feb  3 2002", "developers": ["Sonic Team"], "platforms": "Game Boy Advance", "genres": ["Action", "Platformer", "2D"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/b9940403e633da918871e5434a224ce9-98.jpg", "descriptions": "Sonic is back to save the world! The evil Dr. Eggman is at it again, with a brand new scheme to trip up Sonic and his pals. Maneuver your way through obstacles, puzzles and traps to collect the chaos emeralds and defeat the vile Dr. Eggman before it's too late!"}, {"name": "Half-Life", "details_link": "https://www.metacritic.com/game/playstation-2/half-life", "publisher": "Sierra Entertainment", "release_date": "Nov 11 2001", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/3fa40501f939576364b9e24faf748abf-98.jpg", "descriptions": "One of the best-selling games of all time, Half-Life has been completely redesigned for PlayStation2, with advanced graphic upgrades, more characters, and new multiplayer cooperative games.  So why not head back into the Black Mesa Federal Research Facility as Gordon Freeman for some moreOne of the best-selling games of all time, Half-Life has been completely redesigned for PlayStation2, with advanced graphic upgrades, more characters, and new multiplayer cooperative games.  So why not head back into the Black Mesa Federal Research Facility as Gordon Freeman for some more FPS carnage?… Expand"}, {"name": "Commandos 2: Men of Courage", "details_link": "https://www.metacritic.com/game/pc/commandos-2-men-of-courage", "publisher": "Eidos Interactive", "release_date": "Sep 20 2001", "developers": ["Pyro Studios"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/399cd25b120bbb1f31f634a92aa7d41f-98.jpg", "descriptions": "A tactical action/strategy game set against the backdrop of WWII. Take control of an elite group of commandos who must venture deep into enemy territory and utilize their combined expertise to complete a series of mission-based objectives. Go covert into new environments based on authenticA tactical action/strategy game set against the backdrop of WWII. Take control of an elite group of commandos who must venture deep into enemy territory and utilize their combined expertise to complete a series of mission-based objectives. Go covert into new environments based on authentic WWII locations: the heart of the third Reich, a northern European submarine installation, and the headquarters of the Japanese army.  [Eidos Interactive]… Expand"}, {"name": "Spider-Man", "details_link": "https://www.metacritic.com/game/playstation/spider-man", "publisher": "Activision", "release_date": "Aug 30 2000", "developers": ["Neversoft Entertainment"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/9de9fd4409c59b4ea492085156ab7ba7-98.jpg", "descriptions": "YOU DON'T JUST PLAY IT... YOU LIVE IT \r\rHe spins a web, swings across the sky and lands with a somersault onto the Daily Bugle building. Who is this masked hero? It's you! Fight, jump and web-sling as Spider-Man as you take on a legion of sinister villains.\r\r\nThe city is depending on you.YOU DON'T JUST PLAY IT... YOU LIVE IT \r\rHe spins a web, swings across the sky and lands with a somersault onto the Daily Bugle building. Who is this masked hero? It's you! Fight, jump and web-sling as Spider-Man as you take on a legion of sinister villains.\r The city is depending on you. Start swinging...… Expand"}, {"name": "Tenchu: Stealth Assassins", "details_link": "https://www.metacritic.com/game/playstation/tenchu-stealth-assassins", "publisher": "Activision", "release_date": "Aug 31 1998", "developers": ["Acquire"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/b2c3043f11ec430fb4e311e327843bca-98.jpg", "descriptions": "Prowl and strike with lethal precision as ninja assassins Rikimaru or Ayame in the shadowy world of feudal Japan. Armed with mystical weapons and sheer cunning, you must shed blood with discretion and move without detection. For only the unseen survive. Master dozens of motion-captured ninjaProwl and strike with lethal precision as ninja assassins Rikimaru or Ayame in the shadowy world of feudal Japan. Armed with mystical weapons and sheer cunning, you must shed blood with discretion and move without detection. For only the unseen survive. Master dozens of motion-captured ninja moves as you disembowel fearsome samurai, wild beasts, and evil demons. Wield 20 stunning death-dealing devices, including throwing stars, grappling hooks, caltrops and more. Stalk the towns, temples, forests, caves and dungeons of 16th century Japan in 10 deadly missions.… Expand"}, {"name": "Shin Megami Tensei: Persona 3", "details_link": "https://www.metacritic.com/game/playstation-2/shin-megami-tensei-persona-3", "publisher": "Atlus Co.", "release_date": "Aug 14 2007", "developers": ["Atlus Co."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 86, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/73a5a91f60a6903cbe9f8c759741aa72-98.jpg", "descriptions": "In Persona 3, assume the role of a high school student, who was orphaned as a young boy, and has recently transferred to Gekkoukan High School on Port Island. Only days after he arrives at the school dorm, he is attacked by a Shadow. The assault awakens his Persona, Orpheus, his only chanceIn Persona 3, assume the role of a high school student, who was orphaned as a young boy, and has recently transferred to Gekkoukan High School on Port Island. Only days after he arrives at the school dorm, he is attacked by a Shadow. The assault awakens his Persona, Orpheus, his only chance at defeating this creature of the night. He soon discovers that he shares this special ability with other students at his new school. From them he learns of the Dark Hour, a hidden time that exists between one day and the next, swarming with Shadows that have been slowing claiming victims known as The Lost - poor souls who have inexplicably been turned into walking zombies. Under the supervision of school chairman Shuji Ikutsuki, he joins his new friends in confronting this evil threat... With your school as the primary battlefield, you are forced to juggle between two lives: student by day, defender against evil by night. And your greatest challenges await you on the eve of each full moon. [Atlus]… Expand"}, {"name": "PixelJunk Monsters Deluxe", "details_link": "https://www.metacritic.com/game/psp/pixeljunk-monsters-deluxe", "publisher": "SCEA", "release_date": "Sep 30 2009", "developers": ["Q-Games"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "Fantasy", "Defense"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/532358d5c62ecd271c9c32bafd70b1f8-98.jpg", "descriptions": "The addictive world of PixelJunk Monsters goes on the move with the arrival of PixelJunk Monsters Deluxe. Combining the popular PlayStation 3 original strategy title with its follow-up expansion pack, Encore, PixelJunk Monsters Deluxe boasts all the gameplay of its PS3 counterpart with freshThe addictive world of PixelJunk Monsters goes on the move with the arrival of PixelJunk Monsters Deluxe. Combining the popular PlayStation 3 original strategy title with its follow-up expansion pack, Encore, PixelJunk Monsters Deluxe boasts all the gameplay of its PS3 counterpart with fresh new content and added portability. Defend your forest brood against an onslaught of monsters by building towers which automatically fire on your enemies. Make sure your placement and strategy is sound, or your helpless children will find themselves as a quick snack for the nasty encroaching creatures. PixelJunk Monsters Deluxe features a new island with 11 stages, unique monsters and bosses, a Medal challenge mode, Medal room (with movie player, gallery and sound player) and more. [SCEE]… Expand"}, {"name": "Forza Horizon 3", "details_link": "https://www.metacritic.com/game/pc/forza-horizon-3", "publisher": "Microsoft Game Studios", "release_date": "Sep 27 2016", "developers": ["Playground Games"], "platforms": ["Xbox One", "PC"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 86, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/f2924c21c7f25593889a048a5a34f64e-98.jpg", "descriptions": "You’re in charge of the Horizon Festival. Customize everything, hire and fire your friends, and explore Australia in over 350 of the world’s greatest cars. Make your Horizon the ultimate celebration of cars, music, and freedom of the open road. How you get there is up to you. Drive throughYou’re in charge of the Horizon Festival. Customize everything, hire and fire your friends, and explore Australia in over 350 of the world’s greatest cars. Make your Horizon the ultimate celebration of cars, music, and freedom of the open road. How you get there is up to you. Drive through the vast desert and rocky canyons of the Outback to lush, wild rainforests, and to the sandy beaches and gleaming skyscrapers of Australia's Gold Coast. [Microsoft]… Expand"}, {"name": "Tales From The Borderlands: Episode 5 - The Vault of the Traveler", "details_link": "https://www.metacritic.com/game/pc/tales-from-the-borderlands-episode-5---the-vault-of-the-traveler", "publisher": "Telltale Games", "release_date": "Oct 20 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/c2e5fae2950c624944e99a1fa4843dcf-98.jpg", "descriptions": "In the final episode of the season, all hell is breaking loose. Jack is now in control of Helios' systems, and he is ready to reclaim his rightful place as king of Hyperion - with or without you. It's a mad dash to get out of the chaotic space station alive, as everyone scrambles to grab theIn the final episode of the season, all hell is breaking loose. Jack is now in control of Helios' systems, and he is ready to reclaim his rightful place as king of Hyperion - with or without you. It's a mad dash to get out of the chaotic space station alive, as everyone scrambles to grab the final Gortys piece and high tail it back to Pandora. Can you guide our motley crew through perilous corporate dangers in hopes of getting some copious alien riches? Loyalties will be tested, secrets will be revealed, and explosions will be in large supply in this final chapter of Tales From The Borderlands.… Expand"}, {"name": "Unreal Tournament III", "details_link": "https://www.metacritic.com/game/playstation-3/unreal-tournament-iii", "publisher": "Midway", "release_date": "Dec 11 2007", "developers": ["Epic Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/7a6a42cbb371b317b28b7f9b2b6c9fd7-98.jpg", "descriptions": "Players assume the role of a futuristic warrior engaged in contests of intense shooting battles against skilled opponents, controlled either by human contestants online or by A.I. These contests are fought with the most powerful sci-fi weapons and vehicles.Unparalleled graphical and physicalPlayers assume the role of a futuristic warrior engaged in contests of intense shooting battles against skilled opponents, controlled either by human contestants online or by A.I. These contests are fought with the most powerful sci-fi weapons and vehicles.Unparalleled graphical and physical realism from the latest Unreal Engine 3 technology delivers the most compelling First Person Shooter Experience to-date...online and offline. The weaponry is bigger and badder than ever. Destroy your opponent from a distance with the ever popular Link Gun or blast away at close range with the Bio Rifle. Battle against lightening fast A.I. in the deeper and richer single player tournament mode. Expanded Onslaught game type features two complete sets of high-tech vehicles, including the massive Leviathan, the terrifying Darkwalker, and a completely new way to get into the action...the Hoverboard. Fight side-by-side with or compete against new and returning characters from the UT franchise, all with enhanced abilities, extremely detailed looks and distinct personalities. Enhanced popular game types, including: Deathmatch, Team Deathmatch, Capture the Flag, and Instagib CTF and more. [Midway]… Expand"}, {"name": "LostWinds: Winter of the Melodias", "details_link": "https://www.metacritic.com/game/wii/lostwinds-winter-of-the-melodias", "publisher": "Frontier Developments", "release_date": "Oct 19 2009", "developers": ["Frontier Developments"], "platforms": ["iPhone/iPad", "PC", "Wii"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 86, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/3/752a72c07730ebbab7842491d1fe4c2a-98.jpg", "descriptions": "[WiiWare World]  The follow-up to last year's WiiWare launch title once again puts the power of the wind in the palm of your hand, as you experience Toku and Enril's new adventure to save Toku's mother, lift an ancient curse and thwart the evil Balasar. The elemental powers of Enril the Wind[WiiWare World]  The follow-up to last year's WiiWare launch title once again puts the power of the wind in the palm of your hand, as you experience Toku and Enril's new adventure to save Toku's mother, lift an ancient curse and thwart the evil Balasar. The elemental powers of Enril the Wind Spirit are used to protect and guide the young boy Toku - power his jumps and glides, suspend and smash new enemies, and explore all-new expanses of the stunningly presented, magical land of Mistralis. Players can instantly transform Mistralis between Summer and Winter, harnessing the brilliance of nature: frozen Winter ponds and waterfalls become deep, teeming Summer pools and chambers in which to dive and unlock secrets, enemies can be frozen or doused, and the very air itself used to form snowballs or moisture-laden clouds. Other amazing new abilities include the cyclone, which can be used to transport Toku, smash powerful enemies and even drill through the rock of Mistralis' diverse, richly interactive Chilling Peaks and Melodia City areas. [Frontier Developments]… Expand"}, {"name": "Thumper", "details_link": "https://www.metacritic.com/game/xbox-one/thumper", "publisher": "drool Games", "release_date": "Aug 18 2017", "developers": ["drool Games", "Drool"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One"], "genres": ["Action", "Rhythm", "Music"], "meta_score": 86, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/c3d6f9b59d4945726db2c2bd2b697551-98.jpg", "descriptions": "Thumper is rhythm violence: classic rhythm-action, blistering speed, and brutal physicality."}, {"name": "Bastion", "details_link": "https://www.metacritic.com/game/pc/bastion", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Aug 16 2011", "developers": ["Supergiant Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Action RPG", "Action RPG"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/96e9e4dd44bac8a32c6a897b58ebf069-98.jpg", "descriptions": "Bastion is an action rpg form Supergiant Games."}, {"name": "The Witness", "details_link": "https://www.metacritic.com/game/xbox-one/the-witness", "publisher": "Thekla, Inc", "release_date": "Sep 13 2016", "developers": ["Thekla", "Inc"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/36e5be2ec84133873f3ea3005ca33efa-98.jpg", "descriptions": "You wake up, alone, on a strange island full of puzzles that will challenge and surprise you. You don't remember who you are, and you don't remember how you got here, but there's one thing you can do: explore the island in hope of discovering clues, regaining your memory, and somehow findingYou wake up, alone, on a strange island full of puzzles that will challenge and surprise you. You don't remember who you are, and you don't remember how you got here, but there's one thing you can do: explore the island in hope of discovering clues, regaining your memory, and somehow finding your way home. The Witness is a single-player game in an open world with dozens of locations to explore and over 500 puzzles. This game respects you as an intelligent player and it treats your time as precious. There's no filler each of those puzzles brings its own new idea into the mix. So, this is a game full of ideas.… Expand"}, {"name": "Gone Home", "details_link": "https://www.metacritic.com/game/pc/gone-home", "publisher": "The Fullbright Company", "release_date": "Aug 15 2013", "developers": ["The Fullbright Company"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Sci-Fi", "Adventure", "3D", "First-Person"], "meta_score": 86, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/715974435c4f97c8da038dfa7db53c2a-98.jpg", "descriptions": "The eldest daughter of the Greenbriar family returns after a year abroad. She expects her parents and sister to greet her. Instead she finds only a deserted house, filled with secrets. Where is everyone? And what's happened here?\r Find out for yourself in Gone Home, a first-person gameThe eldest daughter of the Greenbriar family returns after a year abroad. She expects her parents and sister to greet her. Instead she finds only a deserted house, filled with secrets. Where is everyone? And what's happened here?\r Find out for yourself in Gone Home, a first-person game entirely about exploration, mystery and discovery.\r The house is yours to explore as you see fit. Open any drawer or door to investigate what's inside. Piece together the mysteries from notes and clues woven into the house itself. Discover the story of a year in the life of the Greenbriar family. Dig deeper. Go home again.… Expand"}, {"name": "The Last Friend", "details_link": "https://www.metacritic.com/game/switch/the-last-friend", "publisher": "Stonebot Studio", "release_date": "Apr  7 2022", "developers": ["Stonebot Studio"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 86, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/ebb1c886422e3649e87f16cb47b81f3a-98.jpg", "descriptions": "Seamlessly blending both the arcade action of games like Streets of Rage with the strategical thinking of titles like Plants vs. Zombies, The Last Friend quickly becomes a battle of man and canine standing stalwart against the end of the world. The Last Friend brings in a horde ofSeamlessly blending both the arcade action of games like Streets of Rage with the strategical thinking of titles like Plants vs. Zombies, The Last Friend quickly becomes a battle of man and canine standing stalwart against the end of the world. The Last Friend brings in a horde of super-powered dogs to help players drive back the violent mutants and gangs of the apocalypse in a fun, fast-paced hybrid of Brawler and Tower Defense. You’ll work your way across a vast dystopian, wasteland rescuing doggos who will in turn help you save the world in your roving battle station of conversion van that would make Harry from Dumb and Dumber incredibly jealous.… Expand"}, {"name": "Bustafellows", "details_link": "https://www.metacritic.com/game/switch/bustafellows", "publisher": "PQube", "release_date": "Jul 30 2021", "developers": ["eXtend"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 86, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/0c54e8e46e44c4b26a31b91b0863e349-98.jpg", "descriptions": "Arrive in New Sieg, a beautiful fictional town. Step into the shoes of a strong, smart and gifted journalist in this romantic adventure. You play the part of a young woman with the ability to leap in the past for a very short period in the bodies of others, which you use for data collection Arrive in New Sieg, a beautiful fictional town. Step into the shoes of a strong, smart and gifted journalist in this romantic adventure. You play the part of a young woman with the ability to leap in the past for a very short period in the bodies of others, which you use for data collection and helping people. After witnessing the murder of a crooked lawyer – she goes back in time in an attempt to save him. Thus, the journey begins as our protagonist goes back in time in the body of another person and tries to warn Limbo. It's up to you to figure out how to save him.… Expand"}, {"name": "Pac-Man Championship Edition DX +", "details_link": "https://www.metacritic.com/game/pc/pac-man-championship-edition-dx-+", "publisher": "Namco Bandai Games", "release_date": "Sep 24 2013", "developers": ["Namco Bandai Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/319e6301cd997f4add7b7f75c42bde44-98.jpg", "descriptions": "PAC-MAN CE DX + upgrades one of 2010's most celebrated downloadable titles with improved leaderboard functionality, in-game achievements and medals, as well as access to additional DLC mazes, music and graphics including classic DIG DUG and RALLY-X sprites. Players will chomp through brightPAC-MAN CE DX + upgrades one of 2010's most celebrated downloadable titles with improved leaderboard functionality, in-game achievements and medals, as well as access to additional DLC mazes, music and graphics including classic DIG DUG and RALLY-X sprites. Players will chomp through bright neon mazes at blistering speeds in this modern update to the classic PAC-MAN gameplay. … Expand"}, {"name": "Kirby's Epic Yarn", "details_link": "https://www.metacritic.com/game/wii/kirbys-epic-yarn", "publisher": "Nintendo", "release_date": "Oct 17 2010", "developers": ["Good-Feel"], "platforms": "Wii", "genres": ["Adventure", "General", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/ce185864c5052bef0b25642af5a197ce-98.jpg", "descriptions": "Kirby's wields his yarn through danger in the latest epic adventure."}, {"name": "Bomberman Blast", "details_link": "https://www.metacritic.com/game/wii/bomberman-blast", "publisher": "Hudson Soft", "release_date": "Sep 29 2008", "developers": ["Hudson"], "platforms": "Wii", "num_players": "8  Online", "genres": ["Miscellaneous", "Puzzle", "Action", "General", "Puzzle", "Action"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/58c2f4fbfe12c4e6c547f01ad3439f98-98.jpg", "descriptions": "[WiiWare]  Up to 8 players can battle online at once via Nintendo Wi-Fi Connection. Simple controls make this a great game for family and friends to enjoy at anytime. New items can be triggered by shaking the Wii Remote for excitement never before experienced in a Bomberman title. You can[WiiWare]  Up to 8 players can battle online at once via Nintendo Wi-Fi Connection. Simple controls make this a great game for family and friends to enjoy at anytime. New items can be triggered by shaking the Wii Remote for excitement never before experienced in a Bomberman title. You can even take the intensity up another notch by adding your own Miis to the mix. Battle results can be recorded on the Nintendo Wi-Fi Connection Ranking, so see how you stack up against others around the globe. This title promises to be a blast for everyone--from those who've never touched a Bomberman game, to the Bomberman masters. [Nintendo UK]… Expand"}, {"name": "DJ Hero 2", "details_link": "https://www.metacritic.com/game/playstation-3/dj-hero-2", "publisher": "Activision", "release_date": "Oct 19 2010", "developers": ["FreeStyleGames"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/2655d3e5cfef6cac94545b4148abf085-98.jpg", "descriptions": "Activision's turntable-based rhythm game is coming back for an encore."}, {"name": "Uncharted: The Nathan Drake Collection", "details_link": "https://www.metacritic.com/game/playstation-4/uncharted-the-nathan-drake-collection", "publisher": "SCEA", "release_date": "Oct  9 2015", "developers": ["Bluepoint Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "General", "Compilation"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/1af6cd8464d45ec0c5591984d745e5be-98.jpg", "descriptions": "From the storytellers at Naughty Dog, comes the epic that altered adventure storytelling, rebuilt by Bluepoint Games with the power of the PS4 system. Follow the harrowing journey of Nathan Drake across the globe, from humble beginnings to incredible discoveries. Meet a unique cast ofFrom the storytellers at Naughty Dog, comes the epic that altered adventure storytelling, rebuilt by Bluepoint Games with the power of the PS4 system. Follow the harrowing journey of Nathan Drake across the globe, from humble beginnings to incredible discoveries. Meet a unique cast of characters as Drake puts life and friendships on the line in a race against ruthless enemies to uncover unimaginable treasure. UNCHARTED: The Nathan Drake Collection includes the single-player campaigns for UNCHARTED: Drake’s Fortune, UNCHARTED 2: Among Thieves, and UNCHARTED 3: Drake’s Deception.\r… Expand"}, {"name": "The Elder Scrolls IV: Shivering Isles", "details_link": "https://www.metacritic.com/game/xbox-360/the-elder-scrolls-iv-shivering-isles", "publisher": "Bethesda Softworks", "release_date": "Mar 26 2007", "developers": ["Bethesda Softworks"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/86cec362631f2865e75a175a7c02e34f-98.jpg", "descriptions": "[Xbox Live Arcade]  Shivering Isles features more than 30 hours of new gameplay and allows you to explore an entirely new plane of Oblivion – the realm of Sheogorath, the Daedric Prince of Madness. Shivering Isles adds to the existing world of Oblivion so you can continue playing with your[Xbox Live Arcade]  Shivering Isles features more than 30 hours of new gameplay and allows you to explore an entirely new plane of Oblivion – the realm of Sheogorath, the Daedric Prince of Madness. Shivering Isles adds to the existing world of Oblivion so you can continue playing with your existing save game/character, or create an all new character just to explore the new content. Within the Realm of Sheogorath, players can explore the two extreme sides of the god's madness – the sublimely creative and the completely psychotic. Something is happening to the Shivering Isles and Sheogorath himself looks to you to be his champion and defend his realm and its inhabitants from destruction. Do you have the strength to survive his trials, tame a realm fraught with paranoia and despair, and wear the mantle of a God? The Shivering Isles features a bizarre landscape split between the two sides – Mania and Dementia-filled with vast, twisting dungeons mirroring the roots of the trees they are buried within. You'll encounter more than a dozen new creatures including hideous insects, Flesh Atronachs, skeletal Shambles, amphibious Grummites. Throughout your adventure, you will discover all new items, ingredients, spells, and more, and have the talented craftsmen of Crucible and Bliss forge new armor and weapons just for you. [Bethesda Softworks]… Expand"}, {"name": "Rocket League", "details_link": "https://www.metacritic.com/game/switch/rocket-league", "publisher": "Psyonix", "release_date": "Nov 14 2017", "developers": ["Psyonix"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Sports", "Team", "Soccer", "Arcade"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/0d3ced047044dbf626dee57536d555d8-98.jpg", "descriptions": "Rocket League is a high-powered hybrid of arcade soccer and driving with rewarding physics-based gameplay. Take to the pitch for a fully-featured offline season mode, multiple game types, casual and competitive online matches, and special \"Mutators\" that let you change the rules entirely.Rocket League is a high-powered hybrid of arcade soccer and driving with rewarding physics-based gameplay. Take to the pitch for a fully-featured offline season mode, multiple game types, casual and competitive online matches, and special \"Mutators\" that let you change the rules entirely. Express yourself with one of the deepest customization systems around and battle opponents on other platforms with cross-network play.… Expand"}, {"name": "The Great Ace Attorney Chronicles", "details_link": "https://www.metacritic.com/game/switch/the-great-ace-attorney-chronicles", "publisher": "Capcom", "release_date": "Jul 27 2021", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 86, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/3d45999d426268e42a8b6f0c806465e0-98.jpg", "descriptions": "With all the fun and drama of the Ace Attorney series set against the backdrop of Victorian-era Britain and Japan, there's sure to be no \"Objection!\" to the adventures of Ryunosuke Naruhodo as he turns the courtroom upside down. Featuring an intriguing overarching mystery spanning across twoWith all the fun and drama of the Ace Attorney series set against the backdrop of Victorian-era Britain and Japan, there's sure to be no \"Objection!\" to the adventures of Ryunosuke Naruhodo as he turns the courtroom upside down. Featuring an intriguing overarching mystery spanning across two games, it promises to be the most engrossing story in the series yet. [Capcom]… Expand"}, {"name": "Supreme Commander", "details_link": "https://www.metacritic.com/game/pc/supreme-commander", "publisher": "THQ", "release_date": "Feb 20 2007", "developers": ["Gas Powered Games"], "platforms": ["Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Command"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/547e77f67863bd2490a2a25b3333a1fc-98.jpg", "descriptions": "For a millennium, three opposing forces of humanity--the Cybran Nation, the Aeon Illuminate and the United Earth Federation--have fought a bitter and bloody war over conflicting and unwavering systems of belief. There is no room for compromise. No room for mercy. No room for anything but theFor a millennium, three opposing forces of humanity--the Cybran Nation, the Aeon Illuminate and the United Earth Federation--have fought a bitter and bloody war over conflicting and unwavering systems of belief. There is no room for compromise. No room for mercy. No room for anything but the complete eradication of anyone with opposing belief systems. Labeled the Infinite War, this horrific conflict has shattered a once peaceful galaxy and only served to deepen the hatred and schisms between the three factions. Now, after centuries of struggle, the battle for supremacy has at long last reached a turning point. You are a Supreme Commander, and only you have the power to bring the Infinite War to an end once and for all. Set in the 37th century, Supreme Commander signals the next evolution in the RTS genre by being the first strategy game to deliver a truly strategic and tactical experience. [THQ]… Expand"}, {"name": "Tales from the Borderlands: A Telltale Game Series", "details_link": "https://www.metacritic.com/game/playstation-4/tales-from-the-borderlands-a-telltale-game-series", "publisher": "Take-Two Interactive", "release_date": "Oct 20 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/c50b5a10cb4c49160568147683de5af5-98.jpg", "descriptions": "Like all good tales, there’s more than one side to a story. Especially one about a Vault key, the Hyperion Corporation, bandits, loot, gangsters, Vault Hunters, secret Atlas tech, explosions, getaways, extortion, betrayal, and mayhem. Set after the events seen in Borderlands 2, Tales fromLike all good tales, there’s more than one side to a story. Especially one about a Vault key, the Hyperion Corporation, bandits, loot, gangsters, Vault Hunters, secret Atlas tech, explosions, getaways, extortion, betrayal, and mayhem. Set after the events seen in Borderlands 2, Tales from the Borderlands is about Rhys, a Hyperion company man looking to become the next Handsome Jack, and it’s also about Fiona, a Pandoran con artist out to score the biggest of all swindles. Lured into danger by a Vault key and all it promises, the unlikely duo are thrown together with a common goal and a huge amount of mistrust. Who is telling the truth, and why is it important That’s up to you to decide. You are Rhys…and you are also Fiona, because like every tale worth telling, there are two…oh, you read that part already? Well, it’s important to remember that there *are* two sides to every story, and you my friend, you will tell this tale, or…tales, through the choices that you make. Your every decision as both Rhys and Fiona will affect the people and world around you: this is a game where YOU are the final author in a brand new Borderlands story set on the unforgiving world of Pandora. [TellTale Games]… Expand"}, {"name": "Total War: Shogun 2 - Fall of the Samurai", "details_link": "https://www.metacritic.com/game/pc/total-war-shogun-2---fall-of-the-samurai", "publisher": "Sega", "release_date": "Mar 22 2012", "developers": ["Creative Assembly"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/ee6aa624c95a76e8232947824db4abc8-98.jpg", "descriptions": "This massive-scale, stand-alone expansion to Total War: SHOGUN 2 offers a completely new experience to players. Six new playable clans, including those supporting a modern imperial Japan such as the Satsuma and those allied with the old Shogun like the Nagaoka, are now available. Three greatThis massive-scale, stand-alone expansion to Total War: SHOGUN 2 offers a completely new experience to players. Six new playable clans, including those supporting a modern imperial Japan such as the Satsuma and those allied with the old Shogun like the Nagaoka, are now available. Three great foreign powers must also be dealt with: America, Britain and France all have a vested interest in Japan’s future. How will you treat them? All this plays out across an expanded and improved campaign map, covering new island provinces in the far north and featuring all-new building and technology trees as well as brand new features such as railways and naval bombardments, seen for the first time in a Total War title.… Expand"}, {"name": "Startopia", "details_link": "https://www.metacritic.com/game/pc/startopia", "publisher": "Eidos Interactive", "release_date": "Jun 19 2001", "developers": ["Mucky Foot Productions"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General", "Management", "Government"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/61b808ccc4a47c11f105fc89a48cd2d8-98.jpg", "descriptions": "Any \"Futurama\" fanatics out there need another hit of space humor?  Rebuild and manage a giant 2001-esque space donut/station and attract a variety of alien species to it in a game that plays like the deep space version of \"Dungeon Keeper.\""}, {"name": "NBA Live 2001", "details_link": "https://www.metacritic.com/game/playstation/nba-live-2001", "publisher": "EA Sports", "release_date": "Oct 16 2000", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "PlayStation"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 86, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/b479866ea9f5bd1efb71f714da4d2b99-98.jpg", "descriptions": "NBA Live 2001 follows the fine tradition established by previous versions while adding just about every conceivable gameplay option."}, {"name": "Enemy Engaged: RAH-66 Comanche Versus Ka-52 Hokum", "details_link": "https://www.metacritic.com/game/pc/enemy-engaged-rah-66-comanche-versus-ka-52-hokum", "publisher": "Empire Interactive", "release_date": "Jul 31 2000", "developers": ["Razorworks"], "platforms": "PC", "num_players": "Up to 16 ", "genres": ["Simulation", "Flight", "Helicopter", "Helicopter", "Combat", "Civilian"], "meta_score": 86, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/d74d192449e874715623f19df05368f2-98.jpg", "descriptions": "Here's your chance to fly two of the deadliest next-gen attack helicopters -- the U.S. Army's RAH-66 Comanche gunship, a stealth helicopter with a radar signature 1/600th that of a Hellfire missile ... or the Russian-built counterpart, the twin-rotored death-deliverer -- the KA-52 Hokum-B.Here's your chance to fly two of the deadliest next-gen attack helicopters -- the U.S. Army's RAH-66 Comanche gunship, a stealth helicopter with a radar signature 1/600th that of a Hellfire missile ... or the Russian-built counterpart, the twin-rotored death-deliverer -- the KA-52 Hokum-B.  [Empire Interactive]… Expand"}, {"name": "Silent Hill", "details_link": "https://www.metacritic.com/game/playstation/silent-hill", "publisher": "Konami", "release_date": "Jan 31 1999", "developers": ["KCET"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 86, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/a3fecc938f95b4bba541c7ce606c14c3-98.jpg", "descriptions": "A young man searching for his daughter - struggling to exist in a place between reality and hell -  a town hiding gruesome, dark secrets. Follow a trail of blood and mutilation to snatch a loved one from the clutches of a demonic power. Enter an alternative dimension where death is noA young man searching for his daughter - struggling to exist in a place between reality and hell -  a town hiding gruesome, dark secrets. Follow a trail of blood and mutilation to snatch a loved one from the clutches of a demonic power. Enter an alternative dimension where death is no escape. Welcome to the madness that is Silent Hill...… Expand"}, {"name": "Fallout 2", "details_link": "https://www.metacritic.com/game/pc/fallout-2", "publisher": "Interplay", "release_date": "Oct 29 1998", "developers": ["Black Isle Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "First-Person", "PC-style RPG", "Western-Style"], "meta_score": 86, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/8/51a44ebe1999418c62c35c54710791df-98.jpg", "descriptions": "It's been 80 long years since your ancestor trod across the wastelands. As you search for the Garden of Eden Creation Kit to save your primitive village, your path is strewn with crippling radiation, megalomaniac mutants, and a relentless stream of lies, deceit, and treachery. You begin toIt's been 80 long years since your ancestor trod across the wastelands. As you search for the Garden of Eden Creation Kit to save your primitive village, your path is strewn with crippling radiation, megalomaniac mutants, and a relentless stream of lies, deceit, and treachery. You begin to wonder if anyone really stands to gain anything from this brave new world. [Interplay]… Expand"}, {"name": "Oddworld: Abe's Oddysee - New 'n' Tasty", "details_link": "https://www.metacritic.com/game/pc/oddworld-abes-oddysee---new-n-tasty", "publisher": "Oddworld Inhabitants", "release_date": "Feb 25 2015", "developers": ["Just Add Water"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/a4b4a0d756d03651b1262975224d694d-98.jpg", "descriptions": "Rescue your fellow meat factory slaves in this nostalgic, classic platformer with the latest immersive graphics and design.\r Find your destiny\r\n\r\nOnce a happy floor waxer in Oddworld's biggest meat processing plant, Abe stumbled across his boss's secret plan to turn the factory's slaveRescue your fellow meat factory slaves in this nostalgic, classic platformer with the latest immersive graphics and design.\r Find your destiny\r Once a happy floor waxer in Oddworld's biggest meat processing plant, Abe stumbled across his boss's secret plan to turn the factory's slave labour force into the latest in the RuptureFarms Tasty Treats line of novelty meat snacks.\r Abe now has to save his own skin from the grinders even if simply escaping the flesh farm is only the start of his Oddysee. Trigger-happy hunting parties, carnivorous sacred beasts, ancient temple traps and even a return to his former workplace await Abe on his journey to discover his people's heritage.… Expand"}, {"name": "Kirby: Canvas Curse", "details_link": "https://www.metacritic.com/game/ds/kirby-canvas-curse", "publisher": "Nintendo", "release_date": "Jun 13 2005", "developers": ["HAL Labs"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/a54eeb2787db0d05f8c3ceb4ba741c85-98.jpg", "descriptions": "(Also known as \"Touch! Kirby's Magic Paintbrush\")  Kirby: Canvas Curse delivers classic Kirby action with a fun twist. Using the stylus to control Kirby's movements is surprisingly intuitive, and the new control scheme provides many unique gameplay challenges. The rainbow paths you draw(Also known as \"Touch! Kirby's Magic Paintbrush\")  Kirby: Canvas Curse delivers classic Kirby action with a fun twist. Using the stylus to control Kirby's movements is surprisingly intuitive, and the new control scheme provides many unique gameplay challenges. The rainbow paths you draw guide Kirby through the game, but they also can protect Kirby from falling icicles, lasers, cannon blasts and other hazards. In addition to drawing paths, the stylus can also be used to stun enemies, destroy barriers, detonate bombs and much more. Each of the game's seven worlds is divided into three stages, and each stage holds three hidden medals. Some are easy to find, while others are either well-hidden or heavily protected. You don't need to find these medals to complete the game, but the medals you recover can be traded in to unlock special features like new ink colors for the paths you draw with the stylus. [Nintendo]… Expand"}, {"name": "Burnout Legends", "details_link": "https://www.metacritic.com/game/psp/burnout-legends", "publisher": "EA Games", "release_date": "Sep 13 2005", "developers": ["Criterion Games"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/0ea4f215ed02578e2a18d02d12b8065e-98.jpg", "descriptions": "Burnout Legends sets the bar for on-the-go automotive anarchy, combining the series’ trademark speed, destruction and depth with new PSP-only features, gameplay refinements and connectivity.  Gamers can look forward to eight gameplay modes, including crash, road rage and pursuit, withBurnout Legends sets the bar for on-the-go automotive anarchy, combining the series’ trademark speed, destruction and depth with new PSP-only features, gameplay refinements and connectivity.  Gamers can look forward to eight gameplay modes, including crash, road rage and pursuit, with white-knuckle multiplayer via WiFi, and a GameShare option allowing players to wirelessly share a demo level of the game with friends. [Electronic Arts]… Expand"}, {"name": "Final Fantasy XIV: Heavensward", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-xiv-heavensward", "publisher": "Square Enix", "release_date": "Jun 23 2015", "developers": ["Square Enix"], "platforms": ["PlayStation 3", "PlayStation 4", "PC"], "num_players": "Massively Multiplayer", "genres": ["Massively Multiplayer Online", "Fantasy", "Role-Playing", "Massively Multiplayer"], "meta_score": 86, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/0/16621897f310e3be2a7bb912321ed88f-98.jpg", "descriptions": "The Warriors of Light travel now to Ishgard a city-state mired in a 1000-year conflict with the dragons of the Dravanian Horde. Can our heroes reveal the ancient truths buried in Ishgard’s bloody history and help bring an end to the Dragonsong War? Can the Warriors of Light cast off theThe Warriors of Light travel now to Ishgard a city-state mired in a 1000-year conflict with the dragons of the Dravanian Horde. Can our heroes reveal the ancient truths buried in Ishgard’s bloody history and help bring an end to the Dragonsong War? Can the Warriors of Light cast off the shadows that darken the realm?… Expand"}, {"name": "Football Manager 2013", "details_link": "https://www.metacritic.com/game/pc/football-manager-2013", "publisher": "Sega", "release_date": "Nov  1 2012", "developers": ["Sports Interactive"], "platforms": "PC", "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 86, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/fd526be3ac6d4d330e67ceba2e16c0fc-98.jpg", "descriptions": "Football Manager 2013 brings 900-plus new and enhanced features to the Football Manager series."}, {"name": "Out of the Park Baseball 14", "details_link": "https://www.metacritic.com/game/pc/out-of-the-park-baseball-14", "publisher": "Out Of The Park Developments", "release_date": "Apr 15 2013", "developers": ["Out Of The Park Developments"], "platforms": "PC", "num_players": "1 Player", "genres": ["Sports", "Traditional", "Team", "Baseball", "Management", "Management", "Sim"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/ddf114138b439e582dfa97920a6612e0-98.jpg", "descriptions": "You'll love our 2013 roster set, which features not only up-to-date Opening Day rosters for all major league teams but also thousands of individually-rated players for all minor leagues and hundreds of players from the 2013 first-year player draft class. Major league player ratings areYou'll love our 2013 roster set, which features not only up-to-date Opening Day rosters for all major league teams but also thousands of individually-rated players for all minor leagues and hundreds of players from the 2013 first-year player draft class. Major league player ratings are officially based on Baseball Prospectus' PECOTA projection system, which has proven to be the most accurate player stats projection system on the market!\r The 2013 season will have plenty of drama in store. Will Mike Trout be able to improve upon his already legendary rookie season? Will Washington with a healthy Stephen Strasburg and a more experienced Bryce Harper dominate the AL East? Will Toronto's all-in approach pay off? How will the AL West welcome Houston? Play OOTP 14 and find out!… Expand"}, {"name": "ESPN NHL 2K5", "details_link": "https://www.metacritic.com/game/playstation-2/espn-nhl-2k5", "publisher": "Sega", "release_date": "Aug 30 2004", "developers": ["Kush Games"], "platforms": "PlayStation 2", "num_players": "10  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/d9525ff60b8dc6e241ee5cdd78f171a7-98.jpg", "descriptions": "ESPN NHL Hockey returns to the ice with the confidence of a seasoned veteran. Improved player control, an all-new fighting engine and lightning fast gameplay truly capture the feel and pace of NHL-caliber hockey. ESPN NHL 2005 features breakthrough new ways to play including online leagues,ESPN NHL Hockey returns to the ice with the confidence of a seasoned veteran. Improved player control, an all-new fighting engine and lightning fast gameplay truly capture the feel and pace of NHL-caliber hockey. ESPN NHL 2005 features breakthrough new ways to play including online leagues, multi-player mini-games and a deeper franchise mode adding endless replay value to an already robust lineup. Deeper and more interactive than before, this season's Skybox features more than 150 unlockables, including more retro jerseys, remote outdoor locations and more. Execute sliding poke checks, swipe at loose pucks and more with new defensive stick controls that give you hands-on stick movement in a variety of defensive situations. With exclusive ESPN presentation players will experience all the on-ice action called by ESPN veteran commentators, Gary Thorne and Bill Clement. [Sega]… Expand"}, {"name": "Overboard!", "details_link": "https://www.metacritic.com/game/switch/overboard!", "publisher": "inkle", "release_date": "Jun  2 2021", "developers": ["inkle"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/2db909cd99037fde60818a381ad307a2-98.jpg", "descriptions": "GET AWAY WITH MURDER. Highly replayable detective game where you're the one whodunnit. From the creators of 80 Days and Heaven's Vault. JULY, 1935. A MURDER HAS BEEN COMMITTED aboard the SS Hook, eight hours out from New York. Only one problem: you did it. Can you get away with murder?GET AWAY WITH MURDER. Highly replayable detective game where you're the one whodunnit. From the creators of 80 Days and Heaven's Vault. JULY, 1935. A MURDER HAS BEEN COMMITTED aboard the SS Hook, eight hours out from New York. Only one problem: you did it. Can you get away with murder?\r GAMEPLAY\r Blackmail a spy. Fall in love. Murder a rival. Cheat at cards. Drug a witness. Lie, befriend, betray, console, sneak, seduce, steal, borrow, pray, eavesdrop, kill...\r There are clues, evidence, suspects, accusations, secrets and lies.\r You’ll need all your cunning, coercion and charisma to ensure that someone else takes the fall.… Expand"}, {"name": "DiRT Rally", "details_link": "https://www.metacritic.com/game/xbox-one/dirt-rally", "publisher": "Codemasters", "release_date": "Apr  5 2016", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/6a3b822052d362bcd8d9c44e72c0fc16-98.jpg", "descriptions": "DiRT Rally features 39 of the most iconic and relevant cars from yesteryear through to modern day, representing the cars that the players want, and the ones that make the most sense for the surfaces they race on. Six rallies with over 70 stages. Head to the muddy paths of Wales, the dustyDiRT Rally features 39 of the most iconic and relevant cars from yesteryear through to modern day, representing the cars that the players want, and the ones that make the most sense for the surfaces they race on. Six rallies with over 70 stages. Head to the muddy paths of Wales, the dusty trails of Greece and the icy tarmac of Monte Carlo. Take on the legendary hillclimb of Pikes Peak, the snowy thrills of Sweden, and the epic scenery of Finland. DiRT Rally has the iconic locations to test your nerve and delight your senses. Race at the Lydden Hill, Holjes and Hell tracks in six of the fastest off-road cars and take on your friends in bumper-to-bumper multiplayer racing. … Expand"}, {"name": "The Witcher: Enhanced Edition", "details_link": "https://www.metacritic.com/game/pc/the-witcher-enhanced-edition", "publisher": "Atari", "release_date": "Sep 16 2008", "developers": ["CD Projekt Red Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/6915b23c228836fc771bd7cf9fa7d35b-98.jpg", "descriptions": "Assume the role of The Witcher, Geralt, a legendary monster slayer caught in a web of intrigue as he battles forces vying for control of the world. Make difficult decisions and live with the consequences in a game that will immerse you in an extraordinary tale like no other. The WitcherAssume the role of The Witcher, Geralt, a legendary monster slayer caught in a web of intrigue as he battles forces vying for control of the world. Make difficult decisions and live with the consequences in a game that will immerse you in an extraordinary tale like no other. The Witcher shatters the line between good and evil in a world where moral ambiguity reigns. The Witcher emphasizes story and character development in a vibrant world while incorporating tactically-deep real-time combat like no game before it. [Atari]… Expand"}, {"name": "Age of Empires II: Definitive Edition", "details_link": "https://www.metacritic.com/game/xbox-series-x/age-of-empires-ii-definitive-edition", "publisher": "Xbox Game Studios", "release_date": "Jan 31 2023", "developers": ["Forgotten Empires LLC"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Command"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/6a1e3dc47557e3ae6263888c867991b0-98.jpg", "descriptions": "Age of Empires II: Definitive Edition celebrates the 20th anniversary of one of the most popular strategy games ever with stunning 4K Ultra HD graphics, a new and fully remastered soundtrack, and brand-new content, \"The Last Khans\" with 3 new campaigns and 4 new civilizations.\r Explore allAge of Empires II: Definitive Edition celebrates the 20th anniversary of one of the most popular strategy games ever with stunning 4K Ultra HD graphics, a new and fully remastered soundtrack, and brand-new content, \"The Last Khans\" with 3 new campaigns and 4 new civilizations.\r Explore all the original campaigns like never before as well as the best-selling expansions, spanning over 200 hours of gameplay and 1,000 years of human history. Head online to challenge other players with 35 different civilizations in your quest for world domination throughout the ages.\r Choose your path to greatness with this definitive remaster to one of the most beloved strategy games of all time.… Expand"}, {"name": "UFC Undisputed 3", "details_link": "https://www.metacritic.com/game/playstation-3/ufc-undisputed-3", "publisher": "THQ", "release_date": "Feb 14 2012", "developers": ["Yuke's"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/d44561dea8ecd5cd8d635bb12138b1b2-98.jpg", "descriptions": "The critically acclaimed and best-selling MMA videogame franchise returns to take players inside the Octagon with UFC Undisputed 3,  delivering intense UFC action focused on brutal toe-to-toe combat, impressive visual presentation and increased accessibility."}, {"name": "Borderlands: The Secret Armory of General Knoxx", "details_link": "https://www.metacritic.com/game/pc/borderlands-the-secret-armory-of-general-knoxx", "publisher": "2K Games", "release_date": "Feb 25 2010", "developers": ["Gearbox Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/ca5ee4ea2cd80b234c11ed6a10b03aa6-98.jpg", "descriptions": "(Downloadable Content)  Borderlands goes to ELEVEN! You may have seen some games raise their level cap by 5, or maybe even 10, but with The Crimson Lance Assassination Squads wreaking havoc and Crawmerax the Invincible being all invulnerable and stuff we knew you'd need more than just 10.(Downloadable Content)  Borderlands goes to ELEVEN! You may have seen some games raise their level cap by 5, or maybe even 10, but with The Crimson Lance Assassination Squads wreaking havoc and Crawmerax the Invincible being all invulnerable and stuff we knew you'd need more than just 10. And that's why Borderlands goes to ELEVEN! The Secret Armory of General Knoxx is an add-on pack for Borderlands that adds new guns, new Class Mods, new vehicles, new missions, new enemy types, and increases the level cap to 61. [Xbox.com]… Expand"}, {"name": "Call of Duty 2", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-2", "publisher": "Activision", "release_date": "Oct 25 2005", "developers": ["Infinity Ward"], "platforms": ["Xbox 360", "PC"], "num_players": "Up to 64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/b97530e0d5f7fd64448746c40cc52de6-98.jpg", "descriptions": "Call of Duty 2 lets players experience four individual soldier stories as they overcome insurmountable odds in multiple campaigns.  Players have the freedom to follow each of the four storylines through for the ultimate character-driven experience, or they can engage in the historic battlesCall of Duty 2 lets players experience four individual soldier stories as they overcome insurmountable odds in multiple campaigns.  Players have the freedom to follow each of the four storylines through for the ultimate character-driven experience, or they can engage in the historic battles chronologically for quick hitting action. Infinity Ward has also expanded the scope of combat to deliver a truly realistic battlefield experience.  Squads now have the freedom to take on a variety of mission objectives, on expansive battlefields that allow for multiple paths and the ability to utilize actual combat tactics like outflanking and fire and maneuver capabilities. Call of Duty 2's new engine and A.I. technology set the stage for authentic squad combat and astonishing action.  Concealment can be key as battlefield smoke or even deployed smoke grenades cloud visibility.  Weather effects such as the dusty sandstorms of North Africa and whiteout blizzard conditions of Russia, for example, will keep soldiers glued to their bunkers.  The team has also employed a state-of-the-art Battle Chatter System that brings the action to life as squad-mates bark out context-sensitive updates in real-time to players through an advanced A.I. system. [Activision]… Expand"}, {"name": "F1 2017", "details_link": "https://www.metacritic.com/game/playstation-4/f1-2017", "publisher": "Codemasters", "release_date": "Aug 25 2017", "developers": ["Codemasters"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/72356e903cf71d84e0afcce79ad8dc8e-98.jpg", "descriptions": "Win the 2017 World Championship, break every record in the fastest ever F1 cars, and race some of the most iconic F1 cars of the last 30 years. The game sports an even deeper ten year Career, more varied gameplay in the new ‘Championships’ mode, and a host of other new features, both onlineWin the 2017 World Championship, break every record in the fastest ever F1 cars, and race some of the most iconic F1 cars of the last 30 years. The game sports an even deeper ten year Career, more varied gameplay in the new ‘Championships’ mode, and a host of other new features, both online and offline.… Expand"}, {"name": "Crash Bandicoot 4: It's About Time", "details_link": "https://www.metacritic.com/game/playstation-5/crash-bandicoot-4-its-about-time", "publisher": "Activision", "release_date": "Mar 12 2021", "developers": ["Toys for Bob"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/5e5503b0e9f7be3a8e951272aae247db-98.jpg", "descriptions": "It's About Time - for a brand-wumping new Crash Bandicoot game! Crash fourward into a time shattered adventure with your favorite marsupials. Neo Cortex and N. Tropy are back at it again and launching an all-out assault on not just this universe, but the entire multiverse! Crash and Coco areIt's About Time - for a brand-wumping new Crash Bandicoot game! Crash fourward into a time shattered adventure with your favorite marsupials. Neo Cortex and N. Tropy are back at it again and launching an all-out assault on not just this universe, but the entire multiverse! Crash and Coco are here to save the day by reuniting the four Quantum Masks and bending the rules of reality. New abilities? Check. More playable characters? Yep. Alternate dimensions? Obviously. Ridonkulous bosses? For sure. Same awesome sauce? You bet your sweet jorts. Wait, are they actually jorts? Not in this universe!… Expand"}, {"name": "Astebreed", "details_link": "https://www.metacritic.com/game/pc/astebreed", "publisher": "Active Gaming Media Inc.", "release_date": "May 30 2014", "developers": ["Edelweiss"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/5e985ef7fc0bb6b802f540b386a847c7-98.jpg", "descriptions": "Climb into the pilot's seat of an otherworldly war machine and take down a genocidal alien race bent on eradicating humanity to preserve their own civilization."}, {"name": "Winning Eleven: Pro Evolution Soccer 2007", "details_link": "https://www.metacritic.com/game/playstation-2/winning-eleven-pro-evolution-soccer-2007", "publisher": "Konami", "release_date": "Feb  6 2007", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 86, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/6/eeafc5ce31e894597ef155f780c87b3a-98.jpg", "descriptions": "Winning Eleven: Pro Evolution Soccer 2007 expands upon the series' realism with faster gameplay, more responsive control and improved artificial intelligence. Players will now make intelligent runs without the ball, identifying opportunities and pointing to where they would like the ball toWinning Eleven: Pro Evolution Soccer 2007 expands upon the series' realism with faster gameplay, more responsive control and improved artificial intelligence. Players will now make intelligent runs without the ball, identifying opportunities and pointing to where they would like the ball to be delivered. Similarly, the game is now more physical, with defenders jockeying for position and strikers working to turn their opponent as they receive the ball. The game's shooting system has also been refined, letting players take more snap shots, while volleys have been updated for more player control. Players can also enjoy the Beautiful Game in more ways than ever before with new play modes. International Challenge mode lets players compete through four continents of opposition to become a champion, while Random Selection Match lets gamers take the field with a group of players selected at random from a predetermined league or geographic area. The Master League mode returns with more options, allowing players to take complete control of their favorite team and control its destiny for an extended period of time. The game's roster of teams is also expanded with new, fully-licensed international teams for players to use including Argentina, Italy, the Netherlands, Spain and Sweden, as well as additional club teams. [Konami]… Expand"}, {"name": "Return to Monkey Island", "details_link": "https://www.metacritic.com/game/pc/return-to-monkey-island", "publisher": "Devolver Digital", "release_date": "Sep 19 2022", "developers": ["Terrible Toybox"], "platforms": ["PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 86, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/cbd5317aba8939766eaac1f285a69a05-98.jpg", "descriptions": "Announcing Return to Monkey Island, the long-awaited follow-up to the legendary Secret of Monkey Island and Monkey Island 2: LeChuck's Revenge by Ron Gilbert's Terrible Toybox in collaboration with Devolver Digital and Lucasfilm Games, coming 2022."}, {"name": "Monster Hunter Rise: Sunbreak", "details_link": "https://www.metacritic.com/game/pc/monster-hunter-rise-sunbreak", "publisher": "Capcom", "release_date": "Jun 30 2022", "developers": ["Capcom"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/4/537c12db520d462b2a689c707f4d909c-98.jpg", "descriptions": "Monster Hunter Rise: Sunbreak is an expansion to the original Monster Hunter Rise. Featuring improved gameplay and nimble-feeling additions to combat mechanics, unique new monsters and hunting locales, and a new difficulty level in the form of Master Rank quests. As the hunter who savedMonster Hunter Rise: Sunbreak is an expansion to the original Monster Hunter Rise. Featuring improved gameplay and nimble-feeling additions to combat mechanics, unique new monsters and hunting locales, and a new difficulty level in the form of Master Rank quests. As the hunter who saved Kamura from calamity, you must now journey to the far-off reaches of Elgado, an outpost near a Kingdom beset by a sinister new nemesis—the elder dragon Malzeno! Kamura Village is finally at peace, having fought off an onslaught of monsters attacks known as the Rampage. That hard-earned peace is disrupted by the unexpected appearance of the wolf-like monster Lunagaron in the Shrine Ruins. In the Shrine Ruins, the hunter meets Fiorayne, a knight of the Royal Order. Fiorayne asks for the hunter's help in investigating why monsters from the Kingdom are becoming violently aggressive and invading other territories, including Kamura. United in mission, they set off for the far-off outpost of Elgado. … Expand"}, {"name": "Sid Meier's Civilization VI", "details_link": "https://www.metacritic.com/game/xbox-one/sid-meiers-civilization-vi", "publisher": "2K Games", "release_date": "Nov 22 2019", "developers": ["Aspyr"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 86, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/92ea4614d1fa4091a00e13295eb8b983-98.jpg", "descriptions": "Civilization VI offers new ways to interact with your world, expand your empire across the map, advance your culture, and compete against historys greatest leaders to build a civilization that will stand the test of time."}, {"name": "NASCAR 2005: Chase for the Cup", "details_link": "https://www.metacritic.com/game/xbox/nascar-2005-chase-for-the-cup", "publisher": "EA Games", "release_date": "Aug 31 2004", "developers": ["EA Tiburon"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 86, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/0d80e68482e01baaa41233f319870ab3-98.jpg", "descriptions": "Do you have what it takes to be a top NASCAR driver? In NASCAR 2005: Chase for the Cup, you can become a superstar owner or driver and decide where, how, and what to drive. During races you can even rattle rivals with the all-new Intimidator button. Push them too far and you might findDo you have what it takes to be a top NASCAR driver? In NASCAR 2005: Chase for the Cup, you can become a superstar owner or driver and decide where, how, and what to drive. During races you can even rattle rivals with the all-new Intimidator button. Push them too far and you might find yourself in a postrace confrontation. Develop essential racing skills, increase fan support, and compete in four racing series to become the driver that top NASCAR teams are looking for.… Expand"}, {"name": "Onimusha: Warlords", "details_link": "https://www.metacritic.com/game/playstation-2/onimusha-warlords", "publisher": "Capcom", "release_date": "Mar 13 2001", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/33816d42da00a86e5c078f9bee8f30fb-98.jpg", "descriptions": "Delivering all the survival horror feel of the classic Capcom \"Resident Evil\" series, Onimusha Warlords pits the player as a the great swordsman Samanosuke Akechi, who must brave hell to save the fair princess after the Inabayma Castle has been overrun by evil demon zombies."}, {"name": "Ground Control", "details_link": "https://www.metacritic.com/game/pc/ground-control", "publisher": "Sierra Entertainment", "release_date": "Jun  1 2000", "developers": ["Massive Entertainment"], "platforms": ["PlayStation 2", "PC"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Tactics"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/b0ad163a5912e953b623b09accf58d2a-98.jpg", "descriptions": "Two political factions have gone to war over a distant world and the secrets it holds in Ground Control, a visually stunning and frenetically paced action/real-time strategy game from Sierra Studios and Massive Entertainment.  [Sierra Studios]"}, {"name": "Cuphead", "details_link": "https://www.metacritic.com/game/xbox-one/cuphead", "publisher": "Studio MDHR", "release_date": "Sep 29 2017", "developers": ["Studio MDHR"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/949b0dac46dda2361d4b615b6b4ee81c-98.jpg", "descriptions": "Cuphead is a classic run and gun action game primarily focused on boss battles. Inspired by the cartoons of the 1930s, the visuals and audio are carefully created with the same techniques of the era, i.e. traditional cel animation (hand drawn & hand inked), watercolor backgrounds, andCuphead is a classic run and gun action game primarily focused on boss battles. Inspired by the cartoons of the 1930s, the visuals and audio are carefully created with the same techniques of the era, i.e. traditional cel animation (hand drawn & hand inked), watercolor backgrounds, and original jazz recordings. Play as Cuphead or Mugman (in single player or co-op) as you traverse strange worlds, acquire new weapons, learn powerful super moves, and discover hidden secrets. [Studio MDHR]… Expand"}, {"name": "Velocity 2X", "details_link": "https://www.metacritic.com/game/playstation-4/velocity-2x", "publisher": "FuturLab", "release_date": "Sep  2 2014", "developers": ["FuturLab"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Shooter", "Scrolling", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 86, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/e4c3f93c1df6ab5fdbf092a4131c4ba8-98.jpg", "descriptions": "Velocity 2X features puzzle-platforming action alongside top-down shoot-'em-up gameplay."}, {"name": "Killer Instinct Season 3", "details_link": "https://www.metacritic.com/game/xbox-one/killer-instinct-season-3", "publisher": "Microsoft Game Studios", "release_date": "Mar 29 2016", "developers": ["Iron Galaxy Studios"], "platforms": "Xbox One", "genres": ["Action", "Fighting", "2D"], "meta_score": 86, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/8a33f73a5fdd0f7651ce635ecea16a1d-98.jpg", "descriptions": "Eight characters are coming to Killer Instinct with the Season 3 update, including Rash (Battletoads), Arbiter (Halo), Kim Wu, and Tusk."}, {"name": "Valkyria Chronicles", "details_link": "https://www.metacritic.com/game/playstation-3/valkyria-chronicles", "publisher": "Sega", "release_date": "Nov  4 2008", "developers": ["Sega"], "platforms": ["PC", "Switch", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Action RPG", "Turn-Based", "General", "General", "Historic", "Tactics"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/ec0610fc7548632b721a532117e1dc41-98.jpg", "descriptions": "Valkyria Chronicles is set in a fictitious continent reminiscent of 1930s Europe, divided in two and ruled by the Empire and the Federation. The Empire has set its sights on invading a small neutral country called Gallia, which is situated in the middle of the two great empires. The gameValkyria Chronicles is set in a fictitious continent reminiscent of 1930s Europe, divided in two and ruled by the Empire and the Federation. The Empire has set its sights on invading a small neutral country called Gallia, which is situated in the middle of the two great empires. The game follows a hero named Welkin and his fellow soldiers of the Federation's 7th Platoon that are fighting against the Empire, who are intent on unifying the continent under its power. The Federation discovers that the Empire possesses a secret weapon, known as the \"Valkyria\" - an ancient race with special powers thought to exist only in legends. With this new discovery, the fate of the Federation's ability to win the war and a hope for a better future hangs in the balance. [Sega]… Expand"}, {"name": "Yakuza: Like a Dragon", "details_link": "https://www.metacritic.com/game/playstation-5/yakuza-like-a-dragon", "publisher": "Sega", "release_date": "Mar  2 2021", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/d374cfaf334eb42013f97954c7e80e7e-98.jpg", "descriptions": "RISE FROM ROCK BOTTOM - Ichiban Kasuga, a low-ranking grunt of a low-ranking yakuza family in Tokyo, faces an 18-year prison sentence after taking the fall for a crime he didn't commit. Never losing faith, he loyally serves his time and returns to society to discover that no one was waitingRISE FROM ROCK BOTTOM - Ichiban Kasuga, a low-ranking grunt of a low-ranking yakuza family in Tokyo, faces an 18-year prison sentence after taking the fall for a crime he didn't commit. Never losing faith, he loyally serves his time and returns to society to discover that no one was waiting for him on the outside, and his clan has been destroyed by the man he respected most.\r Confused and alone, he embarks on a mission to discover the truth behind his family's betrayal and take his life back, becoming an unlikely hero for the city's outcasts on his journey.\r LEVEL UP FROM UNDERDOG TO DRAGON IN DYNAMIC RPG COMBAT\r Experience dynamic RPG combat like none other. Switch between 19 unique Jobs ranging from Bodyguard to Musician, and use the battlefield as your weapon. Take up bats, umbrellas, bikes, street signs, and everything else at your disposal to crack some skulls!\r ENTER THE UNDERWORLD PLAYGROUND\r When you're not busy bashing heads, relax by hitting up the local arcade for some classic SEGA games, compete with locals in a no holds barred go-kart race around Yokohama, complete 50 unique substories, or just take in the scenery of a modern-day Japanese city. There's always something new around the corner.… Expand"}, {"name": "Pillars of Eternity: Complete Edition", "details_link": "https://www.metacritic.com/game/xbox-one/pillars-of-eternity-complete-edition", "publisher": "Paradox Interactive", "release_date": "Aug 29 2017", "developers": ["Obsidian Entertainment", "Paradox Arctic"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/ac8b3d1e730ca3f6ba538b8ab0acf2ef-98.jpg", "descriptions": "Pillars of Eternity, the ultimate role-playing experience on PC, comes to Xbox One! Created by and for role-playing fans by Obsidian Entertainment, masters of the RPG genre, Pillars started as a Kickstarter project, where it shattered all funding goals and pulled in more than 75,000 backers.Pillars of Eternity, the ultimate role-playing experience on PC, comes to Xbox One! Created by and for role-playing fans by Obsidian Entertainment, masters of the RPG genre, Pillars started as a Kickstarter project, where it shattered all funding goals and pulled in more than 75,000 backers. From there, it released to broad critical acclaim, won dozens of awards, and has been a fan favorite on the PC. Now, Paradox Arctic has adapted this unmissable RPG for an entirely new audience on major consoles -- bringing Pillars' fantastical world, tactical combat, and unforgettable story to fans on a whole new platform. Pillars of Eternity: Complete Edition includes all previously released additional content from the PC version, including all DLC and expansions in a single package. But Pillars of Eternity: Complete Edition goes beyond just offering everything together. Paradox Arctic has thoroughly updated the Xbox One version of the award-winning RPG for play with a controller, and have entirely redesigned the UI for easy viewing on televisions. Players will be able to easily navigate the game's detailed character creation, real-time-with-pause combat, and party management from their couches thanks to new TV-friendly menus and controls. Pillars of Eternity: Complete Edition features:  Award-winning writing, story and artwork of Pillars of Eternity, along with the expanded world and content of The White March: Parts I & II  Countless character creation options, from races and classes to character backgrounds which drive your personal story  An epic universe to explore, filled with intriguing party members and companions, a variety of in-game factions, and a lovingly rendered world to traverse  All major updates from the original PC version, including a raised level cap, expanded party AI options, and new difficulty levels  New UI and controls designed from the ground up, presenting the Pillars of Eternity experience like never before… Expand"}, {"name": "Shovel Knight", "details_link": "https://www.metacritic.com/game/xbox-one/shovel-knight", "publisher": "Yacht Club Games", "release_date": "Apr 21 2015", "developers": ["Yacht Club Games"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/90d81af20068e72365ce4951fa69d48a-98.jpg", "descriptions": "Shovel Knight is a sweeping classic action adventure game with awesome gameplay, memorable characters, and an 8-bit retro aesthetic. It's a hot mashup of new and old! You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this land with twoShovel Knight is a sweeping classic action adventure game with awesome gameplay, memorable characters, and an 8-bit retro aesthetic. It's a hot mashup of new and old! You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this land with two goals: to defeat the evil Enchantress and quest for his lost beloved. He wields a Shovel Blade: a multipurpose weapon whose techniques have now been lost to the ages. Always honest and helpful, Shovel Knight is a shining example of the code of Shovelry: Slash Mercilessly and Dig Tirelessly!\r But, between Shovel Knight and his beloved stands a cadre of villainous knights. These terrible foes, known as The Order of No Quarter, have been dispatched to prevent Shovel Knight from reaching the Enchantress, and will pursue their mission at any cost. If you love games with perfect platforming, beautiful art, infectious music, crazy bosses, humor and levity, and real heart... Shovel Knight is for you!… Expand"}, {"name": "The Messenger", "details_link": "https://www.metacritic.com/game/switch/the-messenger", "publisher": "Devolver Digital", "release_date": "Aug 30 2018", "developers": ["Sabotage Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/0699e5b6b4ec177412b51482e424acf6-98.jpg", "descriptions": "As a demon army besieges his village, a young ninja ventures through a cursed world, to deliver a scroll paramount to his clan’s survival. What begins as a classic action platformer soon unravels into an expansive time-traveling adventure full of thrills, surprises, and humor."}, {"name": "Resistance: Fall of Man", "details_link": "https://www.metacritic.com/game/playstation-3/resistance-fall-of-man", "publisher": "SCEA", "release_date": "Nov 14 2006", "developers": ["Insomniac Games"], "platforms": "PlayStation 3", "num_players": "Up to 40 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Modern", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/d7f435a4c9dcc1ea919acc8fa27dbd9a-98.jpg", "descriptions": "In Resistance: Fall of Man, the U.S. and Britain band together in a last-ditch effort to save Europe and Asia from a horrific scourge. In mere decades, the Chimera - a species of unknown origin propagating a virus that converts other life forms into more Chimera - has overrun Russia and allIn Resistance: Fall of Man, the U.S. and Britain band together in a last-ditch effort to save Europe and Asia from a horrific scourge. In mere decades, the Chimera - a species of unknown origin propagating a virus that converts other life forms into more Chimera - has overrun Russia and all of Europe. Humanity’s hope for survival is slim, and the tide of the battle rests on the shoulders of U.S. Army Ranger, Sgt. Nathan Hale. Resistance: Fall of Man draws players into a deep, frightening story that rewrites the 20th century and pits the United States and Britain against a horrific species of unknown origin. In addition to an epic single player campaign, the game features co-op, split screen multiplayer and highly customizable online gameplay. Greater processing power on PlayStation 3 and Blu-ray technology enables more immersive visual and sound effects in Resistance: Fall of Man, heightening the chaos of large-scale warfare. Insomniac Games has combined its passion for creating exotic weapons and vehicles with a proprietary physics system to create a unique human and alien arsenal. [SCEA]… Expand"}, {"name": "Disco Elysium: The Final Cut", "details_link": "https://www.metacritic.com/game/switch/disco-elysium-the-final-cut", "publisher": "ZA/UM", "release_date": "Oct 12 2021", "developers": ["ZA/UM"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Western-Style"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/f3d5c0f22ad8165b2dc17047a38dac55-98.jpg", "descriptions": "Disco Elysium - The Final Cut is the definitive edition of the smash-hit RPG. Pursue your political dreams in new quests, meet and question more of the city's locals, and explore a whole extra area. Full voice-acting, controller support, and expanded language options also included.Get evenDisco Elysium - The Final Cut is the definitive edition of the smash-hit RPG. Pursue your political dreams in new quests, meet and question more of the city's locals, and explore a whole extra area. Full voice-acting, controller support, and expanded language options also included.Get even more out of this award-winning open world. You're a detective with a unique skill system at your disposal and a whole city block to carve your path across. Interrogate unforgettable characters, crack murders, or take bribes. Become a hero or an absolute disaster of a human being.… Expand"}, {"name": "Boom Blox Bash Party", "details_link": "https://www.metacritic.com/game/wii/boom-blox-bash-party", "publisher": "Electronic Arts", "release_date": "May 19 2009", "developers": ["EA LA"], "platforms": "Wii", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/1cdaac6226c01508cee45a593556ba74-98.jpg", "descriptions": "BOOM BLOX  Bash Party is even more fun to play with friends and family, featuring twice as many multiplayer challenges as the original, and now offers team-based challenges! Players can play with or against friends, solo or in teams, knocking down blocks, destroying towers, slinging andBOOM BLOX  Bash Party is even more fun to play with friends and family, featuring twice as many multiplayer challenges as the original, and now offers team-based challenges! Players can play with or against friends, solo or in teams, knocking down blocks, destroying towers, slinging and launching blocks and characters, for tons of high-energy, family-friendly fun! BOOM BLOX Bash Party is packed with tons of new features. The game showcases new block types, including: virus and conveyor blox, new blox shapes, such as: cylinders and wedges, and new tools that make for even more destructive fun. Players find twists on BOOM BLOX game play favorites like throwing and grabbing. Players now can also sling, launch, and blow the competition away with new cannon, paint ball and slingshot tools. Even the characters are in on the action as BOOM BLOX Bash Party features a new cast of wacky blox characters. This time they don’t just cheer you on, they are now blox themselves and you can throw, stack or even launch them, utilizing them to create even more madness and mayhem. The fun continues online as BOOM BLOX Bash Party enables players to download even more new levels via the Internet. With the press of a button, players can grab, play and rate new levels from EA as well as levels created by members of the BOOM BLOX Bash Party community. Using the game's easy-to-use Create Mode, players now have the power to share the levels they built with friends, or submit their masterpiece to be shared with the world! The expanded Create Mode lets players build and create like never before, giving them access to the same tool set the EA development team used to create each and every level in the game. [Electronic Arts]… Expand"}, {"name": "Kentucky Route Zero", "details_link": "https://www.metacritic.com/game/pc/kentucky-route-zero", "publisher": "Cardboard Computer", "release_date": "Feb 22 2013", "developers": ["Cardboard Computer"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 86, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/bf3581741dab4e364c7669d17663e1ed-98.jpg", "descriptions": "Kentucky Route Zero is a magical realistic adventure game about a secret highway in the caves beneath Kentucky, and the mysterious folks who travel it."}, {"name": "Stardew Valley", "details_link": "https://www.metacritic.com/game/playstation-4/stardew-valley", "publisher": "Chucklefish", "release_date": "Dec 13 2016", "developers": ["Sickhead Games", "LLC", "Eric Barone", "Sickhead Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/5162aaf6f3c4f681f96d431e4ec21c96-98.jpg", "descriptions": "You've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation cameYou've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. The community center, once the town's most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness.… Expand"}, {"name": "Rise of the Tomb Raider", "details_link": "https://www.metacritic.com/game/pc/rise-of-the-tomb-raider", "publisher": "Square Enix", "release_date": "Jan 28 2016", "developers": ["Crystal Dynamics", "Nixxes Software"], "platforms": ["Stadia", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/c9059539aa863896bedcb6aa768f3f01-98.jpg", "descriptions": "After uncovering an ancient mystery, Lara Croft embarks on a journey throughout the most treacherous and remote regions of the world to find the secret of immortality. Forming powerful new alliances and relying on her intellect and survival skills, Lara will ultimately embrace her fate asAfter uncovering an ancient mystery, Lara Croft embarks on a journey throughout the most treacherous and remote regions of the world to find the secret of immortality. Forming powerful new alliances and relying on her intellect and survival skills, Lara will ultimately embrace her fate as the Tomb Raider. Featuring epic, high-octane action moments set in the most beautifully hostile environments on earth, Rise of the Tomb Raider delivers a cinematic survival action adventure where you will join Lara Croft on her first tomb raiding expedition and witness the rise of an icon.… Expand"}, {"name": "NBA 2K14", "details_link": "https://www.metacritic.com/game/xbox-one/nba-2k14", "publisher": "2K Sports", "release_date": "Nov 12 2013", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Sim", "Sports", "Traditional", "Team", "Basketball", "Sim"], "meta_score": 86, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/5bfac6b3da8714e9a1c41bbfbdd5830b-98.jpg", "descriptions": "NBA 2K14 promises to raise the bar yet again, providing the best basketball gaming experience for legions of sports fans and gamers around the world."}, {"name": "Persona 4 Golden", "details_link": "https://www.metacritic.com/game/playstation-4/persona-4-golden", "publisher": "Sega", "release_date": "Jan 19 2023", "developers": ["Atlus"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/b0d7cf33151a586eb5703342e9342ab1-98.jpg", "descriptions": "Strange rumors of the Midnight Channel slowly spread through the rural town of Inaba, the protagonist's new home, just as a chain of mysterious murders begin. As the protagonist and his teammates chase after the truth, they find themselves opening the door to another world. \r\rInaba, aStrange rumors of the Midnight Channel slowly spread through the rural town of Inaba, the protagonist's new home, just as a chain of mysterious murders begin. As the protagonist and his teammates chase after the truth, they find themselves opening the door to another world. \r\rInaba, a quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden.\r A coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confronting the darker sides of one's self. \r\rWith an overall Metacritic score of 93 and a multitude of awards, fan-adored Persona 4 Golden stands as one of the finest RPGs ever made, delivering on enthralling storytelling and quintessential Persona gameplay.\r Key Features include:\r * Enjoy gameplay with variable framerates\r* Experience the world of Persona on Xbox in Full HD\r* Achievements \r* Choose between Japanese and English VO… Expand"}, {"name": "Unpacking", "details_link": "https://www.metacritic.com/game/switch/unpacking", "publisher": "Witch Beam", "release_date": "Nov  2 2021", "developers": ["Witch Beam"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 86, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/2752eaad60c19b61682789ebc016be93-98.jpg", "descriptions": "Unpacking is a zen puzzle game about the familiar experience of pulling possessions out of boxes and fitting them into a new home. Part block-fitting puzzle, part home decoration, you are invited to create a satisfying living space while learning clues about the life you’re unpacking."}, {"name": "Total War: WARHAMMER", "details_link": "https://www.metacritic.com/game/pc/total-war-warhammer", "publisher": "SegaSoft", "release_date": "May 24 2016", "developers": ["Creative Assembly"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/bca6c5701d9d7c3291af8bcb90bd6707-98.jpg", "descriptions": "In an era of ceaseless conquest, a myriad warriors clash in epic battles as entire races wage war on one another, each led by a notorious hero seeking dominion over the world. All at your command. The courageous Karl Franz marshals the men of the Empire, looking to unite the fracturedIn an era of ceaseless conquest, a myriad warriors clash in epic battles as entire races wage war on one another, each led by a notorious hero seeking dominion over the world. All at your command. The courageous Karl Franz marshals the men of the Empire, looking to unite the fractured elector counts under a banner of strength against their common foes. Hungry for the vicious brutality of combat, the Greenskins flock to the tribe of Grimgor Ironhide; Orcs and Goblins alike filled with an insatiable thirst for carnage. High King Thorgrim helms the stoic Dwarfs forth from their mountain strongholds, marching to right the serious injustices wrought upon them over the millennia. Yet the motives of the Vampire Counts under Mannfred von Carstein are shrouded in murderous secrecy, his armies raised from the decrepit ranks of the dead. And while the Old World is torn by betrayal, war and the unleashing of unfathomable power, a rising threat still whispers in the winds from the north. The fabric of reality itself begins to rend and buckle.… Expand"}, {"name": "Might & Magic: Clash of Heroes", "details_link": "https://www.metacritic.com/game/ds/might-magic-clash-of-heroes", "publisher": "Ubisoft", "release_date": "Dec  1 2009", "developers": ["Capy Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Role-Playing", "General", "General"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/f55e9ba21207c2d4f022d9632fd33cd1-98.jpg", "descriptions": "Might & Magic Clash of Heroes is the first puzzle adventure RPG game from Ubisoft.It is inspired by the famous Heroes brand and set in the Might & Magic universe. With a manga art direction it has been re-mastered into a glorious 2D environment. As a prequel to Heroes V, 40 years before,Might & Magic Clash of Heroes is the first puzzle adventure RPG game from Ubisoft.It is inspired by the famous Heroes brand and set in the Might & Magic universe. With a manga art direction it has been re-mastered into a glorious 2D environment. As a prequel to Heroes V, 40 years before, Might & Magic Clash of Heroes is set across five different regions of Ashan (a part of the Might & Magic world). Live an exciting adventure as you play 5 different heroes, alternate between exploration in various maps and battle in turn-based puzzle games, in order to accomplish your quest. [Ubisoft]… Expand"}, {"name": "Madden NFL 06", "details_link": "https://www.metacritic.com/game/xbox/madden-nfl-06", "publisher": "EA Sports", "release_date": "Aug  8 2005", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 86, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/af49058319ece773a276366c1a64c165-98.jpg", "descriptions": "With its new modes and enhancements, Madden NFL 06 offers an authentic football experience. Among the game's offensive enhancements are \"QB Vision Control,\" which gives each quarterback a unique field of vision, and \"QB Precision Placement,\" which lets you throw the ballWith its new modes and enhancements, Madden NFL 06 offers an authentic football experience. Among the game's offensive enhancements are \"QB Vision Control,\" which gives each quarterback a unique field of vision, and \"QB Precision Placement,\" which lets you throw the ball more accurately. In the new NFL Superstar mode, you can experience the life of an NFL player by earning one of more than 60 personas ranging from MVP to movie star.… Expand"}, {"name": "F1 2020", "details_link": "https://www.metacritic.com/game/playstation-4/f1-2020", "publisher": "Codemasters", "release_date": "Jul  6 2020", "developers": ["Codemasters"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/a6b5c97bd1982a9bf6de744278b973fe-98.jpg", "descriptions": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode,For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.\r… Expand"}, {"name": "Donkey Kong Country: Tropical Freeze", "details_link": "https://www.metacritic.com/game/switch/donkey-kong-country-tropical-freeze", "publisher": "Nintendo", "release_date": "May  4 2018", "developers": ["Retro Studios"], "platforms": ["Wii U", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/7e2f60080d753a3315b5ae51ad1f949d-98.jpg", "descriptions": "Help Donkey Kong and his friends get back their home from Vikings in the Donkey Kong Country: Tropical Freeze game from Retro Studios. All the challenging ground-pounding, barrel-blasting and mine cart action from the Donkey Kong Country series is back, along with a bushel of new game-playHelp Donkey Kong and his friends get back their home from Vikings in the Donkey Kong Country: Tropical Freeze game from Retro Studios. All the challenging ground-pounding, barrel-blasting and mine cart action from the Donkey Kong Country series is back, along with a bushel of new game-play elements and features.… Expand"}, {"name": "Monster Boy and the Cursed Kingdom", "details_link": "https://www.metacritic.com/game/switch/monster-boy-and-the-cursed-kingdom", "publisher": "Sega", "release_date": "Dec  4 2018", "developers": ["FDG Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/2365740177f853c723d32c70f46608dd-98.jpg", "descriptions": "A legendary game series returns with an all-new adventure and in HD/ Monster Boy is a colorful side-scrolling action adventure created in cooperation with Ryuichi Nishizawa, the creator of the famous Wonder Boy in Monster World series.\r Monster Boy is being created to bring back theA legendary game series returns with an all-new adventure and in HD/ Monster Boy is a colorful side-scrolling action adventure created in cooperation with Ryuichi Nishizawa, the creator of the famous Wonder Boy in Monster World series.\r Monster Boy is being created to bring back the enjoyment of the classic games that shine by simplicity. Exciting gameplay, upbeat music and smooth graphics. You'll need to overcome huge bosses, find hidden passages, discover powerful equipment and use all your wits and skills to remove a powerful curse.\r Transform into 6 different creatures, each with their own skills and abilities. Take advantage of all the unique powers to open new paths and advance in an epic story.\r We put all our passion into Monster Boy to create a truly enjoyable love letter to gaming from the 80's and 90's - will you join us and celebrate together with us?\r Features:\r * Switch between up to 6 playable characters: Each character feels different and all of them keep the gameplay fresh and exciting.\r* Unlock new paths and secrets with special equipment: Look for magic weapons and equipment that gradually open up the world.\r* Over 15 hours of epic adventure: Explore the new 'Monster World' in a huge interconnected environment.\r* Soundtrack from Japanese superstar composers: Yuzo Koshiro, Motoi Sakuraba, Michiru Yamane, Keiki Kobayashi and Takeshi Yanagawa\r* Full HD graphics at 60 frames per second: The game supports 1080p/60fps (docked) and 720p/60fps (portable mode)\r* HD Rumble support: Feel the action with high performance HD Rumble support… Expand"}, {"name": "BlazBlue: Calamity Trigger", "details_link": "https://www.metacritic.com/game/xbox-360/blazblue-calamity-trigger", "publisher": "Aksys Games", "release_date": "Jun 30 2009", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/dbe1167220950d8f9a125ee6f9d178ac-98.jpg", "descriptions": "In the 13th hierarchical city, Kagutsuchi, the Librarium regulates the amazing power of Armagus, a fusion of magic and technology. Currently they are after a wanted criminal named Ragna The Bloodedge, also known as Death, who wants to destroy the Librarium. Due to Ragna possessing a powerfulIn the 13th hierarchical city, Kagutsuchi, the Librarium regulates the amazing power of Armagus, a fusion of magic and technology. Currently they are after a wanted criminal named Ragna The Bloodedge, also known as Death, who wants to destroy the Librarium. Due to Ragna possessing a powerful form of Armagus known as the Azure Grimoire, people far and wide are after not only his bounty, but his grimoire as well. This is where our story begins.\rBlazBlue Key Features: The first hi-res 2D fighter from the creators of the Guilty Gear series! Experience the beauty of high-resoluti on, hand-drawn sprites on 3D backgrounds, all in glorious high-definition. Online Battle Action. Get ready to take the action online and battle the best players from all over the world! Console Exclusive Modes. BlazBlue features the following console-only modes: Arcade, Vs, Practice, and a completely fleshed-out Story Mode that tells the tales of each character. Over 10 unique combatants to choose from! Choose a character that represents your own fighting style, like the lightning-fast Taokaka or the wickedly powerful Tager. Drive your way to victory! Use the unique \"Drive Attacks\" specific to each character to decimate your opponent. Depending on the character, control the elements like wind and ice, or even absorb the life force from your opponents. A plethora of offensive and defensive options at your disposal! Take advantage of Barriers, Counter Assaults, Rapid Cancels, and Distortion Drives to turn the tide of battle! [Akys Games]… Expand"}, {"name": "Resident Evil 5", "details_link": "https://www.metacritic.com/game/pc/resident-evil-5", "publisher": "Capcom", "release_date": "Sep 15 2009", "developers": ["Capcom"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 86, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/0854c465ac69c4aad15afcb657c558e0-98.jpg", "descriptions": "In Resident Evil 5, returning hero Chris Redfield is sent to Africa to investigate a biological weapon that is transforming the populace into aggressive and disturbing creatures. Joined by another local BSAA agent, Sheva Alomar, the two must work together to solve the truth behind theIn Resident Evil 5, returning hero Chris Redfield is sent to Africa to investigate a biological weapon that is transforming the populace into aggressive and disturbing creatures. Joined by another local BSAA agent, Sheva Alomar, the two must work together to solve the truth behind the frightening turn of events. Featuring a revolutionary new co-op mode of gameplay, Resident Evil 5 will let players experience fear together as terror moves out of the shadows and into the light of day. The PC version of Resident Evil 5 features online play for co-operative play sessions over the internet and will also take advantage of NVIDIA’s new GeForce 3D Vision technology (wireless 3D Vision glasses sold separately). [Capcom]… Expand"}, {"name": "Saints Row IV", "details_link": "https://www.metacritic.com/game/pc/saints-row-iv", "publisher": "Deep Silver", "release_date": "Aug 19 2013", "developers": ["Volition Inc."], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/7fccf37162e34d82ec0e6ded925d41b3-98.jpg", "descriptions": "Saints Row IV is an open world game that continues the story of the Third Street Saints by elevating their status to the highest level - the leaders of the free world. After a catastrophic alien invasion occurs where the aliens trasnport the Saints to a bizarro-Steelport simulation, you mustSaints Row IV is an open world game that continues the story of the Third Street Saints by elevating their status to the highest level - the leaders of the free world. After a catastrophic alien invasion occurs where the aliens trasnport the Saints to a bizarro-Steelport simulation, you must fight to free humanity from alien grandaddy Zinyak's mental grasp by ultiziling gargantuan superpowers. Escape the simulation that's trapped the Saints crew, or die trying.… Expand"}, {"name": "Need for Speed: Most Wanted U", "details_link": "https://www.metacritic.com/game/wii-u/need-for-speed-most-wanted-u", "publisher": "Electronic Arts", "release_date": "Mar 19 2013", "developers": ["Criterion Games"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Wii U"], "num_players": "Up to 6 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/431ef725f2331790e17d391704f36cd4-98.jpg", "descriptions": "Need for Speed: Most Wanted is an open world Racing game. The game is the 19th release in the long-running Need for Speed franchise, but hearkens back to the earliest games in the series as players compete in races with police unified against them. Races have a set beginning and end point,Need for Speed: Most Wanted is an open world Racing game. The game is the 19th release in the long-running Need for Speed franchise, but hearkens back to the earliest games in the series as players compete in races with police unified against them. Races have a set beginning and end point, with the open world game design allowing players to complete each using whatever path they can find. Additional features include a unique blend of Simulation and Arcade gameplay, social play options through the Autolog 2 feature, exciting multiplayer support, and a large selection of performance vehicles.… Expand"}]