[
  {
    "name": "NFL 2K2",
    "details_link": "https://www.metacritic.com/game/dreamcast/nfl-2k2",
    "publisher": "Sega",
    "release_date": "Sep 19 2001",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "PlayStation 2",
      "Dreamcast"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/2/512e2704b0c944804e49da876ce8605e-98.jpg",
    "descriptions": "Fans of the NFL 2K series will undoubtedly find that it's hard not to like NFL 2K2."
  },
  {
    "name": "WWF SmackDown! 2: Know Your Role",
    "details_link": "https://www.metacritic.com/game/playstation/wwf-smackdown!-2-know-your-role",
    "publisher": "THQ",
    "release_date": "Nov 21 2000",
    "developers": [
      "Yuke's"
    ],
    "platforms": "PlayStation",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Fighting",
      "Wrestling"
    ],
    "meta_score": 90,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/88606d21f73072005b0e2d892f239225-98.jpg",
    "descriptions": "Prepare for the most outrageous WF experience ever created. Brawl in the ring, backstage, in the VIP room, the parking lot of the new WF New York. Let your fury rage in the new Tornado Tag Team mode. If that's not hardcore enough, pull out the tables, ladders or chairs and really get nasty."
  },
  {
    "name": "LIMBO",
    "details_link": "https://www.metacritic.com/game/xbox-360/limbo",
    "publisher": "PLAYDEAD",
    "release_date": "Jul 21 2010",
    "developers": [
      "PLAYDEAD"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox One",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/6/5d4508b5ff0d2ca46186d6083187fb0e-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Uncertain of his sister's fate, a boy enters LIMBO."
  },
  {
    "name": "Mark of the Ninja",
    "details_link": "https://www.metacritic.com/game/xbox-360/mark-of-the-ninja",
    "publisher": "Microsoft Game Studios",
    "release_date": "Sep  7 2012",
    "developers": [
      "Klei Entertainment"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Adventure",
      "Text",
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/4/eda8ee9ef9a107038363ae7533c2e88d-98.jpg",
    "descriptions": "Mark of the Ninja is a side-scrolling stealth action game from Klei Entertainment that combines fluid 2D animation with intense stealth gameplay."
  },
  {
    "name": "Silent Hunter III",
    "details_link": "https://www.metacritic.com/game/pc/silent-hunter-iii",
    "publisher": "Ubisoft",
    "release_date": "Mar 15 2005",
    "developers": [
      "Ubisoft"
    ],
    "platforms": "PC",
    "num_players": "8  Online",
    "genres": [
      "Simulation",
      "Submarine",
      "Submarine",
      "Marine",
      "Combat"
    ],
    "meta_score": 90,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/5/c980bf619223799550226ab4deaa5d9a-98.jpg",
    "descriptions": "Command the cunning and deadly U-boats of the North Atlantic and experience the tension-filled atmosphere of a WWII submarine movie. The king of submarine simulations returns with an all-new 3D game engine, new crew-command features, and more realistic action than ever before. The gameCommand the cunning and deadly U-boats of the North Atlantic and experience the tension-filled atmosphere of a WWII submarine movie. The king of submarine simulations returns with an all-new 3D game engine, new crew-command features, and more realistic action than ever before. The game includes a career campaign, patrols that have both single and historical missions, a mission editor, and a multiplayer feature. Whether it’s stalking destroyers or hiding from depth charges, players will experience their own personal war story. The spectacular graphics, multiplayer options, and suspenseful gameplay combine to create the most impressive submarine simulation ever. [Ubisoft]… Expand"
  },
  {
    "name": "Bayonetta",
    "details_link": "https://www.metacritic.com/game/pc/bayonetta",
    "publisher": "SegaSoft",
    "release_date": "Apr 11 2017",
    "developers": [
      "PlatinumGames",
      "Nex Entertainment"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "Switch",
      "Wii U",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 90,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/7/ca840c10105b37bfaf75dc7ffd8b9a80-98.jpg",
    "descriptions": "Bayonetta is a cinematic and stylish action game from the creative mind of Hideki Kamiya. As a gun-wielding witch with powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless enemies in a game of 100% pure all-out action. Outlandish finishing moves areBayonetta is a cinematic and stylish action game from the creative mind of Hideki Kamiya. As a gun-wielding witch with powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless enemies in a game of 100% pure all-out action. Outlandish finishing moves are performed with acrobatic grace as Bayonetta flows from one fight to another. Bayonetta pushes the limits of the action genre with magnificent over-the-top action and fast-paced, dynamic climax combat.… Expand"
  },
  {
    "name": "Assassin's Creed: Brotherhood",
    "details_link": "https://www.metacritic.com/game/playstation-3/assassins-creed-brotherhood",
    "publisher": "Ubisoft",
    "release_date": "Nov 16 2010",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action Adventure",
      "Historic",
      "Historic",
      "Open-World"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/2/a97043dc4960e2f4e880b545c1ad4736-98.jpg",
    "descriptions": "The critically acclaimed single-player experience of Assassin's Creed is back and better than ever as Ezio returns in an epic struggle against the powerful Templar Order. Now a legendary Master Assassin, he must journey into Italy's greatest city, Rome, center of power, greed and corruptionThe critically acclaimed single-player experience of Assassin's Creed is back and better than ever as Ezio returns in an epic struggle against the powerful Templar Order. Now a legendary Master Assassin, he must journey into Italy's greatest city, Rome, center of power, greed and corruption to strike at the heart of the enemy. Defeating the corrupt tyrants entrenched there will require not only strength, but leadership, as Ezio commands an entire Brotherhood that will rally to his side. Only by working together can the Assassins defeat their mortal enemies.… Expand"
  },
  {
    "name": "Okami",
    "details_link": "https://www.metacritic.com/game/wii/okami",
    "publisher": "Capcom",
    "release_date": "Apr 15 2008",
    "developers": [
      "Ready at Dawn"
    ],
    "platforms": [
      "PlayStation 2",
      "Wii"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 90,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/3/f2988b543f786a7931c76d6ac53086f8-98.jpg",
    "descriptions": "Okami tells the story of a mythical sun god who sets out to restore a dismal world, decimating the forces of evil who stand in the way by commanding the elements and mythical abilities the deity possesses. Mixing Japanese folklore and a stunning traditional Japanese art style, players mustOkami tells the story of a mythical sun god who sets out to restore a dismal world, decimating the forces of evil who stand in the way by commanding the elements and mythical abilities the deity possesses. Mixing Japanese folklore and a stunning traditional Japanese art style, players must utilize an inventive control scheme to overcome the challenges and evil that await. By enhancing the unique gameplay, visual style and story line of Okami with the control of the Wii Remote, it is sure to be the ultimate version of the game. Originally designed for the PS2 and released in 2006, Okami now comes alive in an entirely new way on the Wii with its visually stunning art style and beautiful scenic 3D levels that have the appearance and texture of paper scrolls brushed with watercolor-like calligraphy art. Throughout the vibrant and distinctive surroundings, players must use the Wii remote to interact with a dynamic world and cast of characters. The blend of stylized graphics, movements and unique gameplay will result in a rich and dynamic experience never seen before. [Capcom]… Expand"
  },
  {
    "name": "Chained Echoes",
    "details_link": "https://www.metacritic.com/game/switch/chained-echoes",
    "publisher": "Deck 13",
    "release_date": "Dec  8 2022",
    "developers": [
      "Matthias Linda"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 90,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/6/8e5792f2f029a013d863d6d3f1860718-98.jpg",
    "descriptions": "Take up your sword, channel your magic or board your Mech. Chained Echoes is a 16-bit SNES style RPG set in a fantasy world where dragons are as common as piloted mechanical suits. Follow a group of heroes as they explore a land filled to the brim with charming characters, fantasticTake up your sword, channel your magic or board your Mech. Chained Echoes is a 16-bit SNES style RPG set in a fantasy world where dragons are as common as piloted mechanical suits. Follow a group of heroes as they explore a land filled to the brim with charming characters, fantastic landscapes and vicious foes.Can you bring peace to a continent where war has been waged for generations and betrayal lurks around every corner?Chained Echoes is a story-driven game where a group of heroes travel around the vast continent of Valandis to bring an end to the war between its three kingdoms. In the course of their journey, they will travel through a wide array of diverse landscapes spanning from wind-tanned plateaus and exotic archipelagos to sunken cities and forgotten dungeons.… Expand"
  },
  {
    "name": "Super Meat Boy",
    "details_link": "https://www.metacritic.com/game/xbox-360/super-meat-boy",
    "publisher": "Team Meat",
    "release_date": "Oct 20 2010",
    "developers": [
      "Team Meat"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Wii U",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/4/a7b7206ae109552ffb57f28edcb76cd1-98.jpg",
    "descriptions": "Super Meat Boy is a tough as nails platformer where you play as an animated cube of meat who's trying to save his girlfriend (who happens to be made of bandages) from an evil fetus in a jar wearing a tux."
  },
  {
    "name": "Grand Theft Auto: Chinatown Wars",
    "details_link": "https://www.metacritic.com/game/psp/grand-theft-auto-chinatown-wars",
    "publisher": "Rockstar Games",
    "release_date": "Oct 20 2009",
    "developers": [
      "Rockstar Leeds"
    ],
    "platforms": [
      "iPhone/iPad",
      "PSP"
    ],
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Open-World"
    ],
    "meta_score": 90,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/6/319e88650f6b1f5ec746930f6bed8632-98.jpg",
    "descriptions": "Grand Theft Auto: Chinatown Wars is an entirely original entry into the critically acclaimed Grand Theft Auto series, and brings a new level of interactivity to its sprawling open environments. Players navigate their way through the streets as they uncover the truth behind an epic tale ofGrand Theft Auto: Chinatown Wars is an entirely original entry into the critically acclaimed Grand Theft Auto series, and brings a new level of interactivity to its sprawling open environments. Players navigate their way through the streets as they uncover the truth behind an epic tale of crime and corruption within the Triad crime syndicate, delivering the unprecedented amount of depth that has become a true trademark of the franchise.… Expand"
  },
  {
    "name": "Dead Space 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/dead-space-2",
    "publisher": "Electronic Arts",
    "release_date": "Jan 25 2011",
    "developers": [
      "Visceral Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/ff3999a4f2c32a82e0c2adb62dbe5e01-98.jpg",
    "descriptions": "Hero Isaac Clarke returns for another heart-pounding adventure, taking the fight to the Necromorphs in this thrilling action-horror experience. New tools to gruesomely slice and dismember the Necromorphs complement Isaac's signature Plasma Cutter, empowering him as he meets new characters,Hero Isaac Clarke returns for another heart-pounding adventure, taking the fight to the Necromorphs in this thrilling action-horror experience. New tools to gruesomely slice and dismember the Necromorphs complement Isaac's signature Plasma Cutter, empowering him as he meets new characters, explores epic Zero-G environments, and fights against a relentless necromorph onslaught.  Survival isn't the only thing on Isaac's mind in Dead Space 2  – this time, he calls the shots. [Electronic Arts]… Expand"
  },
  {
    "name": "Pikmin 2",
    "details_link": "https://www.metacritic.com/game/gamecube/pikmin-2",
    "publisher": "Nintendo",
    "release_date": "Aug 30 2004",
    "developers": [
      "Nintendo"
    ],
    "platforms": "GameCube",
    "num_players": "1-2 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy"
    ],
    "meta_score": 90,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/4/cbaa1f43cfe0a41cfc6d5cb35329f564-98.jpg",
    "descriptions": "Captain Olimar has returned to the planet where the Pikmin live, and he's all business this time.  The company he works for is going bankrupt, so to save it, Olimar must salvage the treasure buried all over the planet.  Of course, he'll need the help of the Pikmin to do that--he can't doCaptain Olimar has returned to the planet where the Pikmin live, and he's all business this time.  The company he works for is going bankrupt, so to save it, Olimar must salvage the treasure buried all over the planet.  Of course, he'll need the help of the Pikmin to do that--he can't do anything by himself.  Control one of two main characters--Olimar or his assistant--as you command your Pikmin to defeat enemies, propagate more Pikmin, collect precious doodads, and solve puzzles.  With unlimited time, new colors of Pikmin, and two-player cooperative play, Pikmin 2 improves on the original in many ways.… Expand"
  },
  {
    "name": "Okami HD",
    "details_link": "https://www.metacritic.com/game/playstation-3/okami-hd",
    "publisher": "Capcom",
    "release_date": "Oct 30 2012",
    "developers": [
      "HexaDrive"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Fantasy",
      "Fantasy",
      "Action Adventure",
      "General"
    ],
    "meta_score": 90,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/3/a55ea03d8b8f15630b60127bf2ad3395-98.jpg",
    "descriptions": "In Okami, the legendary monster Orochi has come back to life and turned the world into a veritable wasteland. Players must assume the role of a wolf, an embodiment of the sun god Amaterasu, which is capable of wielding unimaginable power. The state of the world lies in gamer's hands as theyIn Okami, the legendary monster Orochi has come back to life and turned the world into a veritable wasteland. Players must assume the role of a wolf, an embodiment of the sun god Amaterasu, which is capable of wielding unimaginable power. The state of the world lies in gamer's hands as they must fight ominous beings and reclaim the earth from a curse that plagues it. It is crucial to help Amaterasu make the world a place where all living creatures can dwell once again. [Capcom]… Expand"
  },
  {
    "name": "NBA 2K17",
    "details_link": "https://www.metacritic.com/game/xbox-one/nba-2k17",
    "publisher": "2K Games",
    "release_date": "Sep 16 2016",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One"
    ],
    "genres": [
      "Sports",
      "Team",
      "Basketball",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 5.9,
    "image": "https://static.metacritic.com/images/products/games/6/456c7e872e9d2195a9553a7f2b69231c-98.jpg",
    "descriptions": "NBA 2K17 promises to take the game to new heights and continue to blur the lines between video game and reality."
  },
  {
    "name": "Madden NFL 2002",
    "details_link": "https://www.metacritic.com/game/xbox/madden-nfl-2002",
    "publisher": "EA Sports",
    "release_date": "Oct 29 2001",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/4/be15eca330585910d40eab6e8731bab5-98.jpg",
    "descriptions": "Madden NFL™ 2002 delivers unparalleled heart-felt emotion and hard-hitting NFL action. Taking you beyond broadcast, and on to the field, Madden NFL 2002 puts the NFL at your fingertips in Exhibition, Season, Playoff, Two-Minute Drill, Tournament or Franchise mode. Completely remodeledMadden NFL™ 2002 delivers unparalleled heart-felt emotion and hard-hitting NFL action. Taking you beyond broadcast, and on to the field, Madden NFL 2002 puts the NFL at your fingertips in Exhibition, Season, Playoff, Two-Minute Drill, Tournament or Franchise mode. Completely remodeled player models and facial textures put life in the helmets. From the pre-game introductions with players getting hype in front of the cameras, to one of the 31 Officially licensed members of the NFL Coaches Club displaying disgust after an unexecuted play, Madden NFL 2002 is an emotional roller coaster of dramatic gameplay filled with the passionate imagery of the NFL.… Expand"
  },
  {
    "name": "Grandia II",
    "details_link": "https://www.metacritic.com/game/dreamcast/grandia-ii",
    "publisher": "Ubisoft",
    "release_date": "Dec  6 2000",
    "developers": [
      "Game Arts"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Dreamcast"
    ],
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 90,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/1/da90e84abbff7140262887540bd3edc8-98.jpg",
    "descriptions": "Ryudo has been hired to protect a young priestess who must participate in a ceremony to halt the encroaching rebirth of Valmar, the God of Darkness. Embroiled between the forces of good and evil, Ryudo must follow his destiny and save the people he detests so much."
  },
  {
    "name": "Geometry Wars: Retro Evolved 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/geometry-wars-retro-evolved-2",
    "publisher": "Bizarre Creations",
    "release_date": "Jul 30 2008",
    "developers": [
      "Bizarre Creations"
    ],
    "platforms": "Xbox 360",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Static",
      "Static",
      "Shoot-'Em-Up",
      "Top-Down"
    ],
    "meta_score": 90,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/2/fdfea61faf2a55ce07ea969f49011890-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Experience the adrenaline rush from playing the latest version of the frenetic retro shooter Geometry Wars: Retro Evolved 2. New features include six action-packed gameplay modes, new enemies, new scoring strategies, and a diverse list of exciting achievements. If that's[Xbox Live Arcade]  Experience the adrenaline rush from playing the latest version of the frenetic retro shooter Geometry Wars: Retro Evolved 2. New features include six action-packed gameplay modes, new enemies, new scoring strategies, and a diverse list of exciting achievements. If that's not crazy enough for you, try multiplayer mayhem for up to four players. Use power-ups in versus mode to boost your stats or handicap your opponent, or team up with others in co-op mode. Play it all in razor-sharp 1080p to new pulse-pounding music. Unlock all six of these innovative and challenging modes -- Deadline, Evolved, King, Pacifism, Waves, and Sequence. Achievements: Go for 12 entertaining and inventive ways to boost your gamerscore. Geoms: Collect Geoms to increase your multiplier -- but act fast, they won't last forever! New enemies: Shoot down all the usual suspects, then say \"Hello\" to new enemies that have found additional ways to hunt you down. [Activision]… Expand"
  },
  {
    "name": "Sid Meier's Civilization V",
    "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-v",
    "publisher": "2K Games",
    "release_date": "Sep 21 2010",
    "developers": [
      "Firaxis Games"
    ],
    "platforms": "PC",
    "num_players": "Up to 4 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Historic",
      "Historic",
      "4X"
    ],
    "meta_score": 90,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/5/9f2b3adb38e3d029f63d2f29561b0788-98.jpg",
    "descriptions": "With over nine million units sold worldwide, and unprecedented critical acclaim from fans and press around the world, Sid Meier's Civilization is recognized as one of the greatest strategy franchises of all-time. Now, Firaxis Games will take this incredibly fun and addictive strategy game toWith over nine million units sold worldwide, and unprecedented critical acclaim from fans and press around the world, Sid Meier's Civilization is recognized as one of the greatest strategy franchises of all-time. Now, Firaxis Games will take this incredibly fun and addictive strategy game to unprecedented heights by adding new ways to play and win; new tools to manage and expand your civilization; extensive modding capabilities; and intensely competitive multiplayer options. Civilization V will come to life in a beautifully detailed, living world that will elevate the gameplay experience to a whole new level making it a must-have for gamers around the globe! … Expand"
  },
  {
    "name": "Super Mario 3D Land",
    "details_link": "https://www.metacritic.com/game/3ds/super-mario-3d-land",
    "publisher": "Nintendo",
    "release_date": "Nov 13 2011",
    "developers": [
      "Nintendo"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "3D"
    ],
    "meta_score": 90,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/8/4ae3b5c9d3b857e29fcffecf3f0cbe26-98.jpg",
    "descriptions": "Get Ready for a New Spin on a Familiar Tail. Super Mario 3D Land reinvents everything fans love about Mario gaming with the first platforming environment in true 3D, without the need for special glasses. Players will experience a new sense of depth, distance and speed while running, jumpingGet Ready for a New Spin on a Familiar Tail. Super Mario 3D Land reinvents everything fans love about Mario gaming with the first platforming environment in true 3D, without the need for special glasses. Players will experience a new sense of depth, distance and speed while running, jumping and stomping on enemies throughout the levels. Tanooki Mario returns: The fan-favorite Tanooki suit makes its first appearance on the Nintendo 3DS. Use the Tanooki suit’s tail to attack enemies or float gently down from great heights. These abilities help players move through the 3D environments with more confidence. 3D visuals make it easier for players to judge the depths and distances in their environments. Players can more accurately judge the jump to the next platform or how far Mario is from a question block.  New and familiar abilities add unique game-play strategies to the adventure. Mario can perform a rolling somersault attack or run fast with a dash move. The Circle Pad gives players complete control to confidently move Mario through fun and challenging environments. New enemies include Goombas with tails, tall stacks of Goombas and a Piranha Plant that spits ink to obscure a player’s view. [Nintendo]… Expand"
  },
  {
    "name": "Mario Kart 8 DLC Pack 2",
    "details_link": "https://www.metacritic.com/game/wii-u/mario-kart-8-dlc-pack-2",
    "publisher": "Nintendo",
    "release_date": "Apr 23 2015",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Wii U",
    "genres": [
      "Driving",
      "Kart",
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 90,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/9/fe592dfd46b6e06e9bd9d44890d16d73-98.jpg",
    "descriptions": "Downloadable goodies for MK 8 players."
  },
  {
    "name": "Falcon 4.0: Allied Force",
    "details_link": "https://www.metacritic.com/game/pc/falcon-40-allied-force",
    "publisher": "Graphsim Entertainment",
    "release_date": "Jun 28 2005",
    "developers": [
      "Lead Pursuit"
    ],
    "platforms": "PC",
    "num_players": "16  Online",
    "genres": [
      "Simulation",
      "Flight",
      "Modern Jet",
      "Modern Jet",
      "Combat"
    ],
    "meta_score": 90,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/1023bfa746ba984a15a12799339768bc-98.jpg",
    "descriptions": "Pilot three different variants of the F-16 Fighting Falcon -- the best multi-role fighter ever built -- including Block 40, Block 50/52 and MLU variants. Ultra-high fidelity physics modeling closely simulates actual aircraft performance. Engage the enemy in two operational theaters -- KoreaPilot three different variants of the F-16 Fighting Falcon -- the best multi-role fighter ever built -- including Block 40, Block 50/52 and MLU variants. Ultra-high fidelity physics modeling closely simulates actual aircraft performance. Engage the enemy in two operational theaters -- Korea and the Balkans -- each covering over a million square Kilometers of territory. Dogfight over a wide variety of landscapes: wide seas, open grasslands, dense forests and snow capped mountains. Fly nap-of-earth missions through detailed terrain and undulating valleys. Launch a variety of air-to-air missiles like the AIM-120 AMRAAM and AIM-9 Sidewinder. Deploy a vast array of air-to-ground weaponry including the AGM-65 Maverick, AGM-88 HARM, cluster bombs, slick and high drag bombs and laser guided ordnance. Weapon systems are simulated using the most accurate publicly available specifications. Simulate an entire war with the most advanced dynamic campaign engine ever made for your PC. This remarkable feature presides over tens of thousands of vehicles: air, land and sea. No two missions ever fly the same! [Graphsim]… Expand"
  },
  {
    "name": "The Stanley Parable: Ultra Deluxe",
    "details_link": "https://www.metacritic.com/game/pc/the-stanley-parable-ultra-deluxe",
    "publisher": "Galactic Cafe",
    "release_date": "Apr 27 2022",
    "developers": [
      "Galactic Cafe",
      "Crows Crows Crows"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 90,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/4/3a82fea53ff6106ecc09cc801a45e799-98.jpg",
    "descriptions": "The Stanley Parable: Ultra Deluxe is an expanded re-imagining of 2013's The Stanley Parable. You will play as Stanley, and you will not play as Stanley. You will make a choice, and you will become powerless. You are not here to win. The Stanley Parable is a game that plays you."
  },
  {
    "name": "Deus Ex: Human Revolution",
    "details_link": "https://www.metacritic.com/game/pc/deus-ex-human-revolution",
    "publisher": "Eidos Interactive",
    "release_date": "Aug 23 2011",
    "developers": [
      "Nixxes Software"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "Shooter",
      "Sci-Fi",
      "Sci-Fi",
      "General",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 90,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/7/aead46735c56e6678f8f5d0c93f5dfe0-98.jpg",
    "descriptions": "In Deus Ex: Human Revolution you play Adam Jensen, a security specialist, handpicked to oversee the defense of one of America's most experimental biotechnology firms. But when a black ops team breaks in and kills the scientists you were hired to protect, everything you thought you knew aboutIn Deus Ex: Human Revolution you play Adam Jensen, a security specialist, handpicked to oversee the defense of one of America's most experimental biotechnology firms. But when a black ops team breaks in and kills the scientists you were hired to protect, everything you thought you knew about your job changes. At a time when scientific advancements are routinely turning athletes, soldiers and spies into super-enhanced beings, someone is working very hard to ensure mankind's evolution follows a particular path. You need to discover why - because the decisions you take and the choices you make will be the only things that can determine mankind's future.… Expand"
  },
  {
    "name": "XCOM: Enemy Unknown",
    "details_link": "https://www.metacritic.com/game/xbox-360/xcom-enemy-unknown",
    "publisher": "2K Games",
    "release_date": "Oct  9 2012",
    "developers": [
      "Firaxis Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Xbox 360"
    ],
    "num_players": "2 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General",
      "Sci-Fi",
      "Sci-Fi",
      "General",
      "Tactics"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/9/81703b8c63978670c6fe79860135ad1c-98.jpg",
    "descriptions": "From the makers of the Civilization series comes a game about humanity’s final stand. Threatened by an unknown foe, the Earth’s governments come together to form a stealth paramilitary organization known as XCOM to combat this extraterrestrial assault. At the helm of XCOM, you command theFrom the makers of the Civilization series comes a game about humanity’s final stand. Threatened by an unknown foe, the Earth’s governments come together to form a stealth paramilitary organization known as XCOM to combat this extraterrestrial assault. At the helm of XCOM, you command the global defense team in battle against a frightening alien invasion. Determine the destiny of the human race by building and co-coordinating a fully operational base, researching alien tech, formulating combat missions, and choreographing soldier movement in battle.… Expand"
  },
  {
    "name": "Metroid Prime 3: Corruption",
    "details_link": "https://www.metacritic.com/game/wii/metroid-prime-3-corruption",
    "publisher": "Nintendo",
    "release_date": "Aug 27 2007",
    "developers": [
      "Retro Studios"
    ],
    "platforms": "Wii",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 90,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/7/cb0dcf1992d08fb13ea96a6cdb6b121d-98.jpg",
    "descriptions": "If you think you knew what it felt like to be the bounty hunter behind the visor, think again. Take aim at evil with Nintendo's revolutionary controller. Players control Samus by moving with the Nunchuk controller and aiming with the pointer, allowing for a level of immersion unlike anythingIf you think you knew what it felt like to be the bounty hunter behind the visor, think again. Take aim at evil with Nintendo's revolutionary controller. Players control Samus by moving with the Nunchuk controller and aiming with the pointer, allowing for a level of immersion unlike anything they have ever experienced. Through the eyes of Samus, players experience a quantum leap in first-person control as they wield the Wii Remote, the ultimate device for the first-person shooter genre. Samus employs well-known power-ups like the Grapple Beam and Morph Ball, as well as a bunch of new surprises, to help her survive her coming trials. Saving the planets from Corruption isn't enough, though. Eventually, players must take down Samus' mortal enemy, Dark Samus. [Nintendo]… Expand"
  },
  {
    "name": "Monster Hunter: World",
    "details_link": "https://www.metacritic.com/game/playstation-4/monster-hunter-world",
    "publisher": "Capcom",
    "release_date": "Jan 26 2018",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 90,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/7/0245d66dc92ae7aaf60092cba62f1e7b-98.jpg",
    "descriptions": "In Monster Hunter: World you assume the role of a hunter venturing to a new continent where you track down and slay ferocious beasts in heart-pounding battles. This new land and its diverse inhabitants play a critical role in each quest as you strategically use the surrounding environmentIn Monster Hunter: World you assume the role of a hunter venturing to a new continent where you track down and slay ferocious beasts in heart-pounding battles. This new land and its diverse inhabitants play a critical role in each quest as you strategically use the surrounding environment including terrain, vegetation and wildlife to your advantage in battle or become hindered by the hazards they present. As a hunter, you must use your cunning and expertise to track and maneuver your targets throughout the intense, evolving battles. [Capcom]… Expand"
  },
  {
    "name": "Flight Simulator 2002",
    "details_link": "https://www.metacritic.com/game/pc/flight-simulator-2002",
    "publisher": "Microsoft Game Studios",
    "release_date": "Oct 19 2001",
    "developers": [
      "Microsoft Game Studios"
    ],
    "platforms": "PC",
    "genres": [
      "Simulation",
      "Flight",
      "Civilian Plane",
      "Civilian"
    ],
    "meta_score": 90,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/5/ca3b7fa49447d8d76b0381196e75df21-98.jpg",
    "descriptions": "Includes a wide variety of aircraft for you to fly-from a new Cessna 172S single-engine trainer and a Caravan floatplane to the Boeing 747-400 jumbo jet. You can splash down in a lake, hover in the Bell 206B JetRanger III helicopter, or practice aerobatics in the Extra 300S. [Microsoft]"
  },
  {
    "name": "Banjo-Tooie",
    "details_link": "https://www.metacritic.com/game/nintendo-64/banjo-tooie",
    "publisher": "Nintendo",
    "release_date": "Nov 19 2000",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Nintendo 64",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 90,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/0/d7daa82cc840657b084d0d86440de7c4-98.jpg",
    "descriptions": "Two years after Banjo Kazooie, Banjo and the gang are playing cards when an earthquake happens. Eagerly Mumbo goes out to investigate. He sees two hideous witches reviving Grunty. Mumbo goes back to investigate. Grunty shoots a laser beam at Banjo's house. Mumbo warns everyone but BottlesTwo years after Banjo Kazooie, Banjo and the gang are playing cards when an earthquake happens. Eagerly Mumbo goes out to investigate. He sees two hideous witches reviving Grunty. Mumbo goes back to investigate. Grunty shoots a laser beam at Banjo's house. Mumbo warns everyone but Bottles doesn't belive him. Grunty blows up Banjo's house with Bottles inside and sets off to get her body back. Motivated by revenge Banjo sets out to stop Grunty and revive Bottles.… Expand"
  },
  {
    "name": "Brothers: A Tale of Two Sons",
    "details_link": "https://www.metacritic.com/game/pc/brothers-a-tale-of-two-sons",
    "publisher": "505 Games",
    "release_date": "Sep  3 2013",
    "developers": [
      "Starbreeze"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "PlayStation 4",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Fantasy",
      "Linear"
    ],
    "meta_score": 90,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/0/2a1a74d94043fa627256096385243bb0-98.jpg",
    "descriptions": "Two sons must set out on a perilous journey to bring back the Water of Life to their ailing father."
  },
  {
    "name": "Dota 2",
    "details_link": "https://www.metacritic.com/game/pc/dota-2",
    "publisher": "Valve Software",
    "release_date": "Jul  9 2013",
    "developers": [
      "Valve Software"
    ],
    "platforms": "PC",
    "num_players": "Up to 10 ",
    "genres": [
      "General",
      "Fantasy",
      "MOBA",
      "Strategy",
      "Real-Time",
      "MOBA"
    ],
    "meta_score": 90,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/6/576a743c8c68aaf5c62378e372c5fdf5-98.jpg",
    "descriptions": "Dota 2 features the characters and factions from the original Defense of the Ancients title with new features."
  },
  {
    "name": "World Soccer Winning Eleven 8 International",
    "details_link": "https://www.metacritic.com/game/xbox/world-soccer-winning-eleven-8-international",
    "publisher": "Konami",
    "release_date": "Feb  2 2005",
    "developers": [
      "KCET"
    ],
    "platforms": "Xbox",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Soccer",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/6/c382397ddfa09ab4efd10baef6a8e1fc-98.jpg",
    "descriptions": "Winning Eleven 8 once again raises the bar with in-depth gameplay, improved realism and increased control. The game now features all the teams from the Italian, Spanish and Dutch leagues under the official license. Featuring 136 club teams and 57 national teams, Winning Eleven 8 offersWinning Eleven 8 once again raises the bar with in-depth gameplay, improved realism and increased control. The game now features all the teams from the Italian, Spanish and Dutch leagues under the official license. Featuring 136 club teams and 57 national teams, Winning Eleven 8 offers gamers control of up to 4,500 of the world's greatest soccer players. The game introduces a wealth of new moves and tricks including new free kick and penalty kick techniques, an innovative indirect free kick move and a new dribbling system that offers more control as gamers go one-on-one and try to pass opposing players. Also featured is the first-ever on-screen referee in the history of the series. Boasting an enhanced ref AI, the referee will run up and down the field reacting realistically and instinctively to fouls, giving advantage for minor infringements and even stepping in to calm things down when the action gets heated. Winning Eleven 8 also features improvements to the popular Master League, which now has more strategy through player development and injury, and a new 'My Best Eleven' option so fans can save their greatest teams.… Expand"
  },
  {
    "name": "TimeSplitters 2",
    "details_link": "https://www.metacritic.com/game/playstation-2/timesplitters-2",
    "publisher": "Eidos Interactive",
    "release_date": "Oct  9 2002",
    "developers": [
      "Free Radical Design"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-16 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/6/c2b308dec764ec2e0a591ac9e32678fb-98.jpg",
    "descriptions": "The evil race of TimeSplitters are traveling back into human history authoring events that are leading to the enslavement of mankind. In Control of a motley crew of renegade characters you must hunt down the TimeSplitters across time in historical eras like the gangster- Ridden 1920's, theThe evil race of TimeSplitters are traveling back into human history authoring events that are leading to the enslavement of mankind. In Control of a motley crew of renegade characters you must hunt down the TimeSplitters across time in historical eras like the gangster- Ridden 1920's, the lush jungles of Aztec temples, soviet military installations of the cold war and Futuristic robot factories in space. To end the evil plot of the TimeSplitters, seek and recover the crystals required to seal the rift in time. The Fate of humanity is in your hands. [Eidos Interactive]… Expand"
  },
  {
    "name": "Guild Wars 2",
    "details_link": "https://www.metacritic.com/game/pc/guild-wars-2",
    "publisher": "NCSOFT",
    "release_date": "Aug 28 2012",
    "developers": [
      "ArenaNet"
    ],
    "platforms": "PC",
    "num_players": "Massively Multiplayer",
    "genres": [
      "General",
      "Role-Playing",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Fantasy",
      "Fantasy"
    ],
    "meta_score": 90,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/2/1e138fb6678dee79be52ac9dee97788c-98.jpg",
    "descriptions": "Guild Wars 2 draws from the game mechanics that made the original Guild Wars one of the most popular online games and adds a fully persistent world. Like its predecessors, Guild Wars 2 does not have a subscription fee. Guild Wars Eye of the North provide a Hall of Monuments where players'Guild Wars 2 draws from the game mechanics that made the original Guild Wars one of the most popular online games and adds a fully persistent world. Like its predecessors, Guild Wars 2 does not have a subscription fee. Guild Wars Eye of the North provide a Hall of Monuments where players' accomplishments are memorialized and eventually inherited by their Guild Wars 2 characters, unlocking exclusive items and bonuses in Guild Wars 2. [NCsoft]… Expand"
  },
  {
    "name": "Forza Motorsport 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/forza-motorsport-2",
    "publisher": "Microsoft Game Studios",
    "release_date": "May 29 2007",
    "developers": [
      "Turn 10"
    ],
    "platforms": "Xbox 360",
    "num_players": "8  Online",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "GT / Street",
      "GT / Street",
      "Automobile"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/9/766ef2f90163e059c86a5cb3c695544d-98.jpg",
    "descriptions": "From the all-new world famous Nürburgring Nordschleife and Sebring tracks to the spectator-lined streets of New York City in the New York Circuit, race on meticulously designed tracks with an incredible sense of speed and realism. Forza Motorsport 2 features over 60 tracks carved out of 18From the all-new world famous Nürburgring Nordschleife and Sebring tracks to the spectator-lined streets of New York City in the New York Circuit, race on meticulously designed tracks with an incredible sense of speed and realism. Forza Motorsport 2 features over 60 tracks carved out of 18 environments, including 13 real-world licensed circuits such as Road America, Silverstone, Tsukuba, and Laguna Seca. Four new real-world licensed circuits further expand the world of Forza Motorsport 2. Collect, upgrade, and tune hundreds of cars. From sport compacts to purpose-built race cars, collect more than 300 cars from over 50 of the world’s leading manufacturers including Ferrari, Porsche, Nissan, VW, GM, and Lamborghini. Take your car to the garage and install alternative engines, suspension kits, bolt-on superchargers, brakes, rims, racing slicks, and more. Dial in advanced suspension settings, tire pressure, and gear ratios. Forza Motorsport 2 allows you to own the cars that will own the competition. Create and share your masterpiece with the world. Express your inner artist in the paint and upgrade shops with near endless visual personalization. Customize the shape of your car by combining different licensed rims, performance parts, and aftermarket body kits. Create your own unique paint scheme using millions of paint and decal options. Take in-game pictures of your creation in the Forza Motorsport 2 photo mode. Take your personalized car onto Xbox Live for some intense online wheel-to-wheel racing. Earn in-game credits and even complete single player career objectives while racing over Xbox Live. Watch the best racers from around the world complete on Forza Motorsport 2 TV. [Microsoft]… Expand"
  },
  {
    "name": "Tales From The Borderlands: Episode 5 - The Vault of the Traveler",
    "details_link": "https://www.metacritic.com/game/playstation-4/tales-from-the-borderlands-episode-5---the-vault-of-the-traveler",
    "publisher": "Telltale Games",
    "release_date": "Oct 20 2015",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 90,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/9/6717a741a87ed75b9e7b0a7badf3aed7-98.jpg",
    "descriptions": "In the final episode of the season, all hell is breaking loose. Jack is now in control of Helios' systems, and he is ready to reclaim his rightful place as king of Hyperion - with or without you. It's a mad dash to get out of the chaotic space station alive, as everyone scrambles to grab theIn the final episode of the season, all hell is breaking loose. Jack is now in control of Helios' systems, and he is ready to reclaim his rightful place as king of Hyperion - with or without you. It's a mad dash to get out of the chaotic space station alive, as everyone scrambles to grab the final Gortys piece and high tail it back to Pandora. Can you guide our motley crew through perilous corporate dangers in hopes of getting some copious alien riches? Loyalties will be tested, secrets will be revealed, and explosions will be in large supply in this final chapter of Tales From The Borderlands.… Expand"
  },
  {
    "name": "Pushmo",
    "details_link": "https://www.metacritic.com/game/3ds/pushmo",
    "publisher": "Nintendo",
    "release_date": "Dec  8 2011",
    "developers": [
      "Intelligent Systems"
    ],
    "platforms": "3DS",
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Action"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/8/1ff17522fd8d3d458cf59d2b1cc756ee-98.jpg",
    "descriptions": "(Also known at \"Pullblox\" in the UK/EU)  Pushmo is a puzzle-action game in which you pull and push blocks to create a place to stand so you can jump up and down on your way to a goal. At first glance, some places may look out of reach, but if you use your head, you just may see a way to the goal..."
  },
  {
    "name": "The Witcher 3: Wild Hunt - Hearts of Stone",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-witcher-3-wild-hunt---hearts-of-stone",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Oct 12 2015",
    "developers": [
      "CD Projekt Red Studio"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 90,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/7/6a8d43be84e5a8f4ae645613a2756f60-98.jpg",
    "descriptions": "Hearts of Stone features over ten hours of new adventures and introduces new characters, powerful monsters, unique romance, and an entirely new storyline shaped by gamer choices. The expansion also introduces a new system of Runewords that significantly affects gameplay. Each RunewordHearts of Stone features over ten hours of new adventures and introduces new characters, powerful monsters, unique romance, and an entirely new storyline shaped by gamer choices. The expansion also introduces a new system of Runewords that significantly affects gameplay. Each Runeword impacts a different aspect of in-game mechanics and allows the players to experiment with various strategies and tactics. [CD Projekt]… Expand"
  },
  {
    "name": "Metal Gear Solid HD Collection",
    "details_link": "https://www.metacritic.com/game/xbox-360/metal-gear-solid-hd-collection",
    "publisher": "Konami",
    "release_date": "Nov  8 2011",
    "developers": [
      "Genki",
      "Bluepoint Games"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 6 ",
    "genres": [
      "Miscellaneous",
      "Compilation",
      "Compilation"
    ],
    "meta_score": 90,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/7/df4d1f58afef46496544ea9930dd242b-98.jpg",
    "descriptions": "Metal Gear Solid HD Collection bundles Metal Gear Solid 2: Sons of Liberty, Metal Gear Solid 3: Snake Eater and Metal Gear Solid: Peace Walker and updates them with HD visuals."
  },
  {
    "name": "Viewtiful Joe",
    "details_link": "https://www.metacritic.com/game/playstation-2/viewtiful-joe",
    "publisher": "Capcom",
    "release_date": "Aug 24 2004",
    "developers": [
      "Clover Studio"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/3/00257b4345580bb9401dcb9c40bb748b-98.jpg",
    "descriptions": "Welcome to the world of Viewtiful Joe! Capcom's innovative super hero action game that mixes funky cartoon-style visuals with classic side-scrolling gameplay and introduces the world?s quirkiest million dollar action hero... Joe! More than just any ordinary dude, Joe must transform into theWelcome to the world of Viewtiful Joe! Capcom's innovative super hero action game that mixes funky cartoon-style visuals with classic side-scrolling gameplay and introduces the world?s quirkiest million dollar action hero... Joe! More than just any ordinary dude, Joe must transform into the ultimate superhero. It?s up to you to activate the correct view mode like \"Slow\" or \"Zoom In\" in order to clobber your enemies with beautiful style! You can also speed up or slow down your visual effects for even more \"viewtiful\" moves. Viewtiful Joe redefines action games by mixing innovative \"viewpoint\" fighting into amazing cartoon meets noir environments. [Capcom]… Expand"
  },
  {
    "name": "Madden NFL 2005",
    "details_link": "https://www.metacritic.com/game/gamecube/madden-nfl-2005",
    "publisher": "EA Sports",
    "release_date": "Aug  9 2004",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/5/7f609bc9510941bae029d0d395915353-98.jpg",
    "descriptions": "Madden NFL 2005 introduces the Hit Stick, a new feature that lets players turn a game around with a crucial tackle. Along with all-new defensive preplay controls and defensive artificial intelligence enhancements, the defense now has a diverse arsenal of weapons available. Also, the depth ofMadden NFL 2005 introduces the Hit Stick, a new feature that lets players turn a game around with a crucial tackle. Along with all-new defensive preplay controls and defensive artificial intelligence enhancements, the defense now has a diverse arsenal of weapons available. Also, the depth of Franchise mode grows with the addition of Storyline Central, a weekly radio talk show that discusses current stories regarding your team and the league. With even more Franchise mode additions, hundreds of new animations, and the new Create-a-Fan feature, Madden NFL 2005 takes the series to the next level.… Expand"
  },
  {
    "name": "Tiger Woods PGA Tour 2003",
    "details_link": "https://www.metacritic.com/game/gamecube/tiger-woods-pga-tour-2003",
    "publisher": "Electronic Arts",
    "release_date": "Oct 27 2002",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Golf",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/7/9b6584a276390d83b322201239045cda-98.jpg",
    "descriptions": "From towering drives to picture-perfect putts, the essence of golf has been captured in Tiger Woods PGA Tour 2003.  The game features plenty of challenging courses such as Pebble Beach Golf Links and Royal Birkdale.  Plus, you can choose from a variety of professional golfers, each withFrom towering drives to picture-perfect putts, the essence of golf has been captured in Tiger Woods PGA Tour 2003.  The game features plenty of challenging courses such as Pebble Beach Golf Links and Royal Birkdale.  Plus, you can choose from a variety of professional golfers, each with their own strengths and weaknesses.  Hit the course as Tiger Woods or put your skills up against his in a one-on-one showdown, but either way, be prepared to bring your best game.  … Expand"
  },
  {
    "name": "Freedom Force",
    "details_link": "https://www.metacritic.com/game/pc/freedom-force",
    "publisher": "Crave",
    "release_date": "Mar 24 2002",
    "developers": [
      "Irrational Games"
    ],
    "platforms": "PC",
    "num_players": "1-4 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 90,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/2/489cb3d65cf9cafe13fd36c34d1ac2fb-98.jpg",
    "descriptions": "From a distant corner of the galaxy, an evil alien race sets in motion a sinister plan to conquer the Earth. They unleash a powerful catalyst - Energy X - that imbues the planet's worst miscreants with super-powers to bring the planet to its knees. Now Earth's only hope lies with a new breedFrom a distant corner of the galaxy, an evil alien race sets in motion a sinister plan to conquer the Earth. They unleash a powerful catalyst - Energy X - that imbues the planet's worst miscreants with super-powers to bring the planet to its knees. Now Earth's only hope lies with a new breed of heroes... The Freedom Force! Command a squad of comic book heroes in the defense of Patriot City. Choose from over a dozen heroes or create your own comic champions. Fight for freedom in over 20 action-packed missions. Restore order in a completely interactive 3D world. Take your heroes online and join the fight in multiplayer mode. [Electronic Arts]… Expand"
  },
  {
    "name": "NBA 2K2",
    "details_link": "https://www.metacritic.com/game/xbox/nba-2k2",
    "publisher": "Sega",
    "release_date": "Feb 27 2002",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/8/4571181c6fd43a55519e7177d2b7eaec-98.jpg",
    "descriptions": "Sega Sports unleashes its award-winning NBA franchise on the next-generation basketball court with NBA 2K2. Building upon a foundation of vibrant graphics and crisp, detailed player animation, NBA 2K2 talks the talk and walks the walk! Use the versatile low post game to drop step around yourSega Sports unleashes its award-winning NBA franchise on the next-generation basketball court with NBA 2K2. Building upon a foundation of vibrant graphics and crisp, detailed player animation, NBA 2K2 talks the talk and walks the walk! Use the versatile low post game to drop step around your defender and explode past him for a posterizing dunk. Tight AI defenders take away the baseline, deftly rotate to the open man, and establish rebounding position in the paint. Sharper skills and smarter D elevate your game to a higher level and make NBA 2K2 the one to beat on the Xbox™ game consoles.… Expand"
  },
  {
    "name": "Colin McRae Rally 2.0",
    "details_link": "https://www.metacritic.com/game/playstation/colin-mcrae-rally-20",
    "publisher": "Codemasters",
    "release_date": "Dec  5 2000",
    "developers": [
      "Codemasters"
    ],
    "platforms": [
      "PC",
      "PlayStation"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "Rally / Offroad"
    ],
    "meta_score": 90,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/7/25653293f9cd8c2bf3d18a65ea086952-98.jpg",
    "descriptions": "Colin McRae Rally 2.0 represents one of the most solidly addictive racing experiences that money can buy."
  },
  {
    "name": "FIFA Soccer 13",
    "details_link": "https://www.metacritic.com/game/xbox-360/fifa-soccer-13",
    "publisher": "EA Sports",
    "release_date": "Sep 25 2012",
    "developers": [
      "Electronic Arts"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "PlayStation Vita",
      "Wii U",
      "Xbox 360"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/9/b5748bce36ea673ebe7d41827733ee3a-98.jpg",
    "descriptions": "The way players control the ball has been transformed, eliminating near-perfect touch for every player on the pitch, and creating more opportunities for defenders to win back possession. Poor passes are harder to control, enabling defenders to capitalize on errant balls and poor touches.The way players control the ball has been transformed, eliminating near-perfect touch for every player on the pitch, and creating more opportunities for defenders to win back possession. Poor passes are harder to control, enabling defenders to capitalize on errant balls and poor touches. Factors such as defensive pressure, trajectory of the ball, and velocity of the pass all factor into a player’s success.… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 1 + 2",
    "details_link": "https://www.metacritic.com/game/playstation-5/tony-hawks-pro-skater-1-+-2",
    "publisher": "Activision",
    "release_date": "Mar 26 2021",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Sports",
      "Individual",
      "Skate / Skateboard"
    ],
    "meta_score": 90,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/2/e3a81e9605fbb91df122277b8ba7c976-98.jpg",
    "descriptions": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.\rSkate in super crispDrop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.\rSkate in super crisp 120 FPS at 1080P or 60 FPS in native 4K. Watch the levels come to life using sharper dynamic shadows, reflections, and lens flare, plus enhanced skater textures. The PS5 enhancements don’t stop at audio and visual upgrades, either. Major features include:\r 120 FPS @1080p\r  Native 4k @60FPS\r  SSD & Immediacy\r  Haptic feedback via the DualSense wireless controller\r  Spatialized Audio\r  High Fidelity Atmospherics\r  Activities and Game Help\r  Cross-Gen Progression… Expand"
  },
  {
    "name": "Into the Breach",
    "details_link": "https://www.metacritic.com/game/pc/into-the-breach",
    "publisher": "Subset Games",
    "release_date": "Feb 27 2018",
    "developers": [
      "Subset Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "Stadia",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General",
      "Tactics"
    ],
    "meta_score": 90,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/6/baf3e9c18cf0c657a299ac5b665c7ff4-98.jpg",
    "descriptions": "Control powerful mechs from the future to defeat an alien threat. Each attempt to save the world presents a new randomly generated challenge in this turn-based strategy game."
  },
  {
    "name": "Chicory: A Colorful Tale",
    "details_link": "https://www.metacritic.com/game/pc/chicory-a-colorful-tale",
    "publisher": "Greg Lobanov",
    "release_date": "Jun 10 2021",
    "developers": [
      "Greg Lobanov"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 90,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/0/2ef4d63585e272320f62bd5b349f9922-98.jpg",
    "descriptions": "Something terrible happened. Chicory, superstar artist and wielder of the Brush, is missing, and all the color in the land vanished with her. It's up to you, Chicory's number one fan, to pick up the Brush and fill in for her. It's a big job but you're ready for it! Probably! Chicory: ASomething terrible happened. Chicory, superstar artist and wielder of the Brush, is missing, and all the color in the land vanished with her. It's up to you, Chicory's number one fan, to pick up the Brush and fill in for her. It's a big job but you're ready for it! Probably! Chicory: A Colorful Tale is a top-down adventure game in a coloring book world where you can draw on anything. Use your painting powers to explore new places, solve puzzles, help your friends, and change the world!… Expand"
  },
  {
    "name": "LIMBO",
    "details_link": "https://www.metacritic.com/game/playstation-3/limbo",
    "publisher": "PLAYDEAD",
    "release_date": "Jul 19 2011",
    "developers": [
      "PLAYDEAD"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "PlayStation 3"
    ],
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/5/21c3b59007fce38d8cfa62680d3188cc-98.jpg",
    "descriptions": "LIMBO, a black and white puzzle-platforming adventure, puts players in the role of a young boy traveling through an eerie and treacherous world in an attempt to discover the fate of his sister."
  },
  {
    "name": "GTR 2",
    "details_link": "https://www.metacritic.com/game/pc/gtr-2",
    "publisher": "10tacle Studios",
    "release_date": "Sep 29 2006",
    "developers": [
      "SimBin"
    ],
    "platforms": "PC",
    "num_players": "24  Online",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "GT / Street",
      "GT / Street",
      "Automobile"
    ],
    "meta_score": 90,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/7/4a7f9ae805d583d736ed76ec1e7f8631-98.jpg",
    "descriptions": "Extending the ground-breaking physics engine found in GTR, GTR 2 takes the thrill of driving to new heights. GTR 2, which is the official simulation of the FIA GT championship, features more than 140 high detailed cars and 34 different track-layouts in a hyper realistic racing world withExtending the ground-breaking physics engine found in GTR, GTR 2 takes the thrill of driving to new heights. GTR 2, which is the official simulation of the FIA GT championship, features more than 140 high detailed cars and 34 different track-layouts in a hyper realistic racing world with breathtaking real-world-like effects. With a revolutionary Driving School Mode, GTR 2 will teach everybody how to become a real race driver. [10Tacle Studios]… Expand"
  },
  {
    "name": "Sekiro: Shadows Die Twice",
    "details_link": "https://www.metacritic.com/game/playstation-4/sekiro-shadows-die-twice",
    "publisher": "Activision",
    "release_date": "Mar 22 2019",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PC",
      "Stadia",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 90,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/6/a03dc14041cf90fe791985271f5e059b-98.jpg",
    "descriptions": "Your death won’t come easily. Enter the world of late 1500s Sengoku Japan; a brutal, bloody period of constant life-and-death conflict. As tensions rise, a compelling new story unfolds amongst the chaos. Introducing Sekiro: Shadows Die Twice, a dark and twisted new gameplay experienceYour death won’t come easily. Enter the world of late 1500s Sengoku Japan; a brutal, bloody period of constant life-and-death conflict. As tensions rise, a compelling new story unfolds amongst the chaos. Introducing Sekiro: Shadows Die Twice, a dark and twisted new gameplay experience developed by the renowned team at FromSoftware and published by Activision. Directed by Hidetaka Miyazaki, Sekiro: Shadows Die Twice is a third-person, action-adventure game with RPG elements. The single-player game puts players in the protagonist role of a hard-hearted warrior whose mission is to rescue his master, a young lord, and exact revenge on his arch nemesis. As “Sekiro,” or the “one-armed wolf,” players discover the many ways to strategically approach combat and engage enemies. [Activision]… Expand"
  },
  {
    "name": "Yakuza 0",
    "details_link": "https://www.metacritic.com/game/xbox-one/yakuza-0",
    "publisher": "SegaSoft",
    "release_date": "Feb 26 2020",
    "developers": [
      "Ryu ga Gotoku Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 90,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/6/1b26b8df9dcfdf60c6f51c4f8216404d-98.jpg",
    "descriptions": "Tokyo 1988. Getting rich is easy, the women are beautiful, and everyone wants in on the action. It's time to become Yakuza.The glitz, glamour, and unbridled decadence of the 80s are back in Yakuza 0!\n \nFight like hell through Tokyo and Osaka with protagonist Kazuma Kiryu and series regularTokyo 1988. Getting rich is easy, the women are beautiful, and everyone wants in on the action. It's time to become Yakuza.The glitz, glamour, and unbridled decadence of the 80s are back in Yakuza 0! Fight like hell through Tokyo and Osaka with protagonist Kazuma Kiryu and series regular Goro Majima. Play as Kazuma Kiryu and discover how he finds himself in a world of trouble when a simple debt collection goes wrong and his mark winds up murdered. Then, step into the silver-toed shoes of Goro Majima and explore his \"normal\" life as the proprietor of a cabaret club.Switch between three different fighting styles instantaneously and beat up all manner of goons, thugs, hoodlums, and lowlifes. Take combat up a notch by using environmental objects such as bicycles, sign posts, and car doors for bone-crunching combos and savage take-downs.Fighting is not the only way to kill time in 1988's Japan: from discos and hostess clubs to classic SEGA arcades, there are tons of distractions to pursue in the richly detailed, neon-lit world.Interact with the colourful denizens the red light district: help a budding S&M dominatrix learn her profession, or ensure a street performer can make it to the bathroom in time there are 100 incredible stories to discover.… Expand"
  },
  {
    "name": "NBA 2K13",
    "details_link": "https://www.metacritic.com/game/playstation-3/nba-2k13",
    "publisher": "2K Sports",
    "release_date": "Oct  2 2012",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Wii U",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Basketball",
      "Sim",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/6cdcf7935b15e4f593e296b4ac237f0e-98.jpg",
    "descriptions": "For the first time ever, all dribble moves have been mapped to the right analog stick, as well as shooting, passing, and post moves. String together devastating crossovers and clutch shots for maximum control and effectiveness. Shots are now dynamically created on the fly, with all-newFor the first time ever, all dribble moves have been mapped to the right analog stick, as well as shooting, passing, and post moves. String together devastating crossovers and clutch shots for maximum control and effectiveness. Shots are now dynamically created on the fly, with all-new collision physics created in real-time. Each player has individualized abilities that can alter the course of a game.  Players are modeled to impact the game in their own unique way, from Derrick Rose as a “Floor General” to Kevin Durant being “The Closer.”  Learn to use each player’s unique ability and change the game on your terms. Improved fast break passing gives players more control. Fire a bounce pass to a cutting teammate or go “Lob City” in transition.… Expand"
  },
  {
    "name": "Grand Theft Auto IV",
    "details_link": "https://www.metacritic.com/game/pc/grand-theft-auto-iv",
    "publisher": "Rockstar Games",
    "release_date": "Dec  2 2008",
    "developers": [
      "Rockstar Toronto"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Open-World"
    ],
    "meta_score": 90,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/4/24f6186b3855a7e399ec53927b02e19f-98.jpg",
    "descriptions": "(Also known as \"GTA IV\")  What does the American Dream mean today? For Niko Belic, fresh off the boat from Europe. It's the hope he can escape his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City, gateway to the land of opportunity. As they(Also known as \"GTA IV\")  What does the American Dream mean today? For Niko Belic, fresh off the boat from Europe. It's the hope he can escape his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City, gateway to the land of opportunity. As they slip into debt and are dragged into a criminal underworld by a series of shysters, thieves and sociopaths, they discover that the reality is very different from the dream in a city that worships money and status, and is heaven for those who have them an a living nightmare for those who don't. The PC version features an \"expanded\" multiplayer mode. [Rockstar Games]… Expand"
  },
  {
    "name": "Total War: Shogun 2",
    "details_link": "https://www.metacritic.com/game/pc/total-war-shogun-2",
    "publisher": "Sega",
    "release_date": "Mar 15 2011",
    "developers": [
      "Creative Assembly"
    ],
    "platforms": "PC",
    "num_players": "Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Historic",
      "General",
      "Historic"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/9/ff7021fc576aea5718c9bd1c1cc9796d-98.jpg",
    "descriptions": "Shogun 2 is the ultimate refinement of the original formula with a new, cutting-edge AI, more polish and online functionality than ever before. The result is the perfect mix of real-time and turn-based strategy gaming that invites both veterans of Total War and new players to experience theShogun 2 is the ultimate refinement of the original formula with a new, cutting-edge AI, more polish and online functionality than ever before. The result is the perfect mix of real-time and turn-based strategy gaming that invites both veterans of Total War and new players to experience the enjoyment and depth of the series.… Expand"
  },
  {
    "name": "Empire: Total War",
    "details_link": "https://www.metacritic.com/game/pc/empire-total-war",
    "publisher": "Sega",
    "release_date": "Mar  3 2009",
    "developers": [
      "Creative Assembly"
    ],
    "platforms": "PC",
    "num_players": "Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "General",
      "Historic"
    ],
    "meta_score": 90,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/4/a64e984acd2bb92f4ea95747fba08bd3-98.jpg",
    "descriptions": "Empire: Total War is set in the 18th century, a turbulent era that is the most requested by Total War’s loyal fan base and a period alive with global conflict, revolutionary fervour and technological advances. The game features themes such as the Industrial Revolution, America's struggle forEmpire: Total War is set in the 18th century, a turbulent era that is the most requested by Total War’s loyal fan base and a period alive with global conflict, revolutionary fervour and technological advances. The game features themes such as the Industrial Revolution, America's struggle for independence, the race to control Eastern trade routes and the globalisation of war on land and sea. Empire: Total War sees the debut of 3D naval combat within the Total War franchise. PC Gamers intuitively command vast fleets or single ships upon seascapes rich with extraordinary water and weather effects that play a huge role in your eventual glorious success or ignominious defeat. After pummelling your enemy with cannon fire, close in to grapple their ship and prepare to board taking control your men as they fight hand to hand on the decks. Empire: Total War also sees further enhancements to the Total War series signature 3D battles and turn based campaign map. Real time battles pose new challenges with the addition of cannon and musket, challenging players to master new formations and tactics as a result of the increasing role of gunpowder within warfare. And the Campaign Map – for many the heart of Total War – will see new improved systems for Trade, Diplomacy and Espionage with agents, a refined and streamlined UI, improved Advisors and extended scope taking in the riches of India, the turbulence of Europe and the untapped potential of North America. [Sega]… Expand"
  },
  {
    "name": "Mass Effect Legendary Edition",
    "details_link": "https://www.metacritic.com/game/xbox-one/mass-effect-legendary-edition",
    "publisher": "Electronic Arts",
    "release_date": "May 14 2021",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 90,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/5/5003fedde2ea2c2a491cec55b9d6e2f0-98.jpg",
    "descriptions": "For many months now, our team at BioWare has been hard at work updating the textures, shaders, models, effects and technical features of three enormous games. Our goal was not to remake or reimagine the original games, but to modernize the experience so that fans and new players canFor many months now, our team at BioWare has been hard at work updating the textures, shaders, models, effects and technical features of three enormous games. Our goal was not to remake or reimagine the original games, but to modernize the experience so that fans and new players can experience the original work in its best possible form. It's been amazing to see the adventures of Commander Shepard take on new life in super-sharp resolution, faster framerates, and beautiful visual enhancements. Mass Effect Legendary Edition will include single-player base content and DLC from Mass Effect, Mass Effect 2, and Mass Effect 3, plus promo weapons, armors, and packs - all remastered and optimized for 4k Ultra HD. It will be available in Spring 2021 for Xbox One, PlayStation 4, and PC, with forward compatibility and targeted enhancements on Xbox Series X and PlayStation 5.… Expand"
  },
  {
    "name": "Rayman Legends",
    "details_link": "https://www.metacritic.com/game/xbox-360/rayman-legends",
    "publisher": "Ubisoft",
    "release_date": "Sep  3 2013",
    "developers": [
      "Ubisoft Montpellier"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Stadia",
      "Wii U",
      "Xbox One",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/8/282cefcc412fa35572e48724ed0667cd-98.jpg",
    "descriptions": "Rayman Legends is the follow-up to last year's Rayman Origins and aims to bring multiplayer interactions for you to use. The Glade of Dreams is in trouble again. During a 100-year nap, the nightmares multiplied and spread, creating new monsters even scarier than before. These creatures areRayman Legends is the follow-up to last year's Rayman Origins and aims to bring multiplayer interactions for you to use. The Glade of Dreams is in trouble again. During a 100-year nap, the nightmares multiplied and spread, creating new monsters even scarier than before. These creatures are the stuff of legend… Dragons, giant toads, sea monsters, and even evil luchadores. With the help of Murfy, Rayman and Globox awake and must now help fight these nightmares and save the Teensies.… Expand"
  },
  {
    "name": "The Legend of Heroes: Trails from Zero",
    "details_link": "https://www.metacritic.com/game/pc/the-legend-of-heroes-trails-from-zero",
    "publisher": "NIS America",
    "release_date": "Sep 27 2022",
    "developers": [
      "Falcom"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 90,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/2/55928752f23a6c9461350ec12370bb9e-98.jpg",
    "descriptions": "The Crossbell State, located in western Zemlya--Once the site of fierce territorial battles, it has since developed into one of the continent's leading trade and financial centers.\n\nHowever, pressure from the Erebonian Empire and the Calvard Republic is steadily increasing. While corruptThe Crossbell State, located in western Zemlya--Once the site of fierce territorial battles, it has since developed into one of the continent's leading trade and financial centers.However, pressure from the Erebonian Empire and the Calvard Republic is steadily increasing. While corrupt officials from both sides remain locked in political disputes, the mafia and underground criminal organizations are preparing to start a war.In the midst of all this chaos, the Crossbell Police Department has lost the trust of its people.Among them are Lloyd Bannings, a rookie agent,Elie MacDowell, granddaughter of Crossbell's mayor,Tio Plato, a young sorcereress who wields an orbal staff,and Randy Orlando, a former security guard.The foursome are assigned to a new department, the Special Support Section, where they are left with no choice but to join forces in the face of adversity.This is a story about four unlikely heroes fighting to overcome the walls defining their way of life.… Expand"
  },
  {
    "name": "Chicory: A Colorful Tale",
    "details_link": "https://www.metacritic.com/game/switch/chicory-a-colorful-tale",
    "publisher": "Finji",
    "release_date": "Dec 15 2021",
    "developers": [
      "Team Chicory"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 90,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/0/6c98d35955514b68b58b507181eafef9-98.jpg",
    "descriptions": "Something terrible happened. Chicory, superstar artist and wielder of the Brush, is missing, and all the color in the land vanished with her. It's up to you, Chicory's number one fan, to pick up the Brush and fill in for her. It's a big job but you're ready for it! Probably!Chicory: ASomething terrible happened. Chicory, superstar artist and wielder of the Brush, is missing, and all the color in the land vanished with her. It's up to you, Chicory's number one fan, to pick up the Brush and fill in for her. It's a big job but you're ready for it! Probably!Chicory: A Colorful Tale is a top-down adventure game in a coloring book world where you can draw on anything. Use your painting powers to explore new places, solve puzzles, help your friends, and change the world!… Expand"
  },
  {
    "name": "Final Fantasy XIV: Endwalker",
    "details_link": "https://www.metacritic.com/game/playstation-5/final-fantasy-xiv-endwalker",
    "publisher": "Square Enix",
    "release_date": "Dec  7 2021",
    "developers": [
      "Square Enix"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5"
    ],
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Massively Multiplayer"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/7/e8159d7deef2e0ad60132484fa4f7bec-98.jpg",
    "descriptions": "Endwalker is the fourth expansion pack for FINAL FANTASY XIV Online. Experience the climax of the Hydaelyn and Zodiark story, and encounter an even greater calamity than ever before as you travel to the far reaches of Hydaelyn and even to the moon."
  },
  {
    "name": "Astro Bot: Rescue Mission",
    "details_link": "https://www.metacritic.com/game/playstation-4/astro-bot-rescue-mission",
    "publisher": "JapanStudio",
    "release_date": "Oct  2 2018",
    "developers": [
      "JapanStudio"
    ],
    "platforms": "PlayStation 4",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 90,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/4/70fd18c7d21daea37f03624d071d4db6-98.jpg",
    "descriptions": "Astro Bot Rescue Mission is a platformer, developed exclusively for use with PS VR. Take control of Astro the captain Bot and go on an epic VR rescue mission to save your fellow Bots who are dispersed all over space."
  },
  {
    "name": "Bayonetta + Bayonetta 2",
    "details_link": "https://www.metacritic.com/game/switch/bayonetta-+-bayonetta-2",
    "publisher": "Nintendo",
    "release_date": "Feb 16 2018",
    "developers": [
      "PlatinumGames"
    ],
    "platforms": [
      "Wii U",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/386b17c36a974513c0e2415d4f68422c-98.jpg",
    "descriptions": "The Witch is Back. The witching hour strikes again. Brimming with intricate battles that take place in, on and all over epic set pieces, Bayonetta 2 finds our sassy heroine battling angels and demons in unearthly beautiful HD. You're bound to love how it feels to string together combos withThe Witch is Back. The witching hour strikes again. Brimming with intricate battles that take place in, on and all over epic set pieces, Bayonetta 2 finds our sassy heroine battling angels and demons in unearthly beautiful HD. You're bound to love how it feels to string together combos with unimaginable weapons and to summon demons using Bayonetta's Wicked Weave in this frantic stylized action game. Bayonetta 2 is a Wii U exclusive. Bayonetta comes packed in with the purchase of every retail packaged version of Bayonetta 2.\r Features:\r-Initiate the new Umbran Climax technique to temporarily summon demons and boost Bayonetta's attack power and range whenever you fill her magic gauge.\r-Fight with new over-the-top weapons that open new possibilities to the way you battle, including the Kafka, a bow that shoots poisonous arrows; the Rakshasa, a pair of beautiful katana blades; and a giant rifle-inspired scythe known as the Chernobog.\r-Team up with a friend in Tag Climax, a two-player online co-op mode. Enjoy a little friendly competition by trying to deal the most damage as you work together to take down angels and demons.\r-In online quick matches, you can wager halos, the in-game currency that you earn by defeating enemies. You receive a large sum back if you can prove you're a better fighter than your partner. Halos can then be traded in a story mode shop to unlock new techniques, buy accessories and pick up alternate weapon variations.\r-Every chapter ends with a medal ranking: Stone, Bronze, Silver, Gold, Platinum or Pure Platinum. The more skilled you are, the higher your ranking.\r-This game is approachable for players of all levels, with settings of three difficulty levels. Through Touch Play, you can play with the GamePad stylus and touch screen, regardless of which difficulty you choose.… Expand"
  },
  {
    "name": "Kentucky Route Zero - Act IV",
    "details_link": "https://www.metacritic.com/game/pc/kentucky-route-zero---act-iv",
    "publisher": "Cardboard Computer",
    "release_date": "Jul 20 2016",
    "developers": [
      "Cardboard Computer"
    ],
    "platforms": "PC",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 90,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/3/d719c47528255c6b77b78effd5b12372-98.jpg",
    "descriptions": "Kentucky Route Zero is a magical realistic adventure game about a secret highway in the caves beneath Kentucky, and the mysterious folks who travel it."
  },
  {
    "name": "Guacamelee! Super Turbo Championship Edition",
    "details_link": "https://www.metacritic.com/game/wii-u/guacamelee!-super-turbo-championship-edition",
    "publisher": "DrinkBox Studios",
    "release_date": "Jul  2 2014",
    "developers": [
      "DrinkBox Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "Wii U"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D",
      "",
      "Metroidvania"
    ],
    "meta_score": 90,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/3/3aa624e3fbee943ed4272e869f796615-98.jpg",
    "descriptions": "Guacamelee! is a Metroid-vania style action-platformer set in a magical Mexican inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters. Guacamelee builds upon the classic open-world Metroid-vania styleGuacamelee! is a Metroid-vania style action-platformer set in a magical Mexican inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters. Guacamelee builds upon the classic open-world Metroid-vania style of games, by adding a strong melee combat component, a new dimension switching mechanic, and cooperative same-screen multiplayer for the entire story. The game also blurs the boundaries between combat and platforming by making many of the moves useful and necessary for both of these.… Expand"
  },
  {
    "name": "NBA 2K12",
    "details_link": "https://www.metacritic.com/game/xbox-360/nba-2k12",
    "publisher": "2K Sports",
    "release_date": "Oct  4 2011",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Basketball",
      "Sim",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/5/6e0da9f309c3d175bf4ec7ca273f3638-98.jpg",
    "descriptions": "The NBA 2k Franchise is back with NBA 2K12."
  },
  {
    "name": "ESPN NHL Hockey",
    "details_link": "https://www.metacritic.com/game/playstation-2/espn-nhl-hockey",
    "publisher": "Sega",
    "release_date": "Sep  9 2003",
    "developers": [
      "Kush Games"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Ice Hockey",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/8/a546bc73e4dd8f961cfce006a9d79a77-98.jpg",
    "descriptions": "ESPN NHL Hockey brings you authentic box scores, overlays, stats and more - fully capturing the atmosphere of an ESPN NHL broadcast. Groundbreaking Graphics Engine ? Pushing the hardware to new limits, player models and faces, environmental effects, arenas, cut-scenes, uniforms and more areESPN NHL Hockey brings you authentic box scores, overlays, stats and more - fully capturing the atmosphere of an ESPN NHL broadcast. Groundbreaking Graphics Engine ? Pushing the hardware to new limits, player models and faces, environmental effects, arenas, cut-scenes, uniforms and more are meticulously detailed - raising realism to a new level. Top-Notch Commentary- A superstar booth features the best in the business, as ESPN?s Gary Thorne and Bill Clement deliver smart play-by-play and color commentary with situational analysis and true ESPN flavor. Got Skills? - Put your skills to the test against the NHL?s best as you compete for the title in all of the NHL?s All-Star skills challenges. Mini-Games Galore ? Including \"Mini-Rink,\" a fast-paced 2 on 2 intense hockey experience, Pond Hockey, and enhanced skills events. … Expand"
  },
  {
    "name": "Rayman 2 Revolution",
    "details_link": "https://www.metacritic.com/game/playstation-2/rayman-2-revolution",
    "publisher": "Ubisoft",
    "release_date": "Jan 30 2001",
    "developers": [
      "Ubisoft"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/1/ea81e89cf1e571ef252adc87e1def403-98.jpg",
    "descriptions": "First appearing on the N64 in 1999, our favorite limbless little french thing hits the PS2 with all of the game levels brought together in a single coherent 3D world, eliminating the need for the 2D overworld map, and with an increased difficulty level."
  },
  {
    "name": "Madden NFL 2001",
    "details_link": "https://www.metacritic.com/game/playstation/madden-nfl-2001",
    "publisher": "EA Sports",
    "release_date": "Aug 22 2000",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/7/6dd03d9d9782a515d4d1090fe7fb1821-98.jpg",
    "descriptions": "Get ready for a dose of bone-crunching football action on the PlayStation 2 with Madden NFL 2001. Madden NFL 2001 features an all-new and exclusive NFL Coaches Club license, which means you'll see coaches on the sidelines and hear them yelling encouragement, comments and criticisms. MaddenGet ready for a dose of bone-crunching football action on the PlayStation 2 with Madden NFL 2001. Madden NFL 2001 features an all-new and exclusive NFL Coaches Club license, which means you'll see coaches on the sidelines and hear them yelling encouragement, comments and criticisms. Madden 2001 also features individualized details, easy-to-use interface, dynamically enhanced audio and play-by-play recorded with John Madden and his broadcast partner, Pat Summerall, and more!… Expand"
  },
  {
    "name": "Final Fantasy VIII",
    "details_link": "https://www.metacritic.com/game/playstation/final-fantasy-viii",
    "publisher": "Square EA",
    "release_date": "Sep  7 1999",
    "developers": [
      "SquareSoft"
    ],
    "platforms": [
      "PC",
      "PlayStation"
    ],
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/1/09a19981db3f8aada93d46cea44bde0f-98.jpg",
    "descriptions": "The next chapter in Final Fantasy takes the series to the next level.  Final Fantasy VIII combines an epic storyline with dynamic role-playing elements, breathtaking music, and well-defined characters.  The world of Final Fantasy VIII comes to life in a dazzling display of digital artistryThe next chapter in Final Fantasy takes the series to the next level.  Final Fantasy VIII combines an epic storyline with dynamic role-playing elements, breathtaking music, and well-defined characters.  The world of Final Fantasy VIII comes to life in a dazzling display of digital artistry that spans four CDs.  With the addition of an hour worth of CG animation, a new \"Junction\" system, and compatibility with the Dual Shock Analog Controller, Final Fantasy VIII is a breathtaking addition to the series.… Expand"
  },
  {
    "name": "Beetle Adventure Racing",
    "details_link": "https://www.metacritic.com/game/nintendo-64/beetle-adventure-racing",
    "publisher": "EA Sports",
    "release_date": "Feb 28 1999",
    "developers": [
      "Paradigm Entertainment"
    ],
    "platforms": "Nintendo 64",
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade"
    ],
    "meta_score": 90,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/3bddd97103d86a7a05c350fd1b8fe528-98.jpg",
    "descriptions": "The adventure begins when you leave the road behind! Smashing, bashing fun! Crash and dash! Ultra-fast nitro blast! Go anywhere - choose your own routes, find surprises at every turn! Do anything - grab big-time air, engage in four-car mayhem!"
  },
  {
    "name": "Command & Conquer: Red Alert",
    "details_link": "https://www.metacritic.com/game/pc/command-conquer-red-alert",
    "publisher": "Westwood Studios",
    "release_date": "Nov 22 1996",
    "developers": [
      "Westwood Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "2 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Sci-Fi",
      "Sci-Fi",
      "Command"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/6/f06687f0c07adba2de014b7c25413044-98.jpg",
    "descriptions": "Surrender is not an option. Dark experiments have permanently altered time. Or have they? Now, Soviet tanks crush city after city while Allied cruisers shell bases. Spies lurk, land mines wait, and strange new technologies aid both sides in their struggle for ultimate control.Command &Surrender is not an option. Dark experiments have permanently altered time. Or have they? Now, Soviet tanks crush city after city while Allied cruisers shell bases. Spies lurk, land mines wait, and strange new technologies aid both sides in their struggle for ultimate control.Command & Conquer: Red Alert gives you the opportunity to be more devious, cunning and ruthless than ever before. Easy to play and highly addictive, Red Alert puts the fate of the world in your hands! [Westwood]… Expand"
  },
  {
    "name": "The Witcher 3: Wild Hunt - Hearts of Stone",
    "details_link": "https://www.metacritic.com/game/pc/the-witcher-3-wild-hunt---hearts-of-stone",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Oct 13 2015",
    "developers": [
      "CD Projekt Red Studio"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/8/cc5ef511722af9ad9d2971d7b4574fe2-98.jpg",
    "descriptions": "Hearts of Stone features over ten hours of new adventures and introduces new characters, powerful monsters, unique romance, and an entirely new storyline shaped by gamer choices. The expansion also introduces a new system of Runewords that significantly affects gameplay. Each RunewordHearts of Stone features over ten hours of new adventures and introduces new characters, powerful monsters, unique romance, and an entirely new storyline shaped by gamer choices. The expansion also introduces a new system of Runewords that significantly affects gameplay. Each Runeword impacts a different aspect of in-game mechanics and allows the players to experiment with various strategies and tactics. [CD Projekt]… Expand"
  },
  {
    "name": "Dead Space",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/dead-space",
    "publisher": "Electronic Arts",
    "release_date": "Jan 27 2023",
    "developers": [
      "Electronic Arts",
      "Motive Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/9/7dc7f40350bab4503b110ee0560d410a-98.jpg",
    "descriptions": "Developed exclusively for next generation consoles and PC, raising the level of horror and immersion to unprecedented heights for the franchise through stunning visuals, audio and controls powered by the Frostbite game engine. Fans will experience an improved story, characters, gameplayDeveloped exclusively for next generation consoles and PC, raising the level of horror and immersion to unprecedented heights for the franchise through stunning visuals, audio and controls powered by the Frostbite game engine. Fans will experience an improved story, characters, gameplay mechanics and more as they fight to survive a living nightmare aboard the desolate mining starship, the USG Ishimura, all while uncovering the dreadful mystery of what happened to the slaughtered crew and ship. \r\rIn Dead Space, Isaac Clarke is an everyman engineer on a mission to repair a vast, sprawling starship, the USG Ishimura, only to discover something has gone horribly wrong. The ship's crew has been slaughtered and infected by some alien scourge...and Isaac's beloved partner, Nicole, is lost somewhere on board. Now Isaac is alone with only his tools and engineering skills as he attempts to uncover the nightmarish mystery of what happened aboard the Ishimura. Trapped with hostile creatures called \"necromorphs\", Isaac faces a battle for survival, not only against the escalating terrors of the ship, but his own crumbling sanity.… Expand"
  },
  {
    "name": "Star Wars Jedi Knight II: Jedi Outcast",
    "details_link": "https://www.metacritic.com/game/pc/star-wars-jedi-knight-ii-jedi-outcast",
    "publisher": "LucasArts",
    "release_date": "Mar 26 2002",
    "developers": [
      "Raven Software"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "PC"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Action",
      "Action Adventure",
      "Shooter",
      "Shooter",
      "Linear",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/4/e6056a5d92120f30bf1bf64fffde32bf-98.jpg",
    "descriptions": "Several years have passed since Kyle Katarn avenged his father's death and saved the Valley of the Jedi from Jerec and his band of Dark Jedi. Allowing his Force powers to languish for fear of falling to the Dark side, Kyle set aside his lightsaber, vowing never to use it again. But when aSeveral years have passed since Kyle Katarn avenged his father's death and saved the Valley of the Jedi from Jerec and his band of Dark Jedi. Allowing his Force powers to languish for fear of falling to the Dark side, Kyle set aside his lightsaber, vowing never to use it again. But when a new and menacing threat to the galaxy emerges, Kyle knows he must reclaim his past in order to save his future. Players assume the role of Kyle as they employ a unique mix of weapons, Force powers and your lightsaber in both single- and multiplayer modes of first-person action. [LucasArts]… Expand"
  },
  {
    "name": "Wipeout HD Fury",
    "details_link": "https://www.metacritic.com/game/playstation-3/wipeout-hd-fury",
    "publisher": "SCEA",
    "release_date": "Jul 23 2009",
    "developers": [
      "Studio Liverpool"
    ],
    "platforms": "PlayStation 3",
    "num_players": "Up to 8 ",
    "genres": [
      "Driving",
      "Futuristic",
      "Racing",
      "Arcade",
      "Futuristic"
    ],
    "meta_score": 89,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/4/f376a9f467cf7bbc1ec63124902c6559-98.jpg",
    "descriptions": "[Playstation Network]  The WipEout HD Fury expansion pack increases the content of your current game with 8 new tracks, 13 new ship models and 3 new game modes, 2 of which are available for online play. In addition there are new trophies to attain, a re-styled front-end and a selection of[Playstation Network]  The WipEout HD Fury expansion pack increases the content of your current game with 8 new tracks, 13 new ship models and 3 new game modes, 2 of which are available for online play. In addition there are new trophies to attain, a re-styled front-end and a selection of new & improved multiplayer functionality. The Eliminator game mode allows you to release all that pent-up aggression as you use the full arsenal of Wipeout weaponry to destroy your opponents. Forget those racing lines; this is all about destruction, with the victor being the first to reach the target score. Zone Battle is about risk and reward. Acceleration is automatic as you swoop over zone pads to fill your zone bar. Your choice is whether to use the bar to increase your speed and boost your ship ever closer to the target zone or absorb it to replenish vital lost energy. Warning, avoid the ‘zone barriers’, obstacles left on the track by your opponents as they boost towards the target zone, hitting these can literally destroy your hopes of victory. Detonator mode introduces a brand new ship model to the game that tests both your piloting skills and your shooting accuracy as you accelerate through as many as 14 stages. Score points by destroying the mines that have been strewn along the track and take out the bomb on each stage to earn additional points. The more accurate you are the more points and bonuses you will score. [SCEA]… Expand"
  },
  {
    "name": "Halo 2 Multiplayer Map Pack",
    "details_link": "https://www.metacritic.com/game/xbox/halo-2-multiplayer-map-pack",
    "publisher": "Microsoft Game Studios",
    "release_date": "Jul  5 2005",
    "developers": [
      "Bungie Software"
    ],
    "platforms": "Xbox",
    "num_players": "16  Online",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 89,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/3/1690ff3cbb2b4705f8a1175ba2948b72-98.jpg",
    "descriptions": "The world's greatest multiplayer game just got better. Take the fight from the streets of Old Mombasa to the islands of Delta Halo to the very edges of the galaxy! The nine new maps included in this pack nearly double Halo® 2's multiplayer arena. Some battlefields featureThe world's greatest multiplayer game just got better. Take the fight from the streets of Old Mombasa to the islands of Delta Halo to the very edges of the galaxy! The nine new maps included in this pack nearly double Halo® 2's multiplayer arena. Some battlefields feature tight-quartered, intense spaces designed for small-scale mayhem. Others are large-scale, interactive arenas with explosive vehicle combat--perfect for Split Screen, System Link or Xbox Live™.… Expand"
  },
  {
    "name": "Yakuza: Like a Dragon",
    "details_link": "https://www.metacritic.com/game/xbox-one/yakuza-like-a-dragon",
    "publisher": "Sega",
    "release_date": "Nov 10 2020",
    "developers": [
      "Sega"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/9/f6bc159901c7deae804aa34f57e63431-98.jpg",
    "descriptions": "RISE LIKE A DRAGON. Become Ichiban Kasuga, a low-ranking yakuza grunt left on the brink of death by the man he trusted most. Take up your legendary bat and get ready to crack some underworld skulls in dynamic RPG combat set against the backdrop of modern-day Japan."
  },
  {
    "name": "Resident Evil 2",
    "details_link": "https://www.metacritic.com/game/pc/resident-evil-2",
    "publisher": "Capcom",
    "release_date": "Jan 25 2019",
    "developers": [
      "Capcom R&D Division 1"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 89,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/8/52e5269998add3b4376c3281bc0dd590-98.jpg",
    "descriptions": "In Resident Evil 2, the classic action, tense exploration, and puzzle solving gameplay that defined the Resident Evil series returns. Players join rookie police officer Leon Kennedy and college student Claire Redfield, who are thrust together by a disastrous outbreak in Raccoon City thatIn Resident Evil 2, the classic action, tense exploration, and puzzle solving gameplay that defined the Resident Evil series returns. Players join rookie police officer Leon Kennedy and college student Claire Redfield, who are thrust together by a disastrous outbreak in Raccoon City that transformed its population into deadly zombies. Both Leon and Claire have their own separate playable campaigns, allowing players to see the story from both characters’ perspectives. The fate of these two fan favorite characters is in players hands as they work together to survive and get to the bottom of what is behind the terrifying attack on the city. Will they make it out alive?… Expand"
  },
  {
    "name": "Borderlands 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/borderlands-2",
    "publisher": "2K Games",
    "release_date": "Sep 18 2012",
    "developers": [
      "Gearbox Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Xbox One",
      "Xbox 360"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/387c7e7340a3589de3c37b6b98a83ebf-98.jpg",
    "descriptions": "Play as one of 4 new vault hunters facing off against a new world of creatures, psychos and the evil mastermind, Handsome Jack. Make new friends, arm them with a gazillion weapons and fight alongside them in four-player co-op or split-screen on a relentless quest for revenge and redemptionPlay as one of 4 new vault hunters facing off against a new world of creatures, psychos and the evil mastermind, Handsome Jack. Make new friends, arm them with a gazillion weapons and fight alongside them in four-player co-op or split-screen on a relentless quest for revenge and redemption across the undiscovered and unpredictable living planet.… Expand"
  },
  {
    "name": "Shin Megami Tensei: Persona 3 Portable",
    "details_link": "https://www.metacritic.com/game/psp/shin-megami-tensei-persona-3-portable",
    "publisher": "Atlus",
    "release_date": "Jul  5 2010",
    "developers": [
      "Atlus"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PSP"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Console-style RPG",
      "Console-style RPG",
      "Japanese-Style"
    ],
    "meta_score": 89,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/9/2d748cc2004d1615849cbb736dca5100-98.jpg",
    "descriptions": "Terrible creatures lurk in the dark, preying on those who wander into the hidden hour between one day and the next.  As a member of a secret school club, you must wield your inner power--Persona--and protect humanity from impending doom.  Will you live to see the light of day? MaximumTerrible creatures lurk in the dark, preying on those who wander into the hidden hour between one day and the next.  As a member of a secret school club, you must wield your inner power--Persona--and protect humanity from impending doom.  Will you live to see the light of day? Maximum Persona 3--The RPG that captured critics and fans alike achieves a new level of excellence.  Built upon an enhanced version of the game, players will find numerous significant improvements, including the addition of Skill Cards, part-time jobs, a total of five difficulty settings (ranging from the newcomer-friendly \"beginner\" to the ultra-hardcore \"maniac\"), and most importantly, the ability to directly control your teammates in battle. Gain a whole new perspective--The choice of your protagonist's sex at the start of the game has a dramatic impact on the game's intricate social dynamics.  Persona 3 veterans will get a kick out of playing through the story from a new female perspective, gaining new Social Links, special events, and unique romantic opportunities. Slick system enhancements--Improved playability permeates every aspect of the gameplay experience.  One-button menu shortcuts, streamlined team equipment changes, incredibly short load times, and other tweaks and enhancements create an ideal pace for portable gaming. [Atlus USA]… Expand"
  },
  {
    "name": "Devil May Cry 5",
    "details_link": "https://www.metacritic.com/game/pc/devil-may-cry-5",
    "publisher": "Capcom",
    "release_date": "Mar  7 2019",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 89,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/1/9a25a24a59637d4c528e07f0cce37595-98.jpg",
    "descriptions": "The story is set several years after Devil May Cry 4.\rLegendary DMC action returns, made all the more stylish by the power modern gaming has to offer.\r\r\nBehold stunning visuals built upon the technology that brought you Resident Evil 7 biohazard. High framerate graphics and flexible designThe story is set several years after Devil May Cry 4.\rLegendary DMC action returns, made all the more stylish by the power modern gaming has to offer.\r Behold stunning visuals built upon the technology that brought you Resident Evil 7 biohazard. High framerate graphics and flexible design give our creators what they need to offer fans the latest and greatest DMC experience.… Expand"
  },
  {
    "name": "XCOM: Enemy Unknown",
    "details_link": "https://www.metacritic.com/game/playstation-3/xcom-enemy-unknown",
    "publisher": "2K Games",
    "release_date": "Oct  9 2012",
    "developers": [
      "Firaxis Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation Vita",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "2 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General",
      "Sci-Fi",
      "Sci-Fi",
      "General",
      "Tactics"
    ],
    "meta_score": 89,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/7/33a858d49c3497c7bc6f047376807698-98.jpg",
    "descriptions": "Lead your troops in fierce battles to defeat the alien front, and rescue civilians in crowded cities and remote outlands around the world. Construct and expand your XCOM headquarters, recruit and coach up unique soldiers to thrust into battle, and research alien tech to enhance and multiplyLead your troops in fierce battles to defeat the alien front, and rescue civilians in crowded cities and remote outlands around the world. Construct and expand your XCOM headquarters, recruit and coach up unique soldiers to thrust into battle, and research alien tech to enhance and multiply your weapons and capabilities. Mix and match aliens and soldiers and synthesize abilities to outwit and overpower your alien opponents.… Expand"
  },
  {
    "name": "Neon White",
    "details_link": "https://www.metacritic.com/game/pc/neon-white",
    "publisher": "Annapurna Interactive",
    "release_date": "Jun 16 2022",
    "developers": [
      "Ben Esposito",
      "Angel Matrix"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/4/6ab86c380bdd77b259ffe866a1067b00-98.jpg",
    "descriptions": "Neon White is a lightning fast first-person action game about exterminating demons in Heaven. You are White, an assassin handpicked from Hell to compete with other demon slayers for a chance to live permanently in Heaven. The other assassins seem familiar, though… did you know them in a pastNeon White is a lightning fast first-person action game about exterminating demons in Heaven. You are White, an assassin handpicked from Hell to compete with other demon slayers for a chance to live permanently in Heaven. The other assassins seem familiar, though… did you know them in a past life?\r Features:\r• You play as Neon White, an assassin plucked from Hell to compete with other demon slayers for a shot at redemption.\r• Collect “Soul Cards” to attack your foes or discard them to use unique movement abilities.\r• Compete for the best times by cleverly combining cards to discover massive shortcuts.\r• Uncover Heaven’s mysteries by getting to know the other assassins… did you know them in a past life?… Expand"
  },
  {
    "name": "Xenoblade Chronicles: Definitive Edition",
    "details_link": "https://www.metacritic.com/game/switch/xenoblade-chronicles-definitive-edition",
    "publisher": "Nintendo",
    "release_date": "May 29 2020",
    "developers": [
      "Monolith Soft"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/4/d44b7f8ad0f84de2d0694370170661a8-98.jpg",
    "descriptions": "Join the fight between man and machine in the definitive edition of this critically-acclaimed RPG. Discover the origins of Shulk as he and his companions clash against a seemingly-unstoppable mechanical menace. Wield a future-seeing blade, chain together attacks, and carefully position yourJoin the fight between man and machine in the definitive edition of this critically-acclaimed RPG. Discover the origins of Shulk as he and his companions clash against a seemingly-unstoppable mechanical menace. Wield a future-seeing blade, chain together attacks, and carefully position your party members in strategic, real-time combat as you journey across a massive world. During an attack from the mechanical invaders known as the Mechon, Shulk discovers that he can tap into the full power of a mysterious blade known as the Monado. With the mighty Monado in hand, Shulk sets out to defeat the Mechon once and for all. In addition to the Mechon, you’ll run into wildlife that ranges from docile to deadly. Keep an eye on what attracts monsters’ attention to avoid unwanted conflict…or try your hand at bringing down an ultra-powerful Unique Monster. Upgrade your party as you progress through the adventure by selecting equipment, enhancing weapon skills, and using benefit-granting gems. Put your dependable companions to work by filling the party gauge to trigger a Chain Attack and attack enemies in quick succession.… Expand"
  },
  {
    "name": "Call of Duty 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-2",
    "publisher": "Activision",
    "release_date": "Nov 17 2005",
    "developers": [
      "Infinity Ward"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "1-16 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Historic",
      "Historic",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/9/ebd84d794f81d6c42b39c855794ac777-98.jpg",
    "descriptions": "Call of Duty 2 lets players experience four individual soldier stories as they overcome insurmountable odds in multiple campaigns. Players have the freedom to follow each of the four storylines through for the ultimate character-driven experience, or they can engage in the historic battlesCall of Duty 2 lets players experience four individual soldier stories as they overcome insurmountable odds in multiple campaigns. Players have the freedom to follow each of the four storylines through for the ultimate character-driven experience, or they can engage in the historic battles chronologically for quick hitting action. Infinity Ward has also expanded the scope of combat to deliver a truly realistic battlefield experience. Squads now have the freedom to take on a variety of mission objectives, on expansive battlefields that allow for multiple paths and the ability to utilize actual combat tactics like outflanking and fire and maneuver capabilities. Call of Duty 2's new engine and A.I. technology set the stage for authentic squad combat and astonishing action. Concealment can be key as battlefield smoke or even deployed smoke grenades cloud visibility. Weather effects such as the dusty sandstorms of North Africa and whiteout blizzard conditions of Russia, for example, will keep soldiers glued to their bunkers. The team has also employed a state-of-the-art Battle Chatter System that brings the action to life as squad-mates bark out context-sensitive updates in real-time to players through an advanced A.I. system. [Activision]… Expand"
  },
  {
    "name": "Burnout Revenge",
    "details_link": "https://www.metacritic.com/game/xbox/burnout-revenge",
    "publisher": "Electronic Arts",
    "release_date": "Sep 13 2005",
    "developers": [
      "Criterion Games"
    ],
    "platforms": "Xbox",
    "num_players": "6  Online",
    "genres": [
      "Driving",
      "Racing",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/7/9d31c0c2c5371455c3333f3c80cad64b-98.jpg",
    "descriptions": "Burnout Revenge is a racing game in which your desire for destruction is as important as your ability to reach the finish line. The sequel to Burnout 3 adds some new features such as detailed car damage, crash combos, and a meter that rewards vengeance on the road. Game modes run the rangeBurnout Revenge is a racing game in which your desire for destruction is as important as your ability to reach the finish line. The sequel to Burnout 3 adds some new features such as detailed car damage, crash combos, and a meter that rewards vengeance on the road. Game modes run the range from pure racing to pure destruction on a handful of real-world locations, including Detroit and Rome. Burnout Revenge also supports online play for challenging other players.… Expand"
  },
  {
    "name": "Dragon Quest VIII: Journey of the Cursed King",
    "details_link": "https://www.metacritic.com/game/playstation-2/dragon-quest-viii-journey-of-the-cursed-king",
    "publisher": "Square Enix",
    "release_date": "Nov 15 2005",
    "developers": [
      "Level 5"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/3/6f35e373ef4a414e1689f101cf2a93cd-98.jpg",
    "descriptions": "The world of Dragon Quest VIII is created with breakthrough 3D graphics. The world, which includes fields, towns and dungeons, allow players to move around seamlessly. The graphics are of a high-quality animation, and players can feel as if they are walking around inside the world created byThe world of Dragon Quest VIII is created with breakthrough 3D graphics. The world, which includes fields, towns and dungeons, allow players to move around seamlessly. The graphics are of a high-quality animation, and players can feel as if they are walking around inside the world created by Character Designer, Akira Toriyama. The battle scenes and monsters make users feel as if they were actually facing them All of the monsters and characters are transformed with 3D graphics. Battle scenes provide astrong presence of characters and monsters due to its stunning visuals. Moreover, both new andfamiliar monsters have been recreated with uniquely detailed animation. Characteristic monsters popular among fans of Dragon Quest VIII come alive with a fresh breath of life. An entirely new original score by Koichi SugiyamaKoichi Sugiyama, the composer of Dragon Quest VIII and all of the music from previous titles in the series, composed an entirely original score. A classic and elegant score, the music is also memorable and will leave people humming the tunes. The impressive score makes the journey much more adventurous and paints each scene with emotion. [Square Enix]… Expand"
  },
  {
    "name": "Metroid: Zero Mission",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/metroid-zero-mission",
    "publisher": "Nintendo",
    "release_date": "Feb  9 2004",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 89,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/1/a7f40137b9c1fbd80282160491ac661d-98.jpg",
    "descriptions": "She's battled baddies on nearly every Nintendo system, and now, Samus Aran returns to her roots.  Metroid: Zero Mission relives the story that started it all--revealing for the first time full details of her meeting with the Metroids.  The plotline will be familiar to longtime fans of theShe's battled baddies on nearly every Nintendo system, and now, Samus Aran returns to her roots.  Metroid: Zero Mission relives the story that started it all--revealing for the first time full details of her meeting with the Metroids.  The plotline will be familiar to longtime fans of the Metroid series, but the challenges are new, the power-ups are plentiful, and the graphics and sound are supercharged.  Plus, if you thought that the original Metroid had a surprise ending, wait until you get past the Mother Brain in Metroid: Zero Mission.  A new twist provides a deeper adventure than ever before.… Expand"
  },
  {
    "name": "The Legend of Zelda: Majora's Mask 3D",
    "details_link": "https://www.metacritic.com/game/3ds/the-legend-of-zelda-majoras-mask-3d",
    "publisher": "Nintendo",
    "release_date": "Feb 13 2015",
    "developers": [
      "GREZZO"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Fantasy",
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 89,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/0/0b474b02bbe56171774ce28feecfab8b-98.jpg",
    "descriptions": "The Skull Kid personifies the mischief and mystery of the Lost Woods, but a cursed mask has now morphed him into something exceedingly more terrifying. When he dupes Link into entering a land called Termina, the Hero of Time faces a pressing challenge in a strange, new land: stop the moonThe Skull Kid personifies the mischief and mystery of the Lost Woods, but a cursed mask has now morphed him into something exceedingly more terrifying. When he dupes Link into entering a land called Termina, the Hero of Time faces a pressing challenge in a strange, new land: stop the moon from ending the world in three days. Don't panic! You'll have some time-twisting tunes and magical masks to help you make it to tomorrow. [Nintendo]… Expand"
  },
  {
    "name": "Skylanders Swap Force",
    "details_link": "https://www.metacritic.com/game/wii-u/skylanders-swap-force",
    "publisher": "Activision",
    "release_date": "Oct 13 2013",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "3DS",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "Wii U"
    ],
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "3D"
    ],
    "meta_score": 89,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/9/390afaba9647dfd80bcaee454fe51a7c-98.jpg",
    "descriptions": "In Skylanders SWAP Force, Portal Masters embark on an adventure in the mysterious Cloudbreak Islands, where a magical volcano gives the heroes the power to swap halves, turning them into a special team known as the SWAP Force. By reassembling this team, Portal Masters must send back Kaos andIn Skylanders SWAP Force, Portal Masters embark on an adventure in the mysterious Cloudbreak Islands, where a magical volcano gives the heroes the power to swap halves, turning them into a special team known as the SWAP Force. By reassembling this team, Portal Masters must send back Kaos and his evil plan to Cloudbreak in order to save Skylands.… Expand"
  },
  {
    "name": "The Walking Dead: A Telltale Games Series",
    "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-a-telltale-games-series",
    "publisher": "Telltale Games",
    "release_date": "Apr 24 2012",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Switch",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Compilation",
      "Miscellaneous",
      "Adventure",
      "Compilation",
      "Point-and-Click"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/4/a861c098a7c3d37b8b77ba3125be0784-98.jpg",
    "descriptions": "Based on Robert Kirkman's comic book series, The Walking Dead brings to life a world devastated by an undead apocalypse and the horrifying choices you're forced to make to survive. Play the role of Lee Everett, a convicted criminal, who has been given a second chance at life in a worldBased on Robert Kirkman's comic book series, The Walking Dead brings to life a world devastated by an undead apocalypse and the horrifying choices you're forced to make to survive. Play the role of Lee Everett, a convicted criminal, who has been given a second chance at life in a world devastated by the undead. With corpses returning to life and survivors stopping at nothing to maintain their own safety, protecting an orphaned girl named Clementine may offer you redemption in a world gone to hell.… Expand"
  },
  {
    "name": "Tiger Woods PGA Tour 2004",
    "details_link": "https://www.metacritic.com/game/playstation-2/tiger-woods-pga-tour-2004",
    "publisher": "EA Sports",
    "release_date": "Sep 22 2003",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Golf",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/6/6cba3b456cb84b9cca189bddb62db3b8-98.jpg",
    "descriptions": "With the revolutionary new EA SPORTS Game Face, you can build yourself from scratch and take on the pros while improving your skills with each solid performance. Play as or against over a dozen top pros, including Tiger Woods, Vijay Singh, Justin Leonard, and new golfers like John Daly andWith the revolutionary new EA SPORTS Game Face, you can build yourself from scratch and take on the pros while improving your skills with each solid performance. Play as or against over a dozen top pros, including Tiger Woods, Vijay Singh, Justin Leonard, and new golfers like John Daly and Adam Scott. Five new courses have been added to all the old favorites like Pebble Beach Golf Links and St Andrews Golf Links. Graphical and gameplay enhancements mean more ball control and more realistic weather and terrain conditions. Expanded Career Mode lets you take your golfer through a World Tour to earn money and sponsorships. Go online for matches and tournaments, and climb the leaderboards. [EA Sports]… Expand"
  },
  {
    "name": "Age of Mythology",
    "details_link": "https://www.metacritic.com/game/pc/age-of-mythology",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov  1 2002",
    "developers": [
      "Ensemble Studios"
    ],
    "platforms": "PC",
    "num_players": "1-12 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/9/a876d04d14e624d1c5c6429d674084f5-98.jpg",
    "descriptions": "Age of Mythology transports players to a time when heroes did battle with monsters of legend and the gods intervened in the affairs of mortal men. Players wage war using human armies and diplomacy, progress through development ages, enhance military and economic performance withAge of Mythology transports players to a time when heroes did battle with monsters of legend and the gods intervened in the affairs of mortal men. Players wage war using human armies and diplomacy, progress through development ages, enhance military and economic performance with improvements, and manage economics through resource gathering and trade. Mythology enters the mix when players call upon the gods to act on their behalf or reinforce their armies with more than 20 mythological creatures. Ensemble Studios' new 3D engine adds a deep richness of graphical detail and creates a unique new title based on the ancient cultural history of the Greek, Norse, and Egyptian cultures, which are divided into nine detailed civilizations. [Microsoft]… Expand"
  },
  {
    "name": "Pikmin",
    "details_link": "https://www.metacritic.com/game/gamecube/pikmin",
    "publisher": "Nintendo",
    "release_date": "Dec  2 2001",
    "developers": [
      "Nintendo"
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/dc18f3d6dcf49a3b5482aad96fc0925c-98.jpg",
    "descriptions": "Pikmin may be small and plantlike, but they can be a space traveler's best friend.  Stranded on an unknown planet, Captain Olimar must enlist the help of these native Pikmin to rebuild his spaceship before the life-support system runs out.   In the meantime, you'll have to fend off attackersPikmin may be small and plantlike, but they can be a space traveler's best friend.  Stranded on an unknown planet, Captain Olimar must enlist the help of these native Pikmin to rebuild his spaceship before the life-support system runs out.   In the meantime, you'll have to fend off attackers and solve various puzzles. To produce additional multicolored Pikmin you must defeat enemies and carry them back to the Pikmin nests called onions.  But beware--watching giant predators gobble your Pikmin might make you angrier than you'd expect.… Expand"
  },
  {
    "name": "Madden NFL 2002",
    "details_link": "https://www.metacritic.com/game/gamecube/madden-nfl-2002",
    "publisher": "EA Sports",
    "release_date": "Nov 17 2001",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 5.2,
    "image": "https://static.metacritic.com/images/products/games/8/048930166fb97afe64456e5b54317dc9-98.jpg",
    "descriptions": "If you enjoy simulation-style football games that play well, have incredible depth, and look great, Madden 2002 is your game."
  },
  {
    "name": "Sacrifice (2000)",
    "details_link": "https://www.metacritic.com/game/pc/sacrifice-2000",
    "publisher": "Interplay",
    "release_date": "Nov  5 2000",
    "developers": [
      "Shiny Entertainment"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/9/2b097f451b3ad253d739f5e51c229bfc-98.jpg",
    "descriptions": "Sacrifice provides a truly fresh approach in the 3-D RTS genre, allowing players to act as both commander and combatant over huge, real-time, generated landscapes in single or multiplayer modes. Wizards will not be disappointed as Sacrifice serves up over 50 spells and creatures. [Interplay]"
  },
  {
    "name": "Samba de Amigo",
    "details_link": "https://www.metacritic.com/game/dreamcast/samba-de-amigo",
    "publisher": "Sega",
    "release_date": "Oct 16 2000",
    "developers": [
      "Sonic Team"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Miscellaneous",
      "Rhythm",
      "Music"
    ],
    "meta_score": 89,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/c19c7d70adbc13bfaf687e3cc2f51024-98.jpg",
    "descriptions": "Samba De Amigo is one of the best music and rhythm games released thus far, and it's the first such game to hit the United States, making it an excellent entry into the world of music peripherals."
  },
  {
    "name": "Wipeout 3",
    "details_link": "https://www.metacritic.com/game/playstation/wipeout-3",
    "publisher": "SCEE",
    "release_date": "Aug 31 1999",
    "developers": [
      "Psygnosis"
    ],
    "platforms": "PlayStation",
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "Futuristic"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/3/77366f5305fc90ec71ab0dd43cc09477-98.jpg",
    "descriptions": "The world's fastest PlayStation racer returns.... This is the ultimate anti-gravity racing experience by which all others are judged.... Accept no substitutes."
  }
]