[{"name": "Secret of Mana", "details_link": "https://www.metacritic.com/game/playstation-4/secret-of-mana", "publisher": "Square Enix", "release_date": "Feb 15 2018", "developers": ["Square Enix", "Q Studios"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 63, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/34ed9102f0aa2e8dd968e9a7bfea9bbb-98.jpg", "descriptions": "Originally released in 1993, \"Secret of Mana\" is by far the most popular title in the Mana series. This is its full 3D remake. The game faithfully retells the story while adopting modern 3D graphics and controls. It features a newly arranged musical score, voiced characters and new content.Originally released in 1993, \"Secret of Mana\" is by far the most popular title in the Mana series. This is its full 3D remake. The game faithfully retells the story while adopting modern 3D graphics and controls. It features a newly arranged musical score, voiced characters and new content. The adventure of Randi, Primm, and Popoi is reborn in the new \"Secret of Mana\".\r KEY FEATURES:\r *    Moogle Suit DLC - Equippable armor that can be used in game. This special piece of equipment also changes the appearance of the characters.\r*    Tiger Two Piece DLC -Equippable armor that can be used in game. This special piece of equipment also changes the appearance of Primm.\r*    Tiger Suit DLC - Equippable armor that can be used in game. This special piece of equipment also changes the appearance of Randi and Popoi.\r*    Custom downloadable wallpaper (sizes: 1024 x 768, 1280 x 1024, 1920 x 1080, 2560 x 1600)\r*    3D Graphics - Revamped visuals for the entire game; a vivid, Mana-filled world rebuilt in 3D!\r*    Upgraded Gameplay - The original system has been reworked in an effort to realize a modern action RPG with improved gameplay.… Expand"}, {"name": "King of Seas", "details_link": "https://www.metacritic.com/game/playstation-4/king-of-seas", "publisher": "Team17", "release_date": "May 25 2021", "developers": ["3DClouds"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "Action RPG"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/4060dbaf49247800eceef39a1a6e4994-98.jpg", "descriptions": "King of Seas is an Action Role playing game set in a procedural pirate world. An epic adventure awaits you in a fantastic world, dotted with fights, lost islands and treasures. A universe that will keep you anchored as you struggle to become the king of all pirates."}, {"name": "Maid of Sker", "details_link": "https://www.metacritic.com/game/xbox-one/maid-of-sker", "publisher": "Wales Interactive", "release_date": "Jul 28 2020", "developers": ["Wales Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 63, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/23b78ddaf491b5f8d08db313fde5ea39-98.jpg", "descriptions": "Maid of Sker is a first-person survival horror, set in a remote hotel with a gory and macabre history from British folklore. Brave the nightmares of the Quiet Ones. Do not panic…don’t even breathe!"}, {"name": "The Flower Collectors", "details_link": "https://www.metacritic.com/game/pc/the-flower-collectors", "publisher": "Mi'pu'mi Games", "release_date": "Apr 21 2020", "developers": ["Mi'pu'mi Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 63, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/e9ec5f86345c07e5b2c29ece858c5215-98.jpg", "descriptions": "Barcelona, 1977. An ex-cop in a wheelchair witnesses a murder, and teams up with a young ambitious journalist to bring the truth to light. With camera, binoculars and transmitter in hand, uncover the town’s secrets from your balcony in this soul-searching detective mystery."}, {"name": "Cat Girl Without Salad: Amuse-Bouche", "details_link": "https://www.metacritic.com/game/switch/cat-girl-without-salad-amuse-bouche", "publisher": "WayForward", "release_date": "Apr  1 2020", "developers": ["WayForward"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/eab2856761943cb7176c32849cdcad16-98.jpg", "descriptions": "Interstellar mayhem! A bounty-hunting cat girl! Funktasmical genre-spanning action! This one has it all — no foolin'! Blast everything that moves in this genre-defying action extravaganza! Take control of Kebako, a cat-eared intergalactic bounty hunter, as she patrols the galaxies with herInterstellar mayhem! A bounty-hunting cat girl! Funktasmical genre-spanning action! This one has it all — no foolin'! Blast everything that moves in this genre-defying action extravaganza! Take control of Kebako, a cat-eared intergalactic bounty hunter, as she patrols the galaxies with her faithful companion Squiddie in search of ridiculous space criminals.… Expand"}, {"name": "Deliver Us The Moon: Fortuna", "details_link": "https://www.metacritic.com/game/pc/deliver-us-the-moon-fortuna", "publisher": "KeokeN Interactive", "release_date": "Oct 10 2019", "developers": ["KeokeN Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 63, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/71172e682769c76360fcbfb05c7a4f59-98.jpg", "descriptions": "A lone astronaut is sent to the moon on a critical mission to save humanity from extinction."}, {"name": "8-Bit Hordes", "details_link": "https://www.metacritic.com/game/playstation-4/8-bit-hordes", "publisher": "Petroglyph", "release_date": "Feb  1 2019", "developers": ["Petroglyph"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Command"], "meta_score": 63, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/9/ce9b2fde53f36b9f1eaa3c45f2cc7270-98.jpg", "descriptions": "From the team that brought you 8-Bit Armies comes a new fantasy RTS as fast-paced and friendly as the original! 8-BIT HORDES is a colorful strategy-arcade game that is easy to learn for players of all skill levels. Collect resources, build up and defend your base, amass your army of orcs orFrom the team that brought you 8-Bit Armies comes a new fantasy RTS as fast-paced and friendly as the original! 8-BIT HORDES is a colorful strategy-arcade game that is easy to learn for players of all skill levels. Collect resources, build up and defend your base, amass your army of orcs or humans and ultimately crush your opponents! 8-Bit Hordes features offline single-player missions, two-player cooperative missions, AI skirmish mode, and Player-vs-Player Multiplayer modes running on dedicated game servers.… Expand"}, {"name": "The Lost Child", "details_link": "https://www.metacritic.com/game/switch/the-lost-child", "publisher": "NIS America", "release_date": "Jun 19 2018", "developers": ["Kadokawa"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/a6b4087abb2eedb9ff15b383a3db1670-98.jpg", "descriptions": "Occult journalist Hayato Ibuki encounters a strange girl during his investigations into a series of mysterious suicides in Tokyo. She implores that Hayato must live, before bestowing upon him a mystical device that allows him to capture celestial and arcane creatures. He is now thrust into aOccult journalist Hayato Ibuki encounters a strange girl during his investigations into a series of mysterious suicides in Tokyo. She implores that Hayato must live, before bestowing upon him a mystical device that allows him to capture celestial and arcane creatures. He is now thrust into a world beyond our own, home to horrific monsters and celestial beings. In it, he must delve into dungeons called Layers and solve the mystery of the device. Where his journey leads him could decide the fate of our world...FEATURES:* Mythology Unbound -- Features 100+ astrals from myths and legends to capture, each with 3 unique forms to progress through.* Spread the Wealth of Knowledge -- There are more than 250+ skills to learn and distribute among your party of captured Astrals.* The Infinite Abyss Awaits -- Test yourself against massive dungeons with up to 99 floors of deadly dangers.… Expand"}, {"name": "The Way Remastered", "details_link": "https://www.metacritic.com/game/switch/the-way-remastered", "publisher": "Puzzling Dream", "release_date": "Apr 20 2018", "developers": ["Puzzling Dream"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/1651e84ebbf1be74b7afcfc61501539a-98.jpg", "descriptions": "The Way Remastered tells a story about a member of space explorers team who lost his beloved and cannot accept her death. During one of his expeditions he discovers ancient writings that testify the existence of a method for obtaining eternal life. Hoping to get his beloved back, he decidesThe Way Remastered tells a story about a member of space explorers team who lost his beloved and cannot accept her death. During one of his expeditions he discovers ancient writings that testify the existence of a method for obtaining eternal life. Hoping to get his beloved back, he decides to return to the alien planet. However, the planet hides many secrets and dangers that he must face. … Expand"}, {"name": "Grand Ages: Medieval", "details_link": "https://www.metacritic.com/game/pc/grand-ages-medieval", "publisher": "Kalypso", "release_date": "Sep 25 2015", "developers": ["Gaming Minds Studios"], "platforms": ["PlayStation 4", "PC"], "genres": ["Strategy", "Real-Time", "General", "Historic"], "meta_score": 63, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/ead6ac0a539070208d4a6dd7ebb5f456-98.jpg", "descriptions": "Grand Ages: Medieval is a real-time strategy game from Gaming Minds. Lead your people and advance through the decades by utilising construction, research, expansion and conquest in an area extending from Scandinavia and North Africa; to Portugal, the Caucasus and the Middle East. Rise fromGrand Ages: Medieval is a real-time strategy game from Gaming Minds. Lead your people and advance through the decades by utilising construction, research, expansion and conquest in an area extending from Scandinavia and North Africa; to Portugal, the Caucasus and the Middle East. Rise from the humble role of a simple mayor governing a small settlement and rule over all of Europe. Experience an exciting campaign with elaborately designed cut-scenes, play by your own rules in free play or test your skills in multiplayer against up to 8 players!… Expand"}, {"name": "Cargo Commander", "details_link": "https://www.metacritic.com/game/pc/cargo-commander", "publisher": "Digital Tribe", "release_date": "Nov  1 2012", "developers": ["Serious Brew"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "General", "Platformer", "2D"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/03dd1444bf50c4d2f03b5690b2774616-98.jpg", "descriptions": "Cargo Commander has players travel through the vast reaches of wormhole-filled space to salvage priceless cargo from alien infested containers in hopes of earning a way back home."}, {"name": "Dead Block", "details_link": "https://www.metacritic.com/game/playstation-3/dead-block", "publisher": "Candygun Games", "release_date": "Jul 20 2011", "developers": ["Candygun Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Strategy", "General", "General"], "meta_score": 63, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/395cf0446d7fe82ef549488d47a7a8b1-98.jpg", "descriptions": "Dead Block focuses on innovative defensive gameplay in which the few remaining survivors, Jack Foster (a construction worker), Foxy Jones (a traffic warden), and Mike Bacon (a perpetually hungry boy scout) have formed an unlikely alliance to protect themselves from the invading undead.Dead Block focuses on innovative defensive gameplay in which the few remaining survivors, Jack Foster (a construction worker), Foxy Jones (a traffic warden), and Mike Bacon (a perpetually hungry boy scout) have formed an unlikely alliance to protect themselves from the invading undead. Hiding in various shelters around town, they avoid Zombies by building blockades, setting fiendish traps or – as a last resort – using their weapons to fight.… Expand"}, {"name": "Hans Christian Andersen: The Ugly Prince Duckling", "details_link": "https://www.metacritic.com/game/pc/hans-christian-andersen-the-ugly-prince-duckling", "publisher": "The Adventure Company", "release_date": "Mar 20 2007", "developers": ["Guppyworks"], "platforms": "PC", "genres": ["Adventure", "General", "General"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/8c00c6f0ff3facf85162fb344bc83a6e-98.jpg", "descriptions": "Hans Christian Andersen's classic tales are filled with fantasy, folklore, and wonder. The Ugly Prince Duckling takes you and your family on a new adventure – on a new medium – playing Andersen himself. Meet the Princess. Day after day she gazes longingly out her window upon the fascinatingHans Christian Andersen's classic tales are filled with fantasy, folklore, and wonder. The Ugly Prince Duckling takes you and your family on a new adventure – on a new medium – playing Andersen himself. Meet the Princess. Day after day she gazes longingly out her window upon the fascinating world below her. On her 15th birthday, tired of her boring privileged life, she decides to leave the royal palace against her father’s wishes in search of adventure. Along her journey she meets young Hans Christian Andersen – a poor teenager struggling to make his way in life, the Little Mermaid, the Ugly Duckling, and other characters made famous in Andersen’s fairytales. Meanwhile, lurking in the dark shadows, the wicked Master of Darkness begins hatching his evil plan. Without the protection of the palace walls, he kidnaps the Princess with help from the Trolls. He plans to expel the King and transform the kingdom into a Troll’s realm of darkness. Your job is to save the Princess and the kingdom! Easy navigation allows you to take complete control of your character in full 3D. Collect objects like the Magic Glow and Tinderbox, solve fun puzzles, and enjoy lots of game action that will keep you on your toes. [The Adventure Company]… Expand"}, {"name": "Contra", "details_link": "https://www.metacritic.com/game/xbox-360/contra", "publisher": "Konami", "release_date": "Nov  8 2006", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Shooter", "Platformer", "Shooter", "Scrolling", "2D", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 63, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/e7e69bdef889f3775a53eec3ea88210b-98.jpg", "descriptions": "[Xbox Live Arcade]  The Red Falcon organization is plotting to conquer the Earth and two commandos, Lance and Bill, must infiltrate their base. Travel through eight stages in the jungle armed with a machine gun and the ability to capture upgraded weapons including a Fireball, Laser, Rapid[Xbox Live Arcade]  The Red Falcon organization is plotting to conquer the Earth and two commandos, Lance and Bill, must infiltrate their base. Travel through eight stages in the jungle armed with a machine gun and the ability to capture upgraded weapons including a Fireball, Laser, Rapid Fire gun and a Spread Gun. Lance and Bill are all that stand in the way of Red Falcon and their plans for global domination. [Konami]… Expand"}, {"name": "ProStroke Golf - World Tour 2007", "details_link": "https://www.metacritic.com/game/playstation-2/prostroke-golf---world-tour-2007", "publisher": "Oxygen Interactive", "release_date": "Sep  1 2006", "developers": ["Gusto Games"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 63, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/28c8cce839c8f6e2d8274cb39ae6a721-98.jpg", "descriptions": "Step up to the tee and take on the pros in this year's only real-world golf simulation. Craft your technique, groove your swing, feel the pressure, compete and become a champion. ProStroke Golf is a faithful adaptation of the world's most challenging sport; including licensed players andStep up to the tee and take on the pros in this year's only real-world golf simulation. Craft your technique, groove your swing, feel the pressure, compete and become a champion. ProStroke Golf is a faithful adaptation of the world's most challenging sport; including licensed players and commentary from the international voices of golf. Put yourself to the ultimate test - challenge your skill, stamina and mental agility as you take on the best in the world. Control your nerves, feel the power of your drive, stare victory in the face and hear the crowd adore you. Licensed players: Sergio Garcia, Justin Rose, Colin Montgomerie, Ben Curtis, Zhang Lian Wei, and more...TV commentators : Sam Torrance, Ian Baker Finch and Alan Green. Courses include The Brabazon at The Belfry and Lake Nona. Innovative 'ProStroke' controls allow you to groove your own swing – just like the Pros do. Game Modes; From Match Play to Multiplayer through to training exercises and a comprehensive career mode, as well as short scorecard challenges. Caddy Feature offering Golf Pro Training exercises. Course and Tournament creator, allowing you to design and develop your own courses. [Oxygen Interactive]… Expand"}, {"name": "Mega Man Battle Network 6 Cybeast Falzar", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-battle-network-6-cybeast-falzar", "publisher": "Capcom", "release_date": "Jun 13 2006", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 63, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/0f404ce75b99a3abcd3c612178dbbb25-98.jpg", "descriptions": "In Mega Man Battle Network 6, Lan's father has received a job transfer and the family moves to Cyber City, a town known for conducting various technological experiments. Lan will meet new people and build new friendships in the real world while Mega Man befriends helpful Navis and encountersIn Mega Man Battle Network 6, Lan's father has received a job transfer and the family moves to Cyber City, a town known for conducting various technological experiments. Lan will meet new people and build new friendships in the real world while Mega Man befriends helpful Navis and encounters dangerous new enemies on the virtual plane. Together they will face threats far more powerful and perilous than they ever have before.… Expand"}, {"name": "Stacked with Daniel Negreanu", "details_link": "https://www.metacritic.com/game/playstation-2/stacked-with-daniel-negreanu", "publisher": "Myelin Media", "release_date": "May 31 2006", "developers": ["5000ft"], "platforms": "PlayStation 2", "num_players": "10  Online", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 63, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/c2fc592e1ecc4a4d0e05802597477f9a-98.jpg", "descriptions": "Stacked is a Texas Hold 'em poker game that captures the look, excitement and drama of the phenomenon that has captivated America. The game features a comprehensive poker school in which the player can receive tips and strategies from Daniel Negreanu (2004 ESPN Player of the Year, WorldStacked is a Texas Hold 'em poker game that captures the look, excitement and drama of the phenomenon that has captivated America. The game features a comprehensive poker school in which the player can receive tips and strategies from Daniel Negreanu (2004 ESPN Player of the Year, World Poker Tour Player of the Year)who will teach everything from the fundamentals of Hold 'em to advanced tournament strategies through full motion video, voiceovers and dynamic in-game features. As players progress through the game's career mode, they can apply Daniel's teachings to overcome some of poker's most renowned stars, including Josh Arieh, Jennifer Harman, Erick Lindgren, Carlos Mortenson, Evelyn Ng and David Williams. The Poki Artificial Intelligence system utilized in Stacked adapts its tactics in real-time to exploit the user's playing style, detecting tendencies and deploying appropriate counter-strategies to deliver a challenging and authentic experience. Gamers can organize a casual game with friends or compete to qualify for sanctioned multi-table tournaments. [Myelin Media]… Expand"}, {"name": "Tokyo Xtreme Racer 3", "details_link": "https://www.metacritic.com/game/playstation-2/tokyo-xtreme-racer-3", "publisher": "Crave", "release_date": "Nov 18 2003", "developers": ["Genki"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 63, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/dab755e1a067b6db31d5ffc0a98b0180-98.jpg", "descriptions": "For the first time in the series' history, TXR3 uses real cars licensed from Japanese, North American and European car manufacturers. Over 15 different licensed car manufacturers such as Nissan, Toyota, GM, Ford, Mercedes-Benz and Volkswagen. 200 miles of faithfully re-created roads, made toFor the first time in the series' history, TXR3 uses real cars licensed from Japanese, North American and European car manufacturers. Over 15 different licensed car manufacturers such as Nissan, Toyota, GM, Ford, Mercedes-Benz and Volkswagen. 200 miles of faithfully re-created roads, made to look and feel just like the real roads of Japan. Massive upgrade to the physics engine, special effects, graphical editors, weather conditions, courses, textures, lighting, menus, options, car tuning features, and rival characters. Over 600 rivals to challenge on the highways. An awesome level of car tuning options allows you to adjust just about every car body part and car performance aspect. Modify your car with custom parts from such manufacturers as Hart, Riverside and Yokohama. [Crave Entertainment]… Expand"}, {"name": "Altered Beast: Guardian of the Realms", "details_link": "https://www.metacritic.com/game/game-boy-advance/altered-beast-guardian-of-the-realms", "publisher": "THQ", "release_date": "Nov 23 2002", "developers": ["3d6 Games"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/ac9bdec9e98fe431d0c1b86fd7fdc2e8-98.jpg", "descriptions": "Zeus, creator and ruler of the guardians of the gates, raises you from your grave! To this end you must go forth and defeat a new, unknown evil that has been ravaging the universe to collect the keys and essence of each world."}, {"name": "Top Gun: Combat Zones", "details_link": "https://www.metacritic.com/game/playstation-2/top-gun-combat-zones", "publisher": "Titus Software", "release_date": "Oct 21 2001", "developers": ["Titus Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 63, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/9/7be80e8a2cd38a92d8fa5646fda6f8b9-98.jpg", "descriptions": "Puts you in the cockpits of eight fighter jets, including the F-18 Hornet, F-14 Tomcat, and the F-22 Raptor. Fly 36 missions in three major areas: the Persian Gulf, Asia, and Russian Arctic. Choose from three difficulty settings and learn the ropes in the training session, or take off on aPuts you in the cockpits of eight fighter jets, including the F-18 Hornet, F-14 Tomcat, and the F-22 Raptor. Fly 36 missions in three major areas: the Persian Gulf, Asia, and Russian Arctic. Choose from three difficulty settings and learn the ropes in the training session, or take off on a customized mission with the Quick Start option. [Titus]… Expand"}, {"name": "The Weakest Link", "details_link": "https://www.metacritic.com/game/playstation/the-weakest-link", "publisher": "Activision", "release_date": "Sep 24 2001", "developers": ["Activision", "Traveller's Tales"], "platforms": ["PC", "PlayStation"], "genres": ["Miscellaneous", "Trivia / Game Show"], "meta_score": 63, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/ab486901ae64d798045cb747b6d8b343-98.jpg", "descriptions": "Activision's version of The Weakest Link attempts to capture every element of the popular British game show."}, {"name": "Clive Barker's Jericho", "details_link": "https://www.metacritic.com/game/pc/clive-barkers-jericho", "publisher": "Codemasters", "release_date": "Oct 23 2007", "developers": ["Mercury Steam", "Alchemic Productions"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/1ed0702fe64feacb9826b7deb934791b-98.jpg", "descriptions": "An unflinching realisation of a Clive Barker nightmare for next-gen console platforms and PC, Clive Barker's Jericho is a supernatural horror concept with story by the master mythmaker, novelist and filmmaker Clive Barker. Jericho deals with the mysterious reappearance of a lost city in aAn unflinching realisation of a Clive Barker nightmare for next-gen console platforms and PC, Clive Barker's Jericho is a supernatural horror concept with story by the master mythmaker, novelist and filmmaker Clive Barker. Jericho deals with the mysterious reappearance of a lost city in a remote desert. When a form of evil that goes right back to the dawn of days resurfaces from there, a Special Forces squad, trained in both conventional warfare and the arcane arts, is sent in. Their mission: Hunt down and destroy the evil that lurks at the heart of the city before it destroys humanity. Jericho is designed as an action horror title that ups the stakes in visuals and phantasmagorical special effects. Mingling the darkest elements of Barker’s horror fiction and films with an ambitious, age-spanning story, aimed at mature gamers, fans of Clive Barker and horror fiction enthusiasts. [Codemasters]… Expand"}, {"name": "WTF: Work Time Fun", "details_link": "https://www.metacritic.com/game/psp/wtf-work-time-fun", "publisher": "D3Publisher", "release_date": "Oct 17 2006", "developers": ["SCEJ"], "platforms": "PSP", "num_players": "Up to 8 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Party / Minigame", "General"], "meta_score": 63, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/eb123e3b5ac92095194689afeca99230-98.jpg", "descriptions": "WTF is a crazy collection of fun and addictive mini-games that drive the player to perform sometimes trivial, sometimes mind-bending, but always fun jobs in pursuit of the almighty dollar. Players spend their well-earned money in the prize-vending machines on new jobs/games, trinkets and forWTF is a crazy collection of fun and addictive mini-games that drive the player to perform sometimes trivial, sometimes mind-bending, but always fun jobs in pursuit of the almighty dollar. Players spend their well-earned money in the prize-vending machines on new jobs/games, trinkets and for the first time ever on the PSP system, tools to use in the \"real world\" such as the World Clock, Ramen Timer, and Flashlight. After players have spent their money, they head back to \"work\" so they can earn more money to buy more stuff - much like \"real life\" but much more fun.  Single Player or Multiplayer Gameplay Modes – Play through the game solo, or with your friends in 5 multiplayer mini-games using wireless ad hoc mode. [D3 Publisher of America]… Expand"}, {"name": "Fire Emblem: Shadow Dragon & the Blade of Light", "details_link": "https://www.metacritic.com/game/switch/fire-emblem-shadow-dragon-the-blade-of-light", "publisher": "Nintendo", "release_date": "Dec  4 2020", "developers": ["Intelligent Systems"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 63, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/9594292b9290e1f7fb5dfd049f132722-98.jpg", "descriptions": "Play the Famicom classic that started the Fire Emblem™ legacy—localized for the first time. Meet Marth and recruit some of the most beloved Fire Emblem characters in their 8-bit glory as you play through all 25 chapters of this classic Famicom tactical role-playing game, localized andPlay the Famicom classic that started the Fire Emblem™ legacy—localized for the first time. Meet Marth and recruit some of the most beloved Fire Emblem characters in their 8-bit glory as you play through all 25 chapters of this classic Famicom tactical role-playing game, localized and released for the first time in North America—for a limited time. From defending the kingdom of Talys to facing off against the titular Shadow Dragon, this scrappy hero must be poised to take on any challenge. Luckily, he has a capable group of allies at his side: Tiki, Minerva, the Whitewing Sisters, and more. See Marth’s humble beginnings from a refugee in Talys to the hero of Archanea!\r… Expand"}, {"name": "Outlaw Golf 2", "details_link": "https://www.metacritic.com/game/playstation-2/outlaw-golf-2", "publisher": "Global Star Software", "release_date": "Nov 25 2004", "developers": ["Hypnotix"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/ff5abd9e069a8bfbeffc52edf638f501-98.jpg", "descriptions": "The shameless bunch from the Outlaw series returns to the repressed world of golf with their outrageously twisted antics. Bodacious babes and deviant dudes take to the course and give a whole new meaning to ?playing from the rough.? Anyone and everyone can grab some balls and spin, hook andThe shameless bunch from the Outlaw series returns to the repressed world of golf with their outrageously twisted antics. Bodacious babes and deviant dudes take to the course and give a whole new meaning to ?playing from the rough.? Anyone and everyone can grab some balls and spin, hook and slice their way into the action online, where a state-of-the-art golf engine and 10 over-the-top characters turn boring old golf into a rowdy and tasteless display of uninhibited fun.… Expand"}, {"name": "FIFA Street 2", "details_link": "https://www.metacritic.com/game/gamecube/fifa-street-2", "publisher": "EA Sports Big", "release_date": "Feb 28 2006", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 63, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/599d9e70e429ddcc588deb8627795cbf-98.jpg", "descriptions": "FIFA Street 2 is second installment in EA's four-on-four soccer game. FIFA Street 2 will feature improved controls, many more tricks, and a new juggle mechanic. Take part in game modes, such as friendly, rule the street, and skills challenge. Choose from 20 national teams and 300-plusFIFA Street 2 is second installment in EA's four-on-four soccer game. FIFA Street 2 will feature improved controls, many more tricks, and a new juggle mechanic. Take part in game modes, such as friendly, rule the street, and skills challenge. Choose from 20 national teams and 300-plus real-life soccer stars. There are 10 playable venues ranging from London's Westway Leisure Center to the sandy beaches of Brazil. … Expand"}, {"name": "Castlevania: Lords of Shadow 2", "details_link": "https://www.metacritic.com/game/playstation-3/castlevania-lords-of-shadow-2", "publisher": "Konami", "release_date": "Feb 25 2014", "developers": ["Mercury Steam"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General", "Fantasy"], "meta_score": 63, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/ab87d95d0ced46bd7326ba5fc2b9060d-98.jpg", "descriptions": "In Castlevania: Lords of Shadow, the origin of Dracula and his legendary connection with the Belmonts was revealed. In Castlevania: Lords of Shadow 2, fans can expect thrilling new twists and challenges. In this shocking conclusion to the Lords of Shadow saga, Dracula returns once again,In Castlevania: Lords of Shadow, the origin of Dracula and his legendary connection with the Belmonts was revealed. In Castlevania: Lords of Shadow 2, fans can expect thrilling new twists and challenges. In this shocking conclusion to the Lords of Shadow saga, Dracula returns once again, weakened and yearning for release from his immortal bonds. Facing a new and powerful threat, the vampire lord must reacquire his old powers – and only his castle holds the key. However, the famed Belmont clan also seek his ultimate destruction.… Expand"}, {"name": "Sonic: Lost World", "details_link": "https://www.metacritic.com/game/wii-u/sonic-lost-world", "publisher": "Sega", "release_date": "Oct 29 2013", "developers": ["Sonic Team"], "platforms": ["3DS", "PC", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/6790a1ceb07ed71d644db7f1b2e5b97e-98.jpg", "descriptions": "When the Deadly Six threaten to annihilate his world, Sonic's new moves and power-ups are the only way to defeat them before it is too late. In his latest plan to defeat Sonic and rule the world, Dr. Eggman has harnessed the power of 6 menacing creatures known as the Deadly Six. However,When the Deadly Six threaten to annihilate his world, Sonic's new moves and power-ups are the only way to defeat them before it is too late. In his latest plan to defeat Sonic and rule the world, Dr. Eggman has harnessed the power of 6 menacing creatures known as the Deadly Six. However, when the Deadly Six rise up against their new master, Sonic must unite with his arch nemesis Eggman and explore the mystical Lost Hex in order to take them on head-to-head. Use Sonic's unique new moves and incredible Color Powers to speed across a variety of unique terrains, racing inside, outside and upside down in every level. [Sega]… Expand"}, {"name": "SimCity Societies", "details_link": "https://www.metacritic.com/game/pc/simcity-societies", "publisher": "Electronic Arts", "release_date": "Nov 13 2007", "developers": ["Tilted Mill"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "City Building", "Management", "Modern", "Modern", "Government"], "meta_score": 63, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/0/46c6cb53dd6c955703d516c996913925-98.jpg", "descriptions": "Featuring an all-new, revolutionary feature set, SimCity Societies allows players to construct not only the cities they desire, but create their cultures, societal behaviors and environments as well. Build an artistic city, haunted town, green city, spiritual community or most any societyFeaturing an all-new, revolutionary feature set, SimCity Societies allows players to construct not only the cities they desire, but create their cultures, societal behaviors and environments as well. Build an artistic city, haunted town, green city, spiritual community or most any society you want! Using the accessible, innovative and versatile city-builder, players can create their own kind of city in SimCity Societies. [Electronic Arts]… Expand"}, {"name": "Undead Knights", "details_link": "https://www.metacritic.com/game/psp/undead-knights", "publisher": "Tecmo", "release_date": "Sep 29 2009", "developers": ["Now Production"], "platforms": "PSP", "num_players": "4  Online", "genres": ["Action", "Action Adventure", "Horror", "Horror", "Beat-'Em-Up", "Survival", "3D"], "meta_score": 63, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/84f8ec6eb7ee1ecfd0bef01f63edaf6e-98.jpg", "descriptions": "Playing as the anti-hero, rage through the wrath of fearless enemies and build the nastiest and most profane army you can think of in this new-style invasion action game. Prepare to wash the mouth of your army with soap as they can't help but engage in zombie bashing dialogue over a ragingPlaying as the anti-hero, rage through the wrath of fearless enemies and build the nastiest and most profane army you can think of in this new-style invasion action game. Prepare to wash the mouth of your army with soap as they can't help but engage in zombie bashing dialogue over a raging metal soundtrack that helps your channel your inner anger. If you can deal with the gut-wrenching, Smack-talking, fluid-spitting, and limb amputating ways of your army, you can embark on your journey of vengeance to defeat the king. The Dark Hero Persona: This game atypically allows you to be the \"evil\" main character serving as an anti-hero figure. Create a Zombie Army: Defeat as many enemies as you can to transform them into your own personal soldiers. Combo Attacks: Choose up to ten different combo attacks to fight your way through varied enemies ranging from animals to soldiers. Show Some Personality: Prepare to wash the mouth of your army with soap as they can't help but engage in zombie bashing dialogue. Head-Banging Madness: A raging metal soundtrack helps channel your inner anger. On a Mission: Get ready to face the king in the fifth mission for each of the four main areas. Ad-Hoc Multiplayer: Challenge up to three other players in VS play or collaborate with them in co-op play. [Tecmo]… Expand"}, {"name": "Miami Vice: The Game", "details_link": "https://www.metacritic.com/game/psp/miami-vice-the-game", "publisher": "Sierra Entertainment", "release_date": "Jul 18 2006", "developers": ["Rebellion"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 63, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/3d4c09817b11efa8f8cf9d4e88e581e3-98.jpg", "descriptions": "In Miami Vice: The Game, players follow a storyline set just before the events of the film. Gamers must build up the nefarious reputation necessary to infiltrate the seedy underbelly of South Beach, and ultimately bring down the organization of an \"untouchable\" South American drug lord.In Miami Vice: The Game, players follow a storyline set just before the events of the film. Gamers must build up the nefarious reputation necessary to infiltrate the seedy underbelly of South Beach, and ultimately bring down the organization of an \"untouchable\" South American drug lord.  Play as undercover cops Crockett and Tubbs in the notorious world of Miami Vice -- the mansions, the money, and the mayhem -- set in present-day Miami. Experience cutting-edge motion capture, highly-detailed environments, and lighting effects inspired by the film created to maximize the technology of the PSP system. Play as partners with wireless action. Drug Trading – Raise needed capital and build reputation by managing drug inventory. Hacking – Unlock sensitive information (security codes, locations, etc.) Interactive Cutscene Encounters (ICE) – Continue to boost reputation through dramatic interactive cinematic encounters with powerful drug lords. Establish rep as a major player in the narcotics world through contraband trading, aggressively interacting with drug barons, and pursuing criminals with reckless abandon. Armed with intelligence from informants and utilizing hacking skills, take on the enemy in varied locations with an impressive array of weapons. Experience high-speed chases through Miami’s treacherous waterways while engaging in boat-to-boat shootouts. [Sierra]… Expand"}, {"name": "Puzzle Kingdoms", "details_link": "https://www.metacritic.com/game/wii/puzzle-kingdoms", "publisher": "Zoo Games", "release_date": "May 19 2009", "developers": ["Infinite Interactive"], "platforms": ["PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Matching", "General"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/06173bd9938abd7797380f9ac8adb2d4-98.jpg", "descriptions": "From the acclaimed designer of Puzzle Quest, Steve Fawkner of Infinite Interactive, comes Puzzle Kingdoms. Deep, classic turn based empire gameplay tells an incredible story. Instead of auto-resolved conflict, a unique puzzle mechanic makes each battle unique and addictive. [Zoo Games]"}, {"name": "Hasbro Family Game Night", "details_link": "https://www.metacritic.com/game/wii/hasbro-family-game-night", "publisher": "Electronic Arts", "release_date": "Nov 11 2008", "developers": ["EA Bright Light"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/0c138bab2fa78fe9ce7a4c15502cc0f6-98.jpg", "descriptions": "Join your host MR. POTATO HEAD for fun and games with family and friends including: BATTLESHIP, YAHTZEE, BOGGLE, CONNECT FOUR, SORRY! and the all new, SORRY! Sliders. With the HASBRO FAMILY GAME NIGHT digital experience, families can enjoy familiar classic Hasbro board games or throw in aJoin your host MR. POTATO HEAD for fun and games with family and friends including: BATTLESHIP, YAHTZEE, BOGGLE, CONNECT FOUR, SORRY! and the all new, SORRY! Sliders. With the HASBRO FAMILY GAME NIGHT digital experience, families can enjoy familiar classic Hasbro board games or throw in a fun spin with new versions like CONNECT FOUR Power Chips, BOGGLE Portal Cubes, Reverse YAHTZEE and BATTLESHIP Barrage – which add fresh dimensions and challenges to these legendary favorites.  Play with up to four people in YAHTZEE, BOGGLE, SORRY! and SORRY! Sliders or up to two players in CONNECT FOUR and BATTLESHIP. Players can deck out their very own distinctive digital game room in HASBRO FAMILY GAME NIGHT by choosing a setting and adding earned trophies, cool furniture and decorations all themed to their favorite games.  Not only can players customize where they play, but also how they play.  HASBRO FAMILY GAME NIGHT features a party mode that gives players the option to build a custom party game by choosing their desired game(s), number of players and setting a time limit.  Party mode mini-game challenges include Match the Pattern, Shake for Words and Bomb Run. [Electronic Arts]… Expand"}, {"name": "Final Fantasy II", "details_link": "https://www.metacritic.com/game/psp/final-fantasy-ii", "publisher": "Square Enix", "release_date": "Jul 24 2007", "developers": ["TOSE"], "platforms": ["iPhone/iPad", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/5c3bd3fdfa652c430127fc3c6bc11b61-98.jpg", "descriptions": "In FINAL FANTASY II, a malevolent emperor has called upon monsters from a demonic realm to take over the world, ending what seemed to be an eternal period of peace. Thousands of lives succumb to their attacks, leaving many children orphaned. From the destruction rise four young survivors whoIn FINAL FANTASY II, a malevolent emperor has called upon monsters from a demonic realm to take over the world, ending what seemed to be an eternal period of peace. Thousands of lives succumb to their attacks, leaving many children orphaned. From the destruction rise four young survivors who will take it upon themselves to stop the merciless ruler and avenge the death of their parents. This all-new anniversary edition contain the best treatment of the classic RPG and features all-new character art, updated graphics, new dungeons, full 16:9 widescreen presentation and an updated camera view that gives players a new vantage point. [Square Enix]… Expand"}, {"name": "Stifled", "details_link": "https://www.metacritic.com/game/playstation-4/stifled", "publisher": "Gattai Games", "release_date": "Oct 31 2017", "developers": ["Gattai Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 63, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/c51ea7f82965f6b6e453b5c38b240799-98.jpg", "descriptions": null}, {"name": "Exile's End", "details_link": "https://www.metacritic.com/game/playstation-4/exiles-end", "publisher": "XSEED Games", "release_date": "Oct 25 2016", "developers": ["MagneticRealms"], "platforms": ["PC", "PlayStation Vita", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 63, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/c15760be634ec3b3e234df8ac7ddf3c2-98.jpg", "descriptions": "When the scion of the most powerful corporation in the galaxy goes missing on a remote mining planet, a team of mercenaries is dispatched to investigate. Among them is Jameson, an old soldier with a dark past. Inspired by early ’90s “cinematic platformers,’ Exile’s End plays out as anWhen the scion of the most powerful corporation in the galaxy goes missing on a remote mining planet, a team of mercenaries is dispatched to investigate. Among them is Jameson, an old soldier with a dark past. Inspired by early ’90s “cinematic platformers,’ Exile’s End plays out as an exploration-driven side-scrolling adventure through a massive mining complex on a moody, lonely alien world. [Playstation.com]… Expand"}, {"name": "Salary Man Escape VR", "details_link": "https://www.metacritic.com/game/playstation-4/salary-man-escape-vr", "publisher": "Sony Interactive Entertainment", "release_date": "Jun 26 2018", "developers": ["Sony Interactive Entertainment", "Red Accent Studios"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 63, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/88e06c91de7aa3be4aa3d7e6ad509b86-98.jpg", "descriptions": "Salary Man Escape is an edgy, satirical VR physics puzzle game where the player must use skill and tact to help a disgruntled Salaryman escape his life."}, {"name": "The Raven: Legacy of a Master Thief - Ancestry of Lies", "details_link": "https://www.metacritic.com/game/pc/the-raven-legacy-of-a-master-thief---ancestry-of-lies", "publisher": "The Adventure Company", "release_date": "Aug 27 2013", "developers": ["KING Art"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 63, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/09ab505bb85af07173948291965721eb-98.jpg", "descriptions": "Ancestry of Lies immerses players in the classic ‘Whodunnit’ part of the story. Who has stolen the ‘Eye of the Sphinx’? Who shot the Baroness? Was it the Doctor? Is The Raven back?"}, {"name": "Through the Woods", "details_link": "https://www.metacritic.com/game/pc/through-the-woods", "publisher": "Antagonist", "release_date": "Oct 27 2016", "developers": ["Antagonist"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action Adventure", "Survival"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/d10712a548a2a9d90cb5786050ef1bf3-98.jpg", "descriptions": "Through the Woods is a third-person Norse horror adventure set in a forest on the western shores of Norway that tells the story of a mother and her missing son."}, {"name": "Gemini: Heroes Reborn", "details_link": "https://www.metacritic.com/game/xbox-one/gemini-heroes-reborn", "publisher": "Imperative Entertainment", "release_date": "Jan 19 2016", "developers": ["Phosphor Games Studio", "LLC", "Phosphor Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "Linear"], "meta_score": 63, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/ebee276f42e93c8ccccc04aa06898b4b-98.jpg", "descriptions": "Gemini is a first person action-adventure that allows users to enter into the role of Cassandra, age 20. She is a young woman on a journey of discovery in which she will unlock incredible powers - unique in the Heroes Universe - and solve a mystery in her past. She will be reunited with herGemini is a first person action-adventure that allows users to enter into the role of Cassandra, age 20. She is a young woman on a journey of discovery in which she will unlock incredible powers - unique in the Heroes Universe - and solve a mystery in her past. She will be reunited with her long missing family, but not in the way she ever expected.… Expand"}, {"name": "The Order: 1886", "details_link": "https://www.metacritic.com/game/playstation-4/the-order-1886", "publisher": "SCEA", "release_date": "Feb 20 2015", "developers": ["Ready at Dawn", "SCE Santa Monica"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["General", "General", "Action", "Action Adventure", "Shooter", "Linear", "Third-Person", "Sci-Fi", "Arcade"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/7e3a1424ea06cbaeb7dda2eb639c53fb-98.jpg", "descriptions": "The Order: 1886 introduces us to a unique vision of Victorian-Era London in which Man uses advanced technology to battle a powerful and ancient enemy.  As Galahad, a member of an elite order of Knights, join a centuries-old war against a powerful threat that will determine the course ofThe Order: 1886 introduces us to a unique vision of Victorian-Era London in which Man uses advanced technology to battle a powerful and ancient enemy.  As Galahad, a member of an elite order of Knights, join a centuries-old war against a powerful threat that will determine the course of history in this third-person action-adventure shooter.… Expand"}, {"name": "Windbound", "details_link": "https://www.metacritic.com/game/switch/windbound", "publisher": "Deep Silver", "release_date": "Aug 28 2020", "developers": ["5 Lives Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/4c5b9fb40761990eddcc31fa1f1ae7f1-98.jpg", "descriptions": "Embark on a personal journey and discover the history of the idyllic forbidden islands; each holding the key to a mystery and unexpected revelations. Head towards the horizon, advancing across the islands, each with their own wildlife, landscapes and challenges to face. Scavenge the island'sEmbark on a personal journey and discover the history of the idyllic forbidden islands; each holding the key to a mystery and unexpected revelations. Head towards the horizon, advancing across the islands, each with their own wildlife, landscapes and challenges to face. Scavenge the island's untamed terrain for resources that you can use to craft a full range of tools and weapons to hunt wildlife and upgrade your boat. You must set sail when resources become scarce. Your boat is your key companion on this journey, carefully craft your own custom sailing vessel to take on the treacherous waters, traversing from one island to the next.… Expand"}, {"name": "Travis Strikes Again: No More Heroes - Complete Edition", "details_link": "https://www.metacritic.com/game/playstation-4/travis-strikes-again-no-more-heroes---complete-edition", "publisher": "Marvelous Inc.", "release_date": "Oct 17 2019", "developers": ["Grasshopper Manufacture"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 63, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/634e960e310c2d22d68ef4a649b89bdc-98.jpg", "descriptions": "Seven years have passed since the events of No More Heroes, and The Bad is determined to exact his revenge on Travis Touchdown. Just like the original cult classic, players will have to battle through multiple punk-rock levels and defeat over-the-top bosses."}, {"name": "Stronghold 2", "details_link": "https://www.metacritic.com/game/pc/stronghold-2", "publisher": "2K Games", "release_date": "Apr 18 2005", "developers": ["FireFly Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/c89818ee9e8b907af6e58e1f510834b9-98.jpg", "descriptions": "The castle-sim and siege-warfare RTS game Stronghold, the sequel to the award-winning titles Stronghold and Stronghold: Crusader, brings the series to life in glorious 3D. Stronghold 2 also offers players a \"castle-life\" campaign, enhanced multiplayer capability and a new, innovative andThe castle-sim and siege-warfare RTS game Stronghold, the sequel to the award-winning titles Stronghold and Stronghold: Crusader, brings the series to life in glorious 3D. Stronghold 2 also offers players a \"castle-life\" campaign, enhanced multiplayer capability and a new, innovative and exciting single player campaign. [Global Star Software]… Expand"}, {"name": "Obscure", "details_link": "https://www.metacritic.com/game/pc/obscure", "publisher": "DreamCatcher Interactive", "release_date": "Apr  6 2005", "developers": ["Hydravision"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 63, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/cdcd1701551812d7384e59439941b748-98.jpg", "descriptions": "As many highschools, Leafmore High is no longer the highschool it used to be. Its walls are mouldering, its books are outdated, its teachers have lost their faith... Following the disappearance of one of their friends, a group of students decide to investigate their high school. This braveAs many highschools, Leafmore High is no longer the highschool it used to be. Its walls are mouldering, its books are outdated, its teachers have lost their faith... Following the disappearance of one of their friends, a group of students decide to investigate their high school. This brave step will lead them into a hell they will never forget. But, no matter what happens, they must stick together if they want to throw light on the dark and sordid history of their school. Play five different students, alone or in cooperation, every one of them having their own special aptitude, and use them wisely to defeat the monsters creeping around. [Hydravision]… Expand"}, {"name": "Total War: Rome II - Caesar in Gaul", "details_link": "https://www.metacritic.com/game/pc/total-war-rome-ii---caesar-in-gaul", "publisher": "Sega", "release_date": "Dec 12 2013", "developers": ["Creative Assembly"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General", "Historic"], "meta_score": 63, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/2b32abf15f8847367587ad7cc73a1125-98.jpg", "descriptions": null}, {"name": "Let's Catch", "details_link": "https://www.metacritic.com/game/wii/lets-catch", "publisher": "Sega", "release_date": "Jun 15 2009", "developers": ["Prope"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "General", "General"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/5caef8ec4ea20d08aa982737f405389b-98.jpg", "descriptions": "[WiiWare]  Play catch with friends in multiplayer party games and compete for high scores using your Mii™ character and others. Choose from six different single and multiplayer modes such as Speed Catch, which tests your ability to catch a fastball, and Bomb Catch, an elimination party game[WiiWare]  Play catch with friends in multiplayer party games and compete for high scores using your Mii™ character and others. Choose from six different single and multiplayer modes such as Speed Catch, which tests your ability to catch a fastball, and Bomb Catch, an elimination party game for up to four players. Select from a variety of characters or use your Mii character to play other favorite catch games. Unlock special features when you own both Let's TAP and Let's CATCH. [Nintendo]… Expand"}, {"name": "NBA 06", "details_link": "https://www.metacritic.com/game/playstation-2/nba-06", "publisher": "SCEA Sports Studio", "release_date": "Nov  1 2005", "developers": ["SCEA Sports Studio"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 63, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/ab81334ae07864813f4eec592a4db2b9-98.jpg", "descriptions": "NBA '06 introduces a completely new insider look with \"NBA Life: Volume 1.\"  Players have the opportunity to go through an entire season with all of the emotional ups and downs, team politics and off-court activities, such as trades, press conferences and endorsement deals that every up andNBA '06 introduces a completely new insider look with \"NBA Life: Volume 1.\"  Players have the opportunity to go through an entire season with all of the emotional ups and downs, team politics and off-court activities, such as trades, press conferences and endorsement deals that every up and coming NBA player must handle.  Each player can take a different path to progress through the league, setting up countless ways for gamers to develop a player and experience the  real NBA life. NBA '06 introduces the all-new \"Showtime Gameplay\" feature that provides gamers with the opportunity to achieve the delicate balance between team versus individual skills, performance and goals. From knowing how to excite a temperamental crowd with incredible moves, to learning when to pass in order to keep your teammates in the game, Showtime  Gameplay incorporates an enhanced Artificial Intelligence system that ultimately influence player and teammate attributes, as well as crowd support.  \rAnd for the first time in an NBA videogame, gamers have the opportunity to feel what it's really like to be on the floor as first-person perspective is merged with third-person playability. In addition, NBA '06 will include more than a dozen mini-games with exclusives like PlayStation Skills Challenge and classics such as \"HORSE,\" \"21,\" and \"1-on-1,\" as well as a host of brand new games for players to test their skills in single-player, vs., or online. [Sony]… Expand"}, {"name": "Firefighter F.D. 18", "details_link": "https://www.metacritic.com/game/playstation-2/firefighter-fd-18", "publisher": "Konami", "release_date": "Mar  9 2004", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 63, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/86874854dc2d6690c9cecaa1c4c1fb2a-98.jpg", "descriptions": "Experience all the excitement and danger of fighting blazing fires in Firefighter F.D.18. As a firefighter, break down doors with axes, use high-powered fire hoses to smother flames, and avoid collapsing floors while looking for trapped civilians. Firefighter F.D. 18 pushes theExperience all the excitement and danger of fighting blazing fires in Firefighter F.D.18. As a firefighter, break down doors with axes, use high-powered fire hoses to smother flames, and avoid collapsing floors while looking for trapped civilians. Firefighter F.D. 18 pushes the PlayStation2's graphic capabilities to its limits and captures all the realism and experiences of real life firefighters. The most realistic firefighting experience ever in a video game. Fight infernos with water hoses, fire extinguishers, and other equipment. Realistic depictions of fire, including backdrafts and chemical explosions. A rich story that revolves around the themes of love and justice. [Konami]… Expand"}, {"name": "Vexx", "details_link": "https://www.metacritic.com/game/playstation-2/vexx", "publisher": "Acclaim", "release_date": "Feb 11 2003", "developers": ["Acclaim Studios Austin"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 63, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/ad83b88fd17c4b3c06a1c686cf8e4679-98.jpg", "descriptions": "On the forsaken remains of what was once the proud planet called Astara, the villagers of Rockhaven lead difficult but peaceful lives, until the day the Shadowraith, \"Dark Yabu,\" and his minions swept down from the sky. With terrible ferocity and ruthless efficiency they descended upon theOn the forsaken remains of what was once the proud planet called Astara, the villagers of Rockhaven lead difficult but peaceful lives, until the day the Shadowraith, \"Dark Yabu,\" and his minions swept down from the sky. With terrible ferocity and ruthless efficiency they descended upon the townsfolk, enslaving them to work deep in the caves that surrounded their village. Dark Yabu murdered the grandfather of the young VEXX, who managed to slip quietly aboard the enemy's windship. There, locked deep within Yabu's sanctum, was the last pair of Astani Battlegauntlets, which leapt from their chest onto VEXX's outstretched hands, and bonded to his arms and giving him special powers. [Acclaim]… Expand"}, {"name": "Rayman Arena", "details_link": "https://www.metacritic.com/game/playstation-2/rayman-arena", "publisher": "Ubisoft", "release_date": "Sep 24 2002", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "On-foot"], "meta_score": 63, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/762784393ab9a63e4e3734c9c9e0cb8f-98.jpg", "descriptions": "Rayman's world kicks into multiplayer overdrive in this total competition crash course with the cast of Rayman 2. Smoke the competition on mind-bending racecourses, or spark up a lum-flinging firefight in the battle arena. And with 8 characters, 24 maps and up to 4 combatants, now Rayman'sRayman's world kicks into multiplayer overdrive in this total competition crash course with the cast of Rayman 2. Smoke the competition on mind-bending racecourses, or spark up a lum-flinging firefight in the battle arena. And with 8 characters, 24 maps and up to 4 combatants, now Rayman's got more ways to reign supreme than ever. [Ubi Soft]… Expand"}, {"name": "Star Wars: Demolition", "details_link": "https://www.metacritic.com/game/playstation/star-wars-demolition", "publisher": "LucasArts", "release_date": "Nov 12 2000", "developers": ["Luxoflux", "Inc."], "platforms": ["PlayStation 4", "PlayStation 5", "PlayStation"], "genres": ["Driving", "Car Combat"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/6b7e15ac7e220f35588e110f72e4937c-98.jpg", "descriptions": "Star Wars Demolition might seem like some half-baked attempt to cash in on the Star Wars license, though it's actually a competently executed game."}, {"name": "Silent Scope", "details_link": "https://www.metacritic.com/game/dreamcast/silent-scope", "publisher": "Konami", "release_date": "Oct 23 2000", "developers": ["Konami"], "platforms": ["iPhone/iPad", "PlayStation 2", "Dreamcast"], "genres": ["Action", "Shooter", "Rail"], "meta_score": 63, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/f8b79dfde2024969ea994eb253757cd0-98.jpg", "descriptions": "Get ready to experience the arcade hit on your Dreamcast. The President and his family have been kidnapped by lethal terrorists, and the government turns to an elite counter-terrorist sniper to neutralize the hostile threats. Your mission is to infiltrate the terrorist's headquarters, clearGet ready to experience the arcade hit on your Dreamcast. The President and his family have been kidnapped by lethal terrorists, and the government turns to an elite counter-terrorist sniper to neutralize the hostile threats. Your mission is to infiltrate the terrorist's headquarters, clear all areas of danger and return the President's family safely to the White House.… Expand"}, {"name": "Traitors Gate", "details_link": "https://www.metacritic.com/game/pc/traitors-gate", "publisher": "DreamCatcher Interactive", "release_date": "Apr 30 2000", "developers": ["Daydream Software"], "platforms": "PC", "genres": ["Adventure", "General", "General"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/a586a1ab6e921e89462ae9ec663eeb6d-98.jpg", "descriptions": "You'll need to learn lock picking, security-code deciphering, and computer hacking; it's like job training, albeit for what seems like a really, really fun job."}, {"name": "Crash 'N' Burn", "details_link": "https://www.metacritic.com/game/playstation-2/crash-n-burn", "publisher": "Eidos Interactive", "release_date": "Nov 15 2004", "developers": ["Climax Group"], "platforms": "PlayStation 2", "num_players": "16  Online", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 63, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/1dc58507111e14414a21f8fb9d107404-98.jpg", "descriptions": "Choose your car. Paint it, polish it, and personalize it. Build it up with new components, giant spoilers and reinforced fenders. Supercharge it. Fill it with nitrous. Take it to circuits in the back streets of Miami, San Francisco, LA and New York. You're at the back of the pack, gridChoose your car. Paint it, polish it, and personalize it. Build it up with new components, giant spoilers and reinforced fenders. Supercharge it. Fill it with nitrous. Take it to circuits in the back streets of Miami, San Francisco, LA and New York. You're at the back of the pack, grid position sixteen. Fifteen cars ahead of you, polished until they gleam. Your primary objective is to take first place. Your secondary objective? Run everyone else off the road. Crunch them into the barrier. Rip, shred and tear sheet metal from their frames, leaving burning engine blocks and melted tires in your wake. The last driver with four wheels wins. Then do it again... Online. Customize and personalize a garage full of cars with everything from paint schemes, to rims & spoilers, to nitrous and more. Cause extreme crashes and dodge on-track wreckage as you engage in high speed, high danger driving through the back streets of Miami, San Francisco, LA and New York. Compete in multiplayer destruction with or against 16 total players online featuring a variety of modes like last-man-standing, bomb tag and more. Replay the mayhem with multi-angle player-controlled cameras set up throughout the courses. [Eidos Interactive]… Expand"}, {"name": "Future Tactics: The Uprising", "details_link": "https://www.metacritic.com/game/gamecube/future-tactics-the-uprising", "publisher": "Crave", "release_date": "May 10 2004", "developers": ["Zed Two Limited"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Sci-Fi"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/910b90b45f8e864bd3c074b57a1712ca-98.jpg", "descriptions": "Welcome to the future--a place where creatures have forced humans to live in squalor, battling their overlords and waxing nostalgic for better days. Now, a young boy named Low, his sister, and a collection of fighters find themselves as mankind's only hope for blasting the creatures back toWelcome to the future--a place where creatures have forced humans to live in squalor, battling their overlords and waxing nostalgic for better days. Now, a young boy named Low, his sister, and a collection of fighters find themselves as mankind's only hope for blasting the creatures back to where they came from. You must guide this ragtag team of survivors through 19 levels of tactical combat while upgrading them with powerful weapons. In Battle mode, you can take on a friend in tactical warfare--complete with customizable handicaps, power-ups, and victory conditions. … Expand"}, {"name": "Dynasty Warriors 7 Empires", "details_link": "https://www.metacritic.com/game/playstation-3/dynasty-warriors-7-empires", "publisher": "Tecmo Koei Games", "release_date": "Feb 26 2013", "developers": ["Omega Force"], "platforms": "PlayStation 3", "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 63, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/a352bac48784c4104b5442a19c5b9bc8-98.jpg", "descriptions": "Dynasty Warriors 7 Empires combines battlefield action with strategic gameplay, giving each player the opportunity to influence the way history unfolds."}, {"name": "Atelier Iris 3: Grand Phantasm", "details_link": "https://www.metacritic.com/game/playstation-2/atelier-iris-3-grand-phantasm", "publisher": "NIS America", "release_date": "May 29 2007", "developers": ["Gust"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/a354d37891b842d213a54ed68f3c81e6-98.jpg", "descriptions": "Long ago, the power of alchemy allowed people to travel between different worlds through dimensional gates; however, with the collapse of the first great civilization, people lost the means to \"jump\" worlds. A long time has passed since the great destruction and now people once again areLong ago, the power of alchemy allowed people to travel between different worlds through dimensional gates; however, with the collapse of the first great civilization, people lost the means to \"jump\" worlds. A long time has passed since the great destruction and now people once again are unlocking the mystery surrounding the dimensional gates and adventuring to unforeseen territory, seeking the magical book of infinite wisdom. With the fast paced ACCB system, battle sequences are ordered by cards that represent the characters' action order. The quicker the character, the faster their action turn comes around. An innovative change for Atelier Iris 3 is the introduction of a symbol encounter system. Players no longer randomly encounter enemies, but visually confirm and engage them. Unlike previous Atelier Iris titles, this game adopts a guild quest system through which players can easily accept quests and missions that the guild posts. [NIS America]… Expand"}, {"name": "Neverwinter Nights: Enhanced Edition", "details_link": "https://www.metacritic.com/game/playstation-4/neverwinter-nights-enhanced-edition", "publisher": "Skybound Games", "release_date": "Dec  3 2019", "developers": ["Beamdog"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 63, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/3/69a2e99cf135cb028f4dc2576896b05d-98.jpg", "descriptions": "Neverwinter Nights: Enhanced Edition adds all-new enhanced features to the playable content of Neverwinter Nights Diamond Edition.Slink through the shadows as a deadly half-elven rogue, wield fearsome magics as a powerful gnomish sorcerer, vanquish your foes as an armor-clad dwarvenNeverwinter Nights: Enhanced Edition adds all-new enhanced features to the playable content of Neverwinter Nights Diamond Edition.Slink through the shadows as a deadly half-elven rogue, wield fearsome magics as a powerful gnomish sorcerer, vanquish your foes as an armor-clad dwarven paladin... whatever hero you create, incredible adventures await.Discover magic, wonder, and danger at every turn on your own or with friends in these classic Dungeons & Dragons adventures.Enhanced Features:- Mobile Play: A new virtual joystick and context sensitive button makes gameplay easy- Improved Display: Featuring a new re-engineered UI for tablet and phone play. Portrait, combat bar, inventory, and other UI elements adjust in size based on device resolution, and can be scaled to your liking.- Advanced Graphics Options: Pixel shaders and post-processing effects make for crisper, cleaner visuals. Enable contrast, vibrance, and depth of field options as preferred.- Community Endorsed: Original developers have teamed with key members of the Neverwinter Nights community to curate important fan-requested improvements to support players, storytellers, and modders. - Backwards Compatibility: Works with save games, modules, and mods from the original Neverwinter Nights. A galaxy of community created content awaits.- Cross-Platform Multiplayer: Experience vast persistent worlds and game online with friends playing on mobile or desktop.All the playable content of Neverwinter Nights Diamond Edition:- The original Neverwinter Nights campaign: Find yourself at the center of intrigue, betrayal, and dark magic in Neverwinter Nights. Journey through dangerous cities, monster filled dungeons and deep into uncharted wilderness in search of the cure for a cursed plague ravaging the city of Neverwinter. Two expansion packs: - Shadows of Undrentide: Another adventure begins in Shadows of Undrentide! Charged by your master to recover four ancient artifacts, travel from the Silver Marches to unravel mysteries of a long-dead magical civilization. - Hordes of the Underdark: Continue the adventure started in Shadows of Undrentide and journey into the ever-more bizarre and hostile depths of Undermountain to challenge a gathering evil.… Expand"}, {"name": "Whispering Willows", "details_link": "https://www.metacritic.com/game/playstation-4/whispering-willows", "publisher": "LOOT Interactive", "release_date": "Jun 30 2015", "developers": ["LOOT Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 63, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/8375fd020e500cd0a7ff94b5fa23e7fa-98.jpg", "descriptions": "In Whispering Willows, the player takes on the role of Elena, a determined young girl with the extraordinary ability to project her spirit outside of her body. In her spectral form, Elena can interact with the benevolent spirits and wicked wraiths that used to dwell within the walls of theIn Whispering Willows, the player takes on the role of Elena, a determined young girl with the extraordinary ability to project her spirit outside of her body. In her spectral form, Elena can interact with the benevolent spirits and wicked wraiths that used to dwell within the walls of the sinister Willows Mansion - lost souls, stuck in time and space, who hold the secrets that Elena will need to traverse the terrifying old manor. Players need to make use of Elenas corporeal and ethereal forms to overcome obstacles, solve the riddles of the mansions enigmatic specters, and find Elenas lost father.… Expand"}, {"name": "Marvel Trading Card Game", "details_link": "https://www.metacritic.com/game/psp/marvel-trading-card-game", "publisher": "Konami", "release_date": "Feb 27 2007", "developers": ["Konami", "Vicious Cycle"], "platforms": ["PC", "PSP"], "num_players": "2  Online", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 63, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/a21e8f87a5afc616e7be17b029258305-98.jpg", "descriptions": "Marvel Trading Card Game features Marvel's complete roster of characters and lets players take their game online like never before with massive sanctioned tournaments, a virtual card shop and interoperability between the PSP system and PC versions of the game. Utilizing the popular Vs.Marvel Trading Card Game features Marvel's complete roster of characters and lets players take their game online like never before with massive sanctioned tournaments, a virtual card shop and interoperability between the PSP system and PC versions of the game. Utilizing the popular Vs. System Trading Card Game from Upper Deck Entertainment, players can learn the basics of the game as a super hero or super villain in the game’s single player campaign mode. [Konami]… Expand"}, {"name": "Super Monkey Ball: Banana Blitz HD", "details_link": "https://www.metacritic.com/game/switch/super-monkey-ball-banana-blitz-hd", "publisher": "Sega", "release_date": "Oct 29 2019", "developers": ["Sega", "Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 63, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/86271f2d9b5ffaba09fced5b267a13bf-98.jpg", "descriptions": "\"Hold onto your bananas, because Super Monkey Ball: Banana Blitz HD is rolling your way! Experience the magic of one of the most beloved titles in the series, now remastered in HD!Head back into the fantastical world of Super Monkey Ball and take back your bananas from the space alien\"Hold onto your bananas, because Super Monkey Ball: Banana Blitz HD is rolling your way! Experience the magic of one of the most beloved titles in the series, now remastered in HD!Head back into the fantastical world of Super Monkey Ball and take back your bananas from the space alien pirate king, Captain Crabuchin. Race through over 100 colorful stages and challenge your friends and family to 10 fan-favorite Party Games! Feeling like the fastest, most maneuverable monkey around? Try out Time Attack mode or the grueling Decathlon endurance run! Will you make it onto the scoreboard?\"… Expand"}, {"name": "Mato Anomalies", "details_link": "https://www.metacritic.com/game/pc/mato-anomalies", "publisher": "Prime Matter", "release_date": "Mar 10 2023", "developers": ["Arrowiz"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/099baa0841181f00f30e531a963fad7f-98.jpg", "descriptions": "Mato Anomalies is a turn-based RPG that takes players on a journey across Mato, a fantasized neo-futuristic version of a bygone oriental city. Take control of the Dual Protagonists Doe and Gram to investigate strange anomalies around the city, or venture into rifts to battle demonicMato Anomalies is a turn-based RPG that takes players on a journey across Mato, a fantasized neo-futuristic version of a bygone oriental city. Take control of the Dual Protagonists Doe and Gram to investigate strange anomalies around the city, or venture into rifts to battle demonic abominations determined to bring about the city's downfall.Team up with unlikely companions and unravel the dark secrets in this story of Duty, Hope and Justice.… Expand"}, {"name": "Torchlight III", "details_link": "https://www.metacritic.com/game/switch/torchlight-iii", "publisher": "Perfect World Entertainment", "release_date": "Oct 22 2020", "developers": ["Echtra Games", "Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/4d3e258d649aa5e60d05cd24931569f1-98.jpg", "descriptions": "It's been a century since the events of Torchlight II, and the Ember Empire is in decline. In Torchlight III, Novastraia is again under threat of invasion and it's up to you to defend against the Netherim and its allies. Gather your wits and brave the frontier to find fame, glory, and newIt's been a century since the events of Torchlight II, and the Ember Empire is in decline. In Torchlight III, Novastraia is again under threat of invasion and it's up to you to defend against the Netherim and its allies. Gather your wits and brave the frontier to find fame, glory, and new adventures!Travel the FrontierExplore the wilderness, party with friends, gather materials to craft gear, or use magic to enter unknown dungeons! There's always something to do in the new frontier.Build & Upgrade Your FortIt's time to rebuild and that includes you! Enjoy your very own fort, where you can upgrade gear and renovate your fort to show off to your friends and the world. Collect Epic GearWhether it's armor, weapons, dyes, recipes, ember cores, or even new pets...there's always more to find as you battle through dungeons and take on dangerous foes. Pets Are BackFight your way to fame and glory with your loyal companion! Add skills and equip them with gear to make them stronger. Each species comes in a myriad of colors and styles, so make sure to collect them all! Build Your HeroWith four unique classes to choose from, players can utilize class-specific mechanics to maximize damage and their odds of survival. Combine epic gear, Relic powers, and class abilities to customize your playstyle.… Expand"}, {"name": "Mosaic", "details_link": "https://www.metacritic.com/game/switch/mosaic", "publisher": "Raw Fury", "release_date": "Jan 23 2020", "developers": ["Krillbite Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/708f6c854cbfac57fae09e5d174d099c-98.jpg", "descriptions": "You live a monotonous and repetitive lonely life in a cold overpopulated ever-expanding city. The phone is distracting you with meaningless notifications as you move through anonymous crowds on your way to work at a megacorporation where yet another long day with overtime awaits. You have noYou live a monotonous and repetitive lonely life in a cold overpopulated ever-expanding city. The phone is distracting you with meaningless notifications as you move through anonymous crowds on your way to work at a megacorporation where yet another long day with overtime awaits. You have no real sense of meaning - until one crucial day, when strange things start to happen on your commute to work and everything changes. \r\rMosaic is a dark surrealistic and atmospheric adventure game about urban isolation and the dread of being a piece in a giant machinery you can’t understand. … Expand"}, {"name": "Fist of Jesus", "details_link": "https://www.metacritic.com/game/pc/fist-of-jesus", "publisher": "KISS Ltd.", "release_date": "Oct 17 2014", "developers": ["Mutant Games"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 63, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/3221d39c0e823ee98dc472f7aae9011e-98.jpg", "descriptions": "Something went awry with Lazarus’ resurrection... help Jesus and Judas to fight the zombie infection using amazing combos, divine punishments and special attacks."}, {"name": "Fatal Inertia EX", "details_link": "https://www.metacritic.com/game/playstation-3/fatal-inertia-ex", "publisher": "Koei", "release_date": "Jun 19 2008", "developers": ["Koei"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Futuristic"], "meta_score": 63, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/9/70815f69bcd19d5c192bed393a9999d7-98.jpg", "descriptions": "(Downloadable game)  Fatal Inertia EX features a never-before-seen environment exclusive to the PS3. Situated amidst scorching desert dunes, the Fatal Inertia Proving Grounds is a mecca for aspiring flight jocks driven to prepare themselves for the mental and physical punishment of(Downloadable game)  Fatal Inertia EX features a never-before-seen environment exclusive to the PS3. Situated amidst scorching desert dunes, the Fatal Inertia Proving Grounds is a mecca for aspiring flight jocks driven to prepare themselves for the mental and physical punishment of low-altitude combat maneuvering. Along with offering a restructured training curriculum, the Proving Grounds are also home to the game's eight new tracks. A re-tuned flight model improves handling and achieves higher speeds than previously seen. The game's newly-added \"Master\" level Quick Races will push the fastest men and women to their limit. Fatal Inertia EX delivers heightened visuals which include new weather effects, significant scenery enhancements, and an overhauled garage for racecraft customization. Spread across 59 courses in seven exotic high-definition environments including lush rainforests, massive glacier fields, and canyons of razor-sharp rock, the beauty of Fatal Inertia EX could easily mask the harrowing thrills in this high-speed contest of champions. [Koei]… Expand"}, {"name": "Fantastic 4", "details_link": "https://www.metacritic.com/game/pc/fantastic-4", "publisher": "Activision", "release_date": "Jun 27 2005", "developers": ["Beenox"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 63, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/d7bde3eba52429b555ca3b594bb2fa75-98.jpg", "descriptions": "Fantastic Four game players are be able to harness the Marvel Super Heroes' unique and amazing powers through a compelling single-player or two-player co-operative team based gameplay experience.  Authored by Zak Penn, who co-wrote the story for \"X2,\" the game follows the Fantastic FourFantastic Four game players are be able to harness the Marvel Super Heroes' unique and amazing powers through a compelling single-player or two-player co-operative team based gameplay experience.  Authored by Zak Penn, who co-wrote the story for \"X2,\" the game follows the Fantastic Four film's storyline and expands the adventures by letting players stretch, control fire and use invisibility and brute force to defeat evil Super Villains in new environments and familiar comic book locales.  Challenged to master the individual powers of each Super Hero and combine them to level even more devastating attacks, players must battle some of Marvel's most notorious Super Villains, including, the ultimate evil - Doctor Doom -- to save the human race from disaster. [Activision]… Expand"}, {"name": "Wheels of Aurelia", "details_link": "https://www.metacritic.com/game/pc/wheels-of-aurelia", "publisher": "Santa Ragione", "release_date": "Sep 20 2016", "developers": ["Santa Ragione"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Racing", "General"], "meta_score": 63, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/6/373139eada0b019f713713a86f79fe14-98.jpg", "descriptions": "A narrative road trip game set in the roaring Italian 70s, it tells the story of Lella, a restless woman driving on the roads of the western coast of Italy, the famous “Via Aurelia”."}, {"name": "Arizona Sunshine", "details_link": "https://www.metacritic.com/game/playstation-4/arizona-sunshine", "publisher": "Vertigo Games", "release_date": "Jul  5 2017", "developers": ["Jaywalkers Interactive"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Light Gun", "Arcade"], "meta_score": 63, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/8bbc04f47277fa6e70aee406ad47e252-98.jpg", "descriptions": "Arizona Sunshine thrusts you in the midst of a zombie apocalypse, exclusively in VR. Handle weapons with real-life movements, freely explore a post-apocalyptic world, and put your survival skills to the test with PS VR. [Playstation.com]"}, {"name": "Puzzle Agent 2", "details_link": "https://www.metacritic.com/game/pc/puzzle-agent-2", "publisher": "Telltale Games", "release_date": "Jun 30 2011", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/a3b284e048dfc6636bf5e153054cd3f3-98.jpg", "descriptions": "In the second Puzzle Agent game, ace puzzle investigators will return to the snowy mid-west to help Agent Tethers solve the mystery haunting the realm."}, {"name": "Star Trek: Tactical Assault", "details_link": "https://www.metacritic.com/game/ds/star-trek-tactical-assault", "publisher": "Bethesda Softworks", "release_date": "Oct 26 2006", "developers": ["Quicksilver Software"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/8889abbacfefa24b0354bd205247fcb3-98.jpg", "descriptions": "Star Trek: Tactical Assault features real-time spaceship combat from the universe of the original Star Trek series. With a wide array of authentic Star Trek races, ships, and weaponry, you can engage in single-player battle through either the Federation or Klingon campaigns or inStar Trek: Tactical Assault features real-time spaceship combat from the universe of the original Star Trek series. With a wide array of authentic Star Trek races, ships, and weaponry, you can engage in single-player battle through either the Federation or Klingon campaigns or in head-to-head wireless multiplayer combat. Both the Federation and Klingon campaign modes feature real-time combat with branching missions and multiple outcomes. With a multitude of paths to choose from, you decide the ultimate outcome of your campaign. Wireless multiplayer mode allows you to test your skills and tactical maneuvers against those of your friends. Successful gameplay relies on strategic movement and effective use of a ship's weapons and shields. [Bethesda Softworks]… Expand"}, {"name": "NASCAR Heat 5", "details_link": "https://www.metacritic.com/game/playstation-4/nascar-heat-5", "publisher": "704Games", "release_date": "Jul  7 2020", "developers": ["704Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 63, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/bd8399c64906bef638fe010b71613d85-98.jpg", "descriptions": "NASCAR heat 5, the official video game of the world's most popular stockcar racing Series, puts you behind the wheel of these incredible racing machines and challenges you to become the 2020 NASCAR Cup Series champion. Features all the official teams, drivers and cars from the three NASCARNASCAR heat 5, the official video game of the world's most popular stockcar racing Series, puts you behind the wheel of these incredible racing machines and challenges you to become the 2020 NASCAR Cup Series champion. Features all the official teams, drivers and cars from the three NASCAR national series as well as the Xtreme dirt Tour, racing on 38 Authentic tracks. All official 2020 NASCAR tracks, teams, cars, drivers and schedule from four racing Series - the 2020 NASCAR Cup Series, NASCAR XFINITY series, NASCAR gander rv & outdoors Truck series and fan-favorite, the extreme dirt Tour. Split screen multiplayer allows you to race against your friends on the same screen.… Expand"}, {"name": "Bionic Commando Rearmed 2", "details_link": "https://www.metacritic.com/game/playstation-3/bionic-commando-rearmed-2", "publisher": "Capcom", "release_date": "Feb  1 2011", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "3D", "2D", "3D", ""], "meta_score": 63, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/6b8cd265d83e78a72c728223e77c571f-98.jpg", "descriptions": "Nathan Spencer will make use of his trademark tool – his bionic grappling hook – to grab, swing and leap through series of lush new environments. He’ll be met by plenty of gun-toting soldiers and mechanized threats ready to give him a hostile greeting. Bionic Commando Rearmed 2 improves uponNathan Spencer will make use of his trademark tool – his bionic grappling hook – to grab, swing and leap through series of lush new environments. He’ll be met by plenty of gun-toting soldiers and mechanized threats ready to give him a hostile greeting. Bionic Commando Rearmed 2 improves upon the visual achievements of its predecessor with the addition of more detailed character models, textures, and vibrant colors.  New player mechanics will add another strategic layer of platforming to the overall experience and the famous bionic arm will be getting a major makeover delivering a more dynamic bionic experience to the player. … Expand"}, {"name": "Hot Wheels Stunt Track Challenge", "details_link": "https://www.metacritic.com/game/xbox/hot-wheels-stunt-track-challenge", "publisher": "THQ", "release_date": "Nov 10 2004", "developers": ["Climax Group"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/596ba53df60affb363fb5dd8239efe8e-98.jpg", "descriptions": "You are a contestant in a new game show in which players must complete dangerous stunts and win intense races. If you can beat your opponents and impress the audience, you'll advance into other episodes to win better cars. Choose from 30 authentic Hot Wheels cars in 24 stunt challenges, andYou are a contestant in a new game show in which players must complete dangerous stunts and win intense races. If you can beat your opponents and impress the audience, you'll advance into other episodes to win better cars. Choose from 30 authentic Hot Wheels cars in 24 stunt challenges, and race on 12 tracks set in such environments as Buccaneer Bay, Jurassic Jam, Zero Gravity Zone, Tiki Island, Spider Alley, and Lava Land. At the end of the season, the driver with the most courage and best stunt skills will cruise away in a gold-plated car as the Hot Wheels champion.… Expand"}, {"name": "Operation Babel: New Tokyo Legacy", "details_link": "https://www.metacritic.com/game/playstation-vita/operation-babel-new-tokyo-legacy", "publisher": "NIS America", "release_date": "May 16 2017", "developers": ["Experience Inc."], "platforms": ["PC", "PlayStation Vita"], "genres": ["Role-Playing", "Roguelike", "Western-Style"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/3d7a677ac2ea59fc57acad1cdc970bd0-98.jpg", "descriptions": "Tokyo, Spring of 20XX\r The special forces unit known as the Xth Squad has been through countless battles, putting their superhuman abilities to the test. Thanks to them, the bizarre incidents, which threw the world into chaos, have been long forgotten.\r\n\r\nIt looked as though their battlesTokyo, Spring of 20XX\r The special forces unit known as the Xth Squad has been through countless battles, putting their superhuman abilities to the test. Thanks to them, the bizarre incidents, which threw the world into chaos, have been long forgotten.\r It looked as though their battles were finally over. But one day, everything changed...\r An unidentified object, nearly 2,000 miles long, appeared without warning high in the sky. It was dubbed...the Embryo. Was this a gift from heaven, or a sign of the end times? The world once again fell into chaos, and the United Nations turned to the Code Physics Agency for help. The Xth had a single mission: Infiltrate the mysterious object. Victory seemed within their reach, when suddenly...… Expand"}, {"name": "WRC 4: FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/playstation-3/wrc-4-fia-world-rally-championship", "publisher": "Bigben Interactive", "release_date": "Jul 29 2014", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 63, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/e7a4a4f3cc74dc095103d8b76dcd57a7-98.jpg", "descriptions": "Show off your style and win the FIA WORLD RALLY CHAMPIONSHIP 2013 (official game) season!\r- A simulation unrivalled for its realism\r- An incredibly authentic and immersive career mode\r\n- The official 2013 FIA World Rally Championship videogame\r\n- Online multiplayer mode for up to 16Show off your style and win the FIA WORLD RALLY CHAMPIONSHIP 2013 (official game) season!\r- A simulation unrivalled for its realism\r- An incredibly authentic and immersive career mode\r- The official 2013 FIA World Rally Championship videogame\r- Online multiplayer mode for up to 16 players\r- 65 cars, 78 stages, 13 countries\r- All weather conditions and road surfaces… Expand"}, {"name": "Revenge of the Wounded Dragons", "details_link": "https://www.metacritic.com/game/playstation-3/revenge-of-the-wounded-dragons", "publisher": "SCEA", "release_date": "Dec 10 2009", "developers": ["Wanako Studios"], "platforms": "PlayStation 3", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/7895f6e2eb9db57c375d60138e85bb7a-98.jpg", "descriptions": "[Playstation Network]  In this dual-mission drama where you are the hero, your little sister was kidnapped by the local mafia Boss, while your grandfather has been killed by the same ruffian! But all these years, you were trained by the old man in the ancient art of Kung-Fu, your most lethal[Playstation Network]  In this dual-mission drama where you are the hero, your little sister was kidnapped by the local mafia Boss, while your grandfather has been killed by the same ruffian! But all these years, you were trained by the old man in the ancient art of Kung-Fu, your most lethal weapon. [SCEA]… Expand"}, {"name": "Pneuma: Breath of Life", "details_link": "https://www.metacritic.com/game/xbox-one/pneuma-breath-of-life", "publisher": "Deco Digital", "release_date": "Feb 27 2015", "developers": ["Deco Digital"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Sci-Fi", "Adventure", "3D", "First-Person"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/79f6531ba2a825908cc40477e3a05731-98.jpg", "descriptions": "Pneuma: Breath of Life requires you to think outside the box via a narrated story of self-discovery, whilst exploring the ontological mystery of the breath of life."}, {"name": "Disney/Pixar Finding Nemo", "details_link": "https://www.metacritic.com/game/playstation-2/disneypixar-finding-nemo", "publisher": "THQ", "release_date": "May  9 2003", "developers": ["Traveller's Tales"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 63, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/d771bd381a49d5567864848d233bb2ec-98.jpg", "descriptions": "FISH ARE FRIENDS, NOT FOOD. Guide Marlin, Dory and Nemo through the ultimate underwater adventure. Meet all of the great characters from the Disney/Pixar movie, \"Finding Nemo,\" as you live all the excitement of the film's storyline. The search for Nemo is on, and it's up to you to find him.FISH ARE FRIENDS, NOT FOOD. Guide Marlin, Dory and Nemo through the ultimate underwater adventure. Meet all of the great characters from the Disney/Pixar movie, \"Finding Nemo,\" as you live all the excitement of the film's storyline. The search for Nemo is on, and it's up to you to find him. Dive in! Live the film through the game and help reunite Nemo and his father Marlin. Over 15 levels of action and adventure with multiple unlockable minigames in each level. [THQ]… Expand"}, {"name": "Borderlands: Mad Moxxi's Underdome Riot", "details_link": "https://www.metacritic.com/game/xbox-360/borderlands-mad-moxxis-underdome-riot", "publisher": "2K Games", "release_date": "Dec 29 2009", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 63, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/56c4d7563bb1d2f0e0e409e9cf0815c8-98.jpg", "descriptions": "[Xbox Live Arcade]  Mad Moxxi's Underdome Riot is an add-on pack for Borderlands that includes a new cooperative arena game mode and a stash to store your gear. Are you god's gift to gun fights? Think you're the best? Wanna prove it? Then help us celebrate the grand opening of Marcus Bank (a[Xbox Live Arcade]  Mad Moxxi's Underdome Riot is an add-on pack for Borderlands that includes a new cooperative arena game mode and a stash to store your gear. Are you god's gift to gun fights? Think you're the best? Wanna prove it? Then help us celebrate the grand opening of Marcus Bank (a subsidiary of Marcus Corp) by killing hundreds and hundreds of people in Mad Moxxi's Underdome Riot, the only competitive arena around where your next of kin can be assured that you're coming back famous . . . or not at all. [Microsoft]… Expand"}, {"name": "Gin Rummy", "details_link": "https://www.metacritic.com/game/xbox-360/gin-rummy", "publisher": "Sierra Online", "release_date": "Sep  3 2008", "developers": ["Sierra Online Shanghai"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/3748b00ac646f3ab111ea6c0afb80c01-98.jpg", "descriptions": "[Xbox Live Arcade]  Enjoy challenging variations of the classic card game Gin Rummy. Strategically select the right cards to complete sets of combinations, minimizing the risk of getting caught with a poor hand. ‘Knock’ out your opponent with high scores and bonus points, and video chat with[Xbox Live Arcade]  Enjoy challenging variations of the classic card game Gin Rummy. Strategically select the right cards to complete sets of combinations, minimizing the risk of getting caught with a poor hand. ‘Knock’ out your opponent with high scores and bonus points, and video chat with players from around the world for endless hours of casual card game fun. 6 Popular Game Modes – Challenge your opponents to a game of Classic Gin Rummy, Speed Gin Rummy, Oklahoma Gin, Hollywood Gin, Three-Hand Gin, or Customize Your Own Rules. Rapid Auto-scoring – Enjoy immediate automatic scoring at the end of each match to get a detailed breakdown of each player’s total accrued points and bonuses. Unique Game Themes – Choose from colorful game skins, artistic card decks, and entertaining music selections. Multiplayer Matches – Test your skills in a real-time multiplayer match with up to 3 other competitors. Xbox LIVE Vision – Video chat with your friends over Xbox LIVE Vision for a knock-out time. [Sierra]… Expand"}, {"name": "Kane & Lynch 2: Dog Days", "details_link": "https://www.metacritic.com/game/xbox-360/kane-lynch-2-dog-days", "publisher": "Square Enix", "release_date": "Aug 17 2010", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 63, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/f4fd8fa8f9e289847c3e48912c8877de-98.jpg", "descriptions": "Kane & Lynch 2: Dog Days is a raw and brutal crime shooter designed to take players on an even more intense story experience, following two of gaming's most disturbed criminals, through the gritty Shanghai underworld."}, {"name": "P.N. 03", "details_link": "https://www.metacritic.com/game/gamecube/pn-03", "publisher": "Capcom", "release_date": "Sep  9 2003", "developers": ["Capcom"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 63, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/5/b62e97bb2c9b5028a650f67f579da524-98.jpg", "descriptions": "A colonial settlement on a distant planet goes out-of-control after a Computer Arms Management System goes haywire. Enter Vanessa Schneider, a freelance mercenary and robot killer with a grudge to settle in this action game. But will Vanessa's dark past collide with her ultimate mission?A colonial settlement on a distant planet goes out-of-control after a Computer Arms Management System goes haywire. Enter Vanessa Schneider, a freelance mercenary and robot killer with a grudge to settle in this action game. But will Vanessa's dark past collide with her ultimate mission? Find out as you guide her through futuristic environments, performing stylish spin moves, devastating combos, and powerful attacks. Remember to collect power-ups before you battle the game's robots, machines, megaweapons, and transforming enemies.… Expand"}, {"name": "Dragon Ball Z: Tenkaichi Tag Team", "details_link": "https://www.metacritic.com/game/psp/dragon-ball-z-tenkaichi-tag-team", "publisher": "Namco Bandai Games", "release_date": "Oct 19 2010", "developers": ["Spike"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 63, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/f482ba0974ca527688cbc52abf9e17f1-98.jpg", "descriptions": "Play solo or team up via Ad Hoc mode to tackle memorable battles in a variety of single player and multiplayer modes, including Dragon Walker, Battle 100, and Survival Mode. Dragon Walker Mode takes fans through the entire epic Dragon Ball Z story arc from the Saiyan saga to the Majin BuuPlay solo or team up via Ad Hoc mode to tackle memorable battles in a variety of single player and multiplayer modes, including Dragon Walker, Battle 100, and Survival Mode. Dragon Walker Mode takes fans through the entire epic Dragon Ball Z story arc from the Saiyan saga to the Majin Buu saga. Battle 100 Mode tasks players to relive the most epic encounters and newly created situations from the Dragon Ball Z world in ever increasingly difficult situations. With more than 70 playable and deeply customizable characters, multiple modes, and Ad Hoc Party gameplay, Dragon Ball Z: Tenkaichi Tag Team is chock full of gameplay for your portable PSP system.… Expand"}, {"name": "Disney/Pixar Cars Mater-National Championship", "details_link": "https://www.metacritic.com/game/playstation-3/disneypixar-cars-mater-national-championship", "publisher": "THQ", "release_date": "Oct 30 2007", "developers": ["Rainbow Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 63, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/29ba3bc8a11c8d4b724dcdc543f484ff-98.jpg", "descriptions": "Cars Mater-National features an all-new International group of racers vying for their chance to compete against Lightning McQueen in the First Annual Mater-National Race Festival, hosted by Lightning’s best friend, Mater. Explore the new and improved open world of Radiator Springs, play inCars Mater-National features an all-new International group of racers vying for their chance to compete against Lightning McQueen in the First Annual Mater-National Race Festival, hosted by Lightning’s best friend, Mater. Explore the new and improved open world of Radiator Springs, play in the all-new Monster Mode, jump into the fast lane with 6 new International racing competitors, burn rubber on new tracks, and twist and turn your way through new mini-games like Ramone’s Rhythmic Rumble and Fillmore’s Fuel Frenzy. Explore the new open world of Radiator Springs, Lightning McQueen’s new Racing Headquarters, and practice facility Over 20 challenging mini-games. 7 exciting new international characters. Multiple new adrenaline-packed tracks to race on. Go head to head with over 10 multiplayer games. [THQ]… Expand"}, {"name": "Bright Memory: Infinite", "details_link": "https://www.metacritic.com/game/playstation-5/bright-memory-infinite", "publisher": "Playism", "release_date": "Jul 21 2022", "developers": ["FYQD-Studio"], "platforms": ["PC", "Switch", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 63, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/faf7058873511a3433042d97cbf6b6e4-98.jpg", "descriptions": "A lightning-fast fusion of the FPS and action genres.\r Bright Memory: Infinite is set in a sprawling, futuristic metropolis in the year 2036. A strange phenomenon for which scientists can find no explanation has occurred in the skies around the world. The Supernatural Science ResearchA lightning-fast fusion of the FPS and action genres.\r Bright Memory: Infinite is set in a sprawling, futuristic metropolis in the year 2036. A strange phenomenon for which scientists can find no explanation has occurred in the skies around the world. The Supernatural Science Research Organization (SRO) has sent agents out to various regions to investigate this phenomenon. It is soon discovered that these strange occurrences are connected to an archaic mystery an as-of-yet unknown history of two worlds, about to come to light...\r Bright Memory: Infinite combines the FPS and action genres to deliver a high-octane experience. Mix and match available skills and abilities to unleash magnificient combos on your enemies. Your trusted sword allows you to slash through crowds of enemies and even repel their gunfire. The guns you come across in-game can be customized with a variety of ammunitions. Choose between incendiary bombs, sticky grenades, homing missiles, and more to suit your situation.\r Created by FYQD-Studio, Bright Memory: Infinite is the sequel to the popular Bright Memory. However, the sequel features an all-new world, along with newly created improved battle system and level design.… Expand"}, {"name": "YIIK: A Postmodern RPG", "details_link": "https://www.metacritic.com/game/switch/yiik-a-postmodern-rpg", "publisher": "Ackkstudios", "release_date": "Jan 17 2019", "developers": ["Ackkstudios"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 63, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/8/984e68bd7cddd76014dc93e9a22eb491-98.jpg", "descriptions": "On the afternoon of April 4th 1999 Sammy Pak went missing.  That night, a video of her last known moments was uploaded online.  All of your friends excitedly watched as she is pulled from an elevator by something. otherworldly. \r\rThis is a story about what happens when you look for someoneOn the afternoon of April 4th 1999 Sammy Pak went missing.  That night, a video of her last known moments was uploaded online.  All of your friends excitedly watched as she is pulled from an elevator by something. otherworldly. \r\rThis is a story about what happens when you look for someone who cant be found and the strange things you invite into your life when you go to forbidden places.… Expand"}, {"name": "Bladestorm: The Hundred Years' War", "details_link": "https://www.metacritic.com/game/xbox-360/bladestorm-the-hundred-years-war", "publisher": "Koei", "release_date": "Nov  6 2007", "developers": ["Omega Force"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/6f55d5ace5cf03eba337d3a503863d32-98.jpg", "descriptions": "Bladestorm heralds a break from the tradition of basing games on Japanese and Chinese history by being set within the Hundred Years' War. This famous European conflict between the English and French provides the setting in which hundreds upon hundreds of soldiers clash on the battlefield. IfBladestorm heralds a break from the tradition of basing games on Japanese and Chinese history by being set within the Hundred Years' War. This famous European conflict between the English and French provides the setting in which hundreds upon hundreds of soldiers clash on the battlefield. If you thought the massively populated battles in the Dynasty Warriors games were huge, think again. [KOEI]… Expand"}, {"name": "Sonic & All-Stars Racing Transformed", "details_link": "https://www.metacritic.com/game/3ds/sonic-all-stars-racing-transformed", "publisher": "Sega", "release_date": "Feb 12 2013", "developers": ["Sumo Digital"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "3DS"], "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart", "Automobile"], "meta_score": 63, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/372f5e95396795bc95c3ee11b36e0794-98.jpg", "descriptions": "Sonic and the All-Stars cast battle for supremacy across land, water and air in transforming vehicles that change from cars to boats to planes mid-race."}, {"name": "Shark Tale", "details_link": "https://www.metacritic.com/game/game-boy-advance/shark-tale", "publisher": "Activision", "release_date": "Sep 27 2004", "developers": ["Vicarious Visions"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 63, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/2244bd951c15de0861ea11a1ec88e766-98.jpg", "descriptions": "In the murky depths of the ocean, the fate of Reef City lies in the fins of one little fish--at least that's what he wants you to think. Dive into the underwater metropolis of Shark Tale and play as Oscar, a fast-talking fish whose little fib gets him into big trouble. Based on DreamWorks'In the murky depths of the ocean, the fate of Reef City lies in the fins of one little fish--at least that's what he wants you to think. Dive into the underwater metropolis of Shark Tale and play as Oscar, a fast-talking fish whose little fib gets him into big trouble. Based on DreamWorks' animated film, Shark Tale features 25 missions that will have you exploring Reef City, racing through the coral, fighting Fish Fu and great white sharks, and dancing to the sounds of hip-hop tracks.… Expand"}, {"name": "PlanetSide: Core Combat", "details_link": "https://www.metacritic.com/game/pc/planetside-core-combat", "publisher": "Sony Online Entertainment", "release_date": "Oct 27 2003", "developers": ["Sony Online Entertainment"], "platforms": "PC", "genres": ["Action", "Role-Playing", "Shooter", "Shooter", "Massively Multiplayer", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/10ff880bac6f1aa5dcb8c41adca2fb39-98.jpg", "descriptions": "For Land. For Power. Forever. Expand your game in this massively multiplayer online first person action game! Introducing PlanetSide: Core Combat offering new massive underground zones and caverns, upgradable surface level facilities, and an unlockable form of ancient technology to accessFor Land. For Power. Forever. Expand your game in this massively multiplayer online first person action game! Introducing PlanetSide: Core Combat offering new massive underground zones and caverns, upgradable surface level facilities, and an unlockable form of ancient technology to access new weapons, vehicles and underground transports giving your Empire the edge on the battlefields above and below the surface of Auraxis. New weapons and vehicles to enhance combat tactics and strategy. Harvest ancient alien technology in six new massive underground caverns. Head-to-Head urban warfare gameplay in massive subterranean cities. [Sony Online Entertainment]… Expand"}, {"name": "Curse: The Eye of Isis", "details_link": "https://www.metacritic.com/game/pc/curse-the-eye-of-isis", "publisher": "DreamCatcher Interactive", "release_date": "Oct 21 2003", "developers": ["Asylum Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/0d39f973de5c362e33e9782450cd4bab-98.jpg", "descriptions": "Become Dr. Darien Dane or his assistant Victoria Sutton, as you investigate the mysterious disappearance of an ancient sacred Egyptian statue from the British Museum. This unique statue is protected by an evil curse that resides within it, that causes madness, or violent death, to all thoseBecome Dr. Darien Dane or his assistant Victoria Sutton, as you investigate the mysterious disappearance of an ancient sacred Egyptian statue from the British Museum. This unique statue is protected by an evil curse that resides within it, that causes madness, or violent death, to all those who come in contact with it. The Curse manifests itself by raising the dead and animating diabolical objects. It is up to you to find and return the cursed statue to the pyramid that it should never have been taken from. Are you up for the challenge and the race against time? [DreamCatcher Interactive]… Expand"}, {"name": "Once Upon a Knight", "details_link": "https://www.metacritic.com/game/pc/once-upon-a-knight", "publisher": "Atari", "release_date": "Sep 25 2003", "developers": ["Reality Pump"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 63, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/77fafa4e7dfb56dcb0b68b2ff7833827-98.jpg", "descriptions": "Set within a world of treachery, nobility and milk (yes, milk), Once Upon A Knight delivers powerful gameplay and forgoes conventions surrounding ordinary fantasy titles offering a milk-based economy, mother-in-laws, flying witches and secretive knights named Floyd. Players can chose toSet within a world of treachery, nobility and milk (yes, milk), Once Upon A Knight delivers powerful gameplay and forgoes conventions surrounding ordinary fantasy titles offering a milk-based economy, mother-in-laws, flying witches and secretive knights named Floyd. Players can chose to either jump right into battle in RTS mode, or slowly build up a character's attributes over time in RPG mode. Once Upon A Knight is set in a fully animated, highly detailed three-dimensional environment that features over 20 missions, hundreds of quests, creepy monsters, 80 different characters, countless spells and weaponry. Once Upon A Knight also offers LAN and online play where up to eight chivalrous gamers can test their skills and battle each other to discover who is the ultimate medieval master. [Atari]… Expand"}, {"name": "Seek and Destroy", "details_link": "https://www.metacritic.com/game/playstation-2/seek-and-destroy", "publisher": "Conspiracy Entertainment", "release_date": "Dec 11 2002", "developers": ["Barnhouse Effect"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Car Combat"], "meta_score": 63, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/1/f3d56d4d7b32c17030efc9d83682e5ce-98.jpg", "descriptions": "Command over 100 tanks, all based on actual military models from around the world with this budget title. Customize and conquer. Choose from hundreds of parts and dozens of weapons, including missile launchers, amphibious rigs and even aerial combat gear. Take on 25 intense missions thatCommand over 100 tanks, all based on actual military models from around the world with this budget title. Customize and conquer. Choose from hundreds of parts and dozens of weapons, including missile launchers, amphibious rigs and even aerial combat gear. Take on 25 intense missions that take you from the frozen plains of Eastern Europe to the deserts of Africa. Engage in 2-player arena battles, surprizing mini-missions and fierce boss battles.… Expand"}, {"name": "C-12: Final Resistance", "details_link": "https://www.metacritic.com/game/playstation/c-12-final-resistance", "publisher": "SCEA", "release_date": "Jul 22 2002", "developers": ["SCE Studio Cambridge"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 63, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/dfe10889d1e8a10284da4a24f8ae0032-98.jpg", "descriptions": "The population is threatened with near extinction as hostile alien forces ravage the planet, converting human survivors into cyborg warriors. Working against all odds and armed with an Alien Imaging Unit that has replaced his left eye, Resistance fighter Lt. Riley Vaghan must use firepower,The population is threatened with near extinction as hostile alien forces ravage the planet, converting human survivors into cyborg warriors. Working against all odds and armed with an Alien Imaging Unit that has replaced his left eye, Resistance fighter Lt. Riley Vaghan must use firepower, stealth, intelligence and sheer determination to save humankind from impeding doom.… Expand"}, {"name": "City Crisis", "details_link": "https://www.metacritic.com/game/playstation-2/city-crisis", "publisher": "Take-Two Interactive", "release_date": "Jul 17 2001", "developers": ["Syscom"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Flight", "Helicopter"], "meta_score": 63, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/578c5673ae9808268daea7750e507fff-98.jpg", "descriptions": "Take 2's search-and-rescue game, reminiscent of the classic Choplifter, thrusts you into the role of a helicopter pilot who must save the lives of helpless citizens from raging infernos and assist the police in apprehending dangerous fugitives on the run."}, {"name": "Star Trek ConQuest Online", "details_link": "https://www.metacritic.com/game/pc/star-trek-conquest-online", "publisher": "Activision", "release_date": "Jul 14 2000", "developers": ["Genetic Anomalies"], "platforms": "PC", "num_players": "2 ", "genres": ["Strategy", "General", "General"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/2daf0d3264989acee468a3f8d002bb21-98.jpg", "descriptions": "After supernatural powers and immortality, what else could you possibly want as Q? Try the bragging rights that come with outwitting your fellow Star Trek fans (opposing Qs) online. Unfortunately, they seem to have the same pompous desire for galactic amusement as you.  [Activision]"}, {"name": "Phineas and Ferb: Across the 2nd Dimension", "details_link": "https://www.metacritic.com/game/playstation-3/phineas-and-ferb-across-the-2nd-dimension", "publisher": "Disney Interactive Studios", "release_date": "Aug  2 2011", "developers": ["High Impact Games"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "1-2 ", "genres": ["Action", "Action Adventure", "General", "General", "Fantasy"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/dd2a956a8608565da15d8f5d425df63d-98.jpg", "descriptions": "Phineas and Ferb: Across the Second Dimension is a game inspired by the Disney Channel Original Movie."}, {"name": "Battlefield 2042", "details_link": "https://www.metacritic.com/game/playstation-5/battlefield-2042", "publisher": "Electronic Arts", "release_date": "Nov 12 2021", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 63, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/8/872da589795ac5e2deac803a5599a4aa-98.jpg", "descriptions": "Battlefield 2042 marks the return to the iconic all-out warfare of the franchise. Adapt and overcome dynamically-changing battlegrounds with the help of your squad and a cutting-edge arsenal. With support for 128 players*, prepare for unprecedented scale on vast environments. Take on massiveBattlefield 2042 marks the return to the iconic all-out warfare of the franchise. Adapt and overcome dynamically-changing battlegrounds with the help of your squad and a cutting-edge arsenal. With support for 128 players*, prepare for unprecedented scale on vast environments. Take on massive experiences, from updated multiplayer modes like Conquest and Breakthrough to the all-new Hazard Zone.… Expand"}]