[{"name": "The DioField Chronicle", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-diofield-chronicle", "publisher": "Square Enix", "release_date": "Sep 22 2022", "developers": ["Square Enix", "Lancarse"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Turn-Based", "General", "Strategy", "Real-Time", "Tactics"], "meta_score": 78, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/3/feb8c621e0fb52adef66092a9badd589-98.jpg", "descriptions": "A gritty and immersive story brought to life with the latest technology.  \rIntroducing \"Real Time Tactical Battle\" (RTTB), a new, deeply strategic, real-time battle system.\r\r\nThe beginnings of a new Strategy RPG, crafted by a skilled and experienced development team.\r\n\r\n■An all-newA gritty and immersive story brought to life with the latest technology.  \rIntroducing \"Real Time Tactical Battle\" (RTTB), a new, deeply strategic, real-time battle system.\r The beginnings of a new Strategy RPG, crafted by a skilled and experienced development team.\r ■An all-new Strategy RPG that chronicles an epic tale of war and honour. Featuring a unique and beautiful world that blends fantasy, medieval and modern-day influences, and a deep yet innovative real-time battle system.\r ■Deep, strategic, real-time tactical battles\r The battles in this game are defined by real-time assessment of battlefield conditions and issuing decisive orders that take advantage of your troops strengths and weaknesses to gain advantage over your foe. Make clever use of a variety of skills, classes and equipment to complete your mission.\r ■Realistic \"diorama\" style battle scenes\r Richly detailed depictions of the environments of the island of DioField combined with unique \"diorama\" style visuals as you command your forces like a general.\r ■The DioField Chronicle Standard Edition Early Purchase Bonus Content\r ・Weapon: Rhopasto Knife (Standard Edition Early Purchase Exclusive Colour)\r ・Accessory: Recruit's Bangle\r Early Purchase Bonus Claim Period: Until December 31, 2022\r ※These items cannot be obtained while progressing through the game, but they can be received during Chapter … Expand"}, {"name": "Song in the Smoke", "details_link": "https://www.metacritic.com/game/pc/song-in-the-smoke", "publisher": "17-Bit", "release_date": "Oct  7 2021", "developers": ["17-Bit"], "platforms": ["PlayStation 4", "PC"], "genres": ["Action Adventure", "Survival"], "meta_score": 78, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/b18378f9f91791e47922c2b3d8a597ef-98.jpg", "descriptions": "Song in the Smoke immerses players in a mysterious prehistoric world full of strange beasts where they must craft, forage, hunt, and fight to survive. Featuring art by famed illustrator Katsuya Terada (The Legend of Zelda, Blood: The Last Vampire, The Monkey King), Song in the Smoke hasSong in the Smoke immerses players in a mysterious prehistoric world full of strange beasts where they must craft, forage, hunt, and fight to survive. Featuring art by famed illustrator Katsuya Terada (The Legend of Zelda, Blood: The Last Vampire, The Monkey King), Song in the Smoke has atmosphere and adventure in spades, with fantastical creatures and stylized scenery that pack an eerie, otherworldly punch.Awoken by a three-headed crow at the edge of the woods, players will travel through eight stages including forests, valleys, and frozen terrain. You'll battle the elements and strange beasts alike, crafting tools, weapons, medicine, and more to stay alive. In true VR fashion, you'll identify threats by sound as well as sight. Intuitive controls mean you can line up the perfect shot with your bow, but you may not be the only one stalking its prey, so keep your wits about you.… Expand"}, {"name": "What The Dub?!", "details_link": "https://www.metacritic.com/game/playstation-4/what-the-dub!", "publisher": "Wide Right Interactive", "release_date": "Apr  8 2021", "developers": ["Wide Right Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/2a5c07837315f6f3b5d0baac5716a339-98.jpg", "descriptions": "What The Dub?! is a local multiplayer party game where each player overdubs missing dialogue from hilariously awful B-movies, outdated PSAs, and bizarre industrial films, with their own witty (or just plain stupid) dubs!"}, {"name": "Rogue Heroes: Ruins of Tasos", "details_link": "https://www.metacritic.com/game/switch/rogue-heroes-ruins-of-tasos", "publisher": "Team17", "release_date": "Feb 23 2021", "developers": ["Heliocentric Studios"], "platforms": ["PC", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Roguelike"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/a90e702c4c27a0dbffd06495a41eb962-98.jpg", "descriptions": "A dark evil stirs beneath the once peaceful land of Tasos Deep within the four Great Dungeons, the ancient seals that hold the Titans at bay are gravely weakened and their minions have unleashed terror upon the world.The Goddesses who forged the seals long ago have made a desperate pleaA dark evil stirs beneath the once peaceful land of Tasos Deep within the four Great Dungeons, the ancient seals that hold the Titans at bay are gravely weakened and their minions have unleashed terror upon the world.The Goddesses who forged the seals long ago have made a desperate plea for a band of heroes to come forth and save the people from a terrible fateRogue Heroes is a 1-4 player classic adventure game with modern rogue-lite elements. Team up with friends to combat procedural dungeons, explore an expansive overworld full of secrets and take down the Titans to save Tasos!… Expand"}, {"name": "Nelly Cootalot: The Fowl Fleet", "details_link": "https://www.metacritic.com/game/switch/nelly-cootalot-the-fowl-fleet", "publisher": "Application Systems Heidelberg", "release_date": "Jul 11 2019", "developers": ["Application Systems Heidelberg"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/4069dcf18be0134a3099410f64a4ee0a-98.jpg", "descriptions": "Pirate heroine Nelly Cootalot takes on the villainous Baron Widebeard in this point and click adventure game. Meet a cast of outlandish characters and face perplexing challenges in your quest for the Treasure of the Seventh Sea.\r What is Baron Widebeard planning? Can he be stopped? In whatPirate heroine Nelly Cootalot takes on the villainous Baron Widebeard in this point and click adventure game. Meet a cast of outlandish characters and face perplexing challenges in your quest for the Treasure of the Seventh Sea.\r What is Baron Widebeard planning? Can he be stopped? In what way is a frozen volcano involved?\r To answer these questions comes Nelly Cootalot: pirate heroine and defender of endangered and adorable creatures. Nelly’s journey will take her from Port Rubicund in the South Seas to the lonely isle of Gloomholm in the icy north. She’ll meet outlandish characters and face perplexing challenges in her quest for the Treasure of the Seventh Sea.… Expand"}, {"name": "Electronic Super Joy", "details_link": "https://www.metacritic.com/game/wii-u/electronic-super-joy", "publisher": "Broken Rules", "release_date": "Nov  5 2015", "developers": ["Michael Todd Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Platformer", "2D", "Music"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/9d989573bfec2f190f43a5c479aeb180-98.jpg", "descriptions": "Visually stunning platforming. Run and jump to pulse-pounding music. Brutally Challenging.\r Visually stunning, hilarious, and infinitely challenging.\r\n\r\nCritically acclaimed, adored for its style and praised for its spot-on platforming, the original Electronic Super Joy is legendary. NowVisually stunning platforming. Run and jump to pulse-pounding music. Brutally Challenging.\r Visually stunning, hilarious, and infinitely challenging.\r Critically acclaimed, adored for its style and praised for its spot-on platforming, the original Electronic Super Joy is legendary. Now you can play it on Wii U!\r Electronic Super Joy is a brutally hard platformer set in a world of pulse-pounding electronic music. Run, jump, smash and fly your way through weird and different levels, with low-gravity, world rotation, giant monsters and swarming missiles.\r Features:\r-Levels designed around the music, not the other way around.\r-60 levels, 6 worlds, 4 bosses.\r-Wii U version Includes all bonus levels and the Micro Hell DLC\r-8+ hours of gameplay.\r-Double jump, ground-pound, flying, spaceship piloting, low gravity, you name it!\r-Over an hour and a half of unique electronic music!… Expand"}, {"name": "So Many Me", "details_link": "https://www.metacritic.com/game/pc/so-many-me", "publisher": "Extend Interactive", "release_date": "Jul 17 2014", "developers": ["Extend Interactive"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/048b44682aff52ecadf60d332a45e6bc-98.jpg", "descriptions": "Control Dave and his many clones to explore, solve puzzles, and take on enemies in the beautiful world of Xio. Unleash your team spirit by combining your Me's to help you solve puzzles and bring the fight to your enemies."}, {"name": "MotoGP '07", "details_link": "https://www.metacritic.com/game/xbox-360/motogp-07", "publisher": "THQ", "release_date": "Aug 27 2007", "developers": ["Climax Group", "Climax Studios"], "platforms": "Xbox 360", "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/ef927b34eab955d6a2b99b0c48bfd46c-98.jpg", "descriptions": "MotoGP '07 is a next-generation motorcycle racing title, delivering an authentic MotoGP racing experience. Featuring life-like visuals, complete 2007 rider and team data, new 800cc MotoGP bikes and the newly-announced Misano event, the game's GP mode will be more robust than ever before. TheMotoGP '07 is a next-generation motorcycle racing title, delivering an authentic MotoGP racing experience. Featuring life-like visuals, complete 2007 rider and team data, new 800cc MotoGP bikes and the newly-announced Misano event, the game's GP mode will be more robust than ever before. The title also features interactive track-side crowds, intense on-line tournament features, on-line \"pink-slip\" racing, a revamped Extreme mode (that allows players to race on city streets around the world) and significantly more bike and player customization options. [THQ]… Expand"}, {"name": "Wings of Prey", "details_link": "https://www.metacritic.com/game/pc/wings-of-prey", "publisher": "YuPlay", "release_date": "Dec 25 2009", "developers": ["Gaijin Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/a4308eebcc4ab8aed9cc2b633c603dd3-98.jpg", "descriptions": "Wings of Prey is based around the large-scale aerial combat and ground military operations of World War II. Players can participate in some of the war’s most famous battles piloting fighters, battle planes and bombers across a range of thrilling missions. There are six theatres of war toWings of Prey is based around the large-scale aerial combat and ground military operations of World War II. Players can participate in some of the war’s most famous battles piloting fighters, battle planes and bombers across a range of thrilling missions. There are six theatres of war to engage in – The Battle of Britain, Stalingrad, Ardennes, Berlin, Sicily and Korsun' representing the main airborne battles of World War II in Europe. [yuPlay]… Expand"}, {"name": "Hot Wheels Unleashed", "details_link": "https://www.metacritic.com/game/pc/hot-wheels-unleashed", "publisher": "Milestone S.r.l", "release_date": "Sep 30 2021", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/8055b5223f04c34b25f7ff3829a33fcd-98.jpg", "descriptions": "Drive the cars of your dreams! The coolest, the fastest, the most unique badass vans and jaw-dropping muscle cars are waiting for you. Take the wheel of tons of vehicles with their own personality and style, different traits, and levels of rarity. The very best of the hot wheels universe isDrive the cars of your dreams! The coolest, the fastest, the most unique badass vans and jaw-dropping muscle cars are waiting for you. Take the wheel of tons of vehicles with their own personality and style, different traits, and levels of rarity. The very best of the hot wheels universe is here! Prove you're the best and unlock Premium cars and extraordinary items and with the livery editor make your ride a one-of-a-kind masterpiece of speed. Race like everyone's watching! Get ready for pure fun and show off your driving skills! Drift like a pro, charge your boost and blast through the loops to beat time, rivals and gravity itself! Are you up for a challenge? Boom, jackpot: race side by side a friend in the 2-player local split-screen mode or face up to 12 players online in a worldwide event. The harder the challenge, the more glorious the triumph! Unleash your creativity! Massive, themed playgrounds are ready to host the most immersive races. Have fun on and off the track with these beautifully detailed and interactive environments, where any object can play a role and be an actual part of your circuit! You can even build a racetrack inside your very own room, a space to customize with furniture and the items you will collect during your journey. And thanks to the incredibly powerful editor, building the craziest tracks has never been easier! Bend and stretch the iconic Orange track piece to create your unique design and then add special Boosters, loops, obstacles, and exclusive interactive elements to build your own racing paradise. Share your creations with the world Or enjoy tracks made by other crazy players like you. Now it's time to unleash the fun! … Expand"}, {"name": "Jupiter Hell", "details_link": "https://www.metacritic.com/game/pc/jupiter-hell", "publisher": "ChaosForge", "release_date": "Aug  5 2021", "developers": ["ChaosForge"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/115fc9ef0c557f5222b890c62af40624-98.jpg", "descriptions": "Jupiter Hell is a turn-based shooter from the depths of cosmic hell, built on a classic roguelike framework updated with modern 3d graphics. Rip and tear zombies, demons, and heavy metal monstrosities with chainguns and chainsaws. Like chess... with shotguns."}, {"name": "Cladun: This is an RPG", "details_link": "https://www.metacritic.com/game/psp/cladun-this-is-an-rpg", "publisher": "NIS America", "release_date": "Sep 20 2010", "developers": ["System Prisma"], "platforms": "PSP", "genres": ["Role-Playing", "Action RPG", "General", "Action RPG"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/b5c62deb227089a347e3c2e990612fa7-98.jpg", "descriptions": "Cladun is a retro style dungeon crawler game. Players can create their own main character from scratch using a graphics editor and the dungeons that you will be adventuring in are randomly created for infinite replay value. You can even explore the dungeons with your friends, using theCladun is a retro style dungeon crawler game. Players can create their own main character from scratch using a graphics editor and the dungeons that you will be adventuring in are randomly created for infinite replay value. You can even explore the dungeons with your friends, using the ad-hoc feature of the PSP.… Expand"}, {"name": "Chrono Cross: The Radical Dreamers Edition", "details_link": "https://www.metacritic.com/game/switch/chrono-cross-the-radical-dreamers-edition", "publisher": "Square Enix", "release_date": "Apr  7 2022", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 78, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/2/16624151070d92b50886969fd546389e-98.jpg", "descriptions": "CHRONO CROSS: THE RADICAL DREAMERS EDITION is a remaster of \"CHRONO CROSS\". The 3D models have been upgraded to HD, new illustrations have added, and all kinds of new features are now included. Additionally, the game that formed the bedrock of the story, \"RADICAL DREAMERS - Le TrésorCHRONO CROSS: THE RADICAL DREAMERS EDITION is a remaster of \"CHRONO CROSS\". The 3D models have been upgraded to HD, new illustrations have added, and all kinds of new features are now included. Additionally, the game that formed the bedrock of the story, \"RADICAL DREAMERS - Le Trésor Interdit -\", is included in this edition. CHRONO CROSS is an RPG that transcends time and space, unfolding across two interlinked parallel worlds. With over 40 party members to meet, people and dimensions will intertwine in this epic drama about the planet itself.\r New Features in the Remastered Edition\r・3D models converted to HD\r・Refined character illustrations\r・Higher-quality background music\r・Switch enemy encounters on or off\r・Background filter feature\r・Battle enhancement features to make combat easier\r・Auto-battle function\r・Switch between imitation pixel font and HD font\r・Change screen resolution… Expand"}, {"name": "NHL 2K7", "details_link": "https://www.metacritic.com/game/xbox-360/nhl-2k7", "publisher": "2K Sports", "release_date": "Sep 12 2006", "developers": ["Kush Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/197883648d3cf03d55755469daac304b-98.jpg", "descriptions": "Hundreds of new skating animations have been captured for NHL 2K7.  Not only will skating look much more natural, players will also experience the true momentum of skating whenever players dig into the ice to accelerate or carve the ice to make sudden stops. In addition to the numerous newHundreds of new skating animations have been captured for NHL 2K7.  Not only will skating look much more natural, players will also experience the true momentum of skating whenever players dig into the ice to accelerate or carve the ice to make sudden stops. In addition to the numerous new skating animations, several new checking, passing, and shooting animations have been added, making all the action in NHL 2K7 flow with amazing detail. New gameplay enhancements have been added to Pro Control, giving users offensive and defensive tools to utilize on the ice. While on offense, players now have the ability to execute drop passes, allowing users to setup new screen plays and create new scoring opportunities to catch the goalie off-guard. Pressure Control brings a tactical element to defensive hockey as players now can instruct teammates to defend opposing players while on the ice. Varying degrees of pressure can be selected - whether it's telling your teammate to shadow a selected opponent or deliver a big check - allowing players new defensive options on the fly.  Pro Control in NHL 2K7 delivers the offensive and defensive options hockey fans have been asking for, truly delivering the next generation of hockey. [2K Sports]… Expand"}, {"name": "Pro Evolution Soccer 2012", "details_link": "https://www.metacritic.com/game/xbox-360/pro-evolution-soccer-2012", "publisher": "Konami", "release_date": "Sep 27 2011", "developers": ["Konami"], "platforms": ["3DS", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Football", "Soccer", "Sim", "Sim", "Sim"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/0e1f24169b868d3f0eb50bf0ffb6982c-98.jpg", "descriptions": "Pro Evolution Soccer 2012 is the latest annual update to the long-running football franchise, once known as Winning Eleven."}, {"name": "Eastward", "details_link": "https://www.metacritic.com/game/switch/eastward", "publisher": "Chucklefish", "release_date": "Sep 16 2021", "developers": ["Pixpil"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/59813e0c65347b92afae3ef2afc61b69-98.jpg", "descriptions": "In the near-future, society is starting to collapse, and the human population is at an all-time low. A deadly toxic presence has spread across the land, destroying and devouring everything in its path.Those who could escape the miasma flocked to underground villages to start a new life.In the near-future, society is starting to collapse, and the human population is at an all-time low. A deadly toxic presence has spread across the land, destroying and devouring everything in its path.Those who could escape the miasma flocked to underground villages to start a new life. But for a hardworking miner and a mysterious young girl, the hope of a thriving outside world beckonsEscape the tyrannical clutches of Sandfill's subterranean society and join Eastward's unlikely duo on an exciting adventure to the land above! Discover beautiful yet bizarre settlements and make new friends as you travel across the world by rail.… Expand"}, {"name": "The Lord of the Rings: The Battle for Middle-Earth II - The Rise of the Witch-King", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-the-battle-for-middle-earth-ii---the-rise-of-the-witch-king", "publisher": "EA Games", "release_date": "Nov 28 2006", "developers": ["EA LA"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/907cee981f9a315fc4ce538788da860b-98.jpg", "descriptions": "Full of new content, including an entirely new faction, a completely new single player campaign, and additional units for all six existing factions, The Lord of the Rings, The Battle for Middle-earth II, The Rise of the Witch-King, allows players to explore the evil side of Middle-earth. TheFull of new content, including an entirely new faction, a completely new single player campaign, and additional units for all six existing factions, The Lord of the Rings, The Battle for Middle-earth II, The Rise of the Witch-King, allows players to explore the evil side of Middle-earth. The all new single player campaign's innovative new units help to tell the story of the evil Witch-King’s rise to power, domination of Angmar, and invasion of the great kingdom of Arnor, home to Aragorn's ancestors. To fully experience the evil side of Middle-earth, gamers can now play as the all new Angmar faction in skirmish, multiplayer, and War of the Ring modes. Experience a whole new depth of strategy and upgraded War of the Ring and Create-A-Hero features. Create-A-Hero's entirely new Troll class boasts additional weapons and armor that will allow players to have even more freedom in customizing their game play. War of the Ring, the risk-style meta-game, offers upgraded army persistence, a new siege dynamic on the Living World Map, and unified territories that serve as major control points. [Electronic Arts]… Expand"}, {"name": "Tales of the Abyss", "details_link": "https://www.metacritic.com/game/playstation-2/tales-of-the-abyss", "publisher": "Namco Bandai Games America", "release_date": "Oct 10 2006", "developers": ["Namco"], "platforms": ["3DS", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 78, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/7/656f12da45ff6145b6f717444d06d6d1-98.jpg", "descriptions": "Tales of the Abyss follows the story of the young aristocrat, Luke fon Fabre. Kidnapped seven years ago, Luke returns to his family with no memories of his life before. In order to protect him, Luke's family keeps him confined to the quite lifestyle of the palace. Suddenly, Luke is thrustTales of the Abyss follows the story of the young aristocrat, Luke fon Fabre. Kidnapped seven years ago, Luke returns to his family with no memories of his life before. In order to protect him, Luke's family keeps him confined to the quite lifestyle of the palace. Suddenly, Luke is thrust into the outside world and caught in the workings of the Order of Lorelei and the Oracle Knights who serve as keepers of the prophecy known as the Score. He knows nothing of those who might be his allies or those who are already his enemies. He must learn of the power of friendship and feel the pain of sacrifice.  Luke's actions could save the world or destroy it. [Namco Bandai]… Expand"}, {"name": "Baldur's Gate II: Enhanced Edition", "details_link": "https://www.metacritic.com/game/pc/baldurs-gate-ii-enhanced-edition", "publisher": "Beamdog", "release_date": "Nov 15 2013", "developers": ["Overhaul Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["PC-style RPG", "Role-Playing", "PC-style RPG", "Western-Style"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/5d15bf3ece8150242836692aa123ab17-98.jpg", "descriptions": "You have been kidnapped, imprisoned, and tortured. The wizard Irenicus holds you captive in his stronghold, attempting to strip you of the powers that are your birthright. Can you resist the evil within you, forge a legend of heroic proportions, and ultimately destroy the dark essence thatYou have been kidnapped, imprisoned, and tortured. The wizard Irenicus holds you captive in his stronghold, attempting to strip you of the powers that are your birthright. Can you resist the evil within you, forge a legend of heroic proportions, and ultimately destroy the dark essence that haunts your dreams? … Expand"}, {"name": "State of Decay", "details_link": "https://www.metacritic.com/game/xbox-360/state-of-decay", "publisher": "Microsoft Game Studios", "release_date": "Jun  5 2013", "developers": ["Undead Labs"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/22ab10febb620432e95c18c459d35fe0-98.jpg", "descriptions": "Life as we knew it has gone to hell after the mother of all zombie outbreaks. Now you and the few scattered survivors have to band together to survive and rebuild in a third-person action game set in a dynamic open world. You decide where to make your stand, designing and fortifying yourLife as we knew it has gone to hell after the mother of all zombie outbreaks. Now you and the few scattered survivors have to band together to survive and rebuild in a third-person action game set in a dynamic open world. You decide where to make your stand, designing and fortifying your home base, performing daring raids for food and ammunition, and rescuing other playable survivors with unique talents.… Expand"}, {"name": "Dynasty Tactics 2", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-tactics-2", "publisher": "Koei", "release_date": "Sep 23 2003", "developers": ["Koei"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/dbb0a7449fe75f5eab4b7946e657ea33-98.jpg", "descriptions": "In Dynasty Tactics 2, the almighty Lu Bu joins the roster of playable characters, while all of the playable characters from the original Dynasty Tactics return with compelling new stories. With three times more tactical maneuvers than the original, Dynasty Tactics 2 enhances the originalIn Dynasty Tactics 2, the almighty Lu Bu joins the roster of playable characters, while all of the playable characters from the original Dynasty Tactics return with compelling new stories. With three times more tactical maneuvers than the original, Dynasty Tactics 2 enhances the original \"Tactics Linking System\" with a new \"Sequenced Strike System.\" Taking advantage of the \"Sequenced Strike System,\" a single military unit is capable of launching a devastating offensive using up to ten \"Tactical Combo\" links. Players can now obtain new tactics at \"tactics training camps\" located throughout the game. Furthermore, players can raise their own armies, acquire tactics for subordinate officers, or employ \"Alliance Tactics\" by establishing relations with other commanders. [KOEI]… Expand"}, {"name": "Retro/Grade", "details_link": "https://www.metacritic.com/game/playstation-3/retrograde", "publisher": "24 Carat Games", "release_date": "Aug 21 2012", "developers": ["24 Carat Games", "24 Caret Games"], "platforms": ["PC", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Rhythm", "Shooter", "Scrolling", "Music", "Scrolling"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/3d17b5180652818eea92c391f1a53926-98.jpg", "descriptions": "Rick Rocket has just saved the universe! Unfortunately, the massive destruction he left in his wake has caused a temporal anomaly that has reversed the flow of time. The player must assume control of Rick's spacecraft and fight through the epic space battle in reverse! Retro/Grade is anRick Rocket has just saved the universe! Unfortunately, the massive destruction he left in his wake has caused a temporal anomaly that has reversed the flow of time. The player must assume control of Rick's spacecraft and fight through the epic space battle in reverse! Retro/Grade is an innovative game that fuses the white knuckle thrills and over the top visuals of a shooter with the broad appeal of a rhythm game. Players are forced to dodge enemy projectiles while positioning the ship to be in the correct place to fire their lasers when their shots come back to them. … Expand"}, {"name": "Sonic & All-Stars Racing Transformed", "details_link": "https://www.metacritic.com/game/wii-u/sonic-all-stars-racing-transformed", "publisher": "Sega", "release_date": "Nov 18 2012", "developers": ["Sumo Digital"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Wii U"], "num_players": "Up to 10 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart", "Automobile"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/1d51c6e983fc939779435dbfd581f62c-98.jpg", "descriptions": "Sonic and the All-Stars cast battle for supremacy across land, water and air in transforming vehicles that change from cars to boats to planes mid-race."}, {"name": "Under Night In-Birth Exe:Late[st]", "details_link": "https://www.metacritic.com/game/playstation-4/under-night-in-birth-exelatest", "publisher": "Aksys Games", "release_date": "Feb  9 2018", "developers": ["French-Bread"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/b75542e51f9839fbbf8b3b5adfa46956-98.jpg", "descriptions": "The best parts of Street Fighter and BlazBlue combine in this epic 2D fighter! Easy to pick up but filled with tactical depth that will have you playing for years, Under Night In-Birth Exe:Late[st] is the frantic new fighter from the maker of cult-classic Melty Blood -- and the hitThe best parts of Street Fighter and BlazBlue combine in this epic 2D fighter! Easy to pick up but filled with tactical depth that will have you playing for years, Under Night In-Birth Exe:Late[st] is the frantic new fighter from the maker of cult-classic Melty Blood -- and the hit underground Japanese brawler that has captured both the imagination and hearts of the fighting game community.FEATURES:* PlayStation's Hottest New Fighter: Discover the stunning Under Night In-Birth universe in this complete edition of the celebrated four-button fighter.* An Amazing Contemporary Cast: Wield swords, daggers, whips, scythes and even killer hair braids with a colourful roster of 20 unique and audacious fighters.* Accessible, Tactical Combat: The easy-to-understand 'Grind Grid' mechanic rewards smart offensive play but punishes sloppy and negative tactics to encourage considered tactics.* An Epic Story Campaign: Immerse yourself in the epic battle between In-Births and Voids with the story-rich Chronicle Mode.* The Fighting Genre's Best-Kept Secret: The developer of cult-classic Melty Blood finally returns to the genre by popular demand!… Expand"}, {"name": "Fallout 4: Far Harbor", "details_link": "https://www.metacritic.com/game/xbox-one/fallout-4-far-harbor", "publisher": "Bethesda Softworks", "release_date": "May 19 2016", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/539e3b7afedb66da38c54afe28bd08b0-98.jpg", "descriptions": "A new case from Valentine’s Detective Agency leads you on a search for a young woman and a secret colony of synths. Travel off the coast of Maine to the mysterious island of Far Harbor, where higher levels of radiation have created a more feral world. Navigate through the growing conflictA new case from Valentine’s Detective Agency leads you on a search for a young woman and a secret colony of synths. Travel off the coast of Maine to the mysterious island of Far Harbor, where higher levels of radiation have created a more feral world. Navigate through the growing conflict between the synths, the Children of Atom, and the local townspeople. Will you work towards bringing peace to Far Harbor, and at what cost? Far Harbor features the largest landmass for an add-on that we’ve ever created, filled with new faction quests, settlements, lethal creatures and dungeons. Become more powerful with new, higher-level armor and weapons. The choices are all yours.… Expand"}, {"name": "Sonic Colors", "details_link": "https://www.metacritic.com/game/wii/sonic-colors", "publisher": "Sega", "release_date": "Nov 16 2010", "developers": ["Sonic Team"], "platforms": "Wii", "genres": ["Action", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/043f9fc83a25b253c3630076867400d0-98.jpg", "descriptions": "An extraordinary amusement park has been seen orbiting around the home planet of Sonic the Hedgehog, and rumors are spreading that an alien race of Wisps, who have a unique colorful energy, are being held captive there by the evil Dr. Eggman.  Soon after arriving at the amusement park, SonicAn extraordinary amusement park has been seen orbiting around the home planet of Sonic the Hedgehog, and rumors are spreading that an alien race of Wisps, who have a unique colorful energy, are being held captive there by the evil Dr. Eggman.  Soon after arriving at the amusement park, Sonic discovers he is able to use these mysterious alien forces to help the Wisps escape!  … Expand"}, {"name": "NHL 06", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-06", "publisher": "EA Sports", "release_date": "Sep  6 2005", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2"], "num_players": "8  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/28ab7227ef7fc8328ae7454103a21af2-98.jpg", "descriptions": "With NHL 06 players can score like a superstar, express themselves through their shooting style with the new EA SPORTS Skill Stick and light the lamp with highlight reel moves such as spinoramas, toe drags, bat-ins, and between-the-legs shots. Classic deke control adds to the arsenal ofWith NHL 06 players can score like a superstar, express themselves through their shooting style with the new EA SPORTS Skill Stick and light the lamp with highlight reel moves such as spinoramas, toe drags, bat-ins, and between-the-legs shots. Classic deke control adds to the arsenal of moves allowing maneuvers around defensemen before snapping off dangerous shots that can ripple the twine and knock the water bottle off the net. [Electronic Arts]… Expand"}, {"name": "Far Cry Instincts Predator", "details_link": "https://www.metacritic.com/game/xbox-360/far-cry-instincts-predator", "publisher": "Ubisoft", "release_date": "Mar 28 2006", "developers": ["Ubisoft Montreal"], "platforms": "Xbox 360", "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/3f5000985fa3be0f486bcf3579abf8cf-98.jpg", "descriptions": "Far Cry Instincts Predator features both Far Cry Instincts Next Chapter and an enhanced version of the original Far Cry Instincts game. Offering the kind of lush and deep natural environment true to the Far Cry brand, Far Cry Instincts on Xbox 360 captivates gamers with its enhancedFar Cry Instincts Predator features both Far Cry Instincts Next Chapter and an enhanced version of the original Far Cry Instincts game. Offering the kind of lush and deep natural environment true to the Far Cry brand, Far Cry Instincts on Xbox 360 captivates gamers with its enhanced graphical reality and gameplay. Giving gamers the opportunity to discover the Far Cry universe in an optimized, high-definition environment, the game takes advantage of Xbox 360's multi-core next-generation engine for improved performance. Gamers will experience advanced pathfinding and new enemy and vehicle artificial intelligence for improved chase scenes and more enemies on-screen at one time, allowing for more adrenaline-rushing fast-action sequences. [Ubisoft]… Expand"}, {"name": "LEGO City Undercover", "details_link": "https://www.metacritic.com/game/switch/lego-city-undercover", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  4 2017", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/35dc315197080fe59136972ad578e4ad-98.jpg", "descriptions": "In LEGO City: Undercover developed by TT Games and published by Nintendo, players assume the identity of Chase McCain, an undercover detective armed with clever disguises. As players run, drive and even fly through the city, they'll use the Wii U GamePad as a map, communicator andIn LEGO City: Undercover developed by TT Games and published by Nintendo, players assume the identity of Chase McCain, an undercover detective armed with clever disguises. As players run, drive and even fly through the city, they'll use the Wii U GamePad as a map, communicator and indispensable crime scanner. This is the first time that the LEGO City play sets have come to life on a gaming platform and it's exclusively on the Wii U console.… Expand"}, {"name": "Skylanders Trap Team", "details_link": "https://www.metacritic.com/game/xbox-one/skylanders-trap-team", "publisher": "Activision", "release_date": "Oct  5 2014", "developers": ["Toys for Bob"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Action", "Platformer", "3D"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/4ed6f5dbcd22473f1760ed159673a108-98.jpg", "descriptions": "Bring the Skylanders to life. All the Skylander characters from Skylanders Spyro's Adventure, Skylanders Giants and Skylanders SWAP Force work with Skylanders Trap Team, including an entirely new cast: The Trap Masters. Trap and play as villains: Take control of bad guys. Trap bad guys withBring the Skylanders to life. All the Skylander characters from Skylanders Spyro's Adventure, Skylanders Giants and Skylanders SWAP Force work with Skylanders Trap Team, including an entirely new cast: The Trap Masters. Trap and play as villains: Take control of bad guys. Trap bad guys with the power of TraptaniumT, release them from the crystals and use their awesome powers for good. [Activision]… Expand"}, {"name": "The Sims 2: Open for Business", "details_link": "https://www.metacritic.com/game/pc/the-sims-2-open-for-business", "publisher": "EA Games", "release_date": "Feb 28 2006", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 78, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/8f1cdfbc73a25e79abd1c6d73645c9e6-98.jpg", "descriptions": "The world is your entrepreneurial oyster in this all-new The Sims 2 expansion pack, allowing you to experience the victories and challenges associated with creating, owning and running your own business. From the layout and merchandise, to the employees and materials, you choose what yourThe world is your entrepreneurial oyster in this all-new The Sims 2 expansion pack, allowing you to experience the victories and challenges associated with creating, owning and running your own business. From the layout and merchandise, to the employees and materials, you choose what your Sim needs to create a profitable and fun business. In The Sims 2 Open for Business, your Sims will learn what it takes to build a clientele and keep loyal customers happy while improving employee morale and managing a lucrative business. Players can even help their Sims to create and craft new items to sell and meet customer demands.  As each customer is different, you’ll be able to apply sales techniques to woo even the most discriminating shopper. Dress your employees in wacky outfits to entertain cranky customers or drop the price for an unsure browser. From training, promoting, hiring and firing, you’re ultimately the boss who calls all the shots! [Electronic Arts]… Expand"}, {"name": "Sol Cresta", "details_link": "https://www.metacritic.com/game/switch/sol-cresta", "publisher": "PlatinumGames", "release_date": "Feb 22 2022", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/50e062d135978385a87feefcba43fb80-98.jpg", "descriptions": "Sol Cresta is a sequel to 1980 arcade game Moon Cresta and its 1985 successor Terra Cresta."}, {"name": "PixelJunk Eden 2", "details_link": "https://www.metacritic.com/game/switch/pixeljunk-eden-2", "publisher": "Q-Games", "release_date": "Dec 10 2020", "developers": ["Q-Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/c9b6c777e248d1026afd7787b432ef25-98.jpg", "descriptions": "From the mind of Baiyon, creative director and hypnotic soundscape composer, for both the award winning Pixeljunk Eden and Eden Obscura, comes Eden 2, an exploration of life, color and collaboration as Grimps reinvigorate and revitalize the world in a swath of luminescence, painting upon aFrom the mind of Baiyon, creative director and hypnotic soundscape composer, for both the award winning Pixeljunk Eden and Eden Obscura, comes Eden 2, an exploration of life, color and collaboration as Grimps reinvigorate and revitalize the world in a swath of luminescence, painting upon a lush canvas as they play.\r Return to the spectacular, ever changing gardens of psychedelic sights and sounds as you cultivate new plants and biomes, collect pollen and help seeds sprout new exotic leaves and bloom flowers, all against a dynamic and vibrant backdrop of mellow, multi-hued visuals.\r Swing and spin from silk threads, in both single and cooperative play as you and a partner pirouette around one another in brush-strokes of light and color in the world on your journey to collect the all important “Spectra,” the source of all life in the world.… Expand"}, {"name": "A Fisherman's Tale", "details_link": "https://www.metacritic.com/game/pc/a-fishermans-tale", "publisher": "Vertigo Games", "release_date": "Jan 10 2019", "developers": ["Innerspace VR"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/c6b446b92a9b6c4dc132cc45a621b270-98.jpg", "descriptions": "Bend and twist reality in A Fisherman’s Tale, the mind-bending VR puzzle adventure game in which being turned upside down and inside out is not merely a play on words."}, {"name": "Immortal Redneck", "details_link": "https://www.metacritic.com/game/xbox-one/immortal-redneck", "publisher": "CremaGames", "release_date": "Feb 27 2018", "developers": ["CremaGames", "Crema Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/fdc2e19d4af2070909f69726f0387760-98.jpg", "descriptions": "Immortal Redneck mixes old-school first-person shooter action with rogue-lite mechanics. Frantic gameplay, twitch controls and an arcade-style feel meet randomly generated dungeons, a complete skill tree, permanent death and nine classes with different traits."}, {"name": "Disgaea 3: Absence of Detention", "details_link": "https://www.metacritic.com/game/playstation-vita/disgaea-3-absence-of-detention", "publisher": "NIS America", "release_date": "Apr 17 2012", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 3", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/de732b6e27e3aef47d8b0dc557fc0bd4-98.jpg", "descriptions": "Disgaea 3: Absence of Detention will feature new characters, stories, and systems from the original Disgaea 3 game."}, {"name": "AlphaBounce", "details_link": "https://www.metacritic.com/game/ds/alphabounce", "publisher": "Motion Twin", "release_date": "Apr 12 2010", "developers": ["Mad Monkey Studio"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 78, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/169db597706927fa9c147d3b20d75365-98.jpg", "descriptions": "[DSiWare]  AlphaBounce combines the classical brick-breaking concept with strong RPG features, offering you the chance to explore an endless universe with millions of levels. Discover items hidden in the deepest corners of the galaxy. Use these items to modify your spaceship and improve your[DSiWare]  AlphaBounce combines the classical brick-breaking concept with strong RPG features, offering you the chance to explore an endless universe with millions of levels. Discover items hidden in the deepest corners of the galaxy. Use these items to modify your spaceship and improve your firepower. You have been taken prisoner by an evil intergalactic mining corporation and exiled to outer space. With the help of your spaceship, your mission is to blast your way through the bricks in order to find a way back to Earth. [Nintendo]… Expand"}, {"name": "Fire Emblem: Radiant Dawn", "details_link": "https://www.metacritic.com/game/wii/fire-emblem-radiant-dawn", "publisher": "Nintendo", "release_date": "Nov  5 2007", "developers": ["Intelligent Systems"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 78, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/7462d58c2c7a7732bf95399e6eaaa0b9-98.jpg", "descriptions": "Three years have passed since King Ashnard of Daein invaded neighboring Crimea and, in doing so, almost doomed the world by awakening the slumbering goddess of chaos. Now, the fires of war burn bright once again, and a band of freedom fighters unites to break the foreign chains that bindThree years have passed since King Ashnard of Daein invaded neighboring Crimea and, in doing so, almost doomed the world by awakening the slumbering goddess of chaos. Now, the fires of war burn bright once again, and a band of freedom fighters unites to break the foreign chains that bind their homeland. As this new war spreads, Ike and the Greil Mercenaries find themselves caught up once again in events that threaten to awaken powers that will judge the world - and find it wanting. A goddess' judgment could threaten once again to bring ruin to all of Tellius. [Nintendo]… Expand"}, {"name": "Max Payne", "details_link": "https://www.metacritic.com/game/game-boy-advance/max-payne", "publisher": "Rockstar Games", "release_date": "Dec 18 2003", "developers": ["Mobius Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 4", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/b3965fe761afd076793de57b106db00c-98.jpg", "descriptions": "Max Payne is a man with nothing to lose--a fugitive undercover cop framed for murder, and now hunted by the cops and the mob.  As Payne, you'll uncover plot twists, engage in dramatic \"bullet-time\" firefights with thugs, and fight your way through an unforgiving New York blizzard.Max Payne is a man with nothing to lose--a fugitive undercover cop framed for murder, and now hunted by the cops and the mob.  As Payne, you'll uncover plot twists, engage in dramatic \"bullet-time\" firefights with thugs, and fight your way through an unforgiving New York blizzard.  Max can wield a variety of weapons including pistols, submachine guns, shotguns, sniper rifles, grenades, and Molotov cocktails.  Prepare yourself for an involving story combined with slick action.  … Expand"}, {"name": "The Simpsons: Hit & Run", "details_link": "https://www.metacritic.com/game/playstation-2/the-simpsons-hit-run", "publisher": "VU Games", "release_date": "Sep 16 2003", "developers": ["Radical Entertainment"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Driving", "Mission-based"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/1cc3455bdffc0aa282cae781dd034c63-98.jpg", "descriptions": "The Simpsons Hit & Run is a mission-based driving game featuring out-of-the-car platform action, the interactive world of Springfield,and the signature humor of the Simpsons. New story and dialogue crafted by writers from The Simpsons television show. All character voices supplied by theThe Simpsons Hit & Run is a mission-based driving game featuring out-of-the-car platform action, the interactive world of Springfield,and the signature humor of the Simpsons. New story and dialogue crafted by writers from The Simpsons television show. All character voices supplied by the cast of The Simpsons television show. Over 56 missions in 7 huge levels. Explore Springfield on foot as Homer, Bart, Lisa, Marge,and Apu. Hidden pick-ups containing trivia material from 300-plus episodes of The Simpsons. [Vivendi Universal]… Expand"}, {"name": "MLB 2003", "details_link": "https://www.metacritic.com/game/playstation/mlb-2003", "publisher": "SCEA", "release_date": "Jun 17 2002", "developers": ["989 Sports"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/d452e4c4f933d28608a5f5476aebb6da-98.jpg", "descriptions": "If you must have a baseball game that features the latest player rosters and you're bound to the old PlayStation, MLB 2003 is the best and only choice."}, {"name": "Pokemon Stadium 2", "details_link": "https://www.metacritic.com/game/nintendo-64/pokemon-stadium-2", "publisher": "Nintendo", "release_date": "Mar 28 2001", "developers": ["HAL Labs"], "platforms": "Nintendo 64", "genres": ["Strategy", "General"], "meta_score": 78, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/8a1153b5cff8381c61772ea884d6456e-98.jpg", "descriptions": "Hundreds of Pokémon in Three-mendous 3-D! What's sweeter than victory in a Pokémon battle! Victory in a 3-D arena on the N64™! Set your strategy and stand back while your Pokémon battle it out. You can even set the Pokémon you've trained--fully rendered inHundreds of Pokémon in Three-mendous 3-D! What's sweeter than victory in a Pokémon battle! Victory in a 3-D arena on the N64™! Set your strategy and stand back while your Pokémon battle it out. You can even set the Pokémon you've trained--fully rendered in 3-D and ready for battle!… Expand"}, {"name": "NBA Live 2001", "details_link": "https://www.metacritic.com/game/pc/nba-live-2001", "publisher": "EA Sports", "release_date": "Feb  7 2001", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/983d27ffd20868b1e6b8e95771948df6-98.jpg", "descriptions": "The dominant hoops franchise returns live, delivering high-flyin', fast-paced NBA action plus a whole lot more. With all-new player reactions and bench sequences, redesigned commentary, and crowd animations, NBA Live 2001 comes alive, bringing more emotion and atmosphere to the court thanThe dominant hoops franchise returns live, delivering high-flyin', fast-paced NBA action plus a whole lot more. With all-new player reactions and bench sequences, redesigned commentary, and crowd animations, NBA Live 2001 comes alive, bringing more emotion and atmosphere to the court than ever before.  [EA Sports]… Expand"}, {"name": "Heavy Metal: F.A.K.K. 2", "details_link": "https://www.metacritic.com/game/pc/heavy-metal-fakk-2", "publisher": "Gathering", "release_date": "Aug  6 2000", "developers": ["Ritual Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Arcade"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/d856c7040eda953547e4a9442e56de93-98.jpg", "descriptions": "In Heavy Metal, you take on the role of F.A.K.K. 2. Take her on a journey of unimaginable proportions where death and danger lie in the most unsuspecting corners of a world you have to see to believe. Only a story straight from the pages of Heavy Metal could give you the goods like F.A.K.K.In Heavy Metal, you take on the role of F.A.K.K. 2. Take her on a journey of unimaginable proportions where death and danger lie in the most unsuspecting corners of a world you have to see to believe. Only a story straight from the pages of Heavy Metal could give you the goods like F.A.K.K. 2 does. [Gathering of Developers]… Expand"}, {"name": "Earth 2150", "details_link": "https://www.metacritic.com/game/pc/earth-2150", "publisher": "SSI", "release_date": "Jun 12 2000", "developers": ["TopWare Interactive"], "platforms": "PC", "num_players": "Up to 15 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Command"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/b91f301f3867b89c5b60d4a54a06bd24-98.jpg", "descriptions": "Meteor showers rain down from above. Climate changes affect how weapons and vehicles function. Fog rolls in early during the morning obstructing view range. Weapons recoil after firing. And full warfare occurs beneath the surface of the earth.  [Mattel Interactive]"}, {"name": "StarLancer", "details_link": "https://www.metacritic.com/game/pc/starlancer", "publisher": "Microsoft Game Studios", "release_date": "Mar 31 2000", "developers": ["Digital Anvil"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/abd34ee0c6b705d3acb5e9ddc4136db1-98.jpg", "descriptions": "Starlancer combines the action of first-person space combat with the drama and intrigue of a classic air combat movie. Countries from around the world including the United States, China, Russia and Great Britain have formed strategic alliances and now battle for control of Earth, Mars andStarlancer combines the action of first-person space combat with the drama and intrigue of a classic air combat movie. Countries from around the world including the United States, China, Russia and Great Britain have formed strategic alliances and now battle for control of Earth, Mars and other planets across the solar system. As part of a newly formed, ragtag aviation unit, the 45th Volunteers Squadron, players must prove themselves and earn the respect of their peers. [Microsoft]… Expand"}, {"name": "Bangai-O HD: Missile Fury", "details_link": "https://www.metacritic.com/game/xbox-360/bangai-o-hd-missile-fury", "publisher": "D3Publisher", "release_date": "May  4 2011", "developers": ["Treasure"], "platforms": "Xbox 360", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/77c712888427fd00cd292f099516a34e-98.jpg", "descriptions": "Bangai-O HD: Missile Fury is an innovative and insanely addicting arcade shooter combined with puzzle elements that features a sensory overload of thousands of missiles and more than 100 levels!  Bangai-O HD: Missile Fury allows players to unleash their creativity with the Level Editor Tool,Bangai-O HD: Missile Fury is an innovative and insanely addicting arcade shooter combined with puzzle elements that features a sensory overload of thousands of missiles and more than 100 levels!  Bangai-O HD: Missile Fury allows players to unleash their creativity with the Level Editor Tool, which allows them to design their own levels and share them with friends online via Xbox LIVE Arcade for the Xbox 360 video game and entertainment system from Microsoft!  Bangai-O HD: Missile Fury is based on the cult-classic games Bangai-O and Bangai-O Sprits developed by TREASURE, the renowned Japanese videogame developer.  This game provides players with strategic and tactical elements, is a must-have for shooter and puzzle game lovers, and fans will have a blast blowing up bosses and lighting up the screen for the first time in high-definition!… Expand"}, {"name": "Tropico 6", "details_link": "https://www.metacritic.com/game/pc/tropico-6", "publisher": "Kalypso", "release_date": "Mar 29 2019", "developers": ["Limbic Entertainment"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/1a0065e638873f1c74cedb1d91a28651-98.jpg", "descriptions": "In times of political turmoil and social unrest, the people are calling out for a visionary leader, one who will steer the fate of their country with foresight and ingenuity. Will you answer that call?"}, {"name": "GRID Autosport", "details_link": "https://www.metacritic.com/game/pc/grid-autosport", "publisher": "Codemasters", "release_date": "Jun 26 2014", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PlayStation 3", "Switch", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "Automobile"], "meta_score": 78, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/c6921cc1ad16ed21e997fa963cee5b74-98.jpg", "descriptions": "It’s all about the teams, the rivals and the race as you become a driver for hire, specialising in your favourite disciplines or conquering them all in an intense world of professional motorsport. GRID Autosport features over 100 routes across 22 incredible locations, the return of in-carIt’s all about the teams, the rivals and the race as you become a driver for hire, specialising in your favourite disciplines or conquering them all in an intense world of professional motorsport. GRID Autosport features over 100 routes across 22 incredible locations, the return of in-car view, authentic handling and the world’s most exciting contemporary and classic high-performance racing cars.﻿… Expand"}, {"name": "Dissidia 012: Duodecim Final Fantasy", "details_link": "https://www.metacritic.com/game/psp/dissidia-012-duodecim-final-fantasy", "publisher": "Square Enix", "release_date": "Mar 21 2011", "developers": ["Square Enix"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/d0edbce20f664deef33fd9dae9e21b03-98.jpg", "descriptions": "Check out new tales of these new warriors and an enhanced battle system."}, {"name": "Mega Man Zero Collection", "details_link": "https://www.metacritic.com/game/ds/mega-man-zero-collection", "publisher": "Capcom", "release_date": "Jun  8 2010", "developers": ["Inti", "Inti Creates"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Compilation", "2D"], "meta_score": 78, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/5b2002600bd2644b8118bdf0d33dedd0-98.jpg", "descriptions": "The 4 Mega Man Zero titles have been brought to and optimized for the DS."}, {"name": "Capcom Arcade 2nd Stadium", "details_link": "https://www.metacritic.com/game/playstation-4/capcom-arcade-2nd-stadium", "publisher": "Capcom", "release_date": "Jul 22 2022", "developers": ["Capcom"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/8/46b69c2e82ee52969ca76d30d5923707-98.jpg", "descriptions": "Included Games: 1943 Kai\rBlack Tiger\rBlock Block\r\nCapcom Sports Club\r\nDarkstalkers: The Night Warriors\r\nEco Fighters\r\nGan Sumoku (GunSmoke)\r\nHissatsu Buraiken (Avengers)\r\nHyper Dyne Side Arms\r\nHyper Street Fighter II: The Anniversary Edition\r\nKnights of the Round\r\nLast Duel\r\nMagic SwordIncluded Games: 1943 Kai\rBlack Tiger\rBlock Block\rCapcom Sports Club\rDarkstalkers: The Night Warriors\rEco Fighters\rGan Sumoku (GunSmoke)\rHissatsu Buraiken (Avengers)\rHyper Dyne Side Arms\rHyper Street Fighter II: The Anniversary Edition\rKnights of the Round\rLast Duel\rMagic Sword\rMega Man: The Power Battle\rMega Man 2: The Power Fighters\rNight Warriors: Darkstalkers’ Revenge\rPnickies\rRally 2011 LED Storm\rSaturday Night Slam Masters\rSavage Bees (Exed Exes)\rSonSon\rStreet Fighter\rStreet Fighter Alpha: Warriors’ Dreams\rStreet Fighter Alpha 2\rStreet Fighter Alpha 3\rSuper Gem Fighter Mini Mix\rSuper Puzzle Fighter II Turbo\rThe King of Dragons\rThe Speed Rumbler (Rush & Crash)\rThree Wonders\rTiger Road\rVampire Savior: The Lord of Vampire… Expand"}, {"name": "Sonic & Sega All-Stars Racing", "details_link": "https://www.metacritic.com/game/ds/sonic-sega-all-stars-racing", "publisher": "Sega", "release_date": "Feb 23 2010", "developers": ["Sumo Digital"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Driving", "Racing", "Arcade", "Kart", "Kart", "Automobile"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/f2d0825970c29980dd39178a8f55695b-98.jpg", "descriptions": "In a frantic battle to the checkered flag, Sonic and friends speed around tracks set in medieval castle ramparts, lush rainforests and bustling cities, all taken from the visually rich and varied universes of Sonic and SEGA. Fan favorites such as Dr. Eggman, Tails, AiAi, Amigo and many moreIn a frantic battle to the checkered flag, Sonic and friends speed around tracks set in medieval castle ramparts, lush rainforests and bustling cities, all taken from the visually rich and varied universes of Sonic and SEGA. Fan favorites such as Dr. Eggman, Tails, AiAi, Amigo and many more will join Sonic in their custom built vehicles, revving their engines and jostling to stay ahead of the pack. Each character will speed around the track in cars, planes, motorbikes, and in Aiai’s case – a banana mobile! Secret short cuts, swift handling and avoiding strategically placed obstacles are certainly the best way to get to the top of the podium. But winning is only part of the fun in Sonic & SEGA All-Stars Racing! Each character has a specific All Star move – such as Super Sonic, Banana Blitz and Tails Tornado – that allows a quick way for competitors to get back into the race! Power ups and weapons can also be collected around the tracks and used against the opposition to ensure they don’t become a threat to that number one position. [Sega]… Expand"}, {"name": "The Magic Obelisk", "details_link": "https://www.metacritic.com/game/wii/the-magic-obelisk", "publisher": "Game Arts", "release_date": "Dec 28 2009", "developers": ["Game Arts"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "Modern"], "meta_score": 78, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/e69bb954f7c55c91cad2f4fb1e30a991-98.jpg", "descriptions": "[WiiWare]  Join the Flight Club to take to the skies and experience a variety of aerial activities. Take off and pilot a biplane through rings along a predetermined flight path, or drift serenely in a hang glider, catching thermal currents to gain altitude. In either case, just be sure to[WiiWare]  Join the Flight Club to take to the skies and experience a variety of aerial activities. Take off and pilot a biplane through rings along a predetermined flight path, or drift serenely in a hang glider, catching thermal currents to gain altitude. In either case, just be sure to stick the landing. Looking for more speed? Strap on the rocket belt to blast your way around an obstacle course. If that's not enough, reach maximum velocity as you tackle a skydiving lesson at 3,800 feet. Complete specific objectives within a set time limit to score points (and maybe even a bonus chance) and obtain certification in eight different lessons. Your goals will become more challenging, and weather conditions will make controlling your vehicle more difficult as you progress. If you succeed, you will be rewarded with the opportunity to pilot an attack helicopter on a daring rescue mission. It's time to earn your wings. [Nintendo]… Expand"}, {"name": "Pro Evolution Soccer 2010", "details_link": "https://www.metacritic.com/game/pc/pro-evolution-soccer-2010", "publisher": "Konami", "release_date": "Oct 23 2009", "developers": ["Konami"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 78, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/63d943c7e66c95dffb32814d8b5df0c9-98.jpg", "descriptions": "PES 2010 focuses on enhancing the excitement of matches between players, making for a truly challenging experience that constantly tests the player. Intuitive zonal defending covers spaces and players need to look constantly for new ways to attack. PES 2010 focuses on being a real soccerPES 2010 focuses on enhancing the excitement of matches between players, making for a truly challenging experience that constantly tests the player. Intuitive zonal defending covers spaces and players need to look constantly for new ways to attack. PES 2010 focuses on being a real soccer simulation, as it requires both strategic play and quick reactions, as in real life. In addition to key out-field elements, goalkeepers are more versatile and with abilities matching those of modern shot-stoppers. The game's referees have also been reworked, with smarter AI elements allowing them to make more balanced calls during matches. PES 2010 has undergone a major visual revamp, with its celebrated player likenesses and animations now even closer to those of real-life players - including live player expressions to be depicted with an improved lighting system which differentiates between various conditions! [Konami]… Expand"}, {"name": "Lunar: Silver Star Story Complete", "details_link": "https://www.metacritic.com/game/playstation/lunar-silver-star-story-complete", "publisher": "Working Designs", "release_date": "May 28 1999", "developers": ["Game Arts"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/fed820fa0375176ea993660031cf65c3-98.jpg", "descriptions": "Return to the world of LUNAR, in the completely reworked 32-bit version of the RPG classic. Journey back to a place where dragons yet live, and magic is valued above all else. Join Alex, the young adventurer, as he begins a quest with his friends to save their land from the crushing advanceReturn to the world of LUNAR, in the completely reworked 32-bit version of the RPG classic. Journey back to a place where dragons yet live, and magic is valued above all else. Join Alex, the young adventurer, as he begins a quest with his friends to save their land from the crushing advance of the Magic Emperor. Explore Dungeons, fight terrifying monsters, and gather information from the locals as you advance toward the explosive encounter with the Magic Emperor himself! Exciting, menu-driven combat will keep you challanged until the last. And, thanks to the storage power of CD and the PlayStation's built-in movie player, LUNAR contains nearly an hour of incredible animation sequences that will get you involved in the story faster than you ever thought possible. Get ready for the ride of your life...… Expand"}, {"name": "Solar Ash", "details_link": "https://www.metacritic.com/game/pc/solar-ash", "publisher": "Annapurna Interactive", "release_date": "Dec  2 2021", "developers": ["Heart Machine"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/ad6c807cef4b98d37b794ee9b2e3d9cc-98.jpg", "descriptions": "Solar Ash is the second game from Heart Machine, the creators of the award winning 2016 game Hyper Light Drifter. Journey through a surreal, vivid and highly stylized world filled with mystery, wild high-speed traversal, endearing characters, and massive enemy encounters."}, {"name": "In Sound Mind", "details_link": "https://www.metacritic.com/game/xbox-series-x/in-sound-mind", "publisher": "Modus Games", "release_date": "Sep 28 2021", "developers": ["We Create Stuff"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "First-Person"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/f201f5e584c6743afc8ce476f2b8b35f-98.jpg", "descriptions": "From the creators of cult classic Nightmare House 2, comes an imaginative psychological horror experience that challenges your expectations and ushers you through the deepest corners of your mind. As you awake in the corridors of an inexplicable building, you find the environment takes on aFrom the creators of cult classic Nightmare House 2, comes an imaginative psychological horror experience that challenges your expectations and ushers you through the deepest corners of your mind. As you awake in the corridors of an inexplicable building, you find the environment takes on a life of its own and leads you to discover a series of victims, all exposed to the same experimental therapy. In your search for answers, bizarre visions emerge and introduce a host of imposing horrors. With your sanity in question, you have no choice but to rely on your instinct…and a cat named Tonia. In Sound Mind is a witty first-person psychological horror with frenetic puzzles, unique boss fights, and original music by The Living Tombstone. Explore and fight through a series of unsettling memories as you journey within the inner workings of the one place you can’t seem to escape—your own mind.… Expand"}, {"name": "Remnant: From the Ashes - Subject 2923", "details_link": "https://www.metacritic.com/game/pc/remnant-from-the-ashes---subject-2923", "publisher": "Perfect World Entertainment", "release_date": "Aug 20 2020", "developers": ["Gunfire Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 78, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/1b3694bc893e78f6be5ff5ad614152a5-98.jpg", "descriptions": "Remnant: From the Ashes – Subject 2923 requires ownership of Remnant: From the Ashes to play. Subject 2923 does not require ownership of the Swamps of Corsus DLC to play. In a brand-new continuation of the Remnant: From the Ashes story, meet unexpected allies, traverse unfamiliar zones andRemnant: From the Ashes – Subject 2923 requires ownership of Remnant: From the Ashes to play. Subject 2923 does not require ownership of the Swamps of Corsus DLC to play. In a brand-new continuation of the Remnant: From the Ashes story, meet unexpected allies, traverse unfamiliar zones and dimensions, and overcome new threats to save your world. Complete new quests and conquer unique bosses to acquire additional gear, increasing your chances of surviving the rugged wilderness of Earth and beyond, as you aim to put an end to the Root and restore humanity.… Expand"}, {"name": "Trials of Mana", "details_link": "https://www.metacritic.com/game/pc/trials-of-mana", "publisher": "Square Enix", "release_date": "Apr 24 2020", "developers": ["Square Enix", "Xeen"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/9397cf8920d5a3c42ca4a7b1106f3c33-98.jpg", "descriptions": "When the world was shrouded in darkness, the Goddess of Mana drew forth the Sword of Mana to smite the eight Benevodons, monsters of destruction. She sealed the horrors inside the eight Mana Stones, bringing the realm back from the brink. Weakened from rebuilding the world, the GoddessWhen the world was shrouded in darkness, the Goddess of Mana drew forth the Sword of Mana to smite the eight Benevodons, monsters of destruction. She sealed the horrors inside the eight Mana Stones, bringing the realm back from the brink. Weakened from rebuilding the world, the Goddess changed herself into a tree and fell into a deep sleep for many years. However, the forces of evil soon sought to free the Benevodons to gain control of the world. They started a terrible war to further their plot and destabilize the kingdoms. Peace was at an end. Mana itself began to disappear from the world and the Mana Tree started to wither...… Expand"}, {"name": "Never Give Up", "details_link": "https://www.metacritic.com/game/switch/never-give-up", "publisher": "Armor Games", "release_date": "Aug 13 2019", "developers": ["Massive Monster"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/c08d2205f0cba792dcff6221807afa66-98.jpg", "descriptions": "Never Give Up is packed full of vicious traps and hazards specifically designed to turn you into bloody chunks. When the going gets tough, the tough don't quit! From the creators of the brutal and beloved web series enjoyed by millions of players worldwide comes another installment ofNever Give Up is packed full of vicious traps and hazards specifically designed to turn you into bloody chunks. When the going gets tough, the tough don't quit! From the creators of the brutal and beloved web series enjoyed by millions of players worldwide comes another installment of hardcore, skill-intensive platforming. Every time you beat a level, another element is layered in to make it even harder. Buzzsaws? Yup. Guided missiles? Mhmm. Giant rhino mechs? You know it. Never Give Up has all that and more with over 250 stages, huge boss battles, and voice acting from Arin Hanson.… Expand"}, {"name": "The Forest", "details_link": "https://www.metacritic.com/game/playstation-4/the-forest", "publisher": "Endnight Studios", "release_date": "Nov  6 2018", "developers": ["Endnight Studios"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/7ed30ecf5e88999470f889cfa905e61a-98.jpg", "descriptions": "As the lone survivor of a passenger jet crash, you find yourself in a mysterious forest battling to stay alive against a society of cannibalistic mutants. Build, explore, and survive in this terrifying first person survival horror simulator."}, {"name": "My Brother Rabbit", "details_link": "https://www.metacritic.com/game/xbox-one/my-brother-rabbit", "publisher": "Artifex Mundi", "release_date": "Sep 21 2018", "developers": ["Artifex Mundi"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Hidden Object"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/d6a04207a66f429d20a2ecd3d9a10937-98.jpg", "descriptions": "An adventure set in a surreal world that mixes reality with a child’s imagination. A young sick girl is left with her brother when her parents set out to find treatment. These children must learn to cope together through the power of imagination."}, {"name": "ATOMIK: RunGunJumpGun", "details_link": "https://www.metacritic.com/game/switch/atomik-rungunjumpgun", "publisher": "Gambitious", "release_date": "Feb  8 2018", "developers": ["Gambitious"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Shooter", "2D", "Shoot-'Em-Up", "Horizontal"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/61b9aeacb14260fdc03282f4fd943c2d-98.jpg", "descriptions": "RunGunJumpGun is a tough as nails game that puts a gravity-defying weapon in your hands. One button lets you fly, the other blasts obstacles out of the way. With a cast of crazed characters, challenging gameplay, and a pulsing musical score, it delivers twitchy platforming goodness."}, {"name": "Disney Infinity 3.0 Edition", "details_link": "https://www.metacritic.com/game/xbox-one/disney-infinity-30-edition", "publisher": "Disney Interactive Studios", "release_date": "Aug 30 2015", "developers": ["Avalanche Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/6f98c48e781af2c0e7cb8d30c3cd7ccf-98.jpg", "descriptions": "Twilight of the Republic is an all-new, original chapter of the Star Wars Saga, set in the Episodes I-III timeline. Get ready to use the Force and Lightsabers in epic battles as Anakin Skywalker, Ahsoka Tano, Obi-Wan Kenobi, Yoda, and Darth Maul."}, {"name": "Greed Corp", "details_link": "https://www.metacritic.com/game/playstation-3/greed-corp", "publisher": "W!Games", "release_date": "Feb 25 2010", "developers": ["W!Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Modern", "General", "Modern"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/b8ee1a2ea762f9337c6bdacb14aa1733-98.jpg", "descriptions": "[Playstation Network]  Why share when you can have it all? Greed Corp is an online multiplayer strategy game in which you battle for dominance over a world once rich in resources. In order to prevail, exhaust all the remaining resources to build an army, and then use the depleted collapsing[Playstation Network]  Why share when you can have it all? Greed Corp is an online multiplayer strategy game in which you battle for dominance over a world once rich in resources. In order to prevail, exhaust all the remaining resources to build an army, and then use the depleted collapsing terrain to your advantage. An extensive campaign mode and multiple unlockables prepare you to take the battle online. Will you defend your territory or sacrifice it to keep it out of enemy hands? Manage the finite available resources to build your army and use the unique collapsing terrain mechanic to your advantage, all while the mist grows closer. [Valcon Games]… Expand"}, {"name": "The Legend of Heroes: Trails of Cold Steel II", "details_link": "https://www.metacritic.com/game/playstation-4/the-legend-of-heroes-trails-of-cold-steel-ii", "publisher": "XSEED Games", "release_date": "Jun  4 2019", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/47f9e0ea6f7d4c8d4ece13bbf1302bcb-98.jpg", "descriptions": "Peace is but a memory.\r In the wake of the Noble Faction's occupation of Heimdallr, civil war has broken out across Erebonia. The provincial armies, loyal to the aristocracy and the Four Great Houses, have claimed many of the nation's great cities in the name of the Noble Alliance. ThePeace is but a memory.\r In the wake of the Noble Faction's occupation of Heimdallr, civil war has broken out across Erebonia. The provincial armies, loyal to the aristocracy and the Four Great Houses, have claimed many of the nation's great cities in the name of the Noble Alliance. The Imperial Army, called back from the four corners of the Empire, has only just begun sweeping its counterattack.\r After Rean managed to escape Trista with Celine and Valimar, he awakens in the mountains near his hometown uncertain what fate befell his friends, who bravely threw themselves in harm's way to buy him time to flee.\r Though the road will not be an easy one, Rean decides to take up his sword again, journeying across Erebonia with his Divine Knight, Valimar, in search of his friends from Class VII and a way to end the conflict before its price becomes far too dear… Expand"}, {"name": "Shakedown Hawaii", "details_link": "https://www.metacritic.com/game/playstation-4/shakedown-hawaii", "publisher": "Vblank Entertainment Inc.", "release_date": "May  7 2019", "developers": ["Vblank Entertainment Inc."], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 5", "PlayStation Vita", "Switch", "Wii U", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 78, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/9e528b6115af81415a9800cff3211106-98.jpg", "descriptions": "Vblank's open world action heads to the tropics, in Shakedown: Hawaii. From the boardroom to the streets, Shakedown parodies big business and the white collar crimes that go alongside. Build your empire, monopolize the markets, and collaterally re-zone the island's destructible sandbox."}, {"name": "Call of Duty: Ghosts", "details_link": "https://www.metacritic.com/game/xbox-one/call-of-duty-ghosts", "publisher": "Activision", "release_date": "Nov 19 2013", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 78, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/ed7158633c9dbf43bdd838fdb9067360-98.jpg", "descriptions": "This new chapter in the Call of Duty franchise features a unique dynamic in which players are on the side of a crippled nation fighting not for freedom, or liberty, but simply for survival. 10 years after a devastating mass event, the nation's borders and the balance of global power haveThis new chapter in the Call of Duty franchise features a unique dynamic in which players are on the side of a crippled nation fighting not for freedom, or liberty, but simply for survival. 10 years after a devastating mass event, the nation's borders and the balance of global power have been permanently redrawn. As what's left of the nation's Special Operations forces, a surreptitious group known only as \"Ghosts\" leads the fight back against a newly emerged, technologically-superior global power. There are over 20 NEW Kill Streaks in Call of Duty: Ghosts — such as Juggernaut Maniac, Helo-Scout, Vulture and the ODIN Strike. You can even bring in Riley, from the single-player campaign, as your guard dog to warn you when enemies approach, and to attack enemies if they get too close to your person.… Expand"}, {"name": "The Walking Dead: Season Two Episode 4 - Amid the Ruins", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-season-two-episode-4---amid-the-ruins", "publisher": "Telltale Games", "release_date": "Jul 22 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "genres": ["General", "Action", "Adventure", "General", "Point-and-Click"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/2e37ca75c6163e978698adf70dd1a644-98.jpg", "descriptions": "Free from their brutal captor, the group continues their journey north. However, hunger, violence and death have taken their toll. Smoldering conflicts and inevitable changes within the group remind Clementine that danger can come from within, as well as from the outside; she must choose herFree from their brutal captor, the group continues their journey north. However, hunger, violence and death have taken their toll. Smoldering conflicts and inevitable changes within the group remind Clementine that danger can come from within, as well as from the outside; she must choose her allies wisely in this second-to-last episode of The Walking Dead: Season Two.… Expand"}, {"name": "Call of Juarez: Bound in Blood", "details_link": "https://www.metacritic.com/game/pc/call-of-juarez-bound-in-blood", "publisher": "Ubisoft", "release_date": "Jun 30 2009", "developers": ["Techland"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/17b9474ed715145f6ea3f6658524efe1-98.jpg", "descriptions": "Call of Juarez: Bound in Blood transports players from a ravaged Civil War-era Georgia to the Aztec ruins of Mexico. In the wildest West ever depicted, players can embody both McCall brothers in an intense storyline full of greed, lust and lawlessness that takes place during a legendaryCall of Juarez: Bound in Blood transports players from a ravaged Civil War-era Georgia to the Aztec ruins of Mexico. In the wildest West ever depicted, players can embody both McCall brothers in an intense storyline full of greed, lust and lawlessness that takes place during a legendary period of American history.  Become a Gunslinger - Harness a variety of weapons from various revolvers to heavy-caliber cannons and machine guns. Every accurate shot increases concentration, which allows players to unleash deadly shooting modes when outnumbered and even deadlier ones when the brothers work together. Dual Collaborative Gameplay - Players choose to embody Ray or Thomas, each with a distinctive gameplay style (close or long range), specific abilities (lasso, dynamite, etc.) and arsenal of deadly weapons (dual guns, long-range carbine, etc.). Take advantage of each of their strengths and join in the fiercest fights imaginable. Never Before Seen Western Experience - Experience the iconic settings full of outlaws - the West before it was tamed. The McCall brothers face a renegade Apache Chief, a greedy Mexican bandit, a vindictive Colonel, and others, all driven by greed with moral disregard. Enjoy a wide variety of situations, using horses, canoes and wagons to explore the vast natural landscapes of the fabled Wild West and its legendary period. Innovative Online Multiplayer - Developed in unison with the single player mode, multiplayer offers numerous modes and maps, resulting in endless hours of Wild West mayhem. Gunslingers, bandits and marshals struggle online for the bounty. Multiple characters are unlocked for team-based objective modes or the straightforward team death match. With a new Bounty system, players increase the bounty on their head with more kills. Get rid of the deadliest among you to increase your bank roll. [Ubisoft]… Expand"}, {"name": "Assassin's Creed Syndicate", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-syndicate", "publisher": "Ubisoft", "release_date": "Oct 23 2015", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Action Adventure", "Open-World"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/da26d1b3d720dc363580c0da4b0e0c72-98.jpg", "descriptions": "1868 London. The Industrial Revolution. An age of invention and wealth, built on the backs of the working class. As gangster killer Jacob Frye, you recruit a gang to fight for justice on behalf of the oppressed working class. Lead the underworld to reclaim London in an adventure filled with1868 London. The Industrial Revolution. An age of invention and wealth, built on the backs of the working class. As gangster killer Jacob Frye, you recruit a gang to fight for justice on behalf of the oppressed working class. Lead the underworld to reclaim London in an adventure filled with action, intrigue and brutal combat. With Jacob as the leader, players can establish UK's fiercest gang, the only force that can challenge the elite and defeat rival gangs to bring freedom to the oppressed folks. Enemy strongholds can be infiltrated by using an arsenal to dominate London’s underworld. From robbing trains to rescuing child workers, players will do everything they can to bring justice to London’s lawless streets. [Ubisoft]… Expand"}, {"name": "Crisis Core: Final Fantasy VII Reunion", "details_link": "https://www.metacritic.com/game/playstation-5/crisis-core-final-fantasy-vii-reunion", "publisher": "Square Enix", "release_date": "Dec 13 2022", "developers": ["Square Enix", "TOSE"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/9d8d377a6b94eb7277b4caed5d2b91e2-98.jpg", "descriptions": "CRISIS CORE -FINAL FANTASY VII- REUNION is a full remaster of the PlayStation Portable exclusive CRISIS CORE -FINAL FANTASY VII-, which originally launched back in 2007. CRISIS CORE -FINAL FANTASY VII- REUNION is a true remaster that follows the original's narrative: Zack Fair's mission toCRISIS CORE -FINAL FANTASY VII- REUNION is a full remaster of the PlayStation Portable exclusive CRISIS CORE -FINAL FANTASY VII-, which originally launched back in 2007. CRISIS CORE -FINAL FANTASY VII- REUNION is a true remaster that follows the original's narrative: Zack Fair's mission to find the missing SOLDIER Genesis Rhapsodos. It features multiple improvements from the original game - for example, the graphics have been converted to HD, with all the 3D models, from the characters to everything else, being fully refreshed. What's more the dialogue is now fully voice-acted, and there's a new arrangement for the soundtrack!… Expand"}, {"name": "Metal Slug Anthology", "details_link": "https://www.metacritic.com/game/psp/metal-slug-anthology", "publisher": "SNK Playmore", "release_date": "Feb 20 2007", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "PlayStation 4", "PSP"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/ecd1b61b907fa57ce1395a6e83e90b5c-98.jpg", "descriptions": "SNK Playmore, in celebration of the 10th Anniversary of their classic arcade franchise Metal Slug, releases the greatest array of Metal Slug titles ever assembled for the PSP including Metal Slug, Metal Slug 2, Metal Slug X, Metal Slug 3, Metal Slug 4, and Metal Slug 5. The METAL SLUGSNK Playmore, in celebration of the 10th Anniversary of their classic arcade franchise Metal Slug, releases the greatest array of Metal Slug titles ever assembled for the PSP including Metal Slug, Metal Slug 2, Metal Slug X, Metal Slug 3, Metal Slug 4, and Metal Slug 5. The METAL SLUG COLLECTION is a \"perfect translation\" of the arcade classics and features Wireless support for intense two-player action. [SNK Playmore]… Expand"}, {"name": "John Wick Hex", "details_link": "https://www.metacritic.com/game/playstation-4/john-wick-hex", "publisher": "Good Shepherd Entertainment", "release_date": "May  5 2020", "developers": ["Mike Bithell"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 78, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/9cf2b7f806d6a04067b7ae5098369e46-98.jpg", "descriptions": "John Wick Hex is a fast-paced, action-oriented strategy game that makes you think and strike like John Wick, the professional hitman of the critically acclaimed film franchise. Created in close cooperation with the creative teams behind the films, John Wick Hex is fight-choreographed chessJohn Wick Hex is a fast-paced, action-oriented strategy game that makes you think and strike like John Wick, the professional hitman of the critically acclaimed film franchise. Created in close cooperation with the creative teams behind the films, John Wick Hex is fight-choreographed chess brought to life as a video game, capturing the series’ signature gun fu style while expanding its story universe. Players must make quick decisions and choose every action and attack they make, all the while considering their immediate cost and consequences.… Expand"}, {"name": "Hearthstone: Heroes of Warcraft - Curse of Naxxramas", "details_link": "https://www.metacritic.com/game/pc/hearthstone-heroes-of-warcraft---curse-of-naxxramas", "publisher": "Blizzard Entertainment", "release_date": "Jul 22 2014", "developers": ["Blizzard Entertainment"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle"], "meta_score": 78, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/aa27a298a3746c12a07457fda33ffddc-98.jpg", "descriptions": "A whole new game mode, thirty new cards for your collection, a brand-new board, and the chance to school some of the Scourges most infamous champions  all this and more awaits in Curse of Naxxramas!\r Curse of Naxxramas is a single-player PVE adventure integrated within Hearthstone. InA whole new game mode, thirty new cards for your collection, a brand-new board, and the chance to school some of the Scourges most infamous champions  all this and more awaits in Curse of Naxxramas!\r Curse of Naxxramas is a single-player PVE adventure integrated within Hearthstone. In Curse of Naxxramas, you face off against powerful bosses as you battle your way through the dread necropolis and its hordes of undead fiends. You will encounter villains such as the wily warlock Heigan the Unclean, the vile abomination Thaddius, and none other than the master of Naxxramas himself, the lich KelThuzad. Itll be a challenge, but if you outwit these fearsome foes you will reap the awesome rewards of the undead stronghold.… Expand"}, {"name": "Rock Band Blitz", "details_link": "https://www.metacritic.com/game/xbox-360/rock-band-blitz", "publisher": "Harmonix Music Systems", "release_date": "Aug 29 2012", "developers": ["Harmonix Music Systems"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/19c6044a040748133e32a299daaaedb9-98.jpg", "descriptions": "Rock Band Blitz is the first download-only entry in the Rock Band franchise from Harmonix."}, {"name": "Worms W.M.D", "details_link": "https://www.metacritic.com/game/playstation-4/worms-wmd", "publisher": "Team17", "release_date": "Aug 23 2016", "developers": ["Team17"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Strategy", "Turn-Based", "Artillery"], "meta_score": 78, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/8854bb229ff643f47a286eb5b20dc0c8-98.jpg", "descriptions": "With a hand-drawn 2D look, brand new weapons, the introduction of crafting, vehicles and buildings plus the return of some classic weapons and gameplay, Worms W.M.D is back."}, {"name": "Oreshika: Tainted Bloodlines", "details_link": "https://www.metacritic.com/game/playstation-vita/oreshika-tainted-bloodlines", "publisher": "SCEA", "release_date": "Mar  3 2015", "developers": ["Alfa System"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/785cffe2bf227a005192dc597b5d4012-98.jpg", "descriptions": "Oreshika is a tale of revenge that takes place in ancient Japan. Your clan was sentenced to death for crimes they did not commit, and then had two curses placed on them. You have just been resurrected by a god and are now searching for those who cursed and conspired against your clan so thatOreshika is a tale of revenge that takes place in ancient Japan. Your clan was sentenced to death for crimes they did not commit, and then had two curses placed on them. You have just been resurrected by a god and are now searching for those who cursed and conspired against your clan so that you may redeem the honor of your family name. [Playstation.com]… Expand"}, {"name": "The Sims 2 Seasons", "details_link": "https://www.metacritic.com/game/pc/the-sims-2-seasons", "publisher": "Electronic Arts", "release_date": "Feb 27 2007", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/840e9dcd9e7c512a5037ccd8f9a3571e-98.jpg", "descriptions": "Experiencing all four seasons for the first time – from seasonal activities to all-new outerwear for unpredictable weather – provides a whole new level of excitement for your Sims. Not only will your Sims experience the seasons changing in winter, spring, summer and fall, but each seasonExperiencing all four seasons for the first time – from seasonal activities to all-new outerwear for unpredictable weather – provides a whole new level of excitement for your Sims. Not only will your Sims experience the seasons changing in winter, spring, summer and fall, but each season will deliver unique benefits, impacting your Sims relationships, mood, skills, careers and more. And be sure to dress your Sims appropriately for the weather -- freezing, sunburn and other unexpected weather effects can occur. Whether you're strengthening family ties in winter, letting romance bloom in spring, deepening the bonds of friendship in summer, or fast-tracking your career in fall, the seasons have a whole new impact on your Sims' lives throughout the year. Avoid the heat; take a dip in the pool and play Marco Polo. Go skating on an ice rink; have snowball fights, build snowmen or make snow angels. Each season unfolds differently delivering stunning visuals of weather effects and seasonal changes including snow, rain, hail, lightning and more ensuring a unique gameplay experience for many seasons to come. Show Off Your Sims' Green Thumb; make your garden blossom and reap the rewards. And as an added bonus, crops that harvest at the peak time can produce varying juices that reap special benefits, from love potions and energy boosts to cold fighters and smart juices. Time to drink up! [Electronic Arts]… Expand"}, {"name": "Lost in Random", "details_link": "https://www.metacritic.com/game/switch/lost-in-random", "publisher": "Electronic Arts", "release_date": "Sep 10 2021", "developers": ["Zoink!"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/9a9b29c83d6eead8bcfe8fb1a11f60ed-98.jpg", "descriptions": "Play the odds in Lost in Random™, a gothic fairytale-inspired action adventure where every citizen’s fate is determined by the roll of a dice. Ruled by a wicked Queen, the kingdom of Random is divided into six shadowy realms where life is dictated by a cursed black dice. In this story, fromPlay the odds in Lost in Random™, a gothic fairytale-inspired action adventure where every citizen’s fate is determined by the roll of a dice. Ruled by a wicked Queen, the kingdom of Random is divided into six shadowy realms where life is dictated by a cursed black dice. In this story, from the award-winning Swedish game studio Zoink and penned by Eisner Award-winning Adventure Time and Marvel Comics The Unbeatable Squirrel Girl author Ryan North, you’ll join Even, a penniless girl who’s down on her luck, in a dark quest to save her beloved sister. With her companion Dicey, a small and strange living dice, Even must learn to embrace the chaos of Random, uncovering an age-old tale with a modern message. Walk Random’s mysterious cobbled streets, meet its unpredictable residents, and take on courageous quests. Engage in fearsome battles with a unique blend of tactical combat, card collection, and explosive dice gameplay. It’s time to adapt or perish, as you battle inside giant board game arenas that change with every dice throw! Learn how to tip the odds in your favor, and dive into a dark wonderland where only the brave survive.… Expand"}, {"name": "The Textorcist: The Story of Ray Bibbia", "details_link": "https://www.metacritic.com/game/pc/the-textorcist-the-story-of-ray-bibbia", "publisher": "Headup Games", "release_date": "Feb 14 2019", "developers": ["Morbidware"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/a2dad4586e7052c9be04fe7146bbfa36-98.jpg", "descriptions": "Get ready for an electrifying mix between a bullet hell and a typing game! Dodge bullets while typing exorcisms at the very same time: turn on both sides of your brain and jump into the adventure of Ray Bibbia."}, {"name": "Darknet", "details_link": "https://www.metacritic.com/game/playstation-4/darknet", "publisher": "Archiact Interactive Ltd.", "release_date": "Mar  7 2017", "developers": ["Archiact Interactive Ltd."], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 78, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/b81b263c9fba0b4354b7139da33615b0-98.jpg", "descriptions": "Darknet is a strategy/puzzle game in which you play as an elite hacker contracted to retrieve data from the world’s most secure networks. Plug into the Net, install viruses, inject code, and tunnel through cyber-security in an experience inspired by the classic cyberpunk vision of theDarknet is a strategy/puzzle game in which you play as an elite hacker contracted to retrieve data from the world’s most secure networks. Plug into the Net, install viruses, inject code, and tunnel through cyber-security in an experience inspired by the classic cyberpunk vision of the future. [Playstation.com]… Expand"}, {"name": "Amnesia Collection", "details_link": "https://www.metacritic.com/game/playstation-4/amnesia-collection", "publisher": "Frictional Games", "release_date": "Nov 22 2016", "developers": ["Frictional Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/66f0fdac552a8597e94233b4e81938fe-98.jpg", "descriptions": "Immerse yourself in three living nightmares that promise to chill you to the core. The collection contains three Amnesia titles: The Dark Descent, A Machine For Pigs, and Justine."}, {"name": "Life is Strange: Episode 2 - Out of Time", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-episode-2---out-of-time", "publisher": "Square Enix", "release_date": "Mar 24 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/fbf963aa4ff01f0edde13c53cc967eef-98.jpg", "descriptions": "Reunited with her friend Chloe, Max begins experimenting with her power and starts to wonder if it is related to her visions or the weird snow from the previous day. But life goes on in Blackwell Academy and a certain viral video has become a serious topic of discussion. Meanwhile, what DIDReunited with her friend Chloe, Max begins experimenting with her power and starts to wonder if it is related to her visions or the weird snow from the previous day. But life goes on in Blackwell Academy and a certain viral video has become a serious topic of discussion. Meanwhile, what DID happen to Rachel Amber? … Expand"}, {"name": "Kinect Nat Geo TV", "details_link": "https://www.metacritic.com/game/xbox-360/kinect-nat-geo-tv", "publisher": "Microsoft Game Studios", "release_date": "Sep 18 2012", "developers": ["Relentless Software"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/fc3c55e386108240f709fce26ce366cd-98.jpg", "descriptions": "Kinect Nat Geo TV mixes family TV night with family game night by combining Kinect's \"reach in and explore\" interactivity with content from Nat Geo WILD. Solve mystifying puzzles, learn about the natural environment, get to know exotic animals and get inspired to care for the planet."}, {"name": "Joint Operations: Escalation", "details_link": "https://www.metacritic.com/game/pc/joint-operations-escalation", "publisher": "NovaLogic", "release_date": "Nov 19 2004", "developers": ["NovaLogic"], "platforms": "PC", "num_players": "64+ ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/c2cfd11a93fa9547a2446df90dd69640-98.jpg", "descriptions": "The conflict in Indonesia has spilled over to other parts of Asia where rebel troops have gained support in the war against Joint Ops Forces. Set against the lush backdrop of South East Asia, enlist once more to take part in intense large scale modern FPS combat, in games of up to 150The conflict in Indonesia has spilled over to other parts of Asia where rebel troops have gained support in the war against Joint Ops Forces. Set against the lush backdrop of South East Asia, enlist once more to take part in intense large scale modern FPS combat, in games of up to 150 players online. Use new weapons, vehicles, team tactics and strategic gameplay to dominate the battlefield. An expansion pack to \"Joint Operations: Typhoon Rising.\"  [NovaLogic]… Expand"}, {"name": "Skylanders Trap Team", "details_link": "https://www.metacritic.com/game/playstation-4/skylanders-trap-team", "publisher": "Activision", "release_date": "Oct  5 2014", "developers": ["Toys for Bob"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "3D"], "meta_score": 78, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/b661a90b84626c2f96bc57f37b4f0b05-98.jpg", "descriptions": "Bring the Skylanders to life. All the Skylander characters from Skylanders Spyro's Adventure, Skylanders Giants and Skylanders SWAP Force work with Skylanders Trap Team, including an entirely new cast: The Trap Masters. Trap and play as villains: Take control of bad guys. Trap bad guys withBring the Skylanders to life. All the Skylander characters from Skylanders Spyro's Adventure, Skylanders Giants and Skylanders SWAP Force work with Skylanders Trap Team, including an entirely new cast: The Trap Masters. Trap and play as villains: Take control of bad guys. Trap bad guys with the power of TraptaniumT, release them from the crystals and use their awesome powers for good. [Activision]… Expand"}, {"name": "Charlie Murder", "details_link": "https://www.metacritic.com/game/xbox-360/charlie-murder", "publisher": "Microsoft Game Studios", "release_date": "Aug 14 2013", "developers": ["Ska Studios"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/a523e28b77179464d3027d239ece3017-98.jpg", "descriptions": "A four-player arcade beat 'em up featuring all four members of the revolutionary punk act who are on a crusade to retrieve front man Charlie Murder's girlfriend, Skelekitten, from their chart topping metal rivals."}, {"name": "Call of Duty: Ghosts", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-ghosts", "publisher": "Activision", "release_date": "Nov 15 2013", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 78, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/1/e83b87f8b481471e0e6523eb3eae4bbd-98.jpg", "descriptions": "This new chapter in the Call of Duty franchise features a unique dynamic in which players are on the side of a crippled nation fighting not for freedom, or liberty, but simply for survival. 10 years after a devastating mass event, the nation's borders and the balance of global power haveThis new chapter in the Call of Duty franchise features a unique dynamic in which players are on the side of a crippled nation fighting not for freedom, or liberty, but simply for survival. 10 years after a devastating mass event, the nation's borders and the balance of global power have been permanently redrawn. As what's left of the nation's Special Operations forces, a surreptitious group known only as \"Ghosts\" leads the fight back against a newly emerged, technologically-superior global power. There are over 20 NEW Kill Streaks in Call of Duty: Ghosts — such as Juggernaut Maniac, Helo-Scout, Vulture and the ODIN Strike. You can even bring in Riley, from the single-player campaign, as your guard dog to warn you when enemies approach, and to attack enemies if they get too close to your person.… Expand"}, {"name": "Viva Pinata", "details_link": "https://www.metacritic.com/game/pc/viva-pinata", "publisher": "Microsoft Game Studios", "release_date": "Nov  6 2007", "developers": ["Climax Group", "Climax Studios"], "platforms": ["Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/b418bbabd03a3c9ed85ec5526cf5ddc9-98.jpg", "descriptions": "Viva Piñata is a wacky, zany, and anything-can-happen comedy series that answers the question, for the first time ever, “Where do Piñatas come from?” In a lush environment on Piñata Island, a multitude of happy, colorful Piñatas live the sweet life, frolicking, dancing and filling themselvesViva Piñata is a wacky, zany, and anything-can-happen comedy series that answers the question, for the first time ever, “Where do Piñatas come from?” In a lush environment on Piñata Island, a multitude of happy, colorful Piñatas live the sweet life, frolicking, dancing and filling themselves up with the most delicious goodies a child could ever want! Then they eagerly await the glorious day when they are ‘chosen’ by the Piñata Factory to attend birthday parties, and special celebrations all over the world, bringing joy, treats and tons o’ fun to kids of all ages. It’s no wonder that wherever the Piñatas go, they’re the life of the party. Viva Piñata is a window to fantastical world full of wild-roaming Piñata. Players choose from hundreds of elements to customize heir world in order to attract piñatas, foster good relationships among the 60+ piñata, and navigate the conflicts and dangers that threaten to break them open. [Microsoft]… Expand"}, {"name": "EyeToy: Kinetic", "details_link": "https://www.metacritic.com/game/playstation-2/eyetoy-kinetic", "publisher": "SCEA", "release_date": "Nov 22 2005", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "General"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/f6c44fc3b86a611310cd5299140120c9-98.jpg", "descriptions": "EyeToy: Kinetic offers a wide variety of fitness activities that far exceeds the traditional 'home workout video'. The EyeToy camera, with the addition of a newly developed Wide Angled Lens that attaches to the front of the camera, allows for increased levels of interactivity projecting theEyeToy: Kinetic offers a wide variety of fitness activities that far exceeds the traditional 'home workout video'. The EyeToy camera, with the addition of a newly developed Wide Angled Lens that attaches to the front of the camera, allows for increased levels of interactivity projecting the exerciser's image onto the television screen, enabling them to physically interact with their environments. With four areas of discipline to choose from, EyeToy: Kinetic offers a wide variety of exercises for players to choose from. Aero Motion and Combat zones help to increase the player's overall fitness level, inspired by moves and stances from activities such as Tai Kwon Do, Modern Dance, Kick Boxing, Aerobics and Karate. The Mind and Body zone focuses on breathing, concentration and flexibility, taking inspirations from Yoga and Tai Chi, leaving players feeling relaxed, yet with their body fully conditioned. The Toning zone helps the player to tone specific muscle groups utilizing slow and refined movements. [SCEE]… Expand"}, {"name": "Bejeweled Twist", "details_link": "https://www.metacritic.com/game/pc/bejeweled-twist", "publisher": "PopCap", "release_date": "Oct 27 2008", "developers": ["PopCap"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/f7e6a95dd2c3d3830d290b1631046111-98.jpg", "descriptions": "Get set for a vivid sensory rush as you spin and match explosive gems for shockwaves of fun. Rotate jewels freely to set up electrifying combos, outwit obstacles, and blast high-voltage gems. Rev up with a strategic challenge or just relax in the gem-spinning zone. Any way you play, you'llGet set for a vivid sensory rush as you spin and match explosive gems for shockwaves of fun. Rotate jewels freely to set up electrifying combos, outwit obstacles, and blast high-voltage gems. Rev up with a strategic challenge or just relax in the gem-spinning zone. Any way you play, you'll find endless ways to win! [PopCap Games]… Expand"}, {"name": "Mercury Meltdown", "details_link": "https://www.metacritic.com/game/psp/mercury-meltdown", "publisher": "Ignition Entertainment", "release_date": "Oct  3 2006", "developers": ["Ignition Entertainment"], "platforms": "PSP", "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/296b543696c2405de61676e4c37dc849-98.jpg", "descriptions": "Once again taking control of the liquid Mercury 'blob', players must avoid various obstacles and hazards to reach the end goal. The Mercury blob itself has now been given an overhaul and has 4 varying 'states' – Normal, Solid, Fast and Slow. These states allow for larger more complex levels,Once again taking control of the liquid Mercury 'blob', players must avoid various obstacles and hazards to reach the end goal. The Mercury blob itself has now been given an overhaul and has 4 varying 'states' – Normal, Solid, Fast and Slow. These states allow for larger more complex levels, which in turn mean a greater challenge and more enjoyment to be had for the player. The number of levels has more than doubled – now 160+, and with the newly added feature of Downloadable Content more levels will be made available at a later date. Wireless 2 Player modes have also been an important addition, with 5 sub games each providing a challenge against the computer or a friend. [Ignition Entertainment]… Expand"}, {"name": "Andro Dunos 2", "details_link": "https://www.metacritic.com/game/switch/andro-dunos-2", "publisher": "Just For Games", "release_date": "Mar 24 2022", "developers": ["Picorinne Soft", "Pixelheart"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/14cb219e8ecfcd20df25dd16d3be2fa4-98.jpg", "descriptions": "Andro Dunos (アンドロデュノス, in japanese) is a side scrolling arcade game from shoot’em up category (Shmup). It was originally released in 1992 by SNK.\rIn Andro Dunos 2, players take control of the Yellow Cherry once more, sent to end the long war with the aliens once and for all.\rThe ship hasAndro Dunos (アンドロデュノス, in japanese) is a side scrolling arcade game from shoot’em up category (Shmup). It was originally released in 1992 by SNK.\rIn Andro Dunos 2, players take control of the Yellow Cherry once more, sent to end the long war with the aliens once and for all.\rThe ship has four distinct weapons that can be improved by collecting bonuses as you progress through the different levels.\r Features:\r – The direct sequel to one of the most famous shmup from 1990s : Andro Dunos!\r– An epic side-scrolling space journey awaits you in Andro Dunos 2!\r– Fight and explode hundred of spaceships thanks to various weapons such as laser, hawk... or even homing missiles!\r– Recover power ups by killing enemies.\r– Music composed by Allister Brimble… Expand"}, {"name": "The Banner Saga 2", "details_link": "https://www.metacritic.com/game/playstation-4/the-banner-saga-2", "publisher": "Versus Evil", "release_date": "Jul  5 2016", "developers": ["Stoic"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/a4079671fb7153dd579f4931da0b6c99-98.jpg", "descriptions": "Bold leadership decisions, wise use of resources, and skillful battle tactics are vital to ensure your Viking clans make it through alive. If played, your choices will carry over from the first game, or you can start fresh with new preset characters."}, {"name": "Plants vs Zombies: Garden Warfare", "details_link": "https://www.metacritic.com/game/pc/plants-vs-zombies-garden-warfare", "publisher": "Electronic Arts", "release_date": "Jun 24 2014", "developers": ["PopCap"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["General", "Action", "General", "Shooter", "Third-Person", "Tactical"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/4805523d7babab23411340f2cd04bc2f-98.jpg", "descriptions": "Plants vs. Zombies is digging into the trenches with an explosive new 3D experience. Blast zombies, plants, and new characters with inventive weapons across a mine-blowing PvZ world. Take on Co-Op and Multiplayer action with your friends and sow the seeds of victory."}, {"name": "Dragon Ball: Origins", "details_link": "https://www.metacritic.com/game/ds/dragon-ball-origins", "publisher": "Atari", "release_date": "Nov  4 2008", "developers": ["Game Republic"], "platforms": "DS", "num_players": "2  Online", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/9e718636dae3afdc33b742cc907e1309-98.jpg", "descriptions": "The single player game follows Goku and his clever sidekick Bulma as they travel the world overcoming enemies and obstacles to collect the 7 Dragon Balls. In the shoes of Goku, the player must protect Bulma from incoming enemy attacks using special skills, such as fighting with his powerThe single player game follows Goku and his clever sidekick Bulma as they travel the world overcoming enemies and obstacles to collect the 7 Dragon Balls. In the shoes of Goku, the player must protect Bulma from incoming enemy attacks using special skills, such as fighting with his power pole, or unleashing a kamehameha. Combined with Bulma’s ability to invent machines and weapons, the intrepid pair make a formidable team able to defeat even the strongest enemies or trickiest of obstacles. [Atari]… Expand"}, {"name": "SingStar '80s", "details_link": "https://www.metacritic.com/game/playstation-2/singstar-80s", "publisher": "SCEA", "release_date": "Sep 18 2007", "developers": ["SCEA"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/391074633add60f8687886ff01fc3bb4-98.jpg", "descriptions": "(Currently available in the UK/EU only)  Everyone who's played SingStar with a bunch of friends knows it's the most fun you can have in your living room. Now, relive some of the finest musical moments of your youth in SingStar '80s. Bring the decade back to life with your own glorious(Currently available in the UK/EU only)  Everyone who's played SingStar with a bunch of friends knows it's the most fun you can have in your living room. Now, relive some of the finest musical moments of your youth in SingStar '80s. Bring the decade back to life with your own glorious renditions of top tunes from the likes of Simple Minds, The Cure, Vanilla Ice and Europe. Fill your lungs with air and deliver the finest power ballad your neighbours will ever hear. Shed tears of joy as you hear the songs that shaped your very being delivered by over-enthusiastic acquaintances. Experience the '80s as they were always meant to sound with SingStar '80s. [SCEE]… Expand"}, {"name": "Fury Unleashed", "details_link": "https://www.metacritic.com/game/playstation-4/fury-unleashed", "publisher": "Awesome Games Studio", "release_date": "May  8 2020", "developers": ["Awesome Games Studio"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/2b1f1b288091c40ad0c94ca75de6c601-98.jpg", "descriptions": "Fury Unleashed is an action platformer where you shoot your way through the pages of an ever-changing comic book. Take advantage of unique combo system to unleash your fury and become a whirling tornado of destruction. Discover why your creator doubted in you and prove him wrong."}]