[{"name": "Danger Zone", "details_link": "https://www.metacritic.com/game/playstation-4/danger-zone", "publisher": "Three Fields Entertainment", "release_date": "May 30 2017", "developers": ["Three Fields Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Racing", "General", "Arcade", "Vehicle", "Automobile", "Civilian"], "meta_score": 64, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/44643f23af6adb0a3a744bcc572cf131-98.jpg", "descriptions": "DDangerZoneanger Zone is a 3D vehicular destruction game. The concept is simple : crash for cash by creating the biggest car crash."}, {"name": "Redeemer", "details_link": "https://www.metacritic.com/game/pc/redeemer", "publisher": "Gambitious", "release_date": "Aug  1 2017", "developers": ["Sobaka"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/14cf7d6dd47dc65948f2d45dd2f183d5-98.jpg", "descriptions": "REDEEMER is a intense Brawler where you will punch, hack and blast your way through enemies using fists, hammers, fire arms and even the environment."}, {"name": "STRAFE", "details_link": "https://www.metacritic.com/game/pc/strafe", "publisher": "Devolver Digital", "release_date": "May  9 2017", "developers": ["Pixel Titans"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 64, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/0afe42f20159a8122978bb71dd35e558-98.jpg", "descriptions": "The future of video games: the fastest, bloodiest, deadliest, most adjective-abusing, action-packed first-person shooter of 1996."}, {"name": "Resident Evil: Resistance", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-resistance", "publisher": "Capcom", "release_date": "Apr  3 2020", "developers": ["Capcom", "NeoBards Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Survival"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/7343475306c4c2df990fe7dd582b1610-98.jpg", "descriptions": "Welcome to Raccoon City, home of Umbrella and its world class biomedical research.Capcom's Project Resistance is a new 1 vs. 4 asymmetric online survival horror experience set in the world of Resident Evil. Unleash your inner evil as a cunning Mastermind or join the fight as one of theWelcome to Raccoon City, home of Umbrella and its world class biomedical research.Capcom's Project Resistance is a new 1 vs. 4 asymmetric online survival horror experience set in the world of Resident Evil. Unleash your inner evil as a cunning Mastermind or join the fight as one of the resourceful Survivors desperately trying to escape every obstacle the Mastermind puts in their way![Mastermind]They secretly kidnap young people for the purpose of data gathering.By forcing these youths into desperate situations, the Mastermind aims to gather valuable research data on how the subjects respond to fear. The Mastermind will not face the Survivors directly. Instead, they observe through the security cameras, setting traps to prevent their escape.[Cameras]The Mastermind can observe the Survivors' actions through the security cameras placed all around the facility.[Cards]The Mastermind can use cards to create all sorts of chaos including placing traps and vicious creatures on the map and weaponizing security cameras.[Creatures]The Mastermind can take direct control of zombies and the Tyrant to attack Survivors.[Survivors]A group of youths with different backgrounds who were captured by Umbrella for use in its experiments.They only have one objective: escape. Survivors will need to use their unique skills effectively to cover each other and defeat the creatures together. Cooperation and coordination are vital to success.[Completing Stages]By completing objectives such as obtaining specific items, Survivors can advance to the next area. Survivors will successfully escape once they complete the third area in a level.[Time Limits and Respawns]When a Survivor takes too much damage, they will start dying. They will not be able to move freely while in this state, but a nearby teammate can revive them. If they fail to get help in time, they will respawn, but lose a chunk of time.[Skills]Survivors each have their own special skills. Damage reduction, healing, melee attack, hackinguse your skills effectively and escape together.… Expand"}, {"name": "Townsmen: A Kingdom Rebuilt", "details_link": "https://www.metacritic.com/game/switch/townsmen-a-kingdom-rebuilt", "publisher": "HandyGames", "release_date": "Nov  9 2018", "developers": ["HandyGames"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "Management", "Government"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/2e78c1d67cffe9c7e82907c2d0afd6d3-98.jpg", "descriptions": "Townsmen is back - and it’s bigger, better and cuter than ever before! Experience this all-new entry to the popular series of medieval city-building and economic simulation games!? BUILD your medieval dream city!? MANAGE your economy!? CHOOSE from dozens of buildings!? WATCH cuteTownsmen is back - and it’s bigger, better and cuter than ever before! Experience this all-new entry to the popular series of medieval city-building and economic simulation games!? BUILD your medieval dream city!? MANAGE your economy!? CHOOSE from dozens of buildings!? WATCH cute Townies scurry around!? BEAT challenging scenarios!Grow your tiny village to a grand medieval city with a thriving economy and happy Townies! From mining, logging and farming to the production of jewelry, tools and clothing – a well managed economy is the key to success! Build churches, taverns and marketplaces for your Townies! Beautify your city with splendorous statues, magnificent monuments and lush parks and gardens. Watch adorable Townies scurry around on their daily routines and keep them happy and well-fed! Remember: only a happy Townie is a hard-working Townie! Features:? City-building gameplay set in medieval times? Cute Townies and Townettes with their own daily routines? Complex economy simulation and deep production chains? Dozens of different town and production buildings? Diverse scenarios and challenging tasks? Unrestricted sandbox gameplay mode… Expand"}, {"name": "The Town of Light", "details_link": "https://www.metacritic.com/game/pc/the-town-of-light", "publisher": "LKA", "release_date": "Feb 26 2016", "developers": ["LKA"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/1cb3a7ed452a6d2e0a9198a073972f40-98.jpg", "descriptions": "March 12 1938, Renée, 16, was ripped out of her world, her only fault was that of not knowing her place in the world."}, {"name": "X-Men: The Arcade Game", "details_link": "https://www.metacritic.com/game/playstation-3/x-men-the-arcade-game", "publisher": "Konami", "release_date": "Dec 14 2010", "developers": ["Konami", "Backbone Entertainment"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/b9e284fd9a0653de25b1fc63fa3166e7-98.jpg", "descriptions": "In X-Men Arcade, Cyclops, Colossus, Dazzler, Nightcrawler, Storm and Wolverine unite to use their special powers to save mankind from the Brotherhood of Evil Mutants and other terrible threats. Players are charged with fighting off hundreds of Sentinels - along with Super Villains such asIn X-Men Arcade, Cyclops, Colossus, Dazzler, Nightcrawler, Storm and Wolverine unite to use their special powers to save mankind from the Brotherhood of Evil Mutants and other terrible threats. Players are charged with fighting off hundreds of Sentinels - along with Super Villains such as Pyro, the Blob, Wendigo, Nimrod, the White Queen, Juggernaut and Mystique - as they battle their way to Island M to take down the Master of Magnetism, Magneto, and save Kitty Pryde and Professor Xavier.… Expand"}, {"name": "Van Helsing", "details_link": "https://www.metacritic.com/game/playstation-2/van-helsing", "publisher": "VU Games", "release_date": "May  6 2004", "developers": ["Saffire"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 64, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/0548d1dcdd617bfb3cebe2c43b1f4a4f-98.jpg", "descriptions": "Deep within the mysterious land of Transylvania, monsters that inhabit man's deepest nightmares take form. One man works to vanquish the demons of the world and destroy the lethal and powerful Count Dracula. Descend into the murky depths of the Carpathian Mountains as legendary monsterDeep within the mysterious land of Transylvania, monsters that inhabit man's deepest nightmares take form. One man works to vanquish the demons of the world and destroy the lethal and powerful Count Dracula. Descend into the murky depths of the Carpathian Mountains as legendary monster hunter Van Helsing. As Van Helsing you battle fiendish creatures with a deadly array of weapons, unique abilities, and unparalleled courage. Explore the haunting land of Transylvania in 13 exciting missions. Battle Dracula, Frankenstein, the WolfMan and 22 villainous creatures. Control an arsenal of powerful deadly weaponry: tojo blades, dual pistols, gatling gun, unlockable elephant gun, and more. Deliver spectacular kill moves to supernatural enemies. Unlock hidden content when you play through three different difficulty modes. [Vivendi Universal]… Expand"}, {"name": "Mace Griffin Bounty Hunter", "details_link": "https://www.metacritic.com/game/xbox/mace-griffin-bounty-hunter", "publisher": "VU Games", "release_date": "Jun 20 2003", "developers": ["Warthog"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 64, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/ec7758b07bda13edcdc4a6f875783f23-98.jpg", "descriptions": "To deal with the rising wave of crime, a new organization emerges--the Guild of Bounty Hunters. As Mace Griffin, you join this group composed of aliens, criminals, and former police as they fight the criminal element. You'll transition between first-person land combat and space-actionTo deal with the rising wave of crime, a new organization emerges--the Guild of Bounty Hunters. As Mace Griffin, you join this group composed of aliens, criminals, and former police as they fight the criminal element. You'll transition between first-person land combat and space-action fighting in 13 expansive missions that offer different challenges and enemies. Eliminate your foes with 17 player and spaceship weapons, including Tridal Nova Cannons, quad-barreled shotguns, and sonic shock cannons. In this universe of large corporations and futuristic gunslingers, you'll unravel a deep and dangerous mystery. … Expand"}, {"name": "Global Touring Challenge: Africa", "details_link": "https://www.metacritic.com/game/playstation-2/global-touring-challenge-africa", "publisher": "Majesco Games", "release_date": "Jun 14 2002", "developers": ["Rage Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/5528749d94ee6aa3b0e4b3cb020a0889-98.jpg", "descriptions": "Global Touring Challenge Africa is all-terrain circuit racing set in some of the world's most breathtaking and rugged scenery. Race performance cars including Ford, Subaru, Pontiac and Mitsubishi through the streets of Cape Town, across Libyan deserts and the misty jungle of the Congo.Global Touring Challenge Africa is all-terrain circuit racing set in some of the world's most breathtaking and rugged scenery. Race performance cars including Ford, Subaru, Pontiac and Mitsubishi through the streets of Cape Town, across Libyan deserts and the misty jungle of the Congo. Features 19 Championship circuits, all unique, and 12 special challenge tracks. [Rage]… Expand"}, {"name": "WWE WrestleMania X8", "details_link": "https://www.metacritic.com/game/gamecube/wwe-wrestlemania-x8", "publisher": "THQ", "release_date": "Jun  9 2002", "developers": ["Yuke's"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 64, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/807f725f4f8a861d930f64105feaa12b-98.jpg", "descriptions": "Legendary battles and intense drama are packed into one event--WrestleMania, where the baddest men on the planet meet to become champions of wrestling. An updated 2002 roster features superstars and newcomers Rob Van Dam, Booker T, The Hurricane, and nWo members Scott Hall, Kevin Nash, andLegendary battles and intense drama are packed into one event--WrestleMania, where the baddest men on the planet meet to become champions of wrestling. An updated 2002 roster features superstars and newcomers Rob Van Dam, Booker T, The Hurricane, and nWo members Scott Hall, Kevin Nash, and Hulk Hogan. Master each superstar's unique wrestling style and turn the tide of the match through a combination of counters, reversals, and brutal finishing moves. Now you can start from the beginning and take your rookie wrestler up through the ranks in quest for the Heavyweight Championship Belt.… Expand"}, {"name": "Forever Kingdom", "details_link": "https://www.metacritic.com/game/playstation-2/forever-kingdom", "publisher": "Agetec Inc.", "release_date": "Jan 21 2002", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/6c1a2bb1d24ec242f63998efec864a0c-98.jpg", "descriptions": "A young swordsman named Darius is joined by his childhood friend Ruyan, and a mysterious woman with incerdible magical talent named Faeana on a quest to stop the mad wizard Darsul from destroying their homeland. The three heroes have been bound by the evil sourcer's curse to suffer a sharedA young swordsman named Darius is joined by his childhood friend Ruyan, and a mysterious woman with incerdible magical talent named Faeana on a quest to stop the mad wizard Darsul from destroying their homeland. The three heroes have been bound by the evil sourcer's curse to suffer a shared fate - either they explore the ruins of an ancient civilization together to find a cure for their affliction, or they will all die. [Agetec]… Expand"}, {"name": "Floigan Bros. Episode 1", "details_link": "https://www.metacritic.com/game/dreamcast/floigan-bros-episode-1", "publisher": "Sega", "release_date": "Jul 30 2001", "developers": ["Visual Concepts"], "platforms": "Dreamcast", "genres": ["Action", "General"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/f2b9c47fca4580598968231669d54782-98.jpg", "descriptions": "Large and lovable Moigle has a Secret Project that will keep the greedy Baron Malodorous and his gang of Mercenary Cats from taking over the Floigan Junkyard. Unfortunately, Moigle has lost the parts he needs to complete his project so he must enlist the help of his quick-witted olderLarge and lovable Moigle has a Secret Project that will keep the greedy Baron Malodorous and his gang of Mercenary Cats from taking over the Floigan Junkyard. Unfortunately, Moigle has lost the parts he needs to complete his project so he must enlist the help of his quick-witted older brother, Hoigle. Together, the Floigan Brothers play games and solve puzzles, all while defending their family turf!… Expand"}, {"name": "Gradius III and IV", "details_link": "https://www.metacritic.com/game/playstation-2/gradius-iii-and-iv", "publisher": "Konami", "release_date": "Nov 13 2000", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 64, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/99f666f458df762c43f648b12ccb4fa4-98.jpg", "descriptions": "Need an old school fix on that shiny new PlayStation2? Gradius III & IV updates the 2D shooter with fantastic graphics and all of the classic Gradius play.  Evade your enemies and return fire with your favorite arsenal of lasers, bombs and missiles."}, {"name": "We Happy Few", "details_link": "https://www.metacritic.com/game/xbox-one/we-happy-few", "publisher": "Compulsion Games", "release_date": "Aug 10 2018", "developers": ["Compulsion Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 64, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/40939c9dd496ac23b0a4fe8112507d3b-98.jpg", "descriptions": "We Happy Few is the tale of a plucky bunch of moderately terrible people trying to escape from a lifetime of cheerful denial. Set in a drug-fuelled, retrofuturistic city in an alternative 1960s England, you’ll have to blend in with its other inhabitants, who have their own set ofWe Happy Few is the tale of a plucky bunch of moderately terrible people trying to escape from a lifetime of cheerful denial. Set in a drug-fuelled, retrofuturistic city in an alternative 1960s England, you’ll have to blend in with its other inhabitants, who have their own set of not-so-normal rules. … Expand"}, {"name": "Micro Machines V4", "details_link": "https://www.metacritic.com/game/playstation-2/micro-machines-v4", "publisher": "Codemasters", "release_date": "Jun 27 2006", "developers": ["Supersonic Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/4f8787841bbce5259b0c54b39a358ae9-98.jpg", "descriptions": "Mixing miniature mayhem with maximum multiplayer racing, Micro Machines v4 features knockabout, breakneck racing in the fastest scale miniatures, complete with explosive weapon power-ups. Letting you loose with hundreds of vehicles, each with distinctive performance abilities, you'll beMixing miniature mayhem with maximum multiplayer racing, Micro Machines v4 features knockabout, breakneck racing in the fastest scale miniatures, complete with explosive weapon power-ups. Letting you loose with hundreds of vehicles, each with distinctive performance abilities, you'll be racing your inch-long miniature motors on the wildest tracks where everyday household objects appear immense in size and can become lethal hazards. Sport cars, street racers, stock cars, 4x4s, beach buggies, lowriders and muscle cars are just some of the Micro Machines models you'll be taking out on the improvised tracks around the Micro Machines house, garden and - for the first time - beyond. Spin out around the breakfast table littered with cereal spills, tear through the kitchen but avoid literally burning tyre rubber on the blazing hot cooker, turbo boost around the pool table (while avoiding the treacherous pockets), or hit the gas as you drive around the rim of the bath, carefully negotiating the ferocious waters pouring over the edge of the bath (because someone left the tap running). [Codemasters]… Expand"}, {"name": "Legend of Kay Anniversary", "details_link": "https://www.metacritic.com/game/pc/legend-of-kay-anniversary", "publisher": "Nordic Games Publishing", "release_date": "Jul 27 2015", "developers": ["Neon Studios", "Kaiko"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 64, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/af3bd1020907c28384aa135ebf2b63b2-98.jpg", "descriptions": "Experience the unique blend of Martial Arts-combat, action adventure, Jump 'n' Run and puzzle solving.\r 10 years after its initial release, Legend of Kay Anniversary is a thoroughly remastered version of the original game with high resolution textures, new & more detailed characterExperience the unique blend of Martial Arts-combat, action adventure, Jump 'n' Run and puzzle solving.\r 10 years after its initial release, Legend of Kay Anniversary is a thoroughly remastered version of the original game with high resolution textures, new & more detailed character models, modern rendering techniques and crystal-clear surround sound which give this great classic a new shine.\r Full of fond allusions to old martial arts films and pop culture quotes, Legend of Kay Anniversary is both an incredibly funny game and a challenging action-adventure for young and old alike.… Expand"}, {"name": "Major League Baseball 2K9", "details_link": "https://www.metacritic.com/game/xbox-360/major-league-baseball-2k9", "publisher": "2K Sports", "release_date": "Mar  3 2009", "developers": ["2K Sports"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 64, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/5b4af56c66aadd94d2e324f5f933c48e-98.jpg", "descriptions": "While attending the University of Washington, MLB 2K9's cover athlete Tim Lincecum won the coveted Golden Spikes Award which is given to the nation’s top college baseball player.  He was drafted 10th overall by the San Francisco Giants in 2006.  Known to fans as \"The Franchise\" and \"TheWhile attending the University of Washington, MLB 2K9's cover athlete Tim Lincecum won the coveted Golden Spikes Award which is given to the nation’s top college baseball player.  He was drafted 10th overall by the San Francisco Giants in 2006.  Known to fans as \"The Franchise\" and \"The Freak\", Lincecum was named to the National League All-Star team this past season while putting up astonishing numbers and leading the Majors™ with a remarkable 265 strikeouts.  Lincecum also led the National League in other key pitching categories including win percentage (18-5, .783), opponent’s batting average (.221), and strikeouts per nine innings (10.51), along with ranking second in earned run average (2.62).  For all of his historic accomplishments, Lincecum won the Players’ Choice Award as the National League Outstanding Pitcher this season, along with the National League Pitcher of the Year Award from Sporting News.  Both awards were voted on by his peers.  More significantly, Lincecum today was named the National League Cy Young Award winner, given annually to the top pitcher in both the American League and the National League, and voted on by members of the Baseball Writers’ Association of America. [2K Sports]… Expand"}, {"name": "Party Hard", "details_link": "https://www.metacritic.com/game/pc/party-hard", "publisher": "tinyBuild", "release_date": "Aug 25 2015", "developers": ["Pinokl Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Action", "General"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/61dd03f8940f72217db358ba237a6f74-98.jpg", "descriptions": "It is 3 in the morning. Your neighbors are having a loud party. Stop them. Party Hard."}, {"name": "BlazBlue: Continuum Shift II", "details_link": "https://www.metacritic.com/game/3ds/blazblue-continuum-shift-ii", "publisher": "Aksys Games", "release_date": "May 31 2011", "developers": ["Arc System Works"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/7a9f88fa581e2dc6647911393f5a975f-98.jpg", "descriptions": "BlazBlue: Continuum Shift II is an enhanced port of Blazblue: Continuum Shift."}, {"name": "Disgaea Infinite", "details_link": "https://www.metacritic.com/game/psp/disgaea-infinite", "publisher": "NIS America", "release_date": "Jun  8 2010", "developers": ["Nippon Ichi Software"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Visual Novel"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/6944f34b1e7db90b9a563ee97a5912e4-98.jpg", "descriptions": "Disgaea Infinite is a spin off of the Disgaea series. However, unlike other Disgae titles, Disgaea Infinite is an Adventure Novel style game. BUT it still has the usual Disgaea humor and ridiculous story as always. Finally, you can play with a Prinny as your main character in a Disgaea game!Disgaea Infinite is a spin off of the Disgaea series. However, unlike other Disgae titles, Disgaea Infinite is an Adventure Novel style game. BUT it still has the usual Disgaea humor and ridiculous story as always. Finally, you can play with a Prinny as your main character in a Disgaea game! One day, Laharl was almost assassinated, and they comanded a Prinny to find this fool who tried to assassinate Laharl! Of course, the Prinny has no choice but to obey his orders. What could this helpless, useless vassel (according to Etna) do to figure out who the unsuccessful assassin was!? Well, the Prinny comes across this clock, Tick Tock, which lets him take over other characters' minds and bodies. You can use Tick Tock to see who is lying and had been planning on assassinating Laharl. [NIS America]… Expand"}, {"name": "RiME", "details_link": "https://www.metacritic.com/game/switch/rime", "publisher": "Grey Box", "release_date": "Nov 14 2017", "developers": ["Tantalus", "Tequila Works"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/511d8866bb264fd59390d57257b06dd4-98.jpg", "descriptions": "The story of a boy who must use his wits and ingenuity to survive - and ultimately escape from - a mysterious island and a terrible curse.\r An end, and a new beginning.\r\n\r\nA strange island with a sinister secret, and an open-world adventure with a difference. As a boy who finds he is keyThe story of a boy who must use his wits and ingenuity to survive - and ultimately escape from - a mysterious island and a terrible curse.\r An end, and a new beginning.\r A strange island with a sinister secret, and an open-world adventure with a difference. As a boy who finds he is key to solving a series of ancient puzzles, you'll use an enigmatic artefact to manipulate your environment and even time itself.\r Thanks to the innovative control offered by the DUALSHOCK 4 controller, you'll find that light, sound and touch are all essential in your bid to escape the island.… Expand"}, {"name": "Mercenaries Wings: The False Phoenix", "details_link": "https://www.metacritic.com/game/switch/mercenaries-wings-the-false-phoenix", "publisher": "CIRCLE Entertainment", "release_date": "Nov  8 2018", "developers": ["RideonJapan,Inc."], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 64, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/575ec45b9df623c05c918e5d0c4a42e9-98.jpg", "descriptions": "Mercenaries Wings: The False Phoenix, blends turn-based strategy, old-school aesthetics and a tale of war, betrayal and magical forces!Mercenaries Wings: The False Phoenix challenges your tactical nous across a lengthy and challenging campaign. The Kingdom of Dryden has an incredibleMercenaries Wings: The False Phoenix, blends turn-based strategy, old-school aesthetics and a tale of war, betrayal and magical forces!Mercenaries Wings: The False Phoenix challenges your tactical nous across a lengthy and challenging campaign. The Kingdom of Dryden has an incredible history thanks to the story of a Phoenix facing down enemies generations ago; now, buoyed by that legacy, King Harold continually seeks conflict.Follow the tale of a band of mercenaries, working for coin but then challenged to consider whether their actions, and those of King Harold, are what is best for the land. What follows is a story of war, betrayal, magical lore and redemption for a nation!A tactical RPG in the finest traditions of the genre, Mercenaries Wings: The False Phoenix requires you to carefully utilise varied units and their abilities. Set Leaders to change the flow of battle, level up your units, change classes, manage equipment and make the key choices that will be the difference between victory and defeat!An adventure that will take many hours to complete, Mercenaries Wings: The False Phoenix will challenge even the most careful strategists.Features:* An all-new standalone story in the Mercenaries series, this adventure offers many hours of entertainment.* Carefully crafted tactical RPG action.* Choose a Leader for each battle, level up units, change class types and pick the right equipment.* Follow the twists and turns of the tale that includes war, magical beasts and leadership challenges!* Featuring character illustrations by Kazama Raita!… Expand"}, {"name": "Batman: The Telltale Series", "details_link": "https://www.metacritic.com/game/pc/batman-the-telltale-series", "publisher": "Telltale Games", "release_date": "Aug  2 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 64, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/36c6b068ab1ec0db919d80a8f554c5cf-98.jpg", "descriptions": "Enter the fractured pysche of Bruce Wayne in this dark and violent new story from the award-winning creators of The Walking Dead - A Telltale Games Series. Batman - The Telltale Series comes to retail as a Season Pass Disc, which includes Episode One, and grants access to the remaining fourEnter the fractured pysche of Bruce Wayne in this dark and violent new story from the award-winning creators of The Walking Dead - A Telltale Games Series. Batman - The Telltale Series comes to retail as a Season Pass Disc, which includes Episode One, and grants access to the remaining four episodes in the season as they become available to download. The Season Pass Disc will give you access to a total of 5 episodes as they become available.… Expand"}, {"name": "Alien Breed", "details_link": "https://www.metacritic.com/game/playstation-vita/alien-breed", "publisher": "Team17", "release_date": "Feb 12 2013", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita"], "num_players": "2 ", "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/8b5d054fded29dcff10b92b7b37de9d4-98.jpg", "descriptions": "With the PS3 and PS Vita version the developer introduces additional features, such as the ability for players to team up on either system via cross-platform play. There is also ad-hoc and online co-op multiplayer for PS Vita, and local and online co-op multiplayer for PS3. There is also aWith the PS3 and PS Vita version the developer introduces additional features, such as the ability for players to team up on either system via cross-platform play. There is also ad-hoc and online co-op multiplayer for PS Vita, and local and online co-op multiplayer for PS3. There is also a Cross-Platform Continuation Play in the mix too, allowing players to carry on their PS3 save game progress on their PS Vita and vice versa. [Playstation.com]… Expand"}, {"name": "Command & Conquer 4: Tiberian Twilight", "details_link": "https://www.metacritic.com/game/pc/command-conquer-4-tiberian-twilight", "publisher": "Electronic Arts", "release_date": "Mar 16 2010", "developers": ["EA LA"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 64, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/1/e9149cc899cadcee9a1c95aacbcefb24-98.jpg", "descriptions": "The story of Command & Conquer 4 Tiberian Twilight takes place after the events of the critically acclaimed Command & Conquer 3: Tiberium Wars. The year is 2062 and humanity is at the brink of extinction. With only six years left until the mysterious crystalline structure Tiberium rendersThe story of Command & Conquer 4 Tiberian Twilight takes place after the events of the critically acclaimed Command & Conquer 3: Tiberium Wars. The year is 2062 and humanity is at the brink of extinction. With only six years left until the mysterious crystalline structure Tiberium renders the earth entirely uninhabitable, the two opposing factions - Global Defense Initiative (GDI) and the Brotherhood of Nod - inevitably find themselves in desperation for the same cause: to stop Tiberium from extinguishing mankind. The unthinkable becomes reality and Nod’s enigmatic leader Kane takes off for GDI headquarters. What is Kane planning in the heart of his enemies’ base? Command & Conquer 4 draws the epic conclusion to the beloved Tiberium universe, where fans learn the fate of Earth, Nod, Tiberium, GDI and most importantly, Kane’s motivations behind his decade-long plan. In addition to the two campaigns on the epic battles of GDI and Nod, which players will get to conquer alone or in a cooperative mode, Command & Conquer 4 also features a new 5v5 objective-based multiplayer mode, promoting teamwork and cooperation and delivering a social real-time-strategy experience never seen before in a Command & Conquer game. [Electronic Arts]… Expand"}, {"name": "The Saga of Ryzom", "details_link": "https://www.metacritic.com/game/pc/the-saga-of-ryzom", "publisher": "Tri Synergy", "release_date": "Sep 20 2004", "developers": ["Nevrax"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/22855e7d3f3863c7f4a073917d07c4a6-98.jpg", "descriptions": "In the far off distant future, four homin races struggle for survival on the plant of Atys. Known as the 'living planet', Atys is growing and evolving on its own, sending tendrils into the sky and covering the lands with new life. This lush and vibrant world is the setting for The Saga ofIn the far off distant future, four homin races struggle for survival on the plant of Atys. Known as the 'living planet', Atys is growing and evolving on its own, sending tendrils into the sky and covering the lands with new life. This lush and vibrant world is the setting for The Saga of Ryzom, a multi-genre massively-multiplayer online game which is played out over a period of eight years during which players will be able to explore and adventure with thousands of others, in order to reveal the hidden mysteries not only of Atys, but of the entire Ryzom universe. Join the Saga, reveal the history and become the future. [Nevrax]… Expand"}, {"name": "Mad Riders", "details_link": "https://www.metacritic.com/game/xbox-360/mad-riders", "publisher": "Ubisoft", "release_date": "May 30 2012", "developers": ["Techland"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Arcade", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/6b861d14cea92186fd382dc0cb836a10-98.jpg", "descriptions": "Mad Riders, developed by Techland, sees players performing aerial stunts and racing at high speeds on over 45 stunning tracks from all over the world. To gain the edge on the competition, players will need to use their Boost skill wisely and take advantage of shortcuts hidden in the tracks."}, {"name": "Need for Speed Undercover", "details_link": "https://www.metacritic.com/game/xbox-360/need-for-speed-undercover", "publisher": "Electronic Arts", "release_date": "Nov 17 2008", "developers": ["EA Vancouver"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 64, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/5f622c42e4678f57f478aeb591201a4f-98.jpg", "descriptions": "Need for Speed Undercover has players racing through speedways, dodging cops and chasing rivals as they go deep undercover to take down an International crime syndicate. The game heralds the return of high-intensity police chases and introduces the all-new 'Heroic Driving Engine' -- a uniqueNeed for Speed Undercover has players racing through speedways, dodging cops and chasing rivals as they go deep undercover to take down an International crime syndicate. The game heralds the return of high-intensity police chases and introduces the all-new 'Heroic Driving Engine' -- a unique technology that generates incredible high-performance moves at 180 miles per hour during breathtaking highway battles. A mix of computer graphics and live-action movies immerses gamers in the rich world of the Tri-City Bay Area. The city’s open-world environment features over 80 miles of roads, including an enormous highway system that sets the stage for highway battles. These high-speed, high-stake chase sequences push players to the limit as they fight off cops and opponents while whipping through traffic at 180 miles per hour. An intelligent new A.I. mechanic delivers a realistic and high-energy action driving experience. Going back to the franchise’s roots, Need for Speed Undercover features more aggressive and intelligent cops whose sole purpose is to take down the player quickly and by any means necessary. Need for Speed Undercover also features the series' signature car customization, real-world damage and realistic driving physics. The game includes some of the hottest licensed cars such as the Audi R8, BMW M6 and Lexus IS-F. [Electronic Arts]… Expand"}, {"name": "Warframe", "details_link": "https://www.metacritic.com/game/playstation-4/warframe", "publisher": "Digital Extremes", "release_date": "Nov 12 2013", "developers": ["Digital Extremes"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["General", "General", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/972f8f40e43a951f11ca0f0b7928c9f8-98.jpg", "descriptions": "They were called Tenno. Warriors of blade and gun: masters of the Warframe armor. Those that survived the old war were left drifting among the ruins. Now they are needed once more. The Grineer, with their vast armies, are spreading throughout the solar system. A call echoes across the starsThey were called Tenno. Warriors of blade and gun: masters of the Warframe armor. Those that survived the old war were left drifting among the ruins. Now they are needed once more. The Grineer, with their vast armies, are spreading throughout the solar system. A call echoes across the stars summoning the Tenno to an ancient place. They summon you. Allow the Lotus to guide you. She has rescued you from your cryostasis chamber and given you a chance to survive. The Grineer will find you; you must be prepared. The Lotus will teach you the ways of the Warframes and the secrets to unlocking their powers. Come Tenno, you must join the war.… Expand"}, {"name": "Ghostbusters: The Video Game", "details_link": "https://www.metacritic.com/game/playstation-2/ghostbusters-the-video-game", "publisher": "Atari", "release_date": "Jun 16 2009", "developers": ["War Drum Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "genres": ["Action", "General"], "meta_score": 64, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/5327d6e0071f136d120934bd897ca608-98.jpg", "descriptions": "The Ghostbusters are back in an all new story penned by the original creators. With Manhattan newly overrun by ghosts and other supernatural creatures, it's up to you to take on the role of a new recruit joining the original film cast of the famous Ghostbusters team. Equipped with a varietyThe Ghostbusters are back in an all new story penned by the original creators. With Manhattan newly overrun by ghosts and other supernatural creatures, it's up to you to take on the role of a new recruit joining the original film cast of the famous Ghostbusters team. Equipped with a variety of unique weapons and gadgets, you will hunt, fight and capture a wide range of uncanny phantasms and demons in an all new funny and frightening battle to save New York City from its latest paranormal plague. To deliver a special gaming experience to the tremendous Ghostbusters’ fan base around the world, the game features the original film cast from the classic Ghostbusters films, Bill Murray, Dan Aykroyd, Harold Ramis, and Ernie Hudson, back again for the first time in more than 20 years. Supporting the ghost busting crew are the talents of Annie Potts, Brian Doyle Murray and William Atherton. [Sierra Entertainment]… Expand"}, {"name": "Phantasy Star Universe", "details_link": "https://www.metacritic.com/game/xbox-360/phantasy-star-universe", "publisher": "Sega", "release_date": "Oct 25 2006", "developers": ["Sonic Team"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 64, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/ad606140a08a8a467280538034792922-98.jpg", "descriptions": "Phantasy Star Universe offers two complete RPG experiences - a single-player action adventure spanning multiple planets, and a robust online multi-player component. The game offers long-time fans the epic experience they have been clamoring for. The solo adventure features more than 40 hoursPhantasy Star Universe offers two complete RPG experiences - a single-player action adventure spanning multiple planets, and a robust online multi-player component. The game offers long-time fans the epic experience they have been clamoring for. The solo adventure features more than 40 hours of gameplay, an emotionally engaging story, traditional cut scenes, and strong character development. The title's hero is Ethan Waber, a 17-year old cadet intent on saving his sister, who is living on a planet under siege by mysterious life forces called THE SEED. In Online Mode, players are given the opportunity to create their own characters from a range of races, and they get to explore all three planets in the Grarl solar system. Fans can travel with a squad of other adventurers, enter urban sprawls teeming with hundreds of other players, and build their avatars into powerful warriors. [Sega]… Expand"}, {"name": "Armored Core: For Answer", "details_link": "https://www.metacritic.com/game/xbox-360/armored-core-for-answer", "publisher": "Ubisoft", "release_date": "Sep 16 2008", "developers": ["From Software"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 64, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/8c8bef85701fb56e4fc6f91ee971a651-98.jpg", "descriptions": "In the distant future, massive urban development and pollution have critically damaged the planet. There is widespread fear that the end of the world is approaching. The League corporations, a military superpower, control the planet's infrastructure and have forced most of the world'sIn the distant future, massive urban development and pollution have critically damaged the planet. There is widespread fear that the end of the world is approaching. The League corporations, a military superpower, control the planet's infrastructure and have forced most of the world's population to live in huge aerial communities, called Cradles, to avoid the contamination. The ORCA, a rebel resistance still residing on the surface of the polluted planet, have amassed a formidable arsenal and are mobilizing to attack The League's bases to put an end to their iron grip on the planet. As a mercenary armed with cutting-edge military robot technology, choose your side and defeat the other factions by harnessing the power of the deadliest and most gigantic weapons ever created by mankind. For the first time in the series, cut your way inside colossal mobile battle stations and destroy them from their very core. Identify and exploit the weaknesses of 10 uniquely designed GIANT mobile battle stations to defeat them. Cooperate online with a friend in more than 30 missions or face up to 7 other players online in more than 80 different battlefields. Find the right combination of weapons and armor that will help you take down colossal enemies. With more than 130 new parts and 400 parts total, enhance your mech to take on increasingly deadlier mobile battle stations. Create the perfect mech design to defeat a powerful enemy and share it with your friends online. [Ubisoft]… Expand"}, {"name": "Forspoken", "details_link": "https://www.metacritic.com/game/playstation-5/forspoken", "publisher": "Square Enix", "release_date": "Jan 24 2023", "developers": ["Luminous", "Luminous Productions"], "platforms": ["PC", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 64, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/7/4adcf3111f4d533af0d9ecedb4931f10-98.jpg", "descriptions": "Forspoken is an action RPG that follows the journey of Frey, a young New Yorker transported to the beautiful and cruel land of Athia.  In search of a way home, Frey must use her newfound magical abilities to traverse sprawling landscapes, battle monstrous creatures and defeat powerfulForspoken is an action RPG that follows the journey of Frey, a young New Yorker transported to the beautiful and cruel land of Athia.  In search of a way home, Frey must use her newfound magical abilities to traverse sprawling landscapes, battle monstrous creatures and defeat powerful matriarchs known as Tantas.… Expand"}, {"name": "The friends of Ringo Ishikawa", "details_link": "https://www.metacritic.com/game/switch/the-friends-of-ringo-ishikawa", "publisher": "CIRCLE Entertainment", "release_date": "Apr  3 2019", "developers": ["yeo"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/d4b3c60319e84c7fcf283905fb4987b3-98.jpg", "descriptions": "Ringo Ishikawa is a gang leader but also a senior in High School, with day-to-day challenges and routines to follow. You have freedom in how you pass each day, and as time progresses a natural story plays out that is inspired by yakuza-delinquent aesthetics. This is a story about gangs, Ringo Ishikawa is a gang leader but also a senior in High School, with day-to-day challenges and routines to follow. You have freedom in how you pass each day, and as time progresses a natural story plays out that is inspired by yakuza-delinquent aesthetics. This is a story about gangs, friendships and, most of all, about growing up.\r You can pick fights with other gangs and master the game’s mechanics, utilising punches, kicks and grapples while levelling up Ringo and his gang members. You can go shopping, hang out at a burger restaurant or café, head to the bar, or even get a job to earn money for food, activities, a TV and other goodies that unlock minigames. On top of that you have classes and homework to consider, as you can strive for top grades or play truant. Above all of this, the story of Ringo Ishikawa plays out for you to experience.\r With stylish retro-inspired visuals and a varied soundtrack to perfectly fit the mood, The friends of Ringo Ishikawa gives an awesome blend of narrative, action, varied challenges and a Japanese vibe. … Expand"}, {"name": "Seasons After Fall", "details_link": "https://www.metacritic.com/game/playstation-4/seasons-after-fall", "publisher": "Focus Home Interactive", "release_date": "May 16 2017", "developers": ["Swing Swing Submarine", "Moving Player"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D", "Metroidvania"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/6cf002a164882915e01928eee844ba45-98.jpg", "descriptions": "Seasons After Fall is a 2D platform-puzzler game that will let you dive into a captivating universe and explore a land governed by magic and nature. As a wild fox you are sent on a perilous journey aided only by your ability to change the seasons at will, manipulating a gorgeous 2D worldSeasons After Fall is a 2D platform-puzzler game that will let you dive into a captivating universe and explore a land governed by magic and nature. As a wild fox you are sent on a perilous journey aided only by your ability to change the seasons at will, manipulating a gorgeous 2D world backed by an enchanting live string quartet.… Expand"}, {"name": "The Baconing", "details_link": "https://www.metacritic.com/game/xbox-360/the-baconing", "publisher": "Valcon Games", "release_date": "Aug 31 2011", "developers": ["Hothead Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Role-Playing", "Action RPG", "Platformer", "Action RPG", "3D"], "meta_score": 64, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/65c0553c7cfbfba19a582a65e94f2e2e-98.jpg", "descriptions": "DeathSpank returns in the sequel DeathSpank: The Baconing."}, {"name": "Vikings: Wolves of Midgard", "details_link": "https://www.metacritic.com/game/xbox-one/vikings-wolves-of-midgard", "publisher": "Kalypso", "release_date": "Mar 28 2017", "developers": ["Games Farm"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/ddc8c9be7c6d7e97dfdcadb8e238860e-98.jpg", "descriptions": "Fear the wolves. They are cold, they are hungry - and they will stop at nothing to survive\r Ragnarok. Legend has it that when the coldest winter descends, the Jotan will return to take their vengeance against the Gods of Asgard. The world is on the road to perdition and the fate of MidgardFear the wolves. They are cold, they are hungry - and they will stop at nothing to survive\r Ragnarok. Legend has it that when the coldest winter descends, the Jotan will return to take their vengeance against the Gods of Asgard. The world is on the road to perdition and the fate of Midgard hangs in the balance. But when the Fire and Frost Giants begin to merge their armies, they encounter the clan of the Ulfung  the Wolves of Midgard. Bloody, but unbowed following the destruction of their village, this notorious band of ostracized Viking warriors are determined to seize their destiny and save the world. As clan chief, you must save Midgard from complete annihilation, and spearhead the charge to vanquish the fiendish creatures of the Fimbulwinter.\r * Fantasy Meets Norse Mythology\rTravel the realms of earthly Midgard, freezing Niflheim and boiling Balheim, either as a fierce Viking warrior or merciless shieldmaiden.\r *The Deadly Fimbulwinter\rWithstand the deathly colds and protect yourself from exposure to natures wrath in order to survive.\r * Tribute To The Gods\rCollect blood from fallen enemies and sacrifice it at the altar to gain gifts from the Gods to enhance your powers.\r * Berserker Rage\rLet your anger take hold by activating Rage Mode to overwhelm your enemies in bloodthirsty combat.\r * The Art Of Combat\rPerfect your skills with each weapon to unlock their true potential, including swords, bows and spell-powered canes.\r * The Power Of The Gods\rMake the abilities of the Gods your own by equipping power-infused amulets, like the Talismans of Thor or Loki. Put your new skills to the test by competing in the Trials of the Gods to earn further rewards.\r * Teamwork\rTeam up with a friend and journey to the Shores of Midgard together in an epic two player online co-op mode. Choose between four difficulty levels to suit your skills and talents. Do you dare attempt the unrelenting hardcore mode?… Expand"}, {"name": "NASCAR: The Game 2013", "details_link": "https://www.metacritic.com/game/pc/nascar-the-game-2013", "publisher": "Eutechnyx", "release_date": "Jul 24 2013", "developers": ["Eutechnyx"], "platforms": "PC", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Automobile"], "meta_score": 64, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/2fea698324afa5d5ddb82581a9356ba8-98.jpg", "descriptions": "NASCAR The Game 2013 lets players take to the tracks and redefine races using the new Gen 6 model cars. Supporting an updated and enhanced paint booth tool, players can customize their Gen 6 paint schemes and import them into the games multiple race modes to show the world their designNASCAR The Game 2013 lets players take to the tracks and redefine races using the new Gen 6 model cars. Supporting an updated and enhanced paint booth tool, players can customize their Gen 6 paint schemes and import them into the games multiple race modes to show the world their design skills. Supporting the new 2013 roster with all the team and driver changes, players can take their own shot at being crowned the Sprint Cup Series Champion by starting a competitive season as a rookie and racing against their favorite drivers in career mode, or race online with friends.… Expand"}, {"name": "N.E.R.O.: Nothing Ever Remains Obscure", "details_link": "https://www.metacritic.com/game/xbox-one/nero-nothing-ever-remains-obscure", "publisher": "Storm in a Teacup", "release_date": "May 15 2015", "developers": ["Storm in a Teacup"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Miscellaneous", "Adventure", "Puzzle", "General", "3D", "First-Person"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/c856b25c20b04726b658adc2dc622deb-98.jpg", "descriptions": "NERO is a fully story driven first person game filled with puzzles that are heavily connected with the environments and with the past of the main characters. The more the player is going to explore, the better he will be rewarded with pieces of narration that will help him to understand theNERO is a fully story driven first person game filled with puzzles that are heavily connected with the environments and with the past of the main characters. The more the player is going to explore, the better he will be rewarded with pieces of narration that will help him to understand the truth behind this next-gen visual novel. [Storm in a Teacup]… Expand"}, {"name": "Cultist Simulator: Initiate Edition", "details_link": "https://www.metacritic.com/game/switch/cultist-simulator-initiate-edition", "publisher": "Playdigious", "release_date": "Feb  2 2021", "developers": ["Weather Factory"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/e5873768e9af903d711a25036800f31f-98.jpg", "descriptions": "Cultist Simulator is a game of apocalypse and yearning from Alexis Kennedy, creator of Fallen London and Sunless Sea. Play as a seeker after unholy mysteries, in a 1920s-themed setting of hidden gods and secret histories. Perhaps you're looking for knowledge, or power, or beauty, or revenge.Cultist Simulator is a game of apocalypse and yearning from Alexis Kennedy, creator of Fallen London and Sunless Sea. Play as a seeker after unholy mysteries, in a 1920s-themed setting of hidden gods and secret histories. Perhaps you're looking for knowledge, or power, or beauty, or revenge. Perhaps you just want the colours beneath the skin of the world.In this roguelike narrative card game, what you find may transform you forever. Every choice you make, from moment to moment, doesn't just advance the narrative -- it also shapes it.Become a scholar of the unseen arts. Search your dreams for sanity-twisting rituals. Craft tools and summon spirits. Indoctrinate innocents. Seize your place as the herald of a new age.… Expand"}, {"name": "Sea of Solitude", "details_link": "https://www.metacritic.com/game/pc/sea-of-solitude", "publisher": "Electronic Arts", "release_date": "Jul  5 2019", "developers": ["Electronic Arts", "Jo-Mei Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action Adventure", "Adventure", "3D", "Linear", "Third-Person"], "meta_score": 64, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/1e469821258c2bddaf351ee6c54a8553-98.jpg", "descriptions": "When humans get too lonely, they turn into monsters \r\rSea of Solitude takes you on a personal journey of a young woman's loneliness. Set sail across a beautiful and evolving world, where nothing is quite what it seems. Meet fantastical creatures and monsters, learn their stories, and solveWhen humans get too lonely, they turn into monsters \r\rSea of Solitude takes you on a personal journey of a young woman's loneliness. Set sail across a beautiful and evolving world, where nothing is quite what it seems. Meet fantastical creatures and monsters, learn their stories, and solve challenges. Explore a flooded city, either by boat, on foot, or by swimming through the water itself. Dare to look what lies beneath the surface, in a haunting struggle of darkness and light, and discover what it truly means to be human. \r\rKEY FEATURES \r\r- AN EMOTIONAL JOURNEY Sea of Solitude embarks players on a nuanced and intimate action-adventure, experienced through the mind of Kay, as she struggles to overcome her inner loneliness. Players must help Kay see below the surface and beyond, guiding her through her Sea of Solitude, in this deeply touching tale of darkness and light. \r\r- A METAPHORICAL WORLD As her journey evolves, Kay's dark and stormy environment begins to transform, with light and color shining into the world. Water levels rise and fall to reflect her own state of mind, transforming the flooded city landscape into new areas for the player to explore, with new challenges to face. \r\r- FACE THE MONSTERS WITHIN Encounter fantastical creatures, solve puzzles, and rid the world of tainted memories. Meet a variety of beautiful and terrifying monsters, each with their own struggles of loneliness to tell. Through confronting these monsters, Kay will not only learn more about them, but also herself, and what it means to be human.… Expand"}, {"name": "Kholat", "details_link": "https://www.metacritic.com/game/playstation-4/kholat", "publisher": "IMGN.PRO", "release_date": "Mar  8 2016", "developers": ["IMGN.PRO"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 64, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/bffda9fdd713ef371a484dbecba5d952-98.jpg", "descriptions": "Kholat was developed by independent studio IMGN.PRO, inspired by true events known as the \"Dyatlov Pass Incident\". We follow the path of a group of Russian students which went for an expedition in the northern Ural Mountains. The team does not reach its goal, the entire crew dies inKholat was developed by independent studio IMGN.PRO, inspired by true events known as the \"Dyatlov Pass Incident\". We follow the path of a group of Russian students which went for an expedition in the northern Ural Mountains. The team does not reach its goal, the entire crew dies in mysterious circumstances. The player is thrown into the area where the tragedy occurred, years after the actual event, with a chance to discover the real course of the tragedy. Atmosphere of anxiety is dosed based on what the player is doing, making each gameplay a unique experience. [IMGN.PRO]… Expand"}, {"name": "The Crew", "details_link": "https://www.metacritic.com/game/xbox-one/the-crew", "publisher": "Ubisoft", "release_date": "Dec  2 2014", "developers": ["Ubisoft Reflections", "Ivory Tower"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["GT / Street", "Driving", "Racing", "Simulation", "GT / Street", "Automobile"], "meta_score": 64, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/16b094c2ad6c5be7f944a52ccdd0aa93-98.jpg", "descriptions": "Take part in a wild ride to infiltrate and overtake the 510s, a gang that has grown up around Detroit's illegal street racing scene. You will need to grow your rep in the underground racing scene and sabotage their activities city-by-city throughout a fully-open world United States. ManeuverTake part in a wild ride to infiltrate and overtake the 510s, a gang that has grown up around Detroit's illegal street racing scene. You will need to grow your rep in the underground racing scene and sabotage their activities city-by-city throughout a fully-open world United States. Maneuver through the percolating streets of New York City and Los Angeles, cruise down balmy Miami Beach, or trek through the breathtaking plateaus of Monument Valley. Each locale comes with its own set of surprises and driving challenges to master. On your journey you will encounter other drivers on the road - all potentially worthy companions to crew up with, or future rivals to compete against.… Expand"}, {"name": "Tiger Woods PGA Tour", "details_link": "https://www.metacritic.com/game/ds/tiger-woods-pga-tour", "publisher": "EA Sports", "release_date": "Dec 14 2004", "developers": ["Sensory Sweep"], "platforms": ["PC", "PlayStation 2", "DS"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/e5e03f49a7ad05c437b396b240f3be75-98.jpg", "descriptions": "Tiger Woods PGA TOUR on the  Nintendo DS retains the hallmarks of the series including legendary courses and world-class golfing. As with the hit version that inspired it, players will take on Tiger Woods, Vijay Singh, Jack Nicklaus and other golfing greats from past & present. PlayersTiger Woods PGA TOUR on the  Nintendo DS retains the hallmarks of the series including legendary courses and world-class golfing. As with the hit version that inspired it, players will take on Tiger Woods, Vijay Singh, Jack Nicklaus and other golfing greats from past & present. Players create their golfer, develop their skills and step on to the green to challenge the masters on some of the world?s top courses including five licensed and one fantasy courses from the Tiger Woods series. However, unlike any past iteration, this innovative version of the game allows players to utilize touch screen technology to command control of their swing and position their shots like a pro. When they feel truly confident, players can fire up the multiplayer component to challenge up to four friends in wi-fi networked play. Then, see who?s the real master. [Electronic Arts]… Expand"}, {"name": "The Legend of Spyro: A New Beginning", "details_link": "https://www.metacritic.com/game/playstation-2/the-legend-of-spyro-a-new-beginning", "publisher": "Sierra Entertainment", "release_date": "Oct 10 2006", "developers": ["Krome Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/2fc961e3037966c7bfb1dccd02f62520-98.jpg", "descriptions": "This completely new Spyro adventure, featuring gameplay focused heavily on dynamic action and fast-paced combat, uncovers the true origin of Spyro the Dragon as he evolves into a living, breathing weapon of explosive destruction. This epic story of Spyro's quest to discover his roots andThis completely new Spyro adventure, featuring gameplay focused heavily on dynamic action and fast-paced combat, uncovers the true origin of Spyro the Dragon as he evolves into a living, breathing weapon of explosive destruction. This epic story of Spyro's quest to discover his roots and realize his destiny is brought to life by leading Hollywood voice-over cast members Elijah Wood as the new voice of Spyro; David Spade as Spyro’s sidekick Sparx the dragonfly; and Gary Oldman as Ignitus, the Fire Dragon Elder and Spyro's mentor. In The Legend of Spyro A New Beginning, players will experience the awesome power of the purple dragon as they unleash devastating fury attacks, upgradeable breaths and ground-to-aerial melee combos in frenzied battles with hordes of menacing enemies and bone-chilling bosses. The action game also introduces a new dragon upgrade system, giving players the freedom to increase the power and variety of attacks to their liking. [Vivendi Games]… Expand"}, {"name": "Academy of Champions: Soccer", "details_link": "https://www.metacritic.com/game/wii/academy-of-champions-soccer", "publisher": "Ubisoft", "release_date": "Nov  3 2009", "developers": ["Ubisoft Vancouver"], "platforms": "Wii", "genres": ["Sports", "Traditional", "Team", "Soccer", "Arcade", "Arcade"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/835e1ae7318c9efd4017279ff947c6f6-98.jpg", "descriptions": "The legendary Pele is the headmaster. He will teach and help you on your dream adventure. Enjoy 4 months in the most fantastic soccer academy. Brightfield Academy is every young soccerer’s dreamland featuring wild and beautiful environments, over-the-top animations, “out of this world”The legendary Pele is the headmaster. He will teach and help you on your dream adventure. Enjoy 4 months in the most fantastic soccer academy. Brightfield Academy is every young soccerer’s dreamland featuring wild and beautiful environments, over-the-top animations, “out of this world” visual effects and hilarious characters to interact with every single day. So pack your bags – it’s time to enroll yourself into a curriculum of outrageous matches, insane training drills and nonstop fun at the Academy of Champions! [Ubisoft]… Expand"}, {"name": "Peaky Blinders: Mastermind", "details_link": "https://www.metacritic.com/game/playstation-4/peaky-blinders-mastermind", "publisher": "Curve Digital", "release_date": "Aug 20 2020", "developers": ["FuturLab"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Puzzle", "Action", "General"], "meta_score": 64, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/4d06d54c0679399e16464e01853c9e91-98.jpg", "descriptions": "Welcome to Birmingham, during the aftermath of the Great War. Set right before the events of Season One, Peaky Blinders: Mastermind lets you join the Shelby family's criminal gang. Follow the rise of Tommy as he successfully uncovers a sinister plot to put the family out of business, provingWelcome to Birmingham, during the aftermath of the Great War. Set right before the events of Season One, Peaky Blinders: Mastermind lets you join the Shelby family's criminal gang. Follow the rise of Tommy as he successfully uncovers a sinister plot to put the family out of business, proving himself worthy of being the true mastermind of the Peaky Blinders.\r Mastermind refers to Tommy's ability to plan complex scenarios in his head. As the player, you get to exercise this power by taking control of key members of the Shelby family including Tommy, Arthur, Polly and more. Become the Mastermind as you freely reset and rewind each character's path in order to tune all of their actions for perfect coordination.\r Achieve the highest mission rating by strategically utilising characters and stealth to solve increasingly complex puzzles with optimum timing.… Expand"}, {"name": "Moons of Madness", "details_link": "https://www.metacritic.com/game/xbox-one/moons-of-madness", "publisher": "Funcom", "release_date": "Mar 24 2020", "developers": ["Rock Pocket Games", "Dreamloop Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/360e70a963c6b440baf8f05debece063-98.jpg", "descriptions": "Moons of Madness is a first-person, story-driven cosmic horror game where the scientific exploration of Mars meets the supernatural dread of Lovecraft."}, {"name": "Sleep Tight", "details_link": "https://www.metacritic.com/game/switch/sleep-tight", "publisher": "We Are Fuzzy", "release_date": "Jul 26 2018", "developers": ["We Are Fuzzy"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/f839de9a7b764f040f0df4a83209c2a1-98.jpg", "descriptions": "This unique twin-stick shooter, base-builder hybrid comes wrapped in blankets of nostalgia! Construct your strongest pillow fort during the day and defend your bedroom from endless hordes of monsters each night. This fast paced arcade style game packs some deep strategy, and you'll need toThis unique twin-stick shooter, base-builder hybrid comes wrapped in blankets of nostalgia! Construct your strongest pillow fort during the day and defend your bedroom from endless hordes of monsters each night. This fast paced arcade style game packs some deep strategy, and you'll need to use your wits if you're going to survive to the top of the leaderboards. With 12 unlockable characters, mix and match playstyles, an abundance of silly monsters, a charming score, and an endless amount of nights that increase in difficulty as you progress, good luck putting Sleep Tight down to rest.… Expand"}, {"name": "Disney/Pixar Ratatouille", "details_link": "https://www.metacritic.com/game/psp/disneypixar-ratatouille", "publisher": "THQ", "release_date": "Jun 26 2007", "developers": ["Locomotive Games"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/d138ad9cb4eadc51318ef5f1fec2bb81-98.jpg", "descriptions": "Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6 action-packed worlds filled with dangerous enemies, heists and perilous missions. Players can go head-to-head with their friends in multiplayer mini-games or navigate their way through a sensational rat race that turns the culinary world of Paris upside down. [THQ]… Expand"}, {"name": "Batman Begins", "details_link": "https://www.metacritic.com/game/playstation-2/batman-begins", "publisher": "EA Games", "release_date": "Jun 14 2005", "developers": ["Eurocom Entertainment Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 64, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/ef8ca912ceefc3a11a065548715ddf3d-98.jpg", "descriptions": "Step into the shadows of Gotham City’s perilous criminal underworld as DC Comics’ legendary Dark Knight in the Batman Begins video game. Slated for release day and date with the Warner Bros. Pictures film, Batman Begins challenges players to use fear as their ultimate weapon. The gameStep into the shadows of Gotham City’s perilous criminal underworld as DC Comics’ legendary Dark Knight in the Batman Begins video game. Slated for release day and date with the Warner Bros. Pictures film, Batman Begins challenges players to use fear as their ultimate weapon. The game explores the origins of the Batman legend and the Dark Knight’s emergence as a force for good in Gotham. Gamers will play as both Bruce Wayne and his alter-ego, Batman, hunting evil-doers from the shadows, using strength, intellect and an array of high tech gadgets to fight the sinister forces that threaten the city, including classic villains the Scarecrow, Ra’s Al Ghul and Carmine Falcone. Turning traditional stealth-based gameplay on its ear – by allowing gamers to play the hunter, rather than the hunted – Batman Begins delivers the Batmanuniverse as never before. Stalking criminals from the shadows, gamers will discover new ways to paralyze thugs with fear before engaging in hand-to-hand combat, or interrogating them. From the halls of Arkham Asylum and the alleys of Gotham City to an ancient monastery high in the Himalayas, Batman Begins the video game delivers a thrilling interactive companion to Christopher Nolan’s reinvention of the Dark Knight in Batman Begins. [Electronic Arts]… Expand"}, {"name": "Carve", "details_link": "https://www.metacritic.com/game/xbox/carve", "publisher": "Global Star Software", "release_date": "Feb 24 2004", "developers": ["Argonaut Games"], "platforms": "Xbox", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Snow / Water"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/ce6846efc889df31326b4357a05a588a-98.jpg", "descriptions": "Welcome to the world of extreme watercraft racing. Carve takes you and your teammate around the globe to battle watercraft racing teams vying for the top-rank position. Exotic locales and intense weather and wave conditions make for challenging courses. Master eight individual racing stylesWelcome to the world of extreme watercraft racing. Carve takes you and your teammate around the globe to battle watercraft racing teams vying for the top-rank position. Exotic locales and intense weather and wave conditions make for challenging courses. Master eight individual racing styles along with signature tricks that can be performed off the ramp or on the water. Showcase your talent in five challenging tournaments or against three of your friends in split-screen multiplayer mode.… Expand"}, {"name": "Aliens Versus Predator: Extinction", "details_link": "https://www.metacritic.com/game/xbox/aliens-versus-predator-extinction", "publisher": "EA Games", "release_date": "Jul 30 2003", "developers": ["Zono Inc."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Sci-Fi"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/b9846e38201057e81d4f79582c76b05c-98.jpg", "descriptions": "On a cold distant planet, the war against extinction begins, and your command skills will determine its outcome. Lead an Alien hive, a Predator clan, or an elite squad of Colonial Marines to victory in 21 single-player missions. Each race has its own characteristics, abilities, weapons, andOn a cold distant planet, the war against extinction begins, and your command skills will determine its outcome. Lead an Alien hive, a Predator clan, or an elite squad of Colonial Marines to victory in 21 single-player missions. Each race has its own characteristics, abilities, weapons, and vehicles to suit your style of play. The survival of your species depends on your ability to use powerful resources and strategies, including pulse rifles, exosuits, and air strikes.… Expand"}, {"name": "X-Squad", "details_link": "https://www.metacritic.com/game/playstation-2/x-squad", "publisher": "Electronic Arts", "release_date": "Oct 23 2000", "developers": ["Electronic Arts"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/59238277a07ded88d0ba350899412925-98.jpg", "descriptions": "The year is 2037, terrorists have taken over a secret military complex. X Squard, an elite covert force, is called in to eliminate the enemy and regain control."}, {"name": "Ratchet & Clank: Full Frontal Assault", "details_link": "https://www.metacritic.com/game/playstation-3/ratchet-clank-full-frontal-assault", "publisher": "SCEA", "release_date": "Nov 27 2012", "developers": ["Insomniac Games"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/9e67fd114d93692ebcdfa080b2f16c5d-98.jpg", "descriptions": "Ratchet & Clank: Full Frontal Assault (known as Ratchet & Clank: QForce in the UK/EU) blends the series’ classic comedy, camera, and controls with a new way to play. Drop into the middle of an intergalactic conflict, choose your weapons, and experience Full Frontal Assault solo, or togetherRatchet & Clank: Full Frontal Assault (known as Ratchet & Clank: QForce in the UK/EU) blends the series’ classic comedy, camera, and controls with a new way to play. Drop into the middle of an intergalactic conflict, choose your weapons, and experience Full Frontal Assault solo, or together with friends online or splitscreen.… Expand"}, {"name": "Yakuza: Dead Souls", "details_link": "https://www.metacritic.com/game/playstation-3/yakuza-dead-souls", "publisher": "Sega", "release_date": "Mar 13 2012", "developers": ["Ryu ga Gotoku Studios"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 64, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/0c7577c2c4126bab9a16ffc41445cf6d-98.jpg", "descriptions": "As the story begins, it's business is as usual in Kamurocho. Soon, however, all hell breaks loose as a zombie outbreak turns the area into a quarantine zone, walled off by the Japanese Self Defense Force. This quarantine zone gradually expands as the story progresses. Real-life shops andAs the story begins, it's business is as usual in Kamurocho. Soon, however, all hell breaks loose as a zombie outbreak turns the area into a quarantine zone, walled off by the Japanese Self Defense Force. This quarantine zone gradually expands as the story progresses. Real-life shops and signs from the quarantine zone add a sense of realism to the scene. Added to the sub stories is a new \"Buddy\" system, where players can recruit and fight alongside local residents, further enhances gameplay. And as for corporate tie-in products and stores - a hallmark of the RYU-GA-GOTOKU series - OF THE END features\rmore of them than ever before. Two Kamurochos for you to explore to your heart's content: the blazing neon streets of the red-light district, and the desperate squalor of the quarantine zone.… Expand"}, {"name": "ADR1FT", "details_link": "https://www.metacritic.com/game/pc/adr1ft", "publisher": "505 Games", "release_date": "Mar 28 2016", "developers": ["Three One Zero"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Survival"], "meta_score": 64, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/38d1593293f18087ad9315b879f95ce7-98.jpg", "descriptions": "Adrift is an immersive First Person Experience (FPX) that recounts the story of an astronaut in danger. Floating quietly within the wreckage of a destroyed space station with no memories and a critically damaged EVA suit, the lone survivor struggles to understand the cause of theAdrift is an immersive First Person Experience (FPX) that recounts the story of an astronaut in danger. Floating quietly within the wreckage of a destroyed space station with no memories and a critically damaged EVA suit, the lone survivor struggles to understand the cause of the catastrophic event that killed everyone on board. The player must fight to stay alive by exploring the wreckage for precious resources and overcome the challenges of the unforgiving environment to repair the damaged emergency escape vehicle and safely return home. [505 Games]… Expand"}, {"name": "Chaos Wars", "details_link": "https://www.metacritic.com/game/playstation-2/chaos-wars", "publisher": "O3 Entertainment", "release_date": "May 30 2008", "developers": ["Idea Factory"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 64, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/9a829cec43dc6157dfbdd4af86ab7129-98.jpg", "descriptions": "Chaos Wars is an immersive tactical role-playing experience featuring your favorite characters from such games as; Growlanser, Shadow Hearts, Gungrave, Spectral Force, and many others. [EB Games]"}, {"name": "The Incredible Adventures of Van Helsing III", "details_link": "https://www.metacritic.com/game/pc/the-incredible-adventures-of-van-helsing-iii", "publisher": "NeocoreGames", "release_date": "May 22 2015", "developers": ["NeocoreGames"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/4af10ee2b6c7893c9ad01e3e64016ee4-98.jpg", "descriptions": "In Van Helsing III, the civil war is over in Borgovia, but the future looks grim. The city of weird science is in ruins, squabbling factions and criminals fight for power and a strange cult prophesizes the coming of “The end of times.” And they might be just right: A wave of uncanny eventsIn Van Helsing III, the civil war is over in Borgovia, but the future looks grim. The city of weird science is in ruins, squabbling factions and criminals fight for power and a strange cult prophesizes the coming of “The end of times.” And they might be just right: A wave of uncanny events shakes the land, and it’s all connected to a mysterious creature, a former ally turned into a fearful arch-villain. Which means that Van Helsing will do what he does best: He wields weapons, prepares his deadly tricks, and hunts down the most dangerous monster who has ever lived… and this time it’s personal. He’s prepared to do anything to achieve his goal, even to face the darkest secret about the birth of the modern Borgovia. … Expand"}, {"name": "Super Lucky's Tale", "details_link": "https://www.metacritic.com/game/xbox-one/super-luckys-tale", "publisher": "Microsoft Game Studios", "release_date": "Nov  7 2017", "developers": ["Playful Corp."], "platforms": ["PC", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["2D", "Action", "Platformer", "3D"], "meta_score": 64, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/af4f69023f25f84924b943c6d89dad41-98.jpg", "descriptions": "Follow Lucky, the ever-optimistic, energetic, and lovable hero, on his quest to find his inner strength and help his sister rescue the Book of Ages from Jinx. Jinx is the scheming and mysterious villain trying to reshape the world, but for what reason? Test your skills with puzzles and nerveFollow Lucky, the ever-optimistic, energetic, and lovable hero, on his quest to find his inner strength and help his sister rescue the Book of Ages from Jinx. Jinx is the scheming and mysterious villain trying to reshape the world, but for what reason? Test your skills with puzzles and nerve wracking obstacle courses. Plus, surprise levels and hidden “foxholes” showing up where you least expect them, challenging Lucky to use his wits and skill. Explore hidden secrets of new worlds with Lucky’s signature burrow move. Dive into unpredictable foxholes, or try devilish side scrolling challenge levels to unlock additional rewards. [Xbox.com]… Expand"}, {"name": "Cold War", "details_link": "https://www.metacritic.com/game/pc/cold-war", "publisher": "DreamCatcher Interactive", "release_date": "Sep 27 2005", "developers": ["Mindware Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 64, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/50fce48b470d785ac83bd1eff129a811-98.jpg", "descriptions": "Cold War follows the story of a freelance journalist who finds himself in the midst of an international conspiracy that aims to control the U.S.S.R. Twelve hours after arriving in Moscow for a routine story, he has been stripped of all possessions, beaten unconscious and thrown into theCold War follows the story of a freelance journalist who finds himself in the midst of an international conspiracy that aims to control the U.S.S.R. Twelve hours after arriving in Moscow for a routine story, he has been stripped of all possessions, beaten unconscious and thrown into the KGB's political prison. Using only recovered weapons and improvised gadgets, he must now evade or overcome elite Soviet forces and defeat the conspiracy before he is sent to a Siberian prison camp or killed. Powerful and widely-recognized setting - mid-1980's U.S.S.R. Strong espionage/stealth gameplay - including gadgets like the x-ray camera. Interactive non-linear world: Accomplish objectives in multiple ways - find hidden paths, combine in-game elements to create weapons and traps, or silently eliminate opponents. Set in real Soviet locations, and is built around locations such as Lenin's Mausoleum, Chernobyl and the KGB's notorious Ljubljanka prison. [DreamCatcher]… Expand"}, {"name": "Dynasty Warriors 9 Empires", "details_link": "https://www.metacritic.com/game/xbox-series-x/dynasty-warriors-9-empires", "publisher": "Koei Tecmo Games", "release_date": "Feb 15 2022", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 64, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/0cad218791c09281fbe8be9a2ef4ac2f-98.jpg", "descriptions": "Empires, a unique \"Romance of the Three Kingdoms\" experience. Dramatic stories of officers on different sides. All 94 officers who have appeared in DYNASTY WARRIORS 9 are  playable. In addition, players can control all 700 common officers. A major change from previous series titles, areasEmpires, a unique \"Romance of the Three Kingdoms\" experience. Dramatic stories of officers on different sides. All 94 officers who have appeared in DYNASTY WARRIORS 9 are  playable. In addition, players can control all 700 common officers. A major change from previous series titles, areas around castles become battlefields, evolving into “Storming the Castle” instances. Employ strategic Secret Plans and balance Army Affinity to break through the enemy's gate. Defeat the enemy commander in Decisive Battle mode to claim victory of the castle. The Empires series' signature domestic system is back. With a high degree of flexibility, set long and mid term kingdom goals, recruit new officers, procure logistics, and execute a variety of military, economic and diplomatic commands to strive to unify China.… Expand"}, {"name": "Snooker 19", "details_link": "https://www.metacritic.com/game/switch/snooker-19", "publisher": "Ripstone", "release_date": "Aug 23 2019", "developers": ["Lab42"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Sports", "Individual", "Billiards"], "meta_score": 64, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/6/bf3ce50695e72d749f3df6b7190992d7-98.jpg", "descriptions": "Play in every officially licensed tournament as any of the top 128 players in the world including: Mark Selby, Ronnie O’Sullivan, Ding Junhui and legends of the sport like Ken Doherty and Jimmy White."}, {"name": "Naruto Shippuden: Naruto vs. Sasuke", "details_link": "https://www.metacritic.com/game/ds/naruto-shippuden-naruto-vs-sasuke", "publisher": "Tomy Corporation", "release_date": "Nov 12 2010", "developers": ["Takara Tomy"], "platforms": "DS", "genres": ["Action", "General", "General", "Beat-'Em-Up", "2D"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/e332252983abcfaeed447967d8e0e2ad-98.jpg", "descriptions": "Experience first-hand one of the most popular storylines from the NARUTO SHIPPUDEN arc as Naruto and Sasuke face off amidst a backdrop laced with intrigue and subterfuge!  Discover, recruit, and swap fighters into your team to meet the needs of any given situation.  Compete against yourExperience first-hand one of the most popular storylines from the NARUTO SHIPPUDEN arc as Naruto and Sasuke face off amidst a backdrop laced with intrigue and subterfuge!  Discover, recruit, and swap fighters into your team to meet the needs of any given situation.  Compete against your friends in Wireless Battle Mode for up to four players, or play cooperatively in the new Boss Rush Mode (local wireless only).  Take part in thrilling battles and exciting mysteries, all leading up to the epic showdown between Naruto and Sasuke!… Expand"}, {"name": "Officers", "details_link": "https://www.metacritic.com/game/pc/officers", "publisher": "Tri Synergy", "release_date": "Jul 14 2009", "developers": ["3A Games"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/d5e283311a175eabcc68a7338ab38385-98.jpg", "descriptions": "Officers puts you in command of the Allied force in the largest conflict of our time. Take control of the US and British armies in order to strike back and defeat the Axis menace on the Western front of Europe. With over 1500 units on maps up to 10 square miles, Officers is the first WWIIOfficers puts you in command of the Allied force in the largest conflict of our time. Take control of the US and British armies in order to strike back and defeat the Axis menace on the Western front of Europe. With over 1500 units on maps up to 10 square miles, Officers is the first WWII real time strategy game to let you fight on a truly massive scale. Historical battles like Operation Overlord, Millennium, and Cobra will put your tactical skills to the test using combined forces from infantry. [Tri Synergy]… Expand"}, {"name": "Zombie Driver HD", "details_link": "https://www.metacritic.com/game/xbox-360/zombie-driver-hd", "publisher": "EXOR Studios", "release_date": "Oct 17 2012", "developers": ["EXOR Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360"], "genres": ["Action", "Simulation", "General", "General", "Vehicle", "Combat"], "meta_score": 64, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/5/c53511b078aeaf0679632cd59a52a854-98.jpg", "descriptions": "A mix of cars, speed, explosions, blood and zombies. Fight through an extensive narrative campaign or test yourself in the Slaughter and Blood Race modes. Engage huge bosses, save survivors, drive crazy vehicles such as a bulldozer, fire truck or even a tank and smash everything in your way.A mix of cars, speed, explosions, blood and zombies. Fight through an extensive narrative campaign or test yourself in the Slaughter and Blood Race modes. Engage huge bosses, save survivors, drive crazy vehicles such as a bulldozer, fire truck or even a tank and smash everything in your way. Take part in the Blood Race tournament - chase other cars and take them down without mercy on brutal racing tracks. Jump into the Slaughter mode and survive as long as possible on specially crafted arenas.… Expand"}, {"name": "Crash Twinsanity", "details_link": "https://www.metacritic.com/game/playstation-2/crash-twinsanity", "publisher": "VU Games", "release_date": "Sep 28 2004", "developers": ["Traveller's Tales"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 64, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/fd97f00bae01bcb644bd9ea922e4b125-98.jpg", "descriptions": "Crash's worst enemy is now his favorite weapon! A new evil has invaded the island paradise of Crash Bandicoot with sinister plans of destruction. In a strange twist, Crash reluctantly pairs with his arch-enemy, Dr. Neo Cortex, in order to save his world. Through their unorthodox partnership,Crash's worst enemy is now his favorite weapon! A new evil has invaded the island paradise of Crash Bandicoot with sinister plans of destruction. In a strange twist, Crash reluctantly pairs with his arch-enemy, Dr. Neo Cortex, in order to save his world. Through their unorthodox partnership, Cortex is abused as Crash's favorite weapon when Crash and Cortex are controlled as one in an hilarious all-new gameplay mechanic. Encounter reactive enemies, fully immersive environments, and a wacky cast of all new characters in Crash Bandicoot's craziest and funniest adventure ever. [Vivendi Universal]… Expand"}, {"name": "MX vs. ATV All Out: Anniversary Edition", "details_link": "https://www.metacritic.com/game/xbox-one/mx-vs-atv-all-out-anniversary-edition", "publisher": "THQ Nordic", "release_date": "Feb 26 2019", "developers": ["THQ Nordic"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/1cbe6eb4cb0cd173d0bb441e3e17eecb-98.jpg", "descriptions": null}, {"name": "Darksiders III", "details_link": "https://www.metacritic.com/game/playstation-4/darksiders-iii", "publisher": "THQ Nordic", "release_date": "Nov 27 2018", "developers": ["Gunfire Games", "THQ Nordic"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/5914cd5303db4d6e87d54767bd5744ad-98.jpg", "descriptions": "Return to an apocalyptic Earth in Darksiders III, a hack-n-slash Action Adventure where players assume the role of FURY in her quest to hunt down and dispose of the Seven Deadly Sins. The most unpredictable and enigmatic of the Four Horsemen, FURY must succeed where many have failed - toReturn to an apocalyptic Earth in Darksiders III, a hack-n-slash Action Adventure where players assume the role of FURY in her quest to hunt down and dispose of the Seven Deadly Sins. The most unpredictable and enigmatic of the Four Horsemen, FURY must succeed where many have failed - to bring balance to the forces that now ravage Earth. Darksiders III is the long-anticipated, third chapter in the critically-acclaimed Darksiders franchise.… Expand"}, {"name": "RymdResa", "details_link": "https://www.metacritic.com/game/pc/rymdresa", "publisher": "Morgondag", "release_date": "Aug 20 2015", "developers": ["Morgondag"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 64, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/8/0ceafe012b2d4a9503fe5de4bb236b38-98.jpg", "descriptions": "A roguelike space odyssey in a procedurally generated world. RymdResa is a challenging and evolving adventure where abstract poetry and art are expressed throughout a lonely and and calm journey in space. Travel through a mysterious cosmos, deep and beyond."}, {"name": "Hydrophobia: Prophecy", "details_link": "https://www.metacritic.com/game/pc/hydrophobia-prophecy", "publisher": "Dark Energy Digital", "release_date": "May  9 2011", "developers": ["Dark Energy Digital"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 64, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/d0341050e4ada2fe2aca9c734e7ce576-98.jpg", "descriptions": "This comprehensive reinvention of the title includes upgraded graphics, brand new gameplay mechanics, exclusive new levels, a reworked back story, a dramatic new ending, recast voice acting and much, much more."}, {"name": "Intellivision Lives!", "details_link": "https://www.metacritic.com/game/playstation-2/intellivision-lives!", "publisher": "Crave", "release_date": "Nov 20 2003", "developers": ["Realtime Associates"], "platforms": "PlayStation 2", "num_players": "1-6 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/2010e043904e231d7f0f30d5f920e1af-98.jpg", "descriptions": "Relive the 80?s with Intellivision Lives! Over 60 classic Intellivision games available all in one package. Your all-time favorite games like Baseball, Astrosmash, Space Battle and more! A library of over 60 classic Intellivision games; Historical information and fun facts about the games,Relive the 80?s with Intellivision Lives! Over 60 classic Intellivision games available all in one package. Your all-time favorite games like Baseball, Astrosmash, Space Battle and more! A library of over 60 classic Intellivision games; Historical information and fun facts about the games, including interviews with the original Intellivision developers; View original Intellivision commercials and archival footage! All games optimized for the DUALSHOCK2 analog controller; Exclusive unreleased games: Hardhat, Brickout and Deep Pockets for the PlayStation 2. [Crave]… Expand"}, {"name": "Worms: Open Warfare", "details_link": "https://www.metacritic.com/game/ds/worms-open-warfare", "publisher": "THQ", "release_date": "Mar 22 2006", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Artillery"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/7a110cc93dd5ce1462532fca3b2be43f-98.jpg", "descriptions": "Retaining the same award-winning gameplay, unique sense of humor and clever mix of action and strategy that has epitomized the brand for almost a decade, Worms makes its debut on the Sony PSP and the Nintendo DS. Classic Gameplay – Return of the classic and much acclaimed 2D turn-basedRetaining the same award-winning gameplay, unique sense of humor and clever mix of action and strategy that has epitomized the brand for almost a decade, Worms makes its debut on the Sony PSP and the Nintendo DS. Classic Gameplay – Return of the classic and much acclaimed 2D turn-based gameplay. Over The Weapons – Including bazooka-toting worms, exploding sheep, homing missiles, grenades and banana bouncing bombs of death. Unparalleled Multiplayer Experience – Multiplayer mode allowing up to four players using one unit (hot seat). Multiplayer mode via WIFI technology allowing connection of 4 units. Conflict and Destruction – Take on all-comers over a nearly infinite number of randomly-generated landscapes, or face the fiendishly intelligent artificial intelligence in Deathmatch Challenge mode. [THQ]… Expand"}, {"name": "Hellpoint", "details_link": "https://www.metacritic.com/game/pc/hellpoint", "publisher": "tinyBuild", "release_date": "Jul 30 2020", "developers": ["Cradle Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 64, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/7c4b45b1dc3585a55ad19176e759601d-98.jpg", "descriptions": "Hellpoint is an intense action RPG taking place on Irid Novo, a derelict space station soaked in an intoxicating dark sci fi atmosphere. Fight dreadful creatures, face the Cosmic Gods and unravel their twisted story. Should the challenge be too great, play with a friend in local or online coop."}, {"name": "The Outer Worlds: Murder on Eridanos", "details_link": "https://www.metacritic.com/game/playstation-4/the-outer-worlds-murder-on-eridanos", "publisher": "Private Division", "release_date": "Mar 17 2021", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 64, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/71be879fe53496251fe0e81ef4e252bd-98.jpg", "descriptions": "The second and final expansion to the sci-fi role-playing game. The core of Murder on Eridanos is to solve a crime… and murder is just the beginning of what you will find. You will have to interrogate witnesses, learn about potential alibis, and argue who you believe is responsible. ThisThe second and final expansion to the sci-fi role-playing game. The core of Murder on Eridanos is to solve a crime… and murder is just the beginning of what you will find. You will have to interrogate witnesses, learn about potential alibis, and argue who you believe is responsible. This also leads to some entertaining outcomes as it is up to you to decide what to do. Do you falsely accuse an innocent spectator? Do you present a poor case with lack of evidence? How will others respond? What happens if you try to convince people that you somehow are responsible for the murder? Yes, even that is possible. [Obsidian]… Expand"}, {"name": "Battlefield 2042", "details_link": "https://www.metacritic.com/game/xbox-series-x/battlefield-2042", "publisher": "Electronic Arts", "release_date": "Nov 12 2021", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 64, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/9/114d631f6ae5f1ed3689828f654ebe0e-98.jpg", "descriptions": "Battlefield 2042 marks the return to the iconic all-out warfare of the franchise. Adapt and overcome dynamically-changing battlegrounds with the help of your squad and a cutting-edge arsenal. With support for 128 players*, prepare for unprecedented scale on vast environments. Take on massiveBattlefield 2042 marks the return to the iconic all-out warfare of the franchise. Adapt and overcome dynamically-changing battlegrounds with the help of your squad and a cutting-edge arsenal. With support for 128 players*, prepare for unprecedented scale on vast environments. Take on massive experiences, from updated multiplayer modes like Conquest and Breakthrough to the all-new Hazard Zone.… Expand"}, {"name": "Spirit of the North: Enhanced Edition", "details_link": "https://www.metacritic.com/game/playstation-5/spirit-of-the-north-enhanced-edition", "publisher": "Merge Games", "release_date": "Nov 26 2020", "developers": ["Infuse Studio"], "platforms": ["Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 64, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/75b011355cdf934ac205305bbeb8b5ac-98.jpg", "descriptions": "Spirit of the North: Enhanced Edition is a single-player 3rd-person adventure game inspired by the breathtaking and mysterious landscapes of Iceland. The story takes root from various pieces of Nordic folklore. Play as an ordinary fox whose story becomes entwined with The Guardian of theSpirit of the North: Enhanced Edition is a single-player 3rd-person adventure game inspired by the breathtaking and mysterious landscapes of Iceland. The story takes root from various pieces of Nordic folklore. Play as an ordinary fox whose story becomes entwined with The Guardian of the Northern Lights, a magical spirit fox. As you journey over the mountains and under red-stained skies, you’ll discover more about your companion and a land left in ruin.\r Uniquely designed to purposefully have no dialogue or narration. Players must breathe in their surroundings to solve various puzzles and speculate the meaning of a lost ancient civilization.… Expand"}, {"name": "Storm", "details_link": "https://www.metacritic.com/game/xbox-360/storm", "publisher": "Namco Bandai Games", "release_date": "Jun 14 2013", "developers": ["EKO Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "General", "General"], "meta_score": 64, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/6/450b14b16575e5a1a21b178892f47060-98.jpg", "descriptions": "Storm is a physics-based puzzle platform game where players control the weather, breathing gusts of wind, summoning torrents of rain, and calling down thunderous claps of lightning. The goal is to manipulate the environment in order to move a series of balls from the beginning of the levelStorm is a physics-based puzzle platform game where players control the weather, breathing gusts of wind, summoning torrents of rain, and calling down thunderous claps of lightning. The goal is to manipulate the environment in order to move a series of balls from the beginning of the level to the end, navigating treacherous terrain and puzzling pitfalls along the way. Collecting power spheres, players charge their elemental abilities and master the awesome power of nature in Storm.… Expand"}, {"name": "TNA iMPACT!", "details_link": "https://www.metacritic.com/game/playstation-3/tna-impact!", "publisher": "Midway", "release_date": "Sep  9 2008", "developers": ["Midway Studios - Los Angeles"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 64, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/84a2a05a1677c4c7a8a79794c3d05a97-98.jpg", "descriptions": "TNA iMPACT! is geared towards a quick paced, high-impact style of play, with less emphasis on submission moves. It also features straightforward, intuitive controls, with \"accurate\" and \"detailed\" character models. Actual scans of the wrestlers were used for the game in place of hand-paintedTNA iMPACT! is geared towards a quick paced, high-impact style of play, with less emphasis on submission moves. It also features straightforward, intuitive controls, with \"accurate\" and \"detailed\" character models. Actual scans of the wrestlers were used for the game in place of hand-painted textures to include small details, such as skin textures. Wrestling maneuvers are captured from actual TNA wrestlers in extensive motion capture sessions. Finishers are accessed by building up an \"Impact! meter\" displayed on the screen, the same place a color-coded damage indicator shows the condition of characters. The game also features mini-games for escaping pin attempts and submission holds. TNA's exclusive Ultimate X and King of the Mountain are playable match types alongside the more standard singles, tag team and Fatal Four-Way matches. The game is playable online, and supports tournaments. Eight different venues—including TNA's main home, the Florida Impact! Zone, and arenas in Japan and England—are be available to house matches, with the Impact! Zone having an increased ringside area for play and hotspots for player interaction. The game also features top wrestling talent such as Abyss, Kurt Angle, Christian Cage, Jeff Jarrett, Booker T, Samoa Joe, AJ Styles, Sting and more to deliver all of the excitement and action of the television show. [Midway]… Expand"}, {"name": "RPG Maker Fes", "details_link": "https://www.metacritic.com/game/3ds/rpg-maker-fes", "publisher": "NIS America", "release_date": "Jun 27 2017", "developers": ["Jupiter Corporation", "Kadokawa"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 64, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/9fc04446daaabb3b324857884c582309-98.jpg", "descriptions": "Ready to become a game developer? RPG Maker Fes makes it easy to develop any RPG you can imagine without any programming knowledge. Simple but powerful tools let you bring to life the amazing stories in your head. Customize characters, stories, combat and more to become the next greatReady to become a game developer? RPG Maker Fes makes it easy to develop any RPG you can imagine without any programming knowledge. Simple but powerful tools let you bring to life the amazing stories in your head. Customize characters, stories, combat and more to become the next great developer. Then, share your creations and play other users' games with RPG Maker Player. RPG Maker Fes can create, upload/share, download, and play created games. You do not need Maker Player to share games or play other users' games. What story will you share? [Nintendo]\r… Expand"}, {"name": "nail'd", "details_link": "https://www.metacritic.com/game/xbox-360/naild", "publisher": "Deep Silver", "release_date": "Nov 30 2010", "developers": ["Techland"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 64, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/9a100b9e3fb5bdb1d61c363b7b9c44cb-98.jpg", "descriptions": "nail’d is all about eschewing boring realism for over the top arcade fun. It’s a racer that challenges everything from player reflexes through to the rules of physics. Riding on ATVs and motocross bikes with powerful boost controls, players will race down near-vertical courses of incrediblenail’d is all about eschewing boring realism for over the top arcade fun. It’s a racer that challenges everything from player reflexes through to the rules of physics. Riding on ATVs and motocross bikes with powerful boost controls, players will race down near-vertical courses of incredible jumps, stunts and obstacles. The brutal challenge of the Yosemite National Park is but one of the places they’ll learn the meaning of verticality.… Expand"}, {"name": "Killer Is Dead", "details_link": "https://www.metacritic.com/game/playstation-3/killer-is-dead", "publisher": "XSEED Games", "release_date": "Aug 27 2013", "developers": ["Grasshopper Manufacture"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 64, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/86dddf6bbfc168bd71b71a68a2224439-98.jpg", "descriptions": "Killer Is Dead is a title from the demented mind of celebrated game creator, SUDA51, serving as a spiritual successor to his previous cult favorites, No More Heroes and Killer 7."}, {"name": "Arc Rise Fantasia", "details_link": "https://www.metacritic.com/game/wii/arc-rise-fantasia", "publisher": "Ignition Entertainment", "release_date": "Jul 27 2010", "developers": ["Image Epoch", "Imageepoch"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 64, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/9a06e483f5d8021cf2d08e6117850955-98.jpg", "descriptions": "Arc Rise Fantasia is set in the Meridian Empire. Creatures called \"Contaminant Dragons\" are causing trouble as they pass the Meridian in flocks. If one is killed, the resulting explosion poisons the local area. When the empire receives word that a massive horde has its sights on the capitalArc Rise Fantasia is set in the Meridian Empire. Creatures called \"Contaminant Dragons\" are causing trouble as they pass the Meridian in flocks. If one is killed, the resulting explosion poisons the local area. When the empire receives word that a massive horde has its sights on the capital of Diamant, it immediately sends out an army to fight them, including L'Arc, a cool and collected novice mercenary, and his friend Alf, the beloved prince and second in line for the throne. L'Arc is severely injured during the battle, but is saved by a girl named Ryfia, who has secrets in her past and possesses the power to control \"ley squalls,\" naturally occurring storms of no magic that usually take the form of luminous rain. A young woman named Adele, who has been a friend of L'Arc since childhood, renders assistance to the party through use of her unique form of combat, Luminomancy.… Expand"}, {"name": "Exit DS", "details_link": "https://www.metacritic.com/game/ds/exit-ds", "publisher": "Square Enix", "release_date": "Nov  5 2008", "developers": ["Moss"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Puzzle", "General", "General"], "meta_score": 64, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/627bb8625d9d201d077e80efdb084a51-98.jpg", "descriptions": "As professional escape artist Mr.Esc, players maneuver through burning buildings and sinking ships as they dodge disaster and save survivors along the way. Exit DS makes a return to the portable scene with all-new Touch-Screen functionality and over 100 stages to solve."}, {"name": "Cat Cafe Manager", "details_link": "https://www.metacritic.com/game/pc/cat-cafe-manager", "publisher": "Roost Games", "release_date": "Apr 14 2022", "developers": ["Roost Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/a0a1df26f6ec010609dc8168b4efa546-98.jpg", "descriptions": "Travel to the sleepy village of Caterwaul Way and rebuild your grandmother's cat cafe. Renovate your restaurant, befriend the local cats and townsfolk, forge lasting friendships, unravel catty mysteries, and build a home for dozens of unique felines!"}, {"name": "Vampire: The Masquerade - Shadows of New York", "details_link": "https://www.metacritic.com/game/pc/vampire-the-masquerade---shadows-of-new-york", "publisher": "Draw Distance", "release_date": "Sep 10 2020", "developers": ["Draw Distance"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 64, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/b1fb0e57385beb4a6f5e539df80ee788-98.jpg", "descriptions": "You're a nobody. An outcast in your own vampiric sect. A political prisoner of no particular value. An immigrant who never found her roots in a city of immigrants. A chainsmoker whose favorite pastime is staring blankly at the streets through the windows of a fast food joint at 4AM. TheYou're a nobody. An outcast in your own vampiric sect. A political prisoner of no particular value. An immigrant who never found her roots in a city of immigrants. A chainsmoker whose favorite pastime is staring blankly at the streets through the windows of a fast food joint at 4AM. The sinking feeling in the pit of your stomach tells you that you're doomed, and distorted voices from the shadows seem to agree. The curse of your clan makes interacting with everyday technology difficult. Dissociation is your natural state.But when New York's Anarch leader meets a gruesome end, out of all the bloodsuckers in the metropolis, you're the one picked to investigate. Make no mistake: this is obviously a trap, yet another move in the horrible game of Jyhad, the eternal struggle for power between warring vampire generations. But you're Lasombra, and if there's one thing you know, it's this: if the Ventrue Prince and her followers underestimate you, they're going to deeply regret it.Vampire: The Masquerade Shadows of New York is a visual novel set in the rich universe of Vampire: The Masquerade. It acts as a stand-alone expansion and a companion piece to our previous title, Coteries of New York. While Coteries was a general introduction to the world depicted in the 5th Edition of the hit tabletop role-playing game, Shadows presents a more personal and unique tale.… Expand"}, {"name": "Track Lab", "details_link": "https://www.metacritic.com/game/playstation-4/track-lab", "publisher": "Sony Interactive Entertainment", "release_date": "Aug 21 2018", "developers": ["Sony Interactive Entertainment"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 64, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/31e2cfc5970ab622624e871db66a7a22-98.jpg", "descriptions": "Put on your PlayStation VR headset and enter a virtual space full of musical potential. Exclusive to PS VR, Track Lab lets you easily create new beats by moving musical building blocks around in their virtual environment.With an intuitive and extensive toolkit at your fingertips, everyPut on your PlayStation VR headset and enter a virtual space full of musical potential. Exclusive to PS VR, Track Lab lets you easily create new beats by moving musical building blocks around in their virtual environment.With an intuitive and extensive toolkit at your fingertips, every genre from techno, to hip-hop, to rock can be mixed to make your perfect track. No musical experience is required -- but if you need a helping hand to get you started, Evolver mode teaches you patterns and musical constructs by solving puzzles in different musical genres.When you've created a masterpiece, share the love and stream your performances to the world, via PlayStation Network.… Expand"}, {"name": "Rainbow Skies", "details_link": "https://www.metacritic.com/game/playstation-4/rainbow-skies", "publisher": "SideQuest Studios", "release_date": "Jun 26 2018", "developers": ["SideQuest Studios"], "platforms": ["3DS", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 64, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/294769d900def55c2969fae12bf66b1e-98.jpg", "descriptions": "Rainbow Skies is a fantasy RPG with turn-based battles and a humorous story. Immerse yourself in a colorful and vibrant world, filled to the brim with friends and foes, murky dungeons, turn-based battles, towns, shops, and everything else your role-playing heart desires."}, {"name": "Atelier Lydie & Suelle: The Alchemists and the Mysterious Paintings", "details_link": "https://www.metacritic.com/game/switch/atelier-lydie-suelle-the-alchemists-and-the-mysterious-paintings", "publisher": "Koei Tecmo Games", "release_date": "Mar 27 2018", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 64, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/c7ce7f61da8c1611f70bf5637883e01f-98.jpg", "descriptions": "Twin sisters Lydie and Suelle are also alchemists, living in Merveille, the capital of Kingdom of Adalet, and they intend to make their atelier the best atelier in the kingdom."}, {"name": "King Oddball", "details_link": "https://www.metacritic.com/game/xbox-one/king-oddball", "publisher": "10tons Ltd", "release_date": "Sep  9 2016", "developers": ["10tons Ltd", "10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/a7aec95fc84bf22f2857c8cfafe790aa-98.jpg", "descriptions": "Squash puny humans in this outlandish PS4 puzzle game.\r How hard can it be?\r\n\r\nUse just a single button to cause mayhem - crush as many targets as possible by releasing a boulder suspended by the King's giant tongue.\r\n\r\nWith more than 120 increasingly challenging levels on the road toSquash puny humans in this outlandish PS4 puzzle game.\r How hard can it be?\r Use just a single button to cause mayhem - crush as many targets as possible by releasing a boulder suspended by the King's giant tongue.\r With more than 120 increasingly challenging levels on the road to world domination, master King Oddball by anticipating how boulders roll, bounce and launch from explosions.… Expand"}, {"name": "Thor: God of Thunder", "details_link": "https://www.metacritic.com/game/ds/thor-god-of-thunder", "publisher": "Sega", "release_date": "May  3 2011", "developers": ["WayForward"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 64, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/3036932a37753996b2d1e544cde6a867-98.jpg", "descriptions": "Thor: The Video Game will take players through a spectacular, epic-scale original third-person adventure for which Matt Fraction, the Eisner Award-winning writer and lead Thor comic book author served as story consultant. In the game, Thor battles through the numerous worlds of NorseThor: The Video Game will take players through a spectacular, epic-scale original third-person adventure for which Matt Fraction, the Eisner Award-winning writer and lead Thor comic book author served as story consultant. In the game, Thor battles through the numerous worlds of Norse mythology that span realms ranging from primal worlds of fire and ice to extraordinary planets inhabited by Frost Giants and Trolls to save Asgard, the capital city of the Norse Gods. Thor must overcome monstrous foes lifted from the pages of the comics including Ulik, Ymir, and Surtur, as well as other monstrous denizens. Players will wield the iconic Mjolnir, Thor’s legendary hammer, to fight enemies on an immense scale while controlling the elemental storm powers of lightning, thunder, and wind to vanquish enemies. As Thor earns Valor points through his exploits, players can acquire new abilities, powers, and weapon upgrades.… Expand"}, {"name": "Cranium Kabookii", "details_link": "https://www.metacritic.com/game/wii/cranium-kabookii", "publisher": "Ubisoft", "release_date": "Dec  4 2007", "developers": ["Ubisoft Quebec"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 64, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/93d35e016b994c1a068d3d41febf41f0-98.jpg", "descriptions": "Cranium Kabookii brings a new dimension to Wii play by celebrating the amazing things friends and family can do as they create, perform, discover and connect with one another. Using the Wii Remote and special Kabookii Decoder Glasses, Cranium Kabookii changes the television screen into aCranium Kabookii brings a new dimension to Wii play by celebrating the amazing things friends and family can do as they create, perform, discover and connect with one another. Using the Wii Remote and special Kabookii Decoder Glasses, Cranium Kabookii changes the television screen into a living canvas where teams jam, draw, act, puzzle and even crack codes to win. New questions and activities get players to spray paint the solar system on a wall (you actually hear the can shaking in your hand!); use the Wii Remote as a mallet to hammer out \"Auld Lang Syne\" on a xylophone; solve word puzzles (what word is both a face card and car lifter?); or trot the globe to test their knowledge of world flags, landmarks and national anthems (frequent flier miles not included!). Kabookii Decoder Glasses add an extra twist, allowing one player at a time to view hidden clues on the screen. [Ubisoft]… Expand"}, {"name": "Star Trek: Tactical Assault", "details_link": "https://www.metacritic.com/game/psp/star-trek-tactical-assault", "publisher": "Bethesda Softworks", "release_date": "Nov 14 2006", "developers": ["Quicksilver Software"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 64, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/d231a083db7ed8085e88697a75442c7a-98.jpg", "descriptions": "Star Trek: Tactical Assault features real-time spaceship combat from the universe of the original Star Trek series. With a wide array of authentic Star Trek races, ships, and weaponry, you can engage in single-player battle through either the Federation or Klingon campaigns or inStar Trek: Tactical Assault features real-time spaceship combat from the universe of the original Star Trek series. With a wide array of authentic Star Trek races, ships, and weaponry, you can engage in single-player battle through either the Federation or Klingon campaigns or in head-to-head wireless multiplayer combat. Both the Federation and Klingon campaign modes feature real-time combat with branching missions and multiple outcomes. With a multitude of paths to choose from, you decide the ultimate outcome of your campaign. Wireless multiplayer mode allows you to test your skills and tactical maneuvers against those of your friends. Successful gameplay relies on strategic movement and effective use of a ship's weapons and shields. [Bethesda Softworks]… Expand"}, {"name": "Avatar: The Last Airbender", "details_link": "https://www.metacritic.com/game/ds/avatar-the-last-airbender", "publisher": "THQ", "release_date": "Oct 10 2006", "developers": ["TOSE"], "platforms": ["PlayStation 2", "DS"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 64, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/394ec6fa8dc18a1ed6e3c66a504a71b5-98.jpg", "descriptions": "Bring to life an adventure of intrigue, deceit and revelation in Avatar The Last Airbender. Play as Aang, Katara, Haru and Sokka as you grow your team into an unstoppable force making discoveries in a thrilling blend of magic and martial arts combat. Use your fully customizable bendingBring to life an adventure of intrigue, deceit and revelation in Avatar The Last Airbender. Play as Aang, Katara, Haru and Sokka as you grow your team into an unstoppable force making discoveries in a thrilling blend of magic and martial arts combat. Use your fully customizable bending powers to master the four elements of Earth, Air, Water and Fire and explore the beautifully detailed environments of the Avatar nations. Single-player game featuring unique martial arts style combat. Fully customizable \"bending powers\" mastering the four elements of Water, Air, Earth and Fire. Journey through all the Great Nations of the Avatar world. Enjoy environments and characters from the TV show plus never before seen enemies and creatures. [THQ]… Expand"}, {"name": "Hello Kitty: Roller Rescue", "details_link": "https://www.metacritic.com/game/gamecube/hello-kitty-roller-rescue", "publisher": "Namco", "release_date": "Aug 16 2005", "developers": ["Xpec"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 64, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/9eb2df7d485ff29f45dc0275dbe54672-98.jpg", "descriptions": "The lovable Sanrio character Hello Kitty has made her way onto the GameCube in a new adventure game. In Hello Kitty: Roller Rescue, you'll explore Hello Kitty's 3D world and encounter a variety of characters, villains, and puzzles. You'll interact with more than 20 Sanrio characters that canThe lovable Sanrio character Hello Kitty has made her way onto the GameCube in a new adventure game. In Hello Kitty: Roller Rescue, you'll explore Hello Kitty's 3D world and encounter a variety of characters, villains, and puzzles. You'll interact with more than 20 Sanrio characters that can help you battle enemies. … Expand"}, {"name": "Lemony Snicket's A Series of Unfortunate Events", "details_link": "https://www.metacritic.com/game/pc/lemony-snickets-a-series-of-unfortunate-events", "publisher": "Activision", "release_date": "Nov 10 2004", "developers": ["Activision"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Platformer", "General", "Platformer", "3D", "3D"], "meta_score": 64, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/2d93d707e3f0d0e749d080e72de1c225-98.jpg", "descriptions": "Based on the unfortunately successful book series and the feature film starring Jim Carrey, this is the tale of Violet, Klaus and Sunny Baudelaire, whose parents perish in a fire. Soon after, they are sent to live with their sinister uncle, Count Olaf, in a most cavernous mansion. GreatBased on the unfortunately successful book series and the feature film starring Jim Carrey, this is the tale of Violet, Klaus and Sunny Baudelaire, whose parents perish in a fire. Soon after, they are sent to live with their sinister uncle, Count Olaf, in a most cavernous mansion. Great tragedy becomes greater misfortune as Olaf's despicable plans are revealed and the siblings must combine forces to prevent the Count and his henchmen from seizing their immense family fortune. Switch among the Baudelaire orphans and utilize their special skills as you journey through 15 perilous missions, from the deep catacombs beneath Olaf’s mansion to the gloomy shores of Lake Lachrymose. Collect household items with Violet, the intrepid inventor, and assemble them into cool contraptions for puzzle-solving and combat. Wield those items with Klaus, the brave intellect, to battle Olaf’s minions. And mind the tottering toddler, Sunny, as she chomps valiantly through obstacles in the orphans’ path with her 4 very sharp teeth. Should you emerge victorious in your attempt to foil Count Olaf's wicked plans, rest assured your success will be temporary, as only woe awaits you in A Series of Unfortunate Events. [Activision]… Expand"}, {"name": "Wrath Unleashed", "details_link": "https://www.metacritic.com/game/playstation-2/wrath-unleashed", "publisher": "LucasArts", "release_date": "Feb 10 2004", "developers": ["Double Helix Games"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 64, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/34737366ef3d7bee404de8deca600301-98.jpg", "descriptions": "Mythological creatures from the dawn of time. Epic contests between darkness and light. Battles for domination of giant floating arenas. Welcome to the fantastic, deadly world of Wrath Unleashed. Part intense fighting-action. Part thought-provoking strategy. Pure vicious head-to-head mayhem.Mythological creatures from the dawn of time. Epic contests between darkness and light. Battles for domination of giant floating arenas. Welcome to the fantastic, deadly world of Wrath Unleashed. Part intense fighting-action. Part thought-provoking strategy. Pure vicious head-to-head mayhem. This unique action-strategy game pits up to four players and an array of all-powerful fantasy creatures against each other. And you'll need to unleash every bit of your wrath upon the world to win. [LucasArts]… Expand"}, {"name": "RoadKill", "details_link": "https://www.metacritic.com/game/gamecube/roadkill", "publisher": "Midway", "release_date": "Oct 30 2003", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Car Combat"], "meta_score": 64, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/1bcc63d3947a806ef3ae90399c98aea9-98.jpg", "descriptions": "RoadKill presents an action-packed, mission-based combat driving experience.  To survive, you must out-drive, outgun and outthink rival gangs, city guards, and anyone else gunning for you in the living, post-apocalyptic territory of Hell County.  With the ability to build up a powerful gangRoadKill presents an action-packed, mission-based combat driving experience.  To survive, you must out-drive, outgun and outthink rival gangs, city guards, and anyone else gunning for you in the living, post-apocalyptic territory of Hell County.  With the ability to build up a powerful gang following, you'll unleash havoc, chaos, and destruction on the environment and its inhabitants with a wide selection of vehicles, a potent armory of weapons, and special equipment in both single-player and various multiplayer game modes.  … Expand"}, {"name": "Pro Rally", "details_link": "https://www.metacritic.com/game/gamecube/pro-rally", "publisher": "Ubisoft", "release_date": "Nov 11 2002", "developers": ["Ubisoft"], "platforms": "GameCube", "num_players": "1-8 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 64, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/aab96e416a6adc0b5a28340ffcf212b3-98.jpg", "descriptions": "It's a frustrating game with a career mode that's too short, and, ultimately, you'd be better off without it."}]