[{"name": "Senran Kagura 2: Deep Crimson", "details_link": "https://www.metacritic.com/game/3ds/senran-kagura-2-deep-crimson", "publisher": "XSEED Games", "release_date": "Sep 15 2015", "developers": ["Tamsoft"], "platforms": "3DS", "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 58, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/2572725fbcd04511e5a80e68f2bece91-98.jpg", "descriptions": "The game follows the Hanzo & Hebijo Shinobi Academies as they battle for good and evil respectively. This time however there is a greater evil at work, as the tyrannous tycoon behind the Hebijo Academy is hell-bent on raining terror across all of Japan by utilising a destructive army ofThe game follows the Hanzo & Hebijo Shinobi Academies as they battle for good and evil respectively. This time however there is a greater evil at work, as the tyrannous tycoon behind the Hebijo Academy is hell-bent on raining terror across all of Japan by utilising a destructive army of summoned demons. This great danger thrusts the girls together and forces them to unite and work as one in a way the series has never seen before. … Expand"}, {"name": "Fishing Master", "details_link": "https://www.metacritic.com/game/wii/fishing-master", "publisher": "Konami", "release_date": "Sep 18 2007", "developers": ["Hudson Soft"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Nature", "Fishing", "Fishing"], "meta_score": 58, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/1f9b80b42a99606760c9b6b48e4437c8-98.jpg", "descriptions": "Fishing gets closer to home in Fishing Master, a title that takes arcade style fishing and updates it for a whole new generation. Utilizing both the Wii Remote and Nunchuk, players bait, cast, hook, & battle a variety of different fish, all from the comfort of their living rooms. PlayersFishing gets closer to home in Fishing Master, a title that takes arcade style fishing and updates it for a whole new generation. Utilizing both the Wii Remote and Nunchuk, players bait, cast, hook, & battle a variety of different fish, all from the comfort of their living rooms. Players assume the role of an up-and-coming fisherman tasked by his grandfather to compete in increasingly difficult fishing tournaments to attain the coveted Fishing Master title. Deep in accessible and varied gameplay, Fishing Master sports a single-player mode and a four-player head-to-head multiplayer mode aiming to have players reeling in the fun for days. [Hudson]… Expand"}, {"name": "Iron Phoenix", "details_link": "https://www.metacritic.com/game/xbox/iron-phoenix", "publisher": "Sega", "release_date": "Mar 25 2005", "developers": ["InterServ International"], "platforms": "Xbox", "num_players": "16  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 58, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/13a88384873c5065a44f18a6ec5e88b2-98.jpg", "descriptions": "Iron Phoenix combines team-oriented strategy with weapon-based combat. Warriors emerge to take part in a final battle for the legendary sword known as the Iron Phoenix. In addition to the single-player story, the game delivers 16-player battles through Xbox Live and System Link. Inspired byIron Phoenix combines team-oriented strategy with weapon-based combat. Warriors emerge to take part in a final battle for the legendary sword known as the Iron Phoenix. In addition to the single-player story, the game delivers 16-player battles through Xbox Live and System Link. Inspired by classic martial arts epics, Iron Phoenix creates a fighting experience that includes rooftop chases, wall-walking, and classic fighting-game combos. Execute bone-crushing moves based on ancient Chinese fighting styles that are motion-captured from real martial artists.… Expand"}, {"name": "Heritage of Kings: The Settlers", "details_link": "https://www.metacritic.com/game/pc/heritage-of-kings-the-settlers", "publisher": "Ubisoft", "release_date": "Feb 24 2005", "developers": ["Blue Byte"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "City Building", "Management", "Historic", "Historic", "Government"], "meta_score": 58, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/95382e221574fb6e0f0126fc613d1b46-98.jpg", "descriptions": "Heritage of Kings: The Settlers is a world-building strategy game with fully rendered 3D visuals and unavoidably addictive gameplay. Players can dive into a detailed medieval world offering a unique mix of RTS and simulation gameplay. A fully functioning community can be created, newHeritage of Kings: The Settlers is a world-building strategy game with fully rendered 3D visuals and unavoidably addictive gameplay. Players can dive into a detailed medieval world offering a unique mix of RTS and simulation gameplay. A fully functioning community can be created, new advancements can be discovered, and enemy forces will be repelled! [Ubisoft]… Expand"}, {"name": "The Legend of Heroes III: Song of the Ocean", "details_link": "https://www.metacritic.com/game/psp/the-legend-of-heroes-iii-song-of-the-ocean", "publisher": "Namco Bandai Games America", "release_date": "Jan 23 2007", "developers": ["Microvision"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 58, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/56e472fe87a43126f1d22e21f22d2372-98.jpg", "descriptions": "A standalone story set in the rich universe of The Legend of Heroes series, The Legend of Heroes III: Song of the Ocean has players take on the role of Forte, a young musician living in the dark Numeros Empire who sets off on an adventure that could determine the fate of the world. With overA standalone story set in the rich universe of The Legend of Heroes series, The Legend of Heroes III: Song of the Ocean has players take on the role of Forte, a young musician living in the dark Numeros Empire who sets off on an adventure that could determine the fate of the world. With over 50 hours of gameplay, players take Forte and his group of wandering musicians on a journey to discover a long-forgotten song of mysterious power left behind by a legendary composer. The 100 unique illustrated characters bring the adventure to life and the familiar RPG gameplay lets anyone with a PSP system become a hero.  With a unique pet system and the ability to save anywhere, The Legend of Heroes III: Song of the Ocean delivers a classic RPG experience. [Namco Bandai Games]… Expand"}, {"name": "Space Hulk: Deathwing", "details_link": "https://www.metacritic.com/game/pc/space-hulk-deathwing", "publisher": "Focus Home Interactive", "release_date": "Dec 14 2016", "developers": ["Streum On Studio"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 58, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/6cec2db951c50864d85a568a542a977c-98.jpg", "descriptions": "Space Hulk: Deathwing is a first-person shooter experience that offers players the chance to experience a desperate battle against Genestealers in the claustrophobic tunnels of a Space Hulk, as they will gain skills, new abilities and new equipment thanks to experience earned during perilousSpace Hulk: Deathwing is a first-person shooter experience that offers players the chance to experience a desperate battle against Genestealers in the claustrophobic tunnels of a Space Hulk, as they will gain skills, new abilities and new equipment thanks to experience earned during perilous missions.… Expand"}, {"name": "Mitsurugi Kamui Hikae", "details_link": "https://www.metacritic.com/game/playstation-4/mitsurugi-kamui-hikae", "publisher": "Playism", "release_date": "Feb 16 2016", "developers": ["Zenith Blue"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 58, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/6/cd368925bc254d3418bcdc19cf4ad184-98.jpg", "descriptions": "Mitsurugi Kamui Hikae is the story of a demonic sword, and the young warrior who stole it for her own ends. Hot on her heels is our main character, and her best friend. Once friends, but now forced to fight each other, players will cut their way through arenas filled with monsters, robots,Mitsurugi Kamui Hikae is the story of a demonic sword, and the young warrior who stole it for her own ends. Hot on her heels is our main character, and her best friend. Once friends, but now forced to fight each other, players will cut their way through arenas filled with monsters, robots, and thugs in need of a good slicing.… Expand"}, {"name": "Castlevania: Lords of Shadow 2", "details_link": "https://www.metacritic.com/game/pc/castlevania-lords-of-shadow-2", "publisher": "Konami", "release_date": "Feb 25 2014", "developers": ["Mercury Steam"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 58, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/55ccc5d311a453bcde32c69eda853140-98.jpg", "descriptions": "Castlevania: Lords of Shadow 2 brings the conclusion to the Lords of Shadow saga as Gabriel Belmont returns to face off against the forces of darkness."}, {"name": "Bang Bang Racing", "details_link": "https://www.metacritic.com/game/xbox-360/bang-bang-racing", "publisher": "Digital Reality", "release_date": "Jun  6 2012", "developers": ["Digital Reality"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Simulation", "Arcade", "GT / Street", "GT / Street", "Automobile"], "meta_score": 58, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/b139657709c645e8c24006a58fdd0d02-98.jpg", "descriptions": "Bang Bang Racing is the complete racing experience – speed your way along every course while fine-tuning your technical driving skills. The intuitive control system and the exciting tracks provide endless fun for every member of the family. Be fast, be furious and be one step ahead of yourBang Bang Racing is the complete racing experience – speed your way along every course while fine-tuning your technical driving skills. The intuitive control system and the exciting tracks provide endless fun for every member of the family. Be fast, be furious and be one step ahead of your competitors by finding shortcuts, repairing your car in the pit lane, dominating your opponents from the top-down view and more!… Expand"}, {"name": "DreamWorks Madagascar: Escape 2 Africa", "details_link": "https://www.metacritic.com/game/playstation-3/dreamworks-madagascar-escape-2-africa", "publisher": "Activision", "release_date": "Nov  4 2008", "developers": ["Toys for Bob"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "1-4 ", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 58, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/ed63d594af88a990c9758292391f2f22-98.jpg", "descriptions": "Join Alex the lion, Marty the Zebra, Melman the Giraffe, Gloria the Hippo and their entire madcap MadagascarTM crew on a whole new action-packed journey to save the African savannah in the Madagascar: Escape 2 Africa video game. Your favorite characters from Madagascar return and you canJoin Alex the lion, Marty the Zebra, Melman the Giraffe, Gloria the Hippo and their entire madcap MadagascarTM crew on a whole new action-packed journey to save the African savannah in the Madagascar: Escape 2 Africa video game. Your favorite characters from Madagascar return and you can play them all! In addition to Alex, Marty, Gloria, and Melman, you also get to play as the crafty penguins, the wacky King Julien and new hippo character Moto Moto! Learn all the moves of each character and choose which character is best for the situation at hand. Adventure through 12 levels and 10 tournament mini-games from othe movie and beyond. Experience the characters, settings and situations established in Dreamworks Animation’s new Madagascar movie. Unique new environments include the Watering Hole, a free roaming area that’s been expanded for the game, the volcano and the plane wreck. Master new and expanded tournament mini-games including twice as much multiplayer action as the first Madagascar! [Activision]… Expand"}, {"name": "Ribbit King", "details_link": "https://www.metacritic.com/game/playstation-2/ribbit-king", "publisher": "Bandai", "release_date": "Jun 15 2004", "developers": ["Bandai"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 58, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/68cacc120f69816a9ccde6d64df32c13-98.jpg", "descriptions": "Scooter must hurry to save his planet! Power supplies are running out and to save them he must win the coveted ?Super Ribbinite?. Compete to become the Frolf Champion across 20 different courses on 5 different worlds. You must defeat all your opponents to win the Frolf Cup and the SuperScooter must hurry to save his planet! Power supplies are running out and to save them he must win the coveted ?Super Ribbinite?. Compete to become the Frolf Champion across 20 different courses on 5 different worlds. You must defeat all your opponents to win the Frolf Cup and the Super Ribbinite. Planet Hippitron is counting on you! [Bandai]… Expand"}, {"name": "Highland Warriors", "details_link": "https://www.metacritic.com/game/pc/highland-warriors", "publisher": "Data Becker", "release_date": "Jan 20 2003", "developers": ["Soft Enterprises"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic", "Command"], "meta_score": 58, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/6b53e1d88ee8e2baf1cda75ba9a2c9e7-98.jpg", "descriptions": "In the year of our lord 843, the first king of Scotland, Kenneth McAlpin, united the lands of the Picts and Scots to form the Kingdom of Alba. 400 years later Edward I, also known as the \"Hammer of the Scots\" engulfed the land in a great feud. It was not long before Edward I controlled mostIn the year of our lord 843, the first king of Scotland, Kenneth McAlpin, united the lands of the Picts and Scots to form the Kingdom of Alba. 400 years later Edward I, also known as the \"Hammer of the Scots\" engulfed the land in a great feud. It was not long before Edward I controlled most of Scotland. The Scots, led by William Wallace and Robert the Bruce, are left to fight what seems to be a futile war for freedom. This is the time when legends are born...  [Data Becker]… Expand"}, {"name": "Fighter Maker 2", "details_link": "https://www.metacritic.com/game/playstation-2/fighter-maker-2", "publisher": "Agetec Inc.", "release_date": "Nov 12 2002", "developers": ["Enterbrain"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 58, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/1a0065a051c23e221ef93873cad1b169-98.jpg", "descriptions": "Build the world's greatest fighters from scratch using 3D models that respond to your every direction! The customization process includes costumes, body types, special moves, camera angles, and everything you need to create a personally designed cast of fighting characters that are ready toBuild the world's greatest fighters from scratch using 3D models that respond to your every direction! The customization process includes costumes, body types, special moves, camera angles, and everything you need to create a personally designed cast of fighting characters that are ready to take on all comers! Also included is an entire 3D fighting game with a host of opponents ready to take your fighters apart! Once you prove your characters have what it takes to beat the locals, you can try your luck against your friend's fighters to see who can build the greatest fighter of all time! [Agetec]… Expand"}, {"name": "The Terminator: Dawn of Fate", "details_link": "https://www.metacritic.com/game/playstation-2/the-terminator-dawn-of-fate", "publisher": "Atari", "release_date": "Sep 16 2002", "developers": ["Paradigm Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 58, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/e5614f1cfb99ddfa2ba1f7beb5e7f7ce-98.jpg", "descriptions": "The year is 2027. The machines of Skynet have risen, reaping a bloody harvest of human flesh across the globe. You are a soldier of Tech Com, a ragged team of human resistance fighters intent upon stopping the overwhelming onslaught of cybernetic assassins in post-apocalyptic Los Angeles.The year is 2027. The machines of Skynet have risen, reaping a bloody harvest of human flesh across the globe. You are a soldier of Tech Com, a ragged team of human resistance fighters intent upon stopping the overwhelming onslaught of cybernetic assassins in post-apocalyptic Los Angeles. Your ultimate goal is to reach a time travel device in time to send Kyle Reese back to 1984, with the hope of preventing a relentless Terminator model T-800 from murdering Sarah Connor, mother of resistance leader John Connor. If you fail in your mission, the resistance will crumble, and no one will survive the rise of the machines. The fate of humanity lies in your hands. [Infogrames]… Expand"}, {"name": "Street Hoops", "details_link": "https://www.metacritic.com/game/xbox/street-hoops", "publisher": "Activision", "release_date": "Aug 12 2002", "developers": ["Black Ops Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 58, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/d4843ade0736a4723c5f501963bbac52-98.jpg", "descriptions": "Street Hoops brings the aggressive energy and stylish attitude of street basketball into your living room. Set up your own team, and then compete in nationwide street court tournaments. As your team runs through the ranks, you unlock players such as AO, Main Event, 1/2 Man 1/2 Amazing,Street Hoops brings the aggressive energy and stylish attitude of street basketball into your living room. Set up your own team, and then compete in nationwide street court tournaments. As your team runs through the ranks, you unlock players such as AO, Main Event, 1/2 Man 1/2 Amazing, Headache, and Hot Sauce from the most recent And 1 Mix Tapes; plus Speedy Williams, Booger Smith, and The Future from the Nike freestyle commercial. You can spend your hard-earned winnings on new shoes, warm-ups, tattoos, jewelry, and other gear.… Expand"}, {"name": "Star Wars: Obi-Wan", "details_link": "https://www.metacritic.com/game/xbox/star-wars-obi-wan", "publisher": "LucasArts", "release_date": "Dec 19 2001", "developers": ["LucasArts"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 58, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/166ab9675a69ff982e35c6e5d566cb17-98.jpg", "descriptions": "Draw upon all of your Jedi training, Force powers and lightsaber skills to defeat the worst scum and villiany in the galaxy.\rIn the weeks prior to the Trade Federation invasion of Naboo, Obi-Wan discovers an underworld trail which leads from crime lords in the lowest depths of Coruscant toDraw upon all of your Jedi training, Force powers and lightsaber skills to defeat the worst scum and villiany in the galaxy.\rIn the weeks prior to the Trade Federation invasion of Naboo, Obi-Wan discovers an underworld trail which leads from crime lords in the lowest depths of Coruscant to the homeworld of a mysterious new enemy - the Jin'ha.… Expand"}, {"name": "Dragon Ball Z: Ultimate Tenkaichi", "details_link": "https://www.metacritic.com/game/playstation-3/dragon-ball-z-ultimate-tenkaichi", "publisher": "Namco Bandai Games", "release_date": "Oct 25 2011", "developers": ["Spike"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 58, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/30707fb7f3a3c2ca752abc58ed863329-98.jpg", "descriptions": "The upcoming Dragon Ball Game Project is currently in development by Spike Co. Ltd., who are honing their considerable talents to create a new landmark game for the Dragon Ball Z franchise.  The game features upgraded environmental and character graphics, with designs drawn from the originalThe upcoming Dragon Ball Game Project is currently in development by Spike Co. Ltd., who are honing their considerable talents to create a new landmark game for the Dragon Ball Z franchise.  The game features upgraded environmental and character graphics, with designs drawn from the original manga series.  Destructible battle fields, including massive craters and ki energy blasts cutting across the sky deliver a more dynamic experience and immediate sense of urgency to the exhilarating fights.  An enhanced story mode drops players into the rich Dragon Ball Z universe, filled with beloved characters and powerful enemies. An accessible battle system allows gamers of all ages will be able to hold their own in fast-paced battles, while still retaining tactical depth for hardcore fans. … Expand"}, {"name": "Mega Man Star Force: Leo", "details_link": "https://www.metacritic.com/game/ds/mega-man-star-force-leo", "publisher": "Capcom", "release_date": "Aug  7 2007", "developers": ["Capcom"], "platforms": "DS", "num_players": "6  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 58, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/183254dd41b18027f95841158621fabb-98.jpg", "descriptions": "Mega Man Star Force introduces a new lead character, a boy named Subaru Hoshikawa, whose astronaut father has disappeared after a mysterious incident at the satellite station. Fond memories of spending time with his father have inspired Subaru's interests in the stars and what lies beyond.Mega Man Star Force introduces a new lead character, a boy named Subaru Hoshikawa, whose astronaut father has disappeared after a mysterious incident at the satellite station. Fond memories of spending time with his father have inspired Subaru's interests in the stars and what lies beyond. One day, Subaru heads to the observation deck and puts on a pair of \"visualizer\" glasses that had belonged to his father. These allow the wearer to see all the electric connections that exist between spaces. When he puts on these special goggles, a specific wave is triggered, summoning the presence of a mysterious alien life form named Warlock who had escaped from the planet FM. Dangerous creatures from that planet have come to attack Earth, so they must join together in order to defeat these menacing forces. Combining with Warlock enables Subaru to transform into Mega Man and enter the Wave Road. Features 2wo coexisting worlds – players can navigate the real world as Subaru and transform into Mega Man to travel across Wave Road. Three stellar versions call upon the power of the elements to offer distinct advantages: Pegasus – based on the water element, Ice Pegasus can instantly freeze an opponent with its special Ice Slash; Leo – turning up the heat, Fire Leo uses a special Flame Burner attack that can incinerate enemies in its path; Dragon – the ferocious Green Dragon draws upon the power of wood with a Wood Shot move that fires a cluster of razor sharp leaves to slash enemies to bits.… Expand"}, {"name": "Bladestorm: Nightmare", "details_link": "https://www.metacritic.com/game/playstation-4/bladestorm-nightmare", "publisher": "Koei Tecmo Games", "release_date": "Mar 17 2015", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 3", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 58, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/fddc751e2967fc29c390d4d64aaa97b9-98.jpg", "descriptions": "In Bladestorm: Nightmare the player is called to create a mercenary and accept missions which will advance the English or the French cause in the course of the Hundred Years War. The successful completion of these missions relies on a variety of elements which put the player’s fightingIn Bladestorm: Nightmare the player is called to create a mercenary and accept missions which will advance the English or the French cause in the course of the Hundred Years War. The successful completion of these missions relies on a variety of elements which put the player’s fighting abilities, strategy, tactical and leadership skills to the test. The Mercenary does not ride to the field alone, but as the commander of an army unit selected to fit each individual situation as some missions are better fought with foot soldiers, others with lances, archers, light cavalry, or a combination of melee, ranged and mounted units.… Expand"}, {"name": "The Lord of the Rings: Aragorn's Quest", "details_link": "https://www.metacritic.com/game/playstation-3/the-lord-of-the-rings-aragorns-quest", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 14 2010", "developers": ["TT Fusion"], "platforms": ["PlayStation 2", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 58, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/3926b8d51751bec996f4c3ea5ab97012-98.jpg", "descriptions": "In The Lord of the Rings: Aragorn's Quest, players assume the role of Aragorn to take on his greatest quests from The Lord of the Rings trilogy. Wielding a sword, shield, bow and spear, fans will battle enemies, lead armies and journey through a colorful and fresh rendition of Middle-earth.In The Lord of the Rings: Aragorn's Quest, players assume the role of Aragorn to take on his greatest quests from The Lord of the Rings trilogy. Wielding a sword, shield, bow and spear, fans will battle enemies, lead armies and journey through a colorful and fresh rendition of Middle-earth. Players can even switch between spear and sword on horseback; taking down evil foes in an action-packed gameplay experience. Two-player co-op gameplay featuring Gandalf allows kids, families and friends to work together in the heart of the action.… Expand"}, {"name": "Black Legend", "details_link": "https://www.metacritic.com/game/playstation-4/black-legend", "publisher": "Warcave", "release_date": "Mar 25 2021", "developers": ["Warcave"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/6629ab0f3d6c99bfc18b30686cfe142e-98.jpg", "descriptions": "Lead a band of Mercenaries into a city covered by a mysterious deadly fog. Face a cult that has formed around the creator of this fog.\rPiece together stories from the few survivors, items and locations to discover the truth behind the situation, and stop the spread."}, {"name": "Venture Kid", "details_link": "https://www.metacritic.com/game/switch/venture-kid", "publisher": "FDG Entertainment", "release_date": "May  2 2019", "developers": ["FDG Entertainment", "Snikkabo AS"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 58, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/87f63ba6bd294c20e54ca437db319cdf-98.jpg", "descriptions": "Venture Kid is a lovingly crafted 8-bit retro action platformer that goes beyond just pixels and chiptunes. It shines with excellent level design, highly entertaining action levels, responsive controls and a great variety of bosses."}, {"name": "Toy Stunt Bike", "details_link": "https://www.metacritic.com/game/3ds/toy-stunt-bike", "publisher": "Wobbly Tooth Ltd", "release_date": "Jun 26 2014", "developers": ["Wobbly Tooth Ltd"], "platforms": ["iPhone/iPad", "3DS"], "genres": ["Driving", "Racing", "General", "Arcade", "Automobile"], "meta_score": 58, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/0e5ec5c699a4e02c42c74d675a920b3a-98.jpg", "descriptions": "The #1 Best Selling XBox Live Indie game comes to iPhone and iPod Touch! Top five bestselling and Top Rated for over a year!Running at a stunning 60 frames per second on an iPhone 3GS, this is an addictive 3D micro-sized motorbike game with realtime physics on the bike and rider!PerformThe #1 Best Selling XBox Live Indie game comes to iPhone and iPod Touch! Top five bestselling and Top Rated for over a year!Running at a stunning 60 frames per second on an iPhone 3GS, this is an addictive 3D micro-sized motorbike game with realtime physics on the bike and rider!Perform massive stunts, race competitively and collect flags to unlock your way through ten highly crafted levels set in a variety of household environments!Compete against other racers track times with Game Center fully integrated leaderboards!Note: This game is designed to run on iPhone 3GS and above and for iPod Touch 3rd Gen and above.“Toy Stunt Bike has a little something for everyone!”… Expand"}, {"name": "Conflict: Denied Ops", "details_link": "https://www.metacritic.com/game/pc/conflict-denied-ops", "publisher": "Eidos Interactive", "release_date": "Feb  8 2008", "developers": ["Pivotal Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 58, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/89ab3cc13118770e4c9363600a447d07-98.jpg", "descriptions": "When the US government needs to act, but can not afford to be associated with the operation, deniable operatives are dispatched. Members of the unit must bear no identity; no objects, papers or clothing that could associate them with the government. Their task is to do anything necessary, noWhen the US government needs to act, but can not afford to be associated with the operation, deniable operatives are dispatched. Members of the unit must bear no identity; no objects, papers or clothing that could associate them with the government. Their task is to do anything necessary, no matter how ruthless, to dissolve the threat. Conflict: Denied Ops puts players in control of two of these merciless operatives, each of them highly specialized in both weapons and military tactics. With gameplay focused on accessible two-man tactics, utilize simple commands and switch seamlessly between team mates to lay down covering fire, explore diverging paths, create distractions and pin the enemy under fire. Making full use of Pivotal's Puncture Technology, Conflict: Denied Ops features a highly destructible environment, allowing players to utilize tactics such as shooting through walls to create sniping holes or blasting open new paths to take the enemy by surprise. Fighting for a good cause, does not mean they have to play by the rules. Brutalize the opposition, blast down buildings, and destroy everything in true Hollywood fashion – all throughout politically sensitive areas across South America, Africa and Russia. [Eidos Interactive]… Expand"}, {"name": "SimAnimals", "details_link": "https://www.metacritic.com/game/wii/simanimals", "publisher": "Electronic Arts", "release_date": "Jan 21 2009", "developers": ["Electronic Arts"], "platforms": "Wii", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 58, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/3/a8d9f091b9762041ae0c6c9f9c25cbcc-98.jpg", "descriptions": "Now, for the first time players can engage with the wild world of animals in their natural surroundings in an immersive and tactile way. In this game you are challenged to engage, touch, move and try to control a wide range of animals as you journey deeper and deeper into the forest. YouNow, for the first time players can engage with the wild world of animals in their natural surroundings in an immersive and tactile way. In this game you are challenged to engage, touch, move and try to control a wide range of animals as you journey deeper and deeper into the forest. You control an on-screen animated hand that allows you to reach out and touch, pick up and move everything in the game from foxes and bears to trees and flowers. Cohabitate with these animals in their natural surroundings, and based on how you treat them, the animals will come to know and love – or dislike you. Have fun developing relationships with wild animals and their families, and experience the humor and drama of surviving in the wilderness. Wild animals abound. You will meet a host of friendly wild animals including deer, squirrels, rabbits, hedgehogs and owls. And also some mischievous characters like foxes, raccoons, badgers, crows and bears who love to stir up trouble. Get in the middle of the action as they all come together in your very own forest setting for a wild time. Solve challenges and achieve goals throughout the game, because the animals need you to help them thrive. Discover secrets, unlock forest areas and uncover one-of-a-kind objects and wild animals, some with special abilities, by successfully completing tasks. It's survival of the fittest, as you find out who the troublemakers are and who the good guys are to make sure everyone gets along – or not! In SimAnimals on the Wii, take up to three of your friends with you on a forest adventure in cooperative play mode! The forest, filled with exciting wildlife, is big enough for you and your pals. [Electronic Arts]… Expand"}, {"name": "Samurai Shodown V", "details_link": "https://www.metacritic.com/game/xbox/samurai-shodown-v", "publisher": "SNK", "release_date": "Jan 18 2006", "developers": ["SNK"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox"], "num_players": "2  Online", "genres": ["Action", "Fighting", "2D"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/dbe1896411d4e2e4ebade2cce49c060d-98.jpg", "descriptions": "Samurai Shodown V is a port of the classic NeoGeo arcade fighting game of the same name. In this fifth installment, you can play as one of dozens of animated Japanese characters to discover combos and special moves. The port adds online support to the usual Arcade and Versus modes, so youSamurai Shodown V is a port of the classic NeoGeo arcade fighting game of the same name. In this fifth installment, you can play as one of dozens of animated Japanese characters to discover combos and special moves. The port adds online support to the usual Arcade and Versus modes, so you can challenge other gamers or create an online tournament.  … Expand"}, {"name": "Lost in Blue 2", "details_link": "https://www.metacritic.com/game/ds/lost-in-blue-2", "publisher": "Konami", "release_date": "Mar 20 2007", "developers": ["Matrix Software"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "Modern", "Third-Person", "Modern"], "meta_score": 58, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/0/3e97cccc91e22c27f4813798835a99e3-98.jpg", "descriptions": "Washed ashore after their cruise ship goes down at sea, young Jack and Amy must struggle to survive as they search for a way off a deserted island. The teens confront their worst fears as they discover the secrets and dangers that lurk behind every corner of the mysterious island. PlayWashed ashore after their cruise ship goes down at sea, young Jack and Amy must struggle to survive as they search for a way off a deserted island. The teens confront their worst fears as they discover the secrets and dangers that lurk behind every corner of the mysterious island. Play through the entire game as either Jack or Amy, each with their own set of survival skills and unique endings. Keep an eye on your thirst, hunger and stamina levels as you explore the island, from sandy beaches to lush jungles. Battle wild animals and overcome extreme weather conditions such as tsunami and earthquakes as you try to survive on a harsh and unforgiving desert island. Use the touch screen and microphone to take part in new mini-games such as diving, archery and carpentry as well as returning favorites such as cooking and tool crafting. Compete in survival mini-games with a friend via local wireless connection. [Konami]… Expand"}, {"name": "Tom Clancy's Splinter Cell Essentials", "details_link": "https://www.metacritic.com/game/psp/tom-clancys-splinter-cell-essentials", "publisher": "Ubisoft", "release_date": "Mar 21 2006", "developers": ["Ubisoft"], "platforms": "PSP", "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 58, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/6f2f8f003393cafaaadb2315d4fdbec6-98.jpg", "descriptions": "After learning about the death of his daughter, Sam Fisher is nowhere to be found. When Homeland Security agents finally locate Fisher in New Orleans, their worst fears are realized. Surveillance photos show Fisher in the company of Emile Dufraisne, a known domestic terrorist. Third EchelonAfter learning about the death of his daughter, Sam Fisher is nowhere to be found. When Homeland Security agents finally locate Fisher in New Orleans, their worst fears are realized. Surveillance photos show Fisher in the company of Emile Dufraisne, a known domestic terrorist. Third Echelon wants answers: why did their best agent throw away decades of service to forces with terrorists? As Sam defends himself, he will tell a story no one suspected. Tom Clancy’s Splinter Cell Essentials starts where Tom Clancy’s Splinter Cell Double Agent ends, and takes players to the years before Tom Clancy’s Splinter Cell when Sam was still a Navy Seal. Full immersion in Tom Clancy’s Splinter Cell universe: Takes players deep into the saga of Sam Fisher – with missions from Tom Clancy’s Splinter Cell, Tom Clancy’s Splinter Cell Pandora Tomorrow, Tom Clancy’s Splinter Cell Chaos Theory. and Tom Clancy’s Splinter Cell Double Agent. Discover the entire Splinter Cell series through flashbacks and brand new missions. A game of gadgets for your gadget: Features all the weapons and gadgets from the Tom Clancy’s Splinter Cell franchise, in addition to some new ones exclusive to the PSP system version. Accessible Wi-Fi multiplayer: Challenge your friends in Spy vs. Spy Deathmatch multiplayer mode. [Ubisoft]… Expand"}, {"name": "Lost Empire: Immortals", "details_link": "https://www.metacritic.com/game/pc/lost-empire-immortals", "publisher": "Paradox Interactive", "release_date": "Mar 11 2008", "developers": ["Pollux Gamelabs"], "platforms": "PC", "num_players": "10  Online", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "4X"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/e30d0d166acfd82d76e1527d725d8f11-98.jpg", "descriptions": "Long ago the immortal Aeons presented the fledging races with the technology to travel the stars.  Without pause for reasoning, vast fleets colonised the cosmos expanding the interstellar community until a great cataclysm occurred. Now the Aeon’s, a technologically superior race that onceLong ago the immortal Aeons presented the fledging races with the technology to travel the stars.  Without pause for reasoning, vast fleets colonised the cosmos expanding the interstellar community until a great cataclysm occurred. Now the Aeon’s, a technologically superior race that once guided the lesser races, is all but lost to myth.  Their colonies and technology lie beyond reach - scattered throughout the galaxy, like so many stars. Only fading memories recall the cause of the Aeons downfall and the loss of the star-gates that ended the first Galactic War.  Devoid of the means to navigate the stars, the empires of the six major races began to look inwards as communication between worlds was lost. From the depths of the abyss, the long forgotten desire for exploration and conquest calls out once again.   For it would only be a matter of time before each race would: recover the knowledge to rebuild their fleets, reawaken their desire to explore, rekindle their need to expand and return to warring ways. As the six galactic empires make ready for the arduous struggle ahead, all manner of citizens are rallied to the cause.  Scouting expeditions leave the safety of their stellar berths seeking out potential systems ripe for colonisation.  Close behind terra-forming ships prepare planets for swelling populations.  Throughout countless shipyards powerful battle-fleets are forged from newly acquired resources, ready to face the threats that emerge with every cycle of the sun. A new age has arrived. The Age of Immortals has descended upon the fledging empires of the known galaxy. Will you dominate or be destroyed? [Paradox Interactive]… Expand"}, {"name": "ReCore", "details_link": "https://www.metacritic.com/game/pc/recore", "publisher": "Microsoft Game Studios", "release_date": "Sep 13 2016", "developers": ["comcept"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 58, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/276f05ad90a87673e7c7b2dc849b8aff-98.jpg", "descriptions": "Assume the role of Joule Adams, a young survivor of a terrible cataclysm who journeys from Earth to the desert world, “Far Eden” to build mankind’s new home. But when Joule wakes after centuries in cryo-sleep, nothing has gone according to plan… With her “Corebot” companion, Mack, JouleAssume the role of Joule Adams, a young survivor of a terrible cataclysm who journeys from Earth to the desert world, “Far Eden” to build mankind’s new home. But when Joule wakes after centuries in cryo-sleep, nothing has gone according to plan… With her “Corebot” companion, Mack, Joule begins an adventure to unlock secrets from the past, defeat powerful foes, and bring new life and hope to Far Eden. The Far Eden colony was meant to be a paradise, where humans and Corebots could build a future together. Now, however, most of the Corebots have gone rogue, and the planet is plagued by violent sandstorms. In some areas these storms come and go, altering the terrain and revealing new areas to explore and new challenges to overcome. Defeat your enemies—including massive boss creatures—with creative tactics, split-second timing, and by unleashing your Corebots’ unique abilities. Craft components to customize your Corebots to create your perfect battle party, and then share your creations with other gamers online. [Armature]… Expand"}, {"name": "Tom Clancy's Ghost Recon 2", "details_link": "https://www.metacritic.com/game/playstation-2/tom-clancys-ghost-recon-2", "publisher": "Ubisoft", "release_date": "Nov 30 2004", "developers": ["Ubisoft Shanghai/Paris"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 58, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/f3b38dbba66e9253b0fe86c1aeb91565-98.jpg", "descriptions": "In the wake of one of North Korea's worst famines, an insidious North Korean general influences the government to secretly divert humanitarian aid to beef up its army, slowly gaining power in the process. Fearful that North Korea is amassing huge quantities of military weapons, the newIn the wake of one of North Korea's worst famines, an insidious North Korean general influences the government to secretly divert humanitarian aid to beef up its army, slowly gaining power in the process. Fearful that North Korea is amassing huge quantities of military weapons, the new Chinese regime eliminates arms sales to North Korea. In response, the North Korean government initiates secret overtures to Russia, who strikes a quiet alliance. In the midst of another North Korean famine, food riots begin rocking the countryside, and the rogue North Korean general assumes complete control of the army. Blaming China for the famine, he begins charging north to seize Chinese territory with tacit support from its new Russian ally. China moves to respond, but limits the level of escalation, fearing open conflict with Russia and a possible nuclear exchange. Instead, China officially agrees to a multinational force to safeguard the China-North Korean border. Unofficially, the Ghosts and other special forces go in. Their mission: cripple the North Korean threat and depose the rogue general. (*Note:  Ghost Recon 2 for PS2 occurs four years before ? and acts as a prequel to ? the Xbox version. The game is built on the Unreal engine - as opposed to the proprietary Ghost Recon engine - and will also use Havok physics, a rarity in PS2 games.) [Ubisoft]… Expand"}, {"name": "Desert Child", "details_link": "https://www.metacritic.com/game/playstation-4/desert-child", "publisher": "Akupara Games", "release_date": "Dec 11 2018", "developers": ["Oscar Brittain"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 58, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/a677a388858a99dd7509b75973019e6b-98.jpg", "descriptions": "Assume the role of a young hoverbike racer who needs to figure out how to scrape enough cash together through racing and odd jobs to punch your one-way ticket to the Red Planet to enter the biggest race in the universe, the Grand Prix."}, {"name": "Goat Simulator", "details_link": "https://www.metacritic.com/game/playstation-4/goat-simulator", "publisher": "Coffee Stain Studios", "release_date": "Aug 11 2015", "developers": ["Coffee Stain Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 58, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/8/38b0c607ca9e5aad1dfad242c9698109-98.jpg", "descriptions": "Goat Simulator is the latest in goat simulation technology, bringing next-gen goat simulation to YOU. You no longer have to fantasize about being a goat, your dreams have finally come true."}, {"name": "Disney/Pixar Cars 2", "details_link": "https://www.metacritic.com/game/ds/disneypixar-cars-2", "publisher": "Disney Interactive Studios", "release_date": "Jun 21 2011", "developers": ["Firebrand Games"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360", "DS"], "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/14c6ba4ca7c3eb6d47ec11d8c2659468-98.jpg", "descriptions": "Inspired by the upcoming DisneyPixar animated film, Cars 2: The Video Game lets players jump into the Cars 2 universe with some of their favorite Cars personalities in exotic locations around the globe."}, {"name": "Maelstrom: The Battle For Earth Begins", "details_link": "https://www.metacritic.com/game/pc/maelstrom-the-battle-for-earth-begins", "publisher": "Codemasters", "release_date": "Feb 20 2007", "developers": ["KDV Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 58, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/5b967a7e9db68dfdc9bdee0ef201f054-98.jpg", "descriptions": "Maelstrom takes place on the devastated future Earth of 2040 where an alien invasion has triggered an apocalyptic ecological disaster. In this savaged world water has become the most valuable of resources and divided the remaining humans into two factions. Now, they must wage war against theMaelstrom takes place on the devastated future Earth of 2040 where an alien invasion has triggered an apocalyptic ecological disaster. In this savaged world water has become the most valuable of resources and divided the remaining humans into two factions. Now, they must wage war against the invaders and each other in a desperate struggle for supremacy and survival. Advancing the innovative gameplay mechanics of Perimeter into a contemporary sci-fi game with action packed tactical gameplay and outstanding features, including upgradeable transforming units. Depending on which of the three factions you choose to fight for, it's all-out destructive war as you battle for control of the entire planet against fearless aliens, an army of high-tech super soldiers and a rag tag crew of human survivors. [Codemasters]… Expand"}, {"name": "Scarface: Money. Power. Respect.", "details_link": "https://www.metacritic.com/game/psp/scarface-money-power-respect", "publisher": "Sierra Entertainment", "release_date": "Oct  8 2006", "developers": ["Radical Entertainment", "Farsight Studios"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Strategy", "Action Adventure", "Turn-Based", "General", "Modern", "Management", "Modern", "Business / Tycoon"], "meta_score": 58, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/7/128e24e08b9a39d6f7a011963293108c-98.jpg", "descriptions": "Scarface: Money. Power. Respect is a unique game designed specifically for the PSP system that combines turn-based strategy gameplay with real-time combat. It allow gamers to relive Tony Montana's epic rise to power in the drug-fueled world of 1983 Miami. The game thrusts players into a deepScarface: Money. Power. Respect is a unique game designed specifically for the PSP system that combines turn-based strategy gameplay with real-time combat. It allow gamers to relive Tony Montana's epic rise to power in the drug-fueled world of 1983 Miami. The game thrusts players into a deep and engaging strategy game as Tony Montana, where the goal is to battle and defeat competing drug cartels and conquer Miami turf-by-turf, eventually becoming the one-and-only Kingpin of the city. Featuring both single- and multi-player modes, Scarface: Money. Power. Respect. will challenge players to make critical strategic decisions to rise from humble beginnings to directing an army of henchmen and hired gunmen through detailed scenarios of conquest and domination. In the story-based single-player mode, gamers complete a series of missions based on scenes from the original movie to conquer \"turfs\" in Miami. Players need to direct large-scale citywide strategic commands to complete their conquest as well as direct street-level real-time combat. The game challenges gamers to handle larger territory, additional adversaries and new profit-making opportunities through increased drug trafficking. The wireless multi-player mode pits up-to-four gamers playing as criminal cartels in a race to make money and conquer turf. The multi-player battle begins with a \"Land Grab,\" where each cartel lays claim to their share of Miami.… Expand"}, {"name": "Delta Force: Black Hawk Down", "details_link": "https://www.metacritic.com/game/playstation-2/delta-force-black-hawk-down", "publisher": "NovaLogic", "release_date": "Jul 26 2005", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 2"], "num_players": "32  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 58, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/c71e6a7a9cd2929ef9522fb87c8ac2cb-98.jpg", "descriptions": "Set in Somalia in 1993, Delta Force – Black Hawk Down is based upon and around the Operation Restore Hope and Task Force Ranger campaigns and follows members of the elite Delta Force and US Army Rangers as they participate in a number of daring raids against the oppressive Somali warlords inSet in Somalia in 1993, Delta Force – Black Hawk Down is based upon and around the Operation Restore Hope and Task Force Ranger campaigns and follows members of the elite Delta Force and US Army Rangers as they participate in a number of daring raids against the oppressive Somali warlords in and around Mogadishu. Using the original PC version as a basis, British based developer Rebellion is redesigning the game specifically for the PS2. As well as a redesigned single player mode, Delta Force - Black Hawk Down will also have several brand new multiplayer features, including 32 player games online. NovaLogic has also teamed up with the Special Operations Warrior Foundation. A portion of the proceeds from the PS2 version of Black Hawk Down will be donated to the foundation. The SOWF provides college scholarship grants, along with financial aid and educational counseling to the children of Special Operations personnel who were killed in an operational mission or training accident. [NovaLogic]… Expand"}, {"name": "Sword Art Online: Alicization Lycoris", "details_link": "https://www.metacritic.com/game/xbox-one/sword-art-online-alicization-lycoris", "publisher": "Bandai Namco Games", "release_date": "Jul 10 2020", "developers": ["Bandai Namco Games", "Aquria"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 58, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/ae28e6755bff95f75813c9c1a0634175-98.jpg", "descriptions": "For the first time ever, players can experience SWORD ART ONLINE's anime storyline in game format with SWORD ART ONLINE Alicization Lycoris! Play as the protagonist Kirito and immerse yourself in \"Underworld,\" a mysterious virtual world set in the anime's Alicization arc. Featuring intenseFor the first time ever, players can experience SWORD ART ONLINE's anime storyline in game format with SWORD ART ONLINE Alicization Lycoris! Play as the protagonist Kirito and immerse yourself in \"Underworld,\" a mysterious virtual world set in the anime's Alicization arc. Featuring intense battle action, stunning JRPG visuals, and an expansive world to explore; your journey through the latest VRMMO SWORD ART ONLINE game is ready to begin!… Expand"}, {"name": "Transformers: Revenge of the Fallen", "details_link": "https://www.metacritic.com/game/pc/transformers-revenge-of-the-fallen", "publisher": "Activision", "release_date": "Jun 23 2009", "developers": ["Beenox"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Adventure", "Shooter", "Beat-'Em-Up", "Sci-Fi", "Sci-Fi", "Third-Person", "3D", "Arcade"], "meta_score": 58, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/403251b2fd3a08fd957349679dfefd9a-98.jpg", "descriptions": "Transformers: Revenge of the Fallen thrusts players into a battle for supremacy across the globe as either AUTOBOTS or DECEPTICONS to drive, fly, fight and blast their way through intense, pressure-packed levels. Delivering more control, players can select from a diverse range of playableTransformers: Revenge of the Fallen thrusts players into a battle for supremacy across the globe as either AUTOBOTS or DECEPTICONS to drive, fly, fight and blast their way through intense, pressure-packed levels. Delivering more control, players can select from a diverse range of playable TRANSFORMERS - each with distinct personalities, abilities and weaponry - and jump straight into action as they instantly switch between robot, vehicle and weapon modes to fight for the preservation or annihilation of all mankind. For the first time in the TRANSFORMERS universe, players can also fight the epic war between the AUTOBOTS and DECEPTICONS online in explosive, multiplayer combat. Players can take on the role of their favorite AUTOBOTS and DECEPTICONS such as Optimus Prime, Starscream, Bumblebee and Ironhide, along with new characters making their first appearance in a game.  With two distinct campaigns that allow players to save or destroy the human race, players can unlock and play missions in any order and with different characters for a whole new experience. Instantaneously convert from a colossal robot to a dynamic land or air vehicle such as a diesel truck, sports car, military chopper or fighter jet.  New, ultra-fluid transformations can be performed in-motion anytime and anywhere, allowing players to strategically propel through and decimate hordes of enemies with incredible agility. [Activision]… Expand"}, {"name": "Marvel Nemesis: Rise of the Imperfects", "details_link": "https://www.metacritic.com/game/psp/marvel-nemesis-rise-of-the-imperfects", "publisher": "EA Games", "release_date": "Oct  4 2005", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PSP"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 58, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/b79c3b97f0257a19a121001a18c0e629-98.jpg", "descriptions": "Marvel Nemesis delivers the definitive Super Hero videogame allowing gamers to play as and against the world's greatest Super Heroes. The game features Super Heroes from the Marvel Universe as well as a new set of characters created through collaboration with EA and top comic book industryMarvel Nemesis delivers the definitive Super Hero videogame allowing gamers to play as and against the world's greatest Super Heroes. The game features Super Heroes from the Marvel Universe as well as a new set of characters created through collaboration with EA and top comic book industry talent. EA has called on the talent of top comic book writers and concept artists, such as Jae Lee, for Marvel character and game design as well as renowned artist, Paul Catling, among other industry talents, to create a new family of Super Heroes that will go face to face with an all-star line-up of Marvel characters for the ultimate showdown. Marvel Nemesis: Rise of the Imperfects features more than a dozen fighters in fully interactive and destructible environments. Gamers have full control over the individual characters with each fighter having unique attributes and super powers that are true to their background adding more depth and fighting strategy to the game. [Electronic Arts]… Expand"}, {"name": "Marvel Heroes", "details_link": "https://www.metacritic.com/game/pc/marvel-heroes", "publisher": "Gazillion", "release_date": "Jun  3 2013", "developers": ["Gazillion"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 58, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/56468f24b6df6dd9efb2efc23eb75fb8-98.jpg", "descriptions": "Marvel Heroes is a free-to-play online game from Gazillion Entertainment."}, {"name": "Prime World: Defenders", "details_link": "https://www.metacritic.com/game/pc/prime-world-defenders", "publisher": "Nival Interactive", "release_date": "Jun  5 2013", "developers": ["Nival Interactive"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "General", "Defense"], "meta_score": 58, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/7d29c619cd12c2cd256b9d87cc293c21-98.jpg", "descriptions": "Prime World: Defenders merges classic tower defense gameplay with collectible card mechanic."}, {"name": "Disney Wizards of Waverly Place", "details_link": "https://www.metacritic.com/game/ds/disney-wizards-of-waverly-place", "publisher": "Disney Interactive Studios", "release_date": "Aug 25 2009", "developers": ["Disney Interactive Studios", "Black Lantern Studios"], "platforms": "DS", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 58, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/78221c0a16845b56e3c1715fb5db89a1-98.jpg", "descriptions": "Wizards of Waverly Place for Nintendo DS is the only game that allows fans to experience the magical mishaps of Alex Russo, with the help of her brothers, Max and Justin. Players can experience five unique and exciting episodes while learning how to cast new magic spells ensuing in hours ofWizards of Waverly Place for Nintendo DS is the only game that allows fans to experience the magical mishaps of Alex Russo, with the help of her brothers, Max and Justin. Players can experience five unique and exciting episodes while learning how to cast new magic spells ensuing in hours of hilarious and mischievous fun! Fans visit recognizable locations from the show, and hang out with familiar friends from the hit Disney Channel TV series. [Disney Interactive]… Expand"}, {"name": "Shaun Palmer's Pro Snowboarder", "details_link": "https://www.metacritic.com/game/game-boy-advance/shaun-palmers-pro-snowboarder", "publisher": "Activision", "release_date": "Nov 27 2001", "developers": ["Natsume"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/85e7d13b5b2fa9da4ef4ee6610f7906d-98.jpg", "descriptions": "It's Tony Hawk's Pro Skater 2 on snow--albeit with a few caveats."}, {"name": "Heavy Metal: Geomatrix", "details_link": "https://www.metacritic.com/game/dreamcast/heavy-metal-geomatrix", "publisher": "Capcom", "release_date": "Sep 13 2001", "developers": ["Capcom"], "platforms": "Dreamcast", "genres": ["Action", "General"], "meta_score": 58, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/431f5b121e13ab0a6e93cb41e15b4350-98.jpg", "descriptions": "In the future, with the evolution of Nanobot technology, microscopic robots recreate human cell composition in the cyber world. Fantasy and reality have merged into one neo-world. Humans abandon the real world for the cyber luxury of the virtual world. Now, the polar caps are disloged andIn the future, with the evolution of Nanobot technology, microscopic robots recreate human cell composition in the cyber world. Fantasy and reality have merged into one neo-world. Humans abandon the real world for the cyber luxury of the virtual world. Now, the polar caps are disloged and melting, submerging mother earth underwater. What little turf remains is claimed by thugs, gangs, and mercenaries. The battle for landmass begins. Only now, war is waged inside the Geomatrix with Nanobots armed with devastating weaponry. To win you must fight, to live you must win!… Expand"}, {"name": "Pitfall: The Mayan Adventure", "details_link": "https://www.metacritic.com/game/game-boy-advance/pitfall-the-mayan-adventure", "publisher": "Majesco Games", "release_date": "Jun 10 2001", "developers": ["Pipe Dream Interactive"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 58, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/823c6b0fc5eed91836c4ef2444103d10-98.jpg", "descriptions": "Harry, Jr.\rI've been taken captive by the spirit of an evil Mayan warrior. Need help right away!\rContinue journey as planned - through the rain forests and mines, past the waterfalls and ruins. But be careful...the Mayan empire is filled with deadly traps and enemies. Think fast and moveHarry, Jr.\rI've been taken captive by the spirit of an evil Mayan warrior. Need help right away!\rContinue journey as planned - through the rain forests and mines, past the waterfalls and ruins. But be careful...the Mayan empire is filled with deadly traps and enemies. Think fast and move even faster.\rHurry! Time is running out...\rPitfall Harry… Expand"}, {"name": "WWE 2K Battlegrounds", "details_link": "https://www.metacritic.com/game/xbox-one/wwe-2k-battlegrounds", "publisher": "2K Games", "release_date": "Sep 18 2020", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 58, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/6c4d09b54004f07940efe58a7774fe57-98.jpg", "descriptions": "The world of WWE is your battleground with all-new, over the top, in-your-face arcade action as your favorite WWE Superstars and Legends battle it out in outlandish interactive environments around the world. Compete with your friends in your favorite match types with an arsenal ofThe world of WWE is your battleground with all-new, over the top, in-your-face arcade action as your favorite WWE Superstars and Legends battle it out in outlandish interactive environments around the world. Compete with your friends in your favorite match types with an arsenal of exaggerated maneuvers, special abilities, and devastating power-ups, including Steel Cage, Royal Rumble, Fatal Four Way and more, as Mauro Ranallo and Jerry \"The King\" Lawler call all the mayhem! Are you ready to enter the battleground?… Expand"}, {"name": "Star Wars: Republic Commando", "details_link": "https://www.metacritic.com/game/playstation-4/star-wars-republic-commando", "publisher": "Aspyr", "release_date": "Apr  6 2021", "developers": ["Aspyr"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 58, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/b5f88d68f28cf4e06ffd16027f2078ee-98.jpg", "descriptions": "You can be part of an elite squad of soldiers in Star Wars Republic Commando. Play as one of a team of republic troops in the time between Star Wars episodes II and III. Your squad will be assigned a variety of missions ranging from hostage rescue to assassination on many recognizable worldsYou can be part of an elite squad of soldiers in Star Wars Republic Commando. Play as one of a team of republic troops in the time between Star Wars episodes II and III. Your squad will be assigned a variety of missions ranging from hostage rescue to assassination on many recognizable worlds from the Star Wars universe. You can play multiplayer game modes such as capture the flag and deathmatch online.… Expand"}, {"name": "Cel Damage HD", "details_link": "https://www.metacritic.com/game/playstation-4/cel-damage-hd", "publisher": "Finish Line Games", "release_date": "Apr 22 2014", "developers": ["Finish Line Games"], "platforms": ["PlayStation 3", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Driving", "Racing", "Vehicle", "Kart", "Combat"], "meta_score": 58, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/107f56547414f0f5677b204be4b11363-98.jpg", "descriptions": "PART DEMOLITION DERBY, PART WHACKED-OUT CARTOON COME TO LIFE.\r36 wild, over-the-top weapons\r10 tough 'toons\rDeathmatch, capture-the-flag and gate racing action\r4-person split-screen multiplayer\r12 interactive cartoon worlds"}, {"name": "Game of Thrones", "details_link": "https://www.metacritic.com/game/pc/game-of-thrones", "publisher": "Atlus", "release_date": "May 15 2012", "developers": ["Cyanide", "Cyanide Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Western-Style"], "meta_score": 58, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/96efaf5355fb1bcb3c156bb7fa06babd-98.jpg", "descriptions": "Based on George R.R. Martin's best-selling 'A Song of Ice and Fire' series, Cyanide has developed games for the PC and next-gen consoles."}, {"name": "Adventures to Go!", "details_link": "https://www.metacritic.com/game/psp/adventures-to-go!", "publisher": "Natsume", "release_date": "Oct 27 2009", "developers": ["Global A"], "platforms": "PSP", "genres": ["Role-Playing", "General", "General"], "meta_score": 58, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/a42f70e266ddc445a8d2569e133ecf18-98.jpg", "descriptions": "In this hilarious and innovative strategy RPG, players take control of Finn Courtland and his band of misfits in their quest for fame and riches. Along the way, they just might have to save the world from the evil Arbitus and his demons. Each dungeon is randomly generated according to theIn this hilarious and innovative strategy RPG, players take control of Finn Courtland and his band of misfits in their quest for fame and riches. Along the way, they just might have to save the world from the evil Arbitus and his demons. Each dungeon is randomly generated according to the player's specifications, so the game offers endless replayability and a guarantee of new surprises every time you pick it up. Grid-based battles challenge players to think strategically. Control a diverse team of characters with unique spells and abilities. A huge variety of spells, weapons, and monsters. [Natsume]… Expand"}, {"name": "Diplomacy", "details_link": "https://www.metacritic.com/game/pc/diplomacy", "publisher": "Paradox Interactive", "release_date": "Oct  4 2005", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "Up to 6 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Board / Card Game", "Historic", "General", "Historic"], "meta_score": 58, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/7/7a409647992dad38cbb97fafe3713b2f-98.jpg", "descriptions": "Put your strategy and negotiation skills to the test in the interactive version of the classic board game Diplomacy. Set in early 20th century Europe, this PC adaptation brings the power struggles of seven mighty nations to life like never before. Its abstracted and simple gameplay puts thePut your strategy and negotiation skills to the test in the interactive version of the classic board game Diplomacy. Set in early 20th century Europe, this PC adaptation brings the power struggles of seven mighty nations to life like never before. Its abstracted and simple gameplay puts the focus on the need for shrewd negotiations and overall strategy. No longer will a friend be needed to enjoy the world of Diplomacy. With life-like opponents, gamers can take on the 20th century's mightiest nations at any time on their PCs. An enhanced graphical language will be the negotiating tool between the player and his human and AI opponents making the options almost endless for the player. Avatars representing your opponents will express feelings depending on your actions and play style. More than just a name, Diplomacy allows the player to negotiate anything that is logically negotiable. Form alliances or break them on a whim - the player decides whom to trust how to convince others to trust him. [Paradox]… Expand"}, {"name": "Tenchu: Fatal Shadows", "details_link": "https://www.metacritic.com/game/playstation-2/tenchu-fatal-shadows", "publisher": "Sega", "release_date": "Feb 15 2005", "developers": ["K2 LLC"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 58, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/1018378c8edba5074afec7099a0ede65-98.jpg", "descriptions": "(Also known as \"Tenchu Kurenai\" or \"Tenchu Crimson\")  Set in historical Japan, Tenchu: Fatal Shadows features two playable ninja warriors - returning heroine Ayame and newcomer Rin. This installment of the fan-favorite franchise offers a tight balance of melee combat and shadow stalking, and(Also known as \"Tenchu Kurenai\" or \"Tenchu Crimson\")  Set in historical Japan, Tenchu: Fatal Shadows features two playable ninja warriors - returning heroine Ayame and newcomer Rin. This installment of the fan-favorite franchise offers a tight balance of melee combat and shadow stalking, and its levels are structured to avoid the frustrating trial-and-error patterns that are all too familiar in the stealth genre. The title is fast paced, tense, and balanced for both stealth veterans and novices, offering multiple difficulty modes. Significant visual upgrades have been made from prior installments, and a slew of new move sets are on hand to deliver more realistic ninja experience, including the ability to hide bodies and breathe underwater while sneaking. [Sega]… Expand"}, {"name": "Ninja Gaiden 3", "details_link": "https://www.metacritic.com/game/playstation-3/ninja-gaiden-3", "publisher": "Tecmo Koei America Corp.", "release_date": "Mar 20 2012", "developers": ["Team Ninja"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "Platformer", "General", "Platformer", "3D", "3D"], "meta_score": 58, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/b574838184f5c857a81114a07181fb89-98.jpg", "descriptions": "Ninja Gaiden 3 aims to take players on a journey with their hero Hayabusa once more, but this time they’ll see more from their protagonist than they ever imagined. For the first time, we’ll get a look at the world through Hayabusa’s eyes, and find out what drives him to fight, and kill. AtNinja Gaiden 3 aims to take players on a journey with their hero Hayabusa once more, but this time they’ll see more from their protagonist than they ever imagined. For the first time, we’ll get a look at the world through Hayabusa’s eyes, and find out what drives him to fight, and kill. At the center of the conflict this time around is a masked man whose motivations and goals are unclear. Through mysterious powers, he changes Hayabusa – and the lines between hero and villain, good and evil, are blurred forever. Featuring a new story, new gameplay and new modes, Ninja Gaiden 3 marks a new direction in this fan-favorite franchise. Team NINJA will change the way fans think about ninja and Ryu Hayabusa himself. Players will learn what it feels like to “cut someone down” through their experiences in the game. The game will also feature online multiplayer, both co-op and competitive, that will add a completely new experience to Ninja Gaiden. The shadowy world of ninja has never been presented this way, and Ninja Gaiden will never be the same! Pick up the Dragon Sword once more, sharpen its blade and hone your skills. An adventure unlike any other awaits you. [Microsoft]… Expand"}, {"name": "Fate/Extra", "details_link": "https://www.metacritic.com/game/psp/fateextra", "publisher": "Aksys Games", "release_date": "Nov  1 2011", "developers": ["Image Epoch", "Imageepoch"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 58, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/b178b79141acf5cc541d8632e3fa894e-98.jpg", "descriptions": "Fate/Extra is a game where players wake up in a strange virtual world with no recollection of the past as you try to figure out who you are."}, {"name": "Wanted: Dead", "details_link": "https://www.metacritic.com/game/pc/wanted-dead", "publisher": "110 Industries", "release_date": "Feb 14 2023", "developers": ["110 Industries", "Soleil Ltd."], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 58, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/92c8e678786e3e471b6eeaebad1c67e1-98.jpg", "descriptions": "Wanted: Dead is a new hybrid slasher/shooter from the makers of Ninja Gaiden and Dead or Alive. The game follows a week in life of the Zombie Unit, an elite Hong Kong police squad on a mission to uncover a major corporate conspiracy. Play as Lt. Hannah Stone, a hardboiled Hong Kong cop, andWanted: Dead is a new hybrid slasher/shooter from the makers of Ninja Gaiden and Dead or Alive. The game follows a week in life of the Zombie Unit, an elite Hong Kong police squad on a mission to uncover a major corporate conspiracy. Play as Lt. Hannah Stone, a hardboiled Hong Kong cop, and plow through mercenaries, gang members and private military contractors in a spectacular cyberpunk adventure.… Expand"}, {"name": "Constantine", "details_link": "https://www.metacritic.com/game/playstation-2/constantine", "publisher": "THQ", "release_date": "Feb 14 2005", "developers": ["Bits Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 58, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/a45bfb7f8b0509f72ce7be7d2b6b3369-98.jpg", "descriptions": "Based on the DC Comics/Vertigo \"Hellblazer\" graphic novels and the Warner Bros. film, the supernatural thriller Constantine tells the story of John Constantine, a man who has literally been to hell and back. When he teams up with sceptical policewoman Angela Dodson to solve the mysteriousBased on the DC Comics/Vertigo \"Hellblazer\" graphic novels and the Warner Bros. film, the supernatural thriller Constantine tells the story of John Constantine, a man who has literally been to hell and back. When he teams up with sceptical policewoman Angela Dodson to solve the mysterious suicide of her twin sister, their investigation takes them through the world of demons and angels that exists just beneath the landscape of contemporary Los Angeles. Caught in a catastrophic series of otherworldly events, the two become inextricably involved and seek to find their own peace at whatever cost. [Warner Bros.]… Expand"}, {"name": "Sword of the Necromancer", "details_link": "https://www.metacritic.com/game/switch/sword-of-the-necromancer", "publisher": "Grimorio of Games", "release_date": "Jan 28 2021", "developers": ["Grimorio of Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "2 ", "genres": ["Role-Playing", "Roguelike"], "meta_score": 58, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/dcc0e48c3603c4345dc9d8ec02bac96f-98.jpg", "descriptions": "Help Tama to save Koko using the powers of the forbidden Sword of the Necromancer. Turn your foes into allies and reach the depths of the Necromancer's dungeon. Defeat the guardians to gain enough soul power to bring Koko back from the dead, no matter the cost."}, {"name": "Dark Rose Valkyrie", "details_link": "https://www.metacritic.com/game/playstation-4/dark-rose-valkyrie", "publisher": "Idea Factory", "release_date": "Jun  6 2017", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 58, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/dbde1e8072e6ebcf36e71b703131635d-98.jpg", "descriptions": "1929 - It was the year of the outbreak. In masses, normal people were transforming into inhuman creatures called Chimeras. The cause: a mysterious virus brought to earth by a meteorite, known as the Black Garnet, which crashed there long ago.\r The Chimera Virus in its beginning stages1929 - It was the year of the outbreak. In masses, normal people were transforming into inhuman creatures called Chimeras. The cause: a mysterious virus brought to earth by a meteorite, known as the Black Garnet, which crashed there long ago.\r The Chimera Virus in its beginning stages would wipe out 3% of the world's entire population. In a state of national emergency, Japan became a closed nation in an attempt to stave off the pandemic. A covert military agency known as ACID was established to combat the remaining Chimeras in country.\r Time passes. ACID establishes a special unit known as Special Force Valkyrie in order to eradicate the Chimera that threaten humanity to this day.… Expand"}, {"name": "The Dwarves", "details_link": "https://www.metacritic.com/game/xbox-one/the-dwarves", "publisher": "Nordic Games Publishing", "release_date": "Dec  1 2016", "developers": ["Nordic Games Publishing"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Role-Playing", "General"], "meta_score": 58, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/5/03d9ba956f5c683c471f83684127efae-98.jpg", "descriptions": "The Dwarves is a fantasy role-playing game with a strong story and tactically challenging real-time battles. 15 playable heroes, each with individual skills, are to be deployed cleverly. Take on superior numbers of orcs, ogres, älfs, bögnilim, zombies, dark mages, and many more foes, to giveThe Dwarves is a fantasy role-playing game with a strong story and tactically challenging real-time battles. 15 playable heroes, each with individual skills, are to be deployed cleverly. Take on superior numbers of orcs, ogres, älfs, bögnilim, zombies, dark mages, and many more foes, to give them the low-down.… Expand"}, {"name": "Flyhunter Origins", "details_link": "https://www.metacritic.com/game/playstation-vita/flyhunter-origins", "publisher": "Ripstone", "release_date": "Dec  9 2014", "developers": ["Steel Wool Games", "Inc.", "Steel Wool Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita"], "genres": ["Action", "Platformer", "2D"], "meta_score": 58, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/0d382a234269396c2407ea7a6d017c33-98.jpg", "descriptions": "Take on the role of Zak; a bumbling alien spaceship janitor and wannabe Flyhunter. He works on board the Flyhunter Crew’s legendary spaceship; ‘The Frog’, but deep down he longs for an exciting adventure of his own…"}, {"name": "Bladestorm: The Hundred Years' War", "details_link": "https://www.metacritic.com/game/playstation-3/bladestorm-the-hundred-years-war", "publisher": "Koei", "release_date": "Nov  6 2007", "developers": ["Omega Force"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 58, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/56fcf815217799582a1da8a339505ff6-98.jpg", "descriptions": "Bladestorm heralds a break from the tradition of basing games on Japanese and Chinese history by being set within the Hundred Years' War. This famous European conflict between the English and French provides the setting in which hundreds upon hundreds of soldiers clash on the battlefield. IfBladestorm heralds a break from the tradition of basing games on Japanese and Chinese history by being set within the Hundred Years' War. This famous European conflict between the English and French provides the setting in which hundreds upon hundreds of soldiers clash on the battlefield. If you thought the massively populated battles in the Dynasty Warriors games were huge, think again. [KOEI]… Expand"}, {"name": "1-2-Switch", "details_link": "https://www.metacritic.com/game/switch/1-2-switch", "publisher": "Nintendo", "release_date": "Mar  3 2017", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 58, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/52eb7671d9c994fddc913a2634638b5e-98.jpg", "descriptions": "Throw an impromptu party anywhere with anyone thanks to a new play style in which players look at each other—not the screen. Bring the action and fun into the real world as you face off in wild-west duels, cow-milking competitions, a copycat dance-off, and more. Each game takes advantage ofThrow an impromptu party anywhere with anyone thanks to a new play style in which players look at each other—not the screen. Bring the action and fun into the real world as you face off in wild-west duels, cow-milking competitions, a copycat dance-off, and more. Each game takes advantage of the Joy-Con controller features of the Nintendo Switch system in different ways. While the action unfolds off- screen, the audience watches the players themselves instead of the screen. [Nintendo]… Expand"}, {"name": "Peaky Blinders: Mastermind", "details_link": "https://www.metacritic.com/game/pc/peaky-blinders-mastermind", "publisher": "Curve Digital Games", "release_date": "Aug 20 2020", "developers": ["FuturLab"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Puzzle", "Action", "General"], "meta_score": 58, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/65e964dfcf62388a1e4a4f714599ffa9-98.jpg", "descriptions": "Welcome to Birmingham, during the aftermath of the Great War. Set right before the events of Season One, Peaky Blinders: Mastermind lets you join the Shelby family's criminal gang. Follow the rise of Tommy as he successfully uncovers a sinister plot to put the family out of business, provingWelcome to Birmingham, during the aftermath of the Great War. Set right before the events of Season One, Peaky Blinders: Mastermind lets you join the Shelby family's criminal gang. Follow the rise of Tommy as he successfully uncovers a sinister plot to put the family out of business, proving himself worthy of being the true mastermind of the Peaky Blinders.\r Mastermind refers to Tommy's ability to plan complex scenarios in his head. As the player, you get to exercise this power by taking control of key members of the Shelby family including Tommy, Arthur, Polly and more. Become the Mastermind as you freely reset and rewind each character's path in order to tune all of their actions for perfect coordination.\r Achieve the highest mission rating by strategically utilising characters and stealth to solve increasingly complex puzzles with optimum timing.… Expand"}, {"name": "The Lord of the Rings: Aragorn's Quest", "details_link": "https://www.metacritic.com/game/wii/the-lord-of-the-rings-aragorns-quest", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 14 2010", "developers": ["Headstrong Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 58, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/400228e6b94e5dcbbc4cd134d3b633a3-98.jpg", "descriptions": "In The Lord of the Rings: Aragorn's Quest, preparations are underway in Hobbiton for a great party to welcome Aragorn, King of Gondor, and honor Samwise Gamgee for his service during the War of the Ring. The children of the town are eager to learn more of this great man and so Samwise, nowIn The Lord of the Rings: Aragorn's Quest, preparations are underway in Hobbiton for a great party to welcome Aragorn, King of Gondor, and honor Samwise Gamgee for his service during the War of the Ring. The children of the town are eager to learn more of this great man and so Samwise, now Mayor, embarks on a tale of the revered warrior, Strider - as Aragorn is known in his Ranger days - and his most valiant battles. Players assume the role of Aragorn and embark on his greatest quests from The Lord of the Rings trilogy as they wield his sword, bow or spear on foot and on horseback through an action-packed gameplay experience. On the Wii platform, two-player co-op gameplay featuring Gandalf will allow kids, families and friends to work together in the heart of the action. [Warner Bros. Interactive Entertainment]… Expand"}, {"name": "Starsky & Hutch", "details_link": "https://www.metacritic.com/game/xbox/starsky-hutch", "publisher": "Gotham Games", "release_date": "Sep  9 2003", "developers": ["Supersonic Software"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 58, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/a90b3eb56ba120f41d25b4bbb6c14280-98.jpg", "descriptions": "Based on the 70's television show, Starsky & Hutch lets you race through Bay City in Starsky's bright red Ford Torino, while Hutch takes aim at criminals with his .357 Magnum--but don't go thinking this will be a joy ride.  If your driving and shooting skills can't keep the TV audience onBased on the 70's television show, Starsky & Hutch lets you race through Bay City in Starsky's bright red Ford Torino, while Hutch takes aim at criminals with his .357 Magnum--but don't go thinking this will be a joy ride.  If your driving and shooting skills can't keep the TV audience on the edge of their sofas, your ratings will plummet, the show will be cancelled, and it's \"game over.\"  Don't think you can handle all the high-speed thrills by yourself?  Find a partner and let them shoot while you drive.… Expand"}, {"name": "Zapper: One Wicked Cricket!", "details_link": "https://www.metacritic.com/game/game-boy-advance/zapper-one-wicked-cricket!", "publisher": "Infogrames", "release_date": "Nov  5 2002", "developers": ["Atomic Planet Entertainment", "Blitz Games"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "genres": ["Action", "Platformer", "2D"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/49b5d32a9bdc7a6ad7bacf773b6f0585-98.jpg", "descriptions": "In Zapper, you play a small creature that embarks on a great quest. Zapper is a cricket in search of brother Zipper, who was kidnapped by the evil Maggie the Magpie. Through 18 twisted levels, you'll evade bizarre enemies and deadly hazards using your electrified antennae and springyIn Zapper, you play a small creature that embarks on a great quest. Zapper is a cricket in search of brother Zipper, who was kidnapped by the evil Maggie the Magpie. Through 18 twisted levels, you'll evade bizarre enemies and deadly hazards using your electrified antennae and springy reflexes. Zap your foes, explore your surroundings, and find and destroy eggs before they hatch. Zapper's intense action continues as you unlock hidden areas, bonus levels, and play multiplayer games.… Expand"}, {"name": "Gore: Ultimate Soldier", "details_link": "https://www.metacritic.com/game/pc/gore-ultimate-soldier", "publisher": "DreamCatcher Interactive", "release_date": "Jun  5 2002", "developers": ["4D Rulers"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 58, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/d008eec56ec382777ce27271100758b5-98.jpg", "descriptions": "\"Gore is an online multi-player game with an offline single-player component so you can play by yourself if you do not have an Internet connection or want to practice. We have implemented many new things which we feel will have a profound impact on deathmatch plus other new and popular\"Gore is an online multi-player game with an offline single-player component so you can play by yourself if you do not have an Internet connection or want to practice. We have implemented many new things which we feel will have a profound impact on deathmatch plus other new and popular gaming styles. The Gore Production Team - which is build up of hard-core gamers, not accountants - has striven to create a balance of realism, interactivity, technology and most importantly, fun.\" [DreamCatcher Interactive]… Expand"}, {"name": "Darkstone", "details_link": "https://www.metacritic.com/game/playstation/darkstone", "publisher": "Take-Two Interactive", "release_date": "Jan 28 2001", "developers": ["Delphine Software International"], "platforms": ["iPhone/iPad", "PC", "PlayStation"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 58, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/0602ce8bfb3586425b8dff48f9b40fc0-98.jpg", "descriptions": "Darkstone makes an excellent case for making a modest $10 investment."}, {"name": "Of Light and Darkness: The Prophecy", "details_link": "https://www.metacritic.com/game/pc/of-light-and-darkness-the-prophecy", "publisher": "Interplay", "release_date": "Mar 31 1998", "developers": ["Tribal Dreams"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/926cf1a9140ca44dd7afb56a81a33435-98.jpg", "descriptions": "A real-time surrealistic adventure in which the player must redeem the collective souls of a multitude of famous historical figures. More than 30 entities, ranging from Quechua, Mythic Godking of the high Andes (5000 B.C.) to the modern day mass murderer John Wayne Gacy (1994 A.D.), areA real-time surrealistic adventure in which the player must redeem the collective souls of a multitude of famous historical figures. More than 30 entities, ranging from Quechua, Mythic Godking of the high Andes (5000 B.C.) to the modern day mass murderer John Wayne Gacy (1994 A.D.), are present and accounted for in the race against the encroaching apocalypse. [AMG]… Expand"}, {"name": "GoldenEye: Rogue Agent", "details_link": "https://www.metacritic.com/game/ds/goldeneye-rogue-agent", "publisher": "EA Games", "release_date": "Jun 13 2005", "developers": ["EA Tiburon", "n-Space"], "platforms": ["PlayStation 2", "DS"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 58, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/d5906ae2f3459f3e3bcb556485d8cdb0-98.jpg", "descriptions": "As an aspiring 00 agent dismissed from MI6 for reckless brutality, the player is recruited by Auric Goldfinger in a ruthless war against Dr. No for control of the Bond underworld. Players wreak havoc as they make their unrelenting rise through the ranks of villainy. On globe-spanningAs an aspiring 00 agent dismissed from MI6 for reckless brutality, the player is recruited by Auric Goldfinger in a ruthless war against Dr. No for control of the Bond underworld. Players wreak havoc as they make their unrelenting rise through the ranks of villainy. On globe-spanning missions of vengeance and demolition, players encounter such legendary Bond characters as Oddjob, Dr. No, Goldfinger, Scaramanga, and Xenia Onatopp. Gamers outwit villainous rivals and battle it out in the intense wireless multiplayer mayhem with up to seven other players using only one cartridge, a unique feature for the Nintendo DS. The game also features a robust single-player campaign divided into six missions. Players can exploit multiple weapon combinations through the dual-wield gunplay system, or go head-to-head, melee-style, by taking enemies hostage or knocking them out with one punch. The dual-screen display provides a gameplay window on the top screen and the heads-up-display (HUD) on the touch screen. The HUD provides vital intelligence to players and allows for them to check ammunition levels, hack electronic devices and weapons, decode security locks, and more. In the all-new for DS ‘Virtual Training’ mode, players sharpen their lethal edge and gain experience by defeating infamous Bond villains in order to earn valuable upgrades for their GoldenEye weaponry. Left and right-handed gameplay controls, plus stylus and thumb-pad play, take full advantage of the platform’s unique touch-screen capabilities. [Electronic Arts]… Expand"}, {"name": "Vigilante 8: Arcade", "details_link": "https://www.metacritic.com/game/xbox-360/vigilante-8-arcade", "publisher": "Activision", "release_date": "Nov  5 2008", "developers": ["Isopod Labs"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 58, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/a8ef84f21527744c0ff4f0a0cdd8aa04-98.jpg", "descriptions": "[Xbox Live Arcade]  Take the wheel as fully-loaded auto combat revs into high gear with Vigilante 8: Arcade. It's a down and dirty war on wheels where everyone's riding shotgun. This brand new remake of the classic Vigilante 8 game lets you choose from among eight tricked-out retro-fine 70s[Xbox Live Arcade]  Take the wheel as fully-loaded auto combat revs into high gear with Vigilante 8: Arcade. It's a down and dirty war on wheels where everyone's riding shotgun. This brand new remake of the classic Vigilante 8 game lets you choose from among eight tricked-out retro-fine 70s vehicles with some serious firepower. Multiple special weapons let you wreak havoc on five newly-designed and destructible arenas. Complete the single player Quest story mode or test your car-crushing skills in local and Xbox LIVE multiplayer versus or co-op modes. Rebuilt from the ground up, V8: Arcade is modern vehicular warfare at its finest! [Activision]… Expand"}, {"name": "Werewolf: The Apocalypse - Earthblood", "details_link": "https://www.metacritic.com/game/xbox-series-x/werewolf-the-apocalypse---earthblood", "publisher": "Nacon", "release_date": "Feb  4 2021", "developers": ["Cyanide"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 58, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/1/1291599efd4cde57f64a4735a450a673-98.jpg", "descriptions": "You are Cahal, a powerful Garou who chose to go into exile after losing control of his destructive rage. He can transform into a wolf and a Crinos, a huge ferocious beast. Master your three forms and their powers to punish those who defile Gaia."}, {"name": "Overlord Minions", "details_link": "https://www.metacritic.com/game/ds/overlord-minions", "publisher": "Codemasters", "release_date": "Jun 23 2009", "developers": ["Climax Group", "Climax Studios"], "platforms": "DS", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 58, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/2/737a4ba247a5ce5c46b64c2b8e9c3911-98.jpg", "descriptions": "Meet Giblet, Blaze, Stench, and Zap - an elite Minion crew who, assisted by minion master Gnarl, get star billing in Overlord Minions, an irresistible and accessible puzzle action game, designed exclusively for Nintendo DS. In Overlord Minions, the Overlord commands the Minion team remotely.Meet Giblet, Blaze, Stench, and Zap - an elite Minion crew who, assisted by minion master Gnarl, get star billing in Overlord Minions, an irresistible and accessible puzzle action game, designed exclusively for Nintendo DS. In Overlord Minions, the Overlord commands the Minion team remotely. The Nintendo DS stylus becomes an extension of his evil will and every precise Touch Screen command is the player-as-Overlord directing, commanding and combining minions in battle, pointing and sweeping them to attack enemies and solving puzzles to execute his dastardly plans. Controlling the Special Farces team of four, players negotiate fiendish levels and take on a huge range of warped enemies to hunt down the Kindred, a cult dedicated to resurrecting the mighty Dragon Kin, a race of humanoid dragon hybrids, determined to replace the Overlord's despotism with their own. Extending the Overlord series' trademark humour, gameplay focuses on the mischievous physical comedy of the minion's antics and is delivered in a stylised cartoon visual style. [Codemasters]… Expand"}, {"name": "Rocky Balboa", "details_link": "https://www.metacritic.com/game/psp/rocky-balboa", "publisher": "Ubisoft", "release_date": "Mar 13 2007", "developers": ["Ubisoft"], "platforms": "PSP", "num_players": "2 ", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 58, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/8c08f35007567bbbaa3db4c475a9248c-98.jpg", "descriptions": "Rocky Balboa is the latest story in the saga of one of Hollywood's most beloved characters, Philadelphia boxer Rocky Balboa. Retired, and with his beloved Adrian passed away and his grown son too busy to spend time with him, Philadelphia's favorite boxer is a lonely man.  When an ESPN sportsRocky Balboa is the latest story in the saga of one of Hollywood's most beloved characters, Philadelphia boxer Rocky Balboa. Retired, and with his beloved Adrian passed away and his grown son too busy to spend time with him, Philadelphia's favorite boxer is a lonely man.  When an ESPN sports show runs a simulated fight between Balboa and the current champ, Mason \"The Line\" Dixon, Balboa wins, prompting a resurgence of interest in his illustrious career. Presented with the opportunity to wage one last exhibition fight, Rocky accepts the challenge, despite the protests of his friends and family. Facing a powerful young champion, personal tragedy and, ultimately, his own doubts, Rocky steps into the ring one last time to prove that he still has the heart of a champion. [Ubisoft/MGM]… Expand"}, {"name": "Asterix & Obelix: Slap Them All!", "details_link": "https://www.metacritic.com/game/xbox-one/asterix-obelix-slap-them-all!", "publisher": "Microids", "release_date": "Dec  2 2021", "developers": ["Mr.  Nutz Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Beat-'Em-Up", "2D", "3D"], "meta_score": 58, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/6/6097cdda27fc2ca62c33f32ecfb2eaaf-98.jpg", "descriptions": "Asterix & Obelix are back in a brand-new adventure full of slaps! Play as Asterix and Obelix and enjoy the most iconic landscapes of the saga while battling a hundreds of enemies in a Beat Them Up game filled with action… And lots of slaps!"}, {"name": "Touhou: Scarlet Curiosity", "details_link": "https://www.metacritic.com/game/playstation-4/touhou-scarlet-curiosity", "publisher": "XSEED Games", "release_date": "Sep 22 2016", "developers": ["Mediascape"], "platforms": ["PC", "PlayStation 4"], "genres": ["Role-Playing", "Action Adventure", "General", "Action RPG"], "meta_score": 58, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/93eb01c9cdc72ed4a7d71b2a036299e9-98.jpg", "descriptions": "The world of Touhou comes alive in this fan-made action RPG. As the infamous vampire Remilia Scarlet and her dutiful maid Sakuya Izayoi, match wits with a cast of colorful characters, overpower enemies with signature skills and spell cards, rough up a few fairies, and unravel a plot odderThe world of Touhou comes alive in this fan-made action RPG. As the infamous vampire Remilia Scarlet and her dutiful maid Sakuya Izayoi, match wits with a cast of colorful characters, overpower enemies with signature skills and spell cards, rough up a few fairies, and unravel a plot odder than they could have imagined.… Expand"}, {"name": "Scrap Garden", "details_link": "https://www.metacritic.com/game/pc/scrap-garden", "publisher": "Flazm", "release_date": "May  6 2016", "developers": ["Egidijus Bachur"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 58, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/ad0131722cfe33078503b630759ad8a8-98.jpg", "descriptions": "Scrap Garden is a puzzle platformer about the adventures of Canny, a lonely robot, who awakens in a post-apocalyptic world to find all other robots shut down and seized up. What happened to the City? Why did all robots stop moving? Did anyone survive except him?"}, {"name": "Monster Rancher EVO", "details_link": "https://www.metacritic.com/game/playstation-2/monster-rancher-evo", "publisher": "Tecmo", "release_date": "Apr 13 2006", "developers": ["Tecmo"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Strategy", "Breeding/Constructing"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/ebc0aa0b5a13e7f8eb25f04a7fd46732-98.jpg", "descriptions": "Monster Rancher EVO presents a true evolution of the series, adding deeper gameplay, strong role-playing elements and a captivating character-driven story to the popular monster breedin facet you've come to enjoy from the series. You'll balance monster breeding with role-playing explorationMonster Rancher EVO presents a true evolution of the series, adding deeper gameplay, strong role-playing elements and a captivating character-driven story to the popular monster breedin facet you've come to enjoy from the series. You'll balance monster breeding with role-playing exploration as you join in the adventures of Julio, a young circus performer with dreams of becoming a champion monster breeder. Traveling with Julie and the circus to seven different towns, you'll encounter new adventures and make new friends who can help you with training and breeding monsters. With a two-phase training system, three-on-three battles and the ability to raise multiple monsters at a time, you'll want to experience for yourself, this evolution in monster breeding...Monster Rancher EVO, the dawn of a new RPG. [Tecmo]… Expand"}, {"name": "The Settlers: New Allies", "details_link": "https://www.metacritic.com/game/pc/the-settlers-new-allies", "publisher": "Ubisoft", "release_date": "Feb 17 2023", "developers": ["Ubisoft Blue Byte"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Management", "Government"], "meta_score": 58, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/7/cfa88ecf78222d7405e56d77dde6c44c-98.jpg", "descriptions": "The Settlers combines a fresh take on the popular gameplay mechanics of the series with a new spin. It offers a deep infrastructure and economy gameplay, used to create and employ armies, to ultimately defeat opponents. 3 playable, distinctive factions – the Elari, the Maru and the Jorn –The Settlers combines a fresh take on the popular gameplay mechanics of the series with a new spin. It offers a deep infrastructure and economy gameplay, used to create and employ armies, to ultimately defeat opponents. 3 playable, distinctive factions – the Elari, the Maru and the Jorn – can be found in The Settlers. Each with a unique look and play style. At the heart of every match is gaining resources and building up your economy to recruit new settlers and a directly controllable, winning army. Research upgrades for your army and strengthen them by recruiting support and siege units. Various online multiplayer modes with up to 8 players offer thrilling skirmish battles against other players or AI for long-lasting fun. A story driven campaign will immerse the players into the world of The Settlers, while new players can learn the basic mechanics in a separate tutorial.… Expand"}, {"name": "The Caligula Effect", "details_link": "https://www.metacritic.com/game/playstation-vita/the-caligula-effect", "publisher": "Atlus", "release_date": "May  2 2017", "developers": ["Aquria"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 58, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/0cb7520c349b6d54ef60b609fc7ee28e-98.jpg", "descriptions": "Featuring a story written by Persona veteran Tadashi Satomi, The Caligula Effect takes you inside a digital prison filled with brainwashed high school students, evil musicians, and an all-powerful virtual idol."}, {"name": "Formula Fusion", "details_link": "https://www.metacritic.com/game/pc/formula-fusion", "publisher": "R8 Games", "release_date": "Jun  1 2017", "developers": ["R8 Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 58, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/5976d42fb271f0bfdeb611c86bb8a806-98.jpg", "descriptions": "Formula Fusion is an anti-gravity combat racing game set in the year 2075. Work your way through the SinglePlayer Campaign, unlocking craft, tracks and your inner rage. Develop your racing and combat skills to climb the Leaderboards. Race against the world on-line in the 10 playerFormula Fusion is an anti-gravity combat racing game set in the year 2075. Work your way through the SinglePlayer Campaign, unlocking craft, tracks and your inner rage. Develop your racing and combat skills to climb the Leaderboards. Race against the world on-line in the 10 player Multiplayer W.A.R (World Anti-gravity Racing) Formula Fusion’s garage gives unprecedented craft customization for performance, weapon loadouts and skins.… Expand"}, {"name": "Furry Legends", "details_link": "https://www.metacritic.com/game/wii/furry-legends", "publisher": "Gamelion Studios", "release_date": "Jul 19 2010", "developers": ["Gamelion Studios"], "platforms": "Wii", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 58, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/0a7751ab796ce5633760c6c74e207912-98.jpg", "descriptions": "[WiiWare]  The legend starts here. Furry Legends is a dynamic platform adventure with the most fur ever seen in games. Solve fun, physics-based puzzles in a fantastic 3D world called Furland. It's a humorous and weird place populated by funny creatures you've never seen before, including[WiiWare]  The legend starts here. Furry Legends is a dynamic platform adventure with the most fur ever seen in games. Solve fun, physics-based puzzles in a fantastic 3D world called Furland. It's a humorous and weird place populated by funny creatures you've never seen before, including five-eyed crabs, round cows, crazy rabbits and the lovely Furballs. Players control fluffy characters, each with a different set of special skills, such as the ability to manipulate time. Save the Furballs from their doom and keep Furland safe from Lord Squarie.… Expand"}, {"name": "Xiaolin Showdown", "details_link": "https://www.metacritic.com/game/ds/xiaolin-showdown", "publisher": "Konami", "release_date": "Nov 28 2006", "developers": ["Razorback Developments"], "platforms": ["PlayStation 2", "DS"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/d418fc0d4be3f23d1f54a22db39b5383-98.jpg", "descriptions": "Lead a kung fu monk and his three martial arts warriors on an action packed quest to search and protect the Shen Gong Wu. Omi, a Kung Fu monk leads three young dragons-in-training on their globetrotting adventures to search and protect the Shen Gong Wu, mystical power objects that gives itsLead a kung fu monk and his three martial arts warriors on an action packed quest to search and protect the Shen Gong Wu. Omi, a Kung Fu monk leads three young dragons-in-training on their globetrotting adventures to search and protect the Shen Gong Wu, mystical power objects that gives its possessor super powers, from a band of villains led by Evil Boy Genius Jack Spicer, his army of robots and an ancient witch Wuya. They fight for the Shen Gong Wu one showdown at a time, where the universe transforms itself into a mystical, hyper-reality world. Our heroes have to rely on their superb martial arts skills, wits, and the mystical powers of the Shen Gong Wu to fight evil. Based on the WB Kids animated series players control 4 warriors, working closely to together to combine their mystical powers, as they advance on their quest. Find and collect Shen Wong Gu while progressing thru an environment filled with hazards, enemies, and collectables. Compete in \"Showdowns\" that transport your warriors and test your martial arts skills. Battle epic bosses in winner-take all arena style combat. Six playable characters with mystical kung-fu powers. [Konami]… Expand"}, {"name": "Futurama", "details_link": "https://www.metacritic.com/game/xbox/futurama", "publisher": "Sierra Entertainment", "release_date": "Aug 14 2003", "developers": ["UDS"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 58, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/3039db53c2a7f94c8a460967abdb563f-98.jpg", "descriptions": "Futurama begins when Professor Farnsworth sells his delivery ship to Mom, an evil businesswoman, giving her ownership of more than 50 percent of Earth. Now, with Mom threatening to enslave humanity, it's up to you to travel back in time to stop the deal from taking place. You can play asFuturama begins when Professor Farnsworth sells his delivery ship to Mom, an evil businesswoman, giving her ownership of more than 50 percent of Earth. Now, with Mom threatening to enslave humanity, it's up to you to travel back in time to stop the deal from taking place. You can play as Fry, Bender, Leela, and Dr. Zoidberg, each with unique fighting skills and weapons. With each character, you must master their power-ups and complete their tasks to emerge victorious against Mom and her death bot troopers.… Expand"}, {"name": "Carnival Games VR", "details_link": "https://www.metacritic.com/game/playstation-4/carnival-games-vr", "publisher": "2K Games", "release_date": "Oct 28 2016", "developers": ["Cat Daddy Games"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Miscellaneous", "General", "Party / Minigame"], "meta_score": 58, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/1f5e38248c717643b04bb26103722d0a-98.jpg", "descriptions": "Carnival Games VR allows players to explore the park, interact with patrons and play up to 12 different games. Whether it’s scaling a castle in Climbing Wall or rolling for a high score in Alley Ball – everyone will find a favorite. In each of these games, players have the opportunity toCarnival Games VR allows players to explore the park, interact with patrons and play up to 12 different games. Whether it’s scaling a castle in Climbing Wall or rolling for a high score in Alley Ball – everyone will find a favorite. In each of these games, players have the opportunity to collect tickets for fun virtual prizes when they enter one of four different Carnival Alleys. All prizes are held in the Play Room where they can be used to unlock unique achievements. In addition, players will have the opportunity to challenge their friends and see if they can earn the top spot on the online leaderboard.… Expand"}, {"name": "Time Machine VR", "details_link": "https://www.metacritic.com/game/pc/time-machine-vr", "publisher": "Minority Media Inc.", "release_date": "May 19 2016", "developers": ["Minority Media Inc."], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 58, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/f88859c0d2f61fd24d25285225e591ad-98.jpg", "descriptions": "Assume the role of a time-traveling cadet tasked with exploring the Jurassic era and the ancient creatures that once ruled the prehistoric oceans. Things take a turn when melting ice caps in the present unleash an ancient deadly virus that lays waste to humanity... and the key to the cureAssume the role of a time-traveling cadet tasked with exploring the Jurassic era and the ancient creatures that once ruled the prehistoric oceans. Things take a turn when melting ice caps in the present unleash an ancient deadly virus that lays waste to humanity... and the key to the cure lies in the extraordinary creatures of prehistory. You will need your wits and cunning to survive the past and save the future. [Available for the Oculus Rift, HTC Vive, and SteamVR]… Expand"}, {"name": "Aegis Wing", "details_link": "https://www.metacritic.com/game/xbox-360/aegis-wing", "publisher": "Microsoft Game Studios", "release_date": "May 16 2007", "developers": ["Carbonated Games"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 58, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/80a1eac1acfb63621ca7534e54ff7f08-98.jpg", "descriptions": "[Xbox Live Arcade]  Aegis Wing is a side-scrolling space combat game reminiscent of classic eighties arcade hits. It features alien-busting action, slick graphics, an orchestral soundtrack, and devastating power-ups. Also included is a unique cooperative mode of play in which up to three[Xbox Live Arcade]  Aegis Wing is a side-scrolling space combat game reminiscent of classic eighties arcade hits. It features alien-busting action, slick graphics, an orchestral soundtrack, and devastating power-ups. Also included is a unique cooperative mode of play in which up to three additional players can \"attach\" to the leader's ship and become independent, 360-degree gun turrets. Get ready for an action-retro 2-D sci-fi side scrolling shooter, similar to \"Gradius\" or \"Defender.\" Up to four players can compete on the same console or on Xbox Live. Attach to each other, and super weapon powers grow as more players attach. After attaching, there's one pilot and each rider rotates fire via a 360-degree gun turret. Wield four super weapons, including the Hades Beam (kills everything in it’s path), the Gordon Burst (EMP pulse that kills all bullets and short circuits enemies), the Arcus Missile (heat-seeking missiles), and Lambda Shield (allows bullets to be deflected and used against the enemies). [Microsoft]… Expand"}, {"name": "BlowOut", "details_link": "https://www.metacritic.com/game/playstation-2/blowout", "publisher": "Majesco Games", "release_date": "Nov 10 2003", "developers": ["Terminal Reality"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 58, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/31ff7b3fdabe440bf1e2d143eadaf6a6-98.jpg", "descriptions": "As TransFed Marshall John \"Dutch\" Cane, you've been assigned to suppress a routine clone uprising on the massive battle platform, Honour Guard. Little do you know, the clones have been exposed to a Xeno genome virus, which has mutated them into aggressive, grotesque aliens. Their plan is toAs TransFed Marshall John \"Dutch\" Cane, you've been assigned to suppress a routine clone uprising on the massive battle platform, Honour Guard. Little do you know, the clones have been exposed to a Xeno genome virus, which has mutated them into aggressive, grotesque aliens. Their plan is to control the platform so they can spread the deadly virus to the TransFed colonies and the rest of the universe. Your orders are to take down the uprising at all costs, even if it means destroying the Honour Guard. Features ten levels of intense side scrolling action. Blast through walls, ceilings and floors to discover secrets and power-ups. Choose from a variety of weapons: 20mm Pump-Action Shotgun, 8-meter Flamethrower, Plasm Rifle, Machine Gun, 8\" NailGun and more. 360 degree range of firing motion. From Mutated beasts to alien insects, evade 14 different types of enemies. Collect \"Modifiers\" to power-up your weapons. Increase the level of efficiency, diversity, and damage or enhance your physical attributes: Health, Speeed, Bounce Shields, etc. [Majesco]… Expand"}, {"name": "TiQal", "details_link": "https://www.metacritic.com/game/xbox-360/tiqal", "publisher": "Microsoft Game Studios", "release_date": "Mar 26 2008", "developers": ["Slapdash Games"], "platforms": ["PC", "Xbox 360"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 58, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/8cf2b76879441dd1ed096fe265036786-98.jpg", "descriptions": "[Xbox Live Arcade]  In TiQal, you have been chosen to make an epic journey through many obstacles to seek the help of the gods. The village of TiQal is in deep trouble! Destroy the block walls in your way by moving your magic Dropper left and right, rotating blocks, and dropping them into[Xbox Live Arcade]  In TiQal, you have been chosen to make an epic journey through many obstacles to seek the help of the gods. The village of TiQal is in deep trouble! Destroy the block walls in your way by moving your magic Dropper left and right, rotating blocks, and dropping them into place to create squares of color. Build up multiple squares to score bonus points and unlock helpful power-ups. Do you have the skill and courage to complete your quest and save TiQal from certain destruction? The full game includes 120 action-packed levels for you to master. TiQal is addictive and easy to learn, yet presents challenging gameplay. Unlike other games in the genre, TiQal includes fourteen formidable power-ups to assist you in your block destruction. Multiplayer modes: Play with a friend in the co-op Adventure mode, or go online and challenge a buddy. [Slapdash Games]… Expand"}, {"name": "WitchSpring3 Re:Fine - The Story of Eirudy", "details_link": "https://www.metacritic.com/game/switch/witchspring3-refine---the-story-of-eirudy", "publisher": "ININ Games", "release_date": "Aug 13 2021", "developers": ["G Choice"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/b2fc13b606502b0e5344f5d54f337681-98.jpg", "descriptions": "Witchspring3 Re: Fine -the story of eirudy takes you deep into the misty forest, where the Witch eirudy lives secluded from the rest of the world, only accompanied by her Enchanted puppets. Whilst hiding in her house in the forest, from the warriors who are out to hunt her, she continues herWitchspring3 Re: Fine -the story of eirudy takes you deep into the misty forest, where the Witch eirudy lives secluded from the rest of the world, only accompanied by her Enchanted puppets. Whilst hiding in her house in the forest, from the warriors who are out to hunt her, she continues her efforts to escape her loneliness by trying to make her puppets talk. When One day she meets an adventurous young man named adrian in the forest, eirudy's life changes as she is thrown into the tide that determines the fate of deities and humans. The adventure begins and leads you down to an entwined path between light and darkness - which path will you choose? The enchanting adventure of eirudy offers an exciting and captivating storyline, which players won't want to put down. The turn-based battle system and the individual characters that develop over time make the game a really beautiful adventure. With Japanese voice actors, and text fully localized into English, the game is a stand-alone title in the Witch spring universe. It comes with new visuals and sound, very cute art style and loveable characters. And thanks to individual storyline choices, resulting in different endings and varied battle tactics, the game is worth playing through more than once. … Expand"}, {"name": "Cartoon Network: Punch Time Explosion", "details_link": "https://www.metacritic.com/game/3ds/cartoon-network-punch-time-explosion", "publisher": "Crave", "release_date": "Jun  2 2011", "developers": ["Papaya Studios", "Papaya Studio"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "3D"], "meta_score": 58, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/e1ee506de3bd8d47fc8c6b3886b0ec55-98.jpg", "descriptions": "This Cartoon Network Fighter is a crossover fighting game featuring the stars of Ben 10, Dexter's Laboratory, PowerPuff Girls, and more."}, {"name": "Wii Play", "details_link": "https://www.metacritic.com/game/wii/wii-play", "publisher": "Nintendo", "release_date": "Feb 12 2007", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 58, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/7c8578fe66871826597a63f71e7c625a-98.jpg", "descriptions": "In Wii Play, the star of the game is you. Create your own personal Mii character with the Wii console's built-in Mii Channel and then play as yourself in this compilation of nine simple, fun games like target shooting, table tennis and fishing. Wii Play comes bundled with a free Wii Remote,In Wii Play, the star of the game is you. Create your own personal Mii character with the Wii console's built-in Mii Channel and then play as yourself in this compilation of nine simple, fun games like target shooting, table tennis and fishing. Wii Play comes bundled with a free Wii Remote, so a friend can instantly join in the action in any of the included games. You can play at home or save your Mii on your Wii Remote and play with it on a friend's console, or use any of the six ready-made guest characters. Wii Play's nine different games are the perfect introduction to what the Wii Remote can do: Shooting Range - A modern version of the Nintendo classic Duck Hunt. Shoot the targets on the screen simply by aiming your Wii Remote. Find Mii - Can you spot a face in the crowd? Use your Wii Remote to point out the correct Mii characters as quickly as you can. Table Tennis - How long can you ping pong? Use your Wii Remote like a paddle to bat the ball and try to beat the computer or human opponent. Pose Mii - Twist the Wii Remote to rotate the Mii characters and quickly slot them into the correct positions as they fall down the screen. Laser Hockey - Tilt and turn the Wii Remote to bash the puck into the opponent's goal, in this high-speed arcade-style game. Billiards - In this version of Nine Ball, aim the Wii Remote at the screen to line up your shot, then pull back and push forward to strike the ball. Fishing - Move the Wii Remote like a rod: dip the hook in the water, wait for the fish to bite (the controller will rumble) and pull back hard to land it. Charge - Take the bull by the horns! Steer your wild steer by holding the Wii Remote sideways, as if gripping reins, and topple scarecrows to score points. Tanks - Take control of a tank with the Wii Remote; aim the cannon, bounce shells off walls, and blast your opponent to bits. [Nintendo Europe]… Expand"}, {"name": "Elex", "details_link": "https://www.metacritic.com/game/playstation-4/elex", "publisher": "Nordic Games Publishing", "release_date": "Oct 17 2017", "developers": ["Piranha Bytes"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 58, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/a42da31b4725947c698f2bda094eff2a-98.jpg", "descriptions": "Advanced in technology, civilized and with a population of billions, Magalan was a planet looking to the future. Then the meteor hit. Those who survived are now trapped in a battle to survive, a struggle to decide the fate of a planet. At the center of this fight is the element \"Elex\". AAdvanced in technology, civilized and with a population of billions, Magalan was a planet looking to the future. Then the meteor hit. Those who survived are now trapped in a battle to survive, a struggle to decide the fate of a planet. At the center of this fight is the element \"Elex\". A precious, limited resource that arrived with the meteor, Elex can power machines, open the door to magic, or re-sculpt life into new, different forms. But which of these choices should be the future of Magalan? Can technology, or magic save this world? Or will this new power destroy all those left alive amongst the ruins?  Elex is an action, role-playing open world game for PC and Consoles, developed by Piranha Bytes, creators of the award winning Gothic series and is set in a brand new, post-apocalyptic, Science-Fantasy universe where magic meets mechs.… Expand"}, {"name": "Omega Quintet", "details_link": "https://www.metacritic.com/game/playstation-4/omega-quintet", "publisher": "Idea Factory", "release_date": "Apr 28 2015", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Console-style RPG", "Role-Playing", "Japanese-Style"], "meta_score": 58, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/50ae2b0f94401f88e3ebffd2da900971-98.jpg", "descriptions": "In a world close to destruction, singing might be their only hope. Humanity's last hope rests in the music of the singing idols. Possessing weapons of sound, they have to fight evil and restore the world. The five girls must give the performance of a lifetime to stop this darkness fromIn a world close to destruction, singing might be their only hope. Humanity's last hope rests in the music of the singing idols. Possessing weapons of sound, they have to fight evil and restore the world. The five girls must give the performance of a lifetime to stop this darkness from destroying the last of humanity. Music plays an integral role in the game's battle system, providing stat boosts and more during battle, and, as the manager of the idols, players will be able to build relationships with each group member known as \"Verse Maidens\". … Expand"}, {"name": "Marvel Nemesis: Rise of the Imperfects", "details_link": "https://www.metacritic.com/game/xbox/marvel-nemesis-rise-of-the-imperfects", "publisher": "EA Games", "release_date": "Sep 20 2005", "developers": ["EA Canada", "Nihilistic"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 58, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/fb5173df9b0e90982c9ba90e8b29168c-98.jpg", "descriptions": "Marvel Nemesis: Rise of the Imperfects pits fierce Marvel superheroes against each other in a 3D fighting game. You can assume control of heroes such as the Punisher, Spider-Man, and Captain America, and duel with them in interactive and destructible environments. A new team of superheroesMarvel Nemesis: Rise of the Imperfects pits fierce Marvel superheroes against each other in a 3D fighting game. You can assume control of heroes such as the Punisher, Spider-Man, and Captain America, and duel with them in interactive and destructible environments. A new team of superheroes called the Imperfects joins the mayhem. You can play in single-player story mode to unlock hundreds of collectible awards, or you can play against other gamers in offline or online play.\r… Expand"}, {"name": "Mega Man X7", "details_link": "https://www.metacritic.com/game/playstation-2/mega-man-x7", "publisher": "Capcom", "release_date": "Oct 14 2003", "developers": ["Valuewave Co.,Ltd."], "platforms": "PlayStation 2", "genres": ["Action", "Platformer", "3D"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/79ec4831394c5ef59f97886f9d7da078-98.jpg", "descriptions": "Mega Man X and his courageous pal, Zero are back in a new 3-D action-adventure that propels the Mega Man series into the future. Follow our heroes as they battle monster machines and huge bosses in fully interactive, vast 3D worlds to combat the Red Alert Syndicate. Three different cameraMega Man X and his courageous pal, Zero are back in a new 3-D action-adventure that propels the Mega Man series into the future. Follow our heroes as they battle monster machines and huge bosses in fully interactive, vast 3D worlds to combat the Red Alert Syndicate. Three different camera views bring all the action to life. Take advantage of the new ?Double Hero System? hereyou and a friend canplay together simultaneously. Fight bosses cooperatively and execute the new change combo attack by switching characters at any time. Mega Man X7-the future isnow! [Capcom]… Expand"}, {"name": "Army of Two: The Devil's Cartel", "details_link": "https://www.metacritic.com/game/playstation-3/army-of-two-the-devils-cartel", "publisher": "Electronic Arts", "release_date": "Mar 26 2013", "developers": ["Visceral Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/3665f3c2e0fa7e85fcdb06fe76275035-98.jpg", "descriptions": "Players assume the roles of mercenaries battling a Mexican drug cartel in the town of La Puerta in Army of Two The Devil’s Cartel. This third-person co-op action-shooter utilizes the new Frostbite 2 engine for optimal destruction. You and your partner shoot and destroy anything andPlayers assume the roles of mercenaries battling a Mexican drug cartel in the town of La Puerta in Army of Two The Devil’s Cartel. This third-person co-op action-shooter utilizes the new Frostbite 2 engine for optimal destruction. You and your partner shoot and destroy anything and everything in your path to bring down a violent drug cartel that’s taken control of Mexico. In partner-based missions, each player has to take on and meet individual objectives to achieve a common goal. The more effective your teamwork, the greater your combined reward as the new Overkill mode thrusts devastating power upon you for truly grandiose mass destruction. Play as you will in 2-player local split-screen or online co-op.… Expand"}, {"name": "Romancing SaGa", "details_link": "https://www.metacritic.com/game/playstation-2/romancing-saga", "publisher": "Square Enix", "release_date": "Oct 11 2005", "developers": ["Square Enix"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 58, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/a1fe3030c761fc266a5368632a50fa59-98.jpg", "descriptions": "A thousand years ago, Saruin was imprisoned. Now the barriers that contain him are weakening, and his foreboding shadow threatens to swallow the world of Mardias once again. Who will rid the world of Saruin's scourge? A mysterious minstrel appears and guides the group to adventure, at timesA thousand years ago, Saruin was imprisoned. Now the barriers that contain him are weakening, and his foreboding shadow threatens to swallow the world of Mardias once again. Who will rid the world of Saruin's scourge? A mysterious minstrel appears and guides the group to adventure, at times shielding them from adversity. Occasionally, the minstrel forces grave choices upon them, which change their world and twist the plots they encounter. Romancing SaGa reclaims the renowned features of the series and boasts all new elements enhancing gameplay, bringing the player even deeper into the story. The free-roaming scenario system gives gamers a choice of eight intriguing playable characters, each with their own unique adventures and individual goals. Depending on the character and actions chosen, the plot and the subsequent events differentiate dramatically. This free-roaming scenario system promises the ultimate in open-ended adventure. [Square Enix]… Expand"}, {"name": "Vicious Circle", "details_link": "https://www.metacritic.com/game/pc/vicious-circle", "publisher": "Rooster Teeth Games", "release_date": "Aug 13 2019", "developers": ["Rooster Teeth Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 58, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/792db5dd9aae29a6d69ddea660215455-98.jpg", "descriptions": "Vicious Circle is an uncooperative multiplayer shooter in which mercenaries compete for loot against a terrifying monster. Dirty tricks are the key to victory, and only one player can come out on top."}]