[{"name": "Bejeweled 3", "details_link": "https://www.metacritic.com/game/pc/bejeweled-3", "publisher": "PopCap", "release_date": "Dec  7 2010", "developers": ["PopCap"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/64ed720e6506d87dc0f22c90551a77ae-98.jpg", "descriptions": "The biggest, brightest Bejeweled ever! Discover all-new ways to play the world's #1 puzzle game. Find your perfect match with 8 breathtaking game modes that meet all your moods — ease into Classic Bejeweled for cascades of fun, journey through 40 challenging Quest puzzles, charge into theThe biggest, brightest Bejeweled ever! Discover all-new ways to play the world's #1 puzzle game. Find your perfect match with 8 breathtaking game modes that meet all your moods — ease into Classic Bejeweled for cascades of fun, journey through 40 challenging Quest puzzles, charge into the electrifying Lightning for non-stop action, and tailor your experience in Zen for a revolutionary new way to relax.… Expand"}, {"name": "Dangerous Waters", "details_link": "https://www.metacritic.com/game/pc/dangerous-waters", "publisher": "Strategy First", "release_date": "Feb 22 2005", "developers": ["Sonalysts"], "platforms": "PC", "num_players": "Up to 32 ", "genres": ["Simulation", "Submarine", "Marine", "Combat"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/d1756b24a1634f68a5a7ec1c8f6ee2f7-98.jpg", "descriptions": "Dangerous Waters will be the first title of its kind, allowing you total control over multiple air, surface, and submarine platforms in a modern-day naval environment! The game allows you to focus your attention and to take direct control of individual crew stations and also plan and executeDangerous Waters will be the first title of its kind, allowing you total control over multiple air, surface, and submarine platforms in a modern-day naval environment! The game allows you to focus your attention and to take direct control of individual crew stations and also plan and execute combined arms naval strategies from a top-down 'Commanders Eye' perspective. S.C.S. - Dangerous Waters allows you control of over 10 of the world's most potent naval units out of a total of more than 270 civilian and military surface, submarine and air units included in the game. [Battlefront.com]… Expand"}, {"name": "Shift 2: Unleashed", "details_link": "https://www.metacritic.com/game/xbox-360/shift-2-unleashed", "publisher": "Electronic Arts", "release_date": "Mar 29 2011", "developers": ["Slightly Mad Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 82, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/a9bb0e2894d5aaed68a9781c7f7781df-98.jpg", "descriptions": "Shift 2 Unleashed combines violence and excitement in this racing experience."}, {"name": "No More Heroes 2: Desperate Struggle", "details_link": "https://www.metacritic.com/game/switch/no-more-heroes-2-desperate-struggle", "publisher": "XSEED Games", "release_date": "Oct 28 2020", "developers": ["Engine Software", "Grasshopper Manufacture"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/a071596e20bd357ba1d82906bc12b846-98.jpg", "descriptions": "It has been 3 years since Travis earned the Number 1 spot in the United Assassins Association ranking, and investments from major corporations have caused the city of Santa Destroy to change... but is it really for the better? You are Travis Touchdown - a punk anti-hero , Japanese animeIt has been 3 years since Travis earned the Number 1 spot in the United Assassins Association ranking, and investments from major corporations have caused the city of Santa Destroy to change... but is it really for the better? You are Travis Touchdown - a punk anti-hero , Japanese anime Otaku, beam katana master and pro wrestling-fanatic assassin. Revenge will bring you back to the UAA tournament. This time though, you begin at the bottom of the ranking and will have to fight your way up to save Santa Destroy and avenge your best friend.… Expand"}, {"name": "Yooka-Laylee and the Impossible Lair", "details_link": "https://www.metacritic.com/game/playstation-4/yooka-laylee-and-the-impossible-lair", "publisher": "Team17", "release_date": "Oct  8 2019", "developers": ["Playtonic Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/661fe15d1e6f7173a02e8f94a748df56-98.jpg", "descriptions": "Yooka & Laylee are back in a brand-new platform hybrid adventure. They must run, jump and roll their way through a series of challenging 2D levels, face a puzzling Overworld and rally the Royal Bee-tallion to take down Capital B and his Impossible Lair. \r* The overworld isn't just a hub toYooka & Laylee are back in a brand-new platform hybrid adventure. They must run, jump and roll their way through a series of challenging 2D levels, face a puzzling Overworld and rally the Royal Bee-tallion to take down Capital B and his Impossible Lair. \r* The overworld isn't just a hub to hop from level to level, it provides a whole separate gaming experience. Explore and unlock more 2D levels by completing objectives and puzzles, rescue Royal Bees and find collectibles.\r* Alternate Level States. Think you've got a level figured out? Try it in its alternate state! Flip switches in the overworld to create new landscapes.\r* Bee-at the Impossible Lair. Players are free to tackle Capital B's Impossible Lair at any time; however, they may find it too much of a challenge without the help of the Royal Bee Guards.… Expand"}, {"name": "LEGO The Lord of the Rings", "details_link": "https://www.metacritic.com/game/playstation-3/lego-the-lord-of-the-rings", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 13 2012", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Adventure", "General", "General", "Compilation", "Linear"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/59e2754a9fa17e54735e4862b00940d1-98.jpg", "descriptions": "LEGO The Lord of the Rings retells the story of the Lord of the Rings Trilogy through the visuals of the LEGO universe."}, {"name": "Iron Brigade", "details_link": "https://www.metacritic.com/game/xbox-360/iron-brigade", "publisher": "Microsoft Game Studios", "release_date": "Jun 22 2011", "developers": ["Double Fine Productions"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Strategy", "General", "Real-Time", "General", "Defense"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/290b12d7d181753c2cab69fe7205f165-98.jpg", "descriptions": "Trenched is the newest title from Double Fine."}, {"name": "Tomb Raider: Legend", "details_link": "https://www.metacritic.com/game/pc/tomb-raider-legend", "publisher": "Eidos Interactive", "release_date": "Apr 11 2006", "developers": ["Nixxes Software"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Linear"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/74419f0fca91605eefbae21f69385e0e-98.jpg", "descriptions": "Tomb Raider: Legend revives the athletic, intelligent and entertaining adventurer who won the hearts and minds of gamers worldwide.  Lara comes alive with intricately animated expressions, moves and abilities.  An arsenal of modern equipment, such as a magnetic grappling device, binoculars,Tomb Raider: Legend revives the athletic, intelligent and entertaining adventurer who won the hearts and minds of gamers worldwide.  Lara comes alive with intricately animated expressions, moves and abilities.  An arsenal of modern equipment, such as a magnetic grappling device, binoculars, frag grenades, personal lighting device and communications equipment, allows gamers to experience tomb raiding as never before.  Eidos and Crystal Dynamics shaped Lara's look and movements to be an inherent extension of her skills, motivation and personality.  Lara's character model features natural structure, realistic textures, detailed facial features, reactive eyes and fluid motion, all of which make her part of a living environment. New character animations and controls allow her to move through stunning environments with grace and precision, while an understanding of the game's original appeal reinvigorates the fundamental explore-and-solve adventure experience. [Eidos Interactive]… Expand"}, {"name": "Peter Jackson's King Kong: The Official Game of the Movie", "details_link": "https://www.metacritic.com/game/playstation-2/peter-jacksons-king-kong-the-official-game-of-the-movie", "publisher": "Ubisoft", "release_date": "Nov 21 2005", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/9b3513f08f461498a9c164b9d78bb925-98.jpg", "descriptions": "Embark on an epic adventure created in collaboration with Academy Award-winning director Peter Jackson and based on the Universal Pictures' film. Survive as Jack in a world crawling with predators and live the legend as Kong. Use weapons, traps, and your team wisely to survive inEmbark on an epic adventure created in collaboration with Academy Award-winning director Peter Jackson and based on the Universal Pictures' film. Survive as Jack in a world crawling with predators and live the legend as Kong. Use weapons, traps, and your team wisely to survive in first-person as Jack. Break jaws, slam enemies, and throw massive objects in Kong's colossal third-person battles. [Ubisoft]… Expand"}, {"name": "Asheron's Call 2: Fallen Kings", "details_link": "https://www.metacritic.com/game/pc/asherons-call-2-fallen-kings", "publisher": "Microsoft Game Studios", "release_date": "Nov 20 2002", "developers": ["Turbine Inc."], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/066ebc7c00eb938b9316c03d8beec6f3-98.jpg", "descriptions": "Are you ready for the next generation of multiplayer role-playing games? Asheron's Call 2: Fallen Kings combines state of the art 3-D graphics , innovative combat and game-play and a dynamic monthly update system that immerses players in a lush, living world filled with danger andAre you ready for the next generation of multiplayer role-playing games? Asheron's Call 2: Fallen Kings combines state of the art 3-D graphics , innovative combat and game-play and a dynamic monthly update system that immerses players in a lush, living world filled with danger and challenges. AC2 takes place in a fantasy world that has been devastated by a great disaster. You and your fellow players must venture forth and shape the course of this ever-evolving world. [Microsoft]… Expand"}, {"name": "Super Monkey Ball Jr.", "details_link": "https://www.metacritic.com/game/game-boy-advance/super-monkey-ball-jr", "publisher": "THQ", "release_date": "Nov 19 2002", "developers": ["Realism Ltd"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/4a44cb04d89fd3a0b80939aa85e59dcb-98.jpg", "descriptions": "Super Monkey Ball Jr. is the kind of game you want in your collection, even if you don't generally enjoy puzzle games."}, {"name": "WWE SmackDown! Shut Your Mouth", "details_link": "https://www.metacritic.com/game/playstation-2/wwe-smackdown!-shut-your-mouth", "publisher": "THQ", "release_date": "Oct 31 2002", "developers": ["Yuke's"], "platforms": "PlayStation 2", "num_players": "1-6 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/b4c2becaee784d6478231d16518a258c-98.jpg", "descriptions": "Features an updated roster with even more WWE superstars, including Hollywood Hulk Hogan, Stacy Keibler, DDP, Ric Flair, the nWo, and many more. The in-depth story mode has multiple character paths, and for the first time, players will have the option to enter superstars into a WorldFeatures an updated roster with even more WWE superstars, including Hollywood Hulk Hogan, Stacy Keibler, DDP, Ric Flair, the nWo, and many more. The in-depth story mode has multiple character paths, and for the first time, players will have the option to enter superstars into a World Wrestling Entertainment draft pool. There are a variety of backstage areas modeled after Madison Square Garden, and more than 14 PPV arenas, including Backlash, Vengeance, and Unforgiven. The thousands of animations include superstar signature moves with double- and triple-team moves. The improved create-a-wrestler mode lets players build the ultimate wrestler with a dynamic layer system and a new thumbnail system, allowing even more CAW options.… Expand"}, {"name": "Tom Clancy's The Division 2", "details_link": "https://www.metacritic.com/game/xbox-one/tom-clancys-the-division-2", "publisher": "Ubisoft", "release_date": "Mar 12 2019", "developers": ["Massive Entertainment"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "Up to 16 ", "genres": ["First-Person", "Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 82, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/a51a4c8c5f19e17be4860fcfddab7766-98.jpg", "descriptions": "Set in Washington D.C., the game takes place 7 months after a deadly virus was released in New York City and the nation has become a shell of its former self. While the virus has been contained, its effects are most evident in the devastated streets of the nation's capital where survivorsSet in Washington D.C., the game takes place 7 months after a deadly virus was released in New York City and the nation has become a shell of its former self. While the virus has been contained, its effects are most evident in the devastated streets of the nation's capital where survivors cling to hope and struggle to rebuild. Enter The Division, a unit of civilian sleeper agents who now must work to stop enemy factions from completely taking over the city – and ultimately, the nation. As a universally-regarded seat of power, if D.C. falls, the nation falls. With civilians helpless and fearing for their lives, players will be the last line of defense in preventing the total collapse of society. [Ubisoft]… Expand"}, {"name": "Hotline Miami Collection", "details_link": "https://www.metacritic.com/game/switch/hotline-miami-collection", "publisher": "Devolver Digital", "release_date": "Aug 19 2019", "developers": ["Dennaton"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/e4736667a852547dcb9db2dd8a3aa311-98.jpg", "descriptions": "Hotline Miami Collection contains both legendary games in the neon-soaked, brutally-challenging Hotline Miami series from Dennaton Games."}, {"name": "Yakuza Kiwami 2", "details_link": "https://www.metacritic.com/game/pc/yakuza-kiwami-2", "publisher": "Sega", "release_date": "May  9 2019", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/03d19550a3d8ee9f44eac0b7aba2bece-98.jpg", "descriptions": "SEGA proudly presents Yakuza Kiwami 2, one of the most beloved story lines in the franchise's history, remade in full HD for the PlayStation 4. One year after the 10 billion yen incident, Kazuma Kiryu begins to build a peaceful life with Haruka Sawamura. Tearing him away, an assassinationSEGA proudly presents Yakuza Kiwami 2, one of the most beloved story lines in the franchise's history, remade in full HD for the PlayStation 4. One year after the 10 billion yen incident, Kazuma Kiryu begins to build a peaceful life with Haruka Sawamura. Tearing him away, an assassination threatens to erupt in an all-out war between the Tojo Clan and the Omi Alliance. Kiryu, the Dragon of Dojima, must travel to Sotenbori, Osaka in an attempt to broker peace between the rival clans, but Ryuji Goda, known as the Dragon of Kansai, will stop at nothing to get his war. In this world, there can only be one dragon.… Expand"}, {"name": "Unreal Tournament III", "details_link": "https://www.metacritic.com/game/xbox-360/unreal-tournament-iii", "publisher": "Midway", "release_date": "Jul  7 2008", "developers": ["Epic Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/f22b29f564247e3b7298acdd89784b1d-98.jpg", "descriptions": "[Also known as \"Unreal Tournament III\"]  Players assume the role of a futuristic warrior engaged in contests of intense shooting battles against skilled opponents, controlled either by human contestants online or by A.I. These contests are fought with the most powerful sci-fi weapons and[Also known as \"Unreal Tournament III\"]  Players assume the role of a futuristic warrior engaged in contests of intense shooting battles against skilled opponents, controlled either by human contestants online or by A.I. These contests are fought with the most powerful sci-fi weapons and vehicles.Unparalleled graphical and physical realism from the latest Unreal Engine 3 technology delivers the most compelling First Person Shooter Experience to-date...online and offline. The weaponry is bigger and badder than ever. Destroy your opponent from a distance with the ever popular Link Gun or blast away at close range with the Bio Rifle. Battle against lightening fast A.I. in the deeper and richer single player tournament mode. Expanded Onslaught game type features two complete sets of high-tech vehicles, including the massive Leviathan, the terrifying Darkwalker, and a completely new way to get into the action...the Hoverboard. Fight side-by-side with or compete against new and returning characters from the UT franchise, all with enhanced abilities, extremely detailed looks and distinct personalities. Enhanced popular game types, including: Deathmatch, Team Deathmatch, Capture the Flag, and Instagib CTF and more. Unreal Tournament 3 will feature two new characters, five new expansive maps and split screen capability, all exclusive to Xbox 360.  [Midway]… Expand"}, {"name": "Mario + Rabbids: Kingdom Battle - Donkey Kong Adventure", "details_link": "https://www.metacritic.com/game/switch/mario-+-rabbids-kingdom-battle---donkey-kong-adventure", "publisher": "Ubisoft", "release_date": "Jun 26 2018", "developers": ["Ubisoft Milan"], "platforms": "Switch", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/a1dde1920e8288058d6fef487ba9366a-98.jpg", "descriptions": "Embark in an epic battle against a vengeful Rabbid Kong who uses his new powers to take over a mysterious island. Donkey Kong, Rabbid Peach, and a moody new Rabbid hero, Rabbid Cranky, will team up on a journey across four brand-new environments. Discover a world full of reinvented tacticalEmbark in an epic battle against a vengeful Rabbid Kong who uses his new powers to take over a mysterious island. Donkey Kong, Rabbid Peach, and a moody new Rabbid hero, Rabbid Cranky, will team up on a journey across four brand-new environments. Discover a world full of reinvented tactical gameplay, new enemies, and secrets to uncover. Mario + Rabbids Kingdom Battle Donkey Kong Adventure DLC is available for download exclusively on Nintendo Switch. [Nintendo]… Expand"}, {"name": "N++", "details_link": "https://www.metacritic.com/game/playstation-4/n++", "publisher": "Metanet Software Inc.", "release_date": "Jul 28 2015", "developers": ["Metanet Software Inc."], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 82, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/2b01b71485621adf952ec7f537d30ed1-98.jpg", "descriptions": "N++ is a fast-paced, physics-based platformer starring a ninja."}, {"name": "Gemini Rue: Verschworung auf Barracus", "details_link": "https://www.metacritic.com/game/pc/gemini-rue-verschworung-auf-barracus", "publisher": "Wadjet Eye Games", "release_date": "Feb 24 2011", "developers": ["Wadjet Eye Games", "Joshua Nuernberger"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Third-Person", "General", "Point-and-Click", "Sci-Fi"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/e33c9d79eb6a4f76f5a39646b95e7883-98.jpg", "descriptions": "Gemini Rue (formerly known as Boryokudan Rue) is an intense adventure set in a bleak future dominated by the corrupt Boryokudan crime syndicate. Players assume the roles of two very different characters: Azriel Odin, an ex-assassin searching for a defector from the Gemini system, andGemini Rue (formerly known as Boryokudan Rue) is an intense adventure set in a bleak future dominated by the corrupt Boryokudan crime syndicate. Players assume the roles of two very different characters: Azriel Odin, an ex-assassin searching for a defector from the Gemini system, and \"Delta-Six,\" a hospital inmate whose memory has been wiped by mysterious, Big Brother types. As fate brings the two men together, players explore a world where life is cheap, identities are bought and sold, and a simple quest for redemption can change an entire galaxy's fate. … Expand"}, {"name": "Azure Striker Gunvolt 3", "details_link": "https://www.metacritic.com/game/switch/azure-striker-gunvolt-3", "publisher": "Inti Creates", "release_date": "Jul 28 2022", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/e0b230537c31e79ab2e4967930dc10c9-98.jpg", "descriptions": "The Gunvolt series began in 2014 with the digital-exclusive 3DS game Azure Striker Gunvolt. In 2016, Azure Striker Gunvolt 2 continued the story of hero Gunvolt alongside his rival Copen. And now, in 2022, Azure Striker Gunvolt 3 finally picks up where 2 left off as an official sequel. NewThe Gunvolt series began in 2014 with the digital-exclusive 3DS game Azure Striker Gunvolt. In 2016, Azure Striker Gunvolt 2 continued the story of hero Gunvolt alongside his rival Copen. And now, in 2022, Azure Striker Gunvolt 3 finally picks up where 2 left off as an official sequel. New protagonist Kirin fights along side Gunvolt, allowing players to switch characters on the fly, adding a new element to the series’ high-speed 2D action gameplay. Familiar faces will return as “Image Pulses,” a new system that allows players to use characters from Gunvolt’s past in combat with over 150 varieties available! Thanks to the cooperation of Keiji Inafune (LEVEL5 comcept CCO), series executive producer / action supervisor, Inti Creates has evolved Gunvolt 3‘s action to exceed the expectations of modern players on the Nintendo Switch platform. Players will be blown away by the speedy and precise action on display in Azure Striker Gunvolt 3!… Expand"}, {"name": "Tadpole Treble Encore", "details_link": "https://www.metacritic.com/game/switch/tadpole-treble-encore", "publisher": "BitFinity", "release_date": "Jan 21 2021", "developers": ["BitFinity"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Action", "Rhythm", "Music"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/6655f2fa5943abc741988aaa77531274-98.jpg", "descriptions": "Face the music in Tadpole Treble Encore, a charming, harmonious odyssey.\rThe award-winning rhythm-based action game is coming to you! Featuring “some of the best video game music ever” according to Real Otaku Gamer, Tadpole Treble invites players to embark on a thrilling adventure throughFace the music in Tadpole Treble Encore, a charming, harmonious odyssey.\rThe award-winning rhythm-based action game is coming to you! Featuring “some of the best video game music ever” according to Real Otaku Gamer, Tadpole Treble invites players to embark on a thrilling adventure through sheet music. Escape predatory piranhas, flirtatious admirers and more as you make your way back home. Or forge your own path—and songs—in the game’s extensive Composition Mode.… Expand"}, {"name": "Valkyria Chronicles 4", "details_link": "https://www.metacritic.com/game/switch/valkyria-chronicles-4", "publisher": "Sega", "release_date": "Sep 25 2018", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/b35bf862d1bf8ab3d4f5777c425a09d5-98.jpg", "descriptions": "A Continent Engulfed in the Bitter Flames of War. Commander Claude Wallace and his childhood friends set out to fight in a desperate war, but bone-chilling blizzards, waves of imperial soldiers, and the godlike powers of the Valkyria stand between them and victory."}, {"name": "Sonic CD", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-cd", "publisher": "Sega", "release_date": "Dec 14 2011", "developers": ["Sega"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/10d1f05452a307de54d2817afeb618fc-98.jpg", "descriptions": "Sonic CD bridges the gap between his oldest adventures and his new digital exploits."}, {"name": "Borderlands 3", "details_link": "https://www.metacritic.com/game/xbox-one/borderlands-3", "publisher": "2K Games", "release_date": "Sep 13 2019", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox Series X", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 82, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/73b0ff25fd43fa5dc3780d01366efa5c-98.jpg", "descriptions": "At the hard edge of the galaxy lies a group of planets ruthlessly exploited by militarized corporations. Brimming with loot and violence, this is your home – the Borderlands. Answering the call of the Siren champion Lilith, four Vault Hunters charge head-first into a spray of bullets, blood,At the hard edge of the galaxy lies a group of planets ruthlessly exploited by militarized corporations. Brimming with loot and violence, this is your home – the Borderlands. Answering the call of the Siren champion Lilith, four Vault Hunters charge head-first into a spray of bullets, blood, and bandits to recover a map to ancient Vaults and prevent a universe-destroying power from falling into the wrong hands. The rest is history. Fearless renegade mercenaries on the wildest interplanetary treasure hunt of all time. FL4K is a wandering robotic tracker whose cold steel heart warms only for their pet beasts. Amara beats bad guys into pancakes with her psychic fists. Moze’s best friend is a 10-ton walking killing machine. And Zane, the semi-retired corporate hitman... well, he’s Zane.  Hunting Alone? No problem! Shoot and loot your way through the Borderlands, discovering the region’s untold stories and piling high your increasingly deadly cache of goodies and weapons. [2K Games]… Expand"}, {"name": "Pro Evolution Soccer 2015", "details_link": "https://www.metacritic.com/game/playstation-4/pro-evolution-soccer-2015", "publisher": "Konami", "release_date": "Nov 11 2014", "developers": ["Konami"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Action", "General", "Sports", "Traditional", "Team", "Soccer", "Sim"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/e027d53551981a404f7587dc9eec9a23-98.jpg", "descriptions": "Master a renewed array of dribbling techniques and use your speed, runs and responsive sprints to outdo your opponents. Accost defenders using each player’s dribbling skills, as opposed to relying on gimmick moves. Gamers now have full control over when to close down, tackle, or hold upMaster a renewed array of dribbling techniques and use your speed, runs and responsive sprints to outdo your opponents. Accost defenders using each player’s dribbling skills, as opposed to relying on gimmick moves. Gamers now have full control over when to close down, tackle, or hold up play. Successful defending is based solely on the decisions the gamer makes. PES 2015 now reflects the atmosphere of a top-tier match. Fan animations have been enhanced, and the ebb and flow of a match is met with context-sensitive crowd effects and movements. … Expand"}, {"name": "Dyad", "details_link": "https://www.metacritic.com/game/playstation-3/dyad", "publisher": "SCEA", "release_date": "Jul 17 2012", "developers": ["Right Square Bracket Left Square Bracket Games"], "platforms": ["PC", "PlayStation 3"], "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Futuristic"], "meta_score": 82, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/749c7844bc69ae8170b01b60d52669e2-98.jpg", "descriptions": "Dyad reveals to you the secrets of the universe via bright flashy colors and phat beatz. A gamified tie dye machine. An interactive mind altering substance absorbed through your thumbs, eyes and ears. A tactical octopus action ballet in a reactive audio-visual tube. Experience aDyad reveals to you the secrets of the universe via bright flashy colors and phat beatz. A gamified tie dye machine. An interactive mind altering substance absorbed through your thumbs, eyes and ears. A tactical octopus action ballet in a reactive audio-visual tube. Experience a transcendental sensory overload. Race through a reactive audio-visual tube creating a harmonious synthesis of colour and sound as you hook, graze, and lance enemies to master Dyad's 27 unique levels. Embark on a mind-altering interactive journey through Dyad's Game Mode in order to prepare yourself for Trophy Mode's tactical freakout variations wherein a Platinum Trophy awaits only the most skillful. Or choose to sit back and chill with Dyad's hallucinogenic Remix Mode. [Playstation.com]… Expand"}, {"name": "Antichamber", "details_link": "https://www.metacritic.com/game/pc/antichamber", "publisher": "Demruth", "release_date": "Jan 31 2013", "developers": ["Demruth"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/b95c49f89d28f6b395ea227d034560aa-98.jpg", "descriptions": "Antichamber is a game about discovery, set inside a vibrant, minimal, Escher-like world, where geometry and space follow unfamiliar rules, and obstacles are a matter of perception.\r Journey through the depths of a non-Euclidean labyrinth, as you create, destroy and manipulate matter, andAntichamber is a game about discovery, set inside a vibrant, minimal, Escher-like world, where geometry and space follow unfamiliar rules, and obstacles are a matter of perception.\r Journey through the depths of a non-Euclidean labyrinth, as you create, destroy and manipulate matter, and uncover new ways to overcome your surroundings in this mind-bending psychological exploration game.… Expand"}, {"name": "Sonic & All-Stars Racing Transformed", "details_link": "https://www.metacritic.com/game/playstation-3/sonic-all-stars-racing-transformed", "publisher": "Sega", "release_date": "Nov 18 2012", "developers": ["Sumo Digital"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation Vita", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart", "Automobile"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/c9b87369d35dbb5bcffeff8520d5d8d3-98.jpg", "descriptions": "Sonic and the All-Stars cast battle for supremacy across land, water and air in transforming vehicles that change from cars to boats to planes mid-race."}, {"name": "Atelier Sophie 2: The Alchemist of the Mysterious Dream", "details_link": "https://www.metacritic.com/game/playstation-4/atelier-sophie-2-the-alchemist-of-the-mysterious-dream", "publisher": "Koei Tecmo Games", "release_date": "Feb 25 2022", "developers": ["Gust"], "platforms": ["PC", "Switch", "PlayStation 4"], "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 82, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/0/fda795c8de4c1e0a2f9bf6b5f4fb5a84-98.jpg", "descriptions": "A mysterious story of a mysterious dream...\rOne of the stories experienced throughout the Alchemist Sophie’s many adventures, as she continued her travels after leaving her hometown of Kirchen Bell.\rThis is Sophie’s adventure as she searches for her friend Plachta in the dream world ErdeA mysterious story of a mysterious dream...\rOne of the stories experienced throughout the Alchemist Sophie’s many adventures, as she continued her travels after leaving her hometown of Kirchen Bell.\rThis is Sophie’s adventure as she searches for her friend Plachta in the dream world Erde Wiege, where they become separated, and shows the bonds she forms with the people she meets and passing of hearts.\r ■Evolved turn-based battles & seamless transitions!\rIn the 6 member party turn-based battles, the 3 members in the front and 3 in the back form 2 teams cooperating “multi-linked turn battles”, and transitions from exploration to battles without loading times in “seamless battles”, the entire game can be enjoyed at a great pace.\r ■2 types of panels for everyone to enjoy synthesis!\rThis game uses panel synthesis, the synthesis system of the Mysterious series, where materials are placed in the panel slots to create new items in this puzzle-like feature. By placing the certain materials in the slots, various effects can be produced.\rThere are 2 types of panels in this game that players can select from : a regular panel and a restricted panel that has a higher synthesis difficulty level.\rThe board of the restricted panel is fairly complex, but when materials are placed just right, items with high effects can be synthesized, which can't be generated from the regular panel. … Expand"}, {"name": "Gears Tactics", "details_link": "https://www.metacritic.com/game/xbox-series-x/gears-tactics", "publisher": "Microsoft", "release_date": "Nov 10 2020", "developers": ["Splash Damage"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/660350e70dddfb7cae6c8ad64c8d02a4-98.jpg", "descriptions": "Gears Tactics is the fast-paced, turn-based strategy game from one of the most-acclaimed video game franchises – Gears of War. Outnumbered and fighting for survival, recruit and command your squad to hunt down an evil mastermind who makes monsters."}, {"name": "NBA 2K9", "details_link": "https://www.metacritic.com/game/playstation-3/nba-2k9", "publisher": "2K Sports", "release_date": "Oct  7 2008", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/4e95e82e4bbb48228b2faa301b97ffdf-98.jpg", "descriptions": "Improved facial and skin textures, better uniforms, improved eye movement and more realistic crowd reactions bring the game alive like never before. Analyst Clark Kellogg and sideline reporter Cheryl Miller join color commentator Kevin Harlan to create one of the most knowledgeable broadcastImproved facial and skin textures, better uniforms, improved eye movement and more realistic crowd reactions bring the game alive like never before. Analyst Clark Kellogg and sideline reporter Cheryl Miller join color commentator Kevin Harlan to create one of the most knowledgeable broadcast teams in the game. End each quarter with enhanced, multiple angle replay highlights, and be rewarded like never before with all-new, true-to-life celebration sequences after you capture the NBA championship. [2K Sports]… Expand"}, {"name": "Neverwinter Nights 2", "details_link": "https://www.metacritic.com/game/pc/neverwinter-nights-2", "publisher": "Atari", "release_date": "Oct 31 2006", "developers": ["Obsidian Entertainment"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 82, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/60e5017025918739cc72deb1a547afd2-98.jpg", "descriptions": "Neverwinter Nights 2 is the sequel to BioWare Corp.'s best-selling and genre-defining role-playing game set in the popular Dungeons & Dragons Forgotten Realms universe created by Wizards of the Coast. Neverwinter Nights 2 will be developed by Obsidian Entertainment, founded by FeargusNeverwinter Nights 2 is the sequel to BioWare Corp.'s best-selling and genre-defining role-playing game set in the popular Dungeons & Dragons Forgotten Realms universe created by Wizards of the Coast. Neverwinter Nights 2 will be developed by Obsidian Entertainment, founded by Feargus Urquhart who, as the President of Black Isle Studios, was responsible for the publishing of the Baldur's Gate and Baldur's Gate: Dark Alliance series and the development of the Icewind Dale and Planescape: Torment franchises, both powered by BioWare Engine Technology, as well as overseeing the creation and development of the Fallout series. BioWare will provide tools, technology, and game assets from the original Neverwinter Nights as well as lend creative input and oversight to the development process. [Atari]… Expand"}, {"name": "Mega Man Powered Up", "details_link": "https://www.metacritic.com/game/psp/mega-man-powered-up", "publisher": "Capcom", "release_date": "Mar 14 2006", "developers": ["Capcom"], "platforms": "PSP", "num_players": "24  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/73372e336bc776c7a304ac83a3fbbacb-98.jpg", "descriptions": "Mega Man is on a quest to restore peace in the world after Dr. Wily takes control of several robots in hopes to rule the planet. Completely re-designed for the PSP with new bosses and puzzles to master, Mega Man Powered Up is the only action platformer that lets gamers create their ownMega Man is on a quest to restore peace in the world after Dr. Wily takes control of several robots in hopes to rule the planet. Completely re-designed for the PSP with new bosses and puzzles to master, Mega Man Powered Up is the only action platformer that lets gamers create their own levels and share with friends. Totally redesigned level structure - every level features modified map structures as well as varied item locations. Intuitive level editor option allows endless possibilities. Players can design their own stages creating challenges that are only limited by their own imagination. Customize everything from enemy and object placement to music. Mega Man Challenge 100 – take a break from the main story mode by putting skills to the test in 100 different short stages, each with its own objectives and challenges. Play as any of the eight boss robots in the game – utilize their unique abilities and characteristics to zip past obstacles. [Capcom]… Expand"}, {"name": "Desperados III", "details_link": "https://www.metacritic.com/game/playstation-4/desperados-iii", "publisher": "THQ Nordic", "release_date": "Jun 16 2020", "developers": ["Mimimi Productions"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/6dc10463e956606431c16c7574302f6b-98.jpg", "descriptions": "On his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and aOn his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and a mysterious lady from New Orleans. They make their way from the mountains of Colorado to the heart of Louisiana, then finally to New Mexico, right back into Cooper's past.\r You take control of this ragtag band becoming a highly functional group of unlikely heroes and heroines. The leader of his team is Cooper, drifter and gunslinger, who can kill quietly with a knife or take out multiple foes with his revolvers. Strongman Hector carries a giant beartrap and can slay the toughest opponents with his trusty axe. Cold-blooded bounty hunter McCoy likes to be methodical, using lures, knockout gas, poison syringes and a custom long-range pistol. Kate can fool almost any man with the right outfit and kill discretely with her hidden gun.\r Combine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real-time to sneak past your enemies while remaining undetected.… Expand"}, {"name": "Darkstalkers Resurrection", "details_link": "https://www.metacritic.com/game/xbox-360/darkstalkers-resurrection", "publisher": "Capcom", "release_date": "Mar 13 2013", "developers": ["Iron Galaxy Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Fighting", "Compilation", "2D"], "meta_score": 82, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/d24570ce8a694bca3b548035d29e1704-98.jpg", "descriptions": "Highlighting a dynamic cast characters taking part in fast-paced fighting action, Darkstalkers Resurrection contains 2 games (Night Warriors: Darkstalkers Revenge and Darkstalkers 3) in one package. Each game has a bunch of features added including robust GGPO-enabled online game play, HDHighlighting a dynamic cast characters taking part in fast-paced fighting action, Darkstalkers Resurrection contains 2 games (Night Warriors: Darkstalkers Revenge and Darkstalkers 3) in one package. Each game has a bunch of features added including robust GGPO-enabled online game play, HD graphical filtering with multiple viewing options, replay sharing, Spectator Mode, in-game achievements, Challenge/Tutorial Mode and an un-lockable vault filled with concept artwork, videos and more.… Expand"}, {"name": "Have a Nice Death", "details_link": "https://www.metacritic.com/game/pc/have-a-nice-death", "publisher": "Perfect World Entertainment", "release_date": "Mar 22 2023", "developers": ["Magic Design Studios"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/3b48e94207eb226deed332e988cccb1f-98.jpg", "descriptions": "Have a Nice Death is a 2D action roguelike where you play as an overworked Death, whose employees have run rampant, completely throwing off the balance of souls - and his vacation plans. In order to restore order, you'll have to grab your trusty scythe and show your employees who's boss.Have a Nice Death is a 2D action roguelike where you play as an overworked Death, whose employees have run rampant, completely throwing off the balance of souls - and his vacation plans. In order to restore order, you'll have to grab your trusty scythe and show your employees who's boss. \r\rSince Death can't die, use what you've learned and earned to overcome the numerous minions and bosses in each department of Death Incorporated... over and over. A performance review after every run guarantees that you'll unlock interesting items and upgrades that will help you progress on your journey.… Expand"}, {"name": "Dreamscaper", "details_link": "https://www.metacritic.com/game/switch/dreamscaper", "publisher": "Afterburner Studios", "release_date": "Aug  5 2021", "developers": ["Afterburner Studios"], "platforms": ["PC", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/4be81b66ef5859462e2c77e49788bedc-98.jpg", "descriptions": "A surreal, Hack and Slash Roguelite, players battle a nightmarish depression that lives in a young woman’s subconscious. Dreamscaper is an ARPG Roguelite, blending elements from brawlers, top-down shooters, and dungeon crawlers. \r\rEvery slumber is a different random dungeon and you mustA surreal, Hack and Slash Roguelite, players battle a nightmarish depression that lives in a young woman’s subconscious. Dreamscaper is an ARPG Roguelite, blending elements from brawlers, top-down shooters, and dungeon crawlers. \r\rEvery slumber is a different random dungeon and you must unlock the power of your dreams to see a new day. \r\rPlay as Cassidy, a young woman trapped in a deep depression. Dive into her subconscious to take on the surreal nightmares she wrestles with.\r… Expand"}, {"name": "Dark Souls III: The Ringed City", "details_link": "https://www.metacritic.com/game/playstation-4/dark-souls-iii-the-ringed-city", "publisher": "Bandai Namco Games", "release_date": "Mar 28 2017", "developers": ["From Software"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/a583c5649b30042b4b696e778009f6c4-98.jpg", "descriptions": "The Ringed City is the final DLC pack for Dark Souls III. Journey to the world’s end to search for the Ringed City and encounter new lands, new bosses, new enemies with new armor, magic and items. Experience the epic final chapter of a dark world that could only be created by the mind ofThe Ringed City is the final DLC pack for Dark Souls III. Journey to the world’s end to search for the Ringed City and encounter new lands, new bosses, new enemies with new armor, magic and items. Experience the epic final chapter of a dark world that could only be created by the mind of Hidetaka Miyazaki. … Expand"}, {"name": "Dragon Age: Origins - Awakening", "details_link": "https://www.metacritic.com/game/pc/dragon-age-origins---awakening", "publisher": "Electronic Arts", "release_date": "Mar 16 2010", "developers": ["BioWare"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/80719068495db1af4464395acc6c9c0e-98.jpg", "descriptions": "Designed and written by the same team that brought you Dragon Age: Origins, the Awakening expansion pack offers a brand new area of the world to explore known as Amaranthine, featuring an epic story that will allow players to unravel the secrets of the darkspawn - and their true motivations!Designed and written by the same team that brought you Dragon Age: Origins, the Awakening expansion pack offers a brand new area of the world to explore known as Amaranthine, featuring an epic story that will allow players to unravel the secrets of the darkspawn - and their true motivations!  Players face a range of horrific and terrifying creatures including an evolved, intelligent breed of darkspawn and other menacing creatures such as the Inferno Golem and Spectral Dragon.  Dragon Age: Origins – Awakening provides exciting new ways for players to customize their heroes and party, including the ability to re-spec their character attributes, allowing even greater customization and replayability.  Featuring an increased level cap, new spells, abilities, specializations and items, plus five all-new party members, players can continue their adventures from Dragon Age: Origins, or begin with a brand new character. [BioWare]… Expand"}, {"name": "Shadowverse: Champion's Battle", "details_link": "https://www.metacritic.com/game/switch/shadowverse-champions-battle", "publisher": "XSEED Games", "release_date": "Aug 10 2021", "developers": ["Cygames"], "platforms": "Switch", "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/8c01dd916c71bb15fb7e1929724515b6-98.jpg", "descriptions": "The anime version of the hit strategic multiplayer mobile/PC card battle game Shadowverse is coming to the Nintendo Switch as an exciting new card battle RPG. Players will meet a fun cast of characters and duke it out in intense card battles. Experienced Shadowverse players will be able toThe anime version of the hit strategic multiplayer mobile/PC card battle game Shadowverse is coming to the Nintendo Switch as an exciting new card battle RPG. Players will meet a fun cast of characters and duke it out in intense card battles. Experienced Shadowverse players will be able to seamlessly transition into the game as card battle rules are exactly the same as the original game they know and love, but new players will have no problem picking up and playing this beginner-friendly game as well! The game's card library boasts cards from the first three sets of the mobile/PC game, as well as brand new cards unique to this title, allowing players to create completely original strategies. Also new to the Switch version are special, deluxe battle animations.… Expand"}, {"name": "Peter Jackson's King Kong: The Official Game of the Movie", "details_link": "https://www.metacritic.com/game/xbox/peter-jacksons-king-kong-the-official-game-of-the-movie", "publisher": "Ubisoft", "release_date": "Nov 21 2005", "developers": ["Ubisoft Montpellier"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/84a292a4dc41a38cefe9fc380832b7ed-98.jpg", "descriptions": "Play as man or beast in Peter Jackson's King Kong: The Official Game of the Movie. You can be King Kong or Jack Driscoll as you follow a story based on the movie. Peter Jackson, the director of the 2005 movie, also took an active role in developing the game, which expands upon the movie'sPlay as man or beast in Peter Jackson's King Kong: The Official Game of the Movie. You can be King Kong or Jack Driscoll as you follow a story based on the movie. Peter Jackson, the director of the 2005 movie, also took an active role in developing the game, which expands upon the movie's storyline, adding new creatures and locations. The game employs a cinematic style that makes the game more immersive and less like a traditional video game.… Expand"}, {"name": "Danganronpa: Trigger Happy Havoc", "details_link": "https://www.metacritic.com/game/pc/danganronpa-trigger-happy-havoc", "publisher": "Spike Chunsoft", "release_date": "Feb 18 2016", "developers": ["Spike Chunsoft"], "platforms": ["iPhone/iPad", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/3901421dd9a6a3c507228dd231d847ec-98.jpg", "descriptions": "Fifteen super-elite students have been locked in the school and they are forced to live in this isolated community. There is a special rule for the students: only murderers can graduate from the school, and this rule turns the prosperous school into the despairing place. The protagonist,Fifteen super-elite students have been locked in the school and they are forced to live in this isolated community. There is a special rule for the students: only murderers can graduate from the school, and this rule turns the prosperous school into the despairing place. The protagonist, however, does not follow this rule. He investigates murders instead of murdering somebody and tries to figure out a way to escape from the school.… Expand"}, {"name": "Hearthstone: Heroes of Warcraft - Blackrock Mountain", "details_link": "https://www.metacritic.com/game/pc/hearthstone-heroes-of-warcraft---blackrock-mountain", "publisher": "Blizzard Entertainment", "release_date": "Apr  2 2015", "developers": ["Blizzard Entertainment"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 82, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/1b191b198a85124ed99e8e0c23baa12e-98.jpg", "descriptions": "An expansion for Hearthstone, Blackrock Mountain is a single-player adventure."}, {"name": "Madden NFL 07", "details_link": "https://www.metacritic.com/game/gamecube/madden-nfl-07", "publisher": "EA Sports", "release_date": "Aug 22 2006", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "GameCube"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/f96e4ea572985579d502820b45dddc75-98.jpg", "descriptions": "With the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback andWith the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback and smash through, overpower, or slash away from would-be tacklers as you fight for every yard. Innovative rushing controls give you a game-breaking ground attack featuring all-new jukes, cutbacks, and the distinct running styles of your favorite backs.… Expand"}, {"name": "Rome: Total War Barbarian Invasion", "details_link": "https://www.metacritic.com/game/pc/rome-total-war-barbarian-invasion", "publisher": "Sega", "release_date": "Sep 27 2005", "developers": ["Creative Assembly"], "platforms": ["iPhone/iPad", "PC"], "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/ffdbdd3ab986ac14fdc742166cfd3a4d-98.jpg", "descriptions": "Rome: Total War - Barbarian Invasion commences just after the last Emperor of a unified Rome has died. His successors in Rome and Constantinople are now uneasy allies and rivals for power. The ‘barbarians' are massing along the borders, and in some cases are living inside what used to beRome: Total War - Barbarian Invasion commences just after the last Emperor of a unified Rome has died. His successors in Rome and Constantinople are now uneasy allies and rivals for power. The ‘barbarians' are massing along the borders, and in some cases are living inside what used to be Roman territory. Two hundred years have now passed since the main campaign in Rome: Total War. Players can now control vast armies and over 100 new units as they battle across an updated European map that now reflects the historical changes since Rome: Total War. Tear Rome apart by leading hordes of barbarians or stand and defend the Empire as a leader of one of the two former Romes, the Western and Eastern Empires. [Sega]… Expand"}, {"name": "The Pinball Arcade", "details_link": "https://www.metacritic.com/game/xbox-360/the-pinball-arcade", "publisher": "Farsight Studios", "release_date": "Apr  4 2012", "developers": ["Farsight Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 82, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/b030ec9370fd0ca00d98f4a10f5a7b36-98.jpg", "descriptions": "The Pinball Arcade franchise includes real tables from Bally, Williams, Gottlieb and Stern, many of which feature well-known licensed themes.  Two new tables will be released every month as downloadable content. Every new table will be available in trial mode, absolutely free."}, {"name": "Gradius V", "details_link": "https://www.metacritic.com/game/playstation-2/gradius-v", "publisher": "Konami", "release_date": "Sep 14 2004", "developers": ["Treasure"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 82, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/1/6cbcfadba99ee8344195631f439931b5-98.jpg", "descriptions": "Konami's popular shooting franchise, Gradius, returns in the first installment specially designed for a next-generation platform. With the new Option Controls feature and masterful level design, Gradius V creates a new strategic dimension in shooting as gamers take control of the Vic ViperKonami's popular shooting franchise, Gradius, returns in the first installment specially designed for a next-generation platform. With the new Option Controls feature and masterful level design, Gradius V creates a new strategic dimension in shooting as gamers take control of the Vic Viper and blast through seven stages of classic arcade-style action on a non-stop, intense thrill ride to destroy the Bacterian core. Spectacular 3D graphics – the best looking Gradius Ever. New Option Controls feature adds depth and gameplay. 7 expansive levels of exciting shooting action. Classic Gradius action with new features and inspired level design. [Konami]… Expand"}, {"name": "Marvel: Ultimate Alliance", "details_link": "https://www.metacritic.com/game/xbox-360/marvel-ultimate-alliance", "publisher": "Activision", "release_date": "Oct 24 2006", "developers": ["Raven Software"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/db2e5f6a12971ff94e07e5150cb2b8f9-98.jpg", "descriptions": "Marvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine theMarvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine the fate of both planet Earth and the Marvel universe – revealed in one of multiple epilogues. Marvel: Ultimate Alliance offers total team customization, where players create their own team name, icon and vehicle, as well as establish their team reputation as they play throughout the story.  Gamers also have the option to level up each character individually to their liking, or all team members at the same time to keep their heroes balanced.  With the game's new combat system, players battle against the world's most notorious Marvel Super Villains in the air, underwater, and on the ground, using grappling, blocking and dodging moves, by charging up their Super Hero powers before unleashing them, and using environmental objects as one and two-handed weapons. Marvel:  Ultimate Alliance features a storyline where the missions players accept, the objectives they complete, and their interactions with other characters throughout the game directly impact how the story plays out. The game also features a robust multiplayer component where fans can band together with friends as their favorite Marvel Super Heroes, and fight evil in both on and offline cooperative story modes.  There's also a Competitive Mode where the game tracks various in-game stats so players can see how well they stack up against one another – affecting the amount of experience points earned and how equipment is distributed. [Activision]… Expand"}, {"name": "Top Spin 4", "details_link": "https://www.metacritic.com/game/playstation-3/top-spin-4", "publisher": "2K Sports", "release_date": "Mar 15 2011", "developers": ["2K Czech"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/b8a7acf1a6b02355a8ba4880ce12c8d0-98.jpg", "descriptions": "Top Spin 4 is the latest iteration in the tennis sim, bringing 25 playable pros as well as the ability to create your own star."}, {"name": "A Plague Tale: Requiem", "details_link": "https://www.metacritic.com/game/playstation-5/a-plague-tale-requiem", "publisher": "Focus Entertainment", "release_date": "Oct 18 2022", "developers": ["Asobo Studio"], "platforms": ["PC", "Switch", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/22ec03b6a9376dff55ababb3f6ab0323-98.jpg", "descriptions": "Embark on a heartrending journey into a brutal, breathtaking world twisted by supernatural forces. After escaping their devastated homeland, Amicia and Hugo travel far south, to new regions and vibrant cities. There, they attempt to start a new life and control Hugo's curse. But, when Hugo'sEmbark on a heartrending journey into a brutal, breathtaking world twisted by supernatural forces. After escaping their devastated homeland, Amicia and Hugo travel far south, to new regions and vibrant cities. There, they attempt to start a new life and control Hugo's curse. But, when Hugo's powers reawaken, death and destruction return in a flood of devouring rats. Forced to flee once more, the siblings place their hopes in a prophesized island that may hold the key to saving Hugo.\r Discover the cost of saving those you love in a desperate struggle for survival. Strike from the shadows or unleash hell, overcoming foes and challenges with a variety of weapons, tools and unearthly powers.… Expand"}, {"name": "Sega Ages: Virtua Racing", "details_link": "https://www.metacritic.com/game/switch/sega-ages-virtua-racing", "publisher": "Sega", "release_date": "Jun 27 2019", "developers": ["Sega AM2", "M2"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/13327efd96939ea49e64c89426b8f4bc-98.jpg", "descriptions": "From the arcade to the armchair! Sega's revolutionary SVP chip puts you in the driving seat of the most technically advanced game ever. Stunning polygon graphics, four selectable viewpoints, and high-speed action combine to make this the greatest race of your life!"}, {"name": "NCAA Football 12", "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-football-12", "publisher": "EA Sports", "release_date": "Jul 12 2011", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Online Multiplayer", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 82, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/93f8f2af0b2929a1419855008fad7b31-98.jpg", "descriptions": "NCAA Football 12 is the next iteration in EA's NCAA Football series."}, {"name": "Guitar Hero III: Legends of Rock", "details_link": "https://www.metacritic.com/game/playstation-2/guitar-hero-iii-legends-of-rock", "publisher": "Activision", "release_date": "Oct 28 2007", "developers": ["Neversoft Entertainment", "BudCat"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/d29210676613795b49c99fb48f6aaa34-98.jpg", "descriptions": "Fire up the fretboard, crank up the amp and get ready to rock like never before. Guitar Hero III: Legends of Rock drops you into the spotlight of the largest and most legendary rock concert ever. The star-studded soundtrack includes master tracks by such legendary artists as Guns N’ Roses,Fire up the fretboard, crank up the amp and get ready to rock like never before. Guitar Hero III: Legends of Rock drops you into the spotlight of the largest and most legendary rock concert ever. The star-studded soundtrack includes master tracks by such legendary artists as Guns N’ Roses, The Rolling Stones, Beastie Boys, Muse and Pearl Jam, with added songs as made legendary by Kiss, Alice Cooper and Heart. Now drop that air guitar, tune your exclusive new Les Paul Guitar Controller and shred the night away with Guitar Hero III: Legends of Rock. [Activision]… Expand"}, {"name": "The Great Ace Attorney Chronicles", "details_link": "https://www.metacritic.com/game/playstation-4/the-great-ace-attorney-chronicles", "publisher": "Capcom", "release_date": "Jul 27 2021", "developers": ["Capcom"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/b43df96413b54453b2080a6117cb09d3-98.jpg", "descriptions": "With all the fun and drama of the Ace Attorney series set against the backdrop of Victorian-era Britain and Japan, there's sure to be no \"Objection!\" to the adventures of Ryunosuke Naruhodo as he turns the courtroom upside down. Featuring an intriguing overarching mystery spanning across twoWith all the fun and drama of the Ace Attorney series set against the backdrop of Victorian-era Britain and Japan, there's sure to be no \"Objection!\" to the adventures of Ryunosuke Naruhodo as he turns the courtroom upside down. Featuring an intriguing overarching mystery spanning across two games, it promises to be the most engrossing story in the series yet. [Capcom]… Expand"}, {"name": "The Darkness", "details_link": "https://www.metacritic.com/game/xbox-360/the-darkness", "publisher": "2K Games", "release_date": "Jun 25 2007", "developers": ["Starbreeze"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/5d9bd2d975077f61b92776692a3c72ad-98.jpg", "descriptions": "The Darkness features a distinct blend of dark modern crime drama and supernatural horror with intense first person non-linear gameplay. The game is a dynamic first person shooter that allows players to call upon the forces of the evil underworld as they fight in gritty, urban environments.The Darkness features a distinct blend of dark modern crime drama and supernatural horror with intense first person non-linear gameplay. The game is a dynamic first person shooter that allows players to call upon the forces of the evil underworld as they fight in gritty, urban environments. Armed with an arsenal of guns, gamers battle an array of demonic creatures and supernatural powers. In the game, players assume the role of mafia hitman Jackie Estacado. On the night of his 21st birthday, Jackie is possessed by \"The Darkness,\" an ancient demonic entity that gives Jackie spectacular powers. The story, written by Eisner Award winner Paul Jenkins, follows Jackie and his fight with the fictional Francetti mafia. As the story unfolds, the player will learn to utilize traditional weapons and the extraordinary powers of The Darkness. [2K Games]… Expand"}, {"name": "Eastward", "details_link": "https://www.metacritic.com/game/pc/eastward", "publisher": "Chucklefish", "release_date": "Sep 16 2021", "developers": ["Pixpil"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 82, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/93b7c1aa689ba5611371dc8939f72af0-98.jpg", "descriptions": "In the near-future, society is starting to collapse, and the human population is at an all-time low. A deadly toxic presence has spread across the land, destroying and devouring everything in its path.\r Those who could escape the miasma flocked to underground villages to start a new life.In the near-future, society is starting to collapse, and the human population is at an all-time low. A deadly toxic presence has spread across the land, destroying and devouring everything in its path.\r Those who could escape the miasma flocked to underground villages to start a new life. But for a hardworking miner and a mysterious young girl, the hope of a thriving outside world beckons\r Escape the tyrannical clutches of Sandfill's subterranean society and join Eastward's unlikely duo on an exciting adventure to the land above! \r\rDiscover beautiful yet bizarre settlements and make new friends as you travel across the world by rail.… Expand"}, {"name": "I Expect You To Die", "details_link": "https://www.metacritic.com/game/playstation-4/i-expect-you-to-die", "publisher": "Schell Games", "release_date": "Dec 13 2016", "developers": ["Schell Games"], "platforms": ["PC", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/7097073cfb14d1daef3e2ef98e271653-98.jpg", "descriptions": "​​I Expect You To Die is a virtual reality puzzler that thrust you in the shoes of an elite secret agent. You must attempt to survive deadly situations in immersive and dangerous locales. Complete each operation using problem-solving skills and wits… oh, and the power of telekinesis that all​​I Expect You To Die is a virtual reality puzzler that thrust you in the shoes of an elite secret agent. You must attempt to survive deadly situations in immersive and dangerous locales. Complete each operation using problem-solving skills and wits… oh, and the power of telekinesis that all our agents are equipped with.… Expand"}, {"name": "Etrian Odyssey 2 Untold: The Fafnir Knight", "details_link": "https://www.metacritic.com/game/3ds/etrian-odyssey-2-untold-the-fafnir-knight", "publisher": "Atlus", "release_date": "Aug  4 2015", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style", "Western-Style"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/4ccc579257efdf3066fe769f5dbf7cd7-98.jpg", "descriptions": "The next entry of the Etrian Odyssey Untold series is essentially two games in one - the first, a Nintendo 3DS update to Etrian Odyssey 2: Heroes of Laggard (released on Nintendo DS) with new dungeon layouts, new graphics, and system improvements from the recent Etrian Odyssey Untold. TheThe next entry of the Etrian Odyssey Untold series is essentially two games in one - the first, a Nintendo 3DS update to Etrian Odyssey 2: Heroes of Laggard (released on Nintendo DS) with new dungeon layouts, new graphics, and system improvements from the recent Etrian Odyssey Untold. The second is the Untold portion - a brand new story mode with a fixed party, voiced dialogue, and animated cut scenes that follows the bittersweet tale of the Fafnir Knight and Princess Arianna. Like Persona Q, the Untold portion of the game has a strong focus on characters and their interactions as the story about the Fafnir Knight and Princess Arianna unfolds as they adventure forth into the ruins of Ginnungagap and the Yggdrasil Labyrinth with the hero Flavio and the two mysterious adventurers, Bertrand and Chloe.… Expand"}, {"name": "Disgaea DS", "details_link": "https://www.metacritic.com/game/ds/disgaea-ds", "publisher": "NIS America", "release_date": "Sep 23 2008", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 2", "DS"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/674a3a8f6b4bb6d22a12bac369eca19a-98.jpg", "descriptions": "Completely remade to take advantage of Nintendo DS, Disgaea DS offers a deep strategy RPG experience with an exceptional story, a fantastic script, and a host of loveable characters and settings. An all-new story focus means a completely different experience for the player, not to mention aCompletely remade to take advantage of Nintendo DS, Disgaea DS offers a deep strategy RPG experience with an exceptional story, a fantastic script, and a host of loveable characters and settings. An all-new story focus means a completely different experience for the player, not to mention a brand new ending. Geo Cubes add special effects to the battlefield, completely shifting the balance in the blink of an eye. Using local wireless multiplayer support, take your friends on in grand battles of strategy and wit – or try different modes like Defeat the Leader and Capture the Flag. With support for touch screen control and excellent of use of the two Nintendo DS screens, Disgaea has never played better. [NIS America]… Expand"}, {"name": "Lunar Knights", "details_link": "https://www.metacritic.com/game/ds/lunar-knights", "publisher": "Konami", "release_date": "Feb  6 2007", "developers": ["Kojima Productions"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/d79e1e78b8a356c7e0d1fae1cfdc7cf1-98.jpg", "descriptions": "Descend into the gothic Sci-Fi world of Lunar Knights and take control of two warriors on a quest to reclaim the world from the vampiric legion. Spin together tornados, guide down flaming meteors, and blow together snowstorms in Kojima Productions first ever title on the DS. Two differentDescend into the gothic Sci-Fi world of Lunar Knights and take control of two warriors on a quest to reclaim the world from the vampiric legion. Spin together tornados, guide down flaming meteors, and blow together snowstorms in Kojima Productions first ever title on the DS. Two different heroes with unique powers and weapons. In-game day/night cycle and weather affects gameplay. Use the touch pen to solve puzzles and guide your vehicle through 3D shooter mini games. [Konami]… Expand"}, {"name": "LEGO Star Wars: The Skywalker Saga", "details_link": "https://www.metacritic.com/game/playstation-5/lego-star-wars-the-skywalker-saga", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  5 2022", "developers": ["Warner Bros. Interactive Entertainment", "TT Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/b5ed96177567297760dbc65fc818ed7b-98.jpg", "descriptions": "LEGO Star Wars: The Skywalker Saga will feature hundreds of playable characters - the most ever for a LEGO Star Wars game - and ships, LEGO's signature sense of humour and fun, and new innovations, options, and gameplay features. Players can start the game at any point in the Star WarsLEGO Star Wars: The Skywalker Saga will feature hundreds of playable characters - the most ever for a LEGO Star Wars game - and ships, LEGO's signature sense of humour and fun, and new innovations, options, and gameplay features. Players can start the game at any point in the Star Wars timeline; fans can jump in with Star Wars: The Phantom Menace, begin the original trilogy with Star Wars: A New Hope, or launch right into Star Wars: The Rise of Skywalker.\r LEGO Star Wars: The Skywalker Saga marks the return to the franchise that kicked off the LEGO video game series. The game will give fans an all-new LEGO Star Wars experience with complete freedom to explore the LEGO Star Wars galaxy. With the Skywalker saga coming to an end, LEGO Star Wars: The Skywalker Saga will bring to life all those Star Wars adventures remembered and undiscovered in an epic culmination of all nine saga films as fans celebrate the closing of this chapter in Star Wars.… Expand"}, {"name": "Blasphemous", "details_link": "https://www.metacritic.com/game/xbox-one/blasphemous", "publisher": "Team17", "release_date": "Sep 10 2019", "developers": ["The Game Kitchen"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/cafc617ab6a2f4ae658e9234296e2c28-98.jpg", "descriptions": "Blasphemous is a punishing action-platformer that combines the fast-paced, skilled combat of a hack-n-slash game with a deep and evocative narrative core, delivered through exploration of a huge universe comprised of non-linear levels."}, {"name": "Hacknet", "details_link": "https://www.metacritic.com/game/pc/hacknet", "publisher": "Surprise Attack", "release_date": "Aug 12 2015", "developers": ["Orann"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Miscellaneous", "General"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/982c5b9cd7c384d39e54cfed5a1629ee-98.jpg", "descriptions": "Hacknet is a terminal-driven hacking game with competitive multiplayer, a fully internally-consistent network simulation and a realistic interface. It follows the story of recently deceased hacker \"Bit\", whose death may not be the 'accident' the media reports. You stand in for no one, asHacknet is a terminal-driven hacking game with competitive multiplayer, a fully internally-consistent network simulation and a realistic interface. It follows the story of recently deceased hacker \"Bit\", whose death may not be the 'accident' the media reports. You stand in for no one, as most games have you do - play for yourself, make your own decisions, and see the world react - if you're leaving a trace that is. Hacknet has no protagonist, other than the person using it. Don't be reckless though - it's more real than you think.… Expand"}, {"name": "The Walking Dead: Season Two Episode 3 - In Harm's Way", "details_link": "https://www.metacritic.com/game/xbox-360/the-walking-dead-season-two-episode-3---in-harms-way", "publisher": "Telltale Games", "release_date": "May 14 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["General", "Action", "Adventure", "General", "Point-and-Click"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/af22604439188af0a38b499657418608-98.jpg", "descriptions": "Consequences."}, {"name": "Test Drive Unlimited", "details_link": "https://www.metacritic.com/game/xbox-360/test-drive-unlimited", "publisher": "Atari", "release_date": "Sep  5 2006", "developers": ["Eden Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "8  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/f53b45cebdfd2bfec83850295e0011cf-98.jpg", "descriptions": "Test Drive Unlimited is the only game that immerses you into the car and bike enthusiast lifestyle, with total freedom to race however and wherever you want within a huge, online-persistent environment. Visit the most sophisticated car and bike dealers to purchase new vehicles or simply takeTest Drive Unlimited is the only game that immerses you into the car and bike enthusiast lifestyle, with total freedom to race however and wherever you want within a huge, online-persistent environment. Visit the most sophisticated car and bike dealers to purchase new vehicles or simply take them for a spin. Collect and trade rare performance parts and customize each vehicle to make it one-of-a-kind. Test Drive Unlimited challenges players online to experience the most exotic and fastest vehicles on more than 1000 miles of diverse Hawaiian roads. Gamers win races, challenges, missions and tournaments to earn credits and purchase new cars, bikes, rare performance parts, clothes, apparel, homes and garages. Features more than 125 licensed vehicles from exclusive manufacturers including Lamborghini, Ducati, Aston Martin, Mercedes, Saleen, Shelby, and Jaguar; Upgrade each car or bike with options from the actual manufacturers' catalog. Players create characters, buy new homes and garages, and tune and upgrade vehicles with aftermarket parts; Extracurricular activities such as expanding your garage, getting clothes and fashion accessories for your avatar, helping hitchhikers catch planes, picking up girls, chasing car thieves, and escaping from a psychopath. [Atari]… Expand"}, {"name": "Assassin's Creed Valhalla", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-valhalla", "publisher": "Ubisoft", "release_date": "Nov 10 2020", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/c288628242bec60f465b3c3d1a3a156d-98.jpg", "descriptions": "Build your own Viking Legend. Become Eivor, a Viking raider raised to be a fearless warrior, and lead your clan from icy desolation in Norway to a new home amid the lush farmlands of ninth-century England. Find your settlement and conquer this hostile land by any means to earn a place inBuild your own Viking Legend. Become Eivor, a Viking raider raised to be a fearless warrior, and lead your clan from icy desolation in Norway to a new home amid the lush farmlands of ninth-century England. Find your settlement and conquer this hostile land by any means to earn a place in Valhalla. England in the age of the Vikings is a fractured nation of petty lords and warring kingdoms. Beneath the chaos lies a rich and untamed land waiting for a new conqueror. Will it be you? Write Your Viking Saga. Blaze your own path across England with advanced RPG mechanics. Fight brutal battles, lead fiery raids or use strategy and alliances with other leaders to bring victory. Every choice you make in combat and conversation is another step on the path to greatness. Lead Epic Raids. Lead a crew of raiders and launch lightning-fast surprise attacks against Saxon armies and fortresses. Claim the riches of your enemies' lands for your clan and expand your influence far beyond your growing settlement. ENGAGE IN VISCERAL COMBAT. Unleash the ruthless fighting style of a Viking warrior as you dual-wield axes, swords, or even shields against relentless foes. Decapitate opponents in close-quarters combat, riddle them with arrows, or assassinate them with your Hidden Blade. Grow Your Settlement. Your clan's new home grows with your legend. Customise your settlement by building upgradable structures. Unlock new features and quests by constructing a barracks, a blacksmith, a tattoo parlour, and much more. Share Your Custom Raider. Recruit mercenary Vikings designed by other players or create and customise your own to share online. Sit back and reap the rewards when they fight alongside your friends in their game worlds. A Dark Age Open World. Sail across the icy North Sea to discover and conquer the broken kingdoms of England. Immerse yourself in activities like hunting and drinking games or engage in traditional Norse competitions like flyting – or, as it's better known, verbally devastating rivals through the art of the Viking rap battle. [Ubisoft]… Expand"}, {"name": "Tales of Monkey Island Chapter 3: Lair of the Leviathan", "details_link": "https://www.metacritic.com/game/pc/tales-of-monkey-island-chapter-3-lair-of-the-leviathan", "publisher": "Telltale Games", "release_date": "Sep 29 2009", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/b20499792cb98aa3deb220fe0a78b9f9-98.jpg", "descriptions": "In the third Tales of Monkey Island chapter, Guybrush gets in deep (literally!) as his quest for the voodoo exfoliating La Esponja Grande takes a scenic twist -- through the guts of a giant manatee! Trapped in the belly of the beast, our hero encounters a surprising band of castaways,In the third Tales of Monkey Island chapter, Guybrush gets in deep (literally!) as his quest for the voodoo exfoliating La Esponja Grande takes a scenic twist -- through the guts of a giant manatee! Trapped in the belly of the beast, our hero encounters a surprising band of castaways, including the long-lost (and obsessive-compulsive) explorer Coronado De Cava. Can the Mighty Pirate win the suspicious De Cava's trust? Will sexy pirate hunter Morgan LeFlay prove to be a ruthless enemy, or an unlikely ally? Will the group find La Esponja Grande in time to save Elaine from the rampant Pox of LeChuck? And will the world be crushed by the gnashing teeth of a certain demonic skull? Tales of Monkey Island's moist and absorbing third episode, Lair of the Leviathan, will answer some of these urgent questions -- and raise still more -- as the five month adventure builds to its epic climax. [Telltale Games]… Expand"}, {"name": "Gerda: A Flame in Winter", "details_link": "https://www.metacritic.com/game/pc/gerda-a-flame-in-winter", "publisher": "DONTNOD Entertainment", "release_date": "Sep  1 2022", "developers": ["PortaPlay"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/f26f25b4fa05b087c01851631e8aa0e7-98.jpg", "descriptions": "When the snow stops falling, the small Danish village of Tinglev will no longer be the same. Walk the path of Gerda as her quiet life is turned upside down during the World War 2 occupation of her home. Choose where to go, how to act, and who to trust in this intimate narrative RPG-liteWhen the snow stops falling, the small Danish village of Tinglev will no longer be the same. Walk the path of Gerda as her quiet life is turned upside down during the World War 2 occupation of her home. Choose where to go, how to act, and who to trust in this intimate narrative RPG-lite experience inspired by real life events.How far would you go to protect your loved ones?In this poignant story-driven game, you play as Gerda, a nurse whose life is turned upside down overnight. A tale told not on the front line, but in the intimate setting of the small Danish village she has lived her whole life. Armed only with her wits and knowledge of her people, Gerda must try to save her loved ones while staying true to herself.… Expand"}, {"name": "The Walking Dead: A Telltale Games Series - The Complete First Season", "details_link": "https://www.metacritic.com/game/playstation-vita/the-walking-dead-a-telltale-games-series---the-complete-first-season", "publisher": "Telltale Games", "release_date": "Aug 20 2013", "developers": ["Telltale Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "Compilation", "Compilation", "Point-and-Click"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/40f08f901231c2f7a98c0b33c4513dc5-98.jpg", "descriptions": "The Walking Dead is an award-winning vision of Robert Kirkman's global hit comic book series. Experience the true horror and emotional impact of being a survivor of the undead apocalypse in a zombie game unlike any other. You will meet people and experience events that will impact the storyThe Walking Dead is an award-winning vision of Robert Kirkman's global hit comic book series. Experience the true horror and emotional impact of being a survivor of the undead apocalypse in a zombie game unlike any other. You will meet people and experience events that will impact the story of Deputy Sheriff Rick Grimes, and you will be forced to make decisions that are not only tough, but that will have a direct effect on the story that you experience. The undead are everywhere, but they're not your only problem. Starvation, betrayal, heartbreak and more will challenge you as you attempt to survive in the world of The Walking Dead.… Expand"}, {"name": "Blur", "details_link": "https://www.metacritic.com/game/xbox-360/blur", "publisher": "Activision", "release_date": "May 25 2010", "developers": ["Bizarre Creations"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 20 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/dd54b5f42573dc0a84e55b57fcc71163-98.jpg", "descriptions": "Blur is a new style of powered-up racing. The game drops players into heart-pumping racing action with 20 cars on a track all targeting the finish line and battling each other as they trade paint and collect intense power-ups, including the ability to blast other cars out of the way withBlur is a new style of powered-up racing. The game drops players into heart-pumping racing action with 20 cars on a track all targeting the finish line and battling each other as they trade paint and collect intense power-ups, including the ability to blast other cars out of the way with huge bursts of energy, boost their speed, and more. Gamers can use offensive and defensive attacks as they battle for the lead and careen through real-world track locations ranging from L.A. and San Francisco to the streets of Hackney, UK and the treacherous roads of Barcelona, Spain. Beyond the action-packed racing filled with fast curves, sneaky alternate routes, hair-raising jumps and fully realized damage models that provide for spectacular crashes, Blur’s narrative is presented through Bizarre’s new community-based interface, reaching far beyond the game itself. This unique story-driving social network evolves dynamically as players compete in different races, make new friends, rivals and fans, and connect with other racers both in-game and in real life. Looking beyond Blur's single player story, gamers can engage in competitive and team-based multiplayer races with up to 20 players online, or on a single console via 4-player split-screen. Bizarre has also introduced Blur’s original social gaming experience - Custom Groups, where anyone can create unique multiplayer modes based on their favorite ways to play the game. These new modes are immediately shared through Blur’s social network, expanding the game in ways that are only limited by the gaming community’s creativity. [Activision]… Expand"}, {"name": "FIFA 15", "details_link": "https://www.metacritic.com/game/xbox-one/fifa-15", "publisher": "Electronic Arts", "release_date": "Sep 23 2014", "developers": ["EA Sports"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Xbox One"], "num_players": "Up to 22 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim"], "meta_score": 82, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/61a3915d888837e58091ff4b81b0c62c-98.jpg", "descriptions": "New to this year's installment, players have memories and will show emotion based on the context of the match. With over 600 new emotional reactions, players now respond to pivotal moments on the pitch – bad tackles, missed chances, epic goals - as they would in real life.  RefinedNew to this year's installment, players have memories and will show emotion based on the context of the match. With over 600 new emotional reactions, players now respond to pivotal moments on the pitch – bad tackles, missed chances, epic goals - as they would in real life.  Refined commentary highlights unique fan reactions, while chants and behaviors will be relevant to country or even your club. New bench reactions, side line character animations, 10-man goal celebrations, and more will strive to keep you engaged in the story of the match. Your teammates and opponents now recognize what’s happening in the match and will adjust their tactics just like real players.… Expand"}, {"name": "Neverwinter Nights 2: Mask of The Betrayer", "details_link": "https://www.metacritic.com/game/pc/neverwinter-nights-2-mask-of-the-betrayer", "publisher": "Atari", "release_date": "Oct  9 2007", "developers": ["Obsidian Entertainment"], "platforms": "PC", "num_players": "4  Online", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/44b6ffee7802fa6b64ba7ac6b6349035-98.jpg", "descriptions": "In Neverwinter Nights 2: Mask of the Betrayer, players are transported back to the Forgotten Realms shortly after the events detailed in the original Neverwinter Nights 2. Following the climactic battle against the King of Shadows, the player awakens alone and stranded deep beneath theIn Neverwinter Nights 2: Mask of the Betrayer, players are transported back to the Forgotten Realms shortly after the events detailed in the original Neverwinter Nights 2. Following the climactic battle against the King of Shadows, the player awakens alone and stranded deep beneath the earth. Surrounded by a horde of evil spirits, the player embarks on an epic adventure that reveals his true destiny. Set in harsh, spirit-rich Rashemen, near the powerful nation of Thay, Neverwinter Nights 2: Mask of the Betrayer presents players with an exciting new campaign; epic levels; dozens of new feats and spells; new races, base classes and prestige classes; new companions; new weapons, armor and crafting options; hordes of new monsters; and enhanced modding tools. [Atari]… Expand"}, {"name": "Need for Speed Most Wanted", "details_link": "https://www.metacritic.com/game/playstation-2/need-for-speed-most-wanted", "publisher": "Electronic Arts", "release_date": "Nov 15 2005", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 82, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/5/054cfab8332036272883c5b7923c15a1-98.jpg", "descriptions": "Combining the thrill of illicit street racing and tuner customization with the intensity of strategic police pursuits that rivals any Hollywood-style chase scene, Need for Speed Most Wanted challenges players to become the most notorious and elusive street racer. Players instantly feel theCombining the thrill of illicit street racing and tuner customization with the intensity of strategic police pursuits that rivals any Hollywood-style chase scene, Need for Speed Most Wanted challenges players to become the most notorious and elusive street racer. Players instantly feel the thrill of the ride as they hit the streets in an open world environment where drivers can tune their cars to compete against any class of vehicles or use their wits to out-fox the law to satisfy their need for speed. Need for Speed Most Wanted delivers a unique, fast-paced and gripping ride in the racing genre as players build up their Rap Sheet and street cred to move their way up the Black List to become the most wanted racer on the streets. Players go head-to-head with the top drivers on the scene as well as strategically evade more than half dozen cops at any one time. Also included are a dynamic open world, new gameplay and customization as well as tuners, supercars, muscles and sports cars. [Electronic Arts]… Expand"}, {"name": "Sins of a Solar Empire: Rebellion", "details_link": "https://www.metacritic.com/game/pc/sins-of-a-solar-empire-rebellion", "publisher": "Stardock", "release_date": "Jun 12 2012", "developers": ["Ironclad Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/eedb1a712dd4027bac589ecd6776e886-98.jpg", "descriptions": "The time of Diplomacy is now over. The length of the war and differing opinions on what should be done to bring the war to an end has led to a splintering of the groups involved. The controlling powers-that-be have exhausted arsenals and seem to have spent all efforts of diplomacy. TrappedThe time of Diplomacy is now over. The length of the war and differing opinions on what should be done to bring the war to an end has led to a splintering of the groups involved. The controlling powers-that-be have exhausted arsenals and seem to have spent all efforts of diplomacy. Trapped in a stalemate, sub-factions have rebelled and split off from the main alignments. Rebellion is upon us.… Expand"}, {"name": "Broken Sword: The Sleeping Dragon", "details_link": "https://www.metacritic.com/game/pc/broken-sword-the-sleeping-dragon", "publisher": "The Adventure Company", "release_date": "Nov 17 2003", "developers": ["Revolution Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/adfa918d97a28328ade9d3bdfcf13cca-98.jpg", "descriptions": "The murder of an underground hacker in Paris is just the beginning of this extraordinary adventure for George Stobbart and Nico Collard in the highly anticipated Broken Sword III. Powerful seismic events are shaking the world. An Ancient Conspiracy, the Secrets of the Templars, and aThe murder of an underground hacker in Paris is just the beginning of this extraordinary adventure for George Stobbart and Nico Collard in the highly anticipated Broken Sword III. Powerful seismic events are shaking the world. An Ancient Conspiracy, the Secrets of the Templars, and a fiendish source of pure Evil are responsible... [The Adventure Company]… Expand"}, {"name": "Age of Wonders: Shadow Magic", "details_link": "https://www.metacritic.com/game/pc/age-of-wonders-shadow-magic", "publisher": "Gathering", "release_date": "Jul 25 2003", "developers": ["Triumph Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 82, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/4/5e47cd49e4ef2bd4eae864b70db9f1c8-98.jpg", "descriptions": "Age of Wonders: Shadow Magic takes the acclaimed fantasy strategy series to new heights. This new stand-alone game enhances the series' praised fusion of empire building, role-playing and tactical combat with the eerie Shadow World and battle with races never before seen, across new andAge of Wonders: Shadow Magic takes the acclaimed fantasy strategy series to new heights. This new stand-alone game enhances the series' praised fusion of empire building, role-playing and tactical combat with the eerie Shadow World and battle with races never before seen, across new and diverse landscapes. Combined with the option of creating a totally unique environment with the map editor and rewriting the history of this world through the enhanced campaign editor, you are ensured a constant stream of completely new game experiences. [Gathering of Developers]… Expand"}, {"name": "ATV Offroad Fury 2", "details_link": "https://www.metacritic.com/game/playstation-2/atv-offroad-fury-2", "publisher": "SCEA", "release_date": "Nov  9 2002", "developers": ["Rainbow Studios"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/7d313357e26353cb7db9543f3d08b46a-98.jpg", "descriptions": "Race anywhere, anytime as you gun your ATV to the finish line. Is that a rocky mountain in your path? Take it on. Stuck by some thick woods? Play through them. With more than 20 all new ATVs, 40 offroad environments, mini-games, seven race modes and even online play, ATV Offroad Fury 2Race anywhere, anytime as you gun your ATV to the finish line. Is that a rocky mountain in your path? Take it on. Stuck by some thick woods? Play through them. With more than 20 all new ATVs, 40 offroad environments, mini-games, seven race modes and even online play, ATV Offroad Fury 2 challenges you to conquer the terrain against top riders through massive, stunning environments. But don't get caught watching the beautiful scenery. The mountains won't have mercy on you ... and neither will the competition. [SCEA]… Expand"}, {"name": "Mega Man Zero", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-zero", "publisher": "Capcom", "release_date": "Sep  9 2002", "developers": ["Inti"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/52b981eb62389cc4dc199253e4a8d9ef-98.jpg", "descriptions": "It's your mission to help the exiled scientist Ciel discover the source of a new reploid energy! Play as Mega Man's pal Zero, the reploid from the Mega Man X series turned good by the infectious Sigma Virus and 100 years of sleep. Conquer your adversaries and find the energy source... orIt's your mission to help the exiled scientist Ciel discover the source of a new reploid energy! Play as Mega Man's pal Zero, the reploid from the Mega Man X series turned good by the infectious Sigma Virus and 100 years of sleep. Conquer your adversaries and find the energy source... or risk ultimate defeat. It's up to you to defend good from the destructive powers in the universe.… Expand"}, {"name": "SOCOM: U.S. Navy SEALs", "details_link": "https://www.metacritic.com/game/playstation-2/socom-us-navy-seals", "publisher": "SCEA", "release_date": "Aug 27 2002", "developers": ["Zipper Interactive"], "platforms": "PlayStation 2", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/3c17e583c1990d78a393f933dcaa2ac6-98.jpg", "descriptions": "SOCOM: U.S. Navy SEALs places you in the role of an elite SEAL commander whose team is asked to fight terrorists in more than 12 of the most deadly missions ever. Engage enemy terrorists with fellow SEAL team members via intense team-based gameplay. Utilize the SOCOM headset to communicateSOCOM: U.S. Navy SEALs places you in the role of an elite SEAL commander whose team is asked to fight terrorists in more than 12 of the most deadly missions ever. Engage enemy terrorists with fellow SEAL team members via intense team-based gameplay. Utilize the SOCOM headset to communicate and plan strategies with fellow SEALs in single player and online play.… Expand"}, {"name": "Tom Clancy's Ghost Recon: Desert Siege", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-ghost-recon-desert-siege", "publisher": "Ubisoft", "release_date": "Mar 27 2002", "developers": ["Red Storm Entertainment"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 82, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/24fc8bd01b7f3bf041c6d6d22f21e0c8-98.jpg", "descriptions": "East Africa, 2009. A 60-year conflict boils over as Ethiopia invades its smaller neighbor Eritrea, threatening the world's most vital shipping lanes in the Red Sea. An elite team of U.S. Army Green Berets, known as the Ghosts, moves in to safeguard the seas and free Eritrea. As the war ragesEast Africa, 2009. A 60-year conflict boils over as Ethiopia invades its smaller neighbor Eritrea, threatening the world's most vital shipping lanes in the Red Sea. An elite team of U.S. Army Green Berets, known as the Ghosts, moves in to safeguard the seas and free Eritrea. As the war rages on, the Ghosts are drawn from Eritrea's shores to the heart of Ethiopia in their deadliest battles yet. [Ubi Soft]… Expand"}, {"name": "Warlords Battlecry II", "details_link": "https://www.metacritic.com/game/pc/warlords-battlecry-ii", "publisher": "Ubisoft", "release_date": "Mar 11 2002", "developers": ["Strategic Studies Group"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/760f125a589a68228e095ee6553b60bd-98.jpg", "descriptions": "Experience a unique combination of role-playing heroes and real-time strategy game play. Build Hero warriors in the Warlord's fantasy world of Etheria and develop them into unique classes such as Death Knight, Assassin or Ice Mage. A new single player campaign delivers 12 unique sides, newExperience a unique combination of role-playing heroes and real-time strategy game play. Build Hero warriors in the Warlord's fantasy world of Etheria and develop them into unique classes such as Death Knight, Assassin or Ice Mage. A new single player campaign delivers 12 unique sides, new terrain and new magical effects. Create multiple heroes and track their courage in the single player campaign or over the Internet. [Ubi Soft]… Expand"}, {"name": "Ring of Red", "details_link": "https://www.metacritic.com/game/playstation-2/ring-of-red", "publisher": "Konami", "release_date": "Mar 12 2001", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Sci-Fi"], "meta_score": 82, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/9c8869608a3740a6e6de9d5ee88bcaaf-98.jpg", "descriptions": "A highly classified prototype mech was stolen from the allied forces in southern Japan and it's up to you to get it back! Take control of monstrous mechs and brave soldiers. Immerse yourself in detailed 3D battle sequences with an exciting style of gameplay that mixes in-depth strategy andA highly classified prototype mech was stolen from the allied forces in southern Japan and it's up to you to get it back! Take control of monstrous mechs and brave soldiers. Immerse yourself in detailed 3D battle sequences with an exciting style of gameplay that mixes in-depth strategy and real-time action as you lead the allies to victory.… Expand"}, {"name": "Sairento VR", "details_link": "https://www.metacritic.com/game/playstation-4/sairento-vr", "publisher": "Mixed Realms Pte Ltd", "release_date": "Jul 10 2019", "developers": ["Mixed Realms Pte Ltd"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 82, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/f86ae79fdad0c91c2a1acaa841104b5b-98.jpg", "descriptions": null}, {"name": "Football Manager Live", "details_link": "https://www.metacritic.com/game/pc/football-manager-live", "publisher": "Sega", "release_date": "Jan 23 2009", "developers": ["Sports Interactive"], "platforms": "PC", "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 82, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/7/e509ea530de4fd1c4038e8e375907edb-98.jpg", "descriptions": "Football Manager Live is a brand new game from Sports Interactive, the creators of the popular Football Manager series. It is a combination of Fantasy Football, Auction sites, Social Networking and the Football Manager concept all rolled into one. Buy now for these great benefits...CreateFootball Manager Live is a brand new game from Sports Interactive, the creators of the popular Football Manager series. It is a combination of Fantasy Football, Auction sites, Social Networking and the Football Manager concept all rolled into one. Buy now for these great benefits...Create and manage YOUR very own football club - YOU create your team name, colours, badge & home ground and YOU decide which players to sign. Choose your own dream team - Take your pick from Sports Interactive's world famous database of over 330,000 footballers, tailored to your part of the globe. Show the world how good you are - Play against your mates or other managers from around the globe in a gameworld that's LIVE and online 24 hours a day, 7 days a week. Choose from over 10 official associations - Choose the league that suits both your play time and style and work your way to the top. Develop your club - Use the innovative skill system to develop and improve your managerial style; unlock bonuses that will give you the edge. Exchange banter with other managers via the in-game chat facility - Will their mind games affect you? Play the game your way - The AI/Stand in manager takes control of your matches when you're not online. Wheel and deal on the transfer market - Buy, sell, loan and exchange players in the lively transfer market, or snap up some talent with the exciting new auction system. Create and run your own mini-leagues and cup competitions - Take on the best or compete for bragging rights against your mates. Balance the books - YOU have control over the financial running of your club. Will you sign your favourite superstar footballer or invest in a youth system for long term stability? Manage matches live - If a game's not going your way, change tactics on-the-fly from the virtual dugout. Will YOU take the glory? [Sports Interactive]… Expand"}, {"name": "Prey: Mooncrash", "details_link": "https://www.metacritic.com/game/xbox-one/prey-mooncrash", "publisher": "Bethesda Softworks", "release_date": "Jun 10 2018", "developers": ["Arkane Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Role-Playing", "Shooter", "Action RPG", "First-Person", "Arcade"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/456649f356525eb4cee536ef39db89e7-98.jpg", "descriptions": "Fight overwhelming odds to escape a secret TranStar moon base where the enemies you encounter, the hazards you face, the goals you complete, and the loot you collect are different each time you play. With changing environments as dangerous as they are dynamic, the Mooncrash campaign for PreyFight overwhelming odds to escape a secret TranStar moon base where the enemies you encounter, the hazards you face, the goals you complete, and the loot you collect are different each time you play. With changing environments as dangerous as they are dynamic, the Mooncrash campaign for Prey will offer a fun, infinitely replayable challenge to test even the most skilled players.Story:In Prey: Mooncrash, TranStar's secret moon base stopped transmitting shortly after the events of Prey. Now Peter, a hacker stationed aboard a spy satellite tasked with intercepting TranStar communications, must find out why. Trapped and under a ruthless contract with KASMA Corp, Peter's only hope of ever seeing his family again is uncovering the moon base's lost secrets.Features:Live. Die. Adapt. Escape!Escape TranStar's moon base before the Typhon threat takes over. A simple goal, but one with hundreds of viable solutions. In Mooncrash, players will experience an all-new, infinitely replayable, 'rogue-lite' campaign with ever-changing enemies, weapons and objectives against a constantly increasing alien threat. Survive How You Want with Who You WantUnlock multiple characters as you play, each with their own set of specialized, upgradable skills. Will you forge your path with the resourceful engineer Joan, trade that wrench in for Security Officer Bhatia and his shotgun, or will you choose the frail-but-gifted Andrius and his arsenal of psychic abilities? Prey is about choices, and those choices belong to you. Search for Secrets, Lootand a Way OffArkane Studios' talent for detail and story-rich environments comes alive in Mooncrash. As you explore the station, which is the same size and scope of four levels of the original game's Talos I station, don't forget to keep your eyes peeled for precious supplies and, of course, Mimics.New Challenges, New SolutionsThe Typhon threat has returned with familiar foes and tough new enemies, each armed with a unique set of deadly characteristics. Use the full power of the arsenal at your disposal, including popular weapons and abilities from Prey's main game, to fight for your life and make a mad dash for your escape. Prey: Typhon HunterMooncrash includes Prey: Typhon Hunter, an online multiplayer update. Typhon Hunter is a lethal game of hide-and-seek between a single survivor (Morgan Yu) and five other players who stalk, hunt, and hide in plain sight as shape-shifting Mimic aliens. Every object is a potential enemy. Will Morgan or the Mimics prevail?TranStar VR is a single player VR-only campaign included in the Typhon Hunter update. This campaign puts you in the shoes of various TranStar employees as you complete objectives and solve intricate puzzles on Talos I, just days before the events of Prey.Requires the Prey full game.… Expand"}, {"name": "The Walking Dead: Season Two Episode 2 - A House Divided", "details_link": "https://www.metacritic.com/game/playstation-3/the-walking-dead-season-two-episode-2---a-house-divided", "publisher": "Telltale Games", "release_date": "Mar  4 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["General", "Action", "Adventure", "General", "Point-and-Click"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/11d0a9b4661e40a75df1dd93e250208e-98.jpg", "descriptions": "Season Two continues the story that began in Season One. You are Clementine, a young survivor in a world gone to hell. The dead have risen to feast on the living, and the living cannot be trusted.\r The story you experience in The Walking Dead Season Two is driven by the choices that youSeason Two continues the story that began in Season One. You are Clementine, a young survivor in a world gone to hell. The dead have risen to feast on the living, and the living cannot be trusted.\r The story you experience in The Walking Dead Season Two is driven by the choices that you make. Because of that, your story could be very different from someone else’s. If you played Season One and the DLC episode ‘400 Days’, the choices you made there will affect Season Two.… Expand"}, {"name": "Marvel: Ultimate Alliance", "details_link": "https://www.metacritic.com/game/pc/marvel-ultimate-alliance", "publisher": "Activision", "release_date": "Oct 24 2006", "developers": ["Raven Software"], "platforms": ["PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/604af7266c2df84b8476c3f74d28f146-98.jpg", "descriptions": "Marvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine theMarvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine the fate of both planet Earth and the Marvel universe – revealed in one of multiple epilogues. Marvel: Ultimate Alliance offers total team customization, where players create their own team name, icon and vehicle, as well as establish their team reputation as they play throughout the story.  Gamers also have the option to level up each character individually to their liking, or all team members at the same time to keep their heroes balanced.  With the game's new combat system, players battle against the world's most notorious Marvel Super Villains in the air, underwater, and on the ground, using grappling, blocking and dodging moves, by charging up their Super Hero powers before unleashing them, and using environmental objects as one and two-handed weapons. Marvel:  Ultimate Alliance features a storyline where the missions players accept, the objectives they complete, and their interactions with other characters throughout the game directly impact how the story plays out. The game also features a robust multiplayer component where fans can band together with friends as their favorite Marvel Super Heroes, and fight evil in both on and offline cooperative story modes.  There's also a Competitive Mode where the game tracks various in-game stats so players can see how well they stack up against one another – affecting the amount of experience points earned and how equipment is distributed. [Activision]… Expand"}, {"name": "Metro Exodus", "details_link": "https://www.metacritic.com/game/pc/metro-exodus", "publisher": "Deep Silver", "release_date": "Feb 15 2019", "developers": ["4A Games"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/5da9df0cf0d238e35307e3313b9a03e1-98.jpg", "descriptions": "In Metro Exodus, Artyom and a band of survivors must flee the shattered ruins of the Moscow Metro and embark on an epic, continent-spanning journey across the post-apocalyptic Russian wilderness. Explore vast, non-linear levels, lose yourself in an immersive, sandbox survival experience, andIn Metro Exodus, Artyom and a band of survivors must flee the shattered ruins of the Moscow Metro and embark on an epic, continent-spanning journey across the post-apocalyptic Russian wilderness. Explore vast, non-linear levels, lose yourself in an immersive, sandbox survival experience, and follow a story-line that spans an entire year in the greatest Metro adventure yet. [Deep Silver]… Expand"}, {"name": "Darksiders", "details_link": "https://www.metacritic.com/game/playstation-3/darksiders", "publisher": "THQ", "release_date": "Jan  5 2010", "developers": ["Vigil Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/7c21cfa45d7b25996e5752b9ce4784af-98.jpg", "descriptions": "Penned by legendary comic book artist Joe Madureira (X-Men, Battle Chasers, The Ultimates), Darksiders is set in a Post-Apocalyptic demon-ravaged world where evil forces have prematurely brought about the end of the time. Originally sent to oversee the destruction of Earth, the Four HorsemenPenned by legendary comic book artist Joe Madureira (X-Men, Battle Chasers, The Ultimates), Darksiders is set in a Post-Apocalyptic demon-ravaged world where evil forces have prematurely brought about the end of the time. Originally sent to oversee the destruction of Earth, the Four Horsemen of the Apocalypse have been betrayed by their master, stripped of their powers and cast down to Earth. Players take on the role of WAR -- the first of the Four Horsemen -- as he embarks on a brutal quest of vengeance and revenge against the forces that betrayed him with the help of his phantom steed RUIN. The first title from new THQ studio Vigil Games, Darksiders: Wrath of War features open-world exploration, a deep combat system and a huge arsenal of modern and mythical weapons. [THQ]… Expand"}, {"name": "The Talos Principle: Road To Gehenna", "details_link": "https://www.metacritic.com/game/pc/the-talos-principle-road-to-gehenna", "publisher": "Devolver Digital", "release_date": "Jul 23 2015", "developers": ["Croteam"], "platforms": "PC", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/917d3c0e1254137120ee386c68348107-98.jpg", "descriptions": "The Talos Principle: Road to Gehenna follows the narrative of Uriel, Elohim's messenger, as he explores a strange, hidden part of the simulation on a mission of mercy and redemption in an attempt to free the souls of the damned at all costs.\r This substantial expansion consists of fourThe Talos Principle: Road to Gehenna follows the narrative of Uriel, Elohim's messenger, as he explores a strange, hidden part of the simulation on a mission of mercy and redemption in an attempt to free the souls of the damned at all costs.\r This substantial expansion consists of four episodes that take experienced players through some of the most advanced and challenging puzzles yet. The Talos Principle writers Tom Jubert and Jonas Kyratzes have returned to pen the expansion and show players an entirely different side of Elohim's world through a journey to Gehenna filled with new characters and a new society with its own history and philosophy.… Expand"}, {"name": "Lara Croft and the Guardian of Light", "details_link": "https://www.metacritic.com/game/pc/lara-croft-and-the-guardian-of-light", "publisher": "Square Enix", "release_date": "Sep 28 2010", "developers": ["Crystal Dynamics", "Nixxes Software"], "platforms": ["iPhone/iPad", "PlayStation 3", "Stadia", "Xbox 360", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Adventure", "General", "General"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/0362952369bf0a28ffd83aa8b42967b1-98.jpg", "descriptions": "Lara Croft and the Guardian of Light is the first ever downloadable, co-op action/adventure game featuring Lara Croft. This brand extension incorporates the hallmarks of the Tomb Raider franchise including exploration, discovery, platforming, and puzzle solving. Lara Croft and the GuardianLara Croft and the Guardian of Light is the first ever downloadable, co-op action/adventure game featuring Lara Croft. This brand extension incorporates the hallmarks of the Tomb Raider franchise including exploration, discovery, platforming, and puzzle solving. Lara Croft and the Guardian of Light allows players to experience Lara Croft from an isometric viewpoint, and combines new gameplay features such as character progression, fun fast-paced combat, and elements of cooperation and competition. Lara Croft and the Guardian of Light will be available to download this summer.… Expand"}, {"name": "The Outer Worlds", "details_link": "https://www.metacritic.com/game/pc/the-outer-worlds", "publisher": "Obsidian Entertainment", "release_date": "Oct 25 2019", "developers": ["Obsidian Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/e3f8d6ecaeec09fc7c765e571f9fa579-98.jpg", "descriptions": "The Outer Worlds is a new single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division. Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening toThe Outer Worlds is a new single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division. Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening to destroy the Halcyon colony. As you explore the furthest reaches of space and encounter various factions, all vying for power, the character you decide to become will determine how this player-driven story unfolds. In the corporate equation for the colony, you are the unplanned variable.… Expand"}, {"name": "Stellaris: Utopia", "details_link": "https://www.metacritic.com/game/pc/stellaris-utopia", "publisher": "Paradox Interactive", "release_date": "Apr  6 2017", "developers": ["Paradox Development Studio"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Strategy", "Real-Time", "General"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/0ea79a2cbc43be1fa8f1a19201d3428b-98.jpg", "descriptions": "Build a Better Space Empire in Stellaris: Utopia. The stars have called you for millennia and now you walk among them. A universe of possibilities is open to your species as it takes its first fitful steps into the great unknown. Here you can turn your back on the divisive politics of theBuild a Better Space Empire in Stellaris: Utopia. The stars have called you for millennia and now you walk among them. A universe of possibilities is open to your species as it takes its first fitful steps into the great unknown. Here you can turn your back on the divisive politics of the home planet. Here you can build something new. Here you can unify your people and build that perfect society.… Expand"}, {"name": "Tales From The Borderlands: Episode 1 - Zer0 Sum", "details_link": "https://www.metacritic.com/game/xbox-one/tales-from-the-borderlands-episode-1---zer0-sum", "publisher": "Telltale Games", "release_date": "Nov 26 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "Adventure", "General"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/4e0dc6463c2f0dedbc28c366753fc982-98.jpg", "descriptions": "Set following the events seen in Borderlands 2, Tales from the Borderlands focuses on Rhys, a Hyperion company man who wants to become the next Handsome Jack, and it’s also about Fiona, a Pandoran con artist intending to score the biggest of all swindles. Baited into danger by a Vault keySet following the events seen in Borderlands 2, Tales from the Borderlands focuses on Rhys, a Hyperion company man who wants to become the next Handsome Jack, and it’s also about Fiona, a Pandoran con artist intending to score the biggest of all swindles. Baited into danger by a Vault key and all it promises, the unlikely pair are thrown together with a common purpose and a great amount of mistrust. Who is speaking the truth, and why is it important? That is for you to decide. It’s important to remember that there *are* two sides to every story, and you will tell this tale, or…tales, through the choices that you make. Your every decision as both Rhys and Fiona will affect the people and environment around you: this is a game where YOU are the final author in a brand new Borderlands story set on the unforgiving world of Pandora. [Telltale Games]… Expand"}, {"name": "Aquaria", "details_link": "https://www.metacritic.com/game/pc/aquaria", "publisher": "Bit Blot", "release_date": "Dec  7 2007", "developers": ["Bit Blot"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/3062de29f9037e11eb79f2a44b2f4584-98.jpg", "descriptions": "A massive ocean world, teeming with life and filled with ancient secrets. Join Naija, a lone underwater dweller in search of her family, as she explores the depths of Aquaria. She'll travel from hidden caves, shrouded in darkness, to beautiful, sunlit oases, all lovingly handcrafted by itsA massive ocean world, teeming with life and filled with ancient secrets. Join Naija, a lone underwater dweller in search of her family, as she explores the depths of Aquaria. She'll travel from hidden caves, shrouded in darkness, to beautiful, sunlit oases, all lovingly handcrafted by its two creators. Naija's story, narrated fully with voice overs, will become yours, as you join her on this magnificent adventure. Naija has the gift of the Verse. By singing songs, she can weave this force to change the waters around her. With each song Naija learns comes new abilities. With powerful songs, Naija is able to change form, giving players many options as to how to play the game. And with Aquaria's intuitive mouse-only control system, it's as easy to make Naija swim gracefully through the waters as it is to have her sing, cast spells, and engage in combat with the numerous dangerous creatures that inhabit Aquaria's waters. [Bit Blot]… Expand"}, {"name": "Need for Speed: Underground", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-underground", "publisher": "Electronic Arts", "release_date": "Nov 17 2003", "developers": ["Black Box", "EA Black Box"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/f73749f7279cbf08e1bbcebe77dc3877-98.jpg", "descriptions": "Enter the world of urban street racing and high performance tuner cars with the latest title in the hit Need for Speed series: Need for Speed Underground. Take on today's most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, building the ultimate street machine byEnter the world of urban street racing and high performance tuner cars with the latest title in the hit Need for Speed series: Need for Speed Underground. Take on today's most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, building the ultimate street machine by earning cash to pay for custom body kits and a host of licensed car performance mods. But just creating a custom street racing machine will not get you to the top; it takes a certain amount of attitude and razor sharp driving skills to compete in the tough world of urban racing. A number of diverse events set in gritty, nighttime environments make up the heart of street competition. Players become complete street racers by perfecting skills in each event by nailing the perfect shift in drag racing and by putting their street cred on the line, racing through the city streets at all hours of the night. Prove you belong in the elite street racing circles, work your way up the underground rankings and take on the best of the best in each discipline. [Electronic Arts]… Expand"}, {"name": "Bloodstained: Curse of the Moon 2", "details_link": "https://www.metacritic.com/game/switch/bloodstained-curse-of-the-moon-2", "publisher": "Inti Creates", "release_date": "Jul 10 2020", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/0b22011970c4ecd06b2e85dbed6a650e-98.jpg", "descriptions": "Koji Igarashi and Inti Creates are back with more retro sword-and-whip action!\r Curse of the Moon 2 brings classic 2D action and a dark, 8-Bit aesthetic together with modern playability. The multi-scenario structure of the previous title returns with an epic new story supervised by IGAKoji Igarashi and Inti Creates are back with more retro sword-and-whip action!\r Curse of the Moon 2 brings classic 2D action and a dark, 8-Bit aesthetic together with modern playability. The multi-scenario structure of the previous title returns with an epic new story supervised by IGA (Koji Igarashi) himself. \r\rPlayers take control of Zangetsu, a swordsman from the far east who bears a deep grudge against demonkind and the alchemists who summoned them. Zangetsu must battle his way to the demonic stronghold, but he doesn't have to do it alone! Zangetsu can ally himself with a brand new cast of characters he meets along the way and add them to the playable roster. Each new character adds a variety of gameplay options, abilities, and ways to complete the game's many stages. \r\rGame Flow\rBattle through stages filled with fearsome enemies and dangerous traps, each with a massive boss waiting at the end. A chance encounter with a potential ally awaits you after defeating a boss. Will they serve as a trustworthy partner on your perilous journey?\r Increase Combat Abilities\rYou can instantaneously switch between allies you have recruited at any time! Allies have their own life bars, so with each ally you recruit, you're survivability is greatly increased! \r\rShortcuts that Only Allies Can Access\rAllies have special, unique abilities which allow them to use shortcuts to skip parts of stages or access new areas! There are no special items obtainable by taking the long way around, so take every shortcut you can find! If your allies are out of commission, you'll have to take longer routes, where stronger enemies await! When your life gets low, be sure to switch then out so they'll be available when you need them.\r Multiple Episodes\rThe story is told over the course of multiple episodes. Only the first episode is accessible at the beginning, but more episodes will unlock as you progress through the game. The events that unfold in each episode continue into the next one, so be sure to unlock all the episodes to see the true ending. \r\rCurse of the Moon 2 had two play styles, \"Veteran\" and \"Casual\". \r\rVeteran Style\rChoose \"Veteran\" style to experiment a difficulty reminiscent of older games. An enemy's sttack knocks the player to their death...something very familiar to retro game fans. \r\rCasual Style\rEven if you're a fan of challenging games, sometimes you just want to take it easy! Casual mode is perfect for times like that. On Casual Style, things are more forgiving. Attacks don't knock the player back and lives are unlimited, alongside other changes. \r\rChanging Style\rStyle can be changed when starting a game, loading a save file, or on the Game Over screen.… Expand"}, {"name": "Super Puzzle Fighter II Turbo HD Remix", "details_link": "https://www.metacritic.com/game/playstation-3/super-puzzle-fighter-ii-turbo-hd-remix", "publisher": "Capcom", "release_date": "Aug 30 2007", "developers": ["Backbone Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/8c980bd5ba3816a3cc5ae7ea78f32cb0-98.jpg", "descriptions": "[Downloadable Game]  Super Puzzle Fighter II Turbo HD Remix downloads Capcom's popular puzzle game into the new generation. The new version of the game features newly created 1080p HD graphics, several new game modes, improved game balance, new stage backgrounds courtesy of Udon[Downloadable Game]  Super Puzzle Fighter II Turbo HD Remix downloads Capcom's popular puzzle game into the new generation. The new version of the game features newly created 1080p HD graphics, several new game modes, improved game balance, new stage backgrounds courtesy of Udon Entertainment and online play. [Capcom]… Expand"}, {"name": "TrackMania Sunrise", "details_link": "https://www.metacritic.com/game/pc/trackmania-sunrise", "publisher": "Enlight Software", "release_date": "May  6 2005", "developers": ["Nadeo"], "platforms": "PC", "num_players": "32  Online", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/446faacee0edbf054c5a702e6b2b7119-98.jpg", "descriptions": "The high octane, free wheeling insanity that is Trackmania returns to PC CDROM. Trackmania Sunrise takes everything that made the original an instant online classic ? amazing speed, ultra competitive multiplayer races and easily accessible tools to create and distribute outrageous tracks ?The high octane, free wheeling insanity that is Trackmania returns to PC CDROM. Trackmania Sunrise takes everything that made the original an instant online classic ? amazing speed, ultra competitive multiplayer races and easily accessible tools to create and distribute outrageous tracks ? and still manages to add more and more. New sports cars that burn up the highways at a breathtaking 400kph as they tear around gorgeous new environments including the beauty of the Pacific Coast. The most insane stunt blocks ever, send perilous track building to a whole new level with sweeping bends, winding tunnels and ramps designed to send you soaring. Two new play modes ? Platform and Crazy ? mean that even the most experienced of trackmaniacs will face a totally fresh racing experience. A new day has dawned? are you up for the challenge? [Digital Jesters]… Expand"}, {"name": "The Life and Suffering of Sir Brante", "details_link": "https://www.metacritic.com/game/pc/the-life-and-suffering-of-sir-brante", "publisher": "101XP", "release_date": "Mar  4 2021", "developers": ["Sever"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Text"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/c6fc5f286e31f3d258385f82e95e2712-98.jpg", "descriptions": "A narrative-driven RPG set in a gritty world where a person's Lot is determined at birth, while the gods are real and preside over the fates of men. Set out on a lifelong journey and carve out your own destiny. Will you become a judge, an inquisitor, or conspire against the old order? You decide!"}]