[{"name": "Scourge: Outbreak", "details_link": "https://www.metacritic.com/game/xbox-360/scourge-outbreak", "publisher": "UFO Interactive", "release_date": "Jul  3 2013", "developers": ["Tragnarion Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 40, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/0d87f4e8f0070552e64b655f53be91fe-98.jpg", "descriptions": "Gun your way through Nogari Island as Echo Squad, a group of mercenaries employed by the Tarn Initiative to end Nogari Corporation's firm grip on the world's weak governments. Utilize a lethal variety of weapons and unique abilities to pummel everything that stands in your path, as you yearnGun your way through Nogari Island as Echo Squad, a group of mercenaries employed by the Tarn Initiative to end Nogari Corporation's firm grip on the world's weak governments. Utilize a lethal variety of weapons and unique abilities to pummel everything that stands in your path, as you yearn to learn the sinister truth behind Nogari's \"Ambrosia\" fuel technology. The game features a Co-op enabled Campaign for up to four players, in addition to a series of eight Player Versus multiplayer modes.… Expand"}, {"name": "MotionSports", "details_link": "https://www.metacritic.com/game/xbox-360/motionsports", "publisher": "Ubisoft", "release_date": "Nov  4 2010", "developers": ["Ubisoft Milan"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General"], "meta_score": 40, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/4/391c20a03f5094bc2a781a706db93c05-98.jpg", "descriptions": "Motion Sports offers a variety of sports utilizing Kinect."}, {"name": "Looney Tunes: Acme Arsenal", "details_link": "https://www.metacritic.com/game/xbox-360/looney-tunes-acme-arsenal", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct  9 2007", "developers": ["Red Tribe"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Action Adventure", "Fantasy", "Platformer", "Fantasy", "3D"], "meta_score": 40, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/1ec1777712dc44a7568a933a996febf4-98.jpg", "descriptions": "Looney Tunes: Acme Arsenal is an action-adventure game featuring seven playable Looney Tunes characters, including Bugs Bunny, Daffy Duck, Tazmanian Devil, Foghorn Leghorn, Marvin the Martian, Gossamer and a special secret character, all rendered in high-definition, next-generation graphics.Looney Tunes: Acme Arsenal is an action-adventure game featuring seven playable Looney Tunes characters, including Bugs Bunny, Daffy Duck, Tazmanian Devil, Foghorn Leghorn, Marvin the Martian, Gossamer and a special secret character, all rendered in high-definition, next-generation graphics. Engaging in one or two player cooperative gameplay, gamers find themselves immersed in fast-paced combat, puzzle solving challenges and vehicle-based action in rich environments inspired by the popular, outlandish cartoon tales. Players command an arsenal of ACME melee and projectile weapons in outrageous battles and travel to various locations such as Camelot, Ancient Egypt, Mars, the Wild West, the trenches of World War II and more. The Xbox 360 version allows players to fully utilize real-time physics and animation blending and Xbox Live online entertainment network will allow for two player cooperative game play. [Warner Bros. Interactive]… Expand"}, {"name": "Real Steel", "details_link": "https://www.metacritic.com/game/xbox-360/real-steel", "publisher": "Yuke's", "release_date": "Oct 12 2011", "developers": ["Yuke's"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 40, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/fc442a88b2d4afb2811d302645bacb0f-98.jpg", "descriptions": "This is a robot boxing game based on the upcoming film, \"REAL STEEL\". The player assumes the role of an owner of a fighting robot, and must battle against many different rival robots in an attempt to become champion of several levels of fighting tiers. Players earn in-game money byThis is a robot boxing game based on the upcoming film, \"REAL STEEL\". The player assumes the role of an owner of a fighting robot, and must battle against many different rival robots in an attempt to become champion of several levels of fighting tiers. Players earn in-game money by winning matches and, using this money, must periodically improve their robot, making it stronger and more fit to compete in the higher level match tiers. The vast amount of customizable parts and selectable equipment makes for over 100 million possibilities of custom robots! In addition to single-player mode, the game also supports online multiplayer combat, which means players can search for new opponents from all around the world. Take your own personalized robot and aim for the top of the world of robot boxing!… Expand"}, {"name": "Soldier Elite", "details_link": "https://www.metacritic.com/game/pc/soldier-elite", "publisher": "DreamCatcher Interactive", "release_date": "May 29 2006", "developers": ["Metropolis Software"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "General"], "meta_score": 40, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/2/b58d5abea79b80b4af6213aa9b9c3f1d-98.jpg", "descriptions": "(Known in the U.S. as \"Aurora Watching\")  During the maneuvers at the Barents Sea a Russian submarine Komsomoletz II unexpectedly crashes down. The intelligence found out that hours before the catastrophe the submarine swam out of the submarine boats cemetery in the Franz Josef Land. A(Known in the U.S. as \"Aurora Watching\")  During the maneuvers at the Barents Sea a Russian submarine Komsomoletz II unexpectedly crashes down. The intelligence found out that hours before the catastrophe the submarine swam out of the submarine boats cemetery in the Franz Josef Land. A closer look at the area revealed a military complex containing laboratories built for an unknown purpose. They also found out they are under control of Jacek Parecki, one of the best DNA scientist all over the world - genius and morally rotten. Two agents in black find White Fox on the floor. The hero who once saved the world has been drinking for over two years. Will he manage to approach Parecki once again? The action of Aurora Watching takes place in the Arctic. All the locations are situated on the iceberg, in the laboratory underneath the iceberg, and in the flooded Russian submarine. During the mission White Fox faces not only human opponents, each of which can be defeated in many ways. The game features two camera modes - one for easy tactical planning, and the other one for real combat. Mini-games, puzzles, and hi-tech gadgets keep player excited from the very beginning till the end. [Metropolis Software]… Expand"}, {"name": "Deep Black: Reloaded", "details_link": "https://www.metacritic.com/game/pc/deep-black-reloaded", "publisher": "Strategy First", "release_date": "Mar  1 2012", "developers": ["Biart"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Arcade"], "meta_score": 39, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/9/31e68f7645c65ea7833ecd3759b7a48d-98.jpg", "descriptions": "Deep Black: Reloaded is set in a desolate near future of global terrorism and espionage as players become involved in a desperate fight for world supremacy and the possession of a sophisticated biological weapon"}, {"name": "Battle: Los Angeles", "details_link": "https://www.metacritic.com/game/xbox-360/battle-los-angeles", "publisher": "Konami", "release_date": "Mar 11 2011", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 39, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/1/ec0e9b9c50973deaec087ad7134a8d21-98.jpg", "descriptions": "Players will have the opportunity to relive the thrill of the movie as they assume the role of Corporal Lee Imlay and fight alongside characters from the film and defend the city of Los Angeles from attacks from unknown forces."}, {"name": "Montague's Mount", "details_link": "https://www.metacritic.com/game/pc/montagues-mount", "publisher": "Mastertronic", "release_date": "Oct  9 2013", "developers": ["Polypusher Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 39, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/82fa59280ba6ff374530d6672791b910-98.jpg", "descriptions": "Montague's Mount is a horror/suspense game from Mastertronic and one-man development team Polypusher Studios."}, {"name": "Charlie and the Chocolate Factory", "details_link": "https://www.metacritic.com/game/gamecube/charlie-and-the-chocolate-factory", "publisher": "Global Star Software", "release_date": "Jul 11 2005", "developers": ["High Voltage Software", "Backbone Entertainment"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 39, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/0/7f15557aa51a28236e1bf5ebe9c44148-98.jpg", "descriptions": "Step inside the magical world of Willy Wonka's famous chocolate factory. Based on the Warner Bros. film and the classic novel by Roald Dahl, Charlie and the Chocolate Factory lets you delve deep inside the factory to relive the classic story as Charlie Bucket. Find a golden ticket and, alongStep inside the magical world of Willy Wonka's famous chocolate factory. Based on the Warner Bros. film and the classic novel by Roald Dahl, Charlie and the Chocolate Factory lets you delve deep inside the factory to relive the classic story as Charlie Bucket. Find a golden ticket and, along with four other children, win a personal tour of Willy Wonka's factory as guided by the notorious and reclusive candy maker himself. Discover what happens after the other children, greed-driven and unrestrained, wreak havoc throughout the factory.… Expand"}, {"name": "SuperPower", "details_link": "https://www.metacritic.com/game/pc/superpower", "publisher": "DreamCatcher Interactive", "release_date": "Mar 28 2002", "developers": ["GolemLabs"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "General"], "meta_score": 39, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/6/b4ba04d41bab05bc10d58a1a71882572-98.jpg", "descriptions": "A truly unique military and geo political simulator which allows the player the ability to decide on how they want to play the game. Built using recent UN and CIA data the player can play as any 1 of 140 nations and strive to solve the real world economic, social and political problemsA truly unique military and geo political simulator which allows the player the ability to decide on how they want to play the game. Built using recent UN and CIA data the player can play as any 1 of 140 nations and strive to solve the real world economic, social and political problems facing that country. From a military standpoint there are up to 4000 unique deployable units which can be used to fight strategic battles anywhere around the globe. [DreamCatcher]… Expand"}, {"name": "The Cursed Crusade", "details_link": "https://www.metacritic.com/game/xbox-360/the-cursed-crusade", "publisher": "Atlus", "release_date": "Oct 25 2011", "developers": ["Kylotonn"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 39, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/ed2e1bbeec647fdc42726bfe109758a3-98.jpg", "descriptions": "The Cursed Crusade marries medieval Europe with adventure and dark fantasy."}, {"name": "Ultimate Beach Soccer", "details_link": "https://www.metacritic.com/game/xbox/ultimate-beach-soccer", "publisher": "DreamCatcher Interactive", "release_date": "Nov 10 2003", "developers": ["Pam Development"], "platforms": ["PC", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 39, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/c2111ccf94fafc7cffa9f76e22a3ad33-98.jpg", "descriptions": "With flashy moves, laser shows, and DJs, Ultimate Beach Soccer is not your ordinary soccer game. This new sport features aerial passes, special moves, combos, ball-juggling, and flashy goals and saves. These moves are not all for show; use them to dominate your opponents in quick matches,With flashy moves, laser shows, and DJs, Ultimate Beach Soccer is not your ordinary soccer game. This new sport features aerial passes, special moves, combos, ball-juggling, and flashy goals and saves. These moves are not all for show; use them to dominate your opponents in quick matches, long-term competitions, and custom tournaments. Ultimate Beach Soccer takes you around the globe to locations including Rio, France, Japan, and Venice Beach, California. Each stadium features cheerleaders, commentators, and pitch-side shows with DJs.… Expand"}, {"name": "Torino 2006 - the Official Video Game of the XX Olympic Winter Games", "details_link": "https://www.metacritic.com/game/playstation-2/torino-2006---the-official-video-game-of-the-xx-olympic-winter-games", "publisher": "2K Sports", "release_date": "Jan 24 2006", "developers": ["49Games"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports"], "meta_score": 39, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/5008f6573c4acdc12c2778c9c4951bcf-98.jpg", "descriptions": "Featuring eight winter disciplines, 15 events, extraordinary wintry landscapes and authentic commentator analysis, Torino 2006 gives gamers the chance to participate in one of the most exciting sporting events of 2006. With a multiplayer mode for up to four players, gamers can competeFeaturing eight winter disciplines, 15 events, extraordinary wintry landscapes and authentic commentator analysis, Torino 2006 gives gamers the chance to participate in one of the most exciting sporting events of 2006. With a multiplayer mode for up to four players, gamers can compete head-to-head or in turnbased play that simulates the global stage of one of the most exciting sporting events in 2006. Features 8 disciplines with 15 different events including; Skiing, Biathlon, Bobsleigh, Luge, Speed Skating, Ski Jumping, Cross-Country Skiing, and Nordic Combined. Challenge your skills with 3 difficulty levels in each sport. [2K Sports]… Expand"}, {"name": "Fantastic Four: Rise of the Silver Surfer", "details_link": "https://www.metacritic.com/game/wii/fantastic-four-rise-of-the-silver-surfer", "publisher": "2K Games", "release_date": "Jun 15 2007", "developers": ["7 Studios"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 39, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/91ed0a9f540f7217e85698265a206b03-98.jpg", "descriptions": "Marvel's first family of Super Heroes face its greatest challenge yet as the enigmatic, intergalactic herald, The Silver Surfer, comes to Earth to prepare it for destruction. Transform into any member of the Fantastic Four to fight enemies from the Fantastic Four Universe including SilverMarvel's first family of Super Heroes face its greatest challenge yet as the enigmatic, intergalactic herald, The Silver Surfer, comes to Earth to prepare it for destruction. Transform into any member of the Fantastic Four to fight enemies from the Fantastic Four Universe including Silver Surfer, Super Skrull and more. Battle in 4-player co-op with easy pick up and play ability. Combine super powers for devastating team attacks with the new Fusion Attack System. Truly destructible environments: smash, wreck, wreak havoc. Loads of unlockables including alternate Fantastic Four costumes, historical comic covers, and more. Enhance your super powers: use the Wii Remote for mega boost attacks! [2K Games]… Expand"}, {"name": "Drive Girls", "details_link": "https://www.metacritic.com/game/playstation-vita/drive-girls", "publisher": "Rising Star Games", "release_date": "Sep  8 2017", "developers": ["Tamsoft"], "platforms": "PlayStation Vita", "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 39, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/8565bb5b7f450b7297e44c3bd12fd678-98.jpg", "descriptions": "In a world where humans can transform into automobiles, the Drive Girls are ready to hit the road and save the day! Play as five different Drive Girls and transform from superheroine to supercar and back again, as you smash through wave after wave of mechanised Bug enemies attacking theIn a world where humans can transform into automobiles, the Drive Girls are ready to hit the road and save the day! Play as five different Drive Girls and transform from superheroine to supercar and back again, as you smash through wave after wave of mechanised Bug enemies attacking the paradise of Sun Island. Combining action and driving into a hack ‘n’ slash bonanza, Drive Girls lets you burn rubber through the high-octane missions in the epic single-player campaign or enjoy local and online co-operative action for up to four players. Visit the garage between missions to tune, modify and customise your rides, as abilities and attacks can be enhanced with new parts and decals for stat-busting skill augments. Discover the unfolding story and enjoy interactions between the Drive Girls as they bond and get to know each other better, forming close friendships amidst the heat of the battle zone. … Expand"}, {"name": "Air Raid: This Is Not a Drill!", "details_link": "https://www.metacritic.com/game/pc/air-raid-this-is-not-a-drill!", "publisher": "Big City Games", "release_date": "Jun 18 2003", "developers": ["Made by Kiddies"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic"], "meta_score": 39, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/b8dc00df119a02131656cafeeb917cb7-98.jpg", "descriptions": "Air Raid immerses you in a mind blowing, realistic battle simulation that features stunning 3D arcade shoot 'em up action. Air Raid thrusts you into the adrenaline-pumping, action packed world of a World War II battleship under enemy fire. The gamer finds himself stationed behind the awesomeAir Raid immerses you in a mind blowing, realistic battle simulation that features stunning 3D arcade shoot 'em up action. Air Raid thrusts you into the adrenaline-pumping, action packed world of a World War II battleship under enemy fire. The gamer finds himself stationed behind the awesome firepower of a 40mm Bofor Anti-Aircraft fixed deck gun on the bow of a battleship reminiscent of the famed U.S.S. Missouri. The mission is to blast away at the endless onslaught of enemy attackers hell bent on sinking the battleship. Honor, glory and pride are on the line, but the primary mission is simply to survive. [Big City Games]… Expand"}, {"name": "Army Men: Green Rogue", "details_link": "https://www.metacritic.com/game/playstation-2/army-men-green-rogue", "publisher": "3DO", "release_date": "Mar 25 2001", "developers": ["3DO"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 39, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/fb4e84e39353f5ac3580c450cae2e437-98.jpg", "descriptions": "Created in a covert laboratory by splicing DNA from the strongest and most skilled soldiers, the \"Omega Soldier\" has been given the strength and weapon skills to become the Tan army's worst high-tech threat!\rArmy Men®: Green Rogue™ incorporates a 3rd person shooter withCreated in a covert laboratory by splicing DNA from the strongest and most skilled soldiers, the \"Omega Soldier\" has been given the strength and weapon skills to become the Tan army's worst high-tech threat!\rArmy Men®: Green Rogue™ incorporates a 3rd person shooter with coin-op shoot 'em style gameplay that will raise the heartbeat of anyone who dares to accept the challenge.… Expand"}, {"name": "Turning Point: Fall of Liberty", "details_link": "https://www.metacritic.com/game/pc/turning-point-fall-of-liberty", "publisher": "Codemasters", "release_date": "Feb 26 2008", "developers": ["Spark Unlimited"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 39, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/0bb9e8cb8ebe4b79f2c567c1f74ab276-98.jpg", "descriptions": "The game supposes that the incident in which a car struck Winston Churchill in New York on December 13th 1931 actually proved fatal – and that without his inspirational speeches to galvanise the Allies, the course of the Second World War took a very different route, with the Axis Powers evenThe game supposes that the incident in which a car struck Winston Churchill in New York on December 13th 1931 actually proved fatal – and that without his inspirational speeches to galvanise the Allies, the course of the Second World War took a very different route, with the Axis Powers even invading America.… Expand"}, {"name": "25 to Life", "details_link": "https://www.metacritic.com/game/pc/25-to-life", "publisher": "Eidos Interactive", "release_date": "Jan 17 2006", "developers": ["Ritual Entertainment", "Avalanche Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 39, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/0/a9819eb9769527b933af3953642e506a-98.jpg", "descriptions": "25 to Life is the game the streets have been waiting for. Play as either cops or gangsters in this urban third person shooter. The game delivers intense Online gameplay for up to 16 players, as well as a rich single player experience. Set in the heart of today's cities, experience the gritty25 to Life is the game the streets have been waiting for. Play as either cops or gangsters in this urban third person shooter. The game delivers intense Online gameplay for up to 16 players, as well as a rich single player experience. Set in the heart of today's cities, experience the gritty lifestyles of police task forces or as a gangster survive the local neighborhood thugs while fighting your way up the inner sanctum of the drug lord's mansion, your knowledge of the streets will be put to the test because...25 to Life IS the streets! [Eidos Interactive]… Expand"}, {"name": "Pocket Racers", "details_link": "https://www.metacritic.com/game/psp/pocket-racers", "publisher": "Konami", "release_date": "Nov 14 2006", "developers": ["Konami", "Blade Interactive"], "platforms": "PSP", "num_players": "6  Online", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 39, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/654df2af01d49b2adf79175c503a5ce3-98.jpg", "descriptions": "Pocket Racers features miniaturised cars whizzing around a series of everyday environments. The player is cast as a spoilt teenager at a party, who is transformed into a toy car by of a vengeful demon. What follows is a frenetic race for survival as the 'Nemesis' demon sets a series ofPocket Racers features miniaturised cars whizzing around a series of everyday environments. The player is cast as a spoilt teenager at a party, who is transformed into a toy car by of a vengeful demon. What follows is a frenetic race for survival as the 'Nemesis' demon sets a series of increasingly hard challenges within the fully interactive - and destroyable! - play areas. The cars in Pocket Racers represent the soul of the stricken player, and can be augmented through the collection of 'Soul Shards' which litter the play area. Collecting these allows the user to inflict massive damage on rival cars or the debris that clutters the race area, while additional weapons such as nitro boosts, missiles and ice can be used to sneak past opposing racers. These extra weapons are left around the courses, and must be gathered before your opponents get them. The courses themselves range from a messy bedroom, a conveyor belt-laden factory and a kitchen, and feature sneaky short cuts and hidden extras for the player to find. Pocket Racers also features a number of vehicle styles that are ideally suited to the varying locations. Sports cars, trucks, 4x4s and Coupes vie for the player's attention, while other hidden vehicles can also be unlocked. [Konami]… Expand"}, {"name": "Doctor Who: The Eternity Clock", "details_link": "https://www.metacritic.com/game/playstation-3/doctor-who-the-eternity-clock", "publisher": "BBC Worldwide", "release_date": "May 22 2012", "developers": ["Supermassive Games"], "platforms": ["PC", "PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 39, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/b3738f96af17c7c60152b2389a400ca7-98.jpg", "descriptions": "Doctor Who: The Eternity Clock will immerse gamers in the universe of Doctor Who, allowing them to take on the role of the Doctor and River Song as they travel across time and space to save the Earth. Gamers must learn to master the complexities of time travel with exceptional time basedDoctor Who: The Eternity Clock will immerse gamers in the universe of Doctor Who, allowing them to take on the role of the Doctor and River Song as they travel across time and space to save the Earth. Gamers must learn to master the complexities of time travel with exceptional time based game play, changes made in one time will impact another creating multiple possibilities and challenging players to solve puzzles across the centuries.… Expand"}, {"name": "Wacky Races: Crash & Dash", "details_link": "https://www.metacritic.com/game/wii/wacky-races-crash-dash", "publisher": "Eidos Interactive", "release_date": "Jun 17 2008", "developers": ["Eidos Sweden"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart"], "meta_score": 39, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/7bc4eacf777e27ccfae76eaf9603415f-98.jpg", "descriptions": "Wacky Races: Crash & Dash is an action racing game with fun-filled environments, crazy cars and hilarious characters. The game features all the characters and cars from the TV series including old favorites: Turbo Terrific driven by Peter Perfect, the Ant Hill Mob in their Bullet Proof Bomb,Wacky Races: Crash & Dash is an action racing game with fun-filled environments, crazy cars and hilarious characters. The game features all the characters and cars from the TV series including old favorites: Turbo Terrific driven by Peter Perfect, the Ant Hill Mob in their Bullet Proof Bomb, Penelope Pitstop, and the Mean Machine driven by Dick Dastardly and his sidekick, Muttley. Players join Dick Dastardly and the gang, racing across a variety of action-packed and colorful cross-country rallies from the TV series. Racers watch out for traps and speed ahead to win the ultimate title of World’s Wackiest Racer. Wacky Widgets are collected during the race to gain “Wacky Powers,” as well as a character’s super-special “Way Out Wacky” power, which can be used to gain the upper hand over sly opponents. [Eidos Interactive]… Expand"}, {"name": "Troll and I", "details_link": "https://www.metacritic.com/game/playstation-4/troll-and-i", "publisher": "Maximum Games", "release_date": "Mar 21 2017", "developers": ["Maximum Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 39, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/0/5e1f7a2dd8611d5eaaaf153c56850fe3-98.jpg", "descriptions": "Deep in the Nordic wilderness, a teenage boy named Otto is forced to flee his home after a band of brutal hunters rip through his village in search of a mythical creature rumored to inhabit the forest. Now on the run for his life, Otto inadvertently finds and befriends the elusive creatureDeep in the Nordic wilderness, a teenage boy named Otto is forced to flee his home after a band of brutal hunters rip through his village in search of a mythical creature rumored to inhabit the forest. Now on the run for his life, Otto inadvertently finds and befriends the elusive creature being sought by the hunters. Thus begins the perilous adventure of Troll and Otto.\r Together, the unlikely friends embark on a journey through treacherous territory plagued with rivals. Natives to the forest, Troll and Otto must use their inherent skills to sneak, strategize, and battle their way back home. The forest is filled with unknowns, and teamwork is pivotal to staying alive.… Expand"}, {"name": "Senran Kagura Reflexions", "details_link": "https://www.metacritic.com/game/switch/senran-kagura-reflexions", "publisher": "XSEED Games", "release_date": "Sep 13 2018", "developers": ["Honey Parade Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General"], "meta_score": 39, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/bb587629b66f2bf714aa0e0a594c0c40-98.jpg", "descriptions": "Can you feel it? The beating of her heart... In a classroom after school, learn the ways of \"Reflexology\" by syncing with her heart and body. SENRAN KAGURA combines with HD Rumble on the Nintendo Switch. She called you into the classroom after school. She's waiting there for you. But sheCan you feel it? The beating of her heart... In a classroom after school, learn the ways of \"Reflexology\" by syncing with her heart and body. SENRAN KAGURA combines with HD Rumble on the Nintendo Switch. She called you into the classroom after school. She's waiting there for you. But she might not be her usual self... Delve into intimacy by massaging her hands and helping her relax. Explore her many daydreams to see her in different lights. Get to know her as an energetic admirer, an experienced warrior, a curious classmate...and much more.\r… Expand"}, {"name": "RollerCoaster Tycoon 3D", "details_link": "https://www.metacritic.com/game/3ds/rollercoaster-tycoon-3d", "publisher": "Atari", "release_date": "Oct 16 2012", "developers": ["n-Space"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 39, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/4/624d5bfbd2c38b02ea054666d552a9d3-98.jpg", "descriptions": "The next installment of the hit RollerCoaster Tycoon franchise is hereand this time, its in 3D!\r Meet the Rocket Coaster Company, an energetic and small group of coaster fanatics. Run by your father, a world-renowned roller coaster genius, the RCC is poised to change the world with itsThe next installment of the hit RollerCoaster Tycoon franchise is hereand this time, its in 3D!\r Meet the Rocket Coaster Company, an energetic and small group of coaster fanatics. Run by your father, a world-renowned roller coaster genius, the RCC is poised to change the world with its incredible designs and style. Unfortunately your father is a bit of a scatterbrain and is far too busy dreaming up new rides and roller coasters to get the company off the ground.\r This is where you, the player comes in as your father has decided that spending your time helping him out is more important than your summer vacation! Aided by a friend of the family and an old retired theme park industry veteran, the player is tasked to take the reins to get a foothold in the theme park world. Take on jobs, help design coasters, and even manage your own theme parks as you push the RCC to the top!… Expand"}, {"name": "Brain Boost: Beta Wave", "details_link": "https://www.metacritic.com/game/ds/brain-boost-beta-wave", "publisher": "Majesco Games", "release_date": "Nov 17 2006", "developers": ["Interchannel", "HuneX"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 39, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/9/0daf79e52d03bc09674f502d81a2439c-98.jpg", "descriptions": "(Also known as \"The Professor's Brain Trainer: Memory\")  Both games focus on improving memory, concentration and judgment through progressively difficult brain training games where speed and accuracy count.  Brain Boost: Beta Wave focuses on stimulating parts of the right brain that are(Also known as \"The Professor's Brain Trainer: Memory\")  Both games focus on improving memory, concentration and judgment through progressively difficult brain training games where speed and accuracy count.  Brain Boost: Beta Wave focuses on stimulating parts of the right brain that are often associated with active concentration and busy thinking.  Brain Boost: Beta Wave includes Find a Match, Shape Recognition, Addition, Remember Sequence and Moving Dots training games. [Majesco Games]… Expand"}, {"name": "The Polar Express", "details_link": "https://www.metacritic.com/game/playstation-2/the-polar-express", "publisher": "THQ", "release_date": "Nov  2 2004", "developers": ["Blue Tongue"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 39, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/cfca1d1398f54f913979beb9687ba447-98.jpg", "descriptions": "In this inspiring adventure based on The Polar Express movie, players will take an extraordinary ride through eight exciting chapters. A mysterious Conductor shepherds players aboard the train, and onto a journey to meet Santa Claus at the North Pole. Along they way, they will meet memorableIn this inspiring adventure based on The Polar Express movie, players will take an extraordinary ride through eight exciting chapters. A mysterious Conductor shepherds players aboard the train, and onto a journey to meet Santa Claus at the North Pole. Along they way, they will meet memorable characters from the film including the Girl Know-it-All, Lonely Boy, the Hobo, Smokey & Steamer and the Elves. Gameplay rewards those who believe. All aboard! Experience mini-games, solve puzzles and search for lost presents. Enjoy special EyeToy games. Explore massive 3-D environments including the North Pole and The Polar Express. [THQ]… Expand"}, {"name": "Family Guy: Back to the Multiverse", "details_link": "https://www.metacritic.com/game/xbox-360/family-guy-back-to-the-multiverse", "publisher": "Activision", "release_date": "Nov 20 2012", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 39, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/9/55f805b9435d72739571a8346ea6f653-98.jpg", "descriptions": "Family Guy: Back to the Multiverse introduces an all-new original story written and voiced by Family Guy talent and influenced by the famous Family Guy season eight episode, Road to the Multiverse, where Stewie and Brian travel on an out-of-this-world journey through Quahog’s bizarreFamily Guy: Back to the Multiverse introduces an all-new original story written and voiced by Family Guy talent and influenced by the famous Family Guy season eight episode, Road to the Multiverse, where Stewie and Brian travel on an out-of-this-world journey through Quahog’s bizarre parallel universes.  Gamers travel through all-new settings on a mission to save Quahog and stop the destructive schemes of Bertram, Stewie’s nemesis.  Playing as either Stewie or Brian, each equipped with unique special weapons and abilities, gamers encounter an array of Family Guy characters, references and jokes.  Additionally, fans can share this hilarious experience and invite friends and family to jump into the wild Family Guy world through drop-in/drop-out co-op multiplayer mode and competitive multiplayer challenges. [Activision]… Expand"}, {"name": "Charlie and the Chocolate Factory", "details_link": "https://www.metacritic.com/game/xbox/charlie-and-the-chocolate-factory", "publisher": "Global Star Software", "release_date": "Jul 11 2005", "developers": ["High Voltage Software", "Backbone Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 39, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/1/e96c41619c6fbb2b675e6dc6d80cfe09-98.jpg", "descriptions": "Step inside the magical world of Willy Wonka's famous chocolate factory. Based on the Warner Bros. film and the classic novel by Roald Dahl, Charlie and the Chocolate Factory lets you delve deep inside the factory to relive the classic story as Charlie Bucket. Find a golden ticket and, alongStep inside the magical world of Willy Wonka's famous chocolate factory. Based on the Warner Bros. film and the classic novel by Roald Dahl, Charlie and the Chocolate Factory lets you delve deep inside the factory to relive the classic story as Charlie Bucket. Find a golden ticket and, along with four other children, win a personal tour of Willy Wonka's factory as guided by the notorious and reclusive candy maker himself. Discover what happens after the other children, greed-driven and unrestrained, wreak havoc throughout the factory.… Expand"}, {"name": "25 to Life", "details_link": "https://www.metacritic.com/game/playstation-2/25-to-life", "publisher": "Eidos Interactive", "release_date": "Jan 17 2006", "developers": ["Ritual Entertainment", "Avalanche Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 39, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/7/7ec6f4ebda2c0ac5286075d0260ed397-98.jpg", "descriptions": "25 to Life is the game the streets have been waiting for. Play as either cops or gangsters in this urban third person shooter. The game delivers intense Online gameplay for up to 16 players, as well as a rich single player experience. Set in the heart of today's cities, experience the gritty25 to Life is the game the streets have been waiting for. Play as either cops or gangsters in this urban third person shooter. The game delivers intense Online gameplay for up to 16 players, as well as a rich single player experience. Set in the heart of today's cities, experience the gritty lifestyles of police task forces or as a gangster survive the local neighborhood thugs while fighting your way up the inner sanctum of the drug lord's mansion, your knowledge of the streets will be put to the test because...25 to Life IS the streets!  [Eidos Interactive]… Expand"}, {"name": "Hello Neighbor", "details_link": "https://www.metacritic.com/game/switch/hello-neighbor", "publisher": "tinyBuild", "release_date": "Jul 27 2018", "developers": ["tinyBuild"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 39, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/4/7f7cb104f5553d50dffcdaf543dbc12d-98.jpg", "descriptions": "Hello Neighbor is a stealth-horror game about breaking into your neighbors house. Play against an advanced AI that learns from your actions, and counters them. Find out what horrible secrets your neighbor is hiding inside his basement."}, {"name": "Coffeetime Crosswords", "details_link": "https://www.metacritic.com/game/xbox-360/coffeetime-crosswords", "publisher": "Konami", "release_date": "Jul 16 2008", "developers": ["Voltex", "Inc."], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Logic", "General"], "meta_score": 39, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/9/6456d58c24334ac96916b935a90ddf61-98.jpg", "descriptions": "[Xbox Live Arcade]  Prepare for a true crossword challenge as you test your skills in Coffeetime Crosswords. Try for the high score as you progress through more than 150 crosswords developed by Penny Press. Play together with a friend in co-op mode and help each other solve the crosswords.[Xbox Live Arcade]  Prepare for a true crossword challenge as you test your skills in Coffeetime Crosswords. Try for the high score as you progress through more than 150 crosswords developed by Penny Press. Play together with a friend in co-op mode and help each other solve the crosswords. Gather your wits, prepare yourself to be entertained, and challenge your crossword prowess. [Konami]… Expand"}, {"name": "Ju-on: The Grudge", "details_link": "https://www.metacritic.com/game/wii/ju-on-the-grudge", "publisher": "XSEED Games", "release_date": "Oct 13 2009", "developers": ["FeelPlus"], "platforms": "Wii", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 39, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/6176f2bf643d6ad65f76687cf69911a1-98.jpg", "descriptions": "The title is inspired by the Japanese classic horror movie, JU-ON, on which the American release of the hit horror film \"The Grudge\" was based upon. JU-ON: The Grudge for Wii is a Haunted House Simulator where accessibility and instant scares are given priority over all other game aspects,The title is inspired by the Japanese classic horror movie, JU-ON, on which the American release of the hit horror film \"The Grudge\" was based upon. JU-ON: The Grudge for Wii is a Haunted House Simulator where accessibility and instant scares are given priority over all other game aspects, with the original creator of the movie, Takashi Shimizu, serving as a creative consultant to game development. It is said that when a person dies with a deep and burning grudge, a curse is born. When an average housewife in Nerima, Japan, was murdered in a grisly fashion, it gave rise to a curse so powerful that it threatens to kill at a pace thought unimaginable before. The curse manifests on those who encounter the curse by any means, such as entering the house or being in contact with somebody who was already cursed. Once Erika Yamada is exposed to the curse while searching for her dog in an abandoned warehouse, the entire Yamada family is put in grave danger as soon as she reunites with them at home. They must now face their individual challenges alone, and only by overcoming the curse together will their family truly be free again. Using the Wii Remote as a flashlight, JU-ON: The Grudge has players move forward with the touch of a button and explore haunted areas such as an abandoned warehouse, a dimly-lit hospital, and a mannequin factory. Much like a haunted house, the player must proceed forward even after being frightened and running away from the initial threat. As much fun as it is to get scared, sometimes it’s even more fun to watch others play to observe their reactions. For instant gratification, grab a second Wii Remote and push buttons to make in-game events happen immediately to make the player jump and hate you forever. [XSEED]… Expand"}, {"name": "Thor: God of Thunder", "details_link": "https://www.metacritic.com/game/playstation-3/thor-god-of-thunder", "publisher": "Sega", "release_date": "May  3 2011", "developers": ["Liquid Entertainment"], "platforms": ["3DS", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 39, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/bcef69069d5b0b4a5fac61213f2c0f92-98.jpg", "descriptions": "Thor: The Video Game will take players through a spectacular, epic-scale original third-person adventure for which Matt Fraction, the Eisner Award-winning writer and lead Thor comic book author served as story consultant. In the game, Thor battles through the numerous worlds of NorseThor: The Video Game will take players through a spectacular, epic-scale original third-person adventure for which Matt Fraction, the Eisner Award-winning writer and lead Thor comic book author served as story consultant. In the game, Thor battles through the numerous worlds of Norse mythology that span realms ranging from primal worlds of fire and ice to extraordinary planets inhabited by Frost Giants and Trolls to save Asgard, the capital city of the Norse Gods. Thor must overcome monstrous foes lifted from the pages of the comics including Ulik, Ymir, and Surtur, as well as other monstrous denizens. Players will wield the iconic Mjolnir, Thor’s legendary hammer, to fight enemies on an immense scale while controlling the elemental storm powers of lightning, thunder, and wind to vanquish enemies. As Thor earns Valor points through his exploits, players can acquire new abilities, powers, and weapon upgrades.… Expand"}, {"name": "R.I.P.D. The Game", "details_link": "https://www.metacritic.com/game/xbox-360/ripd-the-game", "publisher": "Atlus", "release_date": "Jul 17 2013", "developers": ["Old School Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Sci-Fi", "Arcade"], "meta_score": 39, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/9/9da5d20d3edcf70efbe2592c53a4ac8b-98.jpg", "descriptions": "Based on the 3D supernatural action-adventure film, R.I.P.D., you and a partner assume the roles of two lawmen dispatched to the otherworld to protect and serve the living from an increasingly destructive series of souls who refuse to move peacefully to the other side. Honed teamwork and anBased on the 3D supernatural action-adventure film, R.I.P.D., you and a partner assume the roles of two lawmen dispatched to the otherworld to protect and serve the living from an increasingly destructive series of souls who refuse to move peacefully to the other side. Honed teamwork and an arsenal of killer weapons are the keys to defeating your enemies and bringing serenity back to the world.… Expand"}, {"name": "Raven Squad: Operation Hidden Dagger", "details_link": "https://www.metacritic.com/game/pc/raven-squad-operation-hidden-dagger", "publisher": "Evolved Games", "release_date": "Aug 25 2009", "developers": ["Atomic Motion"], "platforms": "PC", "genres": ["Action", "Strategy", "Shooter", "Real-Time", "General", "First-Person", "Command", "Modern"], "meta_score": 39, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/9/aa1de11903a09a53154d95400e19aceb-98.jpg", "descriptions": "Raven Squad puts players in control of two groups of mercenary squads who crash land behind enemy lines in the Amazonian jungles. It requires tactical planning and a liberal amount of brute force to escape to safety. Each of the eight squad members possesses distinctive skills and weaponryRaven Squad puts players in control of two groups of mercenary squads who crash land behind enemy lines in the Amazonian jungles. It requires tactical planning and a liberal amount of brute force to escape to safety. Each of the eight squad members possesses distinctive skills and weaponry that the player has to use wisely to progress through the game's story driven objectives. Raven Squad sets itself apart by allowing players to switch freely between real-time strategy and first-person shooter gameplay. Only by mastering both of these modes of play, and becoming adept at switching between the two, can players make it out of the jungle alive. [SouthPeak Games]… Expand"}, {"name": "Monsters, Inc. Scream Arena", "details_link": "https://www.metacritic.com/game/gamecube/monsters-inc-scream-arena", "publisher": "THQ", "release_date": "Sep 14 2002", "developers": ["Radical Entertainment"], "platforms": "GameCube", "genres": ["Action", "Platformer", "3D"], "meta_score": 39, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/8dea2a915d30f6b92b0978cb4a465fc0-98.jpg", "descriptions": "The monsters of Monstropolis have learned the power of laughter, but now they need to practice making kids laugh. Monsters, Inc. Scream Arena trains you to inspire laughter in seven arenas. As one of your favorite Monsters, Inc. characters, you must throw, dodge, and block your way toThe monsters of Monstropolis have learned the power of laughter, but now they need to practice making kids laugh. Monsters, Inc. Scream Arena trains you to inspire laughter in seven arenas. As one of your favorite Monsters, Inc. characters, you must throw, dodge, and block your way to victory. In single-player or multiplayer modes, the winner is the first monster to knock your opponents silly. While you gain more and more laughter to power Monstropolis, you'll unlock hidden characters, bonus stages, and minigames.… Expand"}, {"name": "AnaCapri: The Dream", "details_link": "https://www.metacritic.com/game/pc/anacapri-the-dream", "publisher": "Got Game Entertainment", "release_date": "Sep 12 2007", "developers": ["S&G Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 39, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/3/59323501afc68caa1b378a03c5ea0922-98.jpg", "descriptions": "In the role of Dr. Nico N, an expert in ancient civilizations, you are beckoned to AnaCapri, a place of beauty, lore, and mystery. Here, you must find the Black Obsidian Disk - an ancient artifact once believed lost to the ages. Legends speak of the Disk possessing untold power and aIn the role of Dr. Nico N, an expert in ancient civilizations, you are beckoned to AnaCapri, a place of beauty, lore, and mystery. Here, you must find the Black Obsidian Disk - an ancient artifact once believed lost to the ages. Legends speak of the Disk possessing untold power and a malevolent past. As fear of the Disk grips AnaCapri and its people, you search the island, from the mesmerizing depths of the Blue Grotto to the panoramic gardens of Villa San Michele. But will you find the Disk and uncover its secrets...before it's too late? [Got Game Entertainment]… Expand"}, {"name": "Onechanbara: Bikini Samurai Squad", "details_link": "https://www.metacritic.com/game/xbox-360/onechanbara-bikini-samurai-squad", "publisher": "D3Publisher", "release_date": "Feb 10 2009", "developers": ["Tamsoft"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 39, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/41601597b8a666dc5dcfbf264a6c212e-98.jpg", "descriptions": "Killer Combat System - Each character has a variety of moves that players can utilize to combat enemies in the air, on the ground, at a distance, when surrounded or even to evade attacks. Players can change weapon attacks: for example, switching between one katana for precision work, or useKiller Combat System - Each character has a variety of moves that players can utilize to combat enemies in the air, on the ground, at a distance, when surrounded or even to evade attacks. Players can change weapon attacks: for example, switching between one katana for precision work, or use two katanas to take out large crowds of enemies. Adrenaline Filled Rage Mode - Unleash the hidden power inside of Aya and Saki, as players go into rage mode when covered in too much blood to gain more power and more agility to destroy enemies faster.  But if soaked in blood for too long, the added adrenaline will deplete the player’s health. Co-op Play - Invite a friend to join in the fight with Co-Op mode to rid the city of zombie infestation. Multiple Gameplay Modes - Zombie slayers will experience the main storyline through multiple stages with danger lurking around every corner in Story mode; replay favorite levels in Free Play mode; kill as many zombies as possible before their health runs out in Survival mode, embark on more than 40 harrowing quests in Quest mode and more. Dress-Up Mode - Unlock and acquire a variety of items to use in Dress-up mode to style out the sisters with sexy clothing, flashy accessories, hot hairstyles and more. After selecting an outfit combination, players can name the combinations, save them, then use the outfits in-game. Drive-and-Slash - Play as Aya and with the wind in your hair, dismember zombies at slow or full-speed while riding a tricked-out motorcycle in select levels. [D3Publiser of America]… Expand"}, {"name": "Tony Hawk's Motion", "details_link": "https://www.metacritic.com/game/ds/tony-hawks-motion", "publisher": "Activision", "release_date": "Nov 18 2008", "developers": ["Creat Studios"], "platforms": "DS", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 39, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/0eb8a7d72a611f4ed29bdf2b8415f283-98.jpg", "descriptions": "In Tony Hawk's Motion players can twist, tilt and turn through numerous skateboarding sessions and for the first time in franchise history, the game brings snowboarding to its line-up adding to the more than 20 diverse mini-challenges available including new ones like Rail Hopper and SlalomIn Tony Hawk's Motion players can twist, tilt and turn through numerous skateboarding sessions and for the first time in franchise history, the game brings snowboarding to its line-up adding to the more than 20 diverse mini-challenges available including new ones like Rail Hopper and Slalom and familiar ones like Hawk-Man and High Score. Once players finish grinding through locales like Tokyo, Dubai, Vermont and the Alps, they can switch gears and dip into the action-oriented puzzler Hue Pixel Painter.  Uncovering sources of paint below the ground’s surface, players take Hue through various landscapes bringing color back to a dreary environment and defending against the Drabs who have set out to leave the world gray and bland. [Activision]… Expand"}, {"name": "The Mummy: Tomb of the Dragon Emperor", "details_link": "https://www.metacritic.com/game/wii/the-mummy-tomb-of-the-dragon-emperor", "publisher": "Sierra Entertainment", "release_date": "Jul 22 2008", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PlayStation 2", "Wii"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 39, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/6a994f5322509408fed6a3d11085960b-98.jpg", "descriptions": "In the third-person action-adventure game The Mummy: Tomb of the Dragon Emperor, players take on the roles of Rick O'Connell and his son, Alex (played by Brendan Fraser and Luke Ford, respectively, in the film).  Gamers follow the lead characters on their harrowing journey - across exoticIn the third-person action-adventure game The Mummy: Tomb of the Dragon Emperor, players take on the roles of Rick O'Connell and his son, Alex (played by Brendan Fraser and Luke Ford, respectively, in the film).  Gamers follow the lead characters on their harrowing journey - across exotic locations from ancient Chinese catacombs to beautiful, but dangerous, Himalayan peaks - to defeat the revived servants of the Dragon Emperor (Jet Li).  The Mummy: Tomb of the Dragon Emperor allows players to switch seamlessly between gunplay and hand-to-hand melee attacks, and also features a fast and fluid combat system and an arsenal of weaponry that can be used to vanquish the many bone-chilling enemies players will face during their journey. [Sierra Entertainment]… Expand"}, {"name": "Cartoon Network Racing", "details_link": "https://www.metacritic.com/game/playstation-2/cartoon-network-racing", "publisher": "The Game Factory", "release_date": "Dec  4 2006", "developers": ["Eutechnyx"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 39, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/b5923c6107912d836b3aac567d46c4d2-98.jpg", "descriptions": "Cartoon Network Racing pits your favorite characters from Cartoon Network's original shows in a Kart Racing tournament against each other. -Race with characters from The Powerpuff Girls, Dexter's Laboratory, Courage the Cowardly Dog, Cow and Chicken, I.M. Weasel, and Johnny Bravo, and --Cartoon Network Racing pits your favorite characters from Cartoon Network's original shows in a Kart Racing tournament against each other. -Race with characters from The Powerpuff Girls, Dexter's Laboratory, Courage the Cowardly Dog, Cow and Chicken, I.M. Weasel, and Johnny Bravo, and -- Just select your favorite driver, co-driver and weapons and you're ready to go! This is no ordinary race - players experience a wild and wacky ride as they battle through 24 different circuits of cartoon craziness, collecting power-ups, eliminating their rivals, rocking and socking their way to victory. The Rules of Racing are simple: win! Be the first to cross the line and you'll win the race. Sounds easy? Not when you're competing against rival drivers, each out to win. Add crazy hazards, weapons, power-ups and more and you'll see why this is no walk in the park. [The Game Factory]… Expand"}, {"name": "Remothered: Broken Porcelain", "details_link": "https://www.metacritic.com/game/pc/remothered-broken-porcelain", "publisher": "Modus Games", "release_date": "Oct 13 2020", "developers": ["Stormind Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 39, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/b6784fcfb6749afd9a648acda5133517-98.jpg", "descriptions": "Broken Porcelain brings an abundance of welcome changes to the series, introducing new gameplay and storytelling elements that breathe new life into the characters and an unprecedented level of immersion in this haunting adventure – perfect for both new and returning fans to the series."}, {"name": "The Deer God", "details_link": "https://www.metacritic.com/game/switch/the-deer-god", "publisher": "Cinopt Studios LLC", "release_date": "Dec 21 2017", "developers": ["Cinopt Studios LLC"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 39, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/3/cd9a61aaf8f4e8691ca4ac95b027b304-98.jpg", "descriptions": "The Deer God is a breathtaking 3D pixel art adventure that will challenge your religion and your platforming skills. \rIt's a game about survival, reincarnation, and karma; all set in a breathtaking and unique 3D pixelized world. \rFeast your eyes on the beautiful lighting, day and nightThe Deer God is a breathtaking 3D pixel art adventure that will challenge your religion and your platforming skills. \rIt's a game about survival, reincarnation, and karma; all set in a breathtaking and unique 3D pixelized world. \rFeast your eyes on the beautiful lighting, day and night system, and vast landscapes.… Expand"}, {"name": "Universal Studios Theme Parks Adventure", "details_link": "https://www.metacritic.com/game/gamecube/universal-studios-theme-parks-adventure", "publisher": "Kemco", "release_date": "Dec 18 2001", "developers": ["Kemco"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Miscellaneous", "Party"], "meta_score": 39, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/2/7bf8dd1f0132ffa5eb504635e283efb8-98.jpg", "descriptions": "Lights... Camera... PLAY! You're not just a visitor, you're the star in Kemco's Universal Studios™ Theme Park Adventure, a magical 3-D journey beyond the theme park rides and into an amazing realm of games based upon the most successful movies produced in Hollywood. You'll love thisLights... Camera... PLAY! You're not just a visitor, you're the star in Kemco's Universal Studios™ Theme Park Adventure, a magical 3-D journey beyond the theme park rides and into an amazing realm of games based upon the most successful movies produced in Hollywood. You'll love this virtual gaming lark through the world's best movie theme park!… Expand"}, {"name": "Resident Evil: Survivor", "details_link": "https://www.metacritic.com/game/playstation/resident-evil-survivor", "publisher": "Capcom", "release_date": "Aug 30 2000", "developers": ["Capcom"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 39, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "At last a first-person shooting gamer based in the Resident Evil world.\r You play a character involved in a helicopter accident over an isolated town. He survives the wreckage but has temporarily lost his memory. Unsure of his identity and completely isolated, his next terrifyingAt last a first-person shooting gamer based in the Resident Evil world.\r You play a character involved in a helicopter accident over an isolated town. He survives the wreckage but has temporarily lost his memory. Unsure of his identity and completely isolated, his next terrifying revelation is that the town is infested with zombies! With a gun as his only protection he must attempt an escape. During his nightmarish struggle clues are slowly revealed about the extent of the horror he is involved in and what his true identity may be.... … Expand"}, {"name": "Realms of Ancient War", "details_link": "https://www.metacritic.com/game/pc/realms-of-ancient-war", "publisher": "Focus Home Interactive", "release_date": "Oct  4 2012", "developers": ["Wizarbox"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 39, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/1/50e3c15c6b607167c37375a15c14aec8-98.jpg", "descriptions": "This heroic fantasy hack 'n' slash takes you on a continent ravaged by a war that held ten years ago. The four Kingdoms of Men, Elves and Dwarves lay in ruins, preyed on by raiders and looters. In this chaos, a new, unknown threat is looming... trying to discover its true nature, theThis heroic fantasy hack 'n' slash takes you on a continent ravaged by a war that held ten years ago. The four Kingdoms of Men, Elves and Dwarves lay in ruins, preyed on by raiders and looters. In this chaos, a new, unknown threat is looming... trying to discover its true nature, the kingdoms sent detachments to investigate, a dangerous mission from which no one returned. But what about you ? You merely were in the wrong place, at the wrong time...… Expand"}, {"name": "Inkheart", "details_link": "https://www.metacritic.com/game/ds/inkheart", "publisher": "DreamCatcher Interactive", "release_date": "Jan 12 2009", "developers": ["DreamCatcher Interactive", "Dreamcatcher"], "platforms": "DS", "genres": ["Adventure", "General", "General"], "meta_score": 39, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/6/10a1fa67dad74ffc80b4a67ae9b91191-98.jpg", "descriptions": "Based on the feature film adaptation of the best-selling Cornelia Funke novel, Inkheart is the story of Meggie, a young girl whose father has a secret magical ability; he can bring book characters to life simply by reading the story aloud! It sounds like a wondrous gift, but evil lurksBased on the feature film adaptation of the best-selling Cornelia Funke novel, Inkheart is the story of Meggie, a young girl whose father has a secret magical ability; he can bring book characters to life simply by reading the story aloud! It sounds like a wondrous gift, but evil lurks within the pages of a rare children’s fable...Now, for the first time on your Nintendo DS, embark on a compelling and exciting action adventure. Solve tricky puzzles and challenge difficult tasks. Take on the roles of Meggie, Mo, Dustfinger or Farid and the ink itself will come to life. Immersed in a breathtaking backdrop with lovingly designed details, it is up to you alone to save the world before the dark powers of Capricorn are victorious. Are you ready? Then join Meggie and her friends on their dangerous adventure! [DreamCatcher Interactive]… Expand"}, {"name": "Tony Hawk's Pro Skater 5", "details_link": "https://www.metacritic.com/game/xbox-one/tony-hawks-pro-skater-5", "publisher": "Activision", "release_date": "Sep 29 2015", "developers": ["Robomodo"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 20 ", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 39, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/6/7958bbff555825afce8091dbab102791-98.jpg", "descriptions": "THPS 5 offers a new take on combo-driven skateboarding, the most advanced Pro Skater online multiplayer experience in a Tony Hawk game, and a state-of-the-art skatepark builder. Ride, build, and repeat."}, {"name": "Turn It Around", "details_link": "https://www.metacritic.com/game/ds/turn-it-around", "publisher": "Majesco Games", "release_date": "Aug 28 2007", "developers": ["Taito Corporation", "505 Games"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "General", "General", "Party / Minigame"], "meta_score": 39, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/9c87cdd06f96109b8fff96bf6b514e24-98.jpg", "descriptions": "Turn It Around is a unique arcade experience that features 24 mini-games focused on Touch Screen spinning. Use your turn wheel to master speed, technique or power in games that range from Arkanoid to Golf. You can even take on a friend in three multiplayer modes. Get ready to chase your tailTurn It Around is a unique arcade experience that features 24 mini-games focused on Touch Screen spinning. Use your turn wheel to master speed, technique or power in games that range from Arkanoid to Golf. You can even take on a friend in three multiplayer modes. Get ready to chase your tail and Turn It Around! [Majesco Games]… Expand"}, {"name": "Pacific Rim", "details_link": "https://www.metacritic.com/game/xbox-360/pacific-rim", "publisher": "Yuke's", "release_date": "Jul 12 2013", "developers": ["Yuke's"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "General", "General", "Fighting", "3D"], "meta_score": 39, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/8/4e380dc41a4411c41a61d6e3176e7ef1-98.jpg", "descriptions": "Pacific Rim is a digital downloadable title to be released on the Xbox LIVE that recreates the mega-scale battles between Jaegers and Kaiju depicted in the \"Pacific Rim\" film."}, {"name": "Alone in the Dark", "details_link": "https://www.metacritic.com/game/wii/alone-in-the-dark", "publisher": "Atari", "release_date": "Jun 23 2008", "developers": ["Hydravision"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 39, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/0/4b38909a6ba778affbb19a9c3a2af3ab-98.jpg", "descriptions": "Taking inspiration from the presentation style and structure of a number of acclaimed and globally popular TV action dramas, Alone in the Dark is split into a number of distinct episodes in a season-style format. With approximately 30-40 minutes of gameplay comprising each episode, theTaking inspiration from the presentation style and structure of a number of acclaimed and globally popular TV action dramas, Alone in the Dark is split into a number of distinct episodes in a season-style format. With approximately 30-40 minutes of gameplay comprising each episode, the structure of Alone in the Dark is adapted for an audience familiar with the hard-hitting bite-size delivery of contemporary TV dramas, offering easy accessibility whether the player has hours to devote or only wants a quick TV-style fix. Each time the player launches a saved game, the episode begins with a video summary of the previous episode to quickly re-immerse the player in the story, removing the need to remember where they were or what they were doing. Every episode closes with a nail-biting cliff-hanger ending to rattle players' nerves, and if the player is leaving the game a video teaser of the next episode plays to leave them wanting more. Alone in the Dark returns with a heart-stopping survival experience realized through the use of state-of-the-art real-time physics and unprecedented environmental interaction. Delivering an action-orientated experience within a highly detailed, open environment, Alone in the Dark once again strives innovation and excellence within the genre. [Atari]… Expand"}, {"name": "Star Wars: Flight of the Falcon", "details_link": "https://www.metacritic.com/game/game-boy-advance/star-wars-flight-of-the-falcon", "publisher": "THQ", "release_date": "Nov 18 2003", "developers": ["Pocket Studios"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 39, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/509be2aacd3595bb8431a0b934ff236e-98.jpg", "descriptions": "In Star Wars: Flight of the Falcon, you get the chance to jump into the cockpit of one of the most popular ships in the Star Wars universe. As the pilot of the Millennium Falcon, as well as other spacecraft, you can relive the battles of Yavin and Endor as TIE fighters and bombers attempt toIn Star Wars: Flight of the Falcon, you get the chance to jump into the cockpit of one of the most popular ships in the Star Wars universe. As the pilot of the Millennium Falcon, as well as other spacecraft, you can relive the battles of Yavin and Endor as TIE fighters and bombers attempt to take you out. On the planet's surface and in outer space, you'll engage enemies through 14 intense missions filled with upgradable weapons and shields. … Expand"}, {"name": "Putty Squad", "details_link": "https://www.metacritic.com/game/playstation-4/putty-squad", "publisher": "Maximum Games", "release_date": "Mar 11 2014", "developers": ["System 3"], "platforms": ["3DS", "PlayStation Vita", "Xbox 360", "PlayStation 4"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 38, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/2/f64e820d5ff20901a5efd3db26670d9d-98.jpg", "descriptions": "The stretchy blue blob is all set to go digital in high resolution by way of the critically acclaimed Putty Squad videogame. Cited by many gaming publications as one of the best games of its time, Putty Squad follows the story of unlikely hero Putty in an old-skool platform-adventuring questThe stretchy blue blob is all set to go digital in high resolution by way of the critically acclaimed Putty Squad videogame. Cited by many gaming publications as one of the best games of its time, Putty Squad follows the story of unlikely hero Putty in an old-skool platform-adventuring quest for his kidnapped friends.… Expand"}, {"name": "CrossfireX", "details_link": "https://www.metacritic.com/game/xbox-series-x/crossfirex", "publisher": "Smilegate", "release_date": "Feb 10 2022", "developers": ["Smilegate"], "platforms": ["Xbox One", "Xbox Series X"], "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 38, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/8/3650b3884f8c570ca41b2788ff674376-98.jpg", "descriptions": "CrossfireX delivers an intense first-person shooter experience where players are immersed in a sprawling global conflict between the world's two most formidable private military factions: Global Risk employs veterans of powerful armed forces who use advanced technologies to fight for orderCrossfireX delivers an intense first-person shooter experience where players are immersed in a sprawling global conflict between the world's two most formidable private military factions: Global Risk employs veterans of powerful armed forces who use advanced technologies to fight for order and security; Black List employs hardened mercenaries trained in guerilla tactics who fight to destabilize oppressive regimes in the name of freedom. Choose your side and complete objective-based missions across a variety of classic and innovative modes featuring tightly crafted gameplay and cinematic visuals.… Expand"}, {"name": "Motocross Mania 3", "details_link": "https://www.metacritic.com/game/xbox/motocross-mania-3", "publisher": "2K Games", "release_date": "Apr 27 2005", "developers": ["Deibus Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 38, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/4/77886f92cb26f71f798c27d8cdc092d8-98.jpg", "descriptions": "Mania has spread across the land as people have turned traditional motocross racing into an intense blood sport. Furious combat mixes with fast paged racing through deadly courses that range from populated city streets to harsh open environments. Mania is here and ready to fight. The winnerMania has spread across the land as people have turned traditional motocross racing into an intense blood sport. Furious combat mixes with fast paged racing through deadly courses that range from populated city streets to harsh open environments. Mania is here and ready to fight. The winner is the one to make it across the finish line still in one piece.… Expand"}, {"name": "Burnout Legends", "details_link": "https://www.metacritic.com/game/ds/burnout-legends", "publisher": "EA Games", "release_date": "Nov 29 2005", "developers": ["Visual Impact"], "platforms": "DS", "num_players": "1-6 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 38, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/b8d0c3f4b234185167bf21c42d833adc-98.jpg", "descriptions": "Inflict carnage and destruction as you tear through the best from the Burnout series made exclusively for handheld gaming. Race the legends, take on an Eliminator Challenge, or track down offenders in your high-performance cop car to unlock classic and new Burnout vehicles. Then goInflict carnage and destruction as you tear through the best from the Burnout series made exclusively for handheld gaming. Race the legends, take on an Eliminator Challenge, or track down offenders in your high-performance cop car to unlock classic and new Burnout vehicles. Then go head-to-head in Wi-Fi multiplayer races to capture your friends' cars. Lay down the law in Pursuit mode or crash your way through a world tour and then share the explosive race action over Wi-Fi. Burnout Legends is a license to unleash adrenaline-fuelled mayhem anywhere you want. [Electronic Arts]… Expand"}, {"name": "Dead or Alive Paradise", "details_link": "https://www.metacritic.com/game/psp/dead-or-alive-paradise", "publisher": "Tecmo", "release_date": "Mar 30 2010", "developers": ["Team Ninja", "Tecmo"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "General", "Party / Minigame"], "meta_score": 38, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/9c6997e04101ea97a973d840803ecbfa-98.jpg", "descriptions": "Welcome to paradise! Hang out with the sexy ladies of Dead or Alive and have some fun under the sun. Picture yourself relaxing on the shores of New Zack Island where you get to mingle, flirt, play, take snapshots, and challenge the girls in various mini-games during a two-week vacation!"}, {"name": "Balan Wonderworld", "details_link": "https://www.metacritic.com/game/pc/balan-wonderworld", "publisher": "Square Enix", "release_date": "Mar 26 2021", "developers": ["Square Enix", "Arzest", "Balan Company"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 38, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/a1f032a9da7d8921d2b26528a42abd89-98.jpg", "descriptions": "BALAN WONDERWORLD is an action platformer game themed around the Balan Theatre. Led by the enigmatic maestro named Balan, the stars of the show Emma and Leo will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land ofBALAN WONDERWORLD is an action platformer game themed around the Balan Theatre. Led by the enigmatic maestro named Balan, the stars of the show Emma and Leo will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land of Wonderworld. Here memories and vistas from the real world mix with the things that people hold dear. Twelve different tales await our stars in the Wonderworld, each with their own unique quirks. They will explore all corners of these labyrinthine stages, filled with a myriad of tricks and traps, to get to the heart of each story.… Expand"}, {"name": "Battleship", "details_link": "https://www.metacritic.com/game/xbox-360/battleship", "publisher": "Activision", "release_date": "May 15 2012", "developers": ["Double Helix Games"], "platforms": ["3DS", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Board Games", "Shooter", "Board Games", "First-Person", "Tactical"], "meta_score": 38, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/7/f69602c4003c70f26f9a75cab5eaad38-98.jpg", "descriptions": "Combining naval strategy simulation with first-person shooter gameplay, players fend off the enemy beachside while ordering attacks against their marine counterparts. Seamlessly switching between battlefield and overview \"Battle Command\" map, the Hasbro game is brought to life asCombining naval strategy simulation with first-person shooter gameplay, players fend off the enemy beachside while ordering attacks against their marine counterparts. Seamlessly switching between battlefield and overview \"Battle Command\" map, the Hasbro game is brought to life as carriers, frigates, cruisers, destroyers, submarines and the legendary USS Missouri Battleship pummel the enemy in a race to strategic points that turn the tide of battle.  The Battleship videogame is a next-gen marvel perfectly suited to turn nostalgic game junkies into battle-hardened admirals.… Expand"}, {"name": "Battle: Los Angeles", "details_link": "https://www.metacritic.com/game/pc/battle-los-angeles", "publisher": "Konami", "release_date": "Mar 11 2011", "developers": ["Saber Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 38, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/3/2fd7a010d681009669e464ff62c3e1d8-98.jpg", "descriptions": "Players will have the opportunity to relive the thrill of the movie as they assume the role of Corporal Lee Imlay and fight alongside characters from the film and defend the city of Los Angeles from attacks from unknown forces."}, {"name": "Attack of the Movies 3D", "details_link": "https://www.metacritic.com/game/xbox-360/attack-of-the-movies-3d", "publisher": "Majesco Games", "release_date": "May 18 2010", "developers": ["Panic Button"], "platforms": "Xbox 360", "genres": ["Action", "General", "General", "Shooter", "Light Gun"], "meta_score": 38, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/9/f2e66ae4309f4f0c0cc98d2ab2c2ecb9-98.jpg", "descriptions": "Bursting through your TV screen are the most fearsome foes in movie history! Throw on your 3-D glasses and grab your controller to face off against swarms of enemies in the first 3-D shooter for Xbox 360. All in glorious 3-D! Attack of the Movies 3-D is the first 3-D shooter for Xbox 360®.Bursting through your TV screen are the most fearsome foes in movie history! Throw on your 3-D glasses and grab your controller to face off against swarms of enemies in the first 3-D shooter for Xbox 360. All in glorious 3-D! Attack of the Movies 3-D is the first 3-D shooter for Xbox 360®. The creatures and backgrounds come to life in all their glory, providing amazing dimensionality previously found only in movie theaters. 3D glasses included in the box! Four pairs of 3-D glasses let the whole family enjoy the action. 6 action-packed scenes! Each level is movie-themed and puts you in the heat of battle. Defeat large alien space cruisers in Cosmic Combat, join the resistance against the machines, destroy the machine mainframe in Robot Rebellion, and more. 4-Player Multiplayer! Features arcade-style multiplayer gameplay for up to four players. Players cooperate to get past challenges while still competing for the highest score. Exotic weaponry! In each level, you are provided with three ultimate weapons to use against the enemies of that genre. You’ll have access to the quintessential zombie-slaying shotgun in the horror level while using the automatic laser cannon in the science fiction level, and much more. [Majesco]… Expand"}, {"name": "Painkiller: Resurrection", "details_link": "https://www.metacritic.com/game/pc/painkiller-resurrection", "publisher": "DreamCatcher Interactive", "release_date": "Oct 27 2009", "developers": ["Homegrown Games"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Arcade"], "meta_score": 38, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/9/6a13b053a132911cc0d0965c27646b17-98.jpg", "descriptions": "William \"Wild Bill\" Sherman, an ex CIA Agent and specialist for dangerous missions in the Black Ops Special Unit has a big problem: during his last job, he has managed to not only kill the head of an illegal drug operation and a slew of innocent civilians, but himself in a fatal mistake.William \"Wild Bill\" Sherman, an ex CIA Agent and specialist for dangerous missions in the Black Ops Special Unit has a big problem: during his last job, he has managed to not only kill the head of an illegal drug operation and a slew of innocent civilians, but himself in a fatal mistake. Trapped in a hostile place between heaven and hell, his soul flickers between the millions of faceless infidels and good and evil forces start to use Wild Bill for their own needs. But, it turns out that nothing is as it seemed at the beginning - solve the mystery and give the equilibrium between heaven and hell a little flip! [DreamCatcher]… Expand"}, {"name": "Umbrella Corps", "details_link": "https://www.metacritic.com/game/playstation-4/umbrella-corps", "publisher": "Capcom", "release_date": "Jun 21 2016", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 38, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/6/b59edf8eb99e80955d235758f251a690-98.jpg", "descriptions": "Umbrella Corps brings a competitive experience featuring new types of strategy and technique blended with elements from the world of Resident Evil, to create a \"unique\" kind of shooter."}, {"name": "G.I. Combat", "details_link": "https://www.metacritic.com/game/pc/gi-combat", "publisher": "Strategy First", "release_date": "Nov  4 2002", "developers": ["Freedom LLC"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Wargame", "Real-Time", "General"], "meta_score": 38, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/4/4695336f4bf18a4c7febda9ef906ab7f-98.jpg", "descriptions": "A continuous real time strategy game engulfing the player in the dynamic conflicts of the Second World War. The full three-dimensional environment provides unsurpassed detail for terrain, armour penetration, vehichle movement and weapons fire. Immerse yourself in the struggle to hold backA continuous real time strategy game engulfing the player in the dynamic conflicts of the Second World War. The full three-dimensional environment provides unsurpassed detail for terrain, armour penetration, vehichle movement and weapons fire. Immerse yourself in the struggle to hold back enemy offensives, capture vital crossroads, or lead an elite squad to capture key strategic targets. [Strategy First Inc.]… Expand"}, {"name": "Driven", "details_link": "https://www.metacritic.com/game/playstation-2/driven", "publisher": "Bam Entertainment", "release_date": "Nov  6 2001", "developers": ["Bam Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 38, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/6/92dccb9a7baf68cc9272eb4ec104c43c-98.jpg", "descriptions": "Based on the Sylvester Stallone film, Driven features eight teams, 12 drivers each with distinct personalities and driving styles. Surrounded by fast cars, fame, money, and women, drive as Jimmy Bly and Joe Tanto of 'Team Spirit'. Pitted against their archrivals, Beau Brandenburg and MaxBased on the Sylvester Stallone film, Driven features eight teams, 12 drivers each with distinct personalities and driving styles. Surrounded by fast cars, fame, money, and women, drive as Jimmy Bly and Joe Tanto of 'Team Spirit'. Pitted against their archrivals, Beau Brandenburg and Max Manley, gamers will fight for survival. [bam! Entertainment]… Expand"}, {"name": "Pimp My Ride", "details_link": "https://www.metacritic.com/game/xbox-360/pimp-my-ride", "publisher": "Activision", "release_date": "Dec  6 2006", "developers": ["Eutechnyx"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Other", "Other"], "meta_score": 38, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/4/8f09f61ad292ede3f9f971d4a5f4fc1d-98.jpg", "descriptions": "Enter Pimp City, where bling is king, and style is everything. On these streets, if your car isn't fully pimped out, you'd be better off walking. You and Xzibit will take on the challenge of hooking up your homies, and transforming their hoopties, buckets and beaters into the hottest whipsEnter Pimp City, where bling is king, and style is everything. On these streets, if your car isn't fully pimped out, you'd be better off walking. You and Xzibit will take on the challenge of hooking up your homies, and transforming their hoopties, buckets and beaters into the hottest whips on the street, while redlining through the highways and alleyways of Pimp City. You choose the mods, you choose the route, but pimpin' ain't easy. It will take speed and style to hook them up. Do you have what it takes to Pimp Their Ride? Xzibit will guide you through every stage of the pimping process - true Xzibit hilarity with lines and voice recording from Xzibit himself. Authentic people, broken rides - each mission will feature a person who truly needs their ride (and their life) pimped. Outrageous car modifications not for your typical car. Intense redline street racing through the city's 'hoods to create the most pimped out ride. New School meets Old School - an MTV generation focus in delivery of art, music and sound, featuring Zxibit's latest hip-hop tracks, and retro whips in need of modern bling. 5 unique boroughs , all free roam envorinments for the ultimate combination of racing and pimping. 16 vehicles in all - one for each of the 15 \"customers\" plus Xzibit's own high-rolling feature ride. Over 15 suppliers per borough and 100s of parts, from tires and rims to bumpin' subwofer systems and high-def display panels. So many parts, so many combinations, so much replayability. [Activision]… Expand"}, {"name": "Godzilla Unleashed", "details_link": "https://www.metacritic.com/game/playstation-2/godzilla-unleashed", "publisher": "Atari", "release_date": "Nov 20 2007", "developers": ["Pipeworks Software", "Inc."], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 38, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/0a91f4ed1eff31a415a319889a02c38c-98.jpg", "descriptions": "Godzilla: Unleashed is a fighting game on a giant scale, starring the legendary Godzilla and a slew of at least 20 of some of the most renowned monsters of all-time. Gamers are challenged to save the planet from mayhem and destruction, but not before causing some of their own. Set in nineGodzilla: Unleashed is a fighting game on a giant scale, starring the legendary Godzilla and a slew of at least 20 of some of the most renowned monsters of all-time. Gamers are challenged to save the planet from mayhem and destruction, but not before causing some of their own. Set in nine urban arenas, Godzilla: Unleashed’s interactive 3D cityscapes, big destructible buildings, soaring skyscrapers and towering alien formations provide the backdrop to epic worldwide destruction. The character line-up on the PlayStation 2 system features new monsters not found on the Nintendo DS and Wii versions of the game. Players fight at least 20 monsters, with the newcomers fighting alongside or against favorites from past Godzilla video games. Godzilla: Unleashed features an innovative non-linear storyline which allows players to influence how the story unfolds through their choices within battles, and a flexible multiplayer mode which supports up to four players for the ultimate city-crushing monster extravaganza. [Atari]… Expand"}, {"name": "DARK", "details_link": "https://www.metacritic.com/game/xbox-360/dark", "publisher": "Kalypso", "release_date": "Jul  9 2013", "developers": ["Kalypso", "Realmforge Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern", "Linear"], "meta_score": 38, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/2/18b9a7e3de5f30e851c3f9d85ae8cc72-98.jpg", "descriptions": "DARK is a stealth action game with RPG elements that lets you slip into the role of the ultimate killer... a vampire. Stalk you enemies from the shadows and use vicious vampire abilities to attack and silently dispatch them. The story of DARK engulfs you in a world full of blood and darknessDARK is a stealth action game with RPG elements that lets you slip into the role of the ultimate killer... a vampire. Stalk you enemies from the shadows and use vicious vampire abilities to attack and silently dispatch them. The story of DARK engulfs you in a world full of blood and darkness in which the hunter can become the hunted at any time. As you unravel the mystery behind the global conglomerate that seems omnipresent and all-powerful, continually improve your character by developing powerful skills to aid you in remaining unobserved, or make quick process of those unfortunate to take too keen an interest in you.… Expand"}, {"name": "The Walking Dead: Survival Instinct", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-survival-instinct", "publisher": "Activision", "release_date": "Mar 19 2013", "developers": ["Terminal Reality"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "genres": ["Action", "Action Adventure", "Shooter", "Shooter", "Survival", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 38, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/5/7959e4d54cfb2aebb8d4f40b2d54064e-98.jpg", "descriptions": "Terminal Reality’s The Walking Dead video game takes the undead and brings them out of the TV show and into console gaming systems in a new, terrifying way.  The iconic walkers will relentlessly hunt down players like their television counterparts, using a combination of sight, sound andTerminal Reality’s The Walking Dead video game takes the undead and brings them out of the TV show and into console gaming systems in a new, terrifying way.  The iconic walkers will relentlessly hunt down players like their television counterparts, using a combination of sight, sound and smell.  As Daryl, players will need to tread carefully throughout each new area they explore.  Once discovered, it doesn’t take much to attract an unstoppable horde of undead walkers, so every threat needs to be assessed, and every situation analyzed.  Players will have to choose between whether to stay and fight while risking a gruesome death or using stealth to avoid the undead.  No place is truly safe for Daryl as he makes his way through the Georgia countryside in this new, post-apocalyptic world.… Expand"}, {"name": "Teenage Mutant Ninja Turtles: Out of the Shadows", "details_link": "https://www.metacritic.com/game/xbox-360/teenage-mutant-ninja-turtles-out-of-the-shadows", "publisher": "Activision", "release_date": "Aug 28 2013", "developers": ["Red Fly Studio"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 38, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/f4d6965974845a57bffba0f802d0a66c-98.jpg", "descriptions": "The oldest brother, Leonardo is the leader of the four Turtles – an accomplished tactician possessing a discipline and focus as sharp as his blades. His selfless sense of responsibility for the family sometimes puts him at odds with the headstrong Raphael, who too often only thinks ofThe oldest brother, Leonardo is the leader of the four Turtles – an accomplished tactician possessing a discipline and focus as sharp as his blades. His selfless sense of responsibility for the family sometimes puts him at odds with the headstrong Raphael, who too often only thinks of himself. With a katana in each hand, Leo is the most well-rounded fighter in the Turtle roster, balanced by an unwavering dedication to his training. He is without a standout strength or glaring weakness, defined by a general aptitude for speed, reach, damage, and reactiveness, making him the easiest for novice players to pick up and play.… Expand"}, {"name": "Naruto Shippuden: Dragon Blade Chronicles", "details_link": "https://www.metacritic.com/game/wii/naruto-shippuden-dragon-blade-chronicles", "publisher": "Tomy Corporation", "release_date": "Nov 12 2010", "developers": ["Eighting", "Takara Tomy"], "platforms": "Wii", "genres": ["Action", "General", "Fighting", "General", "3D"], "meta_score": 38, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/5/351507b6fc8ee8349d89837b8fe6055b-98.jpg", "descriptions": "Take control of both Naruto and Sasuke as they go their own ways to seek out the mysteries and power behind Genryu, the mighty Elemental Dragons, in an all-new epic adventure. The world is in danger and only the power of the legendary Dragon Blade and rare elemental orbs hidden across theTake control of both Naruto and Sasuke as they go their own ways to seek out the mysteries and power behind Genryu, the mighty Elemental Dragons, in an all-new epic adventure. The world is in danger and only the power of the legendary Dragon Blade and rare elemental orbs hidden across the land can save it.  As Naruto, you will use special orbs collected from the powerful Genryu to enhance your Dragon Blade with new powers, acquire new skills by finding and equipping dozens of Ninja Scrolls hidden throughout the world, and take on gigantic dragons in incredible boss battles! With two superstars in one game, you won't want to miss this amazing adventure… Expand"}, {"name": "Vampire Rain", "details_link": "https://www.metacritic.com/game/xbox-360/vampire-rain", "publisher": "Ignition Entertainment", "release_date": "Jul  3 2007", "developers": ["Artoon"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "8  Online", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 38, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/8/44a65291d7d18efc0ce897a3c7966fe3-98.jpg", "descriptions": "You are a part of a Special Forces team tasked with removing the Nightwalkers in all their gore and supernatural strength before they overrun the world – and before the public finds out about them. Features powerful, wicked fast Nightwalkers. Utilize weapons, strategy and even theYou are a part of a Special Forces team tasked with removing the Nightwalkers in all their gore and supernatural strength before they overrun the world – and before the public finds out about them. Features powerful, wicked fast Nightwalkers. Utilize weapons, strategy and even the environment (Rain weakens Nightwalker power). Mix it up; missions have a beginning and end – you decide everything in the middle. Dark, intense, eerie world expands as you play.… Expand"}, {"name": "Thor: God of Thunder", "details_link": "https://www.metacritic.com/game/xbox-360/thor-god-of-thunder", "publisher": "Sega", "release_date": "May  3 2011", "developers": ["Liquid Entertainment"], "platforms": ["3DS", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 38, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/9b572e19d7802289036ac7de6d89943e-98.jpg", "descriptions": "Thor: The Video Game will take players through a spectacular, epic-scale original third-person adventure for which Matt Fraction, the Eisner Award-winning writer and lead Thor comic book author served as story consultant. In the game, Thor battles through the numerous worlds of NorseThor: The Video Game will take players through a spectacular, epic-scale original third-person adventure for which Matt Fraction, the Eisner Award-winning writer and lead Thor comic book author served as story consultant. In the game, Thor battles through the numerous worlds of Norse mythology that span realms ranging from primal worlds of fire and ice to extraordinary planets inhabited by Frost Giants and Trolls to save Asgard, the capital city of the Norse Gods. Thor must overcome monstrous foes lifted from the pages of the comics including Ulik, Ymir, and Surtur, as well as other monstrous denizens. Players will wield the iconic Mjolnir, Thor’s legendary hammer, to fight enemies on an immense scale while controlling the elemental storm powers of lightning, thunder, and wind to vanquish enemies. As Thor earns Valor points through his exploits, players can acquire new abilities, powers, and weapon upgrades.… Expand"}, {"name": "Project Root", "details_link": "https://www.metacritic.com/game/xbox-one/project-root", "publisher": "Reverb Triple XP", "release_date": "Apr 29 2015", "developers": ["Pablo Testa"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 38, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/4/ca05247eed3faf02f6ce6adfe7796bcc-98.jpg", "descriptions": "Ending Demetrio Watts is in the hands of a group of unknowns. Depends on Arcturus. The classic choot-em-'up scenario."}, {"name": "Carnival Games: Mini-Golf", "details_link": "https://www.metacritic.com/game/wii/carnival-games-mini-golf", "publisher": "2K Play", "release_date": "Oct 20 2008", "developers": ["Cat Daddy Games"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 38, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/cbaa4ff206d8e37303bd791be2f80213-98.jpg", "descriptions": "Carnival Games: Mini-Golf features Carnival Bob and characters made popular in the original, Carnival Games: Mini-Golf is home to larger-than-life, theme park style miniature golf courses. Whether back in time to the land of dinosaurs, keeping order in the Wild West or searching for treasureCarnival Games: Mini-Golf features Carnival Bob and characters made popular in the original, Carnival Games: Mini-Golf is home to larger-than-life, theme park style miniature golf courses. Whether back in time to the land of dinosaurs, keeping order in the Wild West or searching for treasure on an island full of pirates, the game combines traditional miniature golf fare with action-oriented game play utilizing the unique capabilities of the Wii Remote. It is designed for four players and can best be described as “a hole in fun.” [2K Games]… Expand"}, {"name": "Seven Kingdoms: Conquest", "details_link": "https://www.metacritic.com/game/pc/seven-kingdoms-conquest", "publisher": "Enlight Software", "release_date": "Oct 15 2007", "developers": ["Enlight Software", "Infinite Interactive"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Command"], "meta_score": 38, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/4/e1593e5ff6d52471267ad6243a94cb23-98.jpg", "descriptions": "Seven Kingdoms: Conquest offers strategy fans the choice to play as human or demon in epic battles spanning 6,000 years on Earth. Starting in ancient Egypt in 3000 B.C. and ending in a final battle on a futuristic Earth, players will have to have their fingers on the pulse of theirSeven Kingdoms: Conquest offers strategy fans the choice to play as human or demon in epic battles spanning 6,000 years on Earth. Starting in ancient Egypt in 3000 B.C. and ending in a final battle on a futuristic Earth, players will have to have their fingers on the pulse of their civilization as the two races clash every 1,000 years. [Enlight]… Expand"}, {"name": "Kengo: Legend of the 9", "details_link": "https://www.metacritic.com/game/xbox-360/kengo-legend-of-the-9", "publisher": "Majesco Games", "release_date": "Sep 11 2007", "developers": ["Genki"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 38, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/1/61e02ce5d891bc5808e49d5d925224ef-98.jpg", "descriptions": "(Also known as \"Kengo Zero\")  Kengo: Legend of the 9 sets players in feudal Japan on a mission to become the best samurai warrior in the land. The game features nine real samurai warriors: Musashi Miyamoto, Jubei Yagyu and Sanako Chiba, among others. Each has his/her own storyline, attack(Also known as \"Kengo Zero\")  Kengo: Legend of the 9 sets players in feudal Japan on a mission to become the best samurai warrior in the land. The game features nine real samurai warriors: Musashi Miyamoto, Jubei Yagyu and Sanako Chiba, among others. Each has his/her own storyline, attack techniques and upgradeable attributes (health, stamina, attack power and defense). Four modes of play offer a range of gameplay options, including the storyline advancing Main Mode; Mission Mode which challenges players to complete 10 missions within a specific time frame; Combat Mode that features two-player, head-to-head battles; and Xbox Live Leaderboard where players compete for new equipment and the best ranking against other Xbox Live gamers by pitting AI profiles against each other. [Majesco]… Expand"}, {"name": "The Simpsons Skateboarding", "details_link": "https://www.metacritic.com/game/playstation-2/the-simpsons-skateboarding", "publisher": "Electronic Arts", "release_date": "Nov 11 2002", "developers": ["The Code Monkeys"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 38, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/4/a0a28686605782a1a92ab3f458f2d38b-98.jpg", "descriptions": "Grab your board and a nice piece of asphalt! A Skate Tour has come to Springfield, and the entire town has gone skate crazy on the half-pipes, ramps, and rails. Super skater Bart Simpson is the favorite to win the whopping $$ Mega-bucks $$ prize of $99, but Homer, Krusty, and many others areGrab your board and a nice piece of asphalt! A Skate Tour has come to Springfield, and the entire town has gone skate crazy on the half-pipes, ramps, and rails. Super skater Bart Simpson is the favorite to win the whopping $$ Mega-bucks $$ prize of $99, but Homer, Krusty, and many others are going to show just what they're capable of when money's at stake. So quit your job, skip class, and get to Springfield!… Expand"}, {"name": "Blades of Time", "details_link": "https://www.metacritic.com/game/switch/blades-of-time", "publisher": "Gaijin Distribution", "release_date": "May 14 2019", "developers": ["Gaijin Distribution"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Beat-'Em-Up", "3D"], "meta_score": 38, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/58b8a3f4caef92a7ffc11a1d9e2f84ee-98.jpg", "descriptions": "In Blades of Time, players don the persona of the gorgeous gunsword-wielding treasure hunter, Ayumi. Blessed with beauty and a trigger happy finger, she's on a mission to find lost bounties in a mysterious and dangerous island. Quickly, she learns this island isn't just trees, berries andIn Blades of Time, players don the persona of the gorgeous gunsword-wielding treasure hunter, Ayumi. Blessed with beauty and a trigger happy finger, she's on a mission to find lost bounties in a mysterious and dangerous island. Quickly, she learns this island isn't just trees, berries and gold - but something more sinister lies beneath the surface. As the wonderment of the island becomes to reveal itself, she learns this land can gift her powers man can only dream of, but also she's not alone on this island! Thank goodness she brought her own weapons. Ayumi then proceeds to battle against menacing villains on the island by destroying them and everything in her path while looking to acquire magical powers that only the strongest warrior can possess.… Expand"}, {"name": "Rock Revolution", "details_link": "https://www.metacritic.com/game/xbox-360/rock-revolution", "publisher": "Konami", "release_date": "Oct 15 2008", "developers": ["Zoe Mode", "HB Studios Multimedia"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "6  Online", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 38, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/2bbe71ec0ac0f9198eeb159cf5e194ac-98.jpg", "descriptions": "Release your inner rockstar or allow your friends the privilege of picking up guitar, bass, drums, and microphone peripherals to 40 rock and roll tracks. Online and offline multiplayer, versus, coop and band battle with rehearsal mode and career mode."}, {"name": "Legend of the Dragon", "details_link": "https://www.metacritic.com/game/psp/legend-of-the-dragon", "publisher": "The Game Factory", "release_date": "May 29 2007", "developers": ["Neko Entertainment"], "platforms": ["PlayStation 2", "PSP"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 38, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/1d3232282b62df2f1911fdfad218124c-98.jpg", "descriptions": "Legend of the Dragon is centred on the story of the signs of the ancient Chinese zodiac, which holds great mystical power. Each sign has its own temple, and each temple has its own guardian. The evil Zodiac Master is trying to attain the powers of the twelve guardians as that will make himLegend of the Dragon is centred on the story of the signs of the ancient Chinese zodiac, which holds great mystical power. Each sign has its own temple, and each temple has its own guardian. The evil Zodiac Master is trying to attain the powers of the twelve guardians as that will make him virtually unstoppable. One thing stands in his way: the Golden Dragon. When the Chinese martial arts student, Ang, is chosen over his twin sister Ling to be the next Golden Dragon destined to fight the Zodiac Master, Ling joins the dark side in a quest for redemption. In the battle between good and evil both heroes and villains have magic wristbands that can transform them into mythical warriors, giving them the precise likeness and superhuman powers of the zodiac creature they represent. Each of the 18 playable characters has a unique fighting technique and, therefore, must be played differently. Characters transform themselves into magical warriors using their wristbands. When transformed they perform different types of magic and cast spells based on their Chinese astrological sign. 4 challenging single-player modes: Quest, Arcade, Survival and Time. 3 exciting multiplayer-modes: Versus, Team Battle and Tag. [The Game Factory]… Expand"}, {"name": "Heavy Fire: Red Shadow", "details_link": "https://www.metacritic.com/game/playstation-4/heavy-fire-red-shadow", "publisher": "Mastiff", "release_date": "Oct 16 2018", "developers": ["Mastiff"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 38, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/8/20ce6a5430c443d0b8fc8c4a73f2eb97-98.jpg", "descriptions": "In Heavy Fire: Red Shadow, tension between a bold North Korea, which has managed to unify with South Korea entirely on its terms, and the United States has gone beyond its breaking point."}, {"name": "Terminator 3: Rise of the Machines", "details_link": "https://www.metacritic.com/game/playstation-2/terminator-3-rise-of-the-machines", "publisher": "Atari", "release_date": "Nov 11 2003", "developers": ["Black Ops Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 38, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/39353c6ab2a0090e9bdaa5273e848682-98.jpg", "descriptions": "Terminator 3: Rise of the Machines, the videogame, will capitalize on every aspect of the feature film's popularity, from a mind-bending plot that closely follows the movie's script to the first ever appearance of Arnold Schwarzenegger's likeness and voice in a videogame. [Atari]"}, {"name": "SoulCalibur: Lost Swords", "details_link": "https://www.metacritic.com/game/playstation-3/soulcalibur-lost-swords", "publisher": "Bandai Namco Games", "release_date": "Apr 22 2014", "developers": ["Bandai Namco Games", "Project Soul"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "3D"], "meta_score": 38, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/4/40144df5d0ccc6ffbcc13a53cb2aac90-98.jpg", "descriptions": "A free-to-play game. There are some changes to the Soulcalibur formula implemented in Lost Swords. The game is single-player only and revolves around players making their way through a series of quests to gain items. These items can be accessories such as clothing options or new weapons toA free-to-play game. There are some changes to the Soulcalibur formula implemented in Lost Swords. The game is single-player only and revolves around players making their way through a series of quests to gain items. These items can be accessories such as clothing options or new weapons to give your character extra flair or increased stats. These upgraded items will be essential as you tackle later quests.… Expand"}, {"name": "Dying: Reborn", "details_link": "https://www.metacritic.com/game/playstation-4/dying-reborn", "publisher": "Oasis Games", "release_date": "Feb 28 2017", "developers": ["Nekcom"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 38, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/0c726c5718ec7b5ec0d57d809812e27b-98.jpg", "descriptions": "DYING: Reborn is a dark, horror-themed puzzle game that creates a unique first-person room escape experience. A mysterious fish-head nemesis, a grudge, a series of never-ending trials, and a shocking ending promise to satisfy your horror needs."}, {"name": "Harry Potter and the Deathly Hallows, Part 1", "details_link": "https://www.metacritic.com/game/playstation-3/harry-potter-and-the-deathly-hallows-part-1", "publisher": "Electronic Arts", "release_date": "Nov 16 2010", "developers": ["EA Bright Light"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 38, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/0/79294bcb1252d224218bbc1d520248c2-98.jpg", "descriptions": "Harry Potter takes a dark turn in this third-person shooter as he battles death eaters and dementors while fleeing for his life across the wilds of England."}, {"name": "Hello Neighbor", "details_link": "https://www.metacritic.com/game/pc/hello-neighbor", "publisher": "tinyBuild", "release_date": "Dec  8 2017", "developers": ["Dynamic Pixels"], "platforms": ["iPhone/iPad", "PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "First-Person"], "meta_score": 38, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/5d3cea16bfbbc8bcbeb900ffcdc9d2b0-98.jpg", "descriptions": "Hello Neighbor is a stealth-horror game about breaking into your neighbor’s house. Play against an advanced AI that learns from your actions, and counters them. Find out what horrible secrets your neighbor is hiding inside his basement."}, {"name": "Looney Tunes: Acme Arsenal", "details_link": "https://www.metacritic.com/game/playstation-2/looney-tunes-acme-arsenal", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct  9 2007", "developers": ["Red Tribe"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 38, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/54963c5c50b01032536e2b6d03d1d5cb-98.jpg", "descriptions": "Looney Tunes: Acme Arsenal is an action-adventure game featuring seven playable Looney Tunes characters, including Bugs Bunny, Daffy Duck, Tazmanian Devil, Foghorn Leghorn, Marvin the Martian, Gossamer and a special secret character, all rendered in high-definition, next-generation graphics.Looney Tunes: Acme Arsenal is an action-adventure game featuring seven playable Looney Tunes characters, including Bugs Bunny, Daffy Duck, Tazmanian Devil, Foghorn Leghorn, Marvin the Martian, Gossamer and a special secret character, all rendered in high-definition, next-generation graphics. Engaging in one or two player cooperative gameplay, gamers find themselves immersed in fast-paced combat, puzzle solving challenges and vehicle-based action in rich environments inspired by the popular, outlandish cartoon tales. Players command an arsenal of ACME melee and projectile weapons in outrageous battles and travel to various locations such as Camelot, Ancient Egypt, Mars, the Wild West, the trenches of World War II and more.  [Warner Bros. Interactive]… Expand"}, {"name": "ECW Anarchy Rulz", "details_link": "https://www.metacritic.com/game/dreamcast/ecw-anarchy-rulz", "publisher": "Acclaim", "release_date": "Dec 30 2000", "developers": ["Acclaim Studios Salt Lake City"], "platforms": "Dreamcast", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 38, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/75a9d5837c03052a0b23419eca71fd4a-98.jpg", "descriptions": "Anarchy in the USA!\r *All new control system!\r\n*First-ever blistering Brimstone match plus music from Dope & One Minute Silence!\r\n*The Bionic Elbow from \"The American Dream\" Dusty Rhodes!\r\n*Backlot brawls, all-new finishers & 2-man commentary!\r\n*Never before seen hardcoreAnarchy in the USA!\r *All new control system!\r*First-ever blistering Brimstone match plus music from Dope & One Minute Silence!\r*The Bionic Elbow from \"The American Dream\" Dusty Rhodes!\r*Backlot brawls, all-new finishers & 2-man commentary!\r*Never before seen hardcore table matches!\r*RVD, Tanaka, The Sandman & over 60 extreme wrestlers!… Expand"}, {"name": "Left Behind: Eternal Forces", "details_link": "https://www.metacritic.com/game/pc/left-behind-eternal-forces", "publisher": "Left Behind Games", "release_date": "Nov  7 2006", "developers": ["Left Behind Games"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 38, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/8/c12585620842cf653dd215c33b670d66-98.jpg", "descriptions": "Left Behind: Eternal Forces is a Real Time Strategy game. You, as the player, control your forces from a vantage point high above the action. You do not personally participate in the action; you command your units to perform tasks by giving orders via the game interface. You can order themLeft Behind: Eternal Forces is a Real Time Strategy game. You, as the player, control your forces from a vantage point high above the action. You do not personally participate in the action; you command your units to perform tasks by giving orders via the game interface. You can order them where to go and what to do whenever you wish. Lead the Tribulation Force from the book series, including Rayford, Chloe, Buck and Bruce against Nicolae Carpathia - the AntiChrist. Conduct physical & spiritual warfare : using the power of prayer to strengthen your troops in combat and wield modern military weaponry throughout the game world. Recover ancient scriptures and witness spectacular Angelic and Demonic activity as a direct consequence of your choices. [Left Behind Games]… Expand"}, {"name": "The Mummy: Tomb of the Dragon Emperor", "details_link": "https://www.metacritic.com/game/playstation-2/the-mummy-tomb-of-the-dragon-emperor", "publisher": "Sierra Entertainment", "release_date": "Jul 22 2008", "developers": ["Eurocom Entertainment Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 38, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/98376f6669e6ad046cb8067733c16aa1-98.jpg", "descriptions": "In the third-person action-adventure game The Mummy: Tomb of the Dragon Emperor, players take on the roles of Rick O'Connell and his son, Alex (played by Brendan Fraser and Luke Ford, respectively, in the film).  Gamers follow the lead characters on their harrowing journey - across exoticIn the third-person action-adventure game The Mummy: Tomb of the Dragon Emperor, players take on the roles of Rick O'Connell and his son, Alex (played by Brendan Fraser and Luke Ford, respectively, in the film).  Gamers follow the lead characters on their harrowing journey - across exotic locations from ancient Chinese catacombs to beautiful, but dangerous, Himalayan peaks - to defeat the revived servants of the Dragon Emperor (Jet Li).  The Mummy: Tomb of the Dragon Emperor allows players to switch seamlessly between gunplay and hand-to-hand melee attacks, and also features a fast and fluid combat system and an arsenal of weaponry that can be used to vanquish the many bone-chilling enemies players will face during their journey. [Sierra Entertainment]… Expand"}, {"name": "Evolution Snowboarding", "details_link": "https://www.metacritic.com/game/playstation-2/evolution-snowboarding", "publisher": "Konami", "release_date": "Nov 26 2002", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 38, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/d26603ef8d613c4b9cb8e19ce7ef6381-98.jpg", "descriptions": "The year is 20XX...the world has been overtaken by evil \"Boardriods\" and it's your job to save the slopes. Along with some of the top snowboarders in the world, including Danny Kass and Todd Richards, you'll take on a variety of enemies, challenges and boss characters as you attempt to winThe year is 20XX...the world has been overtaken by evil \"Boardriods\" and it's your job to save the slopes. Along with some of the top snowboarders in the world, including Danny Kass and Todd Richards, you'll take on a variety of enemies, challenges and boss characters as you attempt to win back the world mountain by mountain. Luckily, you're equipped with the latest in snowboarding gear to aid you in over 80 missions in 8 of the wickedest levels ever imagined! [Konami]… Expand"}, {"name": "Star Wars Episode II: Attack of the Clones", "details_link": "https://www.metacritic.com/game/game-boy-advance/star-wars-episode-ii-attack-of-the-clones", "publisher": "THQ", "release_date": "May 30 2002", "developers": ["David A. Palmer Productions"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 38, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/4/a229d505d1c4f72c503eff1272dc6102-98.jpg", "descriptions": "Certainly, there are worse games sitting on the store shelf. But not many."}, {"name": "The Ripping Friends", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-ripping-friends", "publisher": "THQ", "release_date": "Mar 24 2002", "developers": ["Creations"], "platforms": "Game Boy Advance", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 38, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/fdc333dcb2ac437a34aade8183229a5f-98.jpg", "descriptions": null}, {"name": "Steel Battalion: Heavy Armor", "details_link": "https://www.metacritic.com/game/xbox-360/steel-battalion-heavy-armor", "publisher": "Capcom", "release_date": "Jun 19 2012", "developers": ["From Software"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 38, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/3/e5f7e4c74431889d6d0dbf5e0909c4e6-98.jpg", "descriptions": "Utilizing a combination of Kinect and the regular Xbox 360 controller, Steel Battalion Heavy Armor thrusts players into the role of Sgt Powers, a veteran VT Pilot who is the only one who can change the course of war. Kinect allows for full control of the VT’s interface, as well asUtilizing a combination of Kinect and the regular Xbox 360 controller, Steel Battalion Heavy Armor thrusts players into the role of Sgt Powers, a veteran VT Pilot who is the only one who can change the course of war. Kinect allows for full control of the VT’s interface, as well as interaction with the comrades, while the regular controller gives players the precision expected from a first person shooter.… Expand"}, {"name": "Godzilla", "details_link": "https://www.metacritic.com/game/playstation-4/godzilla", "publisher": "Bandai Namco Games", "release_date": "Jul 14 2015", "developers": ["NATSUME ATARI Inc."], "platforms": ["PlayStation 3", "PlayStation 4"], "num_players": "Up to 3 ", "genres": ["Action", "Action Adventure", "General"], "meta_score": 38, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/1/e70b922f10b23ebc3eed94beccf90bc1-98.jpg", "descriptions": "Developed by Japanese videogame studio NATSUME ATARI, GODZILLA places players in control of one of the most famous and destructive monsters in entertainment history. As Godzilla players will trample and lay waste to cities and environments with the goal of taking out each area’s EnergyDeveloped by Japanese videogame studio NATSUME ATARI, GODZILLA places players in control of one of the most famous and destructive monsters in entertainment history. As Godzilla players will trample and lay waste to cities and environments with the goal of taking out each area’s Energy Generator while collecting as much G-Energy as possible. The G-Energy can then be used to power-up Godzilla, increasing both his physical size as well as his offensive and defensive skills. \r\rThe game will also allow players to utilize a dynamic Movie-Style Camera Angle System, delivering the most epic camera angles from which to destroy both a multitude of locations as well as classic enemies such as Mothra, King Ghidorah, and Mechagodzilla.… Expand"}, {"name": "XIII (Remake)", "details_link": "https://www.metacritic.com/game/xbox-one/xiii-remake", "publisher": "Microids", "release_date": "Nov 10 2020", "developers": ["PlayMagic Ltd"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 38, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/1/7662798949838b6a52dbee5dd82e1a3b-98.jpg", "descriptions": "XIII is a remake of the cult first-person action game that was initially released in 2003. You play as \"XIII\", a man without an identity, in a solo campaign with numerous twists and turns. Inspired by the eponymous graphic novel, the game features a completely reinvented and uniqueXIII is a remake of the cult first-person action game that was initially released in 2003. You play as \"XIII\", a man without an identity, in a solo campaign with numerous twists and turns. Inspired by the eponymous graphic novel, the game features a completely reinvented and unique cel-shading design. In XIII, players can also take part in fierce multi-player fights.The country remains in a state of shock following the assassination of President Sheridan. You wake up, wounded and with amnesia, on a deserted beach on the east coast. The only clues as to your identity are a tattoo of the number XIII near your collarbone and a locker key. Even though your memory is failing, you discover that you have the reflexes of a highly trained professional fighter. You set off in search of your past, discovering that you played a role in the murder of the President of the United States of America, and revealing the most astounding conspiracy ever hatched in the country's history.… Expand"}, {"name": "Bubble Bobble Revolution", "details_link": "https://www.metacritic.com/game/ds/bubble-bobble-revolution", "publisher": "Codemasters", "release_date": "Oct  3 2006", "developers": ["Taito Corporation"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 38, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/bfc7be5d3417ac11ac9634772e84a671-98.jpg", "descriptions": "Originally released as an arcade game by Taito in 1986, Bubble Bobble starred two dinosaurs - Bub and Bob who co-operate to make their way through a hundred levels to rescue their girlfriends. This addictive two player game went on to be released on most console formats. Now the game isOriginally released as an arcade game by Taito in 1986, Bubble Bobble starred two dinosaurs - Bub and Bob who co-operate to make their way through a hundred levels to rescue their girlfriends. This addictive two player game went on to be released on most console formats. Now the game is reborn on the Nintendo DS with all new graphics, split screen action and the classic gameplay. 100 new exciting levels to explore. All new power bubbles and bubble attacks. Microphone activated challenges and Bubble mini-games. Includes a perfect re-creation of the original Bubble Bobble arcade machine game. [Atari]… Expand"}, {"name": "Pure Futbol", "details_link": "https://www.metacritic.com/game/xbox-360/pure-futbol", "publisher": "Ubisoft", "release_date": "Jun  1 2010", "developers": ["Ubisoft Vancouver"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Arcade", "Arcade"], "meta_score": 38, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/15e95a01bba6d0d8ab6fd868beee9209-98.jpg", "descriptions": "(Also known as \"Pure Football\" in the UK/EU)  Stop watching from the stands and discover what it’s like to play real soccer – raw and unfiltered. Through close-up camera angles and stunning audio & visual treatments, Pure Futbol captures the true on-field emotions. [Ubisoft]"}]