[{"name": "Tech Support: Error Unknown", "details_link": "https://www.metacritic.com/game/pc/tech-support-error-unknown", "publisher": "Dragon Slumber", "release_date": "Feb 27 2019", "developers": ["Dragon Slumber"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "General"], "meta_score": 70, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/226055e0c2542cbeb20320f16d99b413-98.jpg", "descriptions": "Things are not what they seem at your new tech support specialist job. While resolving customer issues, you soon find yourself in the middle of a conspiracy. Will you side with your employer, join a rogue hacktivist group bent on destroying them, assist the police or stand alone?"}, {"name": "Degrees of Separation", "details_link": "https://www.metacritic.com/game/playstation-4/degrees-of-separation", "publisher": "Modus Games", "release_date": "Feb 14 2019", "developers": ["Moondrop Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/e179c269863a7c37b9454dc01c64b4e4-98.jpg", "descriptions": "Degrees of Separation is a puzzle platformer where cooperation is built into every move. Two contrasting souls, Ember and Rime, fall in love, but are separated by an enigmatic force, and must use their powers to progress through a spectacular world of fantasy and adventure."}, {"name": "Human: Fall Flat", "details_link": "https://www.metacritic.com/game/pc/human-fall-flat", "publisher": "Curve Digital", "release_date": "Jul 22 2016", "developers": ["No Brakes Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/0bdedf76f77c4a94384318e105ae6de8-98.jpg", "descriptions": "Human:Fall Flat is a quirky, open-ended physics-based puzzle and exploration game set in floating dreamscapes. Your goal is to escape these surreal dreams by solving puzzles with nothing but your wits and physics."}, {"name": "Photo Dojo", "details_link": "https://www.metacritic.com/game/ds/photo-dojo", "publisher": "Nintendo", "release_date": "May 10 2010", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 70, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/02c88c84a7c61270f333e371ccd83037-98.jpg", "descriptions": "[DSiWare]  Photo Dojo is an extremely simplistic fighting game that involves just one attack button and eight directions. [Nintendo Life]"}, {"name": "Kenka Bancho: Badass Rumble", "details_link": "https://www.metacritic.com/game/psp/kenka-bancho-badass-rumble", "publisher": "Atlus", "release_date": "Nov 10 2009", "developers": ["Bullets"], "platforms": "PSP", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/a34a7fb5d0290c7cdadf12abf6d94e0c-98.jpg", "descriptions": "Kenka Bancho: Badass Rumble puts players in the role of a high school student on a class trip to a historic Japanese city, and includes no shortage of fist-to-face and knee-to-gut action all in the name of pride and bragging rights. You've got seven days to make a name for yourself. How youKenka Bancho: Badass Rumble puts players in the role of a high school student on a class trip to a historic Japanese city, and includes no shortage of fist-to-face and knee-to-gut action all in the name of pride and bragging rights. You've got seven days to make a name for yourself. How you choose to spend your time and how you manage to rise to the top is up to you! [Atlus USA]… Expand"}, {"name": "Hell Yeah! Wrath of the Dead Rabbit", "details_link": "https://www.metacritic.com/game/xbox-360/hell-yeah!-wrath-of-the-dead-rabbit", "publisher": "Sega", "release_date": "Sep 26 2012", "developers": ["Arkedo Studio"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 70, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/5ac0225cb2e41caedab48c4973292f8d-98.jpg", "descriptions": "Assume the role of an angry rabbit with a thirst for vengeance, a super sawing jetpack driller and some seriously badass weapons. Explore, jump, shoot, loot, upgrade, drill and destroy Hell's monsters. Unleash the wrath of the dead rabbit in ten vast levels chock full of hidden areas, sideAssume the role of an angry rabbit with a thirst for vengeance, a super sawing jetpack driller and some seriously badass weapons. Explore, jump, shoot, loot, upgrade, drill and destroy Hell's monsters. Unleash the wrath of the dead rabbit in ten vast levels chock full of hidden areas, side quests and cursed souls to harvest. Charging through Hell on your jetpack driller, you're on a quest to find out who had the guts to post your intimate photos all over the Hell-ternet. While you’re at it, why not use this incredible journey to kill everybody else? There's only one way to do this - full frontal violence sponsored by over-powered missiles.… Expand"}, {"name": "Marvel's Spider-Man: Turf Wars", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-spider-man-turf-wars", "publisher": "Sony Interactive Entertainment", "release_date": "Nov 20 2018", "developers": ["Insomniac Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 70, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/7c57c3b57f3cf27169731768047e1c89-98.jpg", "descriptions": "Spider-Man must put an end to the turf war erupting between the Maggia crime family and gang leader Hammerhead before Marvel’s New York becomes its greatest casualty."}, {"name": "Hitman - Episode 5: Colorado", "details_link": "https://www.metacritic.com/game/playstation-4/hitman---episode-5-colorado", "publisher": "Square Enix", "release_date": "Sep 27 2016", "developers": ["Io Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/ffdf40566a9009a42e7d27d9fdd743e5-98.jpg", "descriptions": "In HITMAN Episode 5: Colorado, Agent 47 takes on his toughest assignment yet; an intense infiltration mission on a farm compound that has been converted into a private militia training camp. The story mission for Episode 5 is titled “Freedom Fighters” and is not one to be taken lightly.In HITMAN Episode 5: Colorado, Agent 47 takes on his toughest assignment yet; an intense infiltration mission on a farm compound that has been converted into a private militia training camp. The story mission for Episode 5 is titled “Freedom Fighters” and is not one to be taken lightly. [Square Enix]… Expand"}, {"name": "Dungeon Maker: Hunting Ground", "details_link": "https://www.metacritic.com/game/psp/dungeon-maker-hunting-ground", "publisher": "XSEED Games", "release_date": "Jun 19 2007", "developers": ["Global A"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/cffe388a49da339cbf01e49e0e1b5192-98.jpg", "descriptions": "(Known as \"Chronicle of Dungeon Maker\" in Japan)  An ambitious but novice dungeon maker arrives in a small town known to suffer periodic attacks from violent monsters. He buys a vast plot of land at the outskirts of the town to create a grand dungeon in hopes of luring in various enemy(Known as \"Chronicle of Dungeon Maker\" in Japan)  An ambitious but novice dungeon maker arrives in a small town known to suffer periodic attacks from violent monsters. He buys a vast plot of land at the outskirts of the town to create a grand dungeon in hopes of luring in various enemy monsters which to hunt to collect gold and items. He envisions his complete dungeon to be one so appealing as to lure the legendary Wandering Demon. Defeating this menacing monster would free the townspeople from the fear he casts upon them, while winning acclaim as a true dungeon maker for the \"Architect.\" The townspeople are initially skeptical about the Architect's ability to achieve his ultimate goal of building such a dungeon. Over the years, they've watched other such dungeon makers arrive with great plans but ultimately fail -- falling prey to the very monsters they've lured into their dungeons or haphazardly abandoning their creations. However, as the Architect's dungeon grows and improves, luring rarer and more powerful enemies, and he begins bringing back more valuable treasures, the townspeople begin offering support to his mission. Soon the whole town is involved in the dungeon making process; they give advice about the intricacies of dungeon making, sell crucial items, provide weapons and magic spells, treat the Architect when injured, and request various favors to be completed in the expanding dungeon in exchange for generous rewards. Whether the growing hopes of the townspeople and the Architect will be realized all depends on the quality of the dungeon he creates and his developing battle skills. Design and modify a customizable dungeon, floor-by-floor, using simple controls to quickly develop a deep and detailed dungeon. Strategically layout and improve your dungeon to maximize its attractiveness and lure in the most sought-after enemies to take their loot. Fight real-time battles wielding various melee and ranged weapons, casting magic spells, rendering special attacks, and summoning creatures to defeat the wide variety of monsters including undead creatures, orcs, and dragons. Enjoy the vast selection of building materials to customize your dungeon and complete quests to access the rarer items from the wide array of weapons, armors, and accessories to upgrade your warrior. Trade dungeons -- Utilize network connectivity to trade dungeons with a friend.  Show off your dungeon creation skills and explore a friend's dungeon to see what kind of monsters and treasures lie inside. [XSEED]… Expand"}, {"name": "Gods Will Fall", "details_link": "https://www.metacritic.com/game/xbox-one/gods-will-fall", "publisher": "Deep Silver", "release_date": "Jan 29 2021", "developers": ["Clever Beans"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/d97b77a1f48af156e4d664f65d9ce30b-98.jpg", "descriptions": "The gods’ rule over humanity has lasted for millennia. They demand to be worshipped and to those who don't submit to the gods’ will; merciless death awaits. Experience the trials of 8 Celtic warriors in their plight to sever the gods’ grip on humanity. Every man and woman who can muster aThe gods’ rule over humanity has lasted for millennia. They demand to be worshipped and to those who don't submit to the gods’ will; merciless death awaits. Experience the trials of 8 Celtic warriors in their plight to sever the gods’ grip on humanity. Every man and woman who can muster a blade will form your clan and take on legions of beasts in each of the gods’ realms. Succeed and see legends born. Fail, and lives turn to dust.… Expand"}, {"name": "Zombie Army Trilogy", "details_link": "https://www.metacritic.com/game/switch/zombie-army-trilogy", "publisher": "Sold Out", "release_date": "Mar 31 2020", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/485637a8ceea1422eb7c922251f5653f-98.jpg", "descriptions": "The cult horror shooter comes to Nintendo Switch with three exhilarating campaigns, a heart-pumping horde mode and intense horror action. Zombie Army Trilogy is a pulse-pounding third person shooter with three epic campaigns, a heart-pumping horde mode, and intense horror action. In theThe cult horror shooter comes to Nintendo Switch with three exhilarating campaigns, a heart-pumping horde mode and intense horror action. Zombie Army Trilogy is a pulse-pounding third person shooter with three epic campaigns, a heart-pumping horde mode, and intense horror action. In the dying flames of World War II, a legion of undead super soldiers threaten to overwhelm the whole of Europe. Fight alone or team up to save humanity from the zombie menace Battle through three epic cammpaigns across 15 demon-infested missions. Play solo of fight back to back in online or local wireless co-op for 2-4 players. Dare you take on the challenge?… Expand"}, {"name": "LEGO Rock Band", "details_link": "https://www.metacritic.com/game/wii/lego-rock-band", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov  3 2009", "developers": ["TT Fusion"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/92bbed3411108fa6b3acd3b0e4d56f41-98.jpg", "descriptions": "The game, which allows families, tweens and teens to experience a wild journey to rock stardom where they can \"Build a Band and Rock the Universe,\" combines the multiplayer music experience of Rock Band with the fun, customization and humor of the LEGO videogame franchise packed withThe game, which allows families, tweens and teens to experience a wild journey to rock stardom where they can \"Build a Band and Rock the Universe,\" combines the multiplayer music experience of Rock Band with the fun, customization and humor of the LEGO videogame franchise packed with brilliant chart-topping songs and classic favorites suitable for younger audiences, including: Blur's \"Song 2\", Carl Douglas's \"Kung Fu Fighting\", Europe's \"The Final Countdown\", Good Charlotte's \"Boys and Girls\", and Pink's \"So What.\" Players become rockers as they embark on a journey to stardom that the whole family can enjoy as they work their way through local venues, stadiums and fantasy locations on Earth and beyond that mimic the imaginative settings that the LEGO world offers. Also continuing the LEGO \"build-and-play\" gaming experience, players are able to create their own LEGO Rock Band style as they customize their minifigure avatars, band and entourage, including roadies, managers and crew. LEGO Rock Band supports Rock Band instruments, as well as other music game controllers. [Warner Bros.]… Expand"}, {"name": "Brink", "details_link": "https://www.metacritic.com/game/pc/brink", "publisher": "Bethesda Softworks", "release_date": "May  9 2011", "developers": ["Splash Damage"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 70, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/fc349843f3ea3049b676bb9441e17996-98.jpg", "descriptions": "Brink is an immersive shooter that blends single-player, co-op, and multiplayer gameplay into one seamless experience, allowing you to develop your character across all modes of play. You decide the role you want to assume in the world of Brink as you fight to save yourself and mankind’sBrink is an immersive shooter that blends single-player, co-op, and multiplayer gameplay into one seamless experience, allowing you to develop your character across all modes of play. You decide the role you want to assume in the world of Brink as you fight to save yourself and mankind’s last refuge for humanity. Brink offers a compelling mix of dynamic battlefields, extensive customization options, and an innovative control system that will keep you coming back for more. A man-made floating city called the Ark, made up of hundreds of separate floating islands, is on the brink of all-out civil war. Originally built as an experimental self-sufficient and 100% \"green\" habitat, the reported rapid rise of the Earth's oceans has forced the Ark to become a refuge for humanity.  Crammed with the original Ark founders, their descendants, as well as tens of thousands of refugees, the Ark exists in total isolation from the rest of the world. With 25 years of social unrest, the inhabitants of the Ark have reached their breaking point. It's up to you to decide the future of the Ark and the human race. Blurring the Lines Between Offline and Online - Advance your character’s development across every gameplay mode: single player, co-op, and multiplayer. Gain experience points that you can spend on customizing and upgrading your skills and abilities, designing an entirely unique look and feel for your character. Brink uses the familiar shooter controls that you're used to, without frustrating, artificial constraints and takes advantage of a new feature: the SMART button.  When you press the SMART button, the game dynamically evaluates where you’re trying to get to, and makes it happen. No need to perfectly time a jump or vault, the game knows what you want to do. Objectives, communications, mission generation, and inventory selection are all dynamically generated based on your role, your status, your location, your squad-mates, and the status of the battle in all gameplay modes.  You'll always know exactly where to go, what to do when you get there, and what your reward will be for success. Brink’s proprietary technology, Virtual Texturing, breaks new ground on current-gen consoles and PCs with an even greater focus on highly detailed characters, realistic environments, lighting, effects, and atmospherics. This competitive lead on the squad-combat genre helps thrust players into the gritty reality of the Ark's epic secluded arcology. [Bethesda Softworks]… Expand"}, {"name": "Minecraft Dungeons", "details_link": "https://www.metacritic.com/game/pc/minecraft-dungeons", "publisher": "Mojang AB", "release_date": "May 26 2020", "developers": ["Mojang AB"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Open-World", "Role-Playing", "Action RPG"], "meta_score": 70, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/072522a0f15b8183f05b9bdd04592f19-98.jpg", "descriptions": "What exactly is Minecraft: Dungeons? It's an all-new action-adventure game inspired by classic dungeon crawlers, where you'll constantly discover new weapons and items that will help you defeat a ruthless swarm of new-and-nasty mobs. You'll fight or flee through canyons, swamps and of courseWhat exactly is Minecraft: Dungeons? It's an all-new action-adventure game inspired by classic dungeon crawlers, where you'll constantly discover new weapons and items that will help you defeat a ruthless swarm of new-and-nasty mobs. You'll fight or flee through canyons, swamps and of course mines. You can brave the dungeons alone, or team up with friends. Up to four players can battle together through action-packed, treasure-stuffed, wildly varied levels, all in an epic quest to save the villagers and take down the evil Arch-Illager.… Expand"}, {"name": "Demon's Crystals", "details_link": "https://www.metacritic.com/game/xbox-one/demons-crystals", "publisher": "Badland Games", "release_date": "May 12 2017", "developers": ["Badland Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/872e61176b3e19ea666879073317852e-98.jpg", "descriptions": null}, {"name": "Hyperdimension Neptunia Re;Birth3: V Generation", "details_link": "https://www.metacritic.com/game/playstation-vita/hyperdimension-neptunia-rebirth3-v-generation", "publisher": "Idea Factory", "release_date": "Jun 30 2015", "developers": ["Compile Heart", "Felistella"], "platforms": ["PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/9e4424e31c1293ba33f3659490ed48a9-98.jpg", "descriptions": "In Re;Birth3, the player assumes control of Neptune — CPU, Goddess, and all-around protector of the nation of Planeptune in the world of Gamindustri. [Idea Factory]"}, {"name": "LEGO Jurassic World", "details_link": "https://www.metacritic.com/game/xbox-one/lego-jurassic-world", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 12 2015", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/d725ec6843a917fdd39688efc9b2f6bf-98.jpg", "descriptions": "Following the epic storylines of Jurassic Park, The Lost World: Jurassic Park and Jurassic Park III, as well as the highly anticipated Jurassic World, LEGO Jurassic World is the first videogame where players will be able to relive and experience all four Jurassic films."}, {"name": "Overclocked: A History of Violence", "details_link": "https://www.metacritic.com/game/pc/overclocked-a-history-of-violence", "publisher": "Lighthouse Interactive", "release_date": "Apr  7 2008", "developers": ["House of Tales"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "3D", "Third-Person"], "meta_score": 70, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/ea35fdd0ee3a9d40c6ee636ab02c2d46-98.jpg", "descriptions": "The classic point & click adventure game breaks new ground in order to tell a story revolving around psychiatrist David McNamara and five young patients. These patients are found barely clothed, the apparent victim of a traumatic act of violence, in the rain-drenched streets of New YorkThe classic point & click adventure game breaks new ground in order to tell a story revolving around psychiatrist David McNamara and five young patients. These patients are found barely clothed, the apparent victim of a traumatic act of violence, in the rain-drenched streets of New York City. McNamara is called to help as an expert psychiatrist. At the Staten Island Forensic Hospital he is tasked with treating the young patients – who all suffer from severe amnesia. Dave begins to carefully probe their memory, trying to reveal their obscured past. The story-telling approach of Overclocked sees the player take on the role of the patients as they are questioned, playing and exploring their memories one by one. In reverse chronology, the player makes his way through the shards of their past and experiences frightening events that seem incoherent at first. The insights gained can then used back in the role of Dave McNamara to piece together the interconnections between the victims and open up new lines of questioning. [Anaconda]… Expand"}, {"name": "Saints Row: The Third Remastered", "details_link": "https://www.metacritic.com/game/pc/saints-row-the-third-remastered", "publisher": "Deep Silver", "release_date": "May 22 2020", "developers": ["Sperasoft"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 70, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/e8ab3514690ad3e1eee6f8c816b18905-98.jpg", "descriptions": "Experience The Full Package, Remastered. Steelport, the original city of sin, has never looked so good as it drowns in sex, drugs and guns. The Third Street Saints are at the height of power and yours to control. This is your city. These are your rules."}, {"name": "Need for Speed: ProStreet", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-prostreet", "publisher": "EA Games", "release_date": "Nov 13 2007", "developers": ["EA Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 70, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/8d95b675a3b55db15f21225dc89f2580-98.jpg", "descriptions": "Need for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting yourNeed for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting your skills and reputation against the very best street racers. Need for Speed ProStreet boasts impeccable precision and impressively detailed photo-realistic graphics, effectively transporting you to the center of the action. It pushes the Autosculpt technology to a new level, allowing you to directly impact your car's performance for the first time as well as personalize its appearance. Need for Speed ProStreet is a true taste of raw adrenaline and racing with consequences. Every dent, every scratch and every crumpled body panel is a battle scar, proof of your commitment and competitive mettle. With an aggressive and skilled AI system, you become immersed in an unmatched believable race experience. Add in a revolutionary online mode that will redefine the meaning of competitive social play, and Need for Speed ProStreet is the ultimate formula for an emotionally charged street racing showdown. [Electronic Arts]… Expand"}, {"name": "Major League Baseball 2K6", "details_link": "https://www.metacritic.com/game/playstation-2/major-league-baseball-2k6", "publisher": "2K Sports", "release_date": "Apr  3 2006", "developers": ["Kush Games"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 70, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/4/6c463a647b217d79901e76f3ef4e58c6-98.jpg", "descriptions": "As the exclusive and official Major League Baseball multi-platform video game, Major League Baseball 2K6 includes innovative features such as a new movement system and realistic player collisions on the infield and outfield. New broadcast elements include flashback replays, and a uniqueAs the exclusive and official Major League Baseball multi-platform video game, Major League Baseball 2K6 includes innovative features such as a new movement system and realistic player collisions on the infield and outfield. New broadcast elements include flashback replays, and a unique player morale system will unfold the drama like never before in a baseball video game. The World Baseball Classic is featured exclusively in Major League Baseball 2K6. [2K Sports]… Expand"}, {"name": "Thrillville: Off the Rails", "details_link": "https://www.metacritic.com/game/wii/thrillville-off-the-rails", "publisher": "LucasArts", "release_date": "Oct  9 2007", "developers": ["Frontier Developments"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 70, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/1/92bd3003d2dfed2116c4e581ac30526f-98.jpg", "descriptions": "Off the Rails lives up to its name with 20 death-defying rides so outrageous, they inspire the same word from every park visitor who sees them: \"WHOA!\" Players build these incredible \"WHOA Coasters\" to leap from one track to another, launch through the air like cannonballs, blast through aOff the Rails lives up to its name with 20 death-defying rides so outrageous, they inspire the same word from every park visitor who sees them: \"WHOA!\" Players build these incredible \"WHOA Coasters\" to leap from one track to another, launch through the air like cannonballs, blast through a burning rings of fire and more. A new lighthearted story ties together more than 100 missions, complete with 34 playable multiplayer theme-park games and social interaction with park guests that's better than ever. The in-depth conversations both advance the plot and suggest better ways to manage the park. But is every guest to be trusted? [LucasArts]… Expand"}, {"name": "Gravitar: Recharged", "details_link": "https://www.metacritic.com/game/switch/gravitar-recharged", "publisher": "Atari", "release_date": "Jun  2 2022", "developers": ["SneakyBox", "Adamvision Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/a4d61c7d0de584d88f5898dd7dbf19e6-98.jpg", "descriptions": "A lone pilot, far from home, must navigate an abstract universe of uncharted planets and space stations guarded by mysterious, hostile aliens in Gravitar: Recharged. You must complete missions in each solar system, navigating a variety of challenging environments, each with varying levels ofA lone pilot, far from home, must navigate an abstract universe of uncharted planets and space stations guarded by mysterious, hostile aliens in Gravitar: Recharged. You must complete missions in each solar system, navigating a variety of challenging environments, each with varying levels of gravity that will test your skills as a pilot. Complete each mission within a solar system and you will be transported to the next through a massive black hole. Will you ever make it home?\r The visual aesthetic of Gravitar: Recharged takes the Recharged series in a new direction, with expansive environments rendered in painterly style and pastel tones. In the capable hands of industry-veteran composer Megan McDuffee, the original soundtrack complements the art style with soothing, atmospheric tracks that evoke a sense of wonder.… Expand"}, {"name": "NASCAR Heat 4", "details_link": "https://www.metacritic.com/game/playstation-4/nascar-heat-4", "publisher": "704Games", "release_date": "Sep 10 2019", "developers": ["Monster Games Inc.", "704Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 70, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/11fc1c551d7a98fc7a3577c4de8ac611-98.jpg", "descriptions": "NASCAR Heat 4 is the official video game of NASCAR. Looking and sounding better than ever with updated user interface, graphics and engine audio, race across 38 tracks in all three NASCAR National Series plus the fan-favorite Xtreme Dirt Tour."}, {"name": "Bendy and the Ink Machine", "details_link": "https://www.metacritic.com/game/xbox-one/bendy-and-the-ink-machine", "publisher": "TheMeatly Games", "release_date": "Nov 20 2018", "developers": ["TheMeatly Games", "Joey Drew Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/6ca0e2d31084535d23211eabbb47cc50-98.jpg", "descriptions": "Bendy and the Ink Machine is a first-person puzzle action horror game that begins in the far days past of animation and ends in a very dark future. With twists and turns around every corner, this game promises to thrill you… and decimate your childhood."}, {"name": "The Collider 2", "details_link": "https://www.metacritic.com/game/pc/the-collider-2", "publisher": "Shortbreak Studios", "release_date": "Apr 19 2016", "developers": ["Shortbreak Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/436aa3fa73d673bb53187785f1d53265-98.jpg", "descriptions": "Destroy the colossal mothership looming over the planet and save your homeworld. With a fleet of high-tech starfighters at your disposal, take on a series of suicidal missions to destroy the alien invader from the inside."}, {"name": "World War Z", "details_link": "https://www.metacritic.com/game/pc/world-war-z", "publisher": "Saber Interactive", "release_date": "Apr 16 2019", "developers": ["Saber Interactive"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Third-Person", "Tactical"], "meta_score": 70, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/5e0e8c3ad42a39d743a3cbf41593936d-98.jpg", "descriptions": "World War Z is a thrilling four-player cooperative third-person shooter featuring massive swarms of zombies that recklessly rush their living prey. Focused on fast-paced gameplay -- and based on the incredibly popular Paramount Pictures property of the same name -- World War Z explores newWorld War Z is a thrilling four-player cooperative third-person shooter featuring massive swarms of zombies that recklessly rush their living prey. Focused on fast-paced gameplay -- and based on the incredibly popular Paramount Pictures property of the same name -- World War Z explores new storylines and characters from around the world in tense, overwhelming, gruesomely exciting missions crafted specifically for modern consoles and PC.\r The swarm feels neither fear nor mercy. It rolls forward to spread and consume. Together, make your stand and unload an arsenal of deadly weaponry into these hundreds of swarming zombies. Feel the satisfying rush of life as you cheat death and prevail against such overwhelming odds. Cut the undead down with rocket launchers, machine guns, sentries, turrets, grenade launchers, barbed wire, and more.… Expand"}, {"name": "Tom Clancy's Rainbow Six: Lockdown", "details_link": "https://www.metacritic.com/game/playstation-2/tom-clancys-rainbow-six-lockdown", "publisher": "Ubisoft", "release_date": "Sep  6 2005", "developers": ["Red Storm Entertainment", "Ubisoft Montreal"], "platforms": ["PC", "PlayStation 2"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/81314f85f72116ee769c2af2c53e879c-98.jpg", "descriptions": "Command Team Rainbow in their toughest mission yet. When one of your own is taken hostage, do you follow orders or do you break them in order to save the life of one of your own men? The next Rainbow Six title features a thrilling single-player campaign that has you playing as either theCommand Team Rainbow in their toughest mission yet. When one of your own is taken hostage, do you follow orders or do you break them in order to save the life of one of your own men? The next Rainbow Six title features a thrilling single-player campaign that has you playing as either the confident team leader, Ding Chavez, who never leaves a man behind, or as the team's arrogant sniper, Dieter Weber, who never misses a shot. The final result: a totally immersive experience - which becomes even more compelling when gamers go online to play against other fans from around the world, using voice chat to communicate with one another. New weapons and equipment: Complete your mission with all of the tools of the trade including new items like motion trackers, battering rams, and the deadly MTAR-21 micro assault rifle. Stunning graphics and ultra-realistic \"ragdoll\" physics deliver staggering realism and spectacular close quarter firefights. New Rivalry Mode pits Rainbow operatives against trained mercenaries in objective-driven team-based adversarial gameplay. [Ubisoft]… Expand"}, {"name": "Gods Will Fall", "details_link": "https://www.metacritic.com/game/pc/gods-will-fall", "publisher": "Deep Silver", "release_date": "Jan 29 2021", "developers": ["Clever Beans"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/5/a43bb19ff5d29c0b425043eb2dfeeee0-98.jpg", "descriptions": "The gods’ rule over humanity has lasted for millennia. They demand to be worshipped and to those who don't submit to the gods’ will; merciless death awaits. Experience the trials of 8 Celtic warriors in their plight to sever the gods’ grip on humanity. Every man and woman who can muster aThe gods’ rule over humanity has lasted for millennia. They demand to be worshipped and to those who don't submit to the gods’ will; merciless death awaits. Experience the trials of 8 Celtic warriors in their plight to sever the gods’ grip on humanity. Every man and woman who can muster a blade will form your clan and take on legions of beasts in each of the gods’ realms. Succeed and see legends born. Fail, and lives turn to dust.… Expand"}, {"name": "Yonder: The Cloud Catcher Chronicles", "details_link": "https://www.metacritic.com/game/pc/yonder-the-cloud-catcher-chronicles", "publisher": "Prideful Sloth", "release_date": "Jul 17 2017", "developers": ["Prideful Sloth"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/5660494fae89ba7a7a6a6c8e9c1bbf19-98.jpg", "descriptions": "Yonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the islandYonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the island flourish.… Expand"}, {"name": "The Sims 3: Generations", "details_link": "https://www.metacritic.com/game/pc/the-sims-3-generations", "publisher": "EA Games", "release_date": "May 31 2011", "developers": ["The Sims Studio"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 70, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/3/e08d1494d922c92fe5483307e3dc5156-98.jpg", "descriptions": "The Generations expansion pack will add new gameplay for sims of different ages to The Sims 3."}, {"name": "Shrek 2", "details_link": "https://www.metacritic.com/game/gamecube/shrek-2", "publisher": "Activision", "release_date": "Apr 28 2004", "developers": ["Luxoflux", "Inc."], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 70, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/637edc136271b6ada4bf456141790b93-98.jpg", "descriptions": "Shrek 2 takes players on a twisted fairy tale adventure with Shrek and his buddies.  Revisit key locations from the movie sequel while discovering all-new locations and characters.  Shrek 2 combines squad-based action with traditional action adventure elements.  You control a team of fourShrek 2 takes players on a twisted fairy tale adventure with Shrek and his buddies.  Revisit key locations from the movie sequel while discovering all-new locations and characters.  Shrek 2 combines squad-based action with traditional action adventure elements.  You control a team of four and play as Shrek or any of his ten friends, switching between each to best utilize the character's unique abilities to solve puzzles, fight monsters, and complete wild and dangerous adventures.… Expand"}, {"name": "Bomberman Jetters", "details_link": "https://www.metacritic.com/game/gamecube/bomberman-jetters", "publisher": "Majesco Games", "release_date": "Mar 10 2004", "developers": ["Hudson"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 70, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/6f1c3dddd0e1ae58a861491024f8095b-98.jpg", "descriptions": "The Hige Hige Bandits are at it again as they set out to destroy Planet Bomber by crashing an artificial world called Dark Star into it.  Bomberman must destroy the four powerful engines of Dark Star before it's too late.   On your new adventure, you can switch control between Bomberman andThe Hige Hige Bandits are at it again as they set out to destroy Planet Bomber by crashing an artificial world called Dark Star into it.  Bomberman must destroy the four powerful engines of Dark Star before it's too late.   On your new adventure, you can switch control between Bomberman and Max and develop Charaboms with special abilities that grow stronger as the Charabom evolves.  Up to four players can go head-to-head in multiplayer games, including new minigames.… Expand"}, {"name": "No Mans Land", "details_link": "https://www.metacritic.com/game/pc/no-mans-land", "publisher": "Selective Intuition", "release_date": "Sep 15 2017", "developers": ["Selective Intuition"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 0, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/c1f9e1a19fb4a05b30e34ebf1ae4d99b-98.jpg", "descriptions": null}, {"name": "Conflict: Desert Storm II - Back to Baghdad", "details_link": "https://www.metacritic.com/game/playstation-2/conflict-desert-storm-ii---back-to-baghdad", "publisher": "Gotham Games", "release_date": "Oct  8 2003", "developers": ["Pivotal Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 70, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/69f25b92bcc27d5a7de1d7b5c7937e82-98.jpg", "descriptions": "At the height of the 1991 Gulf War, 300 clicks into the heart of Iraq, you must command your squad of Special Forces operatives to strike at Iraq's evil dictator, and his fascist regime. Armed with an authentic arsenal of high-tech weapons and vehicles, your squad will face impossible oddsAt the height of the 1991 Gulf War, 300 clicks into the heart of Iraq, you must command your squad of Special Forces operatives to strike at Iraq's evil dictator, and his fascist regime. Armed with an authentic arsenal of high-tech weapons and vehicles, your squad will face impossible odds in this battle against tyranny. Only strategy and skill will ensure your survival through frantic firefights, gut-wrenching vehicular combat, and gripping stealth operations. \"The Mother of All Battles\" is coming to your console in Gotham Games' Conflict: Desert Storm II ? Back to Baghdad. The troops are in position, so lock and load, and get ready to GO LOUD! [Gotham Games]… Expand"}, {"name": "F1 Career Challenge", "details_link": "https://www.metacritic.com/game/playstation-2/f1-career-challenge", "publisher": "Electronic Arts", "release_date": "Jun 24 2003", "developers": ["Electronic Arts"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 70, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/d397de55d884cc8f8865f1f779e92bdd-98.jpg", "descriptions": "Start as a rookie Formula One driver. If you prove your worth by passing a range of superlicense tests, you can take your place among the elite drivers competing in the world's fastest and most glamorous motor sport. To succeed, you?ll have to work hard, as your reputation determines how farStart as a rookie Formula One driver. If you prove your worth by passing a range of superlicense tests, you can take your place among the elite drivers competing in the world's fastest and most glamorous motor sport. To succeed, you?ll have to work hard, as your reputation determines how far your career can take you. Hone your skills to make the improvements that will show over four successive seasons (1999?2002) on the Formula One circuit as you make your drive for the championship.… Expand"}, {"name": "Wing Commander: Prophecy", "details_link": "https://www.metacritic.com/game/game-boy-advance/wing-commander-prophecy", "publisher": "Destination Software", "release_date": "Jun  4 2003", "developers": ["Raylight Studios"], "platforms": ["PC", "Game Boy Advance"], "num_players": "1-4 ", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 70, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/5008488133253819ba1082d572b537d4-98.jpg", "descriptions": "Wing Commander: Prophecy is a triumph on the Game Boy Advance, but it's not without its flaws."}, {"name": "Turbo Turtle Adventure", "details_link": "https://www.metacritic.com/game/game-boy-advance/turbo-turtle-adventure", "publisher": "Majesco Games", "release_date": "Sep 14 2002", "developers": ["Iridon Interactive AB"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/c46a337d73d97324a08af736d4906c32-98.jpg", "descriptions": "Help Turbo Turtle win his freedom to once again swim the sea.  Trapped on the Isle of Mazes you must guide Turbo Turtle through deceitful labyrinths and nasty traps.  Collect keys to unlock doorways, avoid the super magnets and utilize the turbo boost feature to try and beat your fastest time."}, {"name": "Test Drive Off-Road Wide Open", "details_link": "https://www.metacritic.com/game/playstation-2/test-drive-off-road-wide-open", "publisher": "Infogrames", "release_date": "Aug 24 2001", "developers": ["Rockstar San Diego"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/90a3a8e41c8b6072da80435850a74286-98.jpg", "descriptions": "Use brute force and 12 trucks (including the Hummer® Dodge® T-Rex, Ford® Bronco) to fight for off-road supremacy in three untamed racing environments including Moab UT, Yosemite CA, and Big Island HI, where you'll confront high-speed jumps, wild shortcuts, and serious off-road obstaclesUse brute force and 12 trucks (including the Hummer® Dodge® T-Rex, Ford® Bronco) to fight for off-road supremacy in three untamed racing environments including Moab UT, Yosemite CA, and Big Island HI, where you'll confront high-speed jumps, wild shortcuts, and serious off-road obstacles within three different checkpoint-style race modes at each location.… Expand"}, {"name": "Fe", "details_link": "https://www.metacritic.com/game/playstation-4/fe", "publisher": "Electronic Arts", "release_date": "Feb 16 2018", "developers": ["Zoink!"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 70, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/2ffcc09db38b7bcd767a68e2abe3c799-98.jpg", "descriptions": "In Fe, players are enchanted by the natural surroundings as they uncover secrets, complete side quests, and meet the mystical creatures of the forest. Players climb, glide and dig as they voyage through the open experience meeting, interacting and rescuing plants and animals from the SilentIn Fe, players are enchanted by the natural surroundings as they uncover secrets, complete side quests, and meet the mystical creatures of the forest. Players climb, glide and dig as they voyage through the open experience meeting, interacting and rescuing plants and animals from the Silent Ones, the machine antagonists that are threatening the forest. Through unparalleled freedom of exploration in a world full of discoveries to uncover, players become Fe and never want to leave. [Electronic Arts]… Expand"}, {"name": "MXGP 2020 - The Official Motocross Videogame", "details_link": "https://www.metacritic.com/game/playstation-5/mxgp-2020---the-official-motocross-videogame", "publisher": "Milestone S.r.l", "release_date": "Jan 14 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/742227fca82f6613077ede144841ad91-98.jpg", "descriptions": "Career Mode: Take the role of a rookie in the world of Motocross. Join an official team or create your own. Live the main challenge of the career: racing through the official 2020 season. HEIGHTMAP BASED TRACK EDITOR. A new touch of realism for your tracks. Choose between 4 different terrainCareer Mode: Take the role of a rookie in the world of Motocross. Join an official team or create your own. Live the main challenge of the career: racing through the official 2020 season. HEIGHTMAP BASED TRACK EDITOR. A new touch of realism for your tracks. Choose between 4 different terrain types. Use the heightmaps to create the track of your dreams in a realistic way, through hills and mountains Share your creations or download new ones. Roam free in the Playground area inspired by the suggestive Norwegian fjords. Choose your starting point, place the Waypoints around the map, race across them, complete the path and share it online. Low latency, reliable connection, high bandwidth to enhance your MXGP 2020 multiplayer experience. Race against your friends or free roam together in the new Playground area. RACE DIRECTOR MODE. Create, race and stream exciting online challenges using special cameras and deciding the fate of races.… Expand"}, {"name": "Dante's Inferno", "details_link": "https://www.metacritic.com/game/psp/dantes-inferno", "publisher": "Electronic Arts", "release_date": "Mar  1 2010", "developers": ["Artificial Mind and Movement", "EA Redwood Shores"], "platforms": ["PlayStation 3", "Xbox 360", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "Beat-'Em-Up", "Linear", "2D", "3D"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/c97ee493d7b407b220b62760cffc633f-98.jpg", "descriptions": "Dante's Inferno tells an adapted story that focuses on delivering a blockbuster 3rd person action game experience while bringing Alighieri's depiction of Hell to the medium. Players assume the role of Dante, who descends into Hell after returning home to find his beloved Beatrice murdered,Dante's Inferno tells an adapted story that focuses on delivering a blockbuster 3rd person action game experience while bringing Alighieri's depiction of Hell to the medium. Players assume the role of Dante, who descends into Hell after returning home to find his beloved Beatrice murdered, with Lucifer seducing her soul into the underworld. Dante sets out on a rescue mission to save Beatrice, but he soon realizes he is also in Hell to face his own demons and ultimately to redeem himself. Players take Dante through nine unique circles of Hell as mapped out and described by Alighieri: limbo, lust, gluttony, greed, anger, heresy, violence, fraud and treachery. Each circle showcases its own distinct look, with demons, monsters, damned and geography that are crafted straight from the poem's vivid descriptions. To take down the demons of Hell, Dante is outfitted with two primary weapons: the Scythe he takes from Death and the Holy Cross given to him by Beatrice, which has spiritual powers that will help Dante collect souls and spells from the creatures he defeats on his journey. The game also features a deep upgrade system so gamers can customize their abilities to their specific gameplay style, something they'll need as Dante comes face to face with Hell's fiercest beasts and bosses. If successful, Dante will be able to tame certain beasts, exacting their will and turning Hell’s punishments back on itself. [Electronic Arts]… Expand"}, {"name": "Iris.Fall", "details_link": "https://www.metacritic.com/game/pc/irisfall", "publisher": "NExT Studios", "release_date": "Dec  7 2018", "developers": ["NExT Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/273ca6a6d4d793c7c5cc354350546c06-98.jpg", "descriptions": "Iris.Fall is a puzzle adventure game featuring striking visuals and a spellbinding theme of \"light and shadow\"."}, {"name": "The Warlock of Firetop Mountain", "details_link": "https://www.metacritic.com/game/pc/the-warlock-of-firetop-mountain", "publisher": "Tin Man Games", "release_date": "Aug 31 2016", "developers": ["Tin Man Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/fd2f67b491a8814ca306b36a8a00ffb8-98.jpg", "descriptions": "The Warlock of Firetop Mountain is a tabletop adventure come to life! This fantasy solo RPG combines unique, simultaneous turn-based combat with a journey that changes based on each figurine you take into Firetop Mountain! Which hero will you take into Zagor's lair THIS time?"}, {"name": "Rabbids Go Home", "details_link": "https://www.metacritic.com/game/ds/rabbids-go-home", "publisher": "Ubisoft", "release_date": "Nov  1 2009", "developers": ["Ubisoft Montpellier"], "platforms": "DS", "genres": ["Action Adventure", "Adventure", "Puzzle", "Action", "General", "General", "Linear"], "meta_score": 70, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/3e5b3d5b89f00ffb8b32cf9ed2ef7c2d-98.jpg", "descriptions": "The Rabbids first comedy-adventure takes them to the moon or bust!  Those crazy Rabbids have an infallible plan: collect all the human stuff they can find, heap it onto a giant pile and literally climb home to the moon. But not so fast! The Humans revolt, unleashing the Verminators whoseThe Rabbids first comedy-adventure takes them to the moon or bust!  Those crazy Rabbids have an infallible plan: collect all the human stuff they can find, heap it onto a giant pile and literally climb home to the moon. But not so fast! The Humans revolt, unleashing the Verminators whose only objective is to exterminate the Rabbids. Rabbids Go Home game features include: The Rabbids First Puzzle-Adventure Game: The Raving Rabbids, using a shopping cart, will have to solve the puzzle of each level and collect as much stuff as they can to build a giant pile to their home - the moon! Same storyline as the Wii version, different gameplay: The game features a true story mode, including hours of puzzle-based gameplay. Stir up funny chain reactions in 150 brain teasers based on physics and funny Rabbids characters. The goal is to lead a shopping cart to the Toilets, collecting as many maximum resources as possible on the way. 15 tricky levels to actually build a huge pile to the moon: Test your reflexes and your skills with the stylus. Challenge mode: Four delirious challenge modes of 20 levels each, apart from the story mode and with different rules and objectives. Create hilarious situations by getting rid of those Raving Rabbids or making them fly! But be careful to not miss the TV show. Unique art direction: Encounter a cast of colorful, oddball characters (humans, Verminators, dogs, etc.) and explore a remarkable parody of the modern world. Exclusive level editor: Create your own puzzles and share them with your friends and the whole RGH community! Also download other players' puzzles for hours of additional gameplay. [Ubisoft]… Expand"}, {"name": "Hot Shots Tennis", "details_link": "https://www.metacritic.com/game/playstation-2/hot-shots-tennis", "publisher": "SCEA", "release_date": "Jul 17 2007", "developers": ["Clap Hanz"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 70, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/576c773c9e39d79cbbd81e9c2e548245-98.jpg", "descriptions": "(Known as \"Everybody's Tennis\" in the UK/EU)  Hot Shots Tennis is a fun, accessible sports game that's easy to pick up and play but very hard to put down. Taking the popular characters and ethos of the Everybody's Golf series, Hot Shots Tennis crams extra fun into every corner with a variety(Known as \"Everybody's Tennis\" in the UK/EU)  Hot Shots Tennis is a fun, accessible sports game that's easy to pick up and play but very hard to put down. Taking the popular characters and ethos of the Everybody's Golf series, Hot Shots Tennis crams extra fun into every corner with a variety of gameplay modes for all occasions. Comprehensive training options allow you to get the very best out of your character, but it's possible to head straight onto the court and get some brilliant rallies going if that's what you want. Try the Challenge mode and take your player to the very top, or invite your friends and family to take part in an epic multiplayer match. However you play, Everybody is sure to have some fun. [Sony]… Expand"}, {"name": "Hyrule Warriors Legends", "details_link": "https://www.metacritic.com/game/3ds/hyrule-warriors-legends", "publisher": "Nintendo", "release_date": "Mar 25 2016", "developers": ["Omega Force"], "platforms": ["Wii U", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/3c569528ed31a302422cded434b2dfe2-98.jpg", "descriptions": "Cut down entire legions of enemies using over-the-top powerful Dynasty Warriors-style moves. In the portable version, experience new story elements and playable characters from by The Legend of Zelda: The Wind Waker game such as Tetra, King of Hyrule and more. Additional new features, suchCut down entire legions of enemies using over-the-top powerful Dynasty Warriors-style moves. In the portable version, experience new story elements and playable characters from by The Legend of Zelda: The Wind Waker game such as Tetra, King of Hyrule and more. Additional new features, such as the ability to switch between different characters on the fly, allow you to strategically position characters and defeat foes in all-new ways like never before.… Expand"}, {"name": "LEGO Jurassic World", "details_link": "https://www.metacritic.com/game/playstation-4/lego-jurassic-world", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun  9 2015", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 70, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/faed0d8a6385e50ef0f25f8a4e9a1637-98.jpg", "descriptions": "Following the epic storylines of Jurassic Park, The Lost World: Jurassic Park and Jurassic Park III, as well as the highly anticipated Jurassic World, LEGO Jurassic World is the first videogame where players will be able to relive and experience all four Jurassic films."}, {"name": "Immortal Realms: Vampire Wars", "details_link": "https://www.metacritic.com/game/pc/immortal-realms-vampire-wars", "publisher": "Kalypso", "release_date": "Aug 28 2020", "developers": ["Palindrome Interactive"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 70, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/63b5161986d609819ca7df18f8c3ef57-98.jpg", "descriptions": "For as long as historians can remember, the ancient Dracul bloodline has ruled over the mysterious lands of Warmont -- Realm of the Bloodthrone. Inside the secluded borders of this land, an unholy court of vampires feast on the blood of their human subjects. And, as long as they give itFor as long as historians can remember, the ancient Dracul bloodline has ruled over the mysterious lands of Warmont -- Realm of the Bloodthrone. Inside the secluded borders of this land, an unholy court of vampires feast on the blood of their human subjects. And, as long as they give it willingly, a vicious peace between mortal and immortal is kept alive under the watchful eye of the vampiric rulers -- Vlad and Cecilia Dracul, forever bound by eternal love.To the east, a cold wind blows over the desolate planes of Mourterra -- The Land of the Dead. No humans live on this barren and cursed soil, and yet the land is far from deserted. Horrifying remnants of the ancient and corrupt Nosfernus bloodline stalk here in silence, patiently waiting for their chance to once again plague the lands of the living.Meanwhile, in Esain -- The Frozen North, another bloodline of vampires resides in solitude and isolation from the world. For the mystical clan of the Moroia, magic is blood, and blood is magic... and it runs thick in their cold, blue veins. No being -- living or dead -- dares interrupt their dark rituals and bloody soirees.Tonight, the smell of blood is strong on the wind, and a red moon lights up the dark sky. A new vampire war is imminent, and none will be spared from the coming horrors.Immortal Realms: Vampire Wars is an engaging strategy game set in a dark vampire world in turmoil, that combines empire management and turn-based combat with unique card-game elements. Descend into a mythical world filled with horrors and legends -- and hurl yourself into a compelling gothic epos paired with a challenging game experience.… Expand"}, {"name": "Nobunaga's Ambition: Taishi", "details_link": "https://www.metacritic.com/game/playstation-4/nobunagas-ambition-taishi", "publisher": "Koei Tecmo Games", "release_date": "Jun  5 2018", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/81945a1e751b31b597586cec8960120a-98.jpg", "descriptions": "Nobunaga's Ambition: Taishi is the 15th and latest in the historical simulation game series Nobunaga's Ambition. Where a warrior's resolve exceeds their ambition. We offer the grandest warring states experience to all the fans out there."}, {"name": "Dustforce", "details_link": "https://www.metacritic.com/game/playstation-3/dustforce", "publisher": "Capcom", "release_date": "Feb  4 2014", "developers": ["Hitbox ", "QLOC"], "platforms": ["PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/2963f2ee574af23f9d8e91dac69730ca-98.jpg", "descriptions": "In Dustforce, players stylishly flow through precarious environments, sweeping up dust, leaves, trash and slime. The cleaners face off against the fourSprites who are determined to make a mess of the whole world"}, {"name": "Full Auto", "details_link": "https://www.metacritic.com/game/xbox-360/full-auto", "publisher": "Sega", "release_date": "Feb 14 2006", "developers": ["Pseudo Interactive"], "platforms": "Xbox 360", "num_players": "Up to 8 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 70, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/0e697263e4fc906f08eeb9a910e3cf51-98.jpg", "descriptions": "Full Auto combines fully-automatic, weapon-equipped vehicles with highly detailed urban landscapes, offering the most destructive environments ever featured in the racing genre. In Full Auto, the city of Staunton is held hostage by a mysterious group known only as The Shepherds. As a retiredFull Auto combines fully-automatic, weapon-equipped vehicles with highly detailed urban landscapes, offering the most destructive environments ever featured in the racing genre. In Full Auto, the city of Staunton is held hostage by a mysterious group known only as The Shepherds. As a retired driver, you are coerced by the Shepherds into a series of lethal street races, where the cost of competing is far greater than anyone ever expected. 'Unwreck', a new feature that makes mid-race \"restarts\" a thing of the past, allows players to rewind short periods of time. Botch a turn? Correct it. Miss a shortcut? Go back and take it. Under heavy fire? Use a second chance to evade the competition. And Xbox Live support ensures significant replay value for gamers itching to take on human opponents in both grand-scale arena modes and full-throttle races. Full Auto allows players to choose from a wide selection of unique vehicle designs and arm them with any combination of machine guns, cannons, and other deadly weapons before taking to the streets. The rules of the road don't apply in this high-octane, no-holds-barred competition. [Sega]… Expand"}, {"name": "Fallout: New Vegas - Dead Money", "details_link": "https://www.metacritic.com/game/pc/fallout-new-vegas---dead-money", "publisher": "Bethesda Softworks", "release_date": "Feb 22 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/28d6ea650298e8102bdf0f292eacf083-98.jpg", "descriptions": "As the victim of a raw deal you must work alongside three other captured wastelanders to recover the legendary treasure of the Sierra Madre Casino. In Dead Money, your life hangs in the balance as you face new terrain, foes, and choices. It is up to you how you play your cards in the questAs the victim of a raw deal you must work alongside three other captured wastelanders to recover the legendary treasure of the Sierra Madre Casino. In Dead Money, your life hangs in the balance as you face new terrain, foes, and choices. It is up to you how you play your cards in the quest to survive.… Expand"}, {"name": "Madagascar", "details_link": "https://www.metacritic.com/game/gamecube/madagascar", "publisher": "Activision", "release_date": "May 24 2005", "developers": ["Toys for Bob"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 70, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/f24e7cac5da62f185dd0cc0ca3e78dff-98.jpg", "descriptions": "Based on the animated film from DreamWorks, Madagascar tells the tale of four animals in New York's Central Park Zoo. You must use the skills of your animal crew (consisting of a lion, zebra, giraffe, and hippo) to overcome a variety of dangerous obstacles. As you meet new characters andBased on the animated film from DreamWorks, Madagascar tells the tale of four animals in New York's Central Park Zoo. You must use the skills of your animal crew (consisting of a lion, zebra, giraffe, and hippo) to overcome a variety of dangerous obstacles. As you meet new characters and battle enemies, you'll develop new skills, such as the stealth crawl, the helicopter spin, and the running barrel. Replay levels to unlock character-specific bonuses and cheats. … Expand"}, {"name": "Regalia: Of Men and Monarchs - Royal Edition", "details_link": "https://www.metacritic.com/game/playstation-4/regalia-of-men-and-monarchs---royal-edition", "publisher": "Crunching Koalas", "release_date": "Apr 10 2018", "developers": ["Pixelated Milk"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 70, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/ea30359a83dd93a57082204b167609c4-98.jpg", "descriptions": "Regalia: Of Men And Monarchs is a tactical RPG set in a cheerful fantasy world full of weirdness and wonder. Assemble your party, go adventuring, manage your kingdom, make new friends, and defeat your opponents in challenging turn-based combat."}, {"name": "The Golf Club", "details_link": "https://www.metacritic.com/game/pc/the-golf-club", "publisher": "HB Studios Multimedia", "release_date": "Aug 19 2014", "developers": ["HB Studios Multimedia"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Traditional", "Sports", "Individual", "Golf", "Sim"], "meta_score": 70, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/dd08bfb23c08f8ab5ff62ae89bf1b591-98.jpg", "descriptions": "The Golf Club is HB Studios next generation golf simulation. The Course Creator can generate a brand new course in seconds which can be shared and played immediately online with friends and other gamers across the world. There are also full editing capabilities for courses, Tournaments andThe Golf Club is HB Studios next generation golf simulation. The Course Creator can generate a brand new course in seconds which can be shared and played immediately online with friends and other gamers across the world. There are also full editing capabilities for courses, Tournaments and Tours. Challenge your friends on a new or existing course in real time or try to beat their best recorded round. Add to this a myriad of stat tracking and personal bests of friends and rivals to beat, notifications, challenges and social media integration and you truly have a golf club worth joining.… Expand"}, {"name": "The Kore Gang", "details_link": "https://www.metacritic.com/game/wii/the-kore-gang", "publisher": "Atari", "release_date": "Nov  8 2011", "developers": ["Snap Dragon Games"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 70, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/674b0715dbbede8d91b49571057dce93-98.jpg", "descriptions": "Take control of a giant mech and save New York City in this quirky action adventure game."}, {"name": "NHL 2K9", "details_link": "https://www.metacritic.com/game/playstation-3/nhl-2k9", "publisher": "Take-Two Interactive", "release_date": "Sep  8 2008", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/263b31cce2c2fd612645d9d1403e8145-98.jpg", "descriptions": "Fans asked and 2K Sports answered with easy-to-learn controls that still provide depth for the season veteran. With 2K Sports' classic default controls, a player’s first game will be as enjoyable as their one-thousandth, while the new and intuitive hybrid controls will provide the depthFans asked and 2K Sports answered with easy-to-learn controls that still provide depth for the season veteran. With 2K Sports' classic default controls, a player’s first game will be as enjoyable as their one-thousandth, while the new and intuitive hybrid controls will provide the depth experienced vets are looking for. Enhanced Gameplay - An updated arsenal of highlight reel-worthy superstar moves, blocked shots, stick-handling moves, hit-by-puck collisions, and a greatly-enhanced skating engine make up for an exciting and all-new hockey experience complete with more than 1,400 new gameplay animations. All-New Presentation System – Pre-game intros, menus, new crowd animations, game summary replays, and brand new commentary featuring Randy Hahn and Drew Remenda of the San Jose Sharks bring a fresh new look and sound to NHL 2K9’s visual and audio experience. [2K Sports]… Expand"}, {"name": "RONIN", "details_link": "https://www.metacritic.com/game/pc/ronin", "publisher": "Devolver Digital", "release_date": "Jun 30 2015", "developers": ["Tomasz Waclawek"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 70, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/3c5d5a4ecb3a66d4630ffea8cbfece73-98.jpg", "descriptions": "Ronin is stylish a turn-based action platformer following the exploits of a vengeful heroine determined to strike down five prominent figures of a powerful corporation."}, {"name": "NASCAR Kart Racing", "details_link": "https://www.metacritic.com/game/wii/nascar-kart-racing", "publisher": "Electronic Arts", "release_date": "Feb 10 2009", "developers": ["Electronic Arts"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart"], "meta_score": 70, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/3ce601063a0135ab8faa7b075b560d96-98.jpg", "descriptions": "Enjoy the thrill of racing as three-time consecutive Sprint Cup Series champion Jimmie Johnson or choose from 13 additional NASCAR Sprint Cup Series drivers.  Players can also compete as one of 10 original animated characters.  Each driver has personal attributes that will determine how theEnjoy the thrill of racing as three-time consecutive Sprint Cup Series champion Jimmie Johnson or choose from 13 additional NASCAR Sprint Cup Series drivers.  Players can also compete as one of 10 original animated characters.  Each driver has personal attributes that will determine how the kart will perform on a course, so strategy is key when choosing a driver and a teammate.  Teams that work together win championships! The courses in NASCAR Kart Racing feature a vast range of exhilarating terrain. Experience 24 entertaining race layouts that wrap through deserts, freeways, back roads, canyons, junkyards and more.  Drivers will also push the pedal to the metal in areas surrounding four popular NASCAR tracks: Daytona International Speedway, Talladega Superspeedway, Dover International Speedway and Bristol Motor Speedway. Each track in NASCAR Kart Racing can be reversed to provide two unique racing experiences. Your journey to become a champion in NASCAR Kart Racing begins by competing in 13 series against featured drivers from different racing backgrounds.  Defeat the rivals of each series to unlock new courses, drivers, game modes and the next series.  Beat all of the events at a track and you will receive a track sponsorship complete with billboards featuring your driver’s face - an obvious statement to your family and friends that you are the top competitor. Race throughout the series to earn the championship title that affords stunning trophies and the glory of being recognized as the ultimate NASCAR driver. [Electronic Arts]… Expand"}, {"name": "No Straight Roads", "details_link": "https://www.metacritic.com/game/playstation-4/no-straight-roads", "publisher": "Sold Out", "release_date": "Aug 25 2020", "developers": ["Metronomik"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music", "Action Adventure", "Open-World"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/53e0a00fc00062dc6f5d421a254e616b-98.jpg", "descriptions": "Embark on a music-based action-adventure as indie rock band members Mayday & Zuke and lead a musical revolution against EDM empire No Straight Roads. After being unfairly rejected in their audition to join No Straight Roads, Mayday & Zuke uncover the evil intentions behind the NSR empire.Embark on a music-based action-adventure as indie rock band members Mayday & Zuke and lead a musical revolution against EDM empire No Straight Roads. After being unfairly rejected in their audition to join No Straight Roads, Mayday & Zuke uncover the evil intentions behind the NSR empire. It's now down to them to save their city from corruption. Enjoy fast & frenetic combat with a musical twist as these two aspiring rock artists fight back with the power of music!… Expand"}, {"name": "Rick and Morty: Virtual Rick-ality", "details_link": "https://www.metacritic.com/game/playstation-4/rick-and-morty-virtual-rick-ality", "publisher": "Adult Swim", "release_date": "Apr 10 2018", "developers": ["Owlchemy Labs"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "General", "3D", "First-Person"], "meta_score": 70, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/09029336097e999050424748d3e9d350-98.jpg", "descriptions": "Rick and Morty have teleported into your living room for a cutting-edge VR adventure. Play as a Morty clone as you explore Rick’s garage, the Smith household, and alien worlds."}, {"name": "Madden NFL 07", "details_link": "https://www.metacritic.com/game/ds/madden-nfl-07", "publisher": "EA Sports", "release_date": "Aug 22 2006", "developers": ["Exient Entertainment"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 70, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/5b30ac5c4005f872666f9257d8009933-98.jpg", "descriptions": "With the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback andWith the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback and smash through, overpower, or slash away from would-be tacklers as you fight for every yard. Innovative rushing controls give you a game-breaking ground attack featuring all-new jukes, cutbacks, and the distinct running styles of your favorite backs. [Electronic Arts]… Expand"}, {"name": "Jet Set Radio", "details_link": "https://www.metacritic.com/game/xbox-360/jet-set-radio", "publisher": "Sega", "release_date": "Sep 19 2012", "developers": ["Blit"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 70, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/21f7b342f41af3d3111bd0b972010762-98.jpg", "descriptions": "Jet Set Radio lets players join the GGs, an up-and-coming street gang in the futuristic city of Tokyo-to, fighting for the right to self-expression against an overbearing, corporate-controlled police force. Rolling and leaping through crowded urban environments on magnetically driven inlineJet Set Radio lets players join the GGs, an up-and-coming street gang in the futuristic city of Tokyo-to, fighting for the right to self-expression against an overbearing, corporate-controlled police force. Rolling and leaping through crowded urban environments on magnetically driven inline skates, players take control of gang leader Beat and his growing posse of deviant artists as they steal turf from the local gangs by covering the city with colorful graffiti. Guided by Professor K, DJ for the hottest pirate broadcast in town - \"Jet Set Radio\" - the GGs will ultimately uncover the sinister plot hatched by the controlling powers of Tokyo-to.… Expand"}, {"name": "Haunt", "details_link": "https://www.metacritic.com/game/xbox-360/haunt", "publisher": "Microsoft Game Studios", "release_date": "Jan 18 2012", "developers": ["NanaOn-Sha"], "platforms": "Xbox 360", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 70, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/7117c837794bcf6cf9518b7a517123b0-98.jpg", "descriptions": null}, {"name": "Jett Rocket", "details_link": "https://www.metacritic.com/game/wii/jett-rocket", "publisher": "Shin'en", "release_date": "Jun 28 2010", "developers": ["Shin'en"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "Platformer", "Sci-Fi", "Sci-Fi", "Third-Person", "3D"], "meta_score": 70, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/9a0e6b427078c0b7c3325602c7c98776-98.jpg", "descriptions": "[WiiWare]  Jump and run and fly. Let Jett Rocket explore the beautiful planet of Yoroppa and find out why it has been attacked by the evil Power Plant Posse. Visit tropical islands, poisonous swamps and freezingly cold glaciers. Ride the ocean on your Jet Boat, parachute from giant cliffs,[WiiWare]  Jump and run and fly. Let Jett Rocket explore the beautiful planet of Yoroppa and find out why it has been attacked by the evil Power Plant Posse. Visit tropical islands, poisonous swamps and freezingly cold glaciers. Ride the ocean on your Jet Boat, parachute from giant cliffs, speed through arctic regions on your Jet Snowboard or skyrocket with your Jet Turbine. You will need everything you've got to fight back and save Yoroppa. Just be Jett Rocket in this epic futuristic full 3D action adventure.… Expand"}, {"name": "Halo: Spartan Assault", "details_link": "https://www.metacritic.com/game/pc/halo-spartan-assault", "publisher": "Microsoft Game Studios", "release_date": "Jul 18 2013", "developers": ["Vanguard", "343 Industries"], "platforms": ["iPhone/iPad", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Shooter", "Scrolling", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 70, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/088ec4ed8833b4980b020133b6079669-98.jpg", "descriptions": "Available only for Windows 8 and Windows Phone 8, \"Halo: Spartan Assault\" is a new top-down action shooter that brings a \"Halo\" video game to touch-based devices for the first time in franchise history. Developed by 343 Industries in conjunction with Vanguard Games,Available only for Windows 8 and Windows Phone 8, \"Halo: Spartan Assault\" is a new top-down action shooter that brings a \"Halo\" video game to touch-based devices for the first time in franchise history. Developed by 343 Industries in conjunction with Vanguard Games, \"Halo: Spartan Assault\" provides an accessible, pick-up-and-play experience for fans and newcomers alike.\r Set between the events of \"Halo 3\" and \"Halo 4,\" \"Halo: Spartan Assault\" is a new chapter of the award-winning \"Halo\" universe that explores the first missions of the Spartan Ops program and dives deeper into the backstory of Human-Covenant wars. Play through the eyes of either Commander Sarah Palmer or Spartan Davis stationed aboard the UNSC Infinity as they fight never-before-seen battles against Covenant forces.\r With rich storytelling, intuitive controls, and best-in-class action, audio and graphics, \"Halo: Spartan Assault\" brings the epic scale and action of the \"Halo\" universe to mobile devices through unrivaled action and intensity.… Expand"}, {"name": "Warriors Orochi 3", "details_link": "https://www.metacritic.com/game/playstation-3/warriors-orochi-3", "publisher": "Tecmo Koei America Corp.", "release_date": "Mar 20 2012", "developers": ["Omega Force"], "platforms": ["Wii U", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 70, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/4dd8a0f06087d2947306cb2e99c9234f-98.jpg", "descriptions": "Years after the battle against Orochi, the Serpent King, the heroes of the Three Kingdoms and the Warring States struggle to seize control of the new universe they were thrown into when a new threat arises. A terrible and colossal monster, resembling a serpent with eight heads, casts itsYears after the battle against Orochi, the Serpent King, the heroes of the Three Kingdoms and the Warring States struggle to seize control of the new universe they were thrown into when a new threat arises. A terrible and colossal monster, resembling a serpent with eight heads, casts its shadow across the land and defeats most of the brave warriors.\r \rThe ones that survived, assisted by the mysterious Kaguya, travel back through time to save fallen warriors and forge new alliances, collect powerful weapons and build an army so they can have a chance to defeat the terrible Hydra.\rBut that is not all the help they’ll get this time, as the vortex created by Orochi drags a few more allies to their universe. Dragon Ninja Ryu Hayabusa, Achilles, Jeanne d'Arc, Nemea and Ayane are only a few of the new additions to the 120 plus playable character roster!… Expand"}, {"name": "The Legend of Kage 2", "details_link": "https://www.metacritic.com/game/ds/the-legend-of-kage-2", "publisher": "Taito Corporation", "release_date": "Oct  8 2008", "developers": ["Taito Corporation"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/c575acd7e18b1dee27796e42654866f3-98.jpg", "descriptions": "The hit arcade game returns, now on a handheld console for the first time. The dual-screen functionality of Nintendo DS injects life into the vibrant game world and its elaborate, action-packed stages. Various combinations of Element Orbs allow players to perform an assortment of skills andThe hit arcade game returns, now on a handheld console for the first time. The dual-screen functionality of Nintendo DS injects life into the vibrant game world and its elaborate, action-packed stages. Various combinations of Element Orbs allow players to perform an assortment of skills and Ninjutsu techniques. Two stories told through two protagonists, both with unique attack abilities, provide twice the adventure for players.… Expand"}, {"name": "Tom Clancy's HAWX", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-hawx", "publisher": "Ubisoft", "release_date": "Mar 17 2009", "developers": ["Ubisoft Romania"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 70, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/dc95307450be3ad772e337a027559b94-98.jpg", "descriptions": "Tom Clancy's HAWX (high-altitude warfare) promises to revolutionize the way players think about combat in the sky. The story begins in the year 2012. As the era of the nation-state draws quickly to a close, the rules of warfare evolve even more rapidly. More and more nations becomeTom Clancy's HAWX (high-altitude warfare) promises to revolutionize the way players think about combat in the sky. The story begins in the year 2012. As the era of the nation-state draws quickly to a close, the rules of warfare evolve even more rapidly. More and more nations become increasingly dependent on private military companies (PMCs), elite mercenaries with a lax view of the law. The Reykjavik Accords further legitimize their existence by authorizing their right to serve in every aspect of military operations. While the benefits of such PMCs are apparent, growing concerns surrounding giving them too much power begin to mount. The Enhanced Reality System is the backbone of the HAWX flight experience: radars and incoming missile detection, anti-crash system, damage control system, tactical map and information relay, and weapons trajectory control. E.R.S. also allows players to issue orders to their squadron, making this system as iconic to HAWX as the Cross-Com system is to Tom Clancy's Ghost Recon Advanced Warfighter. Players can ease into their flight missions and gain a level of comfort with the use of the assistance mode. Once employed, players can take full advantage of their technological support through the E.R.S and gain maximum piloting security. If the situation calls for the player to unleash the full potential of the aircraft, the assistance mode can be switched off and all safety features will be deactivated. For the first time ever in the air-combat genre, players can experience the entire solo campaign in four-player JUMP IN co-op mode. In PVP mode, players can challenge up to 15 friends in intense dogfighting sessions and find out who's the top gun. Winning players are rewarded with experience points and money to unlock more weapons. Players have the opportunity to take the throttle of over 50 of the world's most famous aircrafts, as well as being able to dogfight over realistic modern landscapes that have endured years of post-war trauma. [Ubisoft]… Expand"}, {"name": "Beyond A Steel Sky", "details_link": "https://www.metacritic.com/game/pc/beyond-a-steel-sky", "publisher": "Revolution Software", "release_date": "Jul 16 2020", "developers": ["Revolution Software"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Third-Person"], "meta_score": 70, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/c86c3089058a2d3d0dad27f953262a15-98.jpg", "descriptions": "A 3D adventure thriller, set in an AI-driven future. Subvert the world, hack the systems and solve the conspiracy to uncover the devastating truths."}, {"name": "Guitar Hero: Aerosmith", "details_link": "https://www.metacritic.com/game/xbox-360/guitar-hero-aerosmith", "publisher": "Activision", "release_date": "Jun 29 2008", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/5a6a0283f8665a5cecb73e6d1f332e05-98.jpg", "descriptions": "Guitar Hero: Aerosmith is the first game built around the legendary music of \"America's Greatest Rock ‘N Roll Band\": Steven Tyler, Joe Perry, Brad Whitford, Tom Hamilton and Joey Kramer. This latest Guitar Hero installment puts players in the shoes of Perry (guitar), Whitford (guitar) andGuitar Hero: Aerosmith is the first game built around the legendary music of \"America's Greatest Rock ‘N Roll Band\": Steven Tyler, Joe Perry, Brad Whitford, Tom Hamilton and Joey Kramer. This latest Guitar Hero installment puts players in the shoes of Perry (guitar), Whitford (guitar) and Hamilton (bass), as they rock out alongside frontman Tyler and drummer Kramer. Gamers experience Aerosmith’s Grammy winning career, from their first gig to becoming rock royalty, in a way that no other entertainment vehicle offers. As fans progress through their careers in the game, they can rock out to scores of Aerosmith’s greatest hits, as well as songs from celebrated artists that the band has either performed with or has been inspired by in some way.  Venues from historical moments during the band's illustrious career offer the experience of \"sweet emotion\" and further capture the essence of the band's rise to fame. [Activision]… Expand"}, {"name": "The Urbz: Sims in the City", "details_link": "https://www.metacritic.com/game/xbox/the-urbz-sims-in-the-city", "publisher": "EA Games", "release_date": "Nov  9 2004", "developers": ["Maxis"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 70, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/7f88229f6b94b84e701202eb5e881c30-98.jpg", "descriptions": "The Sims have moved to the City where there's always action and where reputation means everything. In the Urbz: Sims in the City, you can go to work at such locations as the Sushi Bar, Chop Shop, or Bootleg Fireworks, Inc. Success at work brings promotions, access to new power socials, andThe Sims have moved to the City where there's always action and where reputation means everything. In the Urbz: Sims in the City, you can go to work at such locations as the Sushi Bar, Chop Shop, or Bootleg Fireworks, Inc. Success at work brings promotions, access to new power socials, and gear to influence your new lifestyle. Flaunt your attitude by styling your Urbz, and then cross the velvet ropes of an uptown night club, or explore the subway to earn new skills and items. … Expand"}, {"name": "GripShift", "details_link": "https://www.metacritic.com/game/psp/gripshift", "publisher": "Sony Platform Publishing", "release_date": "Sep 12 2005", "developers": ["Sidhe Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "PSP"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 70, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/cd7d7c45710ab94dc4f8e7448997828c-98.jpg", "descriptions": "GripShift is one of the first video games for the PSP system to combine high-flying stunt driving and unique puzzle-solving action in an all-out, pedal-to-the-metal racing experience. Players race as one of six unique characters in supped-up, customizable vehicles as they stunt their wayGripShift is one of the first video games for the PSP system to combine high-flying stunt driving and unique puzzle-solving action in an all-out, pedal-to-the-metal racing experience. Players race as one of six unique characters in supped-up, customizable vehicles as they stunt their way through insane twisting levels while collecting power-ups, avoiding traps, beating the clock and challenging friends.  Featuring more than 100 levels of puzzle-like challenges in fun, vibrant environments, and additional bonus games, players can race solo or with up to three other players via the PSP system’s built-in wireless feature. Features unlockable racing circuits, bonus games and the ability to create custom tracks with the in-game Track Editor and share them wirelessly with other players. [Sony Online Entertainment]… Expand"}, {"name": "Circus Electrique", "details_link": "https://www.metacritic.com/game/switch/circus-electrique", "publisher": "Saber Interactive", "release_date": "Sep  6 2022", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/586cddb0bc6eac9617c5ce3b69bd9d1e-98.jpg", "descriptions": "When everyday Londoners mysteriously turn into vicious killers, only the circus' lineup of Strongmen, Fire Blowers, Clowns and other performers possess the unique talents necessary to save the city. Circus Electrique is part story-driven RPG, part tactics, part circus management, andWhen everyday Londoners mysteriously turn into vicious killers, only the circus' lineup of Strongmen, Fire Blowers, Clowns and other performers possess the unique talents necessary to save the city. Circus Electrique is part story-driven RPG, part tactics, part circus management, and completely enthralling - all with a steampunk twist. Through tactical turn-based battles, these unlikely heroes face Bobbies, British Sailors gone bad, aggressive Posh Girls, and other Victorian-era archetypes stand in their way - not to mention the occasional menacing Mime or Robobear. The game's innovative Devotion morale system affects characters' performance not only in battles, but also for actual circus shows, dutifully managed between heroic jaunts through six sprawling districts.… Expand"}, {"name": "Mothmen 1966", "details_link": "https://www.metacritic.com/game/pc/mothmen-1966", "publisher": "Chorus Worldwide", "release_date": "Jul 14 2022", "developers": ["LCB Game Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 70, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/c83170864d21cde8a8264004e5b064ba-98.jpg", "descriptions": "Mothmen 1966 is a 'Pixel Pulp' - a visual novel featuring a fusion of exceptional writing and stunning illustration, inspired by mid-20th century pulp fiction and 80s home computer graphics - set amongst the strange occurrences of the Leonid meteor shower of 1966."}, {"name": "Moncage", "details_link": "https://www.metacritic.com/game/pc/moncage", "publisher": "X.D. Network Inc.", "release_date": "Nov 15 2021", "developers": ["OPTILLUSION"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/d8b7d437f162aa23ff1c92e190d8937b-98.jpg", "descriptions": "Moncage is a stunning vignette puzzle adventure developed by Optillusion.The game takes place inside a mysterious cube, with each side of the cube housing a unique world: be it an old factory, a light tower, an amusement park, or a church, etc. At first sight, they may seem random andMoncage is a stunning vignette puzzle adventure developed by Optillusion.The game takes place inside a mysterious cube, with each side of the cube housing a unique world: be it an old factory, a light tower, an amusement park, or a church, etc. At first sight, they may seem random and unrelated, but upon closer look, you will become mesmerized by the subtle and intricate ways of how these worlds connect...Use your imagination and spare no brain cells to find the connection and pinpoint every possible interaction between different sides of the cube, then watch as the magic unfold in front of you.Behind the puzzles, there lies a story with a surprising twist for the player to uncover. Collect the photos from obscure corners and angles to reveal the underlying story, one photo at a time.… Expand"}, {"name": "Madden NFL 22", "details_link": "https://www.metacritic.com/game/xbox-series-x/madden-nfl-22", "publisher": "Electronic Arts", "release_date": "Aug 17 2021", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 70, "users_score": 0.6, "image": "https://static.metacritic.com/images/products/games/0/1e7c168e87ebc4829b6e5ee9175f5892-98.jpg", "descriptions": "There will be more detailed staff management and skill tree progression systems, with comprehensive weekly game strategy that integrates into your gameplan. Through the regular season and off-season, new scenarios will keep things fresh as you weigh various risks and rewards to make theThere will be more detailed staff management and skill tree progression systems, with comprehensive weekly game strategy that integrates into your gameplan. Through the regular season and off-season, new scenarios will keep things fresh as you weigh various risks and rewards to make the right decisions for your team. Plus, Franchise will see improvements throughout the year via three Live Service updates. Our first live service update targeting September to release is one of your top requested features, Player Scouting. Keep an eye out for more Gridiron Notes as each Live Service update rolls in. The Yard is back with a new challenge-based Solo campaign. You can now visit new fields located on gorgeous beaches and beautiful mountain landscapes across the world, battle boss characters with unmatched NFL talents, and unlock celebrations and items for your avatar. Plus, a new ranked mode can allow for you competitive Yard players out there to test your skills against one another and earn rewards. Face of the Franchise returns - and this time with more customization. The mode lets you shape your story as a quarterback, wide receiver, running back, or (for the first time ever) a linebacker striving to reach NFL superstardom and become more than the game. You’ll start out prepping for the NFL and experiencing flashbacks to your most pivotal college football moments. You’ll then take the stage on Draft Day and begin the once in a lifetime NFL journey, playing every game of your rookie season, rising to the top all based on the choices you make. An all-new Player Class and progression system also lets you choose your skills, ratings, and unique attributes with even more customization options to realistically craft your avatar. You can also level up this year by sharing progression between The Yard and the all-new Face of the Franchise: Unite We Rise, so you never miss a beat.  Superstar KO is back again in Madden NFL 22 with a co-op eliminator mode. You’ll be able to play quick games in unique stadiums with fan favorite house rules and icons of football culture. Authentic NFL teams, various stadiums and rosters will also be available for the first time.… Expand"}, {"name": "Risk System", "details_link": "https://www.metacritic.com/game/switch/risk-system", "publisher": "Hidden Trap", "release_date": "Jul 15 2021", "developers": ["Hidden Trap"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/57a0977efe16d7cef03202ee41953108-98.jpg", "descriptions": "In the distant future, humanity has discovered a method to replicate matter through the use of a Dimensional Gate. Industry is revolutionized overnight and a short period of chaos gives way to all warring factions uniting under a common banner.A few years pass and the peace brought aboutIn the distant future, humanity has discovered a method to replicate matter through the use of a Dimensional Gate. Industry is revolutionized overnight and a short period of chaos gives way to all warring factions uniting under a common banner.A few years pass and the peace brought about by Gate Technology crumbles once a new threat appears; a race of energy parasites that have crossed through the Dimensional Gate by mimicking the very materials humanity had believed they were replicating. Mankind is quickly overtaken as their technology is turned against them and the energy emitted by the parasites begins to take control of those exposed.In an act of desperation, the experimental RSK9 is constructed, a ship made of Pre-Gate materials and technology with the ability to absorb parasite energy and use it to power its incredible arsenal. Piloting the RSK9 is Alys, an ace pilot previously missing in action that has returned seemingly immune to parasite control. Her skill and resistance to the parasite energies influence make her the only pilot capable of preventing the extinction of mankind.… Expand"}, {"name": "King of Seas", "details_link": "https://www.metacritic.com/game/xbox-one/king-of-seas", "publisher": "Team17", "release_date": "May 25 2021", "developers": ["3DClouds"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "Action RPG"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/ea7f3c99dd2393a1c68477974ac3961f-98.jpg", "descriptions": "King of Seas is an Action Role playing game set in a procedural pirate world. An epic adventure awaits you in a fantastic world, dotted with fights, lost islands and treasures. A universe that will keep you anchored as you struggle to become the king of all pirates."}, {"name": "Assassin's Creed Valhalla: Wrath of the Druids", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-valhalla-wrath-of-the-druids", "publisher": "Ubisoft", "release_date": "May 13 2021", "developers": ["Ubisoft Bordeaux"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 70, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/c79593d07af976ae70ac680ba39d1961-98.jpg", "descriptions": "Explore the haunted wilds and beautiful landscapes of Ireland as you battle a druidic cult known as the Children of Danu. Conquer ring forts, master the art of smuggling, and gain the favor of Gaelic kings in a new open-world adventure."}, {"name": "Skate City", "details_link": "https://www.metacritic.com/game/switch/skate-city", "publisher": "Agens", "release_date": "May  6 2021", "developers": ["Snowman"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/f3c9a72a5e63a99f21e74c5acb1edd4c-98.jpg", "descriptions": "Skate City captures the heart and soul of street skating in an authentic light. Players will have the opportunity to explore three unique cities based off of real-world skate locations, including the streets of Los Angeles, Oslo, and Barcelona in our console and PC release. Set to originalSkate City captures the heart and soul of street skating in an authentic light. Players will have the opportunity to explore three unique cities based off of real-world skate locations, including the streets of Los Angeles, Oslo, and Barcelona in our console and PC release. Set to original lo-fi beats, you can ride like a local through each city’s Challenge mode, or take it at your own pace with Endless Skate. … Expand"}, {"name": "Root Film", "details_link": "https://www.metacritic.com/game/playstation-4/root-film", "publisher": "PQube", "release_date": "Mar 19 2021", "developers": ["Kadokawa"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/46c9513f91528f463ff9163979362794-98.jpg", "descriptions": "Two protagonists star side by side in Kadokawa Games's latest mystery adventure, Root Film. Up-and-coming filmmaker Rintaro Yagumo is scheduled to participate in the production of a mystery drama/PR initiative TV series set in Shimane Prefecture, which was cancelled for an unknown reason 10Two protagonists star side by side in Kadokawa Games's latest mystery adventure, Root Film. Up-and-coming filmmaker Rintaro Yagumo is scheduled to participate in the production of a mystery drama/PR initiative TV series set in Shimane Prefecture, which was cancelled for an unknown reason 10 years ago. However, a series of bizarre murders seem to follow them wherever they go... and it's up to Rintaro and new actress Riho to connect the dots. The Intuition mechanic allows players to find keywords during conversations throughout the game. When players discover enough keywords, they can then confront other characters in Max Mode, a fighting-game-style showdown, to solve a mystery. Are you ready to uncover the shocking truth...?… Expand"}, {"name": "Disjunction", "details_link": "https://www.metacritic.com/game/playstation-4/disjunction", "publisher": "Sold Out", "release_date": "Jan 28 2021", "developers": ["Ape Tribe Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/1b0cfa9d22ee3c0990f4e2728f29576b-98.jpg", "descriptions": "Disjunction features unique stealth-action mechanics and abilities for each of its three playable characters, giving players the freedom and flexibility to choose the playstyle that suits them. Tackle encounters in lethal, high-octane combat, or use your wits to stick to the shadows,Disjunction features unique stealth-action mechanics and abilities for each of its three playable characters, giving players the freedom and flexibility to choose the playstyle that suits them. Tackle encounters in lethal, high-octane combat, or use your wits to stick to the shadows, utilizing distraction techniques and non-lethal attacks to reach your objective.… Expand"}, {"name": "Immortals Fenyx Rising: A New God", "details_link": "https://www.metacritic.com/game/xbox-series-x/immortals-fenyx-rising-a-new-god", "publisher": "Ubisoft", "release_date": "Jan 28 2021", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X"], "genres": ["Action Adventure", "Open-World"], "meta_score": 70, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/4/cb3a42eb02513ad62db54dd8ea62fdfd-98.jpg", "descriptions": "As Fenyx, overcome the legendary trials and challenges of the gods of Olympos to change the Greek Pantheon and fulfill your destiny."}, {"name": "Minoria", "details_link": "https://www.metacritic.com/game/switch/minoria", "publisher": "DANGEN Entertainment", "release_date": "Sep 10 2020", "developers": ["Bombservice"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Open-World"], "meta_score": 70, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/2f5a83d4cec77ead4d11c15ab4441165-98.jpg", "descriptions": "Ink and blood stain the streets of Ramezia. Witches must burn and sins must be judged. Venture forth as Sister Semilla to burn down the pillars of heresy in Minoria, an action-platformer by Bombservice, creators of Momodora."}, {"name": "The Sims 4: Star Wars - Journey to Batuu", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-star-wars---journey-to-batuu", "publisher": "Electronic Arts", "release_date": "Sep  8 2020", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 70, "users_score": 1.1, "image": "https://static.metacritic.com/images/products/games/8/ee64c2dd2d40cfc30c449072f9501262-98.jpg", "descriptions": "Your Sims are definitely not at home anymore. From the Millennium Falcon to the bustling cantina and unique attire of Batuu, Sims will be surrounded by the iconic sights and sounds of Star Wars. Socialize with the alien locals to truly understand why Batuu is unlike any other planet. WhenYour Sims are definitely not at home anymore. From the Millennium Falcon to the bustling cantina and unique attire of Batuu, Sims will be surrounded by the iconic sights and sounds of Star Wars. Socialize with the alien locals to truly understand why Batuu is unlike any other planet. When your Sim returns home, bring back new decor and recipes inspired by your travels, play a game of sabacc, or host a playful lightsaber training session.\r… Expand"}, {"name": "Radical Rabbit Stew", "details_link": "https://www.metacritic.com/game/playstation-4/radical-rabbit-stew", "publisher": "Sold Out", "release_date": "Jul 16 2020", "developers": ["Pugstorm"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Arcade"], "meta_score": 70, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/ea22002db9524287ba5afb079eab4f07-98.jpg", "descriptions": "Radical Rabbit Stew is an action-packed title that combines puzzle-solving with fast-paced whack-a-rabbit gameplay, delivering bite-sized pick-up-and-play action, juicy pixel graphics and a sizzling soundtrack in one mouth-watering package."}, {"name": "Namco Museum Archives Vol. 1", "details_link": "https://www.metacritic.com/game/switch/namco-museum-archives-vol-1", "publisher": "Bandai Namco Games", "release_date": "Jun 18 2020", "developers": ["B.B.Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/d880557d493e6d53276320d3ec1e6061-98.jpg", "descriptions": "Take a trip down memory lane and relive the magical times of the 8-Bit era with a collection of Namco’s hits and long-lost treasures in Namco Museum Archives Volume 1.\r ■Includes 11 titles!\r\nIn addition to 10 classic Namco titles, some of which were never localized and released in theTake a trip down memory lane and relive the magical times of the 8-Bit era with a collection of Namco’s hits and long-lost treasures in Namco Museum Archives Volume 1.\r ■Includes 11 titles!\rIn addition to 10 classic Namco titles, some of which were never localized and released in the west, a newly created 8-Bit demastered version of \"Pac-Man Championship Edition\" makes its world premiere as a bonus!\r(Titles included: Galaxian, Pac-Man, Xevious, Mappy, Dig Dug, The Tower of Druaga, Sky Kid, Dragon Buster, Dragon Spirit: The New Legend, Splatterhouse: Wanpaku Graffiti, and Pac-Man Championship Edition)\r ■Equipped with convenient modern functions!\rConvenient features such as the \"save function\" that allows you to interrupt the game at any time and the \"replay function\" that allows you to start over at the last minute.… Expand"}, {"name": "TT Isle of Man: Ride On The Edge 2", "details_link": "https://www.metacritic.com/game/pc/tt-isle-of-man-ride-on-the-edge-2", "publisher": "Bigben Interactive", "release_date": "Mar 19 2020", "developers": ["KT Racing"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 70, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/637280e3ea594cc70f162aa5d781c10b-98.jpg", "descriptions": "Racing across an over 60 km long ultra-technical track at breakneck speed requiring realistic riding skills... that is the challenge that awaits in TT2!"}, {"name": "Ancestors: The Humankind Odyssey", "details_link": "https://www.metacritic.com/game/playstation-4/ancestors-the-humankind-odyssey", "publisher": "Panache Digital Games", "release_date": "Dec  6 2019", "developers": ["Panache Digital Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 70, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/18350c273b8f531849d535b27fdcc712-98.jpg", "descriptions": "Ancestors: The Humankind Odyssey is a third-person open world survival game from independent studio Panache Digital Games and published by Private Division. From Creative Director Patrice Désilets, experience the beauty and danger of Africa 10 million years ago as your hominid clan mustAncestors: The Humankind Odyssey is a third-person open world survival game from independent studio Panache Digital Games and published by Private Division. From Creative Director Patrice Désilets, experience the beauty and danger of Africa 10 million years ago as your hominid clan must Explore, Expand, and Evolve to survive over the course of 8 million years. Write your own unique story of human evolution and see if you can survive like our ancestors before us.… Expand"}, {"name": "Super Monkey Ball: Banana Blitz HD", "details_link": "https://www.metacritic.com/game/xbox-one/super-monkey-ball-banana-blitz-hd", "publisher": "Sega", "release_date": "Oct 29 2019", "developers": ["Sega", "Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 70, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/0/46a1d8a0fa2500ecf9d1f33d61036a61-98.jpg", "descriptions": "\"Hold onto your bananas, because Super Monkey Ball: Banana Blitz HD is rolling your way! Experience the magic of one of the most beloved titles in the series, now remastered in HD!\r Head back into the fantastical world of Super Monkey Ball and take back your bananas from the space alien\"Hold onto your bananas, because Super Monkey Ball: Banana Blitz HD is rolling your way! Experience the magic of one of the most beloved titles in the series, now remastered in HD!\r Head back into the fantastical world of Super Monkey Ball and take back your bananas from the space alien pirate king, Captain Crabuchin. Race through over 100 colorful stages and challenge your friends and family to 10 fan-favorite Party Games! Feeling like the fastest, most maneuverable monkey around? Try out Time Attack mode or the grueling Decathlon endurance run! Will you make it onto the scoreboard?\"… Expand"}, {"name": "Sega Ages: Ichidant-R", "details_link": "https://www.metacritic.com/game/switch/sega-ages-ichidant-r", "publisher": "Sega", "release_date": "Oct 17 2019", "developers": ["M2", "CRI"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/a0dd1b975278fda4a625d8ee62e55e04-98.jpg", "descriptions": "Releasing in the West for the first time, Ichidant-R, the wacky series of timed puzzle mini-games, is now available in the SEGA AGES series for Nintendo Switch™.\r Push the limits of your brain and your coordination by hunting for hidden vampires, conducting an orchestra, warping your wayReleasing in the West for the first time, Ichidant-R, the wacky series of timed puzzle mini-games, is now available in the SEGA AGES series for Nintendo Switch™.\r Push the limits of your brain and your coordination by hunting for hidden vampires, conducting an orchestra, warping your way through mazes, shooting down UFOS, and much more across 20 wildly varied mini games! … Expand"}, {"name": "MXGP 2019", "details_link": "https://www.metacritic.com/game/xbox-one/mxgp-2019", "publisher": "Milestone S.r.l", "release_date": "Aug 27 2019", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 70, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/aa6383d7c40f3c9af87f629892560770-98.jpg", "descriptions": "The official MXGP videogame is back and, for the very first time, you will be able to live the experience of the current MXGP World Championship. 2019 season's official riders, bikes and teams of MXGP and MX2 are ready to challenge you in all the 19 official events all over the world. As inThe official MXGP videogame is back and, for the very first time, you will be able to live the experience of the current MXGP World Championship. 2019 season's official riders, bikes and teams of MXGP and MX2 are ready to challenge you in all the 19 official events all over the world. As in real life, experience different weather conditions while playing. After all, after the rain, there is always the sun! Become the main actor of gameplay and shape your own best gaming experience thanks to brand-new game modes ever seen in the whole MXGP series!… Expand"}, {"name": "Snooker 19", "details_link": "https://www.metacritic.com/game/xbox-one/snooker-19", "publisher": "Ripstone", "release_date": "Apr 17 2019", "developers": ["Lab42"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Billiards"], "meta_score": 70, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/696528314675cf6ec5e4a32a6f511fe0-98.jpg", "descriptions": "This is the most authentic simulation of the sport ever created, with TV-style presentation and commentary, true-to-life physics and advanced artificial intelligence. Choose from offline and online modes, from quick play online match-making to global online tournaments that link in real-timeThis is the most authentic simulation of the sport ever created, with TV-style presentation and commentary, true-to-life physics and advanced artificial intelligence. Choose from offline and online modes, from quick play online match-making to global online tournaments that link in real-time with the live World Snooker calendar.… Expand"}, {"name": "Rival Megagun", "details_link": "https://www.metacritic.com/game/switch/rival-megagun", "publisher": "Degica", "release_date": "Dec  6 2018", "developers": ["Spacewave Software"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/6b4ee9a9815c0a5302e59287808229ae-98.jpg", "descriptions": "Avoid flurries of bullets as you blast through waves of enemies."}, {"name": "My Hero One's Justice", "details_link": "https://www.metacritic.com/game/switch/my-hero-ones-justice", "publisher": "Bandai Namco Games", "release_date": "Oct 26 2018", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action", "General", "Fighting", "3D"], "meta_score": 70, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/7dcae11a57f042c168a422dc5819e640-98.jpg", "descriptions": "Your fight for Justice starts now.Whether you want to see the destruction of humanity or believe heroes should defend those in need, fight to prove your justice in My Hero One's Justice. The popular weekly Shonen Jump manga series comes to life, as players experience the abilities of fanYour fight for Justice starts now.Whether you want to see the destruction of humanity or believe heroes should defend those in need, fight to prove your justice in My Hero One's Justice. The popular weekly Shonen Jump manga series comes to life, as players experience the abilities of fan favorite characters such as Izuku, Deku, Midoriya, Katsuki Katchan Bakugo, All Might and many more in this arena brawler, where you'll get to choose between hero and villain in your path to justice. Utilize Quirks and call upon your sidekicks to activate powerful attacks where your environments are at your disposal in total field destruction.Features:* Based on the hit weekly Shonen Jump manga series.* Heroes or Villains -- Choose between fan favorite characters like Deku, All Might, Tomura, and many more in your path to justice.* Total destruction -- The environments are at your disposal as players can destroy their surroundings in fierce battles.* Unleash Superpowers -- Utilize each character's quirks to plant explosive attacks.* Gorgeous and faithful Anime-style graphics.… Expand"}, {"name": "Joggernauts", "details_link": "https://www.metacritic.com/game/switch/joggernauts", "publisher": "Space Mace", "release_date": "Oct 11 2018", "developers": ["Space Mace"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/930e720e3d908ff507775429c8ef7d2d-98.jpg", "descriptions": "Jog! Jump! Switch! Coordinate the crazy conga line of alien athletes in this autorunner / puzzle platformer for 1-4 players."}, {"name": "God Wars The Complete Legend", "details_link": "https://www.metacritic.com/game/switch/god-wars-the-complete-legend", "publisher": "NIS America", "release_date": "Sep  4 2018", "developers": ["Kadokawa"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Strategy", "Turn-Based", "Tactics"], "meta_score": 70, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/941a35e201284b64d32cdd42e8693abe-98.jpg", "descriptions": "A long time ago, there was a beautiful land made up of three nations: Fuji, Izumo, and Hyuga. This land was called Mizuho. The people of Mizuho disliked conflict, honored their ancestral spirits, and lived in harmony with nature. However, over time, they began cultivating crops, forging andA long time ago, there was a beautiful land made up of three nations: Fuji, Izumo, and Hyuga. This land was called Mizuho. The people of Mizuho disliked conflict, honored their ancestral spirits, and lived in harmony with nature. However, over time, they began cultivating crops, forging and using metal, fighting wars, destroying nature, and neglecting to honor their ancestral spirits. In the meantime, various locations in Mizuho suffered from natural disasters like flooding, earthquakes, and volcanic eruptions. In order to stop a destructive eruption, the Queen of Mizuho, Tsukuyomi, sacrificed her beloved daughter Sakuya to the mountain, confined her other daughter Kaguya within a bamboo seal in case of future disasters, and then disappeared. 13 years later, Princess Kaguya has grown into a beautiful woman and her childhood friend, Kintaro, saves her during a riot. She rises against her \"fate to be a sacrifice,\" and in order to follow her own path, they both escape from Fuji and journey across Mizuho to discover the truth behind Tsukuyomi's decision.… Expand"}, {"name": "The Mooseman", "details_link": "https://www.metacritic.com/game/switch/the-mooseman", "publisher": "Sometimes You", "release_date": "Jul 18 2018", "developers": ["Vladimir Beletsky"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 70, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/eb961cf00215575d5c0607e0687500b2-98.jpg", "descriptions": "Long-long time ago the world was created out of an egg-shell by a god named Yen. In the murky depths of the endless ocean the Lower World was born. The Middle World was made for the men to dwell, and the Upper World was were the ancient gods would reside. Multitudes of spirits dwell amongLong-long time ago the world was created out of an egg-shell by a god named Yen. In the murky depths of the endless ocean the Lower World was born. The Middle World was made for the men to dwell, and the Upper World was were the ancient gods would reside. Multitudes of spirits dwell among the layers of creation, guarding their secrets in the dark. Embark on a journey through all the worlds of ancient myth, find artefacts of Chud' tribes and solve all the mysteries of finno-ugric tales. You are the Mooseman and you have the ability to see all that is hidden to the mortal eye. You are about to visit three layers of this universe - the first one is the Lower World where the spirits of the dead reside.… Expand"}]