[{"name": "Cult of the Lamb", "details_link": "https://www.metacritic.com/game/playstation-5/cult-of-the-lamb", "publisher": "Devolver Digital", "release_date": "Aug 11 2022", "developers": ["Massive Monster"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 86, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/223bb44722886e091320f651df207ff3-98.jpg", "descriptions": "Start your own cult in a land of false prophets, venturing out into diverse and mysterious regions to build a loyal community of woodland worshippers and spread your Word to become the one true cult. BUILD YOUR FLOCK. Collect and use resources to build new structures, perform dark rituals toStart your own cult in a land of false prophets, venturing out into diverse and mysterious regions to build a loyal community of woodland worshippers and spread your Word to become the one true cult. BUILD YOUR FLOCK. Collect and use resources to build new structures, perform dark rituals to appease the gods, and give sermons to reinforce the faith of your flock. DESTROY THE NON-BELIEVERS. Explore a sprawling, randomly generated world, fight off hordes of enemies and defeat rival cult leaders in order to absorb their power and assert your cult's dominance. SPREAD YOUR WORD. Train your flock and embark on a quest to explore and discover the secrets of five mysterious regions. Cleanse the non-believers, spread enlightenment and perform mystical rituals on the journey to become the mighty lamb god.… Expand"}, {"name": "DmC: Devil May Cry Definitive Edition", "details_link": "https://www.metacritic.com/game/xbox-one/dmc-devil-may-cry-definitive-edition", "publisher": "Capcom", "release_date": "Mar 10 2015", "developers": ["Ninja Theory", "QLOC"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General", "Linear"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/d5a329e6b00de96ef9d9067e1b97b3bd-98.jpg", "descriptions": "The definitive edition of this action game arrives with enhanced 1080p graphics at 60fps, new features and all the original DLC included. Chain together stylish combos with up to 8 unique weapons. Traverse the demonic world of Limbo as you join Dante and Vergil in the legendary rebirth ofThe definitive edition of this action game arrives with enhanced 1080p graphics at 60fps, new features and all the original DLC included. Chain together stylish combos with up to 8 unique weapons. Traverse the demonic world of Limbo as you join Dante and Vergil in the legendary rebirth of the Devil May Cry franchise. … Expand"}, {"name": "Monster Hunter Rise", "details_link": "https://www.metacritic.com/game/pc/monster-hunter-rise", "publisher": "Capcom", "release_date": "Jan 12 2022", "developers": ["Capcom"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/1/7b632998335965e2c43e4fd685bb7143-98.jpg", "descriptions": "Rise to the challenge and join the hunt! In Monster Hunter Rise on PC, the latest installment in the award-winning and top-selling Monster Hunter series, you’ll become a hunter, explore brand new maps and use a variety of weapons to take down fearsome monsters as part of an all-new storyline."}, {"name": "Final Fantasy VII Remake Intergrade", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-vii-remake-intergrade", "publisher": "Square Enix", "release_date": "Dec 16 2021", "developers": ["Square Enix"], "platforms": ["PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/e704bc0b657c5766bb7544fe38e28cd6-98.jpg", "descriptions": "FINAL FANTASY VII REMAKE INTERGRADE takes advantage of the latest generation hardware and includes a wealth of graphical, gameplay and system enhancements for the PS5: \r\r* Immerse yourself in the city of Midgar like never before, with improved textures, lighting, and backgroundFINAL FANTASY VII REMAKE INTERGRADE takes advantage of the latest generation hardware and includes a wealth of graphical, gameplay and system enhancements for the PS5: \r\r* Immerse yourself in the city of Midgar like never before, with improved textures, lighting, and background environments. Players can switch between two game modes:\r* \"Graphics Mode\" prioritizes 4K high-resolution graphics\r* \"Performance Mode\" prioritizes smooth action at 60 frames per second\r* Capture and share your memorable moments from the game with a fully customizable \"Photo Mode\"\r* Enjoy immersive battles by using the DualSense wireless controller, with its haptic feedback integration, and enjoy dynamic bike racing with its adaptive triggers.\r* New difficulty settings for 'Classic Mode' provide new ways to play\r* Jump into the action faster with optimized loading times\r As well as introducing many exciting new enhancements, FINAL FANTASY VII REMAKE INTERGRADE also includes a brand-new episode featuring Yuffie as the main character. In this new adventure, play as ninja Yuffie Kisaragi as she infiltrates the shadowy Shinra Corporation to steal a powerful materia and restore glory to her homeland. Play alongside new characters and enjoy an expanded gameplay experience featuring multiple new combat and gameplay additions, bringing a new perspective to the FINAL FANTASY VII REMAKE story that cannot be missed.… Expand"}, {"name": "Mercenaries", "details_link": "https://www.metacritic.com/game/xbox/mercenaries", "publisher": "LucasArts", "release_date": "Jan 10 2005", "developers": ["Pandemic Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/f31a8665c5c2855c16cc2fcc90dac06b-98.jpg", "descriptions": "Inspired by real-world events, Mercenaries begins the search for the leader of a North Korean military coup who threatens the world with nuclear war. As one of the top operatives for a private mercenaries company, you have been called in to execute the general and his top military andInspired by real-world events, Mercenaries begins the search for the leader of a North Korean military coup who threatens the world with nuclear war. As one of the top operatives for a private mercenaries company, you have been called in to execute the general and his top military and scientific advisors. Hunt down all 52 targets--depicted on a deck of playing cards--with a variety of military weapons and vehicles. Earn cash from different missions to buy better weapons and vehicles, or sell your vehicles and weapons on the black market.… Expand"}, {"name": "Final Fantasy X / X-2 HD Remaster", "details_link": "https://www.metacritic.com/game/playstation-vita/final-fantasy-x-x-2-hd-remaster", "publisher": "Square Enix", "release_date": "Mar 18 2014", "developers": ["Virtuos"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/ab02ef05586e59b7085f20081b118d90-98.jpg", "descriptions": "Can you help save the people of Spira? Join Tidus and Yuna on an adventure to rid the world of Sin and bring about the Calm in one of the most popular FINAL FANTASY stories of all time. FINAL FANTASY X HD Remaster is a remastered edition of the game in HD, so if you’ve been wanting to reliveCan you help save the people of Spira? Join Tidus and Yuna on an adventure to rid the world of Sin and bring about the Calm in one of the most popular FINAL FANTASY stories of all time. FINAL FANTASY X HD Remaster is a remastered edition of the game in HD, so if you’ve been wanting to relive your adventures (or experience the story for the first time) now’s your chance.… Expand"}, {"name": "Guitar Hero: Metallica", "details_link": "https://www.metacritic.com/game/playstation-3/guitar-hero-metallica", "publisher": "Activision", "release_date": "Mar 29 2009", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/85c70a9f1792f1e5f55e3b602a6d8d16-98.jpg", "descriptions": "Guitar Hero: Metallica takes music fans through the band’s fabled library of songs, plus the music and musicians who influence them. When the house lights go down, virtual rock stars across the globe will shred, drum and wail to an explosive set list featuring over 45 tracks from Metallica’sGuitar Hero: Metallica takes music fans through the band’s fabled library of songs, plus the music and musicians who influence them. When the house lights go down, virtual rock stars across the globe will shred, drum and wail to an explosive set list featuring over 45 tracks from Metallica’s illustrious career and a wide variety of other legendary artists personally selected by the band, such as Queen, Foo Fighters, Bob Seger, Lynyrd Skynyrd, Slayer and Judas Priest. Featuring tracks from every Metallica studio album, the complete Guitar Hero Metallica on-disc set list includes their following hits: All Nightmare Long, Battery, Creeping Death, Disposable Heroes, Dyers Eve, Enter Sandman, Fade To Black, Fight Fire With Fire, For Whom The Bell Tolls, Frantic, Fuel, Hit The Lights, King Nothing, Master of Puppets, Mercyful Fate, No Leaf Clover, Nothing Else Matters, One, Orion, Sad But True, Seek And Destroy, The Memory Remains, The Shortest Straw, The Thing That Should Not Be, The Unforgiven, Welcome Home (Sanitarium), Wherever I May Roam, and Whiplash. Complementing Metallica’s intensity are 21 rockin’ tracks personally chosen by the band, including \"War Ensemble\" by Slayer. [Activision]… Expand"}, {"name": "EverQuest: Omens of War", "details_link": "https://www.metacritic.com/game/pc/everquest-omens-of-war", "publisher": "Sony Online Entertainment", "release_date": "Sep 13 2004", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/5ef8af5ecfdd7f9bb86081ccf2bc61e0-98.jpg", "descriptions": "Follow the Wayfarers Brotherhood to the war-ravaged Realm of Discord to help end the tyrannical ways of the Muramites once and for all.  Mata Muram, the leader of the Muramites, is rumored to be building the ultimate invading army. It's up to you to thwart his plans. Experience EverQuest:Follow the Wayfarers Brotherhood to the war-ravaged Realm of Discord to help end the tyrannical ways of the Muramites once and for all.  Mata Muram, the leader of the Muramites, is rumored to be building the ultimate invading army. It's up to you to thwart his plans. Experience EverQuest: Omens of War and the twisted lands of a realm where war is persistent and death is constant.  Face the fear of the Battlegrounds of Discord. Explore the shattered landscapes of the Discordant Plateau. Then take your fury to a landscape that teems with Muramites preparing to invade not just Norrath, but countless innocent worlds.  Adventure solo, or in groups and raids to complete \"epic quests\" and earn prestigious weapons. [Sony Online Entertainment]… Expand"}, {"name": "Golden Sun: The Lost Age", "details_link": "https://www.metacritic.com/game/game-boy-advance/golden-sun-the-lost-age", "publisher": "Nintendo", "release_date": "Apr 14 2003", "developers": ["Camelot Software Planning"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 86, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/4/6807b8c1449ef5e455c41a03948a8e2a-98.jpg", "descriptions": "It is the dawn of a new age...And the heroes of Golden Sun have been abandoned. Now, the world is falling into darkness. A new band of adventurers is the world's final hope...but they may also be its doom. Pursued by the heroes of the original Golden Sun, they must race to complete theirIt is the dawn of a new age...And the heroes of Golden Sun have been abandoned. Now, the world is falling into darkness. A new band of adventurers is the world's final hope...but they may also be its doom. Pursued by the heroes of the original Golden Sun, they must race to complete their quest before the world becomes lost to the ages.… Expand"}, {"name": "Steel Beasts", "details_link": "https://www.metacritic.com/game/pc/steel-beasts", "publisher": "Shrapnel Games", "release_date": "Sep 24 2000", "developers": ["eSim Games"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Simulation", "Tank", "Tank", "Vehicle", "Combat"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/1104501af936e0a3370350188fb9dcdd-98.jpg", "descriptions": "More than just another modern tank simulation. This design effort goes further than any before it to accurately model real-world conditions and tactics -- but in a way as to not overwhelm the novice, would-be tanker with a zillion key combinations and an overwhelming interface.  [Shrapnel Games]"}, {"name": "Test Drive V-Rally", "details_link": "https://www.metacritic.com/game/dreamcast/test-drive-v-rally", "publisher": "Infogrames", "release_date": "Jul  2 2000", "developers": ["Eden Studios"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 86, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/0/832e73634cb2fc843117815591df7779-98.jpg", "descriptions": "The Ultimate Open Road Racing Championship. 16 officially licensed rally cars with 10 bonus cars. Over 80 new tracks in over 12 different countries exclusively for the Sega Dreamcast. Powerful track editor and generator - create, save and exchange saved tracks you create! Real-Time DamageThe Ultimate Open Road Racing Championship. 16 officially licensed rally cars with 10 bonus cars. Over 80 new tracks in over 12 different countries exclusively for the Sega Dreamcast. Powerful track editor and generator - create, save and exchange saved tracks you create! Real-Time Damage feature shows visible damage during game play.… Expand"}, {"name": "Total Annihilation", "details_link": "https://www.metacritic.com/game/pc/total-annihilation", "publisher": "Humongous Entertainment", "release_date": "Sep 27 1997", "developers": ["Cavedog Entertainment"], "platforms": "PC", "num_players": "Up to 10 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Command"], "meta_score": 86, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/d28e53b6a7c5d926f8c0f5f533cff261-98.jpg", "descriptions": "Long ago, the galaxy had known peace. Paradise was ruled with the hand of science, and the hand was that of the galactic governing body known as the Core. Ironically, it was the Core's ultimate victory, the victory over death itself, that brought about the downfall of its paradise andLong ago, the galaxy had known peace. Paradise was ruled with the hand of science, and the hand was that of the galactic governing body known as the Core. Ironically, it was the Core's ultimate victory, the victory over death itself, that brought about the downfall of its paradise and started the war that would decimate a million worlds. The immortality process, known as \"patterning,\" involved the electronic duplication of brain matrices, allowing the transfer of consciousness into durable machines. Effectively it meant immortality, and the Core decreed the process mandatory for all citizens in order to ensure their safety. However, there were many citizens unwilling to toss aside their bodies so casually, many indeed who regarded patterning as an atrocity. They fled to the outer edges of the galaxy, forming a resistance movement that became known as the Arm. War began, though it was never officially declared by either side. The Arm developed high-powered combat suits for its armies, while the Core transferred the minds of its soldiers directly into similarly deadly machines. The Core duplicated its finest warriors thousands of times over. The Arm countered with a massive cloning program. The war raged on for more than 4,000 years, consuming the resources of an entire galaxy and leaving it a scorched wasteland. [Cavedog Entertainment]… Expand"}, {"name": "Monster Hunter 4 Ultimate", "details_link": "https://www.metacritic.com/game/3ds/monster-hunter-4-ultimate", "publisher": "Capcom", "release_date": "Feb 13 2015", "developers": ["Capcom"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/085b675737504a7d44233a814c3e4838-98.jpg", "descriptions": "Take off on an epic journey, traversing a vast world hunting larger than life beasts as you look for the source of a mysterious virus. Travel with a caravan of fellow hunters and merchants as you make your way across multiple locations, each with its own unique look and feel."}, {"name": "Need for Speed: Hot Pursuit", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-hot-pursuit", "publisher": "Electronic Arts", "release_date": "Nov 16 2010", "developers": ["Criterion Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 86, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/fd713e9efd0de00f84c66df824f24461-98.jpg", "descriptions": "Need for Speed Hot Pursuit players will experience the thrill of the chase and the rush of the escape as they play through full careers as both a cop and a racer – solo or connected. The blistering speeds, brutal busts and heart-stopping getaways are all connected via Need for Speed Autolog.Need for Speed Hot Pursuit players will experience the thrill of the chase and the rush of the escape as they play through full careers as both a cop and a racer – solo or connected. The blistering speeds, brutal busts and heart-stopping getaways are all connected via Need for Speed Autolog. This network not only connects friends for epic head-to head pursuits and races, but also enables players to compare performances and stats, thereby setting the stage for the ultimate in friendly competition.… Expand"}, {"name": "Tactics Ogre: Reborn", "details_link": "https://www.metacritic.com/game/playstation-5/tactics-ogre-reborn", "publisher": "Square Enix", "release_date": "Nov 11 2022", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 86, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/3b61758428e3a8d7b29757beaecb27f8-98.jpg", "descriptions": "Based on the 2010 release, the game features improved graphics and sound, as well as updated game design, bringing to life a new Tactics Ogre that remains true to its roots. Tactics Ogre veterans will experience a game that surpasses their fondest memories, while players new to Tactics OgreBased on the 2010 release, the game features improved graphics and sound, as well as updated game design, bringing to life a new Tactics Ogre that remains true to its roots. Tactics Ogre veterans will experience a game that surpasses their fondest memories, while players new to Tactics Ogre will discover a game unlike any they've ever played. Reborn and deeper than ever, the game enables players to immerse themselves in the world and intrigue of Tactics Ogre like never before. The Valerian Isles, jewels of the Obero Sea. Long a center of naval commerce, the people of the isles struggled throughout history for dominion over her shores. Finally there rose a man to put an end to this conflict: Dorgalua Oberyth. But history would know him as the \"Dynast-King.\" King Dorgalua strove to stamp out the hatred among the people of the isles, and for fully half a century, Valeria knew prosperity. Yet upon the king's death, civil war erupted anew as three factions vied for control: the Bakram, who comprised much of Valeria's nobility; the Galgastani, whose people made up the majority of the isles' population; and the Walister, who numbered but few. The isles were soon divided between the Bakram and Galgastani, and an uneasy peace settled across the land. Yet none believed the calm would last...… Expand"}, {"name": "Cuphead in the Delicious Last Course", "details_link": "https://www.metacritic.com/game/playstation-4/cuphead-in-the-delicious-last-course", "publisher": "Studio MDHR", "release_date": "Jun 30 2022", "developers": ["Studio MDHR"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/5f8f67ce9c9ddfb11ad365809b526957-98.jpg", "descriptions": "Another helping of classic Cuphead action awaits you in Cuphead - The Delicious Last Course! Brothers Cuphead and Mugman are joined by the clever, adventurous Ms. Chalice for a rollicking adventure on a previously undiscovered Inkwell Isle! With the aid of new weapons, magical charms, andAnother helping of classic Cuphead action awaits you in Cuphead - The Delicious Last Course! Brothers Cuphead and Mugman are joined by the clever, adventurous Ms. Chalice for a rollicking adventure on a previously undiscovered Inkwell Isle! With the aid of new weapons, magical charms, and Ms. Chalice’s unique abilities, players will take on a new cast of fearsome, larger than life bosses to assist the jolly Chef Saltbaker in Cuphead’s final challenging quest! … Expand"}, {"name": "Transistor", "details_link": "https://www.metacritic.com/game/switch/transistor", "publisher": "Supergiant Games", "release_date": "Nov  1 2018", "developers": ["Supergiant Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/3d21781525254f5e95cf6cc7c5af58b6-98.jpg", "descriptions": "Wield an extraordinary weapon of unknown origin in this sci-fi themed action role-playing game from the creators of Bastion.\r Fight through a stunning futuristic city\r\n\r\nThe game seamlessly integrates thoughtful strategic planning into a fast-paced action experience, combining responsiveWield an extraordinary weapon of unknown origin in this sci-fi themed action role-playing game from the creators of Bastion.\r Fight through a stunning futuristic city\r The game seamlessly integrates thoughtful strategic planning into a fast-paced action experience, combining responsive gameplay and rich atmospheric storytelling.\r During the course of the adventure, you will piece together the Transistor's mysteries as you pursue its former owners.… Expand"}, {"name": "FIFA Soccer 13", "details_link": "https://www.metacritic.com/game/pc/fifa-soccer-13", "publisher": "EA Sports", "release_date": "Sep 25 2012", "developers": ["Electronic Arts"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 2", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 86, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/7629603da52931f9f374d5293387b90b-98.jpg", "descriptions": "Artificial intelligence infuses players with the ability to analyse space, work harder and smarter to break down the defence, and think two plays ahead. Players make runs that pull defenders out of position and open up passing channels for temmates, and curve, or alter runs to capitalize onArtificial intelligence infuses players with the ability to analyse space, work harder and smarter to break down the defence, and think two plays ahead. Players make runs that pull defenders out of position and open up passing channels for temmates, and curve, or alter runs to capitalize on openings as they occur.… Expand"}, {"name": "Patapon", "details_link": "https://www.metacritic.com/game/psp/patapon", "publisher": "SCEA", "release_date": "Feb 26 2008", "developers": ["SCE Japan Studio"], "platforms": ["PlayStation 4", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Rhythm", "General", "Platformer", "2D", "2D", "Music"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/f79787d5062bb4f12fb44c0903febc0e-98.jpg", "descriptions": "For years the Patapon tribe has lived in the desolate frontier, driven from their home by the evil Zigoton army. Behind the Patapons' cute exterior, lies a fierce warrior spirit that can only be commanded by the beat of their God’s war drum. They wait for the day that the \"Almighty\" willFor years the Patapon tribe has lived in the desolate frontier, driven from their home by the evil Zigoton army. Behind the Patapons' cute exterior, lies a fierce warrior spirit that can only be commanded by the beat of their God’s war drum. They wait for the day that the \"Almighty\" will return, to lead them against their enemies and bring them back to their homeland. Finally, their wait has come to an end as the drums of war are heard once again. Rhythm and Action Collide – Master up to six different drumbeats to command the Patapon troops to march, attack, defend, power up, retreat, and use magic. Combine the various chains of drumbeats to address each unique level, leading the Patapons to victory over the Zigoton enemy forces. Strategic Gaming – Patapon delivers a strong element of strategy by requiring players to properly customize and build up the Patapon army, arm each soldier with particular weapons and armor, and position them correctly for battle. Mission Variety – Take part in more than 30 specific missions including hunting, escort, and boss battles, and explore numerous vivid environments along the way. Players will discover and access more than 100 items and weapons throughout the adventure. Unique Art Style – French graphic artist Rolito, noted for his abstract art style seen in collectible toys, animation, and websites, lends his skills to create a variety of unique characters and environments, bringing the Patapon world to life. Mini-Games – Five music-based mini-games allow players to earn bonuses and upgrades to further customize the Patapon warriors. Music – Captivating and dramatic original music builds dynamically as players march and encounter enemy battles throughout each level. [SCEA]… Expand"}, {"name": "Sid Meier's Civilization IV: Beyond the Sword", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-iv-beyond-the-sword", "publisher": "2K Games", "release_date": "Jul 23 2007", "developers": ["Firaxis Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Historic", "Historic", "4X"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/3404148bd0178e54fd77a7dc918ae084-98.jpg", "descriptions": "Sid Meier's Civilization IV: Beyond the Sword is the second expansion pack for Civilization IV and focuses on the late-game time periods after the invention of gunpowder and delivers 12 challenging and decidedly different scenarios created by the development team at Firaxis Games, as well asSid Meier's Civilization IV: Beyond the Sword is the second expansion pack for Civilization IV and focuses on the late-game time periods after the invention of gunpowder and delivers 12 challenging and decidedly different scenarios created by the development team at Firaxis Games, as well as members of the Civilization Fan Community. Firaxis Games delivers a massive increase in new units, buildings, and technologies to the epic game with additional focus on the late-game time periods. The expansion pack includes ten new civilizations, such as Portugal, Babylon and Netherlands and their associated unique units and buildings. Sixteen new civilization leaders including leaders for the ten new civilizations, as well as additional leaders for existing civilizations. A new gameplay feature allows players to create corporations and spread them throughout the world. Each corporation provides benefits in exchange for certain resources. Now available much earlier in the game, an espionage feature offers players many new ways to spy on opponents, stir citizen unrest and defend their government's secrets. New random events such as natural disasters, pleas for help, or demands from their citizens will challenge players to overcome obstacles in order for their civilizations to prosper. Five new wonders await discovery including the Statue of Zeus, Cristo Redentor, Shwedagon Paya, the Mausoleum of Maussollos, and the Moai Statues. Winning the race to Alpha Centauri now requires more strategic planning and tactical decision making. Apostolic Palace: The United Nations becomes available earlier in the game, providing a way for players to win a diplomatic victory earlier. New resolutions will also be added which will expand the available diplomatic options. Advanced Starts: A major fan request, this new feature enables players to \"buy\" components of a custom-tailored empire and begin play in the later part of the game, allowing them to experience many of the new features of the expansion pack in a shorter amount of time. Enhanced AI: The AI has received many enhancements, making it tougher to beat on the higher difficulty levels. [2K Games]… Expand"}, {"name": "Dragon Quest Builders 2", "details_link": "https://www.metacritic.com/game/playstation-4/dragon-quest-builders-2", "publisher": "Square Enix", "release_date": "Jul 12 2019", "developers": ["Omega Force", "Square Enix"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "General", "Action Adventure", "Sandbox"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/453d0eeed0b1e5b48405123990220886-98.jpg", "descriptions": "DRAGON QUEST BUILDERS 2 is a block-building role-playing game with a charming single player campaign and a robust multiplayer building mode that supports up to four players online. Create your customized character, team-up with your fearless friend Malroth, gather the skills required toDRAGON QUEST BUILDERS 2 is a block-building role-playing game with a charming single player campaign and a robust multiplayer building mode that supports up to four players online. Create your customized character, team-up with your fearless friend Malroth, gather the skills required to become a full-fledged builder, and combat the Children of Hargon, a vile cult that worships destruction. Then, take your builder online and join your friends to collaborate and create something truly magnificent. Don’t let the name fool you, despite the 2, this is a completely standalone experience featuring new characters, an expansive world, unlimited building combinations, and a storyline that promises to satisfy longtime fans and newcomers alike. [Square Enix]… Expand"}, {"name": "Sky Force Reloaded", "details_link": "https://www.metacritic.com/game/xbox-one/sky-force-reloaded", "publisher": "Infinite Dreams", "release_date": "Dec  1 2017", "developers": ["Infinite Dreams", "Infinite Dreams Inc."], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 86, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/d0475ea6a1f42b4982d6f97e1757d13f-98.jpg", "descriptions": "The best mobile shooter is now ready to rock your iPhone!Sky Force Reloaded is an award winning and highly acclaimed vertical shooter. It features 3d interactive objects, outstanding graphics, special effects, high quality soundtrack and 100% of pure gameplay.Ever wanted to play a goodThe best mobile shooter is now ready to rock your iPhone!Sky Force Reloaded is an award winning and highly acclaimed vertical shooter. It features 3d interactive objects, outstanding graphics, special effects, high quality soundtrack and 100% of pure gameplay.Ever wanted to play a good arcade vertical shooter? This one is for you!----------------------------------------------PRESS:IGN Review:9.5/10 - Force your friend to buy this one.AppSmile.com5/5 - With its recent introduction into the App Store, Sky Force Reloaded (or perhaps re-Reloaded) is a title no arcade junkie should miss.PocketGamer:10/10 - Graphically, Sky Force: Reloaded is stunning. The whole game screams quality.PocketPlayers.deOne of the best, if not THE best shooters!----------------------------------------------FEATURES:- 8 large levels- plenty of enemies,- interactive environment elements*- upgradable weapons- dynamic weather (rain, clouds, wind)- highscoresRecommended for fans of Raiden, 1942, 1945, iFighter, Siberian Strike… Expand"}, {"name": "Dragon Age: Origins", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-age-origins", "publisher": "Electronic Arts", "release_date": "Nov  3 2009", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/40c481598a8621b2ee4ca23472ff1cf4-98.jpg", "descriptions": "As the spiritual successor to BioWare's \"Baldur's Gate\", one of the most successful role-playing games in the industry, Dragon Age: Origins represents BioWare's return to its roots, delivering a fusion of the best elements of existing fantasy works with stunning visuals, emotionally-drivenAs the spiritual successor to BioWare's \"Baldur's Gate\", one of the most successful role-playing games in the industry, Dragon Age: Origins represents BioWare's return to its roots, delivering a fusion of the best elements of existing fantasy works with stunning visuals, emotionally-driven narrative, heart-pounding combat, powerful magic abilities and credible digital actors. The spirit of classic RPGs comes of age, as Dragon Age: Origins features a dark and mature story and gameplay. Epic Party-Based Combat – Dragon Age: Origins introduces an innovative, scalable combat system, as players face large-scale battles and use their party’s special abilities to destroy hoardes of enemies and massive creatures. Powerful Magic – Raining down awesome destruction on enemies is even more compelling as players apply \"spell combos,\" a way of combining together different spells to create emergent unique effects. Players develop their characters and gain powerful special abilities (spells, talents and skills) and discover ever-increasing weapons of destruction. With its emotionally compelling story, players choose with whom they wish to forge alliances or crush under their mighty fist, redefining the world with the choices they make and how they wield their power. Players select and play a unique prelude that provides the lens through which the player sees the world and how the world sees the player. The player's choice of Origin determines who they are and where they begin the adventure, as they play through a customized story opening that profoundly impacts the course of every adventure. [BioWare]… Expand"}, {"name": "Steins;Gate Elite", "details_link": "https://www.metacritic.com/game/playstation-4/steinsgate-elite", "publisher": "Spike Chunsoft", "release_date": "Feb 19 2019", "developers": ["5pb", "Mages."], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Visual Novel"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/9042d277fa7c03dab0affc36b9bd4afb-98.jpg", "descriptions": "STEINS;GATE ELITE is a remastered title with animated scenes from the anime, creating a brand-new, immersive experience. Follow a group of young, tech-savvy Lab Members who discover the means of changing the past by using e-mail and a modified microwave. Their experiment to push theSTEINS;GATE ELITE is a remastered title with animated scenes from the anime, creating a brand-new, immersive experience. Follow a group of young, tech-savvy Lab Members who discover the means of changing the past by using e-mail and a modified microwave. Their experiment to push the boundaries of time spirals out of control as they become entangled in a conspiracy surrounding SERN, the organization behind the Large Hadron Collider, and John Titor, who claims to be from a dystopian future. … Expand"}, {"name": "The Sims 3", "details_link": "https://www.metacritic.com/game/pc/the-sims-3", "publisher": "Electronic Arts", "release_date": "Jun  2 2009", "developers": ["The Sims Studio"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/1569359c271f409a7c4b3f096d7f2f9f-98.jpg", "descriptions": "Create lifelike Sims with a unique personality and take them anywhere in the neighborhood. The powerful Create-a-Sim tool allows you to create Sims that are more realistic than ever. Select from dozens of personality traits such as brave, artistic, kleptomaniac, clumsy, paranoid andCreate lifelike Sims with a unique personality and take them anywhere in the neighborhood. The powerful Create-a-Sim tool allows you to create Sims that are more realistic than ever. Select from dozens of personality traits such as brave, artistic, kleptomaniac, clumsy, paranoid and romantic. With Create-a-Sim, you can create a limitless number of truly unique Sims. The Sims 3 allows for infinite possibilities to design the interior and exterior of your Sims’ surroundings using the Create-a-style feature. Enjoy the challenge of short and long-term goals and then reap the rewards! Based on personality traits, skills and career choices, your Sims have Wishes that provide constant fun challenges and so many things to do and achieve. You have the ultimate freedom to choose whether to fulfill their destiny, giving them lifetime happiness and rewards or not! Register your copy of The Sims 3 for PC and Mac at www.TheSims3.com to enjoy the robust online and community features unique to your game including an all-new town called Riverview that you can download for no additional charge once you register. You will also gain access to 1,000 SimPoints to purchase items from The Sims 3 Store including exclusive outfits, hairstyles, furniture, home décor, and architectural items to customize your Sims appearance and houses in all-new ways. Visit The Store each month for new, never-seen-before themed items. Additionally, be the director of your Sims’ movies by capturing clips during your gameplay, visiting the official site, and editing the soundtrack, story, and transitions, then share it with the world! These easily accessible tools inspire creativity and allow you to share your masterpieces with your friends and other players on The Sims 3 official website, personal blogs, or any social media network. See what you can create with The Sims 3. [Electronic Arts]… Expand"}, {"name": "NBA 2K16", "details_link": "https://www.metacritic.com/game/xbox-one/nba-2k16", "publisher": "Take-Two Interactive", "release_date": "Sep 25 2015", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Action", "General", "Sports", "Team", "Basketball", "Sim"], "meta_score": 86, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/0d15f4b13faee5909f8450adace2e2e6-98.jpg", "descriptions": "Be the Story. The NBA 2K franchise is back with a true-to-life NBA experience in NBA 2K16. Guide your MyPLAYER through the complete NBA journey, take control of an entire NBA franchise, or refine your skills online competing against gamers from around the globe. With animations that provideBe the Story. The NBA 2K franchise is back with a true-to-life NBA experience in NBA 2K16. Guide your MyPLAYER through the complete NBA journey, take control of an entire NBA franchise, or refine your skills online competing against gamers from around the globe. With animations that provide smoother movement and more realistic articulation, it promises to be the most authentic NBA gaming experience yet. [2K]\r … Expand"}, {"name": "Freedom Force vs The 3rd Reich", "details_link": "https://www.metacritic.com/game/pc/freedom-force-vs-the-3rd-reich", "publisher": "Sierra Entertainment", "release_date": "Mar  8 2005", "developers": ["Irrational Games"], "platforms": "PC", "num_players": "4  Online", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/8676c432db8034dd2bb12eaafc8887d6-98.jpg", "descriptions": "Freedom is threatened yet again and only Minute Man and his heroic Freedom Force can save the day in the follow up to one of the most critically acclaimed games of 2002. Freedom Force vs. the Third Reich brings dynamic storytelling, fast-paced tactical role-play, and larger-than-lifeFreedom is threatened yet again and only Minute Man and his heroic Freedom Force can save the day in the follow up to one of the most critically acclaimed games of 2002. Freedom Force vs. the Third Reich brings dynamic storytelling, fast-paced tactical role-play, and larger-than-life characters from the comic book pages to the computer screen. In this title, the league of heroes must travel back in time to defeat Blitzkrieg, defender of the Reich and his homicidal henchmen. With action spanning from the blasted battlefields of World War II to the dazzling depths of distant dimensions, Freedom Force vs. the Third Reich will give Freedom Fans more than they can handle. [Digital Jesters]… Expand"}, {"name": "Fluidity", "details_link": "https://www.metacritic.com/game/wii/fluidity", "publisher": "Nintendo", "release_date": "Dec  6 2010", "developers": ["Curve Studios"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "3D", "2D"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/53dd10153cf94644509c5891aa81cdea-98.jpg", "descriptions": "(Also known as \"Hydroventure\") Players must navigate their way across multiple chapters to rid Aquaticus of a corruptive goop called the \"Influence\", solving puzzles along the way in order to find Rainbow Drops scattered around the world. Using the three forms of water - liquid,(Also known as \"Hydroventure\") Players must navigate their way across multiple chapters to rid Aquaticus of a corruptive goop called the \"Influence\", solving puzzles along the way in order to find Rainbow Drops scattered around the world. Using the three forms of water - liquid, ice and cloud - players can transform to continue on their adventure, for instance become a cloud to float to hard to reach areas, then make the cloud rain to return to a liquid state, or turn into ice and stick to surfaces..… Expand"}, {"name": "Death Stranding", "details_link": "https://www.metacritic.com/game/pc/death-stranding", "publisher": "505 Games", "release_date": "Jul 14 2020", "developers": ["Kojima Productions"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/8e0c93d2c7cd3d1d589c0f8ba8635fd1-98.jpg", "descriptions": "Besieged by death's tide at every turn. Sam Bridges must brave a world utterly transformed by the Death Stranding. Carrying the stranded remnants of the future in his hands, Sam embarks on a journey to reunite the shattered world one step at a time. What is the mystery of the DeathBesieged by death's tide at every turn. Sam Bridges must brave a world utterly transformed by the Death Stranding. Carrying the stranded remnants of the future in his hands, Sam embarks on a journey to reunite the shattered world one step at a time. What is the mystery of the Death Stranding? What will Sam discover on the road ahead? A genre defining gameplay experience holds these answers and more.… Expand"}, {"name": "Thimbleweed Park", "details_link": "https://www.metacritic.com/game/playstation-4/thimbleweed-park", "publisher": "Terrible Toybox", "release_date": "Aug 22 2017", "developers": ["Ron Gilbert and Gary Winnick"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/ad23159de873b21144a2be11f50fa5d2-98.jpg", "descriptions": "Thimbleweed Park is the curious story of two washed up federal agents called in to investigate a dead body found in the river just outside of town, bloated and pixelated from a death some too soon."}, {"name": "Titanfall", "details_link": "https://www.metacritic.com/game/xbox-one/titanfall", "publisher": "Electronic Arts", "release_date": "Mar 11 2014", "developers": ["Respawn Entertainment"], "platforms": ["PC", "Xbox 360", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Shooter", "Sci-Fi", "Miscellaneous", "General", "Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/7207cad078308daa5f1f2bf9d669a812-98.jpg", "descriptions": "Crafted by one of the co-creators of Call of Duty and other key developers behind the Call of Duty franchise, Titanfall, with its advanced combat techniques, gives you the freedom to fight your way as both elite assault Pilot and fast, heavily armored Titan. The experience combinesCrafted by one of the co-creators of Call of Duty and other key developers behind the Call of Duty franchise, Titanfall, with its advanced combat techniques, gives you the freedom to fight your way as both elite assault Pilot and fast, heavily armored Titan. The experience combines fast-paced multiplayer action with the dramatically charged moments of a cinematic universe.… Expand"}, {"name": "Yakuza 0", "details_link": "https://www.metacritic.com/game/pc/yakuza-0", "publisher": "Sega", "release_date": "Aug  1 2018", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/d7c7fa3ad8b20957c92351ac67feadac-98.jpg", "descriptions": "Tokyo 1988. Getting rich is easy, the women are beautiful, and everyone wants in on the action. It's time to become Yakuza.\r The glitz, glamour, and unbridled decadence of the 80s are back in Yakuza 0!\r\n \rFight like hell through Tokyo and Osaka with protagonist Kazuma Kiryu and seriesTokyo 1988. Getting rich is easy, the women are beautiful, and everyone wants in on the action. It's time to become Yakuza.\r The glitz, glamour, and unbridled decadence of the 80s are back in Yakuza 0!\r \rFight like hell through Tokyo and Osaka with protagonist Kazuma Kiryu and series regular Goro Majima. Play as Kazuma Kiryu and discover how he finds himself in a world of trouble when a simple debt collection goes wrong and his mark winds up murdered. Then, step into the silver-toed shoes of Goro Majima and explore his \"normal\" life as the proprietor of a cabaret club.\r Switch between three different fighting styles instantaneously and beat up all manner of goons, thugs, hoodlums, and lowlifes. Take combat up a notch by using environmental objects such as bicycles, sign posts, and car doors for bone-crunching combos and savage take-downs.\r Fighting is not the only way to kill time in 1988's Japan: from discos and hostess clubs to classic SEGA arcades, there are tons of distractions to pursue in the richly detailed, neon-lit world.… Expand"}, {"name": "Bayonetta 3", "details_link": "https://www.metacritic.com/game/switch/bayonetta-3", "publisher": "Nintendo", "release_date": "Oct 28 2022", "developers": ["PlatinumGames"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 86, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/fec2c004375a821496c593bb9f7165fc-98.jpg", "descriptions": "Bayonetta returns in an all-new, over-the-top climax action game. Sporting a wicked new ensemble and somehow familiar pigtails, the titular Umbra Witch must face a mysterious evil using her signature guns and time-slowing Witch Time ability. Is her foe angel, demon, or something elseBayonetta returns in an all-new, over-the-top climax action game. Sporting a wicked new ensemble and somehow familiar pigtails, the titular Umbra Witch must face a mysterious evil using her signature guns and time-slowing Witch Time ability. Is her foe angel, demon, or something else entirely?Tap into Bayonetta's naughtier side with Demon Masquerade, a new ability that channels the demon linked to her weapon allowing for some exciting action options, not to mention some hair-raising combos. She can also summon her demonic darlings like Gomorrah, Malphas, and Phantasmaraneae during battle, unleashing their demonic powers in the heat of combat and in new, larger-than life battles where you directly control the action.Bayonetta fights bravely in the streets of Tokyo against a mysterious enemy bent on plunging humanity into the depths of chaos.Why is she there? And has the enemy already extended their grasp to other worlds?… Expand"}, {"name": "Picross 3D: Round 2", "details_link": "https://www.metacritic.com/game/3ds/picross-3d-round-2", "publisher": "Nintendo", "release_date": "Sep  1 2016", "developers": ["HAL Labs"], "platforms": "3DS", "genres": ["Puzzle", "Logic"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/da63ac6a550c9f6839215002a018a6f9-98.jpg", "descriptions": "A fresh new layer of paintand strategy!\r Chip away at a three-dimensional block puzzle to reveal the object hidden within. Only this time, blocks can be painted with two colors of paint to mold detailed shapes. Enjoy more than 300 puzzles at the Cafe or even tap compatible amiibo figuresA fresh new layer of paintand strategy!\r Chip away at a three-dimensional block puzzle to reveal the object hidden within. Only this time, blocks can be painted with two colors of paint to mold detailed shapes. Enjoy more than 300 puzzles at the Cafe or even tap compatible amiibo figures (sold separately) to solve 10 more puzzles hiding secret Nintendo characters!\r In the Cafe, the more puzzles you complete, the more that open up to play. Accomplish certain objectives, like getting a high ranking on 30 puzzles, and youll earn even more. You can choose between easy, medium, and hard difficulty levels for each one, but no matter the complexity, youll always be rewarded with the hidden object. Some sets of puzzles offer additional tasks, from Timed Challenges to One-Chance Challenges. With this many brainteasing activities, there are always new risks to take and hidden objects to find!\r -Solve over 300 3D Picross puzzles using two colors of paint\r-Complete a variety of objectives to unlock even more puzzles\r-Scan compatible amiibo figures to unlock additional Nintendo character puzzles\r-Every puzzle can be completed in three difficulty levels: easy, medium, and hard\r-Additional challenges include timed puzzles and one-chance puzzles… Expand"}, {"name": "Tomb Raider", "details_link": "https://www.metacritic.com/game/xbox-360/tomb-raider", "publisher": "Square Enix", "release_date": "Mar  5 2013", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Modern", "General", "Modern", "Linear"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/8ed31cea017b6ef379807c3d002cbfc5-98.jpg", "descriptions": "Tomb Raider is a re-imagining of the infamous action-adventure franchise and explores the visceral origin story of this character. In the game, Lara Croft ascends from a frightened young lady on her first adventure and emerges as a hardened survivor. With only her sharp instincts and herTomb Raider is a re-imagining of the infamous action-adventure franchise and explores the visceral origin story of this character. In the game, Lara Croft ascends from a frightened young lady on her first adventure and emerges as a hardened survivor. With only her sharp instincts and her innate ability to push the limits of human endurance, Lara must fight, explore, and use her intelligence to unravel the dark history of a forgotten island and escape its tight grip.… Expand"}, {"name": "A Space For The Unbound", "details_link": "https://www.metacritic.com/game/pc/a-space-for-the-unbound", "publisher": "PQube", "release_date": "Jan 19 2023", "developers": ["Mojiken Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/91d72080fa84dcbf7841a1a323773453-98.jpg", "descriptions": "A Space For The Unbound is a slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\r Follow two high school sweethearts, AtmaA Space For The Unbound is a slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\r Follow two high school sweethearts, Atma and Raya, on a journey of self-discovery at the end of their high school years. When a mysteriously supernatural power is suddenly unleashed threatening their existence, they must explore and investigate their town to uncover hidden secrets, face the end of the world, and perhaps learn more about each other.… Expand"}, {"name": "The Binding of Isaac: Rebirth", "details_link": "https://www.metacritic.com/game/pc/the-binding-of-isaac-rebirth", "publisher": "Nicalis", "release_date": "Nov  4 2014", "developers": ["Nicalis"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Horror", "Action", "Action Adventure", "Shooter", "Survival", "Shoot-'Em-Up", "Top-Down"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/2e5f1d2b5137a8d1bed9ab6e157a4257-98.jpg", "descriptions": "Rebirth is a randomly generated action RPG shooter with emphatic Roguelike elements. Following Isaac on his journey gamers discover bizarre treasures that change Isaac’s form giving him extra-human abilities and enabling him to fend off droves of mysterious creatures, learn secrets and scrapRebirth is a randomly generated action RPG shooter with emphatic Roguelike elements. Following Isaac on his journey gamers discover bizarre treasures that change Isaac’s form giving him extra-human abilities and enabling him to fend off droves of mysterious creatures, learn secrets and scrap his way to safety. … Expand"}, {"name": "Tribes: Ascend", "details_link": "https://www.metacritic.com/game/pc/tribes-ascend", "publisher": "Hi-Rez Studios", "release_date": "Apr 12 2012", "developers": ["Hi-Rez Studios"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/63f1ff9af3b2602d3d053faf49c5bbf8-98.jpg", "descriptions": "Tribes: Ascend is a new generation of the online multiplayer shooter, incorporating classic Tribes elements such as fast-paced jetpack enabled combat, skiing, and vehicles, combined with teamwork and strategy."}, {"name": "Titanfall", "details_link": "https://www.metacritic.com/game/pc/titanfall", "publisher": "Electronic Arts", "release_date": "Mar 11 2014", "developers": ["Respawn Entertainment"], "platforms": ["Xbox 360", "Xbox One", "PC"], "num_players": "Up to 12 ", "genres": ["Shooter", "Sci-Fi", "Miscellaneous", "General", "Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/f6ff9864232833cf05db1913cf4808da-98.jpg", "descriptions": "Crafted by one of the co-creators of Call of Duty and other key developers behind the Call of Duty franchise, Titanfall, with its advanced combat techniques, gives you the freedom to fight your way as both elite assault Pilot and fast, heavily armored Titan. The experience combinesCrafted by one of the co-creators of Call of Duty and other key developers behind the Call of Duty franchise, Titanfall, with its advanced combat techniques, gives you the freedom to fight your way as both elite assault Pilot and fast, heavily armored Titan. The experience combines fast-paced multiplayer action with the dramatically charged moments of a cinematic universe.… Expand"}, {"name": "Borderlands 2: Tiny Tina's Assault on Dragon Keep", "details_link": "https://www.metacritic.com/game/xbox-360/borderlands-2-tiny-tinas-assault-on-dragon-keep", "publisher": "2K Games", "release_date": "Jun 25 2013", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/91836fda017fc3b67497bb5f18ba3e44-98.jpg", "descriptions": "Wizards and Crumpets, oh my! Join vault hunters, old and new, in Tiny Tina's epic quest of revenge and redemption. Tiny Tina’s Assault on Dragon Keep, the biggest add-on content in Borderlands history, features a game within a game, as Tiny Tina takes on the role of Bunker Master in a gameWizards and Crumpets, oh my! Join vault hunters, old and new, in Tiny Tina's epic quest of revenge and redemption. Tiny Tina’s Assault on Dragon Keep, the biggest add-on content in Borderlands history, features a game within a game, as Tiny Tina takes on the role of Bunker Master in a game of “Bunkers & Badasses”.  Travel through a dark and ever-changing world of castles, dungeons and magic forests as you fight off skeletons, orcs, dragons and more.  Explore side missions and answer riddles as you roll your insight stat to gain new and amazing loot. Join with friends to save the queen and restore peace and order to the world once more.… Expand"}, {"name": "Rayman Origins", "details_link": "https://www.metacritic.com/game/pc/rayman-origins", "publisher": "Ubisoft", "release_date": "Mar 29 2012", "developers": ["UBlart Montpellier"], "platforms": ["3DS", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/52d84b2ad34a6cd5bae6442d75e18683-98.jpg", "descriptions": "Rayman Origins is a comic adventure set in a lush 2D world brimming with unexpected secrets and outlandish enemies. The Glade of Dreams is overrun by the \"nefurrious\" Darktoons. The Fairy Council seeks Rayman's help to save the day. Rayman receives the aid of his best friend GloboxRayman Origins is a comic adventure set in a lush 2D world brimming with unexpected secrets and outlandish enemies. The Glade of Dreams is overrun by the \"nefurrious\" Darktoons. The Fairy Council seeks Rayman's help to save the day. Rayman receives the aid of his best friend Globox as well as two crafty wizards, the Teensies. Together the world's most hilarious team of heroes sets out to restore peace to the Glade before their beloved home is destroyed. Rayman Origins supports four-player jump-in-and-jump-out co-op gameplay. The game offers a massive universe to explore, with more than 100 characters, 12 unique worlds, and more than 60 levels of platforming gameplay designed for all ages and play styles. Unlock new abilities and moves as you progress through the game. All members of your team will discover new unique abilities, including swimming, diving, slapping, and the sensational \"HarilyCopter.\"… Expand"}, {"name": "Tony Hawk's Underground", "details_link": "https://www.metacritic.com/game/game-boy-advance/tony-hawks-underground", "publisher": "Activision", "release_date": "Oct 27 2003", "developers": ["Vicarious Visions"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 86, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/bd536ede8ea4871724c28462620814fb-98.jpg", "descriptions": "Get ready for a major new step for the Tony Hawk series.  Tony Hawk's Underground tweaks the gameplay of previous installments to include a plot-twisting story, customizable tricks and decks, online play, and the ability to include your own mug shot on your custom player.  Of course, you canGet ready for a major new step for the Tony Hawk series.  Tony Hawk's Underground tweaks the gameplay of previous installments to include a plot-twisting story, customizable tricks and decks, online play, and the ability to include your own mug shot on your custom player.  Of course, you can also play as any one of pro skating's biggest stars including Tony Hawk, Bob Burnquist, and Elissa Steamer.  Ride, walk, or drive through nine expansive levels then test your skills against other gamers online.  Become a star of the Underground.… Expand"}, {"name": "FIFA Soccer 2003", "details_link": "https://www.metacritic.com/game/gamecube/fifa-soccer-2003", "publisher": "EA Sports", "release_date": "Nov 14 2002", "developers": ["EA Canada"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 86, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/6e3082fd9f63e90c31704ea35b0389cd-98.jpg", "descriptions": "Master the fundamentals of soccer in FIFA Soccer 2003. With more ball control and player moves, this year's FIFA Soccer puts the The Total Club Championship within your grasp. Unleash the skills of the world's greatest players through new player animations and signature skill moves.Master the fundamentals of soccer in FIFA Soccer 2003. With more ball control and player moves, this year's FIFA Soccer puts the The Total Club Championship within your grasp. Unleash the skills of the world's greatest players through new player animations and signature skill moves. Experience pressure-cooker atmospheres as you take on Europe's elite teams in their own stadiums featuring actual team chants and songs. EA Sports Freestyle Control lets you produce a feint, one-touch pass, or skill move to leave your opponents standing.… Expand"}, {"name": "Lunar 2: Eternal Blue Complete", "details_link": "https://www.metacritic.com/game/playstation/lunar-2-eternal-blue-complete", "publisher": "Working Designs", "release_date": "Dec 15 2000", "developers": ["Game Arts"], "platforms": "PlayStation", "num_players": "", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/87068c0db4ab20399c15914f01a7403f-98.jpg", "descriptions": "The enchanting world of LUNAR comes  to life once more in the enhanced PlayStation game console version of the classic RPG sequel. Join freewheeling Hiro and the adorable Ruby, a thousand years after the events of LUNAR: Silver Star Story, as they work to unlock the secrets of the BlueThe enchanting world of LUNAR comes  to life once more in the enhanced PlayStation game console version of the classic RPG sequel. Join freewheeling Hiro and the adorable Ruby, a thousand years after the events of LUNAR: Silver Star Story, as they work to unlock the secrets of the Blue Spire... and the strange young girl they found within it! But be careful - dark forces are trying to revive the evil Zophar, and immerse LUNAR in darkness forever. Journey to distant lands in the search of the Goddess Althena, who may be the only one powerful enough to stop Zophar. Along to way, you'll meet exciting new caracters, fight vividly animated monsters, traverse snow-covered mountain peaks, and crawl throught slimy dungeon depths as you wind your way toword the terrifying climax! LUNAR 2 features almost an hour of detailed animation sequences and over 90 minutes of dialogue packed onto three CDs... so what are you waiting for? Go ahead, you deserve to be the hero for once!… Expand"}, {"name": "Alundra", "details_link": "https://www.metacritic.com/game/playstation/alundra", "publisher": "Working Designs", "release_date": "Dec 31 1997", "developers": ["Matrix Software"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/e8b2e4af679c0ae5776e1475c8447c27-98.jpg", "descriptions": "Plagued by strange visions, the Dreamwalker Alundra is summoned to a troubled village where great evil lies in wait. Explore huge dungeons, find deadly weapons, solve challenging puzzles and fight the cast of foul creatures out to stop you in your tracks. This vast, enthralling adventurePlagued by strange visions, the Dreamwalker Alundra is summoned to a troubled village where great evil lies in wait. Explore huge dungeons, find deadly weapons, solve challenging puzzles and fight the cast of foul creatures out to stop you in your tracks. This vast, enthralling adventure will keep you wide awake to the very end. … Expand"}, {"name": "Minecraft", "details_link": "https://www.metacritic.com/game/switch/minecraft", "publisher": "Mojang AB", "release_date": "Jun 21 2018", "developers": ["4J Studios", "Mojang AB"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Sandbox"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/49d553990488e666f576cc0b11906ed4-98.jpg", "descriptions": "The game involves players creating and destroying various types of blocks in a three dimensional environment. The player takes an avatar that can destroy or create blocks, forming fantastic structures, creations and artwork across the various multiplayer servers in multiple game modes."}, {"name": "Gears of War 4", "details_link": "https://www.metacritic.com/game/pc/gears-of-war-4", "publisher": "Microsoft Game Studios", "release_date": "Oct 11 2016", "developers": ["The Coalition"], "platforms": ["Xbox One", "PC"], "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 86, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/0a3468285d9d72367b1eabb8323742da-98.jpg", "descriptions": "After narrowly escaping an attack on their village, JD Fenix and his friends, Kait and Del, must rescue the ones they love and discover the source of a monstrous new enemy. Team up with four others and battle wave after wave of increasingly difficult enemies by choosing your combat class,After narrowly escaping an attack on their village, JD Fenix and his friends, Kait and Del, must rescue the ones they love and discover the source of a monstrous new enemy. Team up with four others and battle wave after wave of increasingly difficult enemies by choosing your combat class, leveling up your skills and deploying fortifications anywhere on the map. Compete online in new and favorite game types, all at 60fps on dedicated servers. A new visible ranking system means fairer matchmaking for social, competitive and professional players alike. Redefined Cover Gameplay: New weapons, close-cover combat moves and combat-knife executions turn each piece of cover into an offensive opportunity.… Expand"}, {"name": "Ni no Kuni: Wrath of the White Witch Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/ni-no-kuni-wrath-of-the-white-witch-remastered", "publisher": "Bandai Namco Games", "release_date": "Sep 20 2019", "developers": ["Level 5", "QLOC"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/c157252b3a8ec19a7fa62a81432bde18-98.jpg", "descriptions": "Ni no Kuni: Wrath of the White Witch Remastered = Journey back to the other world in Ni no Kuni: Wrath of the White Witch. LEVEL-5's classic tale returns better than ever. Join Oliver as he embarks on an adventure through a world inhabited by new friends and ferocious foes alike in the hopesNi no Kuni: Wrath of the White Witch Remastered = Journey back to the other world in Ni no Kuni: Wrath of the White Witch. LEVEL-5's classic tale returns better than ever. Join Oliver as he embarks on an adventure through a world inhabited by new friends and ferocious foes alike in the hopes of bringing back his mother after a tragic incident. With a copy of the Wizard's Companion in his hand and his trusty friend Drippy by his side, he will travel across this rich fantasy world to tame familiars, take on enemies, and overcome the countless challenges that stand between him and his mother's salvation.\r Features:\r This charming tale unfolds through the use of animation storyboarded and created by the legendary Studio Ghibli and music composed by the renowned Joe Hisaishi. Ni no Kuni: Wrath of the White Witch combines beautiful animated visuals, masterful storytelling, and a sweeping score to create an epic role-playing adventure like no other.\r * TAKE THE OTHER WORLD WITH YOU - Take Ni no Kuni: Wrath of the White Witch wherever you go on Nintendo Switch\r* ALL-STAR PRODUCTION - LEVEL-5's mastery of the RPG genre is combined with Studio Ghibli's world-class animation and\rmusic composed by the renowned Joe Hisaishi\r* CAPTIVATING STORY - A charming yet tragic tale unfolds through the use of animation storyboarded and created by Studio\rGhibli with English and Japanese voice-overs\r* ROLE-PLAYING MASTERY - A rich mixture of familiar RPG elements, expertly crafted and designed, and featuring dozens of\rlocations to explore, hundreds of creatures to battle, and a wealth of quests and secrets to uncover\r* DYNAMIC COMBAT - Switch freely between characters and familiars in an exciting battle system that combines real-time and\rturn-based tactical elements… Expand"}, {"name": "Valfaris", "details_link": "https://www.metacritic.com/game/pc/valfaris", "publisher": "Big Sugar Films", "release_date": "Oct 10 2019", "developers": ["Steel Mantis"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/ebc83614bad930303bf45539e1cf4e09-98.jpg", "descriptions": "Set in a far corner of space, Valfaris is a heavy metal infused 2D action-platformer and the next game from the team behind Unity Awards finalist, Slain: Back From Hell. Brutal combat. Deadly enemies. Stunning pixel art. Savage soundtrack. Get ready to rip the galaxy a new wormhole."}, {"name": "Shantae and the Pirate's Curse", "details_link": "https://www.metacritic.com/game/switch/shantae-and-the-pirates-curse", "publisher": "WayForward", "release_date": "Mar 20 2018", "developers": ["WayForward"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation 5", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/f5c83f2aea42d110b6c10877063f142f-98.jpg", "descriptions": "Embark on a brand new adventure which teams Shantae with her arch nemesis, Risky Boots! When a curse falls upon Sequin Land, Risky Boots and Shantae must join forces to battle unimaginable evil. Shantae must give up her job as Scuttle Towns \"Guardian Genie\" and become a pirate ifEmbark on a brand new adventure which teams Shantae with her arch nemesis, Risky Boots! When a curse falls upon Sequin Land, Risky Boots and Shantae must join forces to battle unimaginable evil. Shantae must give up her job as Scuttle Towns \"Guardian Genie\" and become a pirate if she hopes to get her magic back and save the day. As a pirate, Shantae gains new weapons and tools to advance her quest and power through monsters!\r *    Flintlock Pistol (blast enemies and switches from afar)\r*    Pirate Hat (glide on the wind using this enormous headwear)\r*    Risky's Boots (run at super speeds! Chain your attacks as you dash through enemies & over lava)\r*    Cannon (blast yourself into the air on a belch of black powder)\r Core Gameplay Components:\r *    Whipping! Destroy monsters, topple bosses, and solve puzzles with your hair\r*    Platforming! Run and jump through deviously designed levels\r*    Exploring! Navigate a world of interconnected levels and Labyrinths\r*    Belly Dancing! Dance with your Magic Lamp to suck up magic and items\r*    Customizing! Earn new abilities, unlock stat-boosting artifacts, magic & costumes\r*    Storytelling! Flirtatious characters and wonderfully off-beat humor… Expand"}, {"name": "Guilty Gear Xrd -REVELATOR-", "details_link": "https://www.metacritic.com/game/playstation-4/guilty-gear-xrd--revelator-", "publisher": "Aksys Games", "release_date": "Jun  7 2016", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "num_players": "Up to 64 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/20043dc19cd210a84a66573e65d3b88e-98.jpg", "descriptions": "Guilty Gear Xrd -REVELATOR- moves along at 60 frames per second and features PS4/PS3 cross compatible battles. Choose from over 20+ fighters as you battle for glory in the post apocalypse. New modes and polished mechanics provide infinite ways to annihilate your rivals."}, {"name": "Pinball FX 2: Marvel Pinball", "details_link": "https://www.metacritic.com/game/xbox-360/pinball-fx-2-marvel-pinball", "publisher": "Zen Studios", "release_date": "Dec  8 2010", "developers": ["Zen Studios"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/7361721667eecb9a037823bcfc004b53-98.jpg", "descriptions": "Marvel Pinball is an expansion set for Pinball FX-2 for the Xbox 360."}, {"name": "The Forgotten City", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-forgotten-city", "publisher": "Maximum Games", "release_date": "Jul 28 2021", "developers": ["Modern Storyteller"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/55d6061cb2bb09d1de2d2db9849566d6-98.jpg", "descriptions": "The Forgotten City is a mystery adventure game of exploration and deduction. Travel 2,000 years into the past and relive the final days of a cursed Roman city, where if one person sins, everyone dies.  Combat is an option, but violence will only get you so far. Only by questioning anThe Forgotten City is a mystery adventure game of exploration and deduction. Travel 2,000 years into the past and relive the final days of a cursed Roman city, where if one person sins, everyone dies.  Combat is an option, but violence will only get you so far. Only by questioning an intertwined community of colourful characters, cleverly exploiting the time loop, and making difficult moral choices can you hope to solve this epic mystery. Here, your decisions matter. The fate of the city is in your hands.\r… Expand"}, {"name": "God of War: Ghost of Sparta", "details_link": "https://www.metacritic.com/game/psp/god-of-war-ghost-of-sparta", "publisher": "SCEA", "release_date": "Nov  2 2010", "developers": ["Ready at Dawn"], "platforms": ["PlayStation 3", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "Fantasy", "Linear"], "meta_score": 86, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/8/8fdd360cbf8bb6b23be6a1828aa65e95-98.jpg", "descriptions": "Set in the realm of Greek mythology, God of War: Ghost of Sparta is a single-player game that allows players to take on the powerful role of Spartan warrior Kratos. This new adventure picks up after God of War concludes, telling the story of Kratos' ascension to power as the God of War. InSet in the realm of Greek mythology, God of War: Ghost of Sparta is a single-player game that allows players to take on the powerful role of Spartan warrior Kratos. This new adventure picks up after God of War concludes, telling the story of Kratos' ascension to power as the God of War. In his quest to rid himself of the nightmares that haunt him, Kratos must embark on a journey that will reveal the origins of lost worlds, and finally answer long-awaited questions about his dark past.  Armed with the deadly chained Blades of Chaos, he will have to overcome armies of mythological monsters, legions of undead soldiers, and amazingly dangerous and brutal landscapes throughout his merciless quest.… Expand"}, {"name": "Trials HD", "details_link": "https://www.metacritic.com/game/xbox-360/trials-hd", "publisher": "Microsoft Game Studios", "release_date": "Aug 12 2009", "developers": ["RedLynx"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/a422b36aede01ff168029fb1ed7c2cee-98.jpg", "descriptions": "[Xbox Live Arcade]  Trials HD is a full-featured, physics-based motorcycle racing game with over 50 tracks in two unique game modes. Race Mode emphasizes balance, skill, and control as you tackle indoor obstacle tracks. Skill Mode features extreme stunt tracks in which explosions, crashes,[Xbox Live Arcade]  Trials HD is a full-featured, physics-based motorcycle racing game with over 50 tracks in two unique game modes. Race Mode emphasizes balance, skill, and control as you tackle indoor obstacle tracks. Skill Mode features extreme stunt tracks in which explosions, crashes, and injuries cannot be avoided. A level editor enables players to create, share and download an unlimited number of free tracks. The game features stunning full HD graphics, rider customization, unlockable bikes, global rankings, all new in-game friend scores, and many other fun features. Can you handle the bruises and broken bones - and take part in a truly unique racing experience? [Microsoft]… Expand"}, {"name": "Panzer Corps 2", "details_link": "https://www.metacritic.com/game/pc/panzer-corps-2", "publisher": "Slitherine", "release_date": "Mar 19 2020", "developers": ["Flashback Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 86, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/8fb06d905e87fd2d99fe2fc60c1a6393-98.jpg", "descriptions": "Panzer Corps 2 is the ultimate Second World War strategy game! Enjoy the time-proven gameplay formula which has been appreciated by millions of players over the years, brought to a whole new level of refinement up to the latest technical standards."}, {"name": "Her Story", "details_link": "https://www.metacritic.com/game/pc/her-story", "publisher": "Sam Barlow", "release_date": "Jun 24 2015", "developers": ["Sam Barlow"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 86, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/34bb3a2c85c8ec32aff788038595b181-98.jpg", "descriptions": "Her Story is the new game from Sam Barlow, creator of Silent Hill: Shattered Memories and Aisle. A crime fiction game with non-linear storytelling, Her Story revolves around a police database full of live action video footage. It stars Viva Seifert, actress and one half of the band JoeHer Story is the new game from Sam Barlow, creator of Silent Hill: Shattered Memories and Aisle. A crime fiction game with non-linear storytelling, Her Story revolves around a police database full of live action video footage. It stars Viva Seifert, actress and one half of the band Joe Gideon and the Shark.… Expand"}, {"name": "Diablo III: Ultimate Evil Edition", "details_link": "https://www.metacritic.com/game/xbox-one/diablo-iii-ultimate-evil-edition", "publisher": "Blizzard Entertainment", "release_date": "Aug 19 2014", "developers": ["Blizzard Entertainment"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/521b7adfd66b6d002c14c32d3e969c72-98.jpg", "descriptions": "Xbox One players can now experience the full adventure of Blizzard's epic action RPG, Diablo III, and the upcoming expansion, Reaper of Souls all from the comfort of their couch in Diablo III: Ultimate Evil Edition. Take on the role of one of six powerful character class Barbarian, DemonXbox One players can now experience the full adventure of Blizzard's epic action RPG, Diablo III, and the upcoming expansion, Reaper of Souls all from the comfort of their couch in Diablo III: Ultimate Evil Edition. Take on the role of one of six powerful character class Barbarian, Demon Hunter, Monk, Witch Doctor, Wizard, or the all-new Crusader and embark on a dark journey through Acts I-V to save the world of Sanctuary from ancient and sinister forces.… Expand"}, {"name": "Punch-Out!!", "details_link": "https://www.metacritic.com/game/wii/punch-out!!", "publisher": "Nintendo", "release_date": "May 18 2009", "developers": ["Next Level Games"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/68ff09947cc29b8fd87583af3777e292-98.jpg", "descriptions": "One of the biggest names in boxing returns after a 15-year hiatus. Grab a Wii Remote controller in one hand and a Nunchuk controller in the other and step back into the ring with a modern update of the classic Punch-Out!! Little Mac is back! Everyone’s favorite underdog from the 1980s joinsOne of the biggest names in boxing returns after a 15-year hiatus. Grab a Wii Remote controller in one hand and a Nunchuk controller in the other and step back into the ring with a modern update of the classic Punch-Out!! Little Mac is back! Everyone’s favorite underdog from the 1980s joins the best of the original Punch-Out!! cast in a modern re-imagination of the series. Players will find familiar names like Glass Joe, King Hippo and trainer Doc Louis. These boxers come to life again in cel-shaded 3-D, complete with hilarious fighting animations and back stories that capture all the fun and flair of the original Punch-Out!! games. The motion-sensitive controls of the Wii console mean that when players throw punches, Little Mac throws punches as well. Additionally, you can control hooks and jabs by combining motion control with control-stick movement. The motion-sensing Wii Remote and Nunchuk controllers turn real-life swings into on-screen punches, so anyone can play. The game can also be played with classic NES-style controls by turning the Wii Remote sideways. Characters: Little Mac, Glass Joe, King Hippo, Doc Louis, Von Kaiser and other unannounced favorites. Special powers/weapons/moves/features: Players can obtain special \"Star Punches,\" which allow Little Mac to take more Health from his rival in a single punch. Motion Control (Wii Remote and Nunchuk controllers) Punch-Out!! uses the Wii Remote and Nunchuk controllers to simulate throwing punches. Use the Nunchuk to throw a left punch and the Wii Remote to throw a right punch. Classic Control (Wii Remote NES style) Fans of the NES version and core gamers will be excited to see Nintendo has also included the option to play Punch-Out!! using the classic layout from the original NES controller. Use the 1 and 2 buttons along with the cross pad to throw hooks and jabs or to dodge. [Nintendo]… Expand"}, {"name": "ESPN College Hoops 2K5", "details_link": "https://www.metacritic.com/game/xbox/espn-college-hoops-2k5", "publisher": "Sega", "release_date": "Nov 17 2004", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/9341c1b13507d3305c4fbffaf007ab0a-98.jpg", "descriptions": "Experience all the excitement of college basketball in this year's installment in the ESPN College Hoops series. ESPN College Hoops 2K5 gives you even more management options in a revamped legacy mode, including scouting, balancing out the budget, and finding better coaching opportunitiesExperience all the excitement of college basketball in this year's installment in the ESPN College Hoops series. ESPN College Hoops 2K5 gives you even more management options in a revamped legacy mode, including scouting, balancing out the budget, and finding better coaching opportunities around the league. On the court, a new \"pass-n-go\" system lets you perform lead passes to your teammates and execute advanced give-and-go and alley-oop plays. If you'd rather coach than play, you can play in coach mode, in which you're responsible for calling the plays, directing your players, and making key decisions in overtime.… Expand"}, {"name": "Suikoden III", "details_link": "https://www.metacritic.com/game/playstation-2/suikoden-iii", "publisher": "Konami", "release_date": "Oct 24 2002", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 86, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/7a21fe5d633b590c3bb6f5e3109825ab-98.jpg", "descriptions": "Fifteen years after the events of \"Suikoden II,\" follow the intertwining stories of Hugo, the son of a village chief, Chris, the virtuous Knight of Zexen, and Geddoe, the rebellious unit commander, as their fates bring them together in order to gather the 108 Stars of Destiny. Suikoden IIIFifteen years after the events of \"Suikoden II,\" follow the intertwining stories of Hugo, the son of a village chief, Chris, the virtuous Knight of Zexen, and Geddoe, the rebellious unit commander, as their fates bring them together in order to gather the 108 Stars of Destiny. Suikoden III breaks new ground in the RPG genre with 3 different battle systems, 3 main characters, 3 styles of combat and a fully detailed 3D world. [Konami]… Expand"}, {"name": "Radiant Silvergun", "details_link": "https://www.metacritic.com/game/xbox-360/radiant-silvergun", "publisher": "Microsoft Game Studios", "release_date": "Sep 14 2011", "developers": ["Treasure"], "platforms": ["Switch", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/8a3f5ad9cdcd38b795c524fe08f36259-98.jpg", "descriptions": "Radiant Silvergun, restored by Treasure, is now available. The shoot ‘em up gameplay that made this a legend remains unchanged, but a hidden \"Ikaruga-style\" shooting mode gives everyone something new. Previously only available in Japan, Radiant Silvergun on Xbox LIVE Arcade also providesRadiant Silvergun, restored by Treasure, is now available. The shoot ‘em up gameplay that made this a legend remains unchanged, but a hidden \"Ikaruga-style\" shooting mode gives everyone something new. Previously only available in Japan, Radiant Silvergun on Xbox LIVE Arcade also provides leaderboards, co-op play locally or over Xbox LIVE, downloadable replays, and improved visuals making it the version to own.… Expand"}, {"name": "Starcraft II: Heart of the Swarm", "details_link": "https://www.metacritic.com/game/pc/starcraft-ii-heart-of-the-swarm", "publisher": "Blizzard Entertainment", "release_date": "Mar 12 2013", "developers": ["Blizzard Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "Command"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/9b2490bf53cb3305c8dc79df00cbac37-98.jpg", "descriptions": "StarCraft II continues the epic saga of the Protoss, Terran, and Zerg. These three distinct and powerful races clash once again in the fast-paced real-time strategy sequel to the legendary original, StarCraft. Legions of veteran, upgraded, and brand-new unit types do battle across theStarCraft II continues the epic saga of the Protoss, Terran, and Zerg. These three distinct and powerful races clash once again in the fast-paced real-time strategy sequel to the legendary original, StarCraft. Legions of veteran, upgraded, and brand-new unit types do battle across the galaxy, as each faction struggles for survival. Featuring a unique single-player campaign that picks up where StarCraft: Brood War left off, StarCraft II presents a cast of new heroes and familiar faces in an edgy sci-fi story filled with adventure and intrigue. In addition, Blizzard again offers unparalleled online play through Battle.net, the company's world-renowned gaming service, with several enhancements and new features to make StarCraft II the ultimate competitive real-time strategy game. Features fast-paced, hard-hitting, tightly balanced competitive real-time strategy gameplay that recaptures and improves on the magic of the original game. New units and gameplay mechanics further distinguish each race. Vibrant new 3D-graphics engine with support for dazzling visual effects and massive unit and army sizes. Full map-making and scripting tools to give players incredible freedom in customizing and personalizing their gameplay experience. [Blizzard]… Expand"}, {"name": "Dishonored 2", "details_link": "https://www.metacritic.com/game/pc/dishonored-2", "publisher": "Bethesda Softworks", "release_date": "Nov 10 2016", "developers": ["Arkane Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/3b76919712345356bcebd0ae34d4bc32-98.jpg", "descriptions": "Dishonored 2 takes your protagonist, Corvo Attano or Emily Kaldwin, to the coastal city of Karnaca where the choices you make will have significant impact on the world."}, {"name": "Pentiment", "details_link": "https://www.metacritic.com/game/xbox-series-x/pentiment", "publisher": "Xbox Game Studios", "release_date": "Nov 15 2022", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/69cc0fa020032f31ade0958258d16f67-98.jpg", "descriptions": "Step into a living illustrated world inspired by illuminated manuscripts and printed woodcuts in a time when Europe is at a crossroads of great religious and political change. Walk in the footsteps of Andreas Maler, a master artist who finds himself in the middle of murders, scandals, andStep into a living illustrated world inspired by illuminated manuscripts and printed woodcuts in a time when Europe is at a crossroads of great religious and political change. Walk in the footsteps of Andreas Maler, a master artist who finds himself in the middle of murders, scandals, and intrigue in the Bavarian Alps. Choose your backgrounds, impact a changing world, and see the consequences of your decisions in this narrative adventure.… Expand"}, {"name": "The Legend of Heroes: Trails to Azure", "details_link": "https://www.metacritic.com/game/pc/the-legend-of-heroes-trails-to-azure", "publisher": "NIS America", "release_date": "Mar 14 2023", "developers": ["Falcom"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/9d817e6addfd76997fe0d85effaf6f44-98.jpg", "descriptions": "Sandwiched between two great powers, the city of Crossbel is the place where the Uroboros group carry out their biggest and darkest schemes. A mysterious drug is spreading its poison across the city, the mafia and the mercenary groups seem to have a role in the crimes. Add a break down toSandwiched between two great powers, the city of Crossbel is the place where the Uroboros group carry out their biggest and darkest schemes. A mysterious drug is spreading its poison across the city, the mafia and the mercenary groups seem to have a role in the crimes. Add a break down to the political order to the mix, and you have complete chaos in your hands. The world becomes more real and the battles become more dangerous in Ao no Kiseki. Feel the rain patter on your skin and enemies creep up to you in the dark.… Expand"}, {"name": "Paranormasight: The Seven Mysteries of Honjo", "details_link": "https://www.metacritic.com/game/switch/paranormasight-the-seven-mysteries-of-honjo", "publisher": "Square Enix", "release_date": "Mar  9 2023", "developers": ["Square Enix", "Xeen"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "Visual Novel"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/9524b56067e7c15486f7e113d8b33a09-98.jpg", "descriptions": "Shogo Okiie, an ordinary office worker, visits Kinshibori Park in the dead of night with his friend, Yoko Fukunaga, to investigate a well-known local ghost story: The Seven Mysteries of Honjo. Shogo doesn't quite believe Yoko when she talks about how the Mysteries are connected to the RiteShogo Okiie, an ordinary office worker, visits Kinshibori Park in the dead of night with his friend, Yoko Fukunaga, to investigate a well-known local ghost story: The Seven Mysteries of Honjo. Shogo doesn't quite believe Yoko when she talks about how the Mysteries are connected to the Rite of Resurrection and doesn't pay it much mind - that is, until strange events begin to unfold before his very eyes.\r Meanwhile, several others are making their own investigations into The Seven Mysteries...\r Detectives investigating a series of strange deaths, a high-school girl seeking the truth behind her classmate's suicide, and a mother who has sworn revenge for her lost son.\r Their desires and motives intertwine and interplay, with the Seven Mysteries of Honjo at the core, leading the story towards a battle of wits and curses.… Expand"}, {"name": "Tinykin", "details_link": "https://www.metacritic.com/game/xbox-series-x/tinykin", "publisher": "tinyBuild", "release_date": "Aug 30 2022", "developers": ["Splashteam"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "Platformer", "3D", "Command"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/3d95e730301949fa233ba2511dafa981-98.jpg", "descriptions": "Milo arrives on Earth to find that he's way too small, everybody's gone and a day hasn't passed since 1991!Catch hundreds of mysterious tinykin and use their unique powers to create ladders, bridges, explosions and a lot more!\n\nFind a way home through a sprawling ant-sized metropolis, andMilo arrives on Earth to find that he's way too small, everybody's gone and a day hasn't passed since 1991!Catch hundreds of mysterious tinykin and use their unique powers to create ladders, bridges, explosions and a lot more!Find a way home through a sprawling ant-sized metropolis, and unravel Earth's biggest mystery!… Expand"}, {"name": "Guacamelee! Super Turbo Championship Edition", "details_link": "https://www.metacritic.com/game/switch/guacamelee!-super-turbo-championship-edition", "publisher": "DrinkBox Studios", "release_date": "Oct  8 2018", "developers": ["DrinkBox Studios"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/e4be0f16f6fe17db0c40f110ebff87c7-98.jpg", "descriptions": "Evil chose the wrong day to double-dip.\r Carlos Calaca has kidnapped El Presidente's Daughter, and he plans to sacrifice her in order to merge the World of the Living with the World of the Dead.\r\n\r\nJuan Aguacate, an agave farmer who stumbles upon a Legendary Luchador mask, must find theEvil chose the wrong day to double-dip.\r Carlos Calaca has kidnapped El Presidente's Daughter, and he plans to sacrifice her in order to merge the World of the Living with the World of the Dead.\r Juan Aguacate, an agave farmer who stumbles upon a Legendary Luchador mask, must find the strength and courage to become the Hero he's always dreamed of being and put a stop to this.\r Guacamelee! STCE is a Metroidvania-style action-platformer set in a magical world inspired by traditional Mexican culture and folklore.\r The game features melee combat, parallel dimensions and same-screen co-op. The Super Turbo Championship Edition also includes extra abilities, new level content and enhanced graphics. Also chickens.… Expand"}, {"name": "Resident Evil 7: biohazard", "details_link": "https://www.metacritic.com/game/xbox-one/resident-evil-7-biohazard", "publisher": "Capcom", "release_date": "Jan 24 2017", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/2a00c969261328a420e64421f77d87c6-98.jpg", "descriptions": "Fear and isolation seep through the walls of an abandoned southern farmhouse. \"7\" marks a new beginning for survival horror with the Isolated View of the visceral new first-person perspective. Powered by the RE Engine, horror reaches incredible heights of immersion as players enter aFear and isolation seep through the walls of an abandoned southern farmhouse. \"7\" marks a new beginning for survival horror with the Isolated View of the visceral new first-person perspective. Powered by the RE Engine, horror reaches incredible heights of immersion as players enter a terrifyingly new world of fear as they fight to survive.… Expand"}, {"name": "Bit.Trip Presents...Runner2: Future Legend of Rhythm Alien", "details_link": "https://www.metacritic.com/game/playstation-3/bittrip-presentsrunner2-future-legend-of-rhythm-alien", "publisher": "Aksys Games", "release_date": "Mar  5 2013", "developers": ["Gaijin Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/05bcb3bce37121eccf7492b02b84027e-98.jpg", "descriptions": "Runner 2 - Future Legend of Rhythm Alien is inspired by the Bit.Trip series originally released on Nintendo platforms."}, {"name": "Mass Effect 2: Lair of the Shadow Broker", "details_link": "https://www.metacritic.com/game/pc/mass-effect-2-lair-of-the-shadow-broker", "publisher": "Electronic Arts", "release_date": "Sep  7 2010", "developers": ["BioWare"], "platforms": ["Xbox 360", "PC"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/2146c7e7f34cf6ac03f7c7460855c49d-98.jpg", "descriptions": "Liara T'Soni is tracking down the mysterious Shadow Broker, and no one is safe. She'll do anything to recover the man the Broker kidnapped... and the Shadow Broker's agents will do anything to stop her. Team up with Liara and chase clues from the luxurious heights of Illium to the ShadowLiara T'Soni is tracking down the mysterious Shadow Broker, and no one is safe. She'll do anything to recover the man the Broker kidnapped... and the Shadow Broker's agents will do anything to stop her. Team up with Liara and chase clues from the luxurious heights of Illium to the Shadow Broker's own secret lair. Adds the Shadow Broker intel center, new research, and five new achievements and the chance to continue a relationship with Liara.… Expand"}, {"name": "LEGO Star Wars II: The Original Trilogy", "details_link": "https://www.metacritic.com/game/pc/lego-star-wars-ii-the-original-trilogy", "publisher": "LucasArts", "release_date": "Sep 12 2006", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/333ed218d70ca36ca8634e59e7915fbf-98.jpg", "descriptions": "LEGO Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you buildLEGO Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you build and battle your way through your favorite film moments. From Darth Vader's pursuit of Princess Leia aboard her Blockade Runner to Luke's final confrontation with Emperor Palpatine. For the first time ever, characters can get in and out of vehicles, as well as ride creatures. Because it's LEGO style, you can also mix and match the body parts of more than 50 playable characters to create one of millions of possible LEGO Star Wars heroes. And on PS2, Xbox and Windows platforms, a game save from the first LEGO Star Wars can unlock another 50-plus additional characters for Free Play mode -- that's more than 100 total characters. Other exciting additions include free-roaming vehicle levels, the ability to switch ships at will in Free Play mode, cool new character-specific attacks and maneuvers, playable mini-kit vehicles, an adaptive difficulty option and more. [LucasArts]… Expand"}, {"name": "Guilty Gear X2 #Reload", "details_link": "https://www.metacritic.com/game/xbox/guilty-gear-x2-reload", "publisher": "Majesco Games", "release_date": "Sep 14 2004", "developers": ["Arc System Works"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 86, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/fe37bc3d987c28484724588996b41547-98.jpg", "descriptions": "Now you can play Guilty Gear on Xbox Live in head-to-head competitions that feature real-time global rankings, voice support, and friend lists. Guilty Gear X2 #Reload lets you battle your favorite Guilty Gear characters in a variety of modes, including Arcade, Medal of Millionaire, Versus,Now you can play Guilty Gear on Xbox Live in head-to-head competitions that feature real-time global rankings, voice support, and friend lists. Guilty Gear X2 #Reload lets you battle your favorite Guilty Gear characters in a variety of modes, including Arcade, Medal of Millionaire, Versus, Survival, Story, Mission, and Training. You can master all the moves, combos, and signature kills of 20 characters plus hidden and EX characters. Fine-tune your skills so that you can defeat the Gears--intelligent creatures that threaten human control of the planet.… Expand"}, {"name": "Midnight Club II", "details_link": "https://www.metacritic.com/game/xbox/midnight-club-ii", "publisher": "Rockstar Games", "release_date": "Jun  3 2003", "developers": ["Rockstar San Diego"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-6 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/20901529e7290baa6ad8c94842daecd8-98.jpg", "descriptions": "Rockstar is poised to once again set a new benchmark in the racing genre.  In Midnight Club 2 you are an elite, illegal street racer, more dangerous and skilled than ever racing throughout the cities of Paris, Los Angeles, and Tokyo.  Choose from the latest performance enhanced cars andRockstar is poised to once again set a new benchmark in the racing genre.  In Midnight Club 2 you are an elite, illegal street racer, more dangerous and skilled than ever racing throughout the cities of Paris, Los Angeles, and Tokyo.  Choose from the latest performance enhanced cars and bikes and compete head-to-head to make a name for yourself.  There are no rules--drive anywhere in the city and just find the fastest route to win.  The cops know you are out there - don't get caught.… Expand"}, {"name": "Dungeon Siege", "details_link": "https://www.metacritic.com/game/pc/dungeon-siege", "publisher": "Microsoft Game Studios", "release_date": "Mar 31 2002", "developers": ["Gas Powered Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/1d15f78b83045e8df015e591a5c845bb-98.jpg", "descriptions": "Dungeon Siege combines the immersive elements of a role-playing game with over-the-top intensity and non-stop action. Dungeon Siege plunges you into a continuous 3D fantasy world where you face off against an army of evil that has been unleashed. You begin as a humble farmer, and as youDungeon Siege combines the immersive elements of a role-playing game with over-the-top intensity and non-stop action. Dungeon Siege plunges you into a continuous 3D fantasy world where you face off against an army of evil that has been unleashed. You begin as a humble farmer, and as you travel through the world and gain new skills, you can gather a party of up to eight characters to aid you. Dungeon Siege impels the player into one over-the-top battle after the other as the storyline unfolds and a larger plot begins to reveal itself. A world of adventure where you can explore sprawling landscapes in a seamlessly unfolding story awaits. [Microsoft]… Expand"}, {"name": "Star Wars: Knights of the Old Republic II: The Sith Lords", "details_link": "https://www.metacritic.com/game/xbox/star-wars-knights-of-the-old-republic-ii-the-sith-lords", "publisher": "LucasArts", "release_date": "Dec  6 2004", "developers": ["Obsidian Entertainment"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Role-Playing", "Third-Person"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/c8ffaf5d6d4a37d32c80f81f6f285900-98.jpg", "descriptions": "The next chapter of Star Wars: Knights of the Old Republic begins with a new storyline, force powers, characters, classes, and locations. Approximately five years after the events of the original Star Wars: Knights of the Old Republic, the Jedi, nearly brought to an end by the Sith, are onThe next chapter of Star Wars: Knights of the Old Republic begins with a new storyline, force powers, characters, classes, and locations. Approximately five years after the events of the original Star Wars: Knights of the Old Republic, the Jedi, nearly brought to an end by the Sith, are on the brink of extinction. As the last of the Jedi, you must master more than 30 new Force powers while battling your way through seven different worlds. This time, you can split your party to use several characters from your team for concurrent side quests.… Expand"}, {"name": "Crysis 2", "details_link": "https://www.metacritic.com/game/pc/crysis-2", "publisher": "EA Games", "release_date": "Mar 22 2011", "developers": ["Crytek"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 86, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/22edb1b2396ea25c5dd9809efa45660d-98.jpg", "descriptions": "First-person shooter Crysis returns powered by CryEngline 3 and is coming to PS3 and Xbox 360, as well as the PC."}, {"name": "Crashmo", "details_link": "https://www.metacritic.com/game/3ds/crashmo", "publisher": "Nintendo", "release_date": "Nov 22 2012", "developers": ["Intelligent Systems"], "platforms": "3DS", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/013d8c2782649576dca8b3cbfab9d938-98.jpg", "descriptions": "Also known as \"Fallblox\" in the UK/EU. Players can embrace the laws of gravity and challenge themselves with a whole new kind of action-puzzle play in this exciting sequel to the critically acclaimed Pushmo. New gravity mechanics and gadgets like floating blocks, doors and move switchesAlso known as \"Fallblox\" in the UK/EU. Players can embrace the laws of gravity and challenge themselves with a whole new kind of action-puzzle play in this exciting sequel to the critically acclaimed Pushmo. New gravity mechanics and gadgets like floating blocks, doors and move switches await, testing players' skills as they push, pull and slide each puzzle's colorful blocks in order to climb to the top. Just be careful where those blocks are moved-unsupported blocks will come crashing down. Crashmo contains lots of puzzles to test your brains, and enhanced puzzle-creation and -sharing features mean that even when all the puzzles are cleared, the fun never has to stop.… Expand"}, {"name": "Mass Effect Legendary Edition", "details_link": "https://www.metacritic.com/game/pc/mass-effect-legendary-edition", "publisher": "Electronic Arts", "release_date": "May 14 2021", "developers": ["BioWare"], "platforms": ["PlayStation 4", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 86, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/68a9bc6c989ebc05a84ecb9eaa0c9b91-98.jpg", "descriptions": "For many months now, our team at BioWare has been hard at work updating the textures, shaders, models, effects and technical features of three enormous games. Our goal was not to remake or reimagine the original games, but to modernize the experience so that fans and new players canFor many months now, our team at BioWare has been hard at work updating the textures, shaders, models, effects and technical features of three enormous games. Our goal was not to remake or reimagine the original games, but to modernize the experience so that fans and new players can experience the original work in its best possible form. It's been amazing to see the adventures of Commander Shepard take on new life in super-sharp resolution, faster framerates, and beautiful visual enhancements. \r\rMass Effect Legendary Edition will include single-player base content and DLC from Mass Effect, Mass Effect 2, and Mass Effect 3, plus promo weapons, armors, and packs - all remastered and optimized for 4k Ultra HD. It will be available in Spring 2021 for Xbox One, PlayStation 4, and PC, with forward compatibility and targeted enhancements on Xbox Series X and PlayStation 5.… Expand"}, {"name": "Mario & Luigi: Partners in Time", "details_link": "https://www.metacritic.com/game/ds/mario-luigi-partners-in-time", "publisher": "Nintendo", "release_date": "Nov 28 2005", "developers": ["Alphadream Corporation"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/76bfd8258c3268cff9f505a163d5a167-98.jpg", "descriptions": "In this sequel to Mario & Luigi: Superstar Saga, the brothers travel back in time to retrieve Princess Peach, only to come face to face with baby versions of themselves, the princess and Bowser. Teaming up with their young selves will soon send Mario and Luigi on a quest of lunaticIn this sequel to Mario & Luigi: Superstar Saga, the brothers travel back in time to retrieve Princess Peach, only to come face to face with baby versions of themselves, the princess and Bowser. Teaming up with their young selves will soon send Mario and Luigi on a quest of lunatic proportions as players must control both the adult AND baby versions of the Mushroom Kingdom heroes. Players use the top screen to study the land, keep track of the pair of brothers not under their control or maximize combo moves in battle. With twice the Mario brothers and twice the laughs, this massive side-splitting adventure could only find a home on the dual screens of the Nintendo DS. [Nintendo]… Expand"}, {"name": "Beyond Good & Evil", "details_link": "https://www.metacritic.com/game/playstation-2/beyond-good-evil", "publisher": "Ubisoft", "release_date": "Nov 11 2003", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 86, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/7/401dcf5242d48431179bc2e9c7bd8bf4-98.jpg", "descriptions": "The planet of Hyllis has fallen under siege by a ruthless alien race. Despite the assurances of the Alpha Section defense squad, the war drags on, terrorizing the once-beautiful planet and crushing the faith of the people. From the rubble of a tiny island rises Jade - a rebellious youngThe planet of Hyllis has fallen under siege by a ruthless alien race. Despite the assurances of the Alpha Section defense squad, the war drags on, terrorizing the once-beautiful planet and crushing the faith of the people. From the rubble of a tiny island rises Jade - a rebellious young action reporter left traumatized by a brutal attack. When Jade is hired by the rebel organization IRIS, she learns that the Alpha Sections are secretly trafficking humans to the enemy. Still wary of who to believe, she sets out to expose the gruesome conspiracy and bring proof to her people. Armed with her camera, dai-jo staff, and unflinching resolve, Jade plunges into a sinister web to untangle the truth and restore justice to her planet. But as she earns the trust of her beleaguered people, Jade discovers that sometimes, in order to find the truth, you must look beyond good and evil. [Ubi Soft]… Expand"}, {"name": "Mortal Kombat", "details_link": "https://www.metacritic.com/game/xbox-360/mortal-kombat", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 19 2011", "developers": ["NetherRealm Studios"], "platforms": ["PlayStation 3", "PlayStation Vita", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/170d539fd1d00f4abec0bed10d781346-98.jpg", "descriptions": "Mortal Kombat returns to consoles after a long hiatus featuring a return to the gruesome fatalities."}, {"name": "Call of Duty: Modern Warfare 2", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-modern-warfare-2", "publisher": "Activision", "release_date": "Nov 10 2009", "developers": ["Infinity Ward"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 86, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/8/542bd97847544c3b360a31f7695806a7-98.jpg", "descriptions": "Modern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse. An entirely new gameplay mode which supports 2-player co-operative play online that is unique from the single player storyModern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse. An entirely new gameplay mode which supports 2-player co-operative play online that is unique from the single player story campaign. Special Ops pits players into a gauntlet of time-trial and objective-based missions. Rank-up as players unlock new Special Ops missions, each more difficult. Missions include highlights from the single player campaign, fan favorites from Call of Duty 4: Modern Warfare and all new, exclusive missions. Setting a new bar for online multiplayer, Modern Warfare 2 multiplayer delivers new capabilities, customization, gamestates and modes, including: Create-a-Class Evolved. Secondary Weapons - Machine Pistols, Shotguns, Handguns, Launchers. Riot Shields. Equipment - Throwing Knives, Blast Shield, Tactical Insertion. Perk Upgrades. Bling (Dual Attachments). Customizable Killstreaks - AC130, Sentry Gun, Predator Missile, Counter-UAV, Care Package. Accolades (Post match reports). [Activision]… Expand"}, {"name": "Guitar Hero World Tour", "details_link": "https://www.metacritic.com/game/wii/guitar-hero-world-tour", "publisher": "Activision", "release_date": "Oct 26 2008", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "4  Online", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/2b364180942bd89d0ab668f62776384e-98.jpg", "descriptions": "Guitar Hero World Tour marries Guitar Hero's guitar gameplay, with a cooperative band experience that combines the most advanced wireless instruments with revolutionary new online and offline gameplay modes. The game features a slick newly redesigned guitar, a genuine electronic drum kit andGuitar Hero World Tour marries Guitar Hero's guitar gameplay, with a cooperative band experience that combines the most advanced wireless instruments with revolutionary new online and offline gameplay modes. The game features a slick newly redesigned guitar, a genuine electronic drum kit and a microphone, as well as an innovative Music Studio music creator that lets players compose, record, edit and share their own rock and roll anthems, along with online Band Career and 8-player \"Battle of the Bands.\" Guitar Hero World Tour is comprised entirely of master recordings from some of the greatest classic and modern rock bands of all-time including Ozzy Osbourne, Van Halen, Linkin Park, The Eagles, Sublime and many more. Additionally, the game offers significantly more localized downloadable music than ever before on all of the next-generation consoles. Budding rock stars are also given creative license to fully customize everything from their characters’ appearance and instruments to their band’s logo and album covers. Featuring three drum pads, two raised cymbals and a bass kick pedal, the drum controller combines larger and quieter, velocity-sensitive drum heads with soft rubber construction to deliver authentic bounce back and is easy to set up, move, break down and store. Virtual musicians can live out their rock and roll fantasies by playing either a single instrument, or any combination of instruments, in addition to the full band experience. Guitar Hero World Tour introduces Battle of the Bands mode which allows eight players to join online and challenge each other band-to-band to determine who is the best of the best. In the Band modes, up to four players can jam together, online or off, as they progress through the game, and in single-player Career Mode, players can jam on any of the instruments in branching venue progression enabling them to rock out in the order of their choice. The game's Music Studio lets players express their musical creativity by giving them access to a full compliment of tools to create digital music from scratch, utilizing all of the instruments, and then play their compositions in the game.  Music creators can share their recordings with their friends online through GHTunes where other gamers can download their unique compositions and play them. [Activision]… Expand"}, {"name": "Brothers: A Tale of Two Sons", "details_link": "https://www.metacritic.com/game/xbox-360/brothers-a-tale-of-two-sons", "publisher": "505 Games", "release_date": "Aug  7 2013", "developers": ["Starbreeze"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "genres": ["Action Adventure", "Fantasy", "Fantasy", "Linear"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/94469fed6fa51fc5e45342b8668e5f5a-98.jpg", "descriptions": "Help guide a couple of brothers on a fairy tale journey from Swedish film director, Josef Fares and developer Starbreeze Studios. Control both brothers at the same time as you experience co-op play in single player mode. Solve puzzles, explore varied locations and fight boss battles,Help guide a couple of brothers on a fairy tale journey from Swedish film director, Josef Fares and developer Starbreeze Studios. Control both brothers at the same time as you experience co-op play in single player mode. Solve puzzles, explore varied locations and fight boss battles, controlling one brother with each thumb stick.… Expand"}, {"name": "SoulCalibur III", "details_link": "https://www.metacritic.com/game/playstation-2/soulcalibur-iii", "publisher": "Namco", "release_date": "Oct 25 2005", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/7a7423d877431b124a1ff90d593447c4-98.jpg", "descriptions": "Soul Calibur III offers players unprecedented variety in gameplay modes and fighting styles. Gamers can guide the fate of their favorite character in the narrative Tales of Souls Mode, play head-to-head with a friend in Vs. Mode, create their own custom fighters in Character Creation Mode,Soul Calibur III offers players unprecedented variety in gameplay modes and fighting styles. Gamers can guide the fate of their favorite character in the narrative Tales of Souls Mode, play head-to-head with a friend in Vs. Mode, create their own custom fighters in Character Creation Mode, battle as their custom fighter in a real-time simulation in Chronicles of the Sword Mode, engage in unique and original battles in Soul Arena Mode and even recount the history of the franchise in Museum Mode.  Also, the addition of three new characters to the existing family of classic warriors gives Soul Calibur III a collection of more than 25 playable characters, each with their own unique fighting style. New characters Zasalamel, Tira and Setsuka will engage in combat within all-new stages, further enhancing the game's unmatched epic scope and trademark weapons-based fighting engine. [Namco]… Expand"}, {"name": "NHL 12", "details_link": "https://www.metacritic.com/game/playstation-3/nhl-12", "publisher": "Electronic Arts", "release_date": "Sep 13 2011", "developers": ["Electronic Arts"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/3128de66e27a3f1c97bfb7cbacbfc6f3-98.jpg", "descriptions": "NHL 12 has players try to become the next legend in hockey."}, {"name": "NCAA Football 11", "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-football-11", "publisher": "Electronic Arts", "release_date": "Jul 13 2010", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 86, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/16a727bbff1302a1b8b2377e0b7db73e-98.jpg", "descriptions": "With presentation and gameplay improvements, along with an online-based feature, NCAA Football 11 promises to give players real college offenses that, for the first time , reflect the authentic style of all 120 NCAA FBS schools in-game.  With team-specific pre-game run-outs and ESPN’sWith presentation and gameplay improvements, along with an online-based feature, NCAA Football 11 promises to give players real college offenses that, for the first time , reflect the authentic style of all 120 NCAA FBS schools in-game.  With team-specific pre-game run-outs and ESPN’s broadcast graphics package, NCAA Football 11 attempts to recreate the intensity of college football Saturdays, hoping to achieve all-new levels of quality in presentation and core gameplay by delivering an experience true to your school and providing 120 ways to win. NCAA Football also includes the new Dynasty Wire online feature.  With Dynasty Wire, players create stories that recap their Dynasty game, complete with video and photo highlights, then share the news of the victorious triumph or devastating loss by publishing the story through social networking sites for the world to read. [Electronic Arts]… Expand"}, {"name": "Street Fighter III: Third Strike Online Edition", "details_link": "https://www.metacritic.com/game/xbox-360/street-fighter-iii-third-strike-online-edition", "publisher": "Capcom", "release_date": "Aug 24 2011", "developers": ["Iron Galaxy Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 86, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/67fff69a786dcc28898a83ca473ae5ac-98.jpg", "descriptions": "Street Fighter III: Third Strike Online Edition brings the classic fighting title to PS3 and Xbox 360."}, {"name": "Final Fantasy XII: The Zodiac Age", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-xii-the-zodiac-age", "publisher": "Square Enix", "release_date": "Jul 11 2017", "developers": ["Square Enix"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/780aabe7c76a99b639cb9fa5c91c06e0-98.jpg", "descriptions": "Enter an era of war within the world of Ivalice. The small kingdom of Dalmasca, conquered by the Archadian Empire, is left in ruin and uncertainty. Princess Ashe, the one and only heir to the throne, devotes herself to the resistance to liberate her country. Vaan, a young man who lost hisEnter an era of war within the world of Ivalice. The small kingdom of Dalmasca, conquered by the Archadian Empire, is left in ruin and uncertainty. Princess Ashe, the one and only heir to the throne, devotes herself to the resistance to liberate her country. Vaan, a young man who lost his family in the war, dreams of flying freely in the skies. In a fight for freedom and fallen royalty, join these unlikely allies and their companions as they embark on a heroic adventure to free their homeland.\r Final Fantasy XII: The Zodiac Age improves upon the 2006 classic Final Fantasy XII, now more beautiful and easier to play than ever. The high-definition remaster introduces several modern advancements, including reconstructed battle design and a revamped job system. With newly implemented trophies and share functions, as well as stark visual and sound improvements in true HD for the first time, players both returning and new to the game will experience a grand adventure that spans the world of Ivalice in an entirely fresh and improved way.… Expand"}, {"name": "The Secret of Monkey Island: Special Edition", "details_link": "https://www.metacritic.com/game/pc/the-secret-of-monkey-island-special-edition", "publisher": "LucasArts", "release_date": "Jul 15 2009", "developers": ["LucasArts"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 86, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/8/87b62687b62b06955ec28637e0d2c261-98.jpg", "descriptions": "As ye venture out onto the docks of Melee Island, there'll be a shock to yer system the likes of which you've never seen. The Secret of Monkey Island: Special Edition gives you the world you remember, yet it be shown to ya like only yer imagination could. It seems Guybrush Threepwood, aAs ye venture out onto the docks of Melee Island, there'll be a shock to yer system the likes of which you've never seen. The Secret of Monkey Island: Special Edition gives you the world you remember, yet it be shown to ya like only yer imagination could. It seems Guybrush Threepwood, a young lad wantin' to be a bloodthirsty pirate is back to relive his hunt fo the fabled riches of Monkey Island. Hilarious swashbuckling misadventures: Embark on a bumbling misadventure in an attempt to become the most infamous pirate in the Caribbean, win the heart of the beautiful governor, Elaine Marley, and confront the evil ghost pirate, LeChuck! High-definition graphics: The game is all-new and re-imagined with a contemporary art style, hand-drawn and presented in 1080p. Complete voice over using original Monkey Island franchise cast members brings the story and characters to life like never before. Renewed music score: Enjoy the re-mastered and re-recorded musical score using live instruments. Special Edition and Classic modes: Scene-for-scene hot swap lets you seamlessly transition between Special Edition and Classic modes at anytime during gameplay. Enhanced gameplay: The all-new intuitive game interface and controls provide a more interactive gameplay experience. Hint system: Not sure what to do next? The in-game puzzle hint system keeps the puzzles fresh and fun. [LucasArts]… Expand"}, {"name": "Max Payne 2: The Fall of Max Payne", "details_link": "https://www.metacritic.com/game/pc/max-payne-2-the-fall-of-max-payne", "publisher": "Rockstar Games", "release_date": "Oct 14 2003", "developers": ["Remedy Entertainment"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 86, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/0/6b55c0a2aab980263bdb0fb95e826bbd-98.jpg", "descriptions": "Max Payne 2: The Fall of Max Payne is a violent, film-noir love story for mature audiences. Dark, tragic and intense, the in-depth story is a thrill-ride of shocking twists and revelations. Love hurts. The fans of Max Payne won?t be disappointed. The fierce, yet stylish action sequences andMax Payne 2: The Fall of Max Payne is a violent, film-noir love story for mature audiences. Dark, tragic and intense, the in-depth story is a thrill-ride of shocking twists and revelations. Love hurts. The fans of Max Payne won?t be disappointed. The fierce, yet stylish action sequences and slow-motion gunplay that has become synonymous with Max Payne is back and better than ever. New and enhanced moves and options provide breathtaking cinematic game play. Max Payne 2: The Fall of Max Payne is set to raise the bar on action games all over again. [Rockstar]… Expand"}, {"name": "The Legend of Heroes: Trails from Zero", "details_link": "https://www.metacritic.com/game/switch/the-legend-of-heroes-trails-from-zero", "publisher": "NIS America", "release_date": "Sep 27 2022", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/5296e17d8a3318cd5dbc1ce93a702295-98.jpg", "descriptions": "The Crossbell State, located in western Zemlya--Once the site of fierce territorial battles, it has since developed into one of the continent's leading trade and financial centers.\n\nHowever, pressure from the Erebonian Empire and the Calvard Republic is steadily increasing. While corruptThe Crossbell State, located in western Zemlya--Once the site of fierce territorial battles, it has since developed into one of the continent's leading trade and financial centers.However, pressure from the Erebonian Empire and the Calvard Republic is steadily increasing. While corrupt officials from both sides remain locked in political disputes, the mafia and underground criminal organizations are preparing to start a war.In the midst of all this chaos, the Crossbell Police Department has lost the trust of its people.Among them are Lloyd Bannings, a rookie agent,Elie MacDowell, granddaughter of Crossbell's mayor,Tio Plato, a young sorcereress who wields an orbal staff,and Randy Orlando, a former security guard.The foursome are assigned to a new department, the Special Support Section, where they are left with no choice but to join forces in the face of adversity.This is a story about four unlikely heroes fighting to overcome the walls defining their way of life.… Expand"}, {"name": "Star Wars Pinball", "details_link": "https://www.metacritic.com/game/switch/star-wars-pinball", "publisher": "Zen Studios", "release_date": "Sep 13 2019", "developers": ["Zen Studios"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Wii U", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Pinball"], "meta_score": 86, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/c67cec310add94160f0a69cc265e9615-98.jpg", "descriptions": "May the Force be with you! Use the Force to guide the silver ball! Will you choose the Light or Dark side?\r Feel the power of the Force in Star Wars Pinball! Set in a galaxy far, far away, each of the tables in this brand new pack lets you interact with the most iconic characters, andMay the Force be with you! Use the Force to guide the silver ball! Will you choose the Light or Dark side?\r Feel the power of the Force in Star Wars Pinball! Set in a galaxy far, far away, each of the tables in this brand new pack lets you interact with the most iconic characters, and relive the greatest moments of the Star Wars universe: Star Wars: Episode V The Empire Strikes Back, Star Wars: The Clone Wars, and Boba Fett. May the Force be with you!\r Influence the Balance of the Force! Join either the Light Side or Dark Side and take part in the epic struggle by simply posting scores for your chosen side!\r Full list of features:\r-Three brand new tables: Star Wars: Episode V The Empire Strikes Back, Boba Fett, and The Clone Wars\r-Compete against other players to achieve the highest ForceScore, and team up with your friends to increase your TeamScore\r-Hotseat multiplayer mode\r-New tables released regularly through the Nintendo eShop… Expand"}, {"name": "Homeworld Remastered Collection", "details_link": "https://www.metacritic.com/game/pc/homeworld-remastered-collection", "publisher": "Gearbox Software", "release_date": "Feb 25 2015", "developers": ["Gearbox Software"], "platforms": "PC", "genres": ["Miscellaneous", "Compilation"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/7d7dd95c43f31353224cb9d2da7c5c7d-98.jpg", "descriptions": "Assume control of your fleet and assemble an armada across more than thirty single-player missions. Choose unit types, fleet formations and flight tactics for each strategic situation."}, {"name": "CrossCode", "details_link": "https://www.metacritic.com/game/pc/crosscode", "publisher": "Deck 13", "release_date": "Sep 20 2018", "developers": ["Radical Fish Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/80aaea73f8f32727e31d40c1038fb7f5-98.jpg", "descriptions": "A retro-inspired 2D Action RPG set in the distant future. CrossCode combines 16-bit SNES-style graphics with butter-smooth physics, a fast-paced combat system, and engaging puzzle mechanics, served with a gripping sci-fi story."}, {"name": "Galactic Civilizations II: Dread Lords", "details_link": "https://www.metacritic.com/game/pc/galactic-civilizations-ii-dread-lords", "publisher": "Stardock", "release_date": "Feb 21 2006", "developers": ["Stardock"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "4X"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/62292488057739a1835ef2201010867a-98.jpg", "descriptions": "Galactic Civilizations II: Dread Lords is the sequel to Stardock's hit turn-based strategy game. Galactic Civilizations is a strategy game that takes place in the distant future where mankind has become a space-faring civilization and now must contend with other galactic powers who striveGalactic Civilizations II: Dread Lords is the sequel to Stardock's hit turn-based strategy game. Galactic Civilizations is a strategy game that takes place in the distant future where mankind has become a space-faring civilization and now must contend with other galactic powers who strive for domination in the galaxy. The basic concept behind Galactic Civilizations II is the same as the first one -- to build an interstellar civilization. [Strategy First]… Expand"}, {"name": "Planet Puzzle League", "details_link": "https://www.metacritic.com/game/ds/planet-puzzle-league", "publisher": "Nintendo", "release_date": "Jun  4 2007", "developers": ["Intelligent Systems"], "platforms": "DS", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/001c6b22615f5c006f1812d1f8cfda9d-98.jpg", "descriptions": "(Also known as \"Panel De Pon DS\")  Use the DS stylus to grab panels and slide them left and right. If you match three or more panels of the same color, they will vanish. Form chains and combos to create cascading waterfalls of panels to rack up high scores. The basic game play is similar to(Also known as \"Panel De Pon DS\")  Use the DS stylus to grab panels and slide them left and right. If you match three or more panels of the same color, they will vanish. Form chains and combos to create cascading waterfalls of panels to rack up high scores. The basic game play is similar to the classics Tetris Attack and Pokémon Puzzle League, but the touch screen gameplay adds a new dimension of fun, giving Planet Puzzle League a bright new feel. Features Six single-player modes: Puzzle, Endless, Time Attack, Garbage, Clear, and Vs. Computer. Don’t have much time? Play three two-minute games in unique Daily mode. Track your progress over weeks and months. Dozens of tutorials and demos teach you the ins-and-outs of this incredibly deep game. Three difficulty levels:. Easy for beginners, normal for veterans, brutal for experts. Two can compete head-to-head over the Nintendo Wi-Fi Connection. With the Nintendo DS Headset accessory (sold separately) you can even chat with your friend as you polish your puzzle skills. Up to four players can compete in three local wireless modes. You can also send a single-player demo to a friend via local wireless. Orient the game the way you like: vertically or horizontally! You can even configure for left- or right-handed play. [Nintendo]… Expand"}, {"name": "Wolfenstein II: The New Colossus", "details_link": "https://www.metacritic.com/game/pc/wolfenstein-ii-the-new-colossus", "publisher": "Bethesda Softworks", "release_date": "Oct 27 2017", "developers": ["MachineGames"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 86, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/ee9c1910de7c9c4f1c10ec69259382ed-98.jpg", "descriptions": "Wolfenstein II: The New Colossus is the highly anticipated sequel to the critically acclaimed, Wolfenstein: The New Order developed by the award-winning studio MachineGames. An exhilarating adventure brought to life by the industry-leading id Tech 6, Wolfenstein II sends players toWolfenstein II: The New Colossus is the highly anticipated sequel to the critically acclaimed, Wolfenstein: The New Order developed by the award-winning studio MachineGames. An exhilarating adventure brought to life by the industry-leading id Tech 6, Wolfenstein II sends players to Nazi-controlled America on a mission to recruit the boldest resistance leaders left. Fight the Nazis in iconic American locations, equip an arsenal of badass guns, and unleash new abilities to blast your way through legions of Nazi soldiers in this definitive first-person shooter. America, 1961. The Nazis maintain their stranglehold on the world. You are BJ Blazkowicz, aka Terror-Billy, member of the Resistance, scourge of the Nazi empire, and humanitys last hope for liberty. Only you have the guts, guns, and gumption to return stateside, kill every Nazi in sight, and spark the second American Revolution.… Expand"}]