[{"name": "Resident Evil 0: HD Remaster", "details_link": "https://www.metacritic.com/game/xbox-one/resident-evil-0-hd-remaster", "publisher": "Capcom", "release_date": "Jan 19 2016", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/60e3b127f29cc39dbd5e08b5430f6307-98.jpg", "descriptions": "Resident Evil 0 reveals the truth behind the Mansion Incident, the catalyst for the entire storyline of the Resident Evil series. This remastered version takes the story and gameplay of the original and adds stunning HD graphics, 5.1 channel surround sound, optional modernized controls andResident Evil 0 reveals the truth behind the Mansion Incident, the catalyst for the entire storyline of the Resident Evil series. This remastered version takes the story and gameplay of the original and adds stunning HD graphics, 5.1 channel surround sound, optional modernized controls and widescreen TV compatibility. Get ready to discover the terrible secrets lurking in the origins of evil.… Expand"}, {"name": "NASCAR Heat 5", "details_link": "https://www.metacritic.com/game/xbox-one/nascar-heat-5", "publisher": "Motorsport Games", "release_date": "Jul  7 2020", "developers": ["704Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 40 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/3c46d397b8eb53a47469ab7375e0d742-98.jpg", "descriptions": "NASCAR heat 5, the official video game of the world's most popular stockcar racing Series, puts you behind the wheel of these incredible racing machines and challenges you to become the 2020 NASCAR Cup Series champion. Features all the official teams, drivers and cars from the three NASCARNASCAR heat 5, the official video game of the world's most popular stockcar racing Series, puts you behind the wheel of these incredible racing machines and challenges you to become the 2020 NASCAR Cup Series champion. Features all the official teams, drivers and cars from the three NASCAR national series as well as the Xtreme dirt Tour, racing on 38 Authentic tracks. All official 2020 NASCAR tracks, teams, cars, drivers and schedule from four racing Series - the 2020 NASCAR Cup Series, NASCAR XFINITY series, NASCAR gander rv & outdoors Truck series and fan-favorite, the extreme dirt Tour. Split screen multiplayer allows you to race against your friends on the same screen.… Expand"}, {"name": "My Memory of Us", "details_link": "https://www.metacritic.com/game/xbox-one/my-memory-of-us", "publisher": "IMGN.PRO", "release_date": "Oct 10 2018", "developers": ["Crunching Koalas", "Juggler Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/b2a5e67c6c8d0e216290f964456dde0b-98.jpg", "descriptions": "My Memory of Us is a reminiscence of a friendship between a boy and a girl. A friendship made during tough times. Times of terror, pain, and exclusion in a world where people were forced to live in two artificially detached worlds."}, {"name": "Farming Simulator 17", "details_link": "https://www.metacritic.com/game/playstation-4/farming-simulator-17", "publisher": "Focus Home Interactive", "release_date": "Oct 25 2016", "developers": ["Giants Software", "Maximum Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/5a5358256a4f3d391dfcc92ed369fb42-98.jpg", "descriptions": "Assume the role of a modern farmer in Farming Simulator 17. Immerse yourself in an open world loaded with a harvest of new content. Explore farming possibilities over hundreds of acres of land, including a detailed new North American environment. [Playstation.com]"}, {"name": "I Am Alive", "details_link": "https://www.metacritic.com/game/xbox-360/i-am-alive", "publisher": "Ubisoft", "release_date": "Mar  7 2012", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/ecd0de8b91e7604a806fce29da7c4053-98.jpg", "descriptions": "One year after a worldwide cataclysmic event that wiped out most of the human race, a man struggles for his survival in a desolate city as he tries to reunite with his long lost family. In this post-apocalyptic tale, there are no supernatural threats, just an everyman who faces a decayingOne year after a worldwide cataclysmic event that wiped out most of the human race, a man struggles for his survival in a desolate city as he tries to reunite with his long lost family. In this post-apocalyptic tale, there are no supernatural threats, just an everyman who faces a decaying and hazardous world and humanity’s darkest inclinations. Will you cling to your humanity and help strangers or are you ready to sacrifice others in order to survive? [Ubisoft]… Expand"}, {"name": "Conan", "details_link": "https://www.metacritic.com/game/xbox-360/conan", "publisher": "THQ", "release_date": "Oct 23 2007", "developers": ["Nihilistic"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/a7e809d5fcaa02438d75f2990a6152f4-98.jpg", "descriptions": "Conan is an action adventure game featuring a story of epic brutality, sheer evil and visceral combat. Players follow the journey of Conan the Cimmerian as he fights a vicious battle against a variety of enemies and an elusive power that threatens to consume the Hyborian world. Playing asConan is an action adventure game featuring a story of epic brutality, sheer evil and visceral combat. Players follow the journey of Conan the Cimmerian as he fights a vicious battle against a variety of enemies and an elusive power that threatens to consume the Hyborian world. Playing as Conan, players take advantage of a deep and gratifying combat system that offers a variety of deadly weapons, fighting styles and interactive environments to battle hordes of enemies. In addition, the Conan harnesses next generation hardware to deliver a cinematic game play experience, complete with special effects, lighting and a powerful, epic soundtrack, to capture the essence of the Conan universe. [THQ]… Expand"}, {"name": "The Bureau: XCOM Declassified", "details_link": "https://www.metacritic.com/game/playstation-3/the-bureau-xcom-declassified", "publisher": "2K Games", "release_date": "Aug 20 2013", "developers": ["2K Marin"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Sci-Fi", "Sci-Fi", "Tactical", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/839b8360e93ffd16ff70d245798a6cf4-98.jpg", "descriptions": "It's 1962. John F. Kennedy is the U.S. President and the Cold War has the nation gripped with fear – but a far more viscous and insidious enemy than communism is threatening America. Known only to a scant few, a covet government unit called The Bureau begins investigating and concealing aIt's 1962. John F. Kennedy is the U.S. President and the Cold War has the nation gripped with fear – but a far more viscous and insidious enemy than communism is threatening America. Known only to a scant few, a covet government unit called The Bureau begins investigating and concealing a series of mysterious attacks by an alien enemy. As special agent William Carter, you make the decisions, pull the trigger and lead your squad in a third-person tactical shooter set within a high-stakes, covert war to defend the human race. The Bureau’s mission is clear – survive, adapt and overcome the enemy threat (Heartbreak Ridge-style) to protect the citizens from the truth.  … Expand"}, {"name": "World of Warplanes", "details_link": "https://www.metacritic.com/game/pc/world-of-warplanes", "publisher": "Wargaming.net", "release_date": "Jul  2 2013", "developers": ["Wargaming.net", "Persha Studia"], "platforms": "PC", "num_players": "Up to 30 ", "genres": ["Action", "Simulation", "Shooter", "Flight", "Shooter", "Third-Person", "Combat", "Tactical", "Historic", "Historic"], "meta_score": 69, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/5/888c3078f1626df07aa4a22909d7e535-98.jpg", "descriptions": "World of Warplanes is a stand alone Free to play game being developed by the team that created the award winning and highly acclaimed game, World of Tanks. World of Tanks (www.WorldofTanks.com) is a team-based massively multiplayer online game dedicated to armored warfare in the mid-20thWorld of Warplanes is a stand alone Free to play game being developed by the team that created the award winning and highly acclaimed game, World of Tanks. World of Tanks (www.WorldofTanks.com) is a team-based massively multiplayer online game dedicated to armored warfare in the mid-20th century. An advanced system of vehicle upgrade and development allows you to try out the vehicles and weapons featured in the game. Whether you prefer to exhaust your foes with fast and maneuverable light tanks, punch deep into enemy lines with all-purpose medium tanks, use the power of heavy tanks to eliminate opposing forces, or become a high-powered sniper using long-range artillery, each unit type is extremely lethal and effective when commanded by a true tank ace.… Expand"}, {"name": "The Matrix: Path of Neo", "details_link": "https://www.metacritic.com/game/playstation-2/the-matrix-path-of-neo", "publisher": "Atari", "release_date": "Nov  7 2005", "developers": ["Shiny Entertainment"], "platforms": "PlayStation 2", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/0f72f429f3319ef39c11f1e14141f8c1-98.jpg", "descriptions": "Set in the Matrix universe, The Matrix: Path of Neo enables players to play as Neo, the central character, and relive his most important and memorable scenarios from the complete film trilogy, including the original film, \"The Matrix.\" Throughout the game, the path the player takes toSet in the Matrix universe, The Matrix: Path of Neo enables players to play as Neo, the central character, and relive his most important and memorable scenarios from the complete film trilogy, including the original film, \"The Matrix.\" Throughout the game, the path the player takes to resolve each scenario and the resulting consequences are scripted and directed by the Wachowski Brothers. The likenesses of all of the films' key actors -- including Keanu Reeves (\"Neo\"), Laurence Fishburne (\"Morpheus\"), Carrie-Ann Moss (\"Trinity), and Hugo Weaving (\"Agent Smith\") -- are featured in the game, which also includes footage from all three feature films, as well as \"The Animatrix.\" [Atari]… Expand"}, {"name": "Phantasy Star Portable 2", "details_link": "https://www.metacritic.com/game/psp/phantasy-star-portable-2", "publisher": "Sega", "release_date": "Sep 13 2010", "developers": ["Alfa System"], "platforms": "PSP", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/a35bc56ca1c1412fd571d3101804b75f-98.jpg", "descriptions": "Explore the universe of SEGA's critically acclaimed and best selling RPG franchise in this second installment of the Phantasy Star portable series."}, {"name": "Jack Keane", "details_link": "https://www.metacritic.com/game/pc/jack-keane", "publisher": "Strategy First", "release_date": "Apr 15 2008", "developers": ["Legacy Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/caa07ad0d3ddb9ea9183c6ad7f105485-98.jpg", "descriptions": "Colonial England. Under a certain amount of… duress… Jack takes on a job which will not only cause him a great deal of trouble, but also bring to light the answer to a mystery out of his distant past. A lack of money leads Jack to accept a charter to take a British secret agent to mysteriousColonial England. Under a certain amount of… duress… Jack takes on a job which will not only cause him a great deal of trouble, but also bring to light the answer to a mystery out of his distant past. A lack of money leads Jack to accept a charter to take a British secret agent to mysterious “Tooth Island”. When Jack’s ship shatters on the mysterious island’s cliffs on arrival and the secret agent quickly becomes a meal for a monster in the jungle, Jack is soon left to cope with the situation on his own. “Tooth Island” is ruled by the strange Doctor T, who is cultivating man-eating plants and has his own dastardly plans for the British Empire. And why does he seem to know Jack, who can’t remember ever having been on Tooth Island? What are Doctor T's plans? And what does he know about Jack’s past? And then there’s the young and naive Amanda, who is filled by an almost fanatical drive to prove her worth. In the beginning the young lady is employed by Doctor T, and part of her task is to track Jack down and take him prisoner. It doesn’t take long before she begins to wonder if she is really on the right side, or if she shouldn’t join her opponent, the charming Captain Jack, instead. A hair-raising hunt across the length and breadth of the dangerous island finally airs the mystery surrounding Jack’s past and leads to a spectacular showdown with a dark and deadly enemy and his nefarious henchmen. [10Tactle Studios]… Expand"}, {"name": "Olympic Games Tokyo 2020: The Official Video Game", "details_link": "https://www.metacritic.com/game/playstation-4/olympic-games-tokyo-2020-the-official-video-game", "publisher": "Sega", "release_date": "Jun 22 2021", "developers": ["Sega"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Athletics"], "meta_score": 69, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/6/574ae8603f3c2059eb752f8042ec0ab0-98.jpg", "descriptions": "This is the official video game for the Olympics Games Tokyo 2020. It includes more than 15 Olympic Games events such as Athletics, Aquatics and Ballgames. The simple gameplay controls and the deep game system allow every player to enjoy the Olympic events. Every event has onlineThis is the official video game for the Olympics Games Tokyo 2020. It includes more than 15 Olympic Games events such as Athletics, Aquatics and Ballgames. The simple gameplay controls and the deep game system allow every player to enjoy the Olympic events. Every event has online multiplayer, so you can play against family, friends and other players from all over the world.… Expand"}, {"name": "Arslan: The Warriors of Legend", "details_link": "https://www.metacritic.com/game/playstation-4/arslan-the-warriors-of-legend", "publisher": "Koei Tecmo Games", "release_date": "Feb  9 2016", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 3", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/e9be1768d181edf9aea3d8a02a294458-98.jpg", "descriptions": "A tactical action title based on the epic novel, manga, and anime IP The Heroic Legend of Arslan. It recounts the story of the young crown prince of Pars, Arslan, as he is forced out of his kingdom when his father, the King, is betrayed and defeated and his domain conquered. Arslan and hisA tactical action title based on the epic novel, manga, and anime IP The Heroic Legend of Arslan. It recounts the story of the young crown prince of Pars, Arslan, as he is forced out of his kingdom when his father, the King, is betrayed and defeated and his domain conquered. Arslan and his few companions need to re-assemble an army and fight against overwhelming odds to regain his throne and liberate his kingdom. … Expand"}, {"name": "Aliens: Fireteam Elite", "details_link": "https://www.metacritic.com/game/pc/aliens-fireteam-elite", "publisher": "Cold Iron Studios", "release_date": "Aug 24 2021", "developers": ["Cold Iron Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/f5240b269f735a7b55c1db6d07baa0c2-98.jpg", "descriptions": "2202. A mysterious distress call reroutes your Marine Assault Unit to LV-895 in the outer colonies, where deadly Xenomorph legions, hidden corporate secrets, and ancient alien ruins await your arrival. Set in the iconic Alien universe, Aliens: Fireteam is a cooperative third-person survival2202. A mysterious distress call reroutes your Marine Assault Unit to LV-895 in the outer colonies, where deadly Xenomorph legions, hidden corporate secrets, and ancient alien ruins await your arrival. Set in the iconic Alien universe, Aliens: Fireteam is a cooperative third-person survival shooter that drops your fireteam of hardened marines into a desperate fight to contain the Xenomorph threat. Face off against waves of terrifying Xenomorph and Weyland-Yutani Synthetic foes alongside two players or AI teammates, as you and your fireteam desperately fight your way through four unique campaigns that introduce new storylines to the Alien universe. Create and customize your own Colonial Marine, choosing from an extensive variety of classes, weapons, gear and perks, battling overwhelming odds in this heart-pounding survival shooter experience.\r THE ULTIMATE HUNT\rPlay a pivotal role in the epic events that occur 23 years after the original Alien trilogy as a Colonial Marine stationed aboard the USS Endeavor, battling terrifying Xenomorph threats.\r SURVIVE THE HIVE\rFace overwhelming odds against over 20 enemy types, including 11 different Xenomorphs along the evolutionary scale from Facehuggers to Praetorians, each designed with their own intelligence to ambush, outsmart and eviscerate vulnerable marines.\r CUSTOMIZE YOUR FIRETEAM\rChoose from five unique classes - Gunner, Demolisher, Technician, Doc and Recon - each with their own special abilities and character perks. Utilize an extensive arsenal of 30+ weapons and 70+ mods/attachments in your effort to eradicate the Alien threat.… Expand"}, {"name": "Silent Line: Armored Core", "details_link": "https://www.metacritic.com/game/playstation-2/silent-line-armored-core", "publisher": "Agetec Inc.", "release_date": "Jul 17 2003", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 69, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/6f999a867ee11c61cecd3c0e733dd76f-98.jpg", "descriptions": "Earth has seen the collapse of the machine-controlled society and the return of humans to the surface of the planet. Explorers have uncovered a previously unknown mega-city that is well protected from scouting incursions. All attempts at penetrating the border have been met with destructionEarth has seen the collapse of the machine-controlled society and the return of humans to the surface of the planet. Explorers have uncovered a previously unknown mega-city that is well protected from scouting incursions. All attempts at penetrating the border have been met with destruction as the line literally goes silent. Once again the call goes out to the Ravens, mercenaries hired by the government to break through the silent line and discover the truth behind the enigma.  [Agetec]… Expand"}, {"name": "Curious Expedition 2", "details_link": "https://www.metacritic.com/game/switch/curious-expedition-2", "publisher": "Thunderful", "release_date": "Aug 11 2021", "developers": ["Maschinen-Mensch"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "Turn-Based", "General"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/8f1f424874076d1f0fc049b9c65f82ef-98.jpg", "descriptions": "Curious Expedition 2 is a turn-based narrative roguelike that requires players to manage their resources and party members to keep insanity at bay and find glory.A grand discovery has been made: mysterious islands have begun to appear and vanish from the oceans as if by magic. The greatCurious Expedition 2 is a turn-based narrative roguelike that requires players to manage their resources and party members to keep insanity at bay and find glory.A grand discovery has been made: mysterious islands have begun to appear and vanish from the oceans as if by magic. The great Explorer Clubs are funding expeditions to these strange islands to bring treasures back for the 1889 World's Fair in Paris. Are you bold enough to join the adventure?… Expand"}, {"name": "Bladed Fury", "details_link": "https://www.metacritic.com/game/switch/bladed-fury", "publisher": "PM Studios Inc.", "release_date": "Mar 25 2021", "developers": ["NExT Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/c0c6102220137f49d6472afd10225cfe-98.jpg", "descriptions": "Bladed FURY is a classic 2D action game, based on Chinese mythology with an Accompanying traditional art style and sound design, but with a Dash of surrealism added to the mix. Featuring a fluid combat experience, a high-octane Combo system, and a plethora of ancient enemies and deities toBladed FURY is a classic 2D action game, based on Chinese mythology with an Accompanying traditional art style and sound design, but with a Dash of surrealism added to the mix. Featuring a fluid combat experience, a high-octane Combo system, and a plethora of ancient enemies and deities to destroy, bladed FURY is a truly addictive action game. At the Beginning of the warring States period, than, an officer under Duke Kang of qi, set a Trap that killed the Duke, exiled ji, the younger Princess, and put shu, the Elder Princess, under house arrest. This event established the tian family as the ruler of qi. Ji tried to seek justice, but failed repeatedly. During her journey, she encountered ancient deities like hou yi and jingwei, who helped her obtain the powers of soul slivers, and eventually returned to the palace to finish what she started. As the dust settled, ji realized this was the beginning of a new world. … Expand"}, {"name": "Football Manager 2019 Touch", "details_link": "https://www.metacritic.com/game/switch/football-manager-2019-touch", "publisher": "Sega", "release_date": "Dec  6 2018", "developers": ["Sega"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Sports", "Team", "Soccer", "Management"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/4517b381a7e655d3af1fb53056617780-98.jpg", "descriptions": null}, {"name": "Megaquarium", "details_link": "https://www.metacritic.com/game/pc/megaquarium", "publisher": "Twice Circled", "release_date": "Sep 13 2018", "developers": ["Twice Circled"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/75fb93ca740999e1e1a2e5f6dfd24e14-98.jpg", "descriptions": "A theme park management tycoon game with an aquatic twist. Design your displays, look after your fish, manage your staff and keep your guests happy. It's all in a day's work as the curator of your very own Megaquarium."}, {"name": "FOX n FORESTS", "details_link": "https://www.metacritic.com/game/pc/fox-n-forests", "publisher": "EuroVideo Medien", "release_date": "May 17 2018", "developers": ["Bonus Level Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/16e6f37b27818f57a4b912b21123a0e9-98.jpg", "descriptions": "Fox n Forests is a 2D action platformer with RPG and puzzle elements inspired by the glorious days of 16-bit! Switch between various seasons on the fly, shoot and slash with your magic melee crossbow and snatch loot to unveil the mystery of the 5th seasons."}, {"name": ".hack//G.U. Last Recode", "details_link": "https://www.metacritic.com/game/pc/hackgu-last-recode", "publisher": "Bandai Namco Games", "release_date": "Nov  3 2017", "developers": ["CyberConnect2"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/3c39ccdfde2f2c1681d2ed15edf2c586-98.jpg", "descriptions": ".hack//G.U. is back! Log back into the .hack//G.U. trilogy and return to \"The World,\" as Haseo tracks down Tri-Edge in .hack//G.U. Last Recode, now with enhanced graphics, improved gameplay, and brand new modes! This collection includes all 3 original .hack//G.U. titles, Rebirth, Reminisce,.hack//G.U. is back! Log back into the .hack//G.U. trilogy and return to \"The World,\" as Haseo tracks down Tri-Edge in .hack//G.U. Last Recode, now with enhanced graphics, improved gameplay, and brand new modes! This collection includes all 3 original .hack//G.U. titles, Rebirth, Reminisce, and Redemption, all fully restored and remastered for PS4.Immerse yourself in \"The World,\" a MMORPG, and find out what is real and what is reality in .hack//G.U. Set in 2017, years after the events of the first .hack series, \"The World\" has now been rebuilt. Follow Haseo as logs into \"The World\" and hunts PKs (Player Killers), in order to gain strength and track down Tri-Edge, a strong PK who attacked his friend, Shino, in the game and put her into a coma in real life. Relive the drama and epic battles in 1080p and 60fps, and improved battle balance and pacing for the definitive .hack//G.U. experience.… Expand"}, {"name": "The Legend of Kusakari", "details_link": "https://www.metacritic.com/game/3ds/the-legend-of-kusakari", "publisher": "Nnooo", "release_date": "Aug 25 2016", "developers": ["Librage"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/9aff111beac2fded8d6a8dceb54b352d-98.jpg", "descriptions": "Help the heroes and CUT that GRASS!\r You know what's the worst thing ever? Fighting slimes and dragons knee-deep in grass and weeds.\r\n\r\nWell if Kusakari has anything to do with it, it wont be that way for long. Get your scythe sharpened and jump into this quirky Japanese adventure puzzleHelp the heroes and CUT that GRASS!\r You know what's the worst thing ever? Fighting slimes and dragons knee-deep in grass and weeds.\r Well if Kusakari has anything to do with it, it wont be that way for long. Get your scythe sharpened and jump into this quirky Japanese adventure puzzle game. Slice through over 50 levels of grass-filled action and help those heroes save the kingdom, in battle grounds fit to have a picnic on!\r Up to the challenge? Compete for the most grass cut in the endless grass cutting competion and record your best cut in the online leaderboards!… Expand"}, {"name": "FIFA Manager 13", "details_link": "https://www.metacritic.com/game/pc/fifa-manager-13", "publisher": "Electronic Arts", "release_date": "Oct 25 2012", "developers": ["EA Sports"], "platforms": "PC", "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 69, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/9157c897e8fd927aaa8334ff4280a6d3-98.jpg", "descriptions": null}, {"name": "Mario Super Sluggers", "details_link": "https://www.metacritic.com/game/wii/mario-super-sluggers", "publisher": "Nintendo", "release_date": "Aug 25 2008", "developers": ["Namco Bandai Games"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Team", "Baseball", "Arcade", "Arcade"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/d5605bad5d44a1c9f42e7bcf91cbb876-98.jpg", "descriptions": "In the same spirit as other sports-themed Mario games on Wii, Mario Super Sluggers blends richly interactive baseball action with eccentric characters and elements from across the popular Mario universe. Players can swing the wireless Wii Remote just like a real bat or wave it toward theIn the same spirit as other sports-themed Mario games on Wii, Mario Super Sluggers blends richly interactive baseball action with eccentric characters and elements from across the popular Mario universe. Players can swing the wireless Wii Remote just like a real bat or wave it toward the plate to deliver a masterful pitch, enjoying the same intuitive, easy-to-learn controls that helped make Wii Sports a living room hit. With Mario and his unpredictable pals filling out the roster, imagination and active-play innovation are sure to dominate the diamond in this lively title. [Nintendo]… Expand"}, {"name": "Enemy Territory: Quake Wars", "details_link": "https://www.metacritic.com/game/xbox-360/enemy-territory-quake-wars", "publisher": "Activision", "release_date": "May 27 2008", "developers": ["Nerve Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/cb54c8e1184cd10c8ae72decf183980b-98.jpg", "descriptions": "In this epic multiplayer-focused game, players can choose to defend humanity as a part of the Global Defense Force (GDF) or destroy it as a merciless Strogg alien invader. Players battle as one of five unique classes in either the conventionally armed GDF army or the futuristic StroggIn this epic multiplayer-focused game, players can choose to defend humanity as a part of the Global Defense Force (GDF) or destroy it as a merciless Strogg alien invader. Players battle as one of five unique classes in either the conventionally armed GDF army or the futuristic Strogg invasion force, each outfitted with specialist weapons and combat hardware. In this adrenaline pumping fight for survival, warring forces utilize a variety of different vehicles, deployable structures, and defense systems including quad-bikes, tanks, and alien walkers for epic ground assaults; or helicopters and anti-gravity ships to unleash airborne attacks. Throughout each battle, teams establish bases, deploy defense structures, artillery, radar, and advanced forward-command systems into enemy territory while constructing and demolishing obstacles to speed progress and gain a tactical advantage over the opponent. Enemy Territory: Quake Wars features 16-player battles on the console systems, delivering the ultimate team-and objective-based multiplayer experience. [Activision/id Software]… Expand"}, {"name": "NFL Head Coach", "details_link": "https://www.metacritic.com/game/xbox/nfl-head-coach", "publisher": "EA Sports", "release_date": "Jun 20 2006", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Football", "Management"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/8b5f844eac10b1666ee48405928194df-98.jpg", "descriptions": "NFL Head Coach reinvents football gaming by introducing the first 3D strategy sports game that challenges gamers to build and manage every aspect of a football team from the ground up. A simple conversation system and an engaging 3D graphical interface allow users to immerse themselves intoNFL Head Coach reinvents football gaming by introducing the first 3D strategy sports game that challenges gamers to build and manage every aspect of a football team from the ground up. A simple conversation system and an engaging 3D graphical interface allow users to immerse themselves into the lives of an NFL head coach. As head coach, you develop a team strategy, execute it on and off the field, and try to build a winning organization year after year. Your status as a coaching legend will rise and fall based on all of your actions as you strive to become the greatest head coach of all time. Behind the desk, on the practice field, or while wearing the headset on game days, take the reins of your favorite NFL team and lead it to victory.… Expand"}, {"name": "Moons of Madness", "details_link": "https://www.metacritic.com/game/pc/moons-of-madness", "publisher": "Funcom", "release_date": "Oct 22 2019", "developers": ["Rock Pocket Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/cb715b61bc985caf847587937f7f1a8a-98.jpg", "descriptions": "Moons of Madness is a first-person, story-driven cosmic horror game where the scientific exploration of Mars meets the supernatural dread of Lovecraft."}, {"name": "Brain Age: Concentration Training", "details_link": "https://www.metacritic.com/game/3ds/brain-age-concentration-training", "publisher": "Nintendo", "release_date": "Feb 10 2013", "developers": ["Nintendo"], "platforms": "3DS", "genres": ["Edutainment", "Miscellaneous", "Edutainment"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/adf8239fbf7fd6c31962755a7b0ed019-98.jpg", "descriptions": "(Also known as \"Dr. Kawashima's Devilish Brain Training: Can You Stay Focused?\")Brain Age: Concentration Training offers newly designed training exercises that will challenge players with activities to help improve their concentration skills and the ability to access their short term memory."}, {"name": "Duel Masters: Sempai Legends", "details_link": "https://www.metacritic.com/game/game-boy-advance/duel-masters-sempai-legends", "publisher": "Atari", "release_date": "Jun  1 2004", "developers": ["Mistic Software"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 69, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/7383a0d10ef932cfad1dd55b51d21fcf-98.jpg", "descriptions": "Based on the Duel Masters Trading Card game in Japan, Duel Masters: Sempai Legends puts you in the role of a kohai (junior duelist). Your grandfather, a great Sempai (senior duelist), gives you a valuable Duel Masters card, which is soon stolen by a mysterious man. Now it is up to you toBased on the Duel Masters Trading Card game in Japan, Duel Masters: Sempai Legends puts you in the role of a kohai (junior duelist). Your grandfather, a great Sempai (senior duelist), gives you a valuable Duel Masters card, which is soon stolen by a mysterious man. Now it is up to you to travel to nearby towns and villages in hopes of regaining the stolen property. Along the way, you'll face many opponents in Duel Masters tournaments with the hope of one day becoming a professional Duelist.… Expand"}, {"name": "LEGO Worlds", "details_link": "https://www.metacritic.com/game/xbox-one/lego-worlds", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar  7 2017", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Action Adventure", "Sandbox"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/27402d70be25b92815d2dc178f9a0321-98.jpg", "descriptions": "LEGO Worlds is an open environment of procedurally-generated Worlds made entirely of LEGO bricks which you can freely manipulate and dynamically populate with LEGO models. Create anything you can imagine one brick at a time, or use large-scale landscaping tools to create vast mountain rangesLEGO Worlds is an open environment of procedurally-generated Worlds made entirely of LEGO bricks which you can freely manipulate and dynamically populate with LEGO models. Create anything you can imagine one brick at a time, or use large-scale landscaping tools to create vast mountain ranges and dot your world with tropical islands. Drop in prefabricated structures to build and customize any world to your liking. Explore using helicopters, dragons, motorbikes or even gorillas and unlock treasures that enhance your gameplay. Watch your creations come to life through characters and creatures that interact with you and each other in unexpected ways. In LEGO Worlds, anything is possible!… Expand"}, {"name": "Assassin's Creed Valhalla: The Siege of Paris", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-valhalla-the-siege-of-paris", "publisher": "Ubisoft", "release_date": "Aug 12 2021", "developers": ["Ubisoft Singapore"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action Adventure", "Open-World"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/935ed7fe727d0ce1c6107b00bdb7d6c7-98.jpg", "descriptions": "The Siege of Paris sees Eivor embark upon a new series of quests in Francia, the largest of the post-Roman barbarian kingdoms in Western Europe. New weapons, abilities, gear, and skills are all be up for grabs, and Infiltration Missions returns as well, enabling players to determine exactlyThe Siege of Paris sees Eivor embark upon a new series of quests in Francia, the largest of the post-Roman barbarian kingdoms in Western Europe. New weapons, abilities, gear, and skills are all be up for grabs, and Infiltration Missions returns as well, enabling players to determine exactly how they go about murdering their assigned targets.… Expand"}, {"name": "Game of Thrones: Episode Two - The Lost Lords", "details_link": "https://www.metacritic.com/game/playstation-4/game-of-thrones-episode-two---the-lost-lords", "publisher": "Telltale Games", "release_date": "Feb  3 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/95e2f8be395d3b2b34a0d10f5c6a1faf-98.jpg", "descriptions": "The Lost Lords is the second of six installments in the Game of Thrones: A Telltale Games Series."}, {"name": "Quake Arena Arcade", "details_link": "https://www.metacritic.com/game/xbox-360/quake-arena-arcade", "publisher": "Bethesda Softworks", "release_date": "Dec 15 2010", "developers": ["id Software"], "platforms": "Xbox 360", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/171ec69b352dcbfe743fd329a2303168-98.jpg", "descriptions": "id Software brings its first-person shooter franchise to Xbox Live Arcade."}, {"name": "Overland", "details_link": "https://www.metacritic.com/game/pc/overland", "publisher": "Finji", "release_date": "Sep 19 2019", "developers": ["Finji"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "Turn-Based", "General", "Tactics"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/5041ac74eb0e27f43556ea1997f5edc5-98.jpg", "descriptions": "Lead a group of desperate survivors across a desolate wasteland and discover new stories in this tactical, squad-based roguelike."}, {"name": "The LEGO Movie Videogame", "details_link": "https://www.metacritic.com/game/xbox-360/the-lego-movie-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb  7 2014", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/1cb0e68bbff457c1cc2bd134a224cdcd-98.jpg", "descriptions": "In a scenario drawn from the film, The LEGO Movie Videogame puts LEGO kids into the role of Emmet, an ordinary, rules-following, perfectly average LEGO minifigure who is mistakenly identified as the most extraordinary person and the key to saving the world. Players guide him as he is draftedIn a scenario drawn from the film, The LEGO Movie Videogame puts LEGO kids into the role of Emmet, an ordinary, rules-following, perfectly average LEGO minifigure who is mistakenly identified as the most extraordinary person and the key to saving the world. Players guide him as he is drafted into a fellowship of strangers on an epic quest to stop an evil tyrant, a journey for which Emmet is hopelessly and hilariously underprepared.… Expand"}, {"name": "Dance Dance Revolution: Hottest Party 2", "details_link": "https://www.metacritic.com/game/wii/dance-dance-revolution-hottest-party-2", "publisher": "Konami", "release_date": "Sep 12 2008", "developers": ["Konami"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/f47337d80d273e25eec7c1bb4a48e779-98.jpg", "descriptions": "Dance Dance Revolution celebrates its 10th anniversary with an all-new game for the Wii. The hottest selling dance game returns, with an entirely new soundtrack, game modes and interactivity. Dance Dance Revolution Hottest Party 2 enhances the series’ trademark interactive gameplay byDance Dance Revolution celebrates its 10th anniversary with an all-new game for the Wii. The hottest selling dance game returns, with an entirely new soundtrack, game modes and interactivity. Dance Dance Revolution Hottest Party 2 enhances the series’ trademark interactive gameplay by combining the physically engaging, innovative and easy-to-pick-up-and-play mechanics of the Wii platform. Dance Dance Revolution Hottest Party 2 is sure to be the life of the party with 4 player multiplayer, Wii Remote and Nunchuk support, smash hits taken from the last 4 decades of music, entirely new modes and more. [Konami]… Expand"}, {"name": "State of Decay 2", "details_link": "https://www.metacritic.com/game/pc/state-of-decay-2", "publisher": "Microsoft Game Studios", "release_date": "May 22 2018", "developers": ["Undead Labs"], "platforms": ["Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival", "Open-World"], "meta_score": 69, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/d44028955b9916180f33822c7ae48389-98.jpg", "descriptions": "Small-Town America, one year from today. The dead have risen, and civilization has fallen. Even the military couldn’t stop the zombies, and now humanity stands on the brink of extinction. It's up to you to gather survivors and build a community, explore your lasting legacy, and redefine whatSmall-Town America, one year from today. The dead have risen, and civilization has fallen. Even the military couldn’t stop the zombies, and now humanity stands on the brink of extinction. It's up to you to gather survivors and build a community, explore your lasting legacy, and redefine what it means to survive. It’s up to you to build your base, develop your characters, and manage resources to survive as a group in this post-apocalyptic zombie open world. RPG progression - Develop each survivor’s skills to improve their capabilities and strengthen your community. Play solo or team up with up to three friends to explore an open world filled with dynamic zombies, human enemies, and the valuable gear necessary to keep your community alive. In the zombie apocalypse, you must create your own moral code. Every decision has lasting consequences that you must face. How you decide to survive may surprise you. [Microsoft]… Expand"}, {"name": "Thunder Wolves", "details_link": "https://www.metacritic.com/game/pc/thunder-wolves", "publisher": "bitComposer Games", "release_date": "May 15 2013", "developers": ["Most Wanted Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/d0b562aa50fbf1e015394c6af06e2ae1-98.jpg", "descriptions": "Thunder Wolves puts gamers in the hot seat of an experienced helicopter group that has survived a flurry of bullets and caused more destruction than the Seventh United State Army. Gamers will embark on a variety of missions including high-risk convoy protection, deploying a commando onThunder Wolves puts gamers in the hot seat of an experienced helicopter group that has survived a flurry of bullets and caused more destruction than the Seventh United State Army. Gamers will embark on a variety of missions including high-risk convoy protection, deploying a commando on fast-moving train or unleashing hell on a fully destructible battlefield.… Expand"}, {"name": "Frogger: Helmet Chaos", "details_link": "https://www.metacritic.com/game/ds/frogger-helmet-chaos", "publisher": "Konami", "release_date": "Sep 27 2005", "developers": ["Konami Computer Entertainment Hawaii"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/05298f0832a9dbdd926d0f9edad54222-98.jpg", "descriptions": "Frogger, one of the most beloved video game character of all time, returns! In this latest escapade, Frogger finds himself called upon to stop an evil force that threatens his home, Firefly Swamp, and the nearby kingdom of Bunnington Hollow. To stop the insidious Dr. Wani and his destructiveFrogger, one of the most beloved video game character of all time, returns! In this latest escapade, Frogger finds himself called upon to stop an evil force that threatens his home, Firefly Swamp, and the nearby kingdom of Bunnington Hollow. To stop the insidious Dr. Wani and his destructive mining efforts, Frogger must use all of his hopping and dodging skills, along with many new talents, to infiltrate the mastermind's lair and bring his evil plans crashing down. Unlock new playable characters and original arcade game. Over than 30 levels of play to challenge players of all levels. A wide range of moves including wall climbing, tongue grabs and more. Up to 4-player wireless multiplayer action with a single game cartridge. [Konami]… Expand"}, {"name": "Call of Duty 3", "details_link": "https://www.metacritic.com/game/wii/call-of-duty-3", "publisher": "Activision", "release_date": "Nov 14 2006", "developers": ["Exakt"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/866405c5aa10c42f8fd7871d1ecf2e3f-98.jpg", "descriptions": "Call of Duty 3 delivers the intensity of being closer than ever to the fury of combat during the battle for the Liberation of Paris, the most harrowing campaign of WWII, known as The Normandy Breakout.  Through a seamless narrative, Call of Duty 3 delivers the rush of unrelenting battle andCall of Duty 3 delivers the intensity of being closer than ever to the fury of combat during the battle for the Liberation of Paris, the most harrowing campaign of WWII, known as The Normandy Breakout.  Through a seamless narrative, Call of Duty 3 delivers the rush of unrelenting battle and breathtaking action of the Allied offensive that changed the fate of the world. [Activision]… Expand"}, {"name": "Dragon Marked For Death", "details_link": "https://www.metacritic.com/game/switch/dragon-marked-for-death", "publisher": "Inti Creates", "release_date": "Jan 29 2019", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/31db3e243d64865aac789b3e27270261-98.jpg", "descriptions": "Dragon MFD is a 2D side-scrolling action RPG game where up to 4 players can play together in either local multiplayer or online multiplayer. Refreshing, feel-good level designs based around intuitive 2D-action-based gameplay await!Features:\n\n* Play through the game as one of four DragonkinDragon MFD is a 2D side-scrolling action RPG game where up to 4 players can play together in either local multiplayer or online multiplayer. Refreshing, feel-good level designs based around intuitive 2D-action-based gameplay await!Features:* Play through the game as one of four Dragonkin characters!The characters, known as the Dragonkin, have forged a pact with dragons which granted them special new powers. You can choose any one of the Princess, Warrior, Shinobi, or Witch characters to play as.* Each playable character has different strengths and abilities!The Princess is a well-balanced DPS character, the Warrior is a Tank class character that protects the party with his high defense, the Shinobi is DPS that places emphasis on movement on tricky attacks, and the Witch can both heal her allies and damage her emeies.* A fascinating and immersive dark fantasy worldCarefully drawn pixel art from some of the industry's best pixelmancers paints the entire picture and brings players right into the dark fantasy setting.* Work together with your companions to progress through stages!In Dragon MFD, working together with your companions opens up a whole new realm of possibilities when it comes to defeating enemies and traversing stages.* Battle against gargantuan bosses!Absolutely gigantic bosses that are bigger than the entire screen await our heroes. Work together with your comrades to take down these larger than life baddies!* Dozens and dozens of hours worth of gameplay!Make no mistake, Dragon MFD is a massive game for its genre. With single stages that span 200-400 screens, over 30 main quests, and tons of side quests to tackle, players have tons of playtime to look forward to!… Expand"}, {"name": "Eternal Hope", "details_link": "https://www.metacritic.com/game/xbox-one/eternal-hope", "publisher": "Doublehit Games", "release_date": "Jul  8 2022", "developers": ["Doublehit Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/a59a6ab715df637107c886ec351707c9-98.jpg", "descriptions": "In Eternal Hope you'll follow the story of Ti'bi, a lonely boy who has lost the love of his life. You'll embark with him on a highly unusual journey - one that might bring the soul of his cherished girlfriend back from the Shadow World, a purgatory-like realm. But visiting this new worldIn Eternal Hope you'll follow the story of Ti'bi, a lonely boy who has lost the love of his life. You'll embark with him on a highly unusual journey - one that might bring the soul of his cherished girlfriend back from the Shadow World, a purgatory-like realm. But visiting this new world will not be easy. There will be dangers to overcome and many mysteries to unearth before you can continue your passage.Granted the ability to shift between dimensions by the Keeper of Souls, this power will enable Ti'bi to travel, solve puzzles and meet otherworldly beings that live among the shadows. Travel with Ti'bi into the great beyond on this journey as you unravel ancient secrets not meant for the eyes of the living.… Expand"}, {"name": "Akane", "details_link": "https://www.metacritic.com/game/switch/akane", "publisher": "QubicGames", "release_date": "May 17 2019", "developers": ["Ludic Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/b112f0be56f1600b75d5b05dbea191ef-98.jpg", "descriptions": "Imagine the rain-soaked neon streets of Mega-Tokyo. You, your loyal katana and hordes of mad Yakuzas. There’s no happy ending this time. Take down as many thugs as you can with you."}, {"name": "Slain: Back from Hell", "details_link": "https://www.metacritic.com/game/xbox-one/slain-back-from-hell", "publisher": "Digerati Distribution", "release_date": "Oct 21 2016", "developers": ["Digerati Distribution", "Digerati"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/0e244f47279957139015b9ef5428a26e-98.jpg", "descriptions": "Slain: Back from Hell. A heavy metal inspired arcade combat with puzzle elements and gore galore. Stunning visuals and true old school gameplay accompanied by the most metal soundtrack you've ever heard."}, {"name": "Exist Archive: The Other Side of the Sky", "details_link": "https://www.metacritic.com/game/playstation-4/exist-archive-the-other-side-of-the-sky", "publisher": "Aksys Games", "release_date": "Oct 18 2016", "developers": ["Tri-Ace"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/536e3fe34c65c64a2dae61b923fd1aa0-98.jpg", "descriptions": "An RPG in which Kanata and others have been imbued with pieces of the dark god Yamatoga’s soul, and are sent to Protolexa, for reasons unbeknownst to them. Battle enemies and the armies of Chasseur as you search out for your other teammates, complete quests and side events, and learn theAn RPG in which Kanata and others have been imbued with pieces of the dark god Yamatoga’s soul, and are sent to Protolexa, for reasons unbeknownst to them. Battle enemies and the armies of Chasseur as you search out for your other teammates, complete quests and side events, and learn the truth of why you have been chosen. [Playstation.com]… Expand"}, {"name": "Scaler", "details_link": "https://www.metacritic.com/game/gamecube/scaler", "publisher": "Global Star Software", "release_date": "Nov 17 2004", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/2489937e5698a525aa680fca815cb03a-98.jpg", "descriptions": "Bobby \"Scaler\" Johnson gets more than he bargained for when he stumbles upon his next-door neighbor's evil plot to take over the world--by stealing all the lizards and training them to become his mutant army. As Bobby, you can take on your enemies by transforming into one of them.Bobby \"Scaler\" Johnson gets more than he bargained for when he stumbles upon his next-door neighbor's evil plot to take over the world--by stealing all the lizards and training them to become his mutant army. As Bobby, you can take on your enemies by transforming into one of them. Work your way through the worlds by shape-shifting, vine-surfing, and using camouflage. In levels filled with exotic plants and creatures, this unexpected hero encounters many strange situations.… Expand"}, {"name": "Octodad: Dadliest Catch", "details_link": "https://www.metacritic.com/game/pc/octodad-dadliest-catch", "publisher": "Young Horses, Inc", "release_date": "Jan 30 2014", "developers": ["Young Horses", "Inc"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Adventure", "3D", "Third-Person", "Modern"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/cfdf2279a864b10a46e14d05e5977557-98.jpg", "descriptions": "Octodad: Dadliest Catch is a game about destruction, deception, and fatherhood. The player controls Octodad, a dapper octopus masquerading as a human, as he goes about his life. Octodad's existence is a constant struggle, as he must master mundane tasks with his unwieldy boneless tentaclesOctodad: Dadliest Catch is a game about destruction, deception, and fatherhood. The player controls Octodad, a dapper octopus masquerading as a human, as he goes about his life. Octodad's existence is a constant struggle, as he must master mundane tasks with his unwieldy boneless tentacles while simultaneously keeping his cephalopodan nature a secret from his human family.… Expand"}, {"name": "The Dark Pictures: Switchback VR", "details_link": "https://www.metacritic.com/game/playstation-5/the-dark-pictures-switchback-vr", "publisher": "Supermassive Games", "release_date": "Mar 16 2023", "developers": ["Supermassive Games"], "platforms": "PlayStation 5", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival", "Action", "Shooter", "Light Gun"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/52d6530e5e0519a99e10184ff3d53a19-98.jpg", "descriptions": "Immerse yourself in this fast-paced roller coaster action-horror-shooter where every move you make, and everything you see, could mean the difference between life and death. Experience the thrill of the most nightmarish VR roller coaster action-shooter, enhanced by the innovative features ofImmerse yourself in this fast-paced roller coaster action-horror-shooter where every move you make, and everything you see, could mean the difference between life and death. Experience the thrill of the most nightmarish VR roller coaster action-shooter, enhanced by the innovative features of PlayStation VR2 and set inside the sinister world of The Dark Pictures Anthology. \r\rSwitchback VR will take players for a multi-sensory ride on where they'll need to survive the terrifying Ghost Ship and its distorted apparitions, confront hideous demonic incarnations of persecuted 'witches' in 17th-century New England and then fight for your life against other-worldly vampires trapped beneath the desert. Finally, escape the horrifying World's Fair Hotel with a sadistic serial killer out for blood and discover how your story connects these worlds on this sinister rollercoaster from hell.… Expand"}, {"name": "Earth Defense Force: Iron Rain", "details_link": "https://www.metacritic.com/game/playstation-4/earth-defense-force-iron-rain", "publisher": "D3Publisher", "release_date": "Apr 11 2019", "developers": ["Yuke's"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 69, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/800be3f3e3637a062fafbdf496749fd2-98.jpg", "descriptions": "The furious battle against the invader Aggressors is full of chaos. Includes 50+ severe missions, where you must fight against gigantic enemy creatures and huge invader weapons in 5 different difficulties. You will become the legendary mobile soldier which controls 4 different PA Gears,The furious battle against the invader Aggressors is full of chaos. Includes 50+ severe missions, where you must fight against gigantic enemy creatures and huge invader weapons in 5 different difficulties. You will become the legendary mobile soldier which controls 4 different PA Gears, several hundreds weapons, arms and items. Regain hope to human beings. Includes character creation mode. You can select your favorite gender, face, hair style, weight, voice and outfit. You can also change the personality of yourself. When playing the off-line mode, the split-screen will be supported. Also, when playing the on-line mode, you can co-op with other EDF members around the world.… Expand"}, {"name": "Heroes of Ruin", "details_link": "https://www.metacritic.com/game/3ds/heroes-of-ruin", "publisher": "Square Enix", "release_date": "Jul 17 2012", "developers": ["n-Space"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Action", "Role-Playing", "General", "General", "Action RPG"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/b2e4c2724ddb6d0c62cb84c79f3fc236-98.jpg", "descriptions": "HEROES OF RUIN uses StreetPass to create an inventive in-game 'Traders' Network' where players can buy and sell rare and powerful items picked up in battle. With an ever-changing inventory updated from each player passed in public, character strengths and abilities can be greatly enhanced byHEROES OF RUIN uses StreetPass to create an inventive in-game 'Traders' Network' where players can buy and sell rare and powerful items picked up in battle. With an ever-changing inventory updated from each player passed in public, character strengths and abilities can be greatly enhanced by accessing items from other players' games. Outside of the game, HEROES OF RUIN makes use of SpotPass to reward players with rare items or unique challenges through local Wi-Fi hotspots. The official HEROES OF RUIN community website will reward players further with daily challenges and quests available to complete in-game. With social media functionality, the site will also give players a platform to meet other gamers, swap ideas and items, and team up in-game.… Expand"}, {"name": "Scars Above", "details_link": "https://www.metacritic.com/game/pc/scars-above", "publisher": "Prime Matter", "release_date": "Feb 28 2023", "developers": ["Mad Head Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/a4bd6403f3faa8f9aafdf4defa598bfd-98.jpg", "descriptions": "Something strange has entered Earth's orbit; an object alien and unknowable, made out of matter that seems not to obey the laws of physics - the Metahedron. As a part of a hastily gathered group of astronauts and scientists sent off to explore it, your fate takes a jarring turn as you awakenSomething strange has entered Earth's orbit; an object alien and unknowable, made out of matter that seems not to obey the laws of physics - the Metahedron. As a part of a hastily gathered group of astronauts and scientists sent off to explore it, your fate takes a jarring turn as you awaken in another world - dazed, alone on an alien planet... but determined to stay alive.  Scars Above is a challenging, immersive third-person shooter inspired by modern type action-adventure games. It takes the genre staples, such as the rewarding feeling of overcoming difficulty, and combines it with a compelling and intricate story, meticulous and lavish world design, and a living, breathing ecosystem to explore and endure.\r This is a game of mystery and discovery.… Expand"}, {"name": "Out of Line", "details_link": "https://www.metacritic.com/game/pc/out-of-line", "publisher": "Hatinh Interactive", "release_date": "Jun 23 2021", "developers": ["Nerd Monkeys"], "platforms": ["iPhone/iPad", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 69, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/c05271b5a971896e5dd17a7722e00ef7-98.jpg", "descriptions": "A unique adventure game filled with beautiful puzzles all hand-drawn in an original 2D style . Out of Line follows the adventures of San in a quest to escape the Factory that was once home. Dive into a story set in a mysterious world that is revealed through multiple chapters."}, {"name": "Shift Happens", "details_link": "https://www.metacritic.com/game/xbox-one/shift-happens", "publisher": "Deck 13", "release_date": "Feb 22 2017", "developers": ["Deck 13"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/0be92c9ad7fb1466719cf52f66ff98d4-98.jpg", "descriptions": null}, {"name": "Touch My Katamari", "details_link": "https://www.metacritic.com/game/playstation-vita/touch-my-katamari", "publisher": "Namco Bandai Games", "release_date": "Feb 21 2012", "developers": ["Bandai Namco Games"], "platforms": "PlayStation Vita", "genres": ["Action", "General", "Platformer", "Platformer", "3D", "3D"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/ea37629a3afaa515f882c1de59736dc4-98.jpg", "descriptions": "In Touch My Katamari, the ever-growing ball of bits and bobs is controlled by touching the screen to roll it in any direction. A completely new Katamari gameplay feature allows players to use the rear touch pad of the PlayStation Vita to stretch the ball either horizontally or vertically toIn Touch My Katamari, the ever-growing ball of bits and bobs is controlled by touching the screen to roll it in any direction. A completely new Katamari gameplay feature allows players to use the rear touch pad of the PlayStation Vita to stretch the ball either horizontally or vertically to pick up more objects at once or squeeze through a narrow gap. Players will once again step into the shoes of the tireless Prince, tasked by the King of All Cosmos with rolling up ever more enormous balls of weird and wonderful junk. As the Prince travels through the varied levels of gentle lunacy, he will find himself amassing all manner of items large and small, inanimate and very much alive, from humble little ants to the volcanic grandeur of Mount Fuji. [Sony]… Expand"}, {"name": "Crash Nitro Kart", "details_link": "https://www.metacritic.com/game/playstation-2/crash-nitro-kart", "publisher": "VU Games", "release_date": "Nov 11 2003", "developers": ["Vicarious Visions"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/040a87dc3f5d74efebace8c4996c7154-98.jpg", "descriptions": "Crash hits the track in his most fast-paced adventure yet - Crash Nitro Kart! Kidnapped by the ruthless Emperor Velo and forced to race in his galactic coliseum, Crash must race his way to victory in order to save the Earth from destruction - but it won't be easy, as he must compete againstCrash hits the track in his most fast-paced adventure yet - Crash Nitro Kart! Kidnapped by the ruthless Emperor Velo and forced to race in his galactic coliseum, Crash must race his way to victory in order to save the Earth from destruction - but it won't be easy, as he must compete against foes both old and new before a final showdown with Velo himself! Crash Nitro Kart leads the pack by mixing awesome next-gen graphics and gameplay with the playability and fun of classic kart-racing games. [Vivendi Universal]… Expand"}, {"name": "Clock Tower 3", "details_link": "https://www.metacritic.com/game/playstation-2/clock-tower-3", "publisher": "Capcom", "release_date": "Mar 18 2003", "developers": ["SunSoft"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/9a92ded223bbb00d5e70e3456ab21fa5-98.jpg", "descriptions": "Behind every shadow lie your darkest fears... Alyssa Hamilton is an ordinary girl with ordinary dreams who is about to discover a side of herself that she never knew she possessed. Only she has the power to destroy the evil that threatens to plunge the world into darkness. Her destiny is toBehind every shadow lie your darkest fears... Alyssa Hamilton is an ordinary girl with ordinary dreams who is about to discover a side of herself that she never knew she possessed. Only she has the power to destroy the evil that threatens to plunge the world into darkness. Her destiny is to end the brutal crusade of the Evil Servants, foul spirits who thrive on the trapped life force of their murdered victim's souls. To save herself and these tortured innocents, Alyssa must unlock the mysteries surrounding the death of each soul. However, the legions of the dark world won't succumb easily. Alyssa must summon the sacred weapons necessary to banish these demonic creatures to the nightmare realms that spawned them before the clock tower strikes midnight. [Capcom]… Expand"}, {"name": "Ultima Online: Third Dawn", "details_link": "https://www.metacritic.com/game/pc/ultima-online-third-dawn", "publisher": "Electronic Arts", "release_date": "Mar 26 2001", "developers": ["Electronic Arts"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/ae9794572377cb64f0e6bee873e3204e-98.jpg", "descriptions": "The latest game in the \"massively multiplayer role-playing\" (MMRP) Ultima Online series adds a 3D graphics to the vast world of Britannia."}, {"name": "Burnout Crash!", "details_link": "https://www.metacritic.com/game/playstation-3/burnout-crash!", "publisher": "Electronic Arts", "release_date": "Sep 20 2011", "developers": ["Criterion Games"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Driving", "Car Combat", "Arcade", "Car Combat"], "meta_score": 69, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/af24381f76953a0b3efb99c0a2905d5a-98.jpg", "descriptions": "This is an action game in which players earn points for creating traffic pileups. From a top-down perspective, players initiate crashes by driving 'cartoony' vehicles (e.g., cars, trucks, vans, buses) into busy intersections; multiple crashes trigger score multipliers and rack up largeThis is an action game in which players earn points for creating traffic pileups. From a top-down perspective, players initiate crashes by driving 'cartoony' vehicles (e.g., cars, trucks, vans, buses) into busy intersections; multiple crashes trigger score multipliers and rack up large 'bills' of property damage. Each level is accompanied by crashing sounds, small explosions, and vocal encouragement (e.g., 'Cool,' 'Maximum Carnage!'). In some levels, players are instructed to crash into police cars (e.g., 'Crash them before they bust you!'); in other sequences, oversized airplanes, tornados, lobster monsters, and UFOs slide across the screen, destroying any vehicles in their path.… Expand"}, {"name": "Oddworld: Soulstorm - Oddtimized Edition", "details_link": "https://www.metacritic.com/game/switch/oddworld-soulstorm---oddtimized-edition", "publisher": "Microids", "release_date": "Nov 18 2022", "developers": ["Oddworld Inhabitants"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/0f999163cf3a127565fef7131961f7c3-98.jpg", "descriptions": "Oddworld: Soulstorm, the award-winning sequel to the best-selling Oddworld: New 'n' Tasty, is an explosive action-adventure epic platformer. Optimized for Nintendo Switch to take advantage of the platform's unique features, this version features the same amazing Soulstorm gameplay currentlyOddworld: Soulstorm, the award-winning sequel to the best-selling Oddworld: New 'n' Tasty, is an explosive action-adventure epic platformer. Optimized for Nintendo Switch to take advantage of the platform's unique features, this version features the same amazing Soulstorm gameplay currently found on the other platforms (PlayStation, Xbox, Steam, and Epic Games Store), with a delightful Switch flavor! In Soulstorm, you must help Abe on his hero's journey to free more than 1,000 Mudokons from the oppressive chains that enslave them. Confronting an uncertain future and a forgotten past, use your instincts and skills to allude detection, survive insurmountable odds, and maybe provide a spark that sets a revolution ablaze.… Expand"}, {"name": "Ghosts 'n Goblins Resurrection", "details_link": "https://www.metacritic.com/game/playstation-4/ghosts-n-goblins-resurrection", "publisher": "Capcom", "release_date": "Jun  1 2021", "developers": ["Capcom"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/f2186c81fe218c1357d5e70159b210f0-98.jpg", "descriptions": "GHOSTS 'N GOBLINS IS BACK FROM THE GRAVE. Watch as this nostalgic yet completely reimagined storybook world unravels before your very eyes. Taking cues from both Ghosts 'n Goblins and Ghouls 'n Ghosts and giving birth to something entirely new, Resurrection is a title worthy of its name.GHOSTS 'N GOBLINS IS BACK FROM THE GRAVE. Watch as this nostalgic yet completely reimagined storybook world unravels before your very eyes. Taking cues from both Ghosts 'n Goblins and Ghouls 'n Ghosts and giving birth to something entirely new, Resurrection is a title worthy of its name. Don't be fooledthis picturesque storybook world, while gorgeous, is a love-letter to the original titles and maintains the same punishing gameplay that fans have come to expect. So go on and test your mettle, for the gauntlet has been thrown!\r Story\r A long time ago...\r In a far off land our tale begins, its beauty matched by none.\rThe knight, Arthur, and the princess there, bathed in midday sun.\r...but suddenly something's amiss, the town is up in flames,\ra cloud of darkness does emerge, the palace it does claim.\r The shadow then extends its reach, to the Umbral Tree divine.\rIts color fades, its vigor drained by powers most malign.\rAnd with this chaos wrought, the Demon Lord plays his vile hand.\rWhile Arthur's back is turned, the princess he kidnaps as planned.\r In haste does Arthur don his armor, to save his maiden fair.\rTo the Demon Realm he does depart, so demons best beware.\r Gameplay\rJust like its predecessors, Ghosts 'n Goblins Resurrection makes use of simple controls that anyone can enjoy. Use them to your advantage as you fight your way through weird and spooky stages filled with unique enemies in this enchanting world brought to life with modern technology and game design philosophy!\r Ghosts 'n Goblins is, well, hard. Its unyielding difficulty has been a defining characteristic of the series, and Resurrection pays respect to that legacy. You'll die, and you'll die again, but you'll dust yourself off and get better with every attempt as you learn more about your foes and further craft your strategy. You'll struggle, but you'll also bask in glory once you do eventually emerge victorious. That is Ghosts 'n Goblins.\r In Resurrection, Arthur can obtain 8 types of weapons, each with its own unique characteristics. Fell your foes with old favorites such as the Lance and the Dagger, shoot shockwaves with the Hammer to launch enemies, or send a Spiked Ball crashing along the ground to bowl them over instead! Use theseand moreto your advantage as you form your plan to progress through the Demon Realm!\r In addition to his large arsenal of weapons, Arthur can also learn a magnitude of magic and skills. Use Thunderstorm to unleash a hailstorm of bolts in four directions, or learn Kitted Out to increase Arthur's inventory space and carry more weapons. With tons more available, be sure to make room for magic and skills in your strategy!\r Make full use of Arthur's weapons, magic, and skills as you brave the ordeals of the Demon Realm to bring the princess home safely. Muster every ounce of grit you possess; you're going to need it!… Expand"}, {"name": "Silent Hill HD Collection", "details_link": "https://www.metacritic.com/game/xbox-360/silent-hill-hd-collection", "publisher": "Konami", "release_date": "Mar 20 2012", "developers": ["Konami"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Horror", "Compilation"], "meta_score": 69, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/41b1ba58433181e30c75a09e637e2370-98.jpg", "descriptions": "Silent Hill HD Collection bundles Silent Hill 2 and 3 together enhanced with HD upgrades."}, {"name": "Resident Evil 5", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-5", "publisher": "Capcom", "release_date": "Jun 28 2016", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/7673a3e4391656088745b51471a86be7-98.jpg", "descriptions": "The biohazard threat has not ended: Just when it seemed that the menace of Resident Evil had been destroyed, along comes a new terror to send shivers down players' spines. Chris Redfield, returning Resident Evil hero, has followed the path of the evil literally around the globe. AfterThe biohazard threat has not ended: Just when it seemed that the menace of Resident Evil had been destroyed, along comes a new terror to send shivers down players' spines. Chris Redfield, returning Resident Evil hero, has followed the path of the evil literally around the globe. After joining a new organization, Chris heads to Africa where the latest bioterrorism threat is literally transforming the people and animals of the city into mindless, maddened creatures. He is joined by a new partner, Sheva Alomar, who lends her strength, intelligence and sharp-shooting skills to the mission. In order to survive, Chris and Sheva must work together to take on the challenges of discovering the truth behind this evil plot. Utilizing a revolutionary new 2-player co-op mode of gameplay, players assume control of either Chris or Sheva and experience Resident Evil in new ways. In Resident Evil 5, Capcom has players fearing the daylight as much as they have feared shadow in previous games.… Expand"}, {"name": "The Matrix Online", "details_link": "https://www.metacritic.com/game/pc/the-matrix-online", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar 22 2005", "developers": ["Monolith Productions"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/c862a1303ade1b2179fb42ad526dcaaa-98.jpg", "descriptions": "Players of The Matrix Online (Mx0) will inhabit an enormous urban sprawl, which spreads for miles in all directions. There are subways, nightclubs, skyscrapers, and dark alleys that all seem normal on the surface, but beneath this pedestrian exterior, a secret war is being waged for thePlayers of The Matrix Online (Mx0) will inhabit an enormous urban sprawl, which spreads for miles in all directions. There are subways, nightclubs, skyscrapers, and dark alleys that all seem normal on the surface, but beneath this pedestrian exterior, a secret war is being waged for the survival of humanity and machine alike. Here, you and many operatives like yourself, will determine who shall inherit the earth. Gameplay in The Matrix Online will be based on intricate and exciting \"wire-fu\" combat, an extensive mission structure, social interaction and a completely customizable skill and ability system. [Warner Bros.]… Expand"}, {"name": "Assassin's Creed Chronicles: China", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-chronicles-china", "publisher": "Ubisoft", "release_date": "Apr 21 2015", "developers": ["Climax Group", "Climax Studios"], "platforms": ["PC", "PlayStation 3", "Xbox One", "PlayStation 4"], "genres": ["Historic", "Action Adventure", "General", "Linear"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/95edf98ebc09ae68531f9af8e3a18afe-98.jpg", "descriptions": "16th-century China:  The newly appointed Jiajing Emperor instigates a sudden and ruthless purge of all he felt were a threat to his recently-acquired throne, including the Chinese Brotherhood of Assassins. A youthful Assassin, Shao Jun, fled to the West to complete her training under the16th-century China:  The newly appointed Jiajing Emperor instigates a sudden and ruthless purge of all he felt were a threat to his recently-acquired throne, including the Chinese Brotherhood of Assassins. A youthful Assassin, Shao Jun, fled to the West to complete her training under the legendary Assassin Ezio Auditore in the animated short Assassin’s Creed Embers and has returned, determined to restore the Chinese Brotherhood of Assassins. In Assassin’s Creed Chronicles: China, players come back to Shao Jun’s story as she returns to China hell-bent on retribution. Her story takes players to famous locales including the Maijishan Grottoes, Port of Macau, the Forbidden City and the Great Wall of China. Armed with stealth, agility and a combination of deadly weapons and equipment including a sharp and swift jian, a secret shoe blade, lethal rope darts and daggers, players deliver payback to those who decimated the Chinese Brotherhood of Assassins. [Ubisoft]… Expand"}, {"name": "Medal of Honor Heroes 2", "details_link": "https://www.metacritic.com/game/psp/medal-of-honor-heroes-2", "publisher": "Electronic Arts", "release_date": "Nov 13 2007", "developers": ["EA LA"], "platforms": "PSP", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/5763629126f97dbe5a0548103e4dc481-98.jpg", "descriptions": "It's June 6th, 1944, and the war is in your hands. Step into the boots of OSS Operative John Berg and infiltrate Normandy from behind enemy lines to undermine the Nazi regime. For the PSP, Medal of Honor Heroes 2 will deliver the most comprehensive shooter experience to date on the PSP, withIt's June 6th, 1944, and the war is in your hands. Step into the boots of OSS Operative John Berg and infiltrate Normandy from behind enemy lines to undermine the Nazi regime. For the PSP, Medal of Honor Heroes 2 will deliver the most comprehensive shooter experience to date on the PSP, with robust single player campaign and on-the-go 32-player multiplayer capability that allows you to battle it out, anytime and anywhere. [Electronic Arts]… Expand"}, {"name": "Tony Hawk's Project 8", "details_link": "https://www.metacritic.com/game/playstation-2/tony-hawks-project-8", "publisher": "Activision", "release_date": "Nov  7 2006", "developers": ["Shaba Games"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/88f3610426e51f0cb1ce06f10d58d503-98.jpg", "descriptions": "Reengineered from the ground up, Tony Hawk’s Project 8 immerses players in the definitive skateboarding experience using ultra-realistic graphics, enhanced physics and responsive controls that simulate the feeling of skating with every trick and bail. The game challenges players toReengineered from the ground up, Tony Hawk’s Project 8 immerses players in the definitive skateboarding experience using ultra-realistic graphics, enhanced physics and responsive controls that simulate the feeling of skating with every trick and bail. The game challenges players to experience the intensity and pressure of skating against some of the world’s top pros in true to life competitions as they aim to become the #1 skater. [Activision]… Expand"}, {"name": "Madden NFL 23", "details_link": "https://www.metacritic.com/game/playstation-5/madden-nfl-23", "publisher": "Electronic Arts", "release_date": "Aug 16 2022", "developers": ["EA Sports", "EA Tiburon"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 69, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/5/ada1682ef13733e10ef9b2f5f2997ca1-98.jpg", "descriptions": "FRANCHISE - Call the shots from the front office as you lead your Madden NFL 23 Franchise to the top. New athlete motivations like salary demands factor into contract negotiations and add to the drama of NFL free agency. FACE OF THE FRANCHISE - Play your way into the history books in MaddenFRANCHISE - Call the shots from the front office as you lead your Madden NFL 23 Franchise to the top. New athlete motivations like salary demands factor into contract negotiations and add to the drama of NFL free agency. FACE OF THE FRANCHISE - Play your way into the history books in Madden NFL 23. The League drops you into your fifth NFL season, and you're seeking a fresh start as you negotiate a one-year deal with a new team and strive for a legendary career. ULTIMATE TEAM - Develop your dream fantasy roster of current NFL superstars, Hall of Fame legends, and more. Keep improving your Madden 23 Ultimate Team roster all season through simplified team-building and convenient competition. [Electronic Arts]… Expand"}, {"name": "#DRIVE", "details_link": "https://www.metacritic.com/game/switch/drive", "publisher": "PM Studios Inc.", "release_date": "Feb 16 2021", "developers": ["Dariusz Pietrala"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/b4c0747dce3fd4a50dcede69d31b95f2-98.jpg", "descriptions": "#DRIVE is an endless driving videogame inspired by road and action movies from 1970s. As simple as possible, allowing the player to pick a car, pick the place and just hit the road. Just be aware not to hit anything else. No matter where we drive, no matter what we drive or how fast we#DRIVE is an endless driving videogame inspired by road and action movies from 1970s. As simple as possible, allowing the player to pick a car, pick the place and just hit the road. Just be aware not to hit anything else. No matter where we drive, no matter what we drive or how fast we drive. We simply chose to drive. And you?\r… Expand"}, {"name": "Raging Justice", "details_link": "https://www.metacritic.com/game/xbox-one/raging-justice", "publisher": "MakinGames", "release_date": "May  8 2018", "developers": ["MakinGames"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/0c235f6b4153b42cba475aed1a28df43-98.jpg", "descriptions": "The city is now in chaos. With crime and corruption around every corner, it’s down to a team of hard-hitting justice seeking mavericks to clean up the streets! Raging Justice describes itself as a classic beat ‘em up, dragged kicking and screaming into the 21st century."}, {"name": "Fragments of Him", "details_link": "https://www.metacritic.com/game/pc/fragments-of-him", "publisher": "Sassybot", "release_date": "May  3 2016", "developers": ["Sassybot"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 69, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/9/ed7425287a1d905c0867a6c35329616a-98.jpg", "descriptions": "After the death of Will, those left behind learn to cope with the loss. This interactive narrative is played in detached first-person view, as if you were the subconscious mind guiding the characters. Fragments of Him is a drama dealing with real emotions that all of us will have to face someday."}, {"name": "Game of Thrones: A Telltale Games Series", "details_link": "https://www.metacritic.com/game/playstation-4/game-of-thrones-a-telltale-games-series", "publisher": "Telltale Games", "release_date": "Nov 17 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/d9d52ad6508412d2f930f77e8f1e29b1-98.jpg", "descriptions": "Telltale's series is founded in the world, characters and events seen in HBO’s television show, which in turn is based on George R. R. Martin’s books (A Song of Ice and Fire)."}, {"name": "Paperbound", "details_link": "https://www.metacritic.com/game/playstation-4/paperbound", "publisher": "Dissident Logic", "release_date": "Mar 31 2015", "developers": ["Dissident Logic"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Fighting", "2D"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/98393acb06c334872a31f14a7e82f764-98.jpg", "descriptions": "Paperbound is Smash Bros on crack. Be a gravity ninja as you battle your friends inside old storybooks. Run up walls and on ceilings, and then invert your gravity for a surprise attack. It's chaotic yet strategic. Sometimes, it's madness. Sometimes, it's a cat-and-mouse game. You'll laugh.Paperbound is Smash Bros on crack. Be a gravity ninja as you battle your friends inside old storybooks. Run up walls and on ceilings, and then invert your gravity for a surprise attack. It's chaotic yet strategic. Sometimes, it's madness. Sometimes, it's a cat-and-mouse game. You'll laugh. You'll swear at your friends. You'll want to play another round. In Paperbound, you play as stick men and other characters who come to life via magic dust. Inside Journey to the Center of the Earth, you discover the ability to have your gravity adapt to any curved surface as you run along it. What better way to test this newfound ability than combat?… Expand"}, {"name": "Lichdom: Battlemage", "details_link": "https://www.metacritic.com/game/pc/lichdom-battlemage", "publisher": "Xaviant Games", "release_date": "Mar 19 2014", "developers": ["Xaviant Games", "Xaviant"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "First-Person", "Linear", "Western-Style"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/5f1d29ddf710355751c4870656df31d6-98.jpg", "descriptions": "Lichdom: Battlemage is a first-person caster that gives the Mage the spotlight in a way never before seen in games. With limitless magical power at your disposal and brutal enemies around every corner, victory hinges on a combination of skill and strategy. You must carefully craft a vastLichdom: Battlemage is a first-person caster that gives the Mage the spotlight in a way never before seen in games. With limitless magical power at your disposal and brutal enemies around every corner, victory hinges on a combination of skill and strategy. You must carefully craft a vast array of spells and learn to cast them in the heat of combat. You are your spells! The Lichdom: Battlemage spell crafting system offers an enormous range of customization. Every Mage is the product of crafted magic that reflects the individual's play style. Whether you prefer to target your foes from a safe distance, wade into combat and unleash your power at point-blank range, or pit your enemies against each other, endless spell customization lets you become the Mage you want to be. … Expand"}, {"name": "The LEGO Movie Videogame", "details_link": "https://www.metacritic.com/game/xbox-one/the-lego-movie-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb  7 2014", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/b50f62758f538cffa0102be15aa3b443-98.jpg", "descriptions": "In a scenario drawn from the film, The LEGO Movie Videogame puts LEGO kids into the role of Emmet, an ordinary, rules-following, perfectly average LEGO minifigure who is mistakenly identified as the most extraordinary person and the key to saving the world. Players guide him as he is draftedIn a scenario drawn from the film, The LEGO Movie Videogame puts LEGO kids into the role of Emmet, an ordinary, rules-following, perfectly average LEGO minifigure who is mistakenly identified as the most extraordinary person and the key to saving the world. Players guide him as he is drafted into a fellowship of strangers on an epic quest to stop an evil tyrant, a journey for which Emmet is hopelessly and hilariously underprepared.… Expand"}, {"name": "Max & the Magic Marker: Gold Edition", "details_link": "https://www.metacritic.com/game/playstation-3/max-the-magic-marker-gold-edition", "publisher": "PAN Vision AB", "release_date": "Nov  1 2011", "developers": ["Press Play"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 69, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/9/605e1b44cbf957bd13da9b9072bf3d8f-98.jpg", "descriptions": "Max & the Magic Marker will be familiar to fans of platform games but provides a unique twist that allows the player's imagination to literally run wild. The player must use the magic marker to solve puzzles, overcome obstacles, and defeat enemies. Along the way you must collect ink inMax & the Magic Marker will be familiar to fans of platform games but provides a unique twist that allows the player's imagination to literally run wild. The player must use the magic marker to solve puzzles, overcome obstacles, and defeat enemies. Along the way you must collect ink in order to continue drawing. On the Wii, the player will use the nunchuk for player movement while the remote controls your marker. At any point the player can pause the action to draw their way out of sticky situations. Max, the game's hero, is a young boy who loves to draw. One day he receives a mysterious orange marker in the mail. As he begins drawing with the mysterious marker he quickly notices it has magical powers. Anything Max draws starts moving on the paper and comes to life. The monster he draws begins messing around with Max's artwork and so Max decides to draw himself into his picture and that is where the adventure begins.… Expand"}, {"name": "Crash of the Titans", "details_link": "https://www.metacritic.com/game/wii/crash-of-the-titans", "publisher": "Sierra Entertainment", "release_date": "Oct  4 2007", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/bdb17c8b68f73641e4f4f591fbfd803d-98.jpg", "descriptions": "In Crash of the Titans, players fight a nefarious plot hatched by Crash's arch nemeses Neo and Nina Cortex to mutate the local creatures into titanic abominations. Using Crash's legendary mix of outrageous antics and daredevil bravado, players \"hijack\" enemies to take control of their actionIn Crash of the Titans, players fight a nefarious plot hatched by Crash's arch nemeses Neo and Nina Cortex to mutate the local creatures into titanic abominations. Using Crash's legendary mix of outrageous antics and daredevil bravado, players \"hijack\" enemies to take control of their action and use their fearsome powers against all manner of enemies. \"Jack to Attack!\" – Control, play and battle as 15 enemies, including titanic creatures such as Scorporilla, Ratcicle, Magamadon and Shellephant. While in control of a monster players can throw toxic stink bombs, call lightning down from the sky, fire lasers beams from their eyes or even impale enemies with a massive scorpion tail - use all of the creatures' special abilities to defeat Neo and Nina Cortex. Crash now has a powerful acrobatic fighting system that includes punches and flying kicks, multiple attacks and special counter moves. Players can power-up skills to unlock new attacks and blazing combos. Crash can now interact with his world in totally new ways. Players can wall-run, swing from ropes and flip off springboards – Crash can even toss Aku Aku on the ground to surf, skate, grind and shred. At any point in the game, a second player can join in the fun and play as Carbon-Crash to help unleash total chaos. In a totally innovative twist to co-op action gaming, Crash can even jack Carbon-Crash (or vice versa) for some hysterical Crash \"jacked\"-Crash mayhem. [Sierra Entertainment]… Expand"}, {"name": "From Russia With Love", "details_link": "https://www.metacritic.com/game/playstation-2/from-russia-with-love", "publisher": "Electronic Arts", "release_date": "Nov  1 2005", "developers": ["EA Redwood Shores"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action Adventure", "Modern"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/0169b32c5c13d2b8c03e4d7e2e8aa010-98.jpg", "descriptions": "The year is 1963. Your name is Bond, James Bond. And your mission is to slip inside the dangerous and debonair world of the original 007 played by none other than Sean Connery. Travel to exotic destinations such as Istanbul and the Orient Express, connect with a beautiful Russian doubleThe year is 1963. Your name is Bond, James Bond. And your mission is to slip inside the dangerous and debonair world of the original 007 played by none other than Sean Connery. Travel to exotic destinations such as Istanbul and the Orient Express, connect with a beautiful Russian double agent, and immerse yourself into an authentic re-creation of the classic Bond world. In missions that combine driving and stealth, delve deeper into the plot of the legendary film in an experience that will leave you shaken... and stirred. Fully integrated stealth and driving missions, non-linear level progression, the new zoom and focus aiming mechanic, and a deeply immersive living world add up to innovative, non-stop Bond action. Brand-New Multiplayer Mode: Third-person, split-screen deathmatch mode offers an engrossing social multiplayer experience. [Electronic Arts]… Expand"}, {"name": "Snake Pass", "details_link": "https://www.metacritic.com/game/playstation-4/snake-pass", "publisher": "Sumo Digital", "release_date": "Mar 28 2017", "developers": ["Sumo Digital"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Puzzle", "Action", "General"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/3459ea0cfae2c7d5d53e06265ae61749-98.jpg", "descriptions": "As Noodle the snake, slither, wriggle, curl, coil, and climb your way to the top of Haven Tor in this one-of-a-kind puzzle adventure from award winning independent studio Sumo Digital."}, {"name": "Pinball FX", "details_link": "https://www.metacritic.com/game/xbox-360/pinball-fx", "publisher": "Microsoft Game Studios", "release_date": "Apr 25 2007", "developers": ["Zen Studios"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/44b49ed01805648f04e945c8d9c05816-98.jpg", "descriptions": "[Xbox Live Arcade]  Pinball FX combines the arcade thrills of traditional pinball with enhanced gameplay and innovative features not found in any other pinball game. Gamers may control the flippers with their hand or arm motions using the Xbox LIVE Vision Camera or simply use the standard[Xbox Live Arcade]  Pinball FX combines the arcade thrills of traditional pinball with enhanced gameplay and innovative features not found in any other pinball game. Gamers may control the flippers with their hand or arm motions using the Xbox LIVE Vision Camera or simply use the standard Xbox 360 controller. Real-time head-to-head mode for online multiplayer competition for up to 4 players. Three vibrant, 3D pinball tables. Tables start out simple, but new challenges open up as a player’s skill advances. Gesture based controls and live chat via the Xbox 360 LIVE Vision Camera. Earn up to 12 Achievements and 200 Gamerscore points. [Zen Studios]… Expand"}, {"name": "Disney Alice in Wonderland", "details_link": "https://www.metacritic.com/game/wii/disney-alice-in-wonderland", "publisher": "Disney Interactive Studios", "release_date": "Mar  2 2010", "developers": ["Etranges Libellules"], "platforms": ["PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Fantasy"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/477f1d4339ab36b0b958d7453943542d-98.jpg", "descriptions": "Have you ever wondered what it would be like to fall down the rabbit hole? Explore a visually stunning world filled with whimsical settings, optical illusions, curiously challenging puzzles, and formidable adversaries. Play as the Mad Hatter, White Rabbit, Cheshire Cat and other memorableHave you ever wondered what it would be like to fall down the rabbit hole? Explore a visually stunning world filled with whimsical settings, optical illusions, curiously challenging puzzles, and formidable adversaries. Play as the Mad Hatter, White Rabbit, Cheshire Cat and other memorable characters from the film. [Disney]… Expand"}, {"name": "The Walking Dead: The Telltale Series - The Final Season Episode 2: Suffer the Children", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-the-telltale-series---the-final-season-episode-2-suffer-the-children", "publisher": "Telltale Games", "release_date": "Sep 25 2018", "developers": ["Telltale Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/e52d3a2c7d491dcd2d1807a014d096e8-98.jpg", "descriptions": "Will this be the final installment in the venerable Walking Dead franchise from Telltale?"}, {"name": "Tembo the Badass Elephant", "details_link": "https://www.metacritic.com/game/pc/tembo-the-badass-elephant", "publisher": "Sega", "release_date": "Jul 21 2015", "developers": ["Game Freak"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/be93fe3668b91af0a27e07f9f09c58d6-98.jpg", "descriptions": "TEMBO THE BADASS ELEPHANT is a larger than life, 2D side-scrolling action adventure from the creative geniuses behind the Pokémon games"}, {"name": "Dillon's Dead-Heat Breakers", "details_link": "https://www.metacritic.com/game/3ds/dillons-dead-heat-breakers", "publisher": "Nintendo", "release_date": "May 24 2018", "developers": ["Nintendo", "Vanpool"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/21c14dc825e81e387aa7999a2990082a-98.jpg", "descriptions": "As a team, defend a post-apocalyptic wild west from an invasion of transforming rock monsters alongside your Mii character, Dillon the armadillo, and his squirrel engineer, Russ. Recruit hired gunners to back you up in battle, and then roll into fights and high-speed chases and take downAs a team, defend a post-apocalyptic wild west from an invasion of transforming rock monsters alongside your Mii character, Dillon the armadillo, and his squirrel engineer, Russ. Recruit hired gunners to back you up in battle, and then roll into fights and high-speed chases and take down waves of enemies as Dillon—the \"Red Flash\" himself. Eighty years ago, a cataclysmic event devastated the world. Holed up in \"The City\" and outlying frontier towns, no survivor is safe now that a mysterious ship has unleashed an army of supercharged monsters. So, prepare for battle: gather resources by helping local businesses and winning races. Then stock up, man the towers, and strengthen barricades to protect each village's livestock! Discover new strategies to take out over 30 different types of enemies: some swim, some dig, some are electrified, poisonous, armored—even flying. Monsters transform into wheeled forms, racing into action-packed, high-speed chases. [Nintendo]… Expand"}, {"name": "Conan", "details_link": "https://www.metacritic.com/game/playstation-3/conan", "publisher": "THQ", "release_date": "Oct 23 2007", "developers": ["Nihilistic"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/85f88985ed2318323d4376e493bf8a2a-98.jpg", "descriptions": "Conan is an action adventure game featuring a story of epic brutality, sheer evil and visceral combat. Players follow the journey of Conan the Cimmerian as he fights a vicious battle against a variety of enemies and an elusive power that threatens to consume the Hyborian world. Playing asConan is an action adventure game featuring a story of epic brutality, sheer evil and visceral combat. Players follow the journey of Conan the Cimmerian as he fights a vicious battle against a variety of enemies and an elusive power that threatens to consume the Hyborian world. Playing as Conan, players take advantage of a deep and gratifying combat system that offers a variety of deadly weapons, fighting styles and interactive environments to battle hordes of enemies. In addition, the Conan harnesses next generation hardware to deliver a cinematic game play experience, complete with special effects, lighting and a powerful, epic soundtrack, to capture the essence of the Conan universe. [THQ]… Expand"}, {"name": "State of Mind", "details_link": "https://www.metacritic.com/game/pc/state-of-mind", "publisher": "Daedalic Entertainment", "release_date": "Aug 15 2018", "developers": ["Daedalic Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/a51c57909526a3164ebaf6987f8850a9-98.jpg", "descriptions": "State of Mind is a futuristic thriller game delving into transhumanism. The game explores themes of separation, disjuncture and reunification, in a world that is torn between a dystopian material reality and a utopian virtual future."}, {"name": "ARK: Survival Evolved", "details_link": "https://www.metacritic.com/game/playstation-4/ark-survival-evolved", "publisher": "Studio Wildcard", "release_date": "Aug 29 2017", "developers": ["Studio Wildcard"], "platforms": ["iPhone/iPad", "PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 64 ", "genres": ["Action Adventure", "Survival", "Sandbox"], "meta_score": 69, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/88abdec3e525aa4f7bdc7a063d9afcc0-98.jpg", "descriptions": "Stranded on the shores of a mysterious island, you must learn to survive. Use your cunning to kill or tame the primeval creatures roaming the land, and encounter other players to survive, dominate, and escape."}, {"name": "GRIP: Combat Racing", "details_link": "https://www.metacritic.com/game/xbox-one/grip-combat-racing", "publisher": "Wired Productions", "release_date": "Nov  6 2018", "developers": ["Caged Element Inc."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 69, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/fea91f360d2fe2ed747bc56de96042e3-98.jpg", "descriptions": "GRIP is a futuristic combat racer inspired by the Rollcage games from 1999/2000. Combine furious speed with intense action to create memorable racing moments."}, {"name": "Final Fantasy XV Pocket Edition HD", "details_link": "https://www.metacritic.com/game/switch/final-fantasy-xv-pocket-edition-hd", "publisher": "Square Enix", "release_date": "Sep 13 2018", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/5d9df9e8ca1bf9e330a406efdb1df997-98.jpg", "descriptions": "Explore the world of the fifteenth FINAL FANTASY in the palm of your hand.Download Chapter 1 and play for free!Subsequent chapters are available for purchase.\n\n\"Explore the world of FINAL FANTASY XV\nwith a cast of cute and cool characters! \"\n\nNow you can enjoy the FINAL FANTASY XV storyExplore the world of the fifteenth FINAL FANTASY in the palm of your hand.Download Chapter 1 and play for free!Subsequent chapters are available for purchase.\"Explore the world of FINAL FANTASY XVwith a cast of cute and cool characters! \"Now you can enjoy the FINAL FANTASY XV story across 10 exciting chapters.Tap to move, tap to talk, and tap to fightEasy for anyone to pick up and play![Story]The Tale of the Chosen King, Savior to the Star.After years of fighting, the nations of Lucis and Niflheim at last agree to an armistice.As a symbol of this promised peace, Noctis, crown prince of Lucis, is to wed the Lady Lunafreya of Tenebrae.The prince sets forth for his wedding on the eve of the signing ceremony, sent off by his father, King Regis.Unbeknownst to Noctis, however, the journey ahead is fraught with perils...… Expand"}, {"name": "Virtua Tennis 4", "details_link": "https://www.metacritic.com/game/playstation-3/virtua-tennis-4", "publisher": "Sega", "release_date": "May 10 2011", "developers": ["Sega"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/39ca97e9173deb77425c9d0bc1680ec5-98.jpg", "descriptions": "Virtua Tennis 4 with the PlayStation Move is more than just hitting the ball; it's about the angle of the racquet, the spin and speed of the ball and the power of the shot.  The advanced motion sensors of PlayStation Move precisely track both the fast and subtle movements of the controllerVirtua Tennis 4 with the PlayStation Move is more than just hitting the ball; it's about the angle of the racquet, the spin and speed of the ball and the power of the shot.  The advanced motion sensors of PlayStation Move precisely track both the fast and subtle movements of the controller allowing for pinpoint accurate shots as players improve their racquet skills.  Virtua Tennis 4 will also support 3D technology delivering unprecedented realism to the tennis experience, bringing you closer than ever to being out on the court.… Expand"}, {"name": "Dakar Desert Rally", "details_link": "https://www.metacritic.com/game/playstation-5/dakar-desert-rally", "publisher": "Saber Interactive", "release_date": "Oct  4 2022", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Racing", "Simulation", "Other", "Automobile"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/65b72afcc26e9ed3aa013089a4f08aef-98.jpg", "descriptions": "Dakar Desert Rally is the biggest and most epic off-road rally racing adventure ever developed.Dakar Desert Rally captures the genuine speed and excitement of Amaury Sport Organisation's largest rally race on the planet, featuring a wide variety of licensed vehicles from the world's topDakar Desert Rally is the biggest and most epic off-road rally racing adventure ever developed.Dakar Desert Rally captures the genuine speed and excitement of Amaury Sport Organisation's largest rally race on the planet, featuring a wide variety of licensed vehicles from the world's top makers, including motorcycles, cars, trucks, quads and SSVs. The game offers unique challenges for off-road simulation diehards and casual racing fans alike.Compete in fierce online multiplayer races or navigate the vast wilds in single-player offline.… Expand"}, {"name": "Ganryu 2: Hakuma Kojiro", "details_link": "https://www.metacritic.com/game/playstation-4/ganryu-2-hakuma-kojiro", "publisher": "Just For Games", "release_date": "Mar  9 2022", "developers": ["Storybird"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/733832d97622cdcb661fe0efd16cebd6-98.jpg", "descriptions": "A hack'n'slash inspired by Takezo Musashi's story from Eiji Yoshikawa's 1930s novel \"The Stone and the Saber\". This is one of the most famous stories in Japanese culture."}, {"name": "Onee Chanbara ORIGIN", "details_link": "https://www.metacritic.com/game/playstation-4/onee-chanbara-origin", "publisher": "D3Publisher", "release_date": "Oct 14 2020", "developers": ["Tamsoft"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/8550349604e8ef35d4b610d05a399e6c-98.jpg", "descriptions": "In the year 20XX AD, Tokyo is nothing but a dystopic wasteland overrun by living corpses known as the Undead. Here we find two sisters who descend from a long line of expert swordsmen, yet were born to different mothers. The elder sister, Aya, was raised by her father, who subjected her toIn the year 20XX AD, Tokyo is nothing but a dystopic wasteland overrun by living corpses known as the Undead. Here we find two sisters who descend from a long line of expert swordsmen, yet were born to different mothers. The elder sister, Aya, was raised by her father, who subjected her to rigorous training in the way of the blade. Meanwhile, the younger sister, Saki, was raised by her mother, learning to despise her father for abandoning them and taking her sister away. When her father goes missing, Aya decides to put her skills with the sword to use as an Undead-hunter. Upon her beloved mother's murder, Saki becomes consumed to the point of insanity with a desperate thirst for revenge, resorting to manipulating the Undead to achieve her goal.Aya resolves to seek out her younger sister, her only surviving relation, while Saki is determined to resurrect her mother using an ancient art passed down through the ages. This art, however, requires the heart of a blood relative to work, meaning that the younger sister must kill the elder if she is to have her sworn vengeance. And so, amidst a swirling storm of love, hate, and intrigue, the battle between the two sisters begins.… Expand"}, {"name": "Fallout 4: Automatron", "details_link": "https://www.metacritic.com/game/playstation-4/fallout-4-automatron", "publisher": "Bethesda Softworks", "release_date": "Mar 22 2016", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/659b815fcaeaeab06f4f79498bf26a9e-98.jpg", "descriptions": "The mysterious Mechanist has unleashed a horde of evil robots into the Commonwealth, including the devious Robobrain. Hunt them down and harvest their parts to build and mod your own custom robot companions. Choose from hundreds of mods; mixing limbs, armor, abilities, and weapons like theThe mysterious Mechanist has unleashed a horde of evil robots into the Commonwealth, including the devious Robobrain. Hunt them down and harvest their parts to build and mod your own custom robot companions. Choose from hundreds of mods; mixing limbs, armor, abilities, and weapons like the all-new lightning chain gun. Even customize their paint schemes and choose their voices!… Expand"}, {"name": "Close Combat: First to Fight", "details_link": "https://www.metacritic.com/game/xbox/close-combat-first-to-fight", "publisher": "2K Games", "release_date": "Apr  6 2005", "developers": ["Destineer"], "platforms": ["PC", "Xbox"], "num_players": "1-8 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/c652cf8cd491661340a2717a782f6ae8-98.jpg", "descriptions": "Created under the direction of the US Marine Corps, First to Fight puts you behind the barrel of an M16-A4 as a Marine fireteam leader. Now it's up to you to lead your four-man team through the dangerous streets of Beirut in modern urban combat. In this first-person shooter, you can use theCreated under the direction of the US Marine Corps, First to Fight puts you behind the barrel of an M16-A4 as a Marine fireteam leader. Now it's up to you to lead your four-man team through the dangerous streets of Beirut in modern urban combat. In this first-person shooter, you can use the Marine Air Ground Task Force to call for fire and support from Cobra helicopters, mortar teams, other fireteams, tanks, and AAVs. Develop true military tactics such as laying suppressing fire, flanking enemies, separating leaders from enemies, and more.… Expand"}, {"name": "Crash Tag Team Racing", "details_link": "https://www.metacritic.com/game/xbox/crash-tag-team-racing", "publisher": "VU Games", "release_date": "Oct 20 2005", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-8 ", "genres": ["Driving", "Car Combat"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/0a9d71c02354989aa4da88dc597e02a7-98.jpg", "descriptions": "For the first time ever in a racing game, players will be able to fuse two cars together on the fly to form a super vehicle with the all-new \"clashing\" technology. In Crash Tag Team Racing, players can combine their car with an opponent's mid-race to make a super-car equipped withFor the first time ever in a racing game, players will be able to fuse two cars together on the fly to form a super vehicle with the all-new \"clashing\" technology. In Crash Tag Team Racing, players can combine their car with an opponent's mid-race to make a super-car equipped with a powerful turret gun. When clashed, players can either get behind the wheel and drive or fire an onboard weapon. Each character has his or her own uniquely deadly 360˚ rotating turret. Players can continue the action out of the car where they can explore the entire world on foot and collect upgrades for their cars and unlock bonus tracks.… Expand"}, {"name": "Danger Zone 2", "details_link": "https://www.metacritic.com/game/xbox-one/danger-zone-2", "publisher": "Three Fields Entertainment", "release_date": "Jul 10 2018", "developers": ["Three Fields Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/2c788f5e988c02609083fefb808d16ef-98.jpg", "descriptions": "Danger Zone 2 takes the crash testing action out of the Test Area and onto real public roads. A high speed driving game featuring speed, traffic and crashes, Danger Zone 2 lets players loose onto the Freeways of the USA, the Motorways of the UK and the Autovias of Spain. Using advanced realDanger Zone 2 takes the crash testing action out of the Test Area and onto real public roads. A high speed driving game featuring speed, traffic and crashes, Danger Zone 2 lets players loose onto the Freeways of the USA, the Motorways of the UK and the Autovias of Spain. Using advanced real world physics and the power of Unreal Engine, Danger Zone 2 lets players ‘crash for cash’ and compete against each other to cause the most chaos on the road. [Microsoft]… Expand"}, {"name": "Imperial Glory", "details_link": "https://www.metacritic.com/game/pc/imperial-glory", "publisher": "Eidos Interactive", "release_date": "May 17 2005", "developers": ["Pyro Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 69, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/ecd0fa26c118bd9d3ebf106256284d76-98.jpg", "descriptions": "Imperial Glory promises to be the most extensive strategy game ever, offering an in- depth management model along with graphically stunning real-time land and naval battles in full 3D. Choose which of the five great 19th century Empires to lead: Great Britain, France, Russia, Prussia orImperial Glory promises to be the most extensive strategy game ever, offering an in- depth management model along with graphically stunning real-time land and naval battles in full 3D. Choose which of the five great 19th century Empires to lead: Great Britain, France, Russia, Prussia or Austro-Hungary, each with their own unique attributes. Command your troops in large-scale battles across the globe, from the green fields of England to the icy wastes of Russia and sweeping deserts of Morocco. However, ultimate glory will depend on your utilising politics, trade, diplomacy, resource management and technology research. This is an age of change ? be at the leading edge of the modern world or your civilization will crumble and fall. [Eidos Interactive]… Expand"}, {"name": "Ultimate NES Remix", "details_link": "https://www.metacritic.com/game/3ds/ultimate-nes-remix", "publisher": "Nintendo", "release_date": "Nov  7 2014", "developers": ["indieszero"], "platforms": "3DS", "genres": ["Miscellaneous", "General"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/b6596fdb58cac98f1ab1a01d6429f57a-98.jpg", "descriptions": "Take on a rapid-fire onslaught of challenges and mash-ups from 16 of Nintendos finest 8-bit games! Test your skills on a gauntlet of quick, tricky challenges and remix stages that combine parts of different games. The best mix of titles from the NES Remix and NES Remix 2 games is on NintendoTake on a rapid-fire onslaught of challenges and mash-ups from 16 of Nintendos finest 8-bit games! Test your skills on a gauntlet of quick, tricky challenges and remix stages that combine parts of different games. The best mix of titles from the NES Remix and NES Remix 2 games is on Nintendo 3DS. Now youre playing with PORTABLE power!\r Link vs. Donkey Kong! Kirby vs. Boo! Its mash-up mania in this celebration of all things NES! Race through to earn stars on increasingly tough tasks, like beating Ridley from Metroid or making Princess Peach save herself! Compete in Championship Modes blitz of challenges from the Super Mario Bros., Supe Mario Bros. 3, and Dr. Mario games, then compare scores with others in your region via online leaderboards*.\r -Features action-packed challenges from 16 classic 8-bit Nintendo games.\r-Dominate exciting chunks of retro Nintendo games from NES Remix, such as Super Mario Bros., The Legend of Zelda, Excitebike, and Donkey Kong.\r-Challenges from NES Remix 2 include bite-sized chunks of Super Mario Bros. 3, Zelda II- The Adventure of Link, Metroid, Kid Icarus, and Kirbys Adventure, among many others.\r-Test your skills in a series of altered 8-bit challenges and improve your times to unlock more challenges!\r-Take on 3 unique challenges from the Nintendo World Championships and Nintendo Campus Challenge, then check your score on online leaderboards* to see how you stack up.\r-Connect to the Nintendo eShop to download full versions of your favorite classic games.… Expand"}, {"name": "2010 FIFA World Cup South Africa", "details_link": "https://www.metacritic.com/game/psp/2010-fifa-world-cup-south-africa", "publisher": "EA Sports", "release_date": "Apr 26 2010", "developers": ["Electronic Arts"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/12a28e4532c1751ddf1db2ab07ac9b27-98.jpg", "descriptions": "EA SPORTS 2010 FIFA World Cup South Africa features all the emotion and passion of the fiercest national rivalries battling on the world’s biggest stage, with all 199 national teams that took part in qualification, all 10 official stadiums to be used in South Africa and stadiums from eachEA SPORTS 2010 FIFA World Cup South Africa features all the emotion and passion of the fiercest national rivalries battling on the world’s biggest stage, with all 199 national teams that took part in qualification, all 10 official stadiums to be used in South Africa and stadiums from each qualifying region. Gamers can play as their home nation from qualification right through to a virtual reproduction of the FIFA World Cup Final and feel what it is like to score the goal that lifts a nation.  Everything fans love about the World Cup comes to life in spectacular  detail, including confetti rain, streamers, & fireworks - just like the official tournament. [Electronic Arts]… Expand"}, {"name": "FIFA Manager 09", "details_link": "https://www.metacritic.com/game/pc/fifa-manager-09", "publisher": "Electronic Arts", "release_date": "Dec 19 2008", "developers": ["Bright Future GmbH"], "platforms": "PC", "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/dc766f9fa306d65ec04ac1731b22dadd-98.jpg", "descriptions": "(Currently available in the UK/EU only)  EA SPORTS FIFA MANAGER 09 gives football fans full control over the management of their clubs. Whether founding a club, becoming a national coach, or finally leading their favourite club to international glory, all options are open to players in the(Currently available in the UK/EU only)  EA SPORTS FIFA MANAGER 09 gives football fans full control over the management of their clubs. Whether founding a club, becoming a national coach, or finally leading their favourite club to international glory, all options are open to players in the EA SPORTS football management simulation for PC. The game contains all areas of club management, from signing new players to training to extending stadiums. A central element of EA SPORTS FIFA MANAGER 09 is the matchday itself. The 3D mode offers new improvements, particularly in the areas of graphics, sound and AI. The new, fully customisable user interface in 3D mode gives players direct access to substitutions, tactical changes, and statistics. The text mode has been completely revamped and now features a unique mixture of traditional live commentary and an Internet live ticker. Lots of exciting and informative tools create a high level of transparency and atmosphere. [Electronic Arts]… Expand"}]