[{"name": "Atelier Arland Series Deluxe Pack", "details_link": "https://www.metacritic.com/game/playstation-4/atelier-arland-series-deluxe-pack", "publisher": "Koei Tecmo Games", "release_date": "Dec  4 2018", "developers": ["Gust"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/ed46c7820e93fa7dc911db5c907f416e-98.jpg", "descriptions": "The 3 parts of the Arland Series Released in one deluxe edition!- Atelier Rorona ~The Alchemist of Arland~ DX\nFirst release in the Arland series. The main character Rorona must save her Atelier from being closed by the Kingdom. Using Synthesis, Exploration, and Battle, gain recognition forThe 3 parts of the Arland Series Released in one deluxe edition!- Atelier Rorona ~The Alchemist of Arland~ DXFirst release in the Arland series. The main character Rorona must save her Atelier from being closed by the Kingdom. Using Synthesis, Exploration, and Battle, gain recognition for the Atelier and save it from being closed.- Atelier Totori ~The Adventurer of Arland~ DXThe second release in the Arland series. In a search for her missing mother, Totori tours the world of Arland as an adventurer accompanied by her friends. Use Synthesis, Explore, and Battle to fulfil requests, raise her rank as an adventurer and venture into brand new lands.- Atelier Meruru ~The Apprentice of Arland~ DXThird release in the Arland series. Princess of the small frontier country of Arls, Meruru plans to use alchemy to stimulate the growth of her small country. Use Synthesis, Explore, and Battle to increase the population within the time limit and boost the advancement of the kingdom.… Expand"}, {"name": "Metrico+", "details_link": "https://www.metacritic.com/game/playstation-4/metrico+", "publisher": "Digital Dreams", "release_date": "Aug 23 2016", "developers": ["Digital Dreams"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Puzzle", "Action"], "meta_score": 81, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/4bbcd1b3d2ee9c1b475c8c982e3fffae-98.jpg", "descriptions": "Metrico+ is an input-driven game in a world of infographics. All the bar charts, line diagrams, and pie charts react to what you are doing. You have to rethink all you know in order to solve all the puzzles and explore every part of the world that is Metrico. [Playstation.com]"}, {"name": "NHL 14", "details_link": "https://www.metacritic.com/game/xbox-360/nhl-14", "publisher": "Electronic Arts", "release_date": "Sep 10 2013", "developers": ["Electronic Arts"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 81, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/7c5eb5ff9e6ab8d9aa0b57df7b7f7d2a-98.jpg", "descriptions": "Unlock the highest level of hockey aggression, speed and skill. Deliver hits with the NHL® Collision Physics, built from FIFA’s Player Impact Engine. Drop your gloves with the new Enforcer Engine, powered by EA SPORTS™ Fight Night technology. Dangle defenders with new One-Touch Dekes andUnlock the highest level of hockey aggression, speed and skill. Deliver hits with the NHL® Collision Physics, built from FIFA’s Player Impact Engine. Drop your gloves with the new Enforcer Engine, powered by EA SPORTS™ Fight Night technology. Dangle defenders with new One-Touch Dekes and experience enhanced speed and control with the second season of True Performance Skating.… Expand"}, {"name": "Tekken 7", "details_link": "https://www.metacritic.com/game/xbox-one/tekken-7", "publisher": "Bandai Namco Games", "release_date": "Jun  2 2017", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 81, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/7dced11c4fe9832e781e599a3a1d80f0-98.jpg", "descriptions": "Love, Revenge, Pride. Each one of us has a reason to fight. Values are what define us and make us human, regardless of our strengths or weaknesses. There are no wrong motives, just the paths we choose to take. Experience the conclusion of the Mishima clan and unravel the reasons behind eachLove, Revenge, Pride. Each one of us has a reason to fight. Values are what define us and make us human, regardless of our strengths or weaknesses. There are no wrong motives, just the paths we choose to take. Experience the conclusion of the Mishima clan and unravel the reasons behind each step of their ceaseless fight. Powered by Unreal Engine 4, Tekken 7 features story-driven cinematic battles and intense duels that can be enjoyed with friends and rivals alike through innovative fight mechanics.… Expand"}, {"name": "Final Fantasy VII Remake Intergrade: Episode INTERmission", "details_link": "https://www.metacritic.com/game/playstation-5/final-fantasy-vii-remake-intergrade-episode-intermission", "publisher": "Square Enix", "release_date": "Jun 10 2021", "developers": ["Square Enix"], "platforms": "PlayStation 5", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/d67e53ff27d70bea67338c51c2634d85-98.jpg", "descriptions": "The new episode featuring Yuffie is a brand-new adventure in the world of FINAL FANTASY VII REMAKE INTERGRADE. Play as Wutai ninja Yuffie Kisaragi as she infiltrates Midgar and conspires with Avalanche HQ to steal the ultimate materia from the Shinra Electric Power Company."}, {"name": "NBA 2K8", "details_link": "https://www.metacritic.com/game/playstation-3/nba-2k8", "publisher": "2K Sports", "release_date": "Oct  2 2007", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1-6 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 81, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/582ed92c2178b8f2ea95f48e6570fcf3-98.jpg", "descriptions": "Sprite Slam Dunk Contest - Live from Las Vegas, 2K is bringing you the Sprite Slam Dunk Contest, hosted by street legend Bobbito Garcia. Choose from hundreds of dunks and a vast array of props as you compete against the NBA's finest dunkers in this 4 player event. The Sprite Slam DunkSprite Slam Dunk Contest - Live from Las Vegas, 2K is bringing you the Sprite Slam Dunk Contest, hosted by street legend Bobbito Garcia. Choose from hundreds of dunks and a vast array of props as you compete against the NBA's finest dunkers in this 4 player event. The Sprite Slam Dunk Contest is also playable online; it's here that you can prove to the world that you are the greatest dunker there is. More Signature Style - Customizable Free Throws, Dribble Moves, and Dunks give users total control over the way their favorite players play on the court. All new signature shots from many of your favorite NBA players, including #1 draft choice Greg Oden, as well as individual post and dribble moves, makes NBA 2K8 the most authentic NBA simulation on the market. Off-Ball Control - Run quick on the fly sets to get your favorite player the ball in the best situation for him to get a quick bucket. Use the Get Open button for a fast play, or call for the exact situation you want with the Off-Ball Control menu. On offense, you now have the option to switch off the ball handler to other players where you can call for alley-oops, jostle for post-position, set screens, etc. [2K Sports]… Expand"}, {"name": "To the Moon", "details_link": "https://www.metacritic.com/game/pc/to-the-moon", "publisher": "Freebird Games", "release_date": "Nov  1 2011", "developers": ["Freebird Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "General", "General"], "meta_score": 81, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/6/fb88de050b421024d24c392964a419aa-98.jpg", "descriptions": "Join Dr. Rosalene and Dr. Watts as they enter a patient named Johnny's mind on his death bed to grant his final request. Watch, interact, and change the past as Johnny's life unfolds before you and takes you on a magical journey inside one's head that asks the greatest question of all: \"WhatJoin Dr. Rosalene and Dr. Watts as they enter a patient named Johnny's mind on his death bed to grant his final request. Watch, interact, and change the past as Johnny's life unfolds before you and takes you on a magical journey inside one's head that asks the greatest question of all: \"What if...?\"\rIf you had the chance to relive your life, would you change things? Would you try to achieve some grand goal? Could you find love? Fame? Fortune? Or would you realize that sometimes the past is meant to stay the same. Join Dr. Rosalene and Watts on their journey and travel To The Moon.… Expand"}, {"name": "Madden NFL 15", "details_link": "https://www.metacritic.com/game/playstation-4/madden-nfl-15", "publisher": "Electronic Arts", "release_date": "Aug 26 2014", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim"], "meta_score": 81, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/e995a14783196464233986e085da4fe3-98.jpg", "descriptions": "New defense features and mechanics allow fans to confront their rivals with an arsenal of new pass rush moves, new open-field tackling mechanics, two new defensive cameras and more. For the first time, you can determine exactly when the ball-carrier is in your tackling range, and chooseNew defense features and mechanics allow fans to confront their rivals with an arsenal of new pass rush moves, new open-field tackling mechanics, two new defensive cameras and more. For the first time, you can determine exactly when the ball-carrier is in your tackling range, and choose either a conservative tackle or try for a high-risk, high-reward aggressive take-down. Further, new mechanics to jump the snap, cajole blockers off-balance and disrupt the backfield make it more interesting to play as a defensive lineman or blitzing linebacker. What's more, enhanced defensive AI means that your teammates will better know their assignments and be in position to make a play, allowing players to be more aggressive, with the knowledge that their teammates have their back.… Expand"}, {"name": "Star Wars Pinball VR", "details_link": "https://www.metacritic.com/game/pc/star-wars-pinball-vr", "publisher": "Zen Studios", "release_date": "Apr 29 2021", "developers": ["Zen Studios"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Pinball"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/83005f20f8dcac7409d1a43fa72e15e3-98.jpg", "descriptions": "For the first time ever, Star Wars Pinball surrounds us in virtual reality! Star Wars Pinball VR collects 8 AMAZING TABLES:The Mandalorian \nStar Wars Episode IV: A New Hope \nStar Wars Episode V: The Empire Strikes Back \nStar Wars Episode VI: Return of the Jedi \nRogue One: A Star WarsFor the first time ever, Star Wars Pinball surrounds us in virtual reality! Star Wars Pinball VR collects 8 AMAZING TABLES:The Mandalorian Star Wars Episode IV: A New Hope Star Wars Episode V: The Empire Strikes Back Star Wars Episode VI: Return of the Jedi Rogue One: A Star Wars StoryStar Wars RebelsMasters of the ForceClassic Collectibles The fully customizable FAN CAVE houses your \"virtual\" pinball table and items you earn. TOTAL IMMERSION MODE allows you to experience everything at table level. 360-DEGREE MINIGAMES surround you with iconic Star Wars set pieces.… Expand"}, {"name": "Slime-san: Superslime Edition", "details_link": "https://www.metacritic.com/game/playstation-4/slime-san-superslime-edition", "publisher": "Headup Games", "release_date": "Jun 26 2018", "developers": ["Fabraz"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 81, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/6e9e62b6cd7a1ca4eb327c7d11d71d44-98.jpg", "descriptions": "Slime-san: Superslime Edition includes all three major campaigns as well as some brand new, exclusive levels and features. Happy sliming!"}, {"name": "Quadrilateral Cowboy", "details_link": "https://www.metacritic.com/game/pc/quadrilateral-cowboy", "publisher": "Blendo Games", "release_date": "Jul 25 2016", "developers": ["Blendo Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/3d88e94209d8a1866f6bf2da32c96709-98.jpg", "descriptions": "When you have a top-of-the-line hacking deck armed with a 56.6k modem and a staggering 256k RAM, it means just one thing: you answer only to the highest bidder."}, {"name": "Kingdoms of Amalur: Reckoning - The Legend of Dead Kel", "details_link": "https://www.metacritic.com/game/xbox-360/kingdoms-of-amalur-reckoning---the-legend-of-dead-kel", "publisher": "Electronic Arts", "release_date": "Mar 20 2012", "developers": ["Big Huge Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/ce4e4e63cd801c9a42df478770107a87-98.jpg", "descriptions": "The legendary pirate Dead Kel and his Hanged Men have returned to haunt the seas of northern Amalur. Embark on a journey to the distant island of Gallows End with the eccentric Captain Brattigan in an adventure that will uncover a secret so great that it has incited wars and toppledThe legendary pirate Dead Kel and his Hanged Men have returned to haunt the seas of northern Amalur. Embark on a journey to the distant island of Gallows End with the eccentric Captain Brattigan in an adventure that will uncover a secret so great that it has incited wars and toppled kingdoms. Discover powerful new weapons and Twist of Fate Cards and use them to conquer the island's unique inhabitants. Become the Lord of Gravehal Keep and lay claim to the this once great fort standing upon the edge of a cliff in the most expansive player housing option yet. In an extensive new story and a host of new side quests, battle treacherous new enemies and face exciting new challenges on the mysterious island of Gallows End.… Expand"}, {"name": "The Sims 3: World Adventures", "details_link": "https://www.metacritic.com/game/pc/the-sims-3-world-adventures", "publisher": "Electronic Arts", "release_date": "Nov 16 2009", "developers": ["The Sims Studio"], "platforms": "PC", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/c1c3f101082e444a60886740bb6cbb9e-98.jpg", "descriptions": "Players can take their Sims on new journeys to famous real-world inspired destinations around the globe for the first time ever and seek out new adventures. While exploring the landmarks of an exotic city, there is no telling what the Sims will find. From mastering martial arts in ShangPlayers can take their Sims on new journeys to famous real-world inspired destinations around the globe for the first time ever and seek out new adventures. While exploring the landmarks of an exotic city, there is no telling what the Sims will find. From mastering martial arts in Shang Simla, China, discovering rich culture and famous landmarks on a romantic getaway to Champs Les Sims, France or exploring the depths of ancient tombs in Al Simhara, Egypt, players can take their Sims on a journey that will change their Sims’ lives. Players can accept challenges to search for secret treasures, learn new skills and chase down new personal opportunities, meet new Sims with unique personalities, share their culture and bring them home, discover new styles on their travels, and share everything they encounter on their adventures with the world through personal photographs, movies, and stories. [Electronic Arts]… Expand"}, {"name": "Hellblade: Senua's Sacrifice", "details_link": "https://www.metacritic.com/game/playstation-4/hellblade-senuas-sacrifice", "publisher": "Ninja Theory", "release_date": "Aug  8 2017", "developers": ["Ninja Theory"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/4c6f4f696ece6da4d8ecaa25998256ba-98.jpg", "descriptions": "Unsheathe the bloodstained blade of gritty warrior Senua as she fights her way through a nightmarish landscape in a ferociously personal journey. Can you survive a fearsome realm of vicious swordplay and terrifying creatures?"}, {"name": "GRIME", "details_link": "https://www.metacritic.com/game/pc/grime", "publisher": "Akupara Games", "release_date": "Aug  2 2021", "developers": ["Funnel Entertainment", "Clover Bite"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Role-Playing", "Platformer", "Action RPG", "Metroidvania"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/880ea2f981c333edda109ece751faf39-98.jpg", "descriptions": "Destroy... Absorb... Grow... GRIME is a fast and unforgiving Action-Adventure RPG in which you crush your foes with living weapons that mutate form and function, and then consume their remains with a black hole to strengthen your vessel as you break apart a world of anatomical horror and intrigue."}, {"name": "Painkiller", "details_link": "https://www.metacritic.com/game/pc/painkiller", "publisher": "DreamCatcher Interactive", "release_date": "Apr 12 2004", "developers": ["People Can Fly"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/076ab7c3b9bb8a442bea27d6d3157acd-98.jpg", "descriptions": "You play as Daniel Garner, a seemingly regular guy who as just been killed in a horrific car accident. Trapped in a dark and unwelcoming world between heaven and hell, you struggling to uncover the reasons why you've been denied entry into heaven. Awaiting your purification, you must fightYou play as Daniel Garner, a seemingly regular guy who as just been killed in a horrific car accident. Trapped in a dark and unwelcoming world between heaven and hell, you struggling to uncover the reasons why you've been denied entry into heaven. Awaiting your purification, you must fight through a seemingly endless number of demon soldiers as you to attempt to stop an imminent unholy war. [DreamCatcher Interactive]… Expand"}, {"name": "Disgaea 5 Complete", "details_link": "https://www.metacritic.com/game/switch/disgaea-5-complete", "publisher": "NIS America", "release_date": "May 23 2017", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/8d062447c7f1d68382047ce8d1c1f685-98.jpg", "descriptions": "This entry to the legendary Disgaea series tells a tale of revenge, and of rebellion.\r As a new and terrible Overlord named Void Dark seeks to enslave the countless Netherworlds, one young demon has stood to end his reign-Killia. In Disgaea 5, players lead Killia and his tenacious army ofThis entry to the legendary Disgaea series tells a tale of revenge, and of rebellion.\r As a new and terrible Overlord named Void Dark seeks to enslave the countless Netherworlds, one young demon has stood to end his reign-Killia. In Disgaea 5, players lead Killia and his tenacious army of rebels on their dark and dangerous path to vengeance. Filled with more over-the-top action and hilarious writing than ever before, Disgaea 5's damage numbers are surely headed for the record books.\r Features:\r *    Alliance Attacks: New to the Disgaea series, your relationship with your teammates influences a new battle system called Alliance Attack. These special moves are only available to main characters and only when their relationships are appropriately aligned.\r*    Recruitment: A familiar feature for Disgaea faithful, this system lets you choose from over 40 races and jobs, and identify new party members with the exact traits you desire.\r*    Revenge Mode: The Revenge Mode empowers your characters with bonus stats when they've become fed up of their allies being beat on.\r*    Explore the Netherworlds: While previous games in the series have shown a glimpse of the darkness that is the Netherworlds, Disgaea 5 takes you to a myriad of those dark lands.\r*    Languages: Enjoy English and original Japanese voices, and French and English in-game text!\r*    Includes Laharl's and seven additional side-stories. Join past Disgaea characters for exciting post-game content!\r*    Add seven great characters to your squad not found in the original retail release including Nisa, Girl Laharl, and more!… Expand"}, {"name": "WarioWare: Touched!", "details_link": "https://www.metacritic.com/game/ds/warioware-touched!", "publisher": "Nintendo", "release_date": "Feb 14 2005", "developers": ["Intelligent Systems"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Party / Minigame", "General"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/916a28e454e928f0cabd2245553e094c-98.jpg", "descriptions": "(Also known as \"Sawaru Made in Wario\" in Japan)  Wario makes his mad debut on the Nintendo DS with 180 all-new, factory-fresh microgames! What really makes this game rock is the DS's touch control. Touch the latest fruits from the bizarro developers of WarioWare Inc. Expect to make lots of(Also known as \"Sawaru Made in Wario\" in Japan)  Wario makes his mad debut on the Nintendo DS with 180 all-new, factory-fresh microgames! What really makes this game rock is the DS's touch control. Touch the latest fruits from the bizarro developers of WarioWare Inc. Expect to make lots of spins and whirlpools to win Dr. Crygor's Slightly Unscrewed microgames. Kickin' kindergartners Kat and Anna return with a dojo's worth of Ninja Scribble microgames. Scooter girl Mona has made a career move from the gelateria to the pizza delivery business, but she's also found time to become a pop diva and, of course, develop a whole new set of extremely cuuute microgames. [Nintendo]… Expand"}, {"name": "Plants vs Zombies: Garden Warfare 2", "details_link": "https://www.metacritic.com/game/playstation-4/plants-vs-zombies-garden-warfare-2", "publisher": "PopCap", "release_date": "Feb 23 2016", "developers": ["PopCap"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 24 ", "genres": ["General", "Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/d53cd30e982850e5705cbb159213c5da-98.jpg", "descriptions": "In Plants vs. Zombies Garden Warfare 2, the zombies have conquered, and the plants are on the attack for the first time in this  shooter. In your Backyard Battleground you can edit your character’s abilities and customizations, choose quests, jump into co-op or multiplayer action modes, orIn Plants vs. Zombies Garden Warfare 2, the zombies have conquered, and the plants are on the attack for the first time in this  shooter. In your Backyard Battleground you can edit your character’s abilities and customizations, choose quests, jump into co-op or multiplayer action modes, or invite up to three friends in to your backyard to start a party and take on AI – defeat a wave, and a more powerful wave will show up. You can also switch teams to challenge your friends. Backyard Battleground is your own frontline base to plan your attack before you enter the battle for Zomburbia. [EA]… Expand"}, {"name": "NHL 2K6", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-2k6", "publisher": "2K Sports", "release_date": "Sep  7 2005", "developers": ["2K Sports"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "10  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 81, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/56d1ff701f9537e9d6a56487973e608e-98.jpg", "descriptions": "ProControl - Play like the pros with our revolutionary icon-based passing system. All-new combo passing and shooting controls let you queue up give-and-go attacks, tic-tac-toe passing, puck cycling, behind the net plays and more. PureMotion Animations - Hundreds of new NHL-caliber animationsProControl - Play like the pros with our revolutionary icon-based passing system. All-new combo passing and shooting controls let you queue up give-and-go attacks, tic-tac-toe passing, puck cycling, behind the net plays and more. PureMotion Animations - Hundreds of new NHL-caliber animations to feast your eyes on including spectacular saves in goal by Marty Turco. On-The-Fly Coaching - Play your style of hockey at both ends of the ice by calling team strategy during the action. Crash the net, screen the goalie and pinch defensemen on offense. Then, counter the attack by clearing the crease, clearing the zone, or setting up a break out for an offensive rush. Enforcer System - Throw opponents off their game by bringing out your checking line. Now, bigger and more aggressive players weigh into the outcome of a game as much as your leading goal scorers, as physical play will lower opponents’ performance ratings. Maximum Goaltending - Take matters into your own hands by utilizing your right analog stick to make quick, intuitive saves when it counts the most. [2K Games]… Expand"}, {"name": "Torchlight", "details_link": "https://www.metacritic.com/game/xbox-360/torchlight", "publisher": "Microsoft Game Studios", "release_date": "Mar  9 2011", "developers": ["Runic Games"], "platforms": ["PC", "Xbox 360"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/0d44a3302d73e690e3b59dffe652880a-98.jpg", "descriptions": "Torchlight is an action role-playing-game for Xbox Live made by the creators of Diablo, Fate, and the never-released Mythos among other games. Set in the mining town of Torchlight, players will adventure to uncover the mysteries of the Ember mines. It offers a fully featured characterTorchlight is an action role-playing-game for Xbox Live made by the creators of Diablo, Fate, and the never-released Mythos among other games. Set in the mining town of Torchlight, players will adventure to uncover the mysteries of the Ember mines. It offers a fully featured character leveling system, randomized dungeons, hordes of monsters, and gobs of great loot. … Expand"}, {"name": "Persona 3 Portable", "details_link": "https://www.metacritic.com/game/pc/persona-3-portable", "publisher": "Sega", "release_date": "Jan 19 2023", "developers": ["Atlus"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/6/53542c6f31f264d92e49dab43a011c41-98.jpg", "descriptions": "Terrible creatures lurk in the dark, preying on those who wander into the hidden hour between one day and the next.  As a member of a secret school club, you must wield your inner power--Persona--and protect humanity from impending doom.  Will you live to see the light of day?"}, {"name": "Quake Remastered", "details_link": "https://www.metacritic.com/game/pc/quake-remastered", "publisher": "Bethesda Softworks", "release_date": "Aug 19 2021", "developers": ["id Software", "MachineGames"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/a663149b2a932b8d25ce1a28bcfa6db8-98.jpg", "descriptions": "The remastered version of Quake is here."}, {"name": "Danganronpa V3: Killing Harmony", "details_link": "https://www.metacritic.com/game/playstation-4/danganronpa-v3-killing-harmony", "publisher": "NIS America", "release_date": "Sep 26 2017", "developers": ["Spike Chunsoft"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Adventure", "Visual Novel"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/597b80511ab18add1def3dd824fe351a-98.jpg", "descriptions": "Welcome to a new world of Danganronpa, and prepare yourself for the biggest, most exhilarating episode yet. Set in a psycho-cool environment, a new cast of 16 characters find themselves kidnapped and imprisoned in a school. Inside, some will kill, some will die, and some will be punished.Welcome to a new world of Danganronpa, and prepare yourself for the biggest, most exhilarating episode yet. Set in a psycho-cool environment, a new cast of 16 characters find themselves kidnapped and imprisoned in a school. Inside, some will kill, some will die, and some will be punished. Reimagine what you thought high-stakes, fast-paced investigation was as you investigate twisted murder cases and condemn your new friends to death.\r KEY FEATURES:\r * A New Danganronpa Begins - Forget what you thought you knew about Danganronpa and join a completely new cast of Ultimates for a brand-new beginning.\r * Murder Mysteries - In a world where everyone is trying to survive, nobodys motivations are quite what they seem. Use your skills to solve each new murder or meet a gruesome end.\r * Lie, Panic, Debate! - The world is shaped by our perception of it. Fast-paced trial scenes will require lies, quick wits, and logic to guide your classmates to the right conclusions.\r * New Mini Games - Between the madness of murdered peers and deadly trials, enjoy an abundance of brand-new mini games.… Expand"}, {"name": "Bomberman Ultra", "details_link": "https://www.metacritic.com/game/playstation-3/bomberman-ultra", "publisher": "Hudson Entertainment", "release_date": "Jun 11 2009", "developers": ["Hudson"], "platforms": "PlayStation 3", "num_players": "8  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/8a8a6a4b1bbb43702e4acf96645a34f9-98.jpg", "descriptions": "[Playstation Network]  Bomberman Ultra includes all the classic gameplay elements that have made the series famous over the past few decades. Power-ups are as fun as ever and prove useful in order to dominate your opponents. And of course, the fast and frantic multiplayer action always keeps[Playstation Network]  Bomberman Ultra includes all the classic gameplay elements that have made the series famous over the past few decades. Power-ups are as fun as ever and prove useful in order to dominate your opponents. And of course, the fast and frantic multiplayer action always keeps things heated! Along with the above features, Bomberman Ultra is packed with all of the options you'd expect for non-stop fun. Allowing for full customization of your character, Bomberman Ultra allows you to pick and choose from countless accessories, body styles, and other fashions to make a wholly unique Bomberman character! Feel like going as a pirate dressed in a tutu? Go for it. Up for a more space man look with a ninja suit on? By all means. The full Bomberman costume wardrobe is immediately unlockable at the very start of the game giving you more than 150,000 unique combinations. Fans find outrageous level designs across 14 stages that challenge gamers from all backgrounds. Keep a sharp eye as most stages have one or more unique gimmicks to add a little challenge to the map! From hazardous trap doors to deadly tornadoes, your character will usually have a lot more to worry about than your rivals trying to bomb you. Of course the real fun in Bomberman is the multiplayer! Bring your custom look to the battle arena with full 8 player online multiplayer over PSN and 4 player local multiplayer. A bevy of options are also available to you when setting up your frenzied matches to tailor them the way you’d like. From active gimmicks on the map to other gameplay options, every battle is yours to make your own. [Hudson]… Expand"}, {"name": "Growlanser Generations", "details_link": "https://www.metacritic.com/game/playstation-2/growlanser-generations", "publisher": "Working Designs", "release_date": "Dec  7 2004", "developers": ["Career Soft"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "General"], "meta_score": 81, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/2/7cb00fa91f4f8b565c2352fcd243173b-98.jpg", "descriptions": "Growlanser: Generations is a 2-disc compilation from Working designs which consists of two highly regarded strategy RPGs. \"Growlanser II: The Sense of Justice\" introduces players to a special world of melee and magic, where rings become weapons and war threatens to shatter the peace of threeGrowlanser: Generations is a 2-disc compilation from Working designs which consists of two highly regarded strategy RPGs. \"Growlanser II: The Sense of Justice\" introduces players to a special world of melee and magic, where rings become weapons and war threatens to shatter the peace of three neighboring kingdoms at any moment. Players are allowed control of Wein Cruz and up to seven of his companions in battles of ever-increasing size, complexity, and importance against forces that are as devious as they are strong. \"Growlanser III: The Dual Darkness,\" the revealing third chapter in the Growlanser saga, takes players back to the beginning of the Growlanser universe. Back to a world being consumed by darkness, forcing its inhabitantants to seek a way to leave the world behind. Unfortunately, forces are gathering to prevent anyone from surviving the coming apocalypse. As Slayn, the player must find the source of the black scourge falling across the land and stop the plot that will result in mass genocide. A strong cast of supporting characters can be gathered during the quest, and they provide assistance, both in battle and with information gathered during the hours of spoken dialogue present in the game. [Working Designs]… Expand"}, {"name": "Airborne Assault: Highway to the Reich", "details_link": "https://www.metacritic.com/game/pc/airborne-assault-highway-to-the-reich", "publisher": "Matrix Games", "release_date": "Dec 10 2003", "developers": ["Panther Games"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Wargame", "Real-Time", "General"], "meta_score": 81, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/034de70ee6369fc66e4284c56db35b39-98.jpg", "descriptions": "September 1944, General Montgomery mounts the most daring Allied offensive of WW2. The plan is ambitious. Drop thirty thousand airborne troops deep behind enemy lines, seize the vital bridges across the Rhine, secure the highway to the Reich, advance the Allied armies into the GermanSeptember 1944, General Montgomery mounts the most daring Allied offensive of WW2. The plan is ambitious. Drop thirty thousand airborne troops deep behind enemy lines, seize the vital bridges across the Rhine, secure the highway to the Reich, advance the Allied armies into the German heartland and end the war by Xmas. Take command and with the aid of the world's most advanced wargame engine fight the battle and change history. The Airborne Assault game engine revolutionizes wargaming. Its pausable, continuous time game play, the most advanced artificial intelligence of any wargame, powerful and intuitive user interface and unique command system provide the most realistic and enjoyable simulation of operational warfare. Command like a real General, under real time pressures to achieve real objectives on a real map all within the fog of war. Issue orders to your powerful AI controlled subordinates or take total control of every unit. Fight the worlds most advanced AI opponent or match wits against your friends online or over a LAN. [Matrix Games]… Expand"}, {"name": "NCAA March Madness 2004", "details_link": "https://www.metacritic.com/game/xbox/ncaa-march-madness-2004", "publisher": "Electronic Arts", "release_date": "Nov 17 2003", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/6b09633781fa6140624da7a6f087f2d5-98.jpg", "descriptions": "NCAA March Madness 2004 storms the court with new schools, smoother control, and a deep Dynasty Mode.  Take your school's team through the Maui Invitational preseason tournament all the way to the Big Dance.  The unique, fast-paced college game comes to life with players applying full-courtNCAA March Madness 2004 storms the court with new schools, smoother control, and a deep Dynasty Mode.  Take your school's team through the Maui Invitational preseason tournament all the way to the Big Dance.  The unique, fast-paced college game comes to life with players applying full-court pressure \"D,\" diving on loose balls, and throwing it down big-time.  You can even hoop it up in an online tournament.  NCAA March Madness 2004 delivers the strategy, emotion, and passion that is college basketball.… Expand"}, {"name": "Nancy Drew: Danger on Deception Island", "details_link": "https://www.metacritic.com/game/pc/nancy-drew-danger-on-deception-island", "publisher": "Her Interactive", "release_date": "Oct  1 2003", "developers": ["Her Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/e614d9107800db0ed144f6ce707e45d1-98.jpg", "descriptions": "In Danger on Deception Island, you, as Nancy Drew, are investigating a string of mysterious events on Deception Island. Try this adventure by foot, bike, and kayak! Navigate sea caves, boats, and the surrounding waters in your kayak. Hop on your bike to explore the Whale Center, Hot KettleIn Danger on Deception Island, you, as Nancy Drew, are investigating a string of mysterious events on Deception Island. Try this adventure by foot, bike, and kayak! Navigate sea caves, boats, and the surrounding waters in your kayak. Hop on your bike to explore the Whale Center, Hot Kettle Cafe, and Lighthouse. Walk around town or hit the sandy beach to discover a lighthouse, build sandcastles and more!… Expand"}, {"name": "Doom", "details_link": "https://www.metacritic.com/game/game-boy-advance/doom", "publisher": "Activision", "release_date": "Oct 28 2001", "developers": ["David A. Palmer Productions"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Game Boy Advance"], "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 81, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/42e31e80561b91fa011d2805571d60d0-98.jpg", "descriptions": "From the legendary game developers at id Software, comes an explosive journey into the nightmare world of DOOM™. Embark on a harrowing mission to rid of Martian Moon Base of hordes of demonic creatures. Navigate through DOOM™'s 24 maze like levels, scouring the corridors forFrom the legendary game developers at id Software, comes an explosive journey into the nightmare world of DOOM™. Embark on a harrowing mission to rid of Martian Moon Base of hordes of demonic creatures. Navigate through DOOM™'s 24 maze like levels, scouring the corridors for secret areas and combat aids as you take on hell spawned demons with an explosive arsenal of chainguns, plasma rifles and rocket launchers. Use the Game Boy® Advance Game Link® Cable to team up with a friend and blast the levels together or link up to 4 players for the ultimate deathmatch.®… Expand"}, {"name": "NASCAR Heat 2002", "details_link": "https://www.metacritic.com/game/playstation-2/nascar-heat-2002", "publisher": "Atari", "release_date": "Jun 18 2001", "developers": ["Monster Games Inc."], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/a3a535f04f384cb268eedd8231ea66d1-98.jpg", "descriptions": "A blend of arcade and simulation games, 2002's edition of Heat features Championship Race, Beat-the-Heat, and Race-the-Pro modes utilizing 25 Winston Cup drivers (including Gordon, Wallace, Bobby Labonte) and 19 real-world NASCAR tracks."}, {"name": "Shadowrun: Hong Kong", "details_link": "https://www.metacritic.com/game/pc/shadowrun-hong-kong", "publisher": "Harebrained Schemes LLC", "release_date": "Aug 20 2015", "developers": ["Harebrained Schemes LLC"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/88ade4a5d93adc8894f422fffe19db14-98.jpg", "descriptions": "Shadowrun: Hong Kong is the 3rd standalone game in Harebrained Schemes’ Shadowrun cRPG series. Experience an all new crew, expanded magic and cyberware, a revamped Matrix, an upgraded Shadowrun Editor, and more."}, {"name": "Fieldrunners", "details_link": "https://www.metacritic.com/game/psp/fieldrunners", "publisher": "Subatomic Studios", "release_date": "Oct  1 2009", "developers": ["Subatomic Studios"], "platforms": ["iPhone/iPad", "PC", "PSP"], "genres": ["Strategy", "Real-Time", "General", "General", "Defense"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/e36accbd83e118ca316b898b54e74ead-98.jpg", "descriptions": "[PSP Minis]  Descend into the world of Fieldrunners, the most anticipated and visually stunning game in mobile Tower Defense history! Defend and control the field using a diverse selection of upgradeable towers in a limitless adventure, using a wide array of tactics and strategies against[PSP Minis]  Descend into the world of Fieldrunners, the most anticipated and visually stunning game in mobile Tower Defense history! Defend and control the field using a diverse selection of upgradeable towers in a limitless adventure, using a wide array of tactics and strategies against countless waves of unique land and air combatants! Hours of entertainment and replayable challenges! Enjoy a growing experience through free content updates! Do you have what it takes to dominate the fieldrunners and rise to the top as the ultimate Tower Defense master? [Subatomic Studios]… Expand"}, {"name": "Kirby: Planet Robobot", "details_link": "https://www.metacritic.com/game/3ds/kirby-planet-robobot", "publisher": "Nintendo", "release_date": "Jun 10 2016", "developers": ["HAL Labs"], "platforms": "3DS", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/a538ac8ddf7501ef1798d8f68cecdfad-98.jpg", "descriptions": "Harness the power of a mysterious mech to stop brutal invaders from mechanizing Kirby's home world. Smash through tough obstacles, lift heavy objects with ease, and scan enemies to shape-shift into new Modes with powerful abilities in this action-platformer. That's right—Kirby's RobobotHarness the power of a mysterious mech to stop brutal invaders from mechanizing Kirby's home world. Smash through tough obstacles, lift heavy objects with ease, and scan enemies to shape-shift into new Modes with powerful abilities in this action-platformer. That's right—Kirby's Robobot Armor can shape-shift into different modes by scanning enemies to copy their moves—like the new Jet Mode. Not to mention, Kirby can copy abilities the old-fashioned way too—by inhaling them! After saving the world, team up with three friends to defeat foes in Team Kirby Clash, an RPG-styled 4-player brawl where you choose from varied roles and level them up. [Nintendo.com]… Expand"}, {"name": "War Thunder", "details_link": "https://www.metacritic.com/game/pc/war-thunder", "publisher": "Gaijin Entertainment", "release_date": "Aug 15 2013", "developers": ["Gaijin Entertainment"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "Simulation", "Flight", "Flight", "Vehicle", "Combat"], "meta_score": 81, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/46365002cc5de72e885fda4113e0e711-98.jpg", "descriptions": "War Thunder is a next generation MMO combat game dedicated to World War II military aviation, armored vehicles, and fleets. You will take part in all of the major combat battles, fighting with real players all over the world."}, {"name": "Live A Live", "details_link": "https://www.metacritic.com/game/switch/live-a-live", "publisher": "Square Enix", "release_date": "Jul 22 2022", "developers": ["Square Enix", "historia Inc"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "Japanese-Style", "Tactics"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/714a255888142331284c3c8e1caddf44-98.jpg", "descriptions": "Seven different stories featuring different protagonists, time periods, and gameplay styles await. In The Wild West, a wanderer with a bounty on his head fights for his life. In the Twilight of Edo Japan, a shinobi undertakes a secret mission. Experience these tales in any order youSeven different stories featuring different protagonists, time periods, and gameplay styles await. In The Wild West, a wanderer with a bounty on his head fights for his life. In the Twilight of Edo Japan, a shinobi undertakes a secret mission. Experience these tales in any order you choose—the adventure is yours to control. What other stories will you uncover on the horizon...?… Expand"}, {"name": "Race Driver 2006", "details_link": "https://www.metacritic.com/game/psp/race-driver-2006", "publisher": "Codemasters", "release_date": "Jun  6 2006", "developers": ["Sumo Digital"], "platforms": "PSP", "num_players": "1-12 ", "genres": ["Driving", "Racing", "Simulation", "General", "General", "Automobile"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/ef68050ed79311db43b0c74d9107444c-98.jpg", "descriptions": "The title, a massively expanded edition of the European PSP system title \"TOCA Race Driver 2\" comes complete with real performance cars, real damage, real physics, and intense pack racing with up to 21 cars on-screen competing for position. Plus, with WLAN multiplayer gaming modes enablingThe title, a massively expanded edition of the European PSP system title \"TOCA Race Driver 2\" comes complete with real performance cars, real damage, real physics, and intense pack racing with up to 21 cars on-screen competing for position. Plus, with WLAN multiplayer gaming modes enabling up to 12 players to race simultaneously and an all-new WLAN game mode, competitive racing has never been so aggressive or closely fought. Providing PSP system petrol heads with the most diverse range of insanely fast racing events ever seen in one game, players will get to compete in GT Sports Car Racing, Street Racing, Rally, DTM, V8 Supercars, Global GT Lights, Rally Cross, Formula Ford, Open Wheel Grand Prix, Classic Car Racing, Super Truck racing, Stockcar Oval Racing, Ice-Racing, Convertible Racing, and Performance Car events. Over the European edition, Race Driver 2006 adds 10 all-new international tracks, such as Nashville Super Speedway and Shanghai, taking the total featured to a tarmac-melting 60+ circuits! More super-charged cars are also being featured, including the Buick Gran Sport 455, Pontiac Firebird Formula 400, Dodge Charger, Gemballa GTR 750 EVO, Koenig GT and Koenig GTD – giving players over 50 sensational machines to race. Designed especially for the PSP system gaming, a further race mode, the Trans-World Cup, delivers high-octane racing in short bursts making it perfect for gaming on the go. Through a variety of event-based challenges, including Time Trials and Skill Tests rather than a series of straight races, players must drive hard to become the World's No. 1 ranked racer. [Codemasters]… Expand"}, {"name": "Mario & Luigi: Superstar Saga + Bowser's Minions", "details_link": "https://www.metacritic.com/game/3ds/mario-luigi-superstar-saga-+-bowsers-minions", "publisher": "Nintendo", "release_date": "Oct  6 2017", "developers": ["Alphadream Corporation"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/610b8d3cb84ef60048c0aa0d840421fe-98.jpg", "descriptions": "Save Princess Peach's voice, the Beanbean Kingdom and ... Bowser?! The game that launched the Mario & Luigi series returns looking better than ever before. In this renewed classic, Mario and Luigi journey to the Beanbean Kingdom with Bowser to restore Princess Peachs voice. Control Mario andSave Princess Peach's voice, the Beanbean Kingdom and ... Bowser?! The game that launched the Mario & Luigi series returns looking better than ever before. In this renewed classic, Mario and Luigi journey to the Beanbean Kingdom with Bowser to restore Princess Peachs voice. Control Mario and Luigi simultaneously, making use of their unique Bros. Moves to solve puzzles and emerge victorious in action-packed battles. Pay heed to the enemys patterns and time your reactions right to land satisfying counterblows. Included in this remake is the Minion Quest: The Search for Bowser mode, which tells the story of the game from the perspective of Bowsers minions. Recruit characters to grow your own Minion army as you fight to locate your missing leader!\r Features:\r *    Mario and Luigi have access to different techniques, known as Bros. Moves, necessary for solving puzzles on their adventure. Switch between the two characters at will to pave your way and progress through new areas.\r*    Time your button presses to skillfully dodge enemy blows, land devastating counters, and inflict increased damage in battle. Utilize Bros. Attacks that dish out massive damage! \r*    In the brand new mode titled Minion Quest: The Search for Bowser, become the unlikely hero, Captain Goomba. Journey together with ShyGuy, Boo and other familiar Baddies.\r*    The Minion Quest storyline takes place during Mario & Luigis classic adventure. Find out what really transpired behind-the-scenes! \r*    Compatible with amiibo figures* from the Super Mario series, including Mario and Luigi amiibo figures. Also coming soon are brand new Goomba and Koopa Troopa amiibo. The Goomba, Koopa Troopa and Boo amiibo figures will each have read/write compatibility.… Expand"}, {"name": "Renegade Ops", "details_link": "https://www.metacritic.com/game/xbox-360/renegade-ops", "publisher": "Sega", "release_date": "Sep 14 2011", "developers": ["Avalanche Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/21f2c499de48f4bde8e9e5f71d941a03-98.jpg", "descriptions": "Renegade Ops puts players in a mobile commando unit sent behind enemy lines to defeat Inferno, a madman intent on global domination. Defeat enemies across a range of stunning environments using a wide variety of vehicles, from dispersing electromagnetic shock waves to the deployment of aRenegade Ops puts players in a mobile commando unit sent behind enemy lines to defeat Inferno, a madman intent on global domination. Defeat enemies across a range of stunning environments using a wide variety of vehicles, from dispersing electromagnetic shock waves to the deployment of a huge Gatling gun armed to the teeth. Players have the choice to fight alone in single player mode, team up offline with two-player split screen or join the dynamic 4-player online co-op experience. Blast your way through enemy lines by working together, or compete for achievements as you and your friends aim to top the online leader boards.… Expand"}, {"name": "Guild Wars 2: End of Dragons", "details_link": "https://www.metacritic.com/game/pc/guild-wars-2-end-of-dragons", "publisher": "NCSOFT", "release_date": "Feb 28 2022", "developers": ["ArenaNet"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/6e2779b128b337e4cb55dd2d3e6b4914-98.jpg", "descriptions": "Guild Wars 2: End of Dragons is the third expansion for the award-winning and critically acclaimed MMORPG Guild Wars 2. The dragon cycle that has sustained and blighted Tyria for ages is collapsing. Mortal hearts and choices will define this moment in history—and echo in the future forever."}, {"name": "Rainbow Billy: The Curse of the Leviathan", "details_link": "https://www.metacritic.com/game/pc/rainbow-billy-the-curse-of-the-leviathan", "publisher": "ManaVoid Entertainment Inc.", "release_date": "Oct  5 2021", "developers": ["ManaVoid Entertainment Inc."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "2D"], "meta_score": 81, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/a55effc8faa158b4fdbc99026236a3e3-98.jpg", "descriptions": "Rainbow Billy: The Curse of the Leviathan is a wholesome, creature capture, 2.5D Adventure-Puzzle-Platformer with RPG elements. It is a family-friendly and openly accessible adventure in which you must save whimsical creatures by bringing back color to the world you once knew!\r RainbowRainbow Billy: The Curse of the Leviathan is a wholesome, creature capture, 2.5D Adventure-Puzzle-Platformer with RPG elements. It is a family-friendly and openly accessible adventure in which you must save whimsical creatures by bringing back color to the world you once knew!\r Rainbow Billy tells a universal coming of age story about dealing with changes in the world and accepting ourselves and the others around us! Sometimes it only takes a conversation, empathy, and a new point of view to make a world of a difference. EXPLORE A WONDROUS WORLD!\rFrom dark caverns on secret islands to hidden coves off in the stormy seas, explore a rich world filled with treasure, fish (because every great game has a fishing minigame!), friendship and... danger!\rSOLVE ENVIRONMENTAL PUZZLES!\rEach world is filled with clever challenges and secrets that unlock new areas to explore!\r BEFRIEND CURIOUS CREATURES!\rMeet over 60 strange, lovable creatures and help them with their problems in non-violent encounters! Create your own unique team to save the day!\r RECOLOR THE WORLD!\rRestore color to a monochrome world and help your friends find the courage to be their true selves in a story about empathy and growth.… Expand"}, {"name": "Where is My Heart?", "details_link": "https://www.metacritic.com/game/psp/where-is-my-heart", "publisher": "Copenhagen Game Collective", "release_date": "Nov  8 2011", "developers": ["Die Gute Fabrik"], "platforms": ["PC", "PSP"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/cff8e32177dc0bba941cb9abdf7864e3-98.jpg", "descriptions": "In Where is my Heart? you play the story of a family of forest spirits. Their world gets broken up into fragments which you have to piece back together in your mind. Each of the three characters can transform into a magical creature along the way. The Rainbow Spirit allows you to rotate theIn Where is my Heart? you play the story of a family of forest spirits. Their world gets broken up into fragments which you have to piece back together in your mind. Each of the three characters can transform into a magical creature along the way. The Rainbow Spirit allows you to rotate the world around and jump across space; the Bat King can see hidden platforms which only exist for him; the Antler Ancestor can jump on the stars. Help the three spirits find their home tree again!… Expand"}, {"name": "Saints Row", "details_link": "https://www.metacritic.com/game/xbox-360/saints-row", "publisher": "THQ", "release_date": "Aug 29 2006", "developers": ["Volition Inc."], "platforms": "Xbox 360", "num_players": "Up to 12 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/ecfde2a5443e32a2a7d0155309407f48-98.jpg", "descriptions": "Welcome to Stilwater, a city where the streets are everything but tranquil. Divided by rivaling gangs, you’ll need to adopt savvy street smarts to build respect, make money and gain notoriety, let alone stay alive. As a member of the 3rd St. Saint’s, you need to push back against a cityWelcome to Stilwater, a city where the streets are everything but tranquil. Divided by rivaling gangs, you’ll need to adopt savvy street smarts to build respect, make money and gain notoriety, let alone stay alive. As a member of the 3rd St. Saint’s, you need to push back against a city looking to wipe you out, in order to rise up the ranks and eventually control the streets. If it takes theft, extortion or tried and true brute force, then that’s what ya gotta do. Only then will you rule the streets. BUT watch your back – on your purpose to rise as the city’s controlling syndicate, reputable and powerful gangs, including politicians have you in their crosshairs. [THQ]… Expand"}, {"name": "Hitman - Episode 6: Hokkaido", "details_link": "https://www.metacritic.com/game/playstation-4/hitman---episode-6-hokkaido", "publisher": "Square Enix", "release_date": "Oct 31 2016", "developers": ["Io Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 81, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/cc4858f1b73e76ea49bb1582978b8504-98.jpg", "descriptions": "The Season Finale for HITMAN Season One features a mission called “Situs Inversus” and is the culmination of everything players will have learnt in terms of both gameplay and story. The Hokkaido location is set within the grounds of the hyper-exclusive GAMA private hospital and resort. ThisThe Season Finale for HITMAN Season One features a mission called “Situs Inversus” and is the culmination of everything players will have learnt in terms of both gameplay and story. The Hokkaido location is set within the grounds of the hyper-exclusive GAMA private hospital and resort. This secluded facility is a fusion of Japanese beauty and cutting-edge technology, featuring its own Zen gardens, organic sushi restaurant and traditional Japanese hot spring. Agent 47 must locate two targets in this climactic Season Finale. … Expand"}, {"name": "The Legend of Heroes: Trails to Azure", "details_link": "https://www.metacritic.com/game/playstation-4/the-legend-of-heroes-trails-to-azure", "publisher": "NIS America", "release_date": "Mar 14 2023", "developers": ["Falcom"], "platforms": ["PC", "Switch", "PlayStation 4"], "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/1ac9c03ea72e361a983f541b08089285-98.jpg", "descriptions": "Sandwiched between two great powers, the city of Crossbel is the place where the Uroboros group carry out their biggest and darkest schemes. A mysterious drug is spreading its poison across the city, the mafia and the mercenary groups seem to have a role in the crimes. Add a break down toSandwiched between two great powers, the city of Crossbel is the place where the Uroboros group carry out their biggest and darkest schemes. A mysterious drug is spreading its poison across the city, the mafia and the mercenary groups seem to have a role in the crimes. Add a break down to the political order to the mix, and you have complete chaos in your hands. The world becomes more real and the battles become more dangerous in Ao no Kiseki. Feel the rain patter on your skin and enemies creep up to you in the dark.… Expand"}, {"name": "Art Academy: Lessons for Everyone", "details_link": "https://www.metacritic.com/game/3ds/art-academy-lessons-for-everyone", "publisher": "Nintendo", "release_date": "Oct  1 2012", "developers": ["Nintendo", "Headstrong Games"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/77a320c91c18543f41dddc4570ff799f-98.jpg", "descriptions": "New Art Academy, as it is also known, features both Introductory and Advanced lessons - whether you are an old master or a complete novice - offering easy to follow, step-by-step guides to a variety of drawing and painting techniques, styles and materials. [Nintendo Life]"}, {"name": "Lumines II", "details_link": "https://www.metacritic.com/game/psp/lumines-ii", "publisher": "Buena Vista Games", "release_date": "Nov  6 2006", "developers": ["Q Entertainment"], "platforms": "PSP", "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Matching", "General"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/5116253bc84e0d03ee7dbcc56a26c664-98.jpg", "descriptions": "Lumines II is the sequel to the extremely addictive puzzle-based video game, Lumines. Gamers control squares made of four smaller block pieces that are dropped into the playing field one at a time to form same-color squares.  The vertical \"timeline\" sweeps across the playing field from leftLumines II is the sequel to the extremely addictive puzzle-based video game, Lumines. Gamers control squares made of four smaller block pieces that are dropped into the playing field one at a time to form same-color squares.  The vertical \"timeline\" sweeps across the playing field from left to right and wipes the same-color squares from the playing field.  Unmatched blocks pile up, and the game ends when the pile gets to the top of the playing screen.  Advance through many action-packed levels, each with its own musical theme and sound effects. [BVG]… Expand"}, {"name": "Splatoon", "details_link": "https://www.metacritic.com/game/wii-u/splatoon", "publisher": "Nintendo", "release_date": "May 29 2015", "developers": ["Nintendo"], "platforms": "Wii U", "num_players": "Up to 8 ", "genres": ["Fantasy", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 81, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/730d31ac34bd396ee8e6397b1163da57-98.jpg", "descriptions": "Splatoon is a four-on-four multiplayer action game that drops players into a battle arena that two teams strive to claim as their own. Players of each team spray ink on the ground around them while blotting out the opposing team members in turf war competitions. Each character can turn intoSplatoon is a four-on-four multiplayer action game that drops players into a battle arena that two teams strive to claim as their own. Players of each team spray ink on the ground around them while blotting out the opposing team members in turf war competitions. Each character can turn into a squid-like character and swim through his or her own teams ink - gliding up and down walls and under floors - with ease. Using intuitive controls made possible with the Wii U GamePads gyro sensor makes it easy to look around and aim, and the on-screen map displays the entire arena at a glance, both of which feel great and redefine multiplayer action.… Expand"}, {"name": "Supreme Commander: Forged Alliance", "details_link": "https://www.metacritic.com/game/pc/supreme-commander-forged-alliance", "publisher": "THQ", "release_date": "Nov  6 2007", "developers": ["Gas Powered Games"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Command"], "meta_score": 81, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/7/861b67a232aae04e029cacb41521fb31-98.jpg", "descriptions": "Supreme Commander: Forged Alliance is the next chapter in the critically acclaimed Supreme Commander franchise. The game continues the epic story following the Infinite War, featuring an all-new single-player campaign, a new faction and a myriad of innovative multiplayer features. More thanSupreme Commander: Forged Alliance is the next chapter in the critically acclaimed Supreme Commander franchise. The game continues the epic story following the Infinite War, featuring an all-new single-player campaign, a new faction and a myriad of innovative multiplayer features. More than one hundred new units will give players access to cutting-edge strategic options, including fully realized navies, orbital weaponry and advanced counter intelligence technologies. [THQ]… Expand"}, {"name": "Drill Dozer", "details_link": "https://www.metacritic.com/game/game-boy-advance/drill-dozer", "publisher": "Nintendo", "release_date": "Feb  6 2006", "developers": ["Game Freak"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/4710149990dfa6b57d7df7f702cb9597-98.jpg", "descriptions": "In the platformer Drill Dozer, you can take the roll of Jill, the daughter of a crime boss who is set on revenge. When a rival gang steals away her family's heirloom, Jill gives chase in her Drill Dozer, an upgradeable piece of power armor equipped with a large drill. This piece of equipmentIn the platformer Drill Dozer, you can take the roll of Jill, the daughter of a crime boss who is set on revenge. When a rival gang steals away her family's heirloom, Jill gives chase in her Drill Dozer, an upgradeable piece of power armor equipped with a large drill. This piece of equipment will help you navigate through six different areas, where you will encounter varied enemies and bosses.… Expand"}, {"name": "The Kids We Were: Complete Edition", "details_link": "https://www.metacritic.com/game/switch/the-kids-we-were-complete-edition", "publisher": "GAGEX Co.,Ltd.", "release_date": "Dec  2 2021", "developers": ["GAGEX Co.,Ltd."], "platforms": ["iPhone/iPad", "PC", "Switch"], "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/0cebd3125b1a8300917953f534ee14e4-98.jpg", "descriptions": "The Kids We Were is an adventure game originally released worldwide for smartphones in February, 2020. The Complete Edition includes the full story available in the app, in addition to a new bonus episode set after the events of the main game. There are also brand-new collection items to find!"}, {"name": "Fuser", "details_link": "https://www.metacritic.com/game/playstation-4/fuser", "publisher": "NCSOFT", "release_date": "Nov 10 2020", "developers": ["Harmonix Music Systems"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Action", "Rhythm", "Music"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/b87d2f93971790d096750a65343a7bd4-98.jpg", "descriptions": "Work your way from the basics of mixing all the way to expert level techniques as you perform shows across 6 larger than life stage venues, each with its own signature style."}, {"name": "Super One More Jump", "details_link": "https://www.metacritic.com/game/switch/super-one-more-jump", "publisher": "SMG Studio", "release_date": "Jan 25 2018", "developers": ["SMG Studio"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/1508db4788710963cc9b357bd0618737-98.jpg", "descriptions": null}, {"name": "Oxenfree", "details_link": "https://www.metacritic.com/game/switch/oxenfree", "publisher": "Night School Studio", "release_date": "Oct  6 2017", "developers": ["Night School Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/93df20c00c7fcaa41b2c4ea91de4aba4-98.jpg", "descriptions": "Oxenfree is a supernatural thriller about a group of friends who unwittingly open a ghostly rift. You are Alex, and you’ve just brought your new stepbrother Jonas to an overnight island party gone horribly wrong."}, {"name": "Sunless Sea", "details_link": "https://www.metacritic.com/game/pc/sunless-sea", "publisher": "Failbetter Games", "release_date": "Jul  1 2014", "developers": ["Failbetter Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Action Adventure", "General"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/0c481d69ac1e169db598281eb79f7955-98.jpg", "descriptions": "Take the helm of your customised steamship and set sail for the unknown. Sunless Sea is a 2D game of discovery, survival and loneliness set in the Victorian Gothic universe of Fallen London."}, {"name": "The Walking Dead: Season Two Episode 3 - In Harm's Way", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-season-two-episode-3---in-harms-way", "publisher": "Telltale Games", "release_date": "May 13 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "genres": ["General", "Action", "Adventure", "General", "Point-and-Click"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/3b2cc34496d1f349724d479e2b23435c-98.jpg", "descriptions": "Consequences."}, {"name": "Duke Nukem Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/duke-nukem-advance", "publisher": "Take-Two Interactive", "release_date": "Aug 12 2002", "developers": ["Torus Games"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/607fabe17e36d8347349a778e51d5dc6-98.jpg", "descriptions": "Alien scientists have taken control of the top-secret Area 51 military  base, and are plotting to overthrow Earth! But not if Duke can stop them. Armed with alien-busting weapons, his kick-butt attitude, and using the aliens' own transporters, Duke takes the battle to four unique locationsAlien scientists have taken control of the top-secret Area 51 military  base, and are plotting to overthrow Earth! But not if Duke can stop them. Armed with alien-busting weapons, his kick-butt attitude, and using the aliens' own transporters, Duke takes the battle to four unique locations around the world. Oh, and rescues a few babes along the way.… Expand"}, {"name": "Marvel Heroes 2015", "details_link": "https://www.metacritic.com/game/pc/marvel-heroes-2015", "publisher": "Gazillion", "release_date": "Jun  4 2014", "developers": ["Gazillion"], "platforms": "PC", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/e11655ac6c208f0901859030f4613484-98.jpg", "descriptions": "Set in the iconic Marvel Universe, Marvel Heroes combines the core game-play style of Action RPGs and MMOs with the expansive library of heroes from the Marvel Universe. In the game, players can collect and play as their favorite Marvel Superheroes (including Iron Man, Thor, Wolverine, Hulk,Set in the iconic Marvel Universe, Marvel Heroes combines the core game-play style of Action RPGs and MMOs with the expansive library of heroes from the Marvel Universe. In the game, players can collect and play as their favorite Marvel Superheroes (including Iron Man, Thor, Wolverine, Hulk, Spider-Man, Captain America and many others).Team up with friends and try to stop Doctor Doom from devastating the world with the power of the Cosmic Cube in a story written by Marvel comic super-scribe Brian Michael Bendis.… Expand"}, {"name": "Football Manager 2016", "details_link": "https://www.metacritic.com/game/pc/football-manager-2016", "publisher": "Sports Interactive", "release_date": "Nov 13 2015", "developers": ["Sega"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Sports", "Team", "Soccer", "Management"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/9b7ede2fb59d23820e1846db5a7f0652-98.jpg", "descriptions": "Taking control of any squad from more than 50 countries across the world, you decide who plays and who sits on the bench, deal with the media and solve player problems."}, {"name": "Tearaway Unfolded", "details_link": "https://www.metacritic.com/game/playstation-4/tearaway-unfolded", "publisher": "SCEA", "release_date": "Sep  8 2015", "developers": ["Media Molecule"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Adventure", "General", "Platformer", "Fantasy", "3D"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/5637ff75c5710d2891c9f311fad95722-98.jpg", "descriptions": "The Tearaway Unfolded Crafted Edition includes a shiny Gold Leaf and a shining Gold Stamp to wear on your messenger, and an exclusive God of War and Journey costumes, allowing you to ‘journey’ through the world of Tearaway Unfolded in style. [Playstation.com]"}, {"name": "Trackmania Turbo", "details_link": "https://www.metacritic.com/game/playstation-4/trackmania-turbo", "publisher": "Ubisoft", "release_date": "Mar 22 2016", "developers": ["Nadeo"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to more than 64 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/00b49b8b1cefe80ce717bd30a9b9a443-98.jpg", "descriptions": "Trackmania Turbo features an easy to learn, hard to master gameplay style that relies on time attack racing in which racers set their own limits and challenges. The gameplay centers on the perfect combination of matchbox car fantasy on a massive scale, focusing on the pursuit of the perfectTrackmania Turbo features an easy to learn, hard to master gameplay style that relies on time attack racing in which racers set their own limits and challenges. The gameplay centers on the perfect combination of matchbox car fantasy on a massive scale, focusing on the pursuit of the perfect run around the track. Players test their skills in the campaign mode which includes more than 200 tracks set in four beautiful environments each with their own gameplay style. [Ubisoft]… Expand"}, {"name": "Ratchet: Deadlocked", "details_link": "https://www.metacritic.com/game/playstation-2/ratchet-deadlocked", "publisher": "SCEA", "release_date": "Oct 25 2005", "developers": ["Insomniac Games"], "platforms": ["PlayStation 3", "PlayStation 2"], "num_players": "10  Online", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 81, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/1/fb6c68b9a033fc2436d8cd89554d7ff3-98.jpg", "descriptions": "(Also known as \"Ratchet: Gladiator\" in the UK/EU)  In Ratchet: Deadlocked, Ratchet and Clank are captured and forced to compete on an underground reality combat sport show. The show, which features abducted heroes fighting for their lives against a gruesome gang of deadly Exterminators, is(Also known as \"Ratchet: Gladiator\" in the UK/EU)  In Ratchet: Deadlocked, Ratchet and Clank are captured and forced to compete on an underground reality combat sport show. The show, which features abducted heroes fighting for their lives against a gruesome gang of deadly Exterminators, is run by a deranged media mogul named Gleeman Vox, who intends to use Ratchet and Clank as his next contestants. It doesn't take Vox long to realize that Ratchet is the most promising contestant the show has ever seen. Vox subjects our hero to a series of deadly battles and elaborate games of death, much to the delight of the show's enormous audience. To keep himself and his friends alive, Ratchet has no choice but to participate in the games and keep driving up the show's ratings with spectacular victories -- at least until our heroes can figure out a way to break free from Vox's control, the explosive Deadlock collar fastened to his neck, and bring the mighty Vox Network crashing down. Ratchet: Deadlocked features non-linear gameplay, allowing players greater freedom to choose their missions. In addition, all single-player levels will be available for multiplayer use. With much of the combat taking place in battlefields and arenas, gameplay will be more sports-oriented and will include announcer commentary. Featuring a new mission-structure approach, players will be rewarded with a constant progression of items such as weapons, armor and health. Players can take advantage of the new co-op gameplay functionality available throughout the game by choosing either single-player or multiplayer story mode. In addition, squad-based gameplay will enable players to demolish the competition by commandeering their allied combat bots through critical and strategic battles. [SCEA]… Expand"}, {"name": "Phantom Brave", "details_link": "https://www.metacritic.com/game/playstation-2/phantom-brave", "publisher": "NIS America", "release_date": "Aug 31 2004", "developers": ["Nippon Ichi Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/658a536c1982c99ef26dbd0908311b51-98.jpg", "descriptions": "Phantom Brave is the spiritual successor to 2003's strategy role-playing game \"Disgaea: Hour of Darkness.\"  Enter thirteen-year-old orphan Marona who lives alone on Phantom Isle Island. Marona isn't your average child, as she has the uncanny ability to see and manipulate spirits, one of whomPhantom Brave is the spiritual successor to 2003's strategy role-playing game \"Disgaea: Hour of Darkness.\"  Enter thirteen-year-old orphan Marona who lives alone on Phantom Isle Island. Marona isn't your average child, as she has the uncanny ability to see and manipulate spirits, one of whom happens to be Ash, a swordsman who died alongside Marona's mother and father. Ash serves as a companion and guardian to Marona, counseling her as she works to help people in the surrounding islands who rely on her abilities. Key Phantom Brave features include: No more grids!  Free-roaming battle system allows you to strategically place your characters anywhere you want on the battle field; Create and customize the jobs of your soldiers with over 400 different skills and magical spells; Step-by-step tutorials will have even the novice player up and running in no time; Experience 20 heart-warming episodes spread over 100 hours of game play; Dual language option! Select either the original Japanese voices or the all new English dub. [Atlus Software]… Expand"}, {"name": "LEGO Star Wars II: The Original Trilogy", "details_link": "https://www.metacritic.com/game/xbox-360/lego-star-wars-ii-the-original-trilogy", "publisher": "LucasArts", "release_date": "Sep 12 2006", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/b3bdc423b6a2c0cd16eddc953c4f5e91-98.jpg", "descriptions": "LEGO Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you buildLEGO Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you build and battle your way through your favorite film moments. From Darth Vader's pursuit of Princess Leia aboard her Blockade Runner to Luke's final confrontation with Emperor Palpatine. For the first time ever, characters can get in and out of vehicles, as well as ride creatures. Because it's LEGO style, you can also mix and match the body parts of more than 50 playable characters to create one of millions of possible LEGO Star Wars heroes. And on PS2, Xbox and Windows platforms, a game save from the first LEGO Star Wars can unlock another 50-plus additional characters for Free Play mode -- that's more than 100 total characters. Other exciting additions include free-roaming vehicle levels, the ability to switch ships at will in Free Play mode, cool new character-specific attacks and maneuvers, playable mini-kit vehicles, an adaptive difficulty option and more. [LucasArts]… Expand"}, {"name": "VVVVVV", "details_link": "https://www.metacritic.com/game/pc/vvvvvv", "publisher": "Terry Cavanagh", "release_date": "Jan 11 2010", "developers": ["Terry Cavanagh"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D", "", "Metroidvania"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/c044fd3df998070648c4fc26956b6df3-98.jpg", "descriptions": "VVVVVV is a retro styled 2D platformer by Terry Cavanagh, creator of dozens of free games. You play as the fearless leader of a team of dimension exploring scientists who inadvertently crash, and are separated. The game involves exploring the strange world you've found yourself in, andVVVVVV is a retro styled 2D platformer by Terry Cavanagh, creator of dozens of free games. You play as the fearless leader of a team of dimension exploring scientists who inadvertently crash, and are separated. The game involves exploring the strange world you've found yourself in, and reuniting your friends.\r VVVVVV explores one simple game mechanic: you cannot jump - instead, you reverse your own gravity at the press of a button. The game focuses on playing with this mechanic in a variety of interesting ways.\r The game is designed not to artificially gate your progress. In VVVVVV there are no locks, no power-ups, no switches, nothing to stop you progressing except the challenges themselves.… Expand"}, {"name": "Monster Hunter Freedom Unite", "details_link": "https://www.metacritic.com/game/psp/monster-hunter-freedom-unite", "publisher": "Capcom", "release_date": "Jun 22 2009", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/ce2ad67bc7184d34fe6c0d8a448cf7e9-98.jpg", "descriptions": "The Monster Hunter world is always changing and you will need to be ready for anything - but killing and trapping monsters will always be most important part of your duty. Monster Hunter Freedom Unite is the biggest game of the series so far, letting you adventure with up to three friendsThe Monster Hunter world is always changing and you will need to be ready for anything - but killing and trapping monsters will always be most important part of your duty. Monster Hunter Freedom Unite is the biggest game of the series so far, letting you adventure with up to three friends through over 500 hours of gameplay. In MHFU you can battle previously unseen monsters in new environments, not to mention the many new weapons and armor sets available. From devising the strategy to executing the attack, team play with your friends is going to be key to hunting down the ferocious beasts. MHFU rewards considered tactics and well-executed combat sequences so plan and work together and you will prosper. [Capcom]… Expand"}, {"name": "Tokyo Mirage Sessions #FE Encore", "details_link": "https://www.metacritic.com/game/switch/tokyo-mirage-sessions-fe-encore", "publisher": "Nintendo", "release_date": "Jan 17 2020", "developers": ["Atlus"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/38832341328bc9b0046973fa22b53ffd-98.jpg", "descriptions": "The worlds of the Fire Emblem series and Atlus games have crossed paths again and the result is coming to the Nintendo Switch system. An interdimensional evil has invaded modern-day Tokyo, resulting in this fantastical barrage of music, style, and yes, danger. So, fight back! Battle throughThe worlds of the Fire Emblem series and Atlus games have crossed paths again and the result is coming to the Nintendo Switch system. An interdimensional evil has invaded modern-day Tokyo, resulting in this fantastical barrage of music, style, and yes, danger. So, fight back! Battle through dungeons to pump up your strategy and creatively decimate your foesbefore all hope fades to black. You and the rising stars you call friends will need to call on your own creative powermanifested as iconic Fire Emblem characters -- to wage a secret war on rogue spirits that feed on creativity. Each encounter will immerse you in deep, turn-based battles that blend the combat of the Fire Emblem and Shin Megami Tensei series into one brutal harmony. Fuse items to craft weaponry; then play to your strengths and crush your foes. Around every corner you'll find fun nods to multiple fandoms, including Fire Emblem references, dungeons themed to the entertainment industry, and stunning musical performances.… Expand"}, {"name": "The Sims 4: Discover University", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-discover-university", "publisher": "Electronic Arts", "release_date": "Dec 17 2019", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 81, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/ee764d922583995b5c7540923eabb4ae-98.jpg", "descriptions": "Welcome to Britechester! Begin a new chapter for your Sim when they enroll in the historical University of Britechester or modern Foxbury Institute. Live in a dorm room or off-campus, explore Britechester on a bicycle, spend time in the student commons, and have a study session at theWelcome to Britechester! Begin a new chapter for your Sim when they enroll in the historical University of Britechester or modern Foxbury Institute. Live in a dorm room or off-campus, explore Britechester on a bicycle, spend time in the student commons, and have a study session at the library. Cheer on the student body at a school spirit event and wear school colors to show your Sim's pride.Sims enroll in the University that piques their interest, finding classes in biology, computer science, art history, and even villainy. Attend a lecture or work on term papers and presentations -- the more your Sim learns, the better they will be in careers like teaching, law, and engineering. Going to classes or blowing them off will affect your Sim's grades, so time management is a must.How your Sim embraces college life is up to them. They can study all night to complete homework or chill out and sleep in. And, with activities like juice pong, juggling a soccer ball, and hanging out with roommates, taking a break has never been so fun! Plus, your Sim can join school organizations like robotics, debate, art, or even a mysterious secret society. As the school year progresses, Sims become their best selves and discover who they are meant to be.Make your Sim's space cozy with dorm room décor that reflects their personality with objects like posters and a mini-fridge. Then, develop their personal style in any way you choose -- whether wearing late-for-class sweatpants or their best-self slacks, there's always a way to show school spirit or impress a classmate.… Expand"}, {"name": "Contra Anniversary Collection", "details_link": "https://www.metacritic.com/game/switch/contra-anniversary-collection", "publisher": "Konami", "release_date": "Jun 11 2019", "developers": ["Konami", "M2"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/a2648e6898a6178832d2938e379bc34a-98.jpg", "descriptions": "The Contra Anniversary Collection brings this classic Run and Gun franchise back to modern platforms and a new generation of players. Grab power ups and blast your way through waves of menacing enemies and bosses that will put your reaction skills to the test."}, {"name": "Stellaris: Console Edition", "details_link": "https://www.metacritic.com/game/xbox-one/stellaris-console-edition", "publisher": "Tantalus", "release_date": "Feb 26 2019", "developers": ["Paradox Development Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/a524845e1c3b0d1f4fe85d519ec14db4-98.jpg", "descriptions": "Featuring deep strategic gameplay, an enormous selection of alien races and emergent storytelling, Stellaris has a deeply challenging system that rewards interstellar exploration as you traverse, discover, interact and learn more about the multitude of species you will encounter during yourFeaturing deep strategic gameplay, an enormous selection of alien races and emergent storytelling, Stellaris has a deeply challenging system that rewards interstellar exploration as you traverse, discover, interact and learn more about the multitude of species you will encounter during your travels.\r Etch your name across the cosmos by uncovering remote celestial outposts,and entire civilizations. Will you expand through war or walk the path of diplomacy to achieve your goals?… Expand"}, {"name": "The Sims 4: Seasons", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-seasons", "publisher": "Electronic Arts", "release_date": "Jun 22 2018", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 81, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/0785607a812759098f23fdda2dd86397-98.jpg", "descriptions": "Add weather to your Sims' lives to tell new stories, enjoy seasonal activities, and celebrate heartfelt holidays with The Sims 4: Seasons. Make the most out of the weather all year round, from crisp snowfalls to sweltering heat -- every world is affected by seasons in unique ways! Create aAdd weather to your Sims' lives to tell new stories, enjoy seasonal activities, and celebrate heartfelt holidays with The Sims 4: Seasons. Make the most out of the weather all year round, from crisp snowfalls to sweltering heat -- every world is affected by seasons in unique ways! Create a winter story with ice skating, befriend a magical scarecrow at the fall harvest, share a spring fling during a downpour, or host a summer pool party. Gather friends and family to celebrate holidays complete with traditions, gifts and special guests. Stay warm or keep cool with all-new outfits to brave the elements. Even begin a blossoming gardening career as a botanist or by crafting floral arrangements!… Expand"}, {"name": "Teslagrad", "details_link": "https://www.metacritic.com/game/switch/teslagrad", "publisher": "Soedesco", "release_date": "Dec  7 2017", "developers": ["Rain Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/d59c9a98c874ddf5faaae9a82f9c6e9d-98.jpg", "descriptions": "Teslagrad is a 2D puzzle-platformer, where you play as a young lad who suddenly finds himself embroiled in an ancient conflict that will shake the foundations of his entire existence, and bring a gruesome truth to light.\r The game revolves around the use of electricity and magnetism, andTeslagrad is a 2D puzzle-platformer, where you play as a young lad who suddenly finds himself embroiled in an ancient conflict that will shake the foundations of his entire existence, and bring a gruesome truth to light.\r The game revolves around the use of electricity and magnetism, and your ingenuity will be put to the test as you employ the amazing technology of the Teslamancers to traverse the abandoned Tesla Tower. The game is completely devoid of both text and dialogue, and prefers to tell the story purely through visual means.… Expand"}, {"name": "Call of Duty: Black Ops III", "details_link": "https://www.metacritic.com/game/xbox-one/call-of-duty-black-ops-iii", "publisher": "Activision", "release_date": "Nov  6 2015", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 81, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/b664e2a78ec496c82231116d64f68f09-98.jpg", "descriptions": "In Black Ops 3, Treyarch introduces a new momentum-based chained-movement system which enables players to fluidly move through the environment with finesse, using controlled thrust jumps, slides, wall runs and mantling abilities in a myriad of combinations, all while continuously keepingIn Black Ops 3, Treyarch introduces a new momentum-based chained-movement system which enables players to fluidly move through the environment with finesse, using controlled thrust jumps, slides, wall runs and mantling abilities in a myriad of combinations, all while continuously keeping full control over their weapon. Maps are designed from the ground-up for the new movement system, enabling players to be successful with traditional movement, as well as with advanced tactics and maneuvers.… Expand"}, {"name": "Z.H.P. Unlosing Ranger vs Darkdeath Evilman", "details_link": "https://www.metacritic.com/game/psp/zhp-unlosing-ranger-vs-darkdeath-evilman", "publisher": "NIS America", "release_date": "Oct 25 2010", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PSP"], "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 81, "users_score": 9.7, "image": "https://static.metacritic.com/images/products/games/3/0c617a8d60cee62f8e7f155d48a84c6f-98.jpg", "descriptions": "Known as ZettaiHero Keikakuin Japan, Z.H.P. is the only turn based strategy RPG that allows you to create your own, one and only super hero to fight vicious(?) villains. Players can create a super hero literally from head to toe. If you wish to use drills instead of hands or wheels insteadKnown as ZettaiHero Keikakuin Japan, Z.H.P. is the only turn based strategy RPG that allows you to create your own, one and only super hero to fight vicious(?) villains. Players can create a super hero literally from head to toe. If you wish to use drills instead of hands or wheels instead of legs you can do so by simply swapping out your body parts. Battle maps are all randomly generated for mad replay value and there are tons of character and secret base customization. Z.H.P. gives you the chance to relive your childhood fantasy of making your own superhero and superhero base.… Expand"}, {"name": "NBA 2K7", "details_link": "https://www.metacritic.com/game/playstation-2/nba-2k7", "publisher": "2K Sports", "release_date": "Sep 25 2006", "developers": ["Kush Games", "Visual Concepts"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "10  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/5801244dad7eaedd7fd7082c1ad436e0-98.jpg", "descriptions": "Be a Sharpshooter - The award winning technical achievement of 2K6 is new and improved. Take complete control of all of your shots with the shot stick. Run the Streets - Hit the street courts and showcase your playground game with completely all new streetball mode. Virtual Identity ProfileBe a Sharpshooter - The award winning technical achievement of 2K6 is new and improved. Take complete control of all of your shots with the shot stick. Run the Streets - Hit the street courts and showcase your playground game with completely all new streetball mode. Virtual Identity Profile - Learn the play style of your friends and foes with the V.I.P. System. The Association - Be the GM of your NBA team with the deepest Franchise Mode around. [2K Sports]… Expand"}, {"name": "Saints Row 2", "details_link": "https://www.metacritic.com/game/xbox-360/saints-row-2", "publisher": "THQ", "release_date": "Oct 14 2008", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/2c6bf35888a8d3ee1192c7871e164bea-98.jpg", "descriptions": "Saints Row 2 is set years after the original Saints Row in a Stilwater both familiar and strange. The explosive conclusion to Saints Row has left the player wounded, betrayed and thirsty for revenge, and now it's time to take back the city that has forgotten him. A sequel to the firstSaints Row 2 is set years after the original Saints Row in a Stilwater both familiar and strange. The explosive conclusion to Saints Row has left the player wounded, betrayed and thirsty for revenge, and now it's time to take back the city that has forgotten him. A sequel to the first open-world title on next-generation consoles, Saints Row 2 features all new customization options, including gender, age, voice, crib and gang customization. The sandbox just got larger with a totally transformed and expanded city of Stilwater, offering all new locations to explore with new vehicles, including motorcycles, boats, helicopters and planes. Saints Row 2 is playable online in 2-player co-op through the entire single-player campaign or in the all new open-world competitive multiplayer mode never before seen in the genre. [THQ]… Expand"}, {"name": "Tom Clancy's Rainbow Six Vegas 2", "details_link": "https://www.metacritic.com/game/playstation-3/tom-clancys-rainbow-six-vegas-2", "publisher": "Ubisoft", "release_date": "Mar 18 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 14 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/2a4d798df0d06978502fbfc68d02b462-98.jpg", "descriptions": "Tom Clancy's Rainbow Six Vegas 2 is your last chance to rescue America's sexiest city from an escalating terrorist siege that will force you into heart-pounding action from beginning to end. Sin City is back and bigger than before. Explore all new Vegas hot spots as the environment changesTom Clancy's Rainbow Six Vegas 2 is your last chance to rescue America's sexiest city from an escalating terrorist siege that will force you into heart-pounding action from beginning to end. Sin City is back and bigger than before. Explore all new Vegas hot spots as the environment changes from dusk to bright daylight to dawn, creating a visual experience that is as challenging as it is breathtaking. The multiplayer mode in Tom Clancy's Rainbow Six Vegas has been upgraded to include 11 new, smaller maps that force more intense face-offs, 2 new adversarial modes, more rewards, and easier access to matches using the improved and intuitive matchmaking system. Create your own identity that stays the same in both single player and multiplayer modes and progresses as you do. Reap the benefits of your single player rewards in multiplayer and vice versa. Turn single player mode into co-op mode at any time, just by jumping into the game. Now your friend can jump into your single player game and help you without any change to the story. Single player maps and storyline were created with co-op in mind, which means every map has multiple entry points and the story is the same. AI is more challenging than ever. Now, the terrorists are equipped with thermal vision, night vision, and shields – not to mention a multitude of varying reactions – all of which are guaranteed to give you a new playing experience every time you go into battle. As you progress within the game, you'll only be able to outsmart your enemies by taking advantage of intel opportunities, such as thermal scanning, and tactical strategies, such as leapfrogging. Take down the terrorists more effectively using 11 new weapons. New camouflage, clothing and gear allow you to take customization to the next level. [Ubisoft]… Expand"}, {"name": "Resident Evil 5: Lost in Nightmares", "details_link": "https://www.metacritic.com/game/playstation-3/resident-evil-5-lost-in-nightmares", "publisher": "Capcom", "release_date": "Feb 18 2010", "developers": ["Capcom"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/e13983ef2d875b1d7c19b7164a02d812-98.jpg", "descriptions": "(Downloadable Content)  This is the first installment of new content for RESIDENT EVIL 5. During the main story of RESIDENT EVIL 5, Chris Redfield alludes to a mission where he lost his partner Jill during a conversation with Sheva. Now you can find out what happened during that mission at(Downloadable Content)  This is the first installment of new content for RESIDENT EVIL 5. During the main story of RESIDENT EVIL 5, Chris Redfield alludes to a mission where he lost his partner Jill during a conversation with Sheva. Now you can find out what happened during that mission at Spencer's estate. This package also allows you to unlock two new characters in the all-new The Mercenaries Reunion. Play as one of the unsung heroes of the original RESIDENT EVIL, Barry Burton, or step into the designer-made high heels of one of RESIDENT EVIL's newest villains, Excella Gionne. There are also additional figures available in Extra Figures to round out this action-packed package.… Expand"}, {"name": "Life is Strange: True Colors", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-true-colors", "publisher": "Square Enix", "release_date": "Sep 10 2021", "developers": ["Deck Nine Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 81, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/ca4ca58dfcd74a470bf8c12add992b2d-98.jpg", "descriptions": "A bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!Alex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees asA bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!Alex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees as blazing, colored auras.When her brother dies in a so-called accident, Alex must embrace her volatile power to find the truth and uncover the dark secrets buried by a small town.… Expand"}, {"name": "Wolfenstein: The New Order", "details_link": "https://www.metacritic.com/game/pc/wolfenstein-the-new-order", "publisher": "Bethesda Softworks", "release_date": "May 19 2014", "developers": ["MachineGames"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Shooter", "First-Person", "Historic", "Arcade"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/99ba0ea9b2ef7a7ae490c44876d9567d-98.jpg", "descriptions": "1946: Europe. World War II rages on across Europe. Where the Allies once pressed advantage, the Nazi forces have turned the tide in dramatic fashion behind the technologically advanced war machine of General Wilhelm Strasse, aka Deathshead. When a final Allied assault on Deathshead's1946: Europe. World War II rages on across Europe. Where the Allies once pressed advantage, the Nazi forces have turned the tide in dramatic fashion behind the technologically advanced war machine of General Wilhelm Strasse, aka Deathshead. When a final Allied assault on Deathshead's compound fails, the Allies’ greatest hope falls with it. 1960: Europe. The war is over. And the Nazis are triumphant victors. Using unrelenting force and brutal intimidation, the Nazis have brought even the most powerful nations to their knees. The Nazi regime now rules the globe with an iron fist. You are Captain B.J. Blazkowicz, the American War Hero. After delving into this world of darkness, you must launch an impossible counter-offensive against the monstrous Nazi regime. Only you dare stand up against an unstoppable army of Nazi robots and hulking Super Soldiers. Only you can stop Deathshead. Only you can rewrite history.… Expand"}, {"name": "Fallout: New Vegas - Old World Blues", "details_link": "https://www.metacritic.com/game/playstation-3/fallout-new-vegas---old-world-blues", "publisher": "Bethesda Softworks", "release_date": "Jul 19 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/8a72820ef1bcbf4665a6a7653a2038c0-98.jpg", "descriptions": "In Old World Blues, releasing in June, you will discover how some of the Mojave’s mutated monsters came to be when you unwittingly become a lab rat in a science experiment gone awry. You’ll need to scour the Pre-War research centers of the Big Empty in search of technology to turn the tablesIn Old World Blues, releasing in June, you will discover how some of the Mojave’s mutated monsters came to be when you unwittingly become a lab rat in a science experiment gone awry. You’ll need to scour the Pre-War research centers of the Big Empty in search of technology to turn the tables on your kidnappers or join forces with them against an even greater threat.… Expand"}, {"name": "Super Mega Baseball 2", "details_link": "https://www.metacritic.com/game/xbox-one/super-mega-baseball-2", "publisher": "Metalhead Software", "release_date": "May  1 2018", "developers": ["Metalhead Software"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Baseball", "Arcade"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/b17ffba4baba81157b30b9b90dfafe67-98.jpg", "descriptions": "The  makers  of Super  Mega  Baseball have  returned  with  a brand new, streamlined baseball simulator that’ll keep you coming  back for  more.  Build  your  dream  team  and  challenge your  opponents  to  a  good  old-fashioned  game  of  hardball, online and off."}, {"name": "Paradise Killer", "details_link": "https://www.metacritic.com/game/switch/paradise-killer", "publisher": "Fellow Traveller", "release_date": "Sep  4 2020", "developers": ["Kaizen Game Works"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/a02bee4a907260fc290cce6dc3c07804-98.jpg", "descriptions": "An island outside of reality. A rogue human civilization hoping to resurrect dead alien gods. A murder behind locked doors. Paradise is an island that regenerates every few millennia. The psychic power that the alien worshipers within release into the universe is meant to feed and eventuallyAn island outside of reality. A rogue human civilization hoping to resurrect dead alien gods. A murder behind locked doors. Paradise is an island that regenerates every few millennia. The psychic power that the alien worshipers within release into the universe is meant to feed and eventually resurrect their fallen deities. But this force also attracts undesired interest from demons, who eventually corrupt each island — until a new alternate reality is birthed by the Council. The system isn’t perfect, but it will be one day — on Perfect 25, the next island-to-be. But on the eve of rebirth, the Council is murdered and Paradise is killed. In the aftermath, the “investigation freak” Lady Love Dies is summoned from exile to find the culprit. This is the crime to end all crimes. What are the facts? What are the truths? Are they the same?… Expand"}, {"name": "Remnant: From the Ashes - Swamps of Corsus", "details_link": "https://www.metacritic.com/game/pc/remnant-from-the-ashes---swamps-of-corsus", "publisher": "Perfect World Entertainment", "release_date": "Apr 28 2020", "developers": ["Gunfire Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 81, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/a2965bba8087ada04ff603369f1e9710-98.jpg", "descriptions": "Remnant: From the Ashes – Swamps of Corsus requires ownership of Remnant: From the Ashes to play. Begin your journey across the dangerous and corrupted worlds of Remnant: From the Ashes with a new mode and expanded map content in the Swamps of Corsus DLC. New Mode - Survival. Fight for yourRemnant: From the Ashes – Swamps of Corsus requires ownership of Remnant: From the Ashes to play. Begin your journey across the dangerous and corrupted worlds of Remnant: From the Ashes with a new mode and expanded map content in the Swamps of Corsus DLC. New Mode - Survival. Fight for your life in this new rogue-like game mode! Start off your adventure with nothing but a pistol, some scrap and the skin on your back. Travel randomly through corrupted World Stones to different biomes, scrap-up gear, fight insanely-difficult bosses and test your endurance on how long you can resist The Root’s influence. The Iskal Rise. The swamps of Corsus swarm with new content! Discover a new zone in Adventure Mode, fight new bosses, experience new stories, participate in new events, find new quests, and more. Lock & Load. Pick up new items, new armor and skins, new weapons, new mods and new traits. Armor Skins. By defeating bosses in Survival Mode, or the Hard and Nightmare difficulties in Campaign and Adventure Mode, earn Glowing Shards which you can use to purchase alternate armor skins for every piece of armor available in the game. … Expand"}, {"name": "World of Final Fantasy Maxima", "details_link": "https://www.metacritic.com/game/xbox-one/world-of-final-fantasy-maxima", "publisher": "Square Enix", "release_date": "Nov  6 2018", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/1958d7f755f403b7c879e69e2b8ef4e6-98.jpg", "descriptions": "POWERED UP AND REBORN!Expanding the horizons of FINAL FANTASY! A tale of many encounters and the birth of a new world.\n\nOriginally released in October 2016, WORLD OF FINAL FANTASY has just been powered up and reborn as WORLD OF FINAL FANTASY Maxima! New characters from FF lore (Champions)POWERED UP AND REBORN!Expanding the horizons of FINAL FANTASY! A tale of many encounters and the birth of a new world.Originally released in October 2016, WORLD OF FINAL FANTASY has just been powered up and reborn as WORLD OF FINAL FANTASY Maxima! New characters from FF lore (Champions) and monsters (Mirages) add even more fun and excitement to this unique adventure. This new and enhanced version of WORLD OF FINAL FANTASY also features the Avatar Change system, which allows the protagonists, Reynn and Lann, to fight as Champions. Fight your way through exhilarating battles as legendary FINAL FANTASY heroes!… Expand"}, {"name": "Mega Man Anniversary Collection", "details_link": "https://www.metacritic.com/game/playstation-2/mega-man-anniversary-collection", "publisher": "Capcom", "release_date": "Jun 22 2004", "developers": ["Atomic Planet Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Miscellaneous", "Compilation"], "meta_score": 81, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/d478be7392baeba140c3f615b26912a0-98.jpg", "descriptions": "Challenge yourself with some of the most extreme Mega Man titles ever released while unlocking a cache of bonus features in this special collection to celebrate Mega Man's 15th Anniversary. For the first time ever, play the original Mega Man 1 through 8 series and 2 never-before-released inChallenge yourself with some of the most extreme Mega Man titles ever released while unlocking a cache of bonus features in this special collection to celebrate Mega Man's 15th Anniversary. For the first time ever, play the original Mega Man 1 through 8 series and 2 never-before-released in the U.S. arcade games on your PlayStation 2 computer entertainment system! [Capcom]… Expand"}, {"name": "The Sims Bustin' Out", "details_link": "https://www.metacritic.com/game/playstation-2/the-sims-bustin-out", "publisher": "EA Games", "release_date": "Dec 15 2003", "developers": ["Maxis"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/eacfd738b983c9d5a86ee9726934963f-98.jpg", "descriptions": "The Sims are making a big return to the console and this time they are bustin' out of the house and exploring all-new locations around town. In The Sims Bustin' Out, players can choose from a variety of new career paths. Along the way, players can unlock and collect over a hundred of newThe Sims are making a big return to the console and this time they are bustin' out of the house and exploring all-new locations around town. In The Sims Bustin' Out, players can choose from a variety of new career paths. Along the way, players can unlock and collect over a hundred of new objects and social moves exclusive to the console. Play, work, and socialize with a cast of over 25 new outrageous characters and climb through a dozen new careers. The Sims Bustin' Out also features new integrated two-player gameplay and memory card support, for those players who like to take their Sims over to a friend's house and show them off. [Electronic Arts]… Expand"}, {"name": "Mortal Kombat: Deadly Alliance", "details_link": "https://www.metacritic.com/game/xbox/mortal-kombat-deadly-alliance", "publisher": "Midway", "release_date": "Nov 18 2002", "developers": ["Midway"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/e34af1ddb1c0620947cbcc8b8f8f0f47-98.jpg", "descriptions": "A controversial franchise marks its return in Mortal Kombat:  Deadly Alliance.  This time around, the fighting game features an all-new fighting system, an in-depth, supernatural storyline, and the infamous brutal fatalities.  Beginning the next chapter in the battle of good versus evil, twoA controversial franchise marks its return in Mortal Kombat:  Deadly Alliance.  This time around, the fighting game features an all-new fighting system, an in-depth, supernatural storyline, and the infamous brutal fatalities.  Beginning the next chapter in the battle of good versus evil, two powerful sorcerers--Shang Tsung and Quan Chi--join forces to deliver unrivaled fighting action in their quest for supreme mortality.  Use new or classic Mortal Kombat fighters and engage in hand-to-hand and special-weapon combat, executing secret moves and combinations for fatalities and deadly body blows.… Expand"}, {"name": "Medal of Honor Frontline", "details_link": "https://www.metacritic.com/game/xbox/medal-of-honor-frontline", "publisher": "EA Games", "release_date": "Nov 10 2002", "developers": ["EA LA"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/3890eca577a5ea62601e399c9098e896-98.jpg", "descriptions": "Head back behind enemy lines with Lt.  Jimmy Patterson in Medal of Honor Frontline.  In this installment of the Medal of Honor series, Lt.  Patterson is on a mission to infiltrate the German frontline and steal the HO-IX flying wing, an experimental Nazi weapon so powerful it could turn theHead back behind enemy lines with Lt.  Jimmy Patterson in Medal of Honor Frontline.  In this installment of the Medal of Honor series, Lt.  Patterson is on a mission to infiltrate the German frontline and steal the HO-IX flying wing, an experimental Nazi weapon so powerful it could turn the tide of World War II.  All 20 levels and six major missions in the game are based on real World War II events.  You'll also find authentic weapons, including the Colt .45, Springfield sniper rifle, Panzerschreck rocket launcher, and Browning automatic rifle.  The World War II experience just got more intense.… Expand"}, {"name": "NHL Hitz 20-03", "details_link": "https://www.metacritic.com/game/xbox/nhl-hitz-20-03", "publisher": "Midway", "release_date": "Sep 16 2002", "developers": ["Black Box"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Arcade"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/929d46080735e645b6a8eb88afd8a0a8-98.jpg", "descriptions": "In the world of NHL Hitz 20-03, hard-checking and highlight-reel action is common. This year's installment in the action-packed NHL Hitz series showcases three-on-three gameplay with players who leap, glide, check, pass, and score on defenders. New features include a deeper New Season mode,In the world of NHL Hitz 20-03, hard-checking and highlight-reel action is common. This year's installment in the action-packed NHL Hitz series showcases three-on-three gameplay with players who leap, glide, check, pass, and score on defenders. New features include a deeper New Season mode, player trades, a playoff tree, and official NHL awards. The game also boasts bigger, stronger, and faster players, plus improved goalie logic, behavior, animations, and control, making it tougher to score.… Expand"}, {"name": "Star Wars: Jedi Starfighter", "details_link": "https://www.metacritic.com/game/playstation-2/star-wars-jedi-starfighter", "publisher": "LucasArts", "release_date": "Mar 10 2002", "developers": ["LucasArts"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/7608a1e188a320aca6afeada5ab486bf-98.jpg", "descriptions": "The galaxy is in turmoil as the events of Star Wars: Episode II rapidly approach. Mace Windu dispatches one of the Council's top Jedi - Adi Gallia - to investigate disturbances in the Karthakk system, as a secessionist movement threatens to expand. Using the Republic's new prototype JediThe galaxy is in turmoil as the events of Star Wars: Episode II rapidly approach. Mace Windu dispatches one of the Council's top Jedi - Adi Gallia - to investigate disturbances in the Karthakk system, as a secessionist movement threatens to expand. Using the Republic's new prototype Jedi starfighter, Adi Gallia sets out on missions which lead into events depicted in the Star Wars: Episode II film. She quickly gains an upper hand in space battles through Force powers, but will these be enough to counter the massive fleet of the evil Captain Toth and a mysterious figure that threatens the very foundations of the Galactic Republic system? [LucasArts]… Expand"}, {"name": "FIFA Soccer 2002", "details_link": "https://www.metacritic.com/game/gamecube/fifa-soccer-2002", "publisher": "EA Sports", "release_date": "Nov 21 2001", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/50734fd9eb6810a8f0296c5027d9ab17-98.jpg", "descriptions": "As the first and only soccer game available for the GameCube, FIFA 2002 is an excellent start."}, {"name": "TimeSplitters", "details_link": "https://www.metacritic.com/game/playstation-2/timesplitters", "publisher": "Eidos Interactive", "release_date": "Oct 23 2000", "developers": ["Free Radical Design"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/9c3819b891d446af7236aab256864ee5-98.jpg", "descriptions": "In the hundred years spanning the millennium (1935 - 2035), a disparate bunch of heroes and villains battle against their own challenges. Although each is unaware of the others, they all share an ageless common spirit of adventure - but unknown to them, their daring actions have attractedIn the hundred years spanning the millennium (1935 - 2035), a disparate bunch of heroes and villains battle against their own challenges. Although each is unaware of the others, they all share an ageless common spirit of adventure - but unknown to them, their daring actions have attracted the attention of the TimeSplitters.\r The TimeSplitters - an evil race dwelling outside of time and space. For eons they have manipulated the fate of humanity for their own malign ends - with cursed shards of crystal they have sown fear, greed and conflict throughout history. Now, roused from an ancient sleep, the TimeSplitters cross the threshold from their shadowy dimension - ripping through the fabric of time itself to confront our heroes.\r Can our heroes unite against a common enemy to realize a greater destiny? Or will humanity be consigned forever to a realm ruled under the shadow of the TIMESPLITTERS?\r… Expand"}, {"name": "Downwell", "details_link": "https://www.metacritic.com/game/pc/downwell", "publisher": "Devolver Digital", "release_date": "Oct 15 2015", "developers": ["Moppin"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 81, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/69e571105171a930c14650860c0ec3a2-98.jpg", "descriptions": "Downwell is a curious game about a young person venturing down a well in search of untold treasures with only his Gunboots to protect him."}, {"name": "From Dust", "details_link": "https://www.metacritic.com/game/playstation-3/from-dust", "publisher": "Ubisoft", "release_date": "Sep 13 2011", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Strategy", "Adventure", "General", "General", "General"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/a2950c8b7b5349779a5e707fda3caa94-98.jpg", "descriptions": "From Dust is a Modern God Game where Nature is the Star."}, {"name": "Phoenix Wright: Ace Attorney - Dual Destinies", "details_link": "https://www.metacritic.com/game/3ds/phoenix-wright-ace-attorney---dual-destinies", "publisher": "Capcom", "release_date": "Oct 24 2013", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Visual Novel"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/eee2e8f8c8b36f1debc1a41a169fd74b-98.jpg", "descriptions": "Dual Destinies brings us the return of courtroom hero Phoenix Wright. Set 8 years after his last appearance in the courts, the first case in Phoenix Wright: Ace Attorney - Dual Destinies sees the action start in a destroyed court room. It's up to Phoenix Wright and his team at the WrightDual Destinies brings us the return of courtroom hero Phoenix Wright. Set 8 years after his last appearance in the courts, the first case in Phoenix Wright: Ace Attorney - Dual Destinies sees the action start in a destroyed court room. It's up to Phoenix Wright and his team at the Wright Anything Agency to discover the cause of the destruction. Players have to battle it out in court against Gaspen Payne, the younger brother of Winston Payne from previous Ace Attorney titles, as they defend the accused.… Expand"}, {"name": "Lone Survivor", "details_link": "https://www.metacritic.com/game/pc/lone-survivor", "publisher": "superflat games", "release_date": "Apr 23 2012", "developers": ["superflat games"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/f2d61199185f733d6373492686da97c1-98.jpg", "descriptions": "Experience a new and unique adult psychological horror."}, {"name": "NCAA Football 08", "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-football-08", "publisher": "EA Sports", "release_date": "Jul 17 2007", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/043675e431ac64534c202c05cf401e5b-98.jpg", "descriptions": "In NCAA Football 08, players look to be a leader and become a legend on the field. With all-new Leadership Control, players now lead by example and control the action on the field and can increase their sphere of influence by improving their players' personal ratings on each big play. ForIn NCAA Football 08, players look to be a leader and become a legend on the field. With all-new Leadership Control, players now lead by example and control the action on the field and can increase their sphere of influence by improving their players' personal ratings on each big play. For the first time, the game features a new and deeper recruiting system and an all-new Campus Legend mode. [Electronic Arts]… Expand"}, {"name": "The Lion's Song", "details_link": "https://www.metacritic.com/game/switch/the-lions-song", "publisher": "Mi'pu'mi Games", "release_date": "Jul 10 2018", "developers": ["Mi'pu'mi Games"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/10cc9a73b59f8e8c69083c98b88aa749-98.jpg", "descriptions": "The Lion’s Song is a narrative adventure game. It is steeped in early 20th century history and focuses on a cast of Austrian artists and scientists with each episode taking a closer look at their intimate struggles with creativity and inspiration. The Lion's Song is set against the backdropThe Lion’s Song is a narrative adventure game. It is steeped in early 20th century history and focuses on a cast of Austrian artists and scientists with each episode taking a closer look at their intimate struggles with creativity and inspiration. The Lion's Song is set against the backdrop of early 20th century Austria with every episode following a different character. Each character possesses an exceptional mind and the game draws players into a story of personal struggle for creativity, human connections and inspiration: a talented composer suffering from writer's block just before her breakthrough concert, an up-and-coming painter growing through his challenges and a brilliant mathematician trying to make her voice heard in a men's world. The choices players make in \"The Lion's Song\" will have a direct impact on the story lines of all future episodes and ultimately determine if the protagonists do find the success they are working for. [Nintendo]\r… Expand"}, {"name": "Deus Ex: Mankind Divided - A Criminal Past", "details_link": "https://www.metacritic.com/game/playstation-4/deus-ex-mankind-divided---a-criminal-past", "publisher": "Square Enix", "release_date": "Feb 23 2017", "developers": ["Eidos Montreal"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/2c31eb9415239d141f6b53f9b0770924-98.jpg", "descriptions": "Experience Adam Jensen’s first mission for TF29, set before the events of Mankind Divided. Posing as a convicted criminal, Jensen is transferred deep into a hostile, high-security prison for augmented felons. His mission: Track down and retrieve sensitive information from a fellow undercoverExperience Adam Jensen’s first mission for TF29, set before the events of Mankind Divided. Posing as a convicted criminal, Jensen is transferred deep into a hostile, high-security prison for augmented felons. His mission: Track down and retrieve sensitive information from a fellow undercover agent who has gone dark. Success will help the fight against terror around the world, but Jensen will need to confront a darker side to his role before the day is done.… Expand"}]