[{"name": "Madden NFL 09", "details_link": "https://www.metacritic.com/game/playstation-3/madden-nfl-09", "publisher": "Electronic Arts", "release_date": "Aug 12 2008", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 85, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/c13ac8a213eea7f6837d7e4d27ddeed8-98.jpg", "descriptions": "For passionate Madden NFL fans, this year's iteration promises to take authenticity and depth of gameplay to an entirely new level with more than 85 new features and enhancements, including the all-new Virtual Trainer tutorial mode. Utilizing a holographic environment, this mode teachesFor passionate Madden NFL fans, this year's iteration promises to take authenticity and depth of gameplay to an entirely new level with more than 85 new features and enhancements, including the all-new Virtual Trainer tutorial mode. Utilizing a holographic environment, this mode teaches gamers simple concepts about playing football and how to use the controls in quick, fun and stylized drills. In Madden NFL 09, the game engine is continually assessing the player's performance and adapst a custom experience to every type of gamer, from newcomer to the veteran Madden NFL player. Madden NFL 09 also features a network-inspired broadcast presentation. Players benefit from the authentic football knowledge of an in-booth play-by-play and color commentary team featuring Cris Collinsworth and Tom Hammond. In addition, numerous graphical enhancements have been made, including realistic weather and grass, sleeker player models and exterior stadium views. Madden NFL 09 gives gamers the ability to create online leagues. Avid Madden NFL fans can now take their rivalries online and compete in leagues with up to 32 teams. Online league play features in-depth stat tracking, player trades and a flexible scheduling option. [Electronic Arts]… Expand"}, {"name": "Guitar Hero III: Legends of Rock", "details_link": "https://www.metacritic.com/game/xbox-360/guitar-hero-iii-legends-of-rock", "publisher": "Activision", "release_date": "Oct 28 2007", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/5a0447c78079e197c40714f03963c8bb-98.jpg", "descriptions": "Fire up the fretboard, crank up the amp and get ready to rock like never before. Guitar Hero III: Legends of Rock drops you into the spotlight of the largest and most legendary rock concert ever. The star-studded soundtrack includes master tracks by such legendary artists as Guns N’ Roses,Fire up the fretboard, crank up the amp and get ready to rock like never before. Guitar Hero III: Legends of Rock drops you into the spotlight of the largest and most legendary rock concert ever. The star-studded soundtrack includes master tracks by such legendary artists as Guns N’ Roses, The Rolling Stones, Beastie Boys, Muse and Pearl Jam, with added songs as made legendary by Kiss, Alice Cooper and Heart. Now drop that air guitar, tune your exclusive new Les Paul Guitar Controller and shred the night away with Guitar Hero III: Legends of Rock. [Activision]… Expand"}, {"name": "NHL 20", "details_link": "https://www.metacritic.com/game/xbox-one/nhl-20", "publisher": "Electronic Arts", "release_date": "Sep 10 2019", "developers": ["Electronic Arts"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 85, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/9/c69193dbba76bc4b34dd137dcd24e248-98.jpg", "descriptions": "EA SPORTS NHL 20 introduces cutting-edge gameplay innovation to showcase your skills, more customization to unlock your style, and new modes to compete with friends.\r RPM Tech-powered gameplay introduces Signature Shots that replicate your favourite NHL players' real-world shot styles.EA SPORTS NHL 20 introduces cutting-edge gameplay innovation to showcase your skills, more customization to unlock your style, and new modes to compete with friends.\r RPM Tech-powered gameplay introduces Signature Shots that replicate your favourite NHL players' real-world shot styles. Over 45 new shot animations make every attack a threat, and new passing and puck pick-ups create faster, fluid gameplay executed at full speed.\r A revamped broadcast package delivers all-new visuals and commentary. Combined with over 1,100 new customization items for your club and character, your biggest goals look incredible during the action and in the highlight reel.\r Finally, NHL 20 adds three new game modes. HUT Squad Battles features weekly teams, built by athletes and artists, to challenge for unique rewards. The fan-favourite ONES can now be played with friends on the couch, and the all-new Eliminator mode in World of CHEL introduces a winner-take-all competition where you and your friends compete to be the best in the barn.… Expand"}, {"name": "The Sly Collection", "details_link": "https://www.metacritic.com/game/playstation-3/the-sly-collection", "publisher": "SCEA", "release_date": "Nov  9 2010", "developers": ["Sanzaru Games"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Miscellaneous", "Compilation", "Compilation"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/f1cedc7aad64409d211d80ac3555f723-98.jpg", "descriptions": "Developed exclusively for the PS3, The Sly Collection (Also known as \"The Sly Trilogy\") features three PlayStation 2 action-packed classic hits (Sly Cooper and the Thievius Racconus, Sly 2: Band of Thieves and Sly 3: Honor Among Thieves) fully remastered in high definition and delivered on aDeveloped exclusively for the PS3, The Sly Collection (Also known as \"The Sly Trilogy\") features three PlayStation 2 action-packed classic hits (Sly Cooper and the Thievius Racconus, Sly 2: Band of Thieves and Sly 3: Honor Among Thieves) fully remastered in high definition and delivered on a single Blu-Ray Disc. In addition to crisp picture quality and stunning visual graphics, The Sly Collection contains extra features and content, such as Sly 3: Honor Among Thieves in 3-D and all-new PlayStation Move mini-games that showcase the latest technology for a fun and immersive experience on the PS3 system.… Expand"}, {"name": "Tatsunoko vs. Capcom: Ultimate All-Stars", "details_link": "https://www.metacritic.com/game/wii/tatsunoko-vs-capcom-ultimate-all-stars", "publisher": "Capcom", "release_date": "Jan 26 2010", "developers": ["Eighting"], "platforms": "Wii", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/c60db6b2477da4bb3e4845e4db7dd9af-98.jpg", "descriptions": "Capcom's popular and critically acclaimed ‘VS’ fighting series is getting an all new next-generation introduction. Tatsunoko vs. Capcom pits Capcom’s iconic characters against Tatsunoko Productions anime superheroes. This clash of heroes face off in two-on-two battles for the ultimate 2DCapcom's popular and critically acclaimed ‘VS’ fighting series is getting an all new next-generation introduction. Tatsunoko vs. Capcom pits Capcom’s iconic characters against Tatsunoko Productions anime superheroes. This clash of heroes face off in two-on-two battles for the ultimate 2D tag-team battle. Originally released in Japanese arcades in the Fall of 2008, the original Tatsunoko vs. Capcom moved to the Wii console on December 11, 2008. This fighter blends these two rich universes by taking Capcom characters like Ryu from Street Fighter, Morrigan from Darkstalkers and the giant PTX-40A from Lost Planet and putting them against Tatsunoko fan-favorite characters from Gatchaman, Hurricane Polymar, Casshern and more. It’s a battler oyale that delivers match-ups that only exist in fans wildest dreams! Unlike the more well-known six-button layout that the Street Fighter franchise pioneered, the VS line features a simplified four button system: Weak, Medium, Strong and Assist for the tag-team option of. The Assist feature adds another compelling element found Capcom’s other VS series: allowing players to switch their character on the fly or call for help from their tag-team partner, allowing for spectacular super moves (Hyper Variable Combination). Successful execution of the Assist feature can turn the tide of battle on a dime. Historically the VS series excels in integrating the tag-team options by including customized moves like Variable Assist, Snapback, and the previously mentioned Hyper Variable combination that lets both characters on one team perform their Hyper attack. TvC enhances the above gameplay with new mechanics, including the Variable Aerial Rave that allows characters to be switched in the middle of an Aerial rave. More moves include the offensive Assault and defensive maneuver Mega Crash. Another new gameplay mechanic, titled Baroque, illuminates the character in a rainbow of colors, cancels the current attack and extends combos and damage. Featuring a robust line-up of characters, the console version added four mini-games and optional control schemes. [Capcom]… Expand"}, {"name": "Crusader Kings III", "details_link": "https://www.metacritic.com/game/playstation-5/crusader-kings-iii", "publisher": "Paradox Interactive", "release_date": "Mar 29 2022", "developers": ["Lab42"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "genres": ["Strategy", "Real-Time", "General"], "meta_score": 85, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/4f568956f98a9959c88eac9132de80a7-98.jpg", "descriptions": "Paradox Development Studio brings you the sequel to one of the most popular strategy games ever made. Crusader Kings III is the heir to a long legacy of historical grand strategy experiences and arrives with a host of new ways to ensure the success of your royal house."}, {"name": "Thronebreaker: The Witcher Tales", "details_link": "https://www.metacritic.com/game/xbox-one/thronebreaker-the-witcher-tales", "publisher": "CD Projekt Red Studio", "release_date": "Dec  4 2018", "developers": ["CD Projekt Red Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Strategy", "Turn-Based", "Card Battle"], "meta_score": 85, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/72d971588cfa849b0bee16b67ce6b2f9-98.jpg", "descriptions": "From the creators of The Witcher 3: Wild Hunt comes a brand new tale set in the brutal and twisted universe of witcher Geralt of Rivia. The world stands on the verge of chaos, as the tensions between the power-hungry Nilfgaardian Empire and proud Northern Realms grow. Facing an imminentFrom the creators of The Witcher 3: Wild Hunt comes a brand new tale set in the brutal and twisted universe of witcher Geralt of Rivia. The world stands on the verge of chaos, as the tensions between the power-hungry Nilfgaardian Empire and proud Northern Realms grow. Facing an imminent invasion, Meve — war-veteran Queen of Lyria and Rivia — is forced to once again enter the warpath, and set out on a dark journey of destruction and revenge.… Expand"}, {"name": "Sam & Max Episode 205: What's New, Beelzebub?", "details_link": "https://www.metacritic.com/game/pc/sam-max-episode-205-whats-new-beelzebub", "publisher": "Telltale Games", "release_date": "Apr 10 2008", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Point-and-Click", "Third-Person"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/10c65ef1fac564e1ae16cbd09f037bee-98.jpg", "descriptions": "Judgment day is at hand, and it's time for a showdown with the guy downstairs to bargain for Bosco's soul. But in the corporate wasteland known as Hell, not even the Freelance Police are safe from eternal damnation. Can Sam & Max fight free from Satan's grasp, or have they reached the end ofJudgment day is at hand, and it's time for a showdown with the guy downstairs to bargain for Bosco's soul. But in the corporate wasteland known as Hell, not even the Freelance Police are safe from eternal damnation. Can Sam & Max fight free from Satan's grasp, or have they reached the end of the line? [Telltale Games]… Expand"}, {"name": "Daxter", "details_link": "https://www.metacritic.com/game/psp/daxter", "publisher": "SCEA", "release_date": "Mar 14 2006", "developers": ["Ready at Dawn"], "platforms": "PSP", "num_players": "24  Online", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/1789059cc6dbb132f3de0155fcd0c535-98.jpg", "descriptions": "Daxter is centered around the world of the lovable orange ottsel made popular in the Jak and Daxter franchise. The story unfolds as Daxter searches for Jak, who was imprisoned during the events that led to the start of \"Jak II.\" Daxter, now on his own in an unfamiliar place, quickly realizesDaxter is centered around the world of the lovable orange ottsel made popular in the Jak and Daxter franchise. The story unfolds as Daxter searches for Jak, who was imprisoned during the events that led to the start of \"Jak II.\" Daxter, now on his own in an unfamiliar place, quickly realizes that being small and furry won't help his chances of survival. To help stamp out a mysterious metalbug infestation, Daxter takes on a job as a pest exterminator, enabling him to explore parts of Haven City in an effort to collect the clues that will lead him to Jak. Daxter allows gamers to play from his perspective offering a distinctive set of moves with agile abilities that allows players to climb walls, creep up on enemies, fit in small places and maneuver vehicles. Taking a job as a pest exterminator, to fight an ongoing invasion of metal-bugs, Daxter comes equip with gadgets to rid the city of these metal nuisances. Get close up and personal by using your flimsy bug swatter to squash an army of attacking insects or your spray gun to hover around a variety of environments while picking up various upgrades. [SCEA]… Expand"}, {"name": "Dragon Age: Inquisition", "details_link": "https://www.metacritic.com/game/pc/dragon-age-inquisition", "publisher": "Electronic Arts", "release_date": "Nov 18 2014", "developers": ["BioWare"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["PC-style RPG", "Role-Playing", "General", "Action RPG", "Western-Style"], "meta_score": 85, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/4269cbfeac2771958710a280c643af07-98.jpg", "descriptions": "Select and lead a group of characters into harrowing battles against a myriad of enemies – from earth-shattering High Dragons to demonic forces from the otherworld of the Fade. Go toe-to-toe in visceral, heroic combat as your acolytes engage at your side, or switch to tactical view toSelect and lead a group of characters into harrowing battles against a myriad of enemies – from earth-shattering High Dragons to demonic forces from the otherworld of the Fade. Go toe-to-toe in visceral, heroic combat as your acolytes engage at your side, or switch to tactical view to coordinate lethal offensives using the combined might of your party. Observe the tangible, visible results of your journey through a living world – build structures, customize outposts, and change the landscape itself as environments are re-honed in the wake of your Inquisition. Helm a party chosen from nine unique, fully-realized characters – each of whom react to your actions and choices differently, crafting complex relationships both with you and with each other. Create your own character from multiple races, customize their appearance, and amalgamate their powers and abilities as the game progresses. Enhanced customization options allow you to pick everything from the color of your follower’s boots to the features of your Inquisition stronghold. Become a change agent in a time of uncertainty and upheaval.  Shape the course of your empires, bring war or peace to factions in conflict, and drive the ultimate fate of the Inquisition. Will you bring an end to the cataclysmic anarchy gripping the Dragon Age? [Electronic Arts]… Expand"}, {"name": "Tales from the Borderlands: A Telltale Game Series", "details_link": "https://www.metacritic.com/game/pc/tales-from-the-borderlands-a-telltale-game-series", "publisher": "Take-Two Interactive", "release_date": "Oct 20 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/c8faaf0fa4755d1fb92bd835c3ef5efa-98.jpg", "descriptions": "Like all good tales, there’s more than one side to a story. Especially one about a Vault key, the Hyperion Corporation, bandits, loot, gangsters, Vault Hunters, secret Atlas tech, explosions, getaways, extortion, betrayal, and mayhem. Set after the events seen in Borderlands 2, Tales fromLike all good tales, there’s more than one side to a story. Especially one about a Vault key, the Hyperion Corporation, bandits, loot, gangsters, Vault Hunters, secret Atlas tech, explosions, getaways, extortion, betrayal, and mayhem. Set after the events seen in Borderlands 2, Tales from the Borderlands is about Rhys, a Hyperion company man looking to become the next Handsome Jack, and it’s also about Fiona, a Pandoran con artist out to score the biggest of all swindles. Lured into danger by a Vault key and all it promises, the unlikely duo are thrown together with a common goal and a huge amount of mistrust. Who is telling the truth, and why is it important That’s up to you to decide. You are Rhys…and you are also Fiona, because like every tale worth telling, there are two…oh, you read that part already? Well, it’s important to remember that there *are* two sides to every story, and you my friend, you will tell this tale, or…tales, through the choices that you make. Your every decision as both Rhys and Fiona will affect the people and world around you: this is a game where YOU are the final author in a brand new Borderlands story set on the unforgiving world of Pandora. [TellTale Games]… Expand"}, {"name": "Hearthstone: Heroes of Warcraft - Whispers of the Old Gods", "details_link": "https://www.metacritic.com/game/pc/hearthstone-heroes-of-warcraft---whispers-of-the-old-gods", "publisher": "Blizzard Entertainment", "release_date": "Apr 26 2016", "developers": ["Blizzard Entertainment"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 85, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/7/d52a11e491c136e238a037390952691e-98.jpg", "descriptions": "This sinister expansion revolves around the dark influence of the Old Gods, ancient and unspeakably evil creatures that have long lay hidden, imprisoned in the dark places of the world millennia ago. Despite their imprisonment, these shadowy beings' influence can be felt in every corner ofThis sinister expansion revolves around the dark influence of the Old Gods, ancient and unspeakably evil creatures that have long lay hidden, imprisoned in the dark places of the world millennia ago. Despite their imprisonment, these shadowy beings' influence can be felt in every corner of Azeroth, twisting and corrupting any who hear their maddening whispers. With an army of followers performing forbidden empowerment rituals, the tentacles of these massive horrors are growing rapidly toward the light, eager to bring their own kind of excitement to the sunlit kingdoms and merry taverns of Azeroth.… Expand"}, {"name": "Among Us", "details_link": "https://www.metacritic.com/game/pc/among-us", "publisher": "Innersloth", "release_date": "Nov 16 2018", "developers": ["Innersloth"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 15 ", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 85, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/c92a41806f8829f33d60d5a0796508cb-98.jpg", "descriptions": "An online and local party game of teamwork and betrayal for 4-10 players...in space!"}, {"name": "MLB 08: The Show", "details_link": "https://www.metacritic.com/game/playstation-3/mlb-08-the-show", "publisher": "SCEA", "release_date": "Mar  4 2008", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 2", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/287e2da1eb6c23574ed09be50fad56bd-98.jpg", "descriptions": "MLB 08 The Show promises to provide fans with the most realistic baseball experience to date with innovations such as a more immersive Road to The Show mode, enabling gamers to play both offense and defense from the created player’s perspective. Providing players with some additionalMLB 08 The Show promises to provide fans with the most realistic baseball experience to date with innovations such as a more immersive Road to The Show mode, enabling gamers to play both offense and defense from the created player’s perspective. Providing players with some additional performance incentives, the MLB franchise introduces the new Progressive Batting Performance feature, which both rewards players for superior performance and penalize them for hitting slumps. Specific to each individual batter, players are rewarded with slight contact bonuses, or punished with slight decreases in contact, based on how that batter that performs beyond his \"natural ability\" while under user control. Adding to the online feature set, which includes customizable Online League Play with up to 30 teams, scrolling MLB Score Ticker and more, MLB 08 The Show introduces SCOUT (SportsConnect Online User Tracking), which allows gamers to set and store their game preferences on the MLB server, and enables the system to look for a Quick Match with opponents that fits similar competitive criteria. [SCEA]… Expand"}, {"name": "Unreal Championship 2: The Liandri Conflict", "details_link": "https://www.metacritic.com/game/xbox/unreal-championship-2-the-liandri-conflict", "publisher": "Midway", "release_date": "Apr 18 2005", "developers": ["Epic Games"], "platforms": "Xbox", "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/89020ca836b17a061c4b476a485dc659-98.jpg", "descriptions": "Unreal Championship 2: The Liandri Conflict enhances both single and multiplayer gameplay, including all-new player acrobatics, third-person camera mode, vehicles, and intense melee abilities. In the single player campaign, you'll fight your way through new cities and arenas as Anubis, whoUnreal Championship 2: The Liandri Conflict enhances both single and multiplayer gameplay, including all-new player acrobatics, third-person camera mode, vehicles, and intense melee abilities. In the single player campaign, you'll fight your way through new cities and arenas as Anubis, who attempts to retake his people's Nakhti Rite of Ascension Tournament from the machinations of the Liandri Corporation. The game also offer players the chance to fight head-to-head in eight-player tournaments over Xbox Live or System Link as any one of 14 characters--each with new adrenaline powers that enable offensive and defensive combos. … Expand"}, {"name": "13 Sentinels: Aegis Rim", "details_link": "https://www.metacritic.com/game/playstation-4/13-sentinels-aegis-rim", "publisher": "Atlus", "release_date": "Sep 22 2020", "developers": ["Vanillaware"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Adventure", "General"], "meta_score": 85, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/0/87ff6dd0ae4c51300e9357b755eea7dc-98.jpg", "descriptions": "A departure from the studio's traditional fantasy style, the game takes place in a modern setting punctuated with giant mechs. Although the world may be bleak, Vanillaware's signature artistic shine and gorgeous aesthetics will bring the characters and story of 13 Sentinels to life."}, {"name": "The Outer Worlds", "details_link": "https://www.metacritic.com/game/playstation-4/the-outer-worlds", "publisher": "Obsidian Entertainment", "release_date": "Oct 25 2019", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/950465a55785e0d1eca41eba6d2370ee-98.jpg", "descriptions": "The Outer Worlds is a new single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division. Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening toThe Outer Worlds is a new single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division. Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening to destroy the Halcyon colony. As you explore the furthest reaches of space and encounter various factions, all vying for power, the character you decide to become will determine how this player-driven story unfolds. In the corporate equation for the colony, you are the unplanned variable.… Expand"}, {"name": "Firewatch", "details_link": "https://www.metacritic.com/game/xbox-one/firewatch", "publisher": "Panic Inc.", "release_date": "Sep 21 2016", "developers": ["Campo Santo"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 85, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/1eee84cf6de2339d30db428c48eb46c5-98.jpg", "descriptions": "The year is 1989. You are a man named Henry who has retreated from his messy life to work as a fire lookout in the Wyoming wilderness. Perched high atop a mountain, its your job to look for smoke and keep the wilderness safe. An especially hot, dry summer has everyone on edge. YourThe year is 1989. You are a man named Henry who has retreated from his messy life to work as a fire lookout in the Wyoming wilderness. Perched high atop a mountain, its your job to look for smoke and keep the wilderness safe. An especially hot, dry summer has everyone on edge. Your supervisor Delilah is available to you at all times over a small, handheld radioyour only contact with the world you've left behind. But when something strange draws you out of your lookout tower and into the forest, youll explore a wild and unknown environment, facing questions and making choices that can build or destroy the only meaningful relationship you have.\r A Note: Firewatch is a video game about adults having adult conversations about adult things. If you plan on playing with a younger gamer, that might be good to know going in.\r Includes\r *    A stunningly beautiful wilderness environment that expands as you explore.\r*    A tailor-made story: the choices you make shape the narrative and build relationships.\r*    An edge-of-your-seat mystery.\r*    Secrets and discoveries to be made over every hill.… Expand"}, {"name": "Battlefield 4", "details_link": "https://www.metacritic.com/game/playstation-4/battlefield-4", "publisher": "Electronic Arts", "release_date": "Nov 12 2013", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 85, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/8642b7a64b553185ff768700fe8d0964-98.jpg", "descriptions": "Battlefield 4 is an action blockbuster that aims for unrivaled destruction. Fueled by Frostbite 3, Battlefield 4 allows you to demolish the buildings shielding your enemy. You will lead an assault from the back of a gun boat. Battlefield grants you the freedom to do more and be more whileBattlefield 4 is an action blockbuster that aims for unrivaled destruction. Fueled by Frostbite 3, Battlefield 4 allows you to demolish the buildings shielding your enemy. You will lead an assault from the back of a gun boat. Battlefield grants you the freedom to do more and be more while playing to your strengths and carving your own path to victory. Beyond its hallmark multiplayer, Battlefield 4 features an intense, dramatic character-driven campaign that starts with the evacuation of American VIPs from Shanghai and follows your squad's struggle to find its way home. Change the landscape in real-time with interactive environments that react to your every move. Dominate land, air and sea with all-new, intense water-based vehicular combat.… Expand"}, {"name": "Tom Clancy's Rainbow Six: Vegas", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six-vegas", "publisher": "Ubisoft", "release_date": "Dec 12 2006", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/e212ee149acb9c780b9ab76946a7e05d-98.jpg", "descriptions": "The stakes are high when the world's most elite counter-terrorism unit enters Las Vegas, where over 36.7 million men, women and children visit each year. \"Sin City,\" the home of the famous Las Vegas Strip, flashy hotels, high-rolling casinos and world-famous celebrities, becomes the settingThe stakes are high when the world's most elite counter-terrorism unit enters Las Vegas, where over 36.7 million men, women and children visit each year. \"Sin City,\" the home of the famous Las Vegas Strip, flashy hotels, high-rolling casinos and world-famous celebrities, becomes the setting for a terrorist threat of global proportions. What happens when one of the world's most famous cities is held hostage by terrorists? [Ubisoft]… Expand"}, {"name": "Super Street Fighter IV: 3D Edition", "details_link": "https://www.metacritic.com/game/3ds/super-street-fighter-iv-3d-edition", "publisher": "Capcom", "release_date": "Mar 27 2011", "developers": ["Capcom"], "platforms": ["PlayStation 3", "Xbox 360", "3DS"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "3D"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/d56c348b3e78c535b49de8b2b413799b-98.jpg", "descriptions": "The latest version of Street Fighter makes its transition to the Nintendo 3DS with Super Street Fighter IV: 3D Edition. The console experience is now in the palm of your hand with new features that utilize the capabilities of the Nintendo 3DS to its fullest. Packed with 35 playableThe latest version of Street Fighter makes its transition to the Nintendo 3DS with Super Street Fighter IV: 3D Edition. The console experience is now in the palm of your hand with new features that utilize the capabilities of the Nintendo 3DS to its fullest. Packed with 35 playable characters, bonus stages and cinematic Ultra combos, Super Street Fighter IV: 3D Edition expands the action by allowing you to fight your friends around the world using Wi-Fi. New to the franchise are the figurine mode, which utilizes the Street Pass feature to add a collectible meta-game, and the 3D over-the-shoulder camera option that takes fighting to new depths. For those new to the franchise, a simple mode has been added allowing players to pull off challenging moves with a single touch of the screen.… Expand"}, {"name": "City of Heroes", "details_link": "https://www.metacritic.com/game/pc/city-of-heroes", "publisher": "NCSOFT", "release_date": "Apr 27 2004", "developers": ["Paragon Studios", "Cryptic Studios"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Modern", "Modern"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/59065858914855b223f552dc1e048df6-98.jpg", "descriptions": "City of Heroes is a super-powered hero based massively multiplayer online role-playing game. The game is set in Paragon City, a modern day metropolis full of super powered villains, alien invaders, and underground monsters. Players take on the roles of Paragon City's super-powered defenders.City of Heroes is a super-powered hero based massively multiplayer online role-playing game. The game is set in Paragon City, a modern day metropolis full of super powered villains, alien invaders, and underground monsters. Players take on the roles of Paragon City's super-powered defenders. Create your own hero by choosing your powers and designing your own costume. [NCsoft]… Expand"}, {"name": "Mass Effect 3: Special Edition", "details_link": "https://www.metacritic.com/game/wii-u/mass-effect-3-special-edition", "publisher": "Electronic Arts", "release_date": "Nov 13 2012", "developers": ["Straight Right"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "Up to 4 ", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/f5a751518ecb7589c2321009bd14c44e-98.jpg", "descriptions": "Earth is on fire. Striking from beyond known space, a race of terrifying machines have begun their destruction of the human race. As Commander Shepard, an Alliance Marine, your only hope for saving mankind is to rally the civilizations of the galaxy and launch one final mission to take backEarth is on fire. Striking from beyond known space, a race of terrifying machines have begun their destruction of the human race. As Commander Shepard, an Alliance Marine, your only hope for saving mankind is to rally the civilizations of the galaxy and launch one final mission to take back the Earth. Mass Effect 3 features additional missions, weapons, and characters for both single player and multiplayer including the Extended Cut ending and an interactive backstory experience.… Expand"}, {"name": "Castle Crashers", "details_link": "https://www.metacritic.com/game/playstation-3/castle-crashers", "publisher": "The Behemoth", "release_date": "Aug 31 2010", "developers": ["The Behemoth"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/b753d329063f92df9a6a1386f8f937f1-98.jpg", "descriptions": "From the award-winning independent developer The Behemoth, creators of Alien Hominid HD, now you can experience medieval-style insanity in Castle Crashers."}, {"name": "Pokemon Pearl Version", "details_link": "https://www.metacritic.com/game/ds/pokemon-pearl-version", "publisher": "Nintendo", "release_date": "Apr 22 2007", "developers": ["Game Freak"], "platforms": "DS", "num_players": "2 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/7579491a492aeaf04dae658ddb2881d3-98.jpg", "descriptions": "Pokemon Diamond and Pearl are traditional Pokemon RPGs that takes place in a region called Sinnoh. When you set off on your travels, you'll be able to play as either a boy or girl Trainer. Pokemon fans have caught glimpses of Lucario, Munchlax and Weavile in Pokemon movies, and these PokemonPokemon Diamond and Pearl are traditional Pokemon RPGs that takes place in a region called Sinnoh. When you set off on your travels, you'll be able to play as either a boy or girl Trainer. Pokemon fans have caught glimpses of Lucario, Munchlax and Weavile in Pokemon movies, and these Pokemon will are debuting in this adventure. Diamond and Pearl utilize the DS's dual slots to transfer Pokemon from the GBA Pokemon games. Also, you can link up with Pokemon Ranger to access more special content. [Nintendo]… Expand"}, {"name": "The Legend of Heroes: Trails to Azure", "details_link": "https://www.metacritic.com/game/switch/the-legend-of-heroes-trails-to-azure", "publisher": "NIS America", "release_date": "Mar 14 2023", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 4", "Switch"], "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/ad72202c39c87cfbcd1976204933f733-98.jpg", "descriptions": "Sandwiched between two great powers, the city of Crossbel is the place where the Uroboros group carry out their biggest and darkest schemes. A mysterious drug is spreading its poison across the city, the mafia and the mercenary groups seem to have a role in the crimes. Add a break down toSandwiched between two great powers, the city of Crossbel is the place where the Uroboros group carry out their biggest and darkest schemes. A mysterious drug is spreading its poison across the city, the mafia and the mercenary groups seem to have a role in the crimes. Add a break down to the political order to the mix, and you have complete chaos in your hands. The world becomes more real and the battles become more dangerous in Ao no Kiseki. Feel the rain patter on your skin and enemies creep up to you in the dark.… Expand"}, {"name": "Blaster Master Zero II", "details_link": "https://www.metacritic.com/game/switch/blaster-master-zero-ii", "publisher": "Inti Creates", "release_date": "Mar 20 2019", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/5ce9f9a9b19da7ad223ed226d0e4fdea-98.jpg", "descriptions": "The side-scrolling/top-down hybrid action adventure gameplay returns with a brand new sequel to \"Blaster Master Zero\"!\r Experience the yet-untold story of Jason and Eve after defeating Earth's mutant scourge as they venture into the depths of space in their new battle tank, \"GAIA-SOPHIA\"! The side-scrolling/top-down hybrid action adventure gameplay returns with a brand new sequel to \"Blaster Master Zero\"!\r Experience the yet-untold story of Jason and Eve after defeating Earth's mutant scourge as they venture into the depths of space in their new battle tank, \"GAIA-SOPHIA\"!\r The story of Blaster Master Zero 2 begins a few months after the events of the first game (released on March 9, 2017), where the main protagonist Jason saves planet Earth from the mutants. Eve has been infected by mutant cells that are slowly corrupting her body, so together with Jason and Fred, they board G-SOPHIA and begin an intergalactic journey to Eve's home planet, Sophia, in hopes of finding a cure for the mutant infection. … Expand"}, {"name": "Teenage Mutant Ninja Turtles: Shredder's Revenge", "details_link": "https://www.metacritic.com/game/playstation-4/teenage-mutant-ninja-turtles-shredders-revenge", "publisher": "DotEmu", "release_date": "Jun 16 2022", "developers": ["Tribute Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/1f688f5fa501a5397a2146be789e5938-98.jpg", "descriptions": "With Bebop and Rocksteady assaulting Channel 6 and stealing super gnarly devices to support Krang and Shredder's latest twisted plan, Teenage Mutant Ninja Turtles: Shredder's Revenge sees the Turtles battling across a righteous range of timeless TMNT locations. From Manhattan and ConeyWith Bebop and Rocksteady assaulting Channel 6 and stealing super gnarly devices to support Krang and Shredder's latest twisted plan, Teenage Mutant Ninja Turtles: Shredder's Revenge sees the Turtles battling across a righteous range of timeless TMNT locations. From Manhattan and Coney Island, to city rooftops and dank sewers, help the fearsome foursome trounce Foot Soldiers, Triceraton Warriors, and Rock Troops all the way to Dimension X! \r\rEnjoy stunning full-color pixel art graphics and a vintage TMNT vibe that will rock you straight back to the awesome 80s. Every character, vehicle, weapon, item, and background is directly inspired by the 1987 TV show, making you feel like you hopped into the television -- with a dope mix of killer humor and action-packed adventures!… Expand"}, {"name": "Lara Croft and the Guardian of Light", "details_link": "https://www.metacritic.com/game/xbox-360/lara-croft-and-the-guardian-of-light", "publisher": "Square Enix", "release_date": "Aug 18 2010", "developers": ["Crystal Dynamics"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Stadia", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Action Adventure", "Adventure", "Shooter", "General", "General", "Third-Person", "Modern"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/e4de2a233b9ad3e13b411d583df6442b-98.jpg", "descriptions": "[Xbox Live Arcade]   Lara Croft and the Guardian of Light is the first ever co-op multiplayer action/adventure game featuring Lara Croft. This brand new adventure combines the hallmarks of the Tomb Raider  franchise, including exploration and discovery, platforming, and puzzle solving[Xbox Live Arcade]   Lara Croft and the Guardian of Light is the first ever co-op multiplayer action/adventure game featuring Lara Croft. This brand new adventure combines the hallmarks of the Tomb Raider  franchise, including exploration and discovery, platforming, and puzzle solving combined with character progression, fun fast-paced combat, and elements of human cooperation and competition.… Expand"}, {"name": "BlazBlue: Chrono Phantasma Extend", "details_link": "https://www.metacritic.com/game/pc/blazblue-chrono-phantasma-extend", "publisher": "H2 Interactive Co., Ltd.", "release_date": "Mar  2 2016", "developers": ["Arc System Works"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One", "PC"], "genres": ["Action", "Fighting", "2D"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/66e435b66231bf87959468ac71f22b56-98.jpg", "descriptions": "The most definitive installment of the renouned 2D fighting game franchise, BlazBlue, can finally be taken into your living room. Uncover the secrets, of the Chrono Phantasma Extend."}, {"name": "SWAT 4", "details_link": "https://www.metacritic.com/game/pc/swat-4", "publisher": "Sierra Entertainment", "release_date": "Apr  5 2005", "developers": ["Irrational Games"], "platforms": "PC", "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Arcade"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/89263b1142eb9520dfd9bb99c1e402a6-98.jpg", "descriptions": "Show No Mercy In Defense of Life. Los Angeles: 2006. Gangs rule the city and crime's at an all-time high. As an elite SWAT officer, you must protect the lives of the innocent throughout 16 intense missions. There's no room for mistakes. Or mercy. What's it gonna be rookie? [Sierra]"}, {"name": "Midnight Club II", "details_link": "https://www.metacritic.com/game/playstation-2/midnight-club-ii", "publisher": "Rockstar Games", "release_date": "Apr  9 2003", "developers": ["Rockstar San Diego"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/4081e94abe7a6a783e96df41306b1732-98.jpg", "descriptions": "The world's most notorious drivers meet each night on the streets of LA, Paris, and Tokyo. Choose from the latest performance enhanced cars and bikes and compete head-to-head to make a name for yourself. There are no rules. Drive anywhere in the city. Find the fastest route to win. The copsThe world's most notorious drivers meet each night on the streets of LA, Paris, and Tokyo. Choose from the latest performance enhanced cars and bikes and compete head-to-head to make a name for yourself. There are no rules. Drive anywhere in the city. Find the fastest route to win. The cops know you are out there - don't get caught. Race with up to 8 players throughout three massive, fully open cities in one of five online play modes. Select any car or bike that you've personally unlocked in offline arcade mode. Join a game or host one yourself via GameSpy.com. A broadband connection is required for online play - there is no slow lane on the streets of Midnight Club 2. [Rockstar Games]… Expand"}, {"name": "Aggressive Inline", "details_link": "https://www.metacritic.com/game/xbox/aggressive-inline", "publisher": "Acclaim", "release_date": "Jul 29 2002", "developers": ["Z-Axis", "Ltd."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skating"], "meta_score": 85, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/5d085695d66cefdca51a419066e43742-98.jpg", "descriptions": "Aggressive Inline pushes your inline skating skills to the limit with a new Juice Meter, challenging objectives, and expansive levels. You can choose from an array of professional inline skaters--including Jaren Grob, Chris Edwards, and Shane Yost--and showcase your talent in variousAggressive Inline pushes your inline skating skills to the limit with a new Juice Meter, challenging objectives, and expansive levels. You can choose from an array of professional inline skaters--including Jaren Grob, Chris Edwards, and Shane Yost--and showcase your talent in various interactive skate parks. Perform a variety of manuals, grinds, big-air tricks, wall flips, hand plants, and more, to build up your Juice Meter and avoid elimination. Aggressive Inline also includes a Park Editor that lets you design your own skate park, complete with rails, ramps, and pipes.… Expand"}, {"name": "Rollcage Stage II", "details_link": "https://www.metacritic.com/game/playstation/rollcage-stage-ii", "publisher": "Midway", "release_date": "Oct 10 2000", "developers": ["Attention To Detail"], "platforms": "PlayStation", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/c6a314706c2878227b21ab2d65a6f03a-98.jpg", "descriptions": "The game may not have the lasting appeal of Psygnosis' Wipeout or Namco's Ridge Racer, but it has enough gameplay, eye candy, and bonus secrets to put it near the top of what the PlayStation has to offer."}, {"name": "EverQuest", "details_link": "https://www.metacritic.com/game/pc/everquest", "publisher": "Sony Online Entertainment", "release_date": "Mar 16 1999", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/520840624412e14baf14d028face879e-98.jpg", "descriptions": "Prepare to enter an enormous virtual environment-an entire world with its own diverse species, economic systems, alliances, and politics. Choose from a variety of races and classes, customize your character, and begin your quest in any number of cities of villages throughout multiplePrepare to enter an enormous virtual environment-an entire world with its own diverse species, economic systems, alliances, and politics. Choose from a variety of races and classes, customize your character, and begin your quest in any number of cities of villages throughout multiple continents. Equip yourself for adventure, seek allies and knowledge, and experience a rich world of dungeons, towers, crypts, evil abbeys-anything is possible-even planes and realities beyond your imagination. Meet new friends from around the world to face epic challenges. Make yourself a noble human knight, a vicious dark elf thief, a greedy dwarven merchant, or whatever suits your desire. [Sony Online Entertainment]… Expand"}, {"name": "F-Zero X", "details_link": "https://www.metacritic.com/game/nintendo-64/f-zero-x", "publisher": "Nintendo", "release_date": "Sep 30 1998", "developers": ["Nintendo"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/30043fd5ebce49e8cbf58de7b4ee5a95-98.jpg", "descriptions": "It's you against 29 other machines competing for the title of F-Zero X Champion. You're racing at speeds of over 1,000 km/h high above the atmosphere. Your competition comes from every corner of the galaxy and won't shed a tear at the thought of smashing you off the track. With four-playerIt's you against 29 other machines competing for the title of F-Zero X Champion. You're racing at speeds of over 1,000 km/h high above the atmosphere. Your competition comes from every corner of the galaxy and won't shed a tear at the thought of smashing you off the track. With four-player simultaneous gameplay and the Rumble Pak accessory, you have the fastest racing game on the N64 system!… Expand"}, {"name": "Final Fantasy XII: The Zodiac Age", "details_link": "https://www.metacritic.com/game/switch/final-fantasy-xii-the-zodiac-age", "publisher": "Square Enix", "release_date": "Apr 30 2019", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/1f0a08a75b22a54d8417b8c8ef1dc03f-98.jpg", "descriptions": "Enter an era of war within the world of Ivalice. The small kingdom of Dalmasca, conquered by the Archadian Empire, is left in ruin and uncertainty. Princess Ashe, the one and only heir to the throne, devotes herself to the resistance to liberate her country. Vaan, a young man who lost hisEnter an era of war within the world of Ivalice. The small kingdom of Dalmasca, conquered by the Archadian Empire, is left in ruin and uncertainty. Princess Ashe, the one and only heir to the throne, devotes herself to the resistance to liberate her country. Vaan, a young man who lost his family in the war, dreams of flying freely in the skies. In a fight for freedom and fallen royalty, join these unlikely allies and their companions as they embark on a heroic adventure to free their homeland.\r Final Fantasy XII: The Zodiac Age improves upon the 2006 classic Final Fantasy XII, now more beautiful and easier to play than ever. The high-definition remaster introduces several modern advancements, including reconstructed battle design and a revamped job system. With newly implemented trophies and share functions, as well as stark visual and sound improvements in true HD for the first time, players both returning and new to the game will experience a grand adventure that spans the world of Ivalice in an entirely fresh and improved way.… Expand"}, {"name": "Trials Evolution: Origin of Pain", "details_link": "https://www.metacritic.com/game/xbox-360/trials-evolution-origin-of-pain", "publisher": "Microsoft Game Studios", "release_date": "Oct  5 2012", "developers": ["RedLynx"], "platforms": "Xbox 360", "genres": ["Street", "Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/065b2d9780e90710342aeb37bdf8b0dd-98.jpg", "descriptions": "The Origin of Pain DLC builds on the successes of Trials Evolution, offering tons of new editor objects, 36 brand new tracks, and a brand new BMX bike, the first time a bike mode has ever been offered in a Trials game."}, {"name": "Tom Clancy's Splinter Cell Double Agent", "details_link": "https://www.metacritic.com/game/xbox-360/tom-clancys-splinter-cell-double-agent", "publisher": "Ubisoft", "release_date": "Oct 17 2006", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/f3ed95161f8a7e7e4dcb25f22739831f-98.jpg", "descriptions": "Veteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life asVeteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life as a double agent. As you infiltrate a terrorist organization in its American headquarters, you must carefully weigh the consequences of your actions. Kill too many criminals and you'll blow your cover. Hesitate too long and millions will die. Do whatever it takes to complete your mission, but get out alive. Dual objectives to fulfill: NSA government agents and terrorists will each want you to accomplish opposing tasks at the same time. Discover the tension of being a double agent: Use actual tactics employed by today’s real-life double agents to sabotage the terrorists' plans. Explore a branching storyline with multiple endings: Your choices have an impact on how the story and game play unfolds. Missions from all over the world, from Asia to Africa to the heart of the US. Experience extreme situations: underwater or in a sandstorm, hiding behind the dust or smoke – and even skydiving. Master the latest weapons and gadgets used by NSA government agents in addition to black-market terrorist weapons. [Ubisoft]… Expand"}, {"name": "Pillars of Eternity: Complete Edition", "details_link": "https://www.metacritic.com/game/playstation-4/pillars-of-eternity-complete-edition", "publisher": "Paradox Interactive", "release_date": "Aug 29 2017", "developers": ["Obsidian Entertainment", "Paradox Arctic"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 85, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/3b3191814e305952b42288c18c3cc3ff-98.jpg", "descriptions": "Pillars of Eternity, the ultimate role-playing experiences comes to PS4! Created by and for role-playing fans by Obsidian Entertainment and adapted by Paradox Arctic — together bringing Pillars’ fantastical world, tactical combat, and unforgettable story to you."}, {"name": "Bravely Default", "details_link": "https://www.metacritic.com/game/3ds/bravely-default", "publisher": "Nintendo", "release_date": "Feb  7 2014", "developers": ["Silicon Studio"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Console-style RPG", "Role-Playing", "Console-style RPG", "Japanese-Style"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/0ed1e991de12ddf89d710b1ea33559ba-98.jpg", "descriptions": "[Available in the U.S. - Feb 2014] This new yet traditional offering from Square Enix captures the charm and elegant and simplicity of yesteryear's canonical RPGs. Become a Warrior of Light and journey to the land of Luxemdarc in this classic tale of personal growth and adventure."}, {"name": "Guacamelee! 2", "details_link": "https://www.metacritic.com/game/xbox-one/guacamelee!-2", "publisher": "DrinkBox Studios", "release_date": "Jan 18 2019", "developers": ["DrinkBox Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 85, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/51a0fbd508249ff06dfab2a20d917c36-98.jpg", "descriptions": "Brawling has never been more beautiful! The long-awaited sequel to the smash hit action-platformer is here: Guacamelee! 2 brings luchador Juan Aguacate out of retirement for a stunning new Metroidvania-style adventure, where he must face his greatest challenge yet - one that threatens toBrawling has never been more beautiful! The long-awaited sequel to the smash hit action-platformer is here: Guacamelee! 2 brings luchador Juan Aguacate out of retirement for a stunning new Metroidvania-style adventure, where he must face his greatest challenge yet - one that threatens to tear apart the very fabric of the Mexiverse!Explore a huge, hand-crafted world inspired by Mexican culture and folklore, filled with sassy new villains and weirdos (and a few old friends!). Learn a deep repertoire of bone-crunching wrestling moves to fend off the skeletal hordes and overcome skillful platforming challenges... and who said anything about a Chicken Illuminati? Certainly not us!Check out these features:* An epic adventure spanning time and space, featuring drop-in 4-player local co-op for you and your best amigos!* A brand new upgrade system: discover \"trainers\" around the world, defeat their challenges, and develop your skill sets for movement, combat, and more!* A vibrant, colorful adventure that takes you from the Mangrove Swamp to Hell itself, featuring twice as many enemy types as the first game and a roster of eccentric new bosses!* An absolutely fuego electro-Mexican soundtrack, and more gorgeous visuals than ever thanks to a fancy new rendering engine!* Definitely no secret society of chickens that teaches you ancient chicken abilities previously lost to the ages!… Expand"}, {"name": "DOOM", "details_link": "https://www.metacritic.com/game/playstation-4/doom", "publisher": "Bethesda Softworks", "release_date": "May 13 2016", "developers": ["id Software"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Sci-Fi", "Third-Person", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/f1d43a7f8723597705c8bf19ab35bce3-98.jpg", "descriptions": "There is no taking cover or stopping to regenerate health in campaign mode as you beat back Hell’s raging demon hordes. Combine your arsenal of futuristic and iconic guns, upgrades, movement and an advanced melee system to knock-down, slash, stomp, crush, and blow apart demons in creativeThere is no taking cover or stopping to regenerate health in campaign mode as you beat back Hell’s raging demon hordes. Combine your arsenal of futuristic and iconic guns, upgrades, movement and an advanced melee system to knock-down, slash, stomp, crush, and blow apart demons in creative and violent ways. In multiplayer, dominate your opponents in DOOM’s signature, fast-paced arena-style combat. In both classic and all-new game modes, annihilate your enemies utilizing your personal blend of skill, powerful weapons, vertical movement, and unique power-ups that allow you to play as a demon. DOOM SnapMap is an easy-to-use game and level editor that allows for limitless gameplay experiences on every platform. Anyone can snap together and customize maps, add pre-defined or custom gameplay, and edit game logic to create new modes. Instantly play your creation or make it available to players around the world. [ID/Bethesda]… Expand"}, {"name": "Slay the Spire", "details_link": "https://www.metacritic.com/game/switch/slay-the-spire", "publisher": "Mega Crit Games", "release_date": "Jun  6 2019", "developers": ["Mega Crit Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/d5efe5a8a6d086a44fbf1374aa6f749a-98.jpg", "descriptions": "Slay the Spire is an energetic fusion of card games and roguelikes. Choose your cards wisely. Craft a unique deck, encounter bizarre creatures, discover relics of immense power, and make your way up the ever-changing Spire."}, {"name": "Far Cry Instincts", "details_link": "https://www.metacritic.com/game/xbox/far-cry-instincts", "publisher": "Ubisoft", "release_date": "Sep 27 2005", "developers": ["Ubisoft Montreal"], "platforms": "Xbox", "num_players": "1-16 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 85, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/992b7941a6f960f9d7cbdca69568c8f2-98.jpg", "descriptions": "After escorting an inquisitive journalist to a remote tropical island, Jack Carver finds himself stranded in paradise, hunted by an unrelenting team of highly trained mercenaries. As Jack, you must outwit hordes of mercenaries by using a variety of tactics. Make long-range assaults, setAfter escorting an inquisitive journalist to a remote tropical island, Jack Carver finds himself stranded in paradise, hunted by an unrelenting team of highly trained mercenaries. As Jack, you must outwit hordes of mercenaries by using a variety of tactics. Make long-range assaults, set traps, commandeer vehicles, and even develop new skills and abilities to outlast the island's evils so that you can escape with your life. Discover new locations in single-player mode or build your own maps in multiplayer modes.… Expand"}, {"name": "Warhammer 40,000: Dawn of War II", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-dawn-of-war-ii", "publisher": "THQ", "release_date": "Feb 18 2009", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/9019e1e68e39afb6fb19d16f4513e953-98.jpg", "descriptions": "Warhammer 40,000: Dawn of War II is set in the grim, war-ravaged world of Games Workshop’s Warhammer 40,000 universe – a dark, futuristic, science-fiction setting where armies of technologically advanced warriors, fighting machines and hordes of implacable aliens wage constant war. Dawn ofWarhammer 40,000: Dawn of War II is set in the grim, war-ravaged world of Games Workshop’s Warhammer 40,000 universe – a dark, futuristic, science-fiction setting where armies of technologically advanced warriors, fighting machines and hordes of implacable aliens wage constant war. Dawn of War II ushers in a new chapter in the RTS series, as ancient races – including the dauntless Space Marines and savage Orks - clash across ruined worlds on a mission to claim the galaxy and preserve their own existence. Powered by the re-vamped Essence Engine 2.0, the next evolution of Relic’s proprietary game engine made famous in the award winning Company of Heroes, Warhammer 40,000: Dawn of War II delivers fast-paced RTS action with ferocious melee and ranged combat in fully destructible environments. The game immerses players in an in-depth non-linear single-player campaign and a fully-co-operative multiplayer mode. [THQ]… Expand"}, {"name": "Call of Duty: Black Ops 4", "details_link": "https://www.metacritic.com/game/xbox-one/call-of-duty-black-ops-4", "publisher": "Activision", "release_date": "Oct 12 2018", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 85, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/5/b968c9c21d7c219bfb1af7ca9a7e32ca-98.jpg", "descriptions": "Black Ops returns - in your face. Featuring gritty, grounded, fluid Multiplayer combat, a massive Zombies offering with 3 full undead adventures at launch, and Blackout, where the universe of Black Ops comes to life in one huge battle royale experience featuring the largest map in Call ofBlack Ops returns - in your face. Featuring gritty, grounded, fluid Multiplayer combat, a massive Zombies offering with 3 full undead adventures at launch, and Blackout, where the universe of Black Ops comes to life in one huge battle royale experience featuring the largest map in Call of Duty history, signature Black Ops combat, characters, locations and weapons from the entire Black Ops series. Soldier up for all-out combat – tailor made for the Black Ops community. [Treyarch]… Expand"}, {"name": "Paradigm", "details_link": "https://www.metacritic.com/game/pc/paradigm", "publisher": "Jacob Janerka", "release_date": "Apr  5 2017", "developers": ["Jacob Janerka"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/d5163cb703536960f2522ebf50f42422-98.jpg", "descriptions": "Paradigm is a surreal adventure game set in the strange and post apocalyptic Eastern European country of Krusz. Play as the handsome mutant, Paradigm, who's past comes back to haunt him in the form of a genetically engineered sloth that vomits candy."}, {"name": "NBA 2K14", "details_link": "https://www.metacritic.com/game/playstation-4/nba-2k14", "publisher": "2K Sports", "release_date": "Nov 12 2013", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 85, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/0bc0df83c807a72ac6802dae5dd1e80e-98.jpg", "descriptions": "NBA 2K14 promises to raise the bar yet again, providing the best basketball gaming experience for legions of sports fans and gamers around the world."}, {"name": "Battlefield 3", "details_link": "https://www.metacritic.com/game/playstation-3/battlefield-3", "publisher": "Electronic Arts", "release_date": "Oct 25 2011", "developers": ["EA DICE"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 24 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/b966d8938953cdff1db4185bee6c6061-98.jpg", "descriptions": "As bullets whiz by, walls crumble, and explosions throw you to the ground, the battlefield feels more alive and interactive than ever before. In Battlefield 3, players step into the role of the elite U.S. Marines where they will experience heart-pounding single player missions andAs bullets whiz by, walls crumble, and explosions throw you to the ground, the battlefield feels more alive and interactive than ever before. In Battlefield 3, players step into the role of the elite U.S. Marines where they will experience heart-pounding single player missions and competitive multiplayer actions ranging across diverse locations from around the globe including Europe, Middle-East and North America. … Expand"}, {"name": "Tekken Tag Tournament", "details_link": "https://www.metacritic.com/game/playstation-2/tekken-tag-tournament", "publisher": "Namco", "release_date": "Oct 25 2000", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/181cf4bdbdd85e4783f82525a766e4e5-98.jpg", "descriptions": "The follow-up to \"Tekken 3\" features 2000 moves in all, and allows for four-player mayhem when utilizing the multi-tap for the tag team experience."}, {"name": "Onimusha 3: Demon Siege", "details_link": "https://www.metacritic.com/game/playstation-2/onimusha-3-demon-siege", "publisher": "Capcom", "release_date": "Apr 27 2004", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/0abc8e4335e2756a20b9feb3f1c6c7a0-98.jpg", "descriptions": "In Onimusha 3 Demon Siege the year is 1582 and 10 years have passed since the events that unfolded in Onimusha 2 Samurai?s Destiny. The stage is set at the burning Honnoji Temple, as the famous Onimusha warrior Samanosuke Akechi (Takeshi Kaneshiro) continues to fight the demons in his path.In Onimusha 3 Demon Siege the year is 1582 and 10 years have passed since the events that unfolded in Onimusha 2 Samurai?s Destiny. The stage is set at the burning Honnoji Temple, as the famous Onimusha warrior Samanosuke Akechi (Takeshi Kaneshiro) continues to fight the demons in his path. The moment has finally arrived for Samanosuke to confront the true enemy that has eluded him until now, the undying Nobunaga Oda. Unfortunately before the long-awaited final battle begins, Samanosuke is suddenly engulfed in a whirlpool of light and disappears. The year is 2004. A peaceful French metropolis is suddenly attacked by demons. In the blink of an eye, the city is transformed into a hellish sea of blood as Genma demons slaughter civilians and soldiers one by one. Within this pit of darkness appears one man who stands up against the Genma demons, Jacques Braun (Jean Reno). As a member of the French army, Jacques is deployed to the nightmarish scene only to discover himself amid a plague of horrific enemies that are beyond anyone?s imagination. An ancient samurai warrior unexpectedly appears to help him defend the helpless city. As they cooperatively fight off the demons, Jacquesis caught in a mysterious vortex and vanishes to feudal Japan, leaving the warrior behind in modern day France. Why has Samanosuke appeared in present Paris and Jacques in feudal Japan? What fate awaits these two men? The fierce and bloody battle is unfurled as the beginning of the final Onimusha chapter unfolds. [Capcom]… Expand"}, {"name": "Red Faction: Guerrilla", "details_link": "https://www.metacritic.com/game/playstation-3/red-faction-guerrilla", "publisher": "THQ", "release_date": "Jun  2 2009", "developers": ["Volition Inc."], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/331135ad1f8d7ef577bea930854b80f6-98.jpg", "descriptions": "Red Faction: Guerrilla is a 3rd person, open-world action shooter set on Mars, 50 years after the events of the original Red Faction. Players assume the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive EarthRed Faction: Guerrilla is a 3rd person, open-world action shooter set on Mars, 50 years after the events of the original Red Faction. Players assume the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Throughout their fight for freedom, players carve their own path, wreaking havoc across the vast, open-world environment of Mars, from the desolate mining outpost of Parker to the gleaming EDF capital city of Eos. Utilizing improvised weapons, explosives and re-purposed mining equipment and vehicles, Red Faction: Guerrilla allows players to tear through fully destructible environments in an unforgiving Martian landscape swarming with EDF forces, Red Faction resistance fighters, and the downtrodden settlers caught in the cross-fire. Red Faction: Guerrilla also features a robust multiplayer component, including several modes focused on destruction-based gameplay. [THQ]… Expand"}, {"name": "Bug Fables: The Everlasting Sapling", "details_link": "https://www.metacritic.com/game/switch/bug-fables-the-everlasting-sapling", "publisher": "DANGEN Entertainment", "release_date": "May 28 2020", "developers": ["Moonsprout Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/b4f1fee48f68bf7956c8023775907299-98.jpg", "descriptions": "Bug Fables is an adventure RPG following three heroes, Vi, Kabbu, and Leif, as they embark on an epic quest in Bugaria in search of treasure and immortality! The game combines colorful platforming with the heroes' unique abilities as they explore a wide variety of areas in the kingdom.Bug Fables is an adventure RPG following three heroes, Vi, Kabbu, and Leif, as they embark on an epic quest in Bugaria in search of treasure and immortality! The game combines colorful platforming with the heroes' unique abilities as they explore a wide variety of areas in the kingdom. Battles are turn-based and make use of action commands that can enhance attacks.… Expand"}, {"name": "A Space For The Unbound", "details_link": "https://www.metacritic.com/game/switch/a-space-for-the-unbound", "publisher": "PQube", "release_date": "Jan 19 2023", "developers": ["Mojiken Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/41a7cb5c9c141c4e380bf17d745df095-98.jpg", "descriptions": "A Space For The Unbound is a slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\r Follow two high school sweethearts, AtmaA Space For The Unbound is a slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\r Follow two high school sweethearts, Atma and Raya, on a journey of self-discovery at the end of their high school years. When a mysteriously supernatural power is suddenly unleashed threatening their existence, they must explore and investigate their town to uncover hidden secrets, face the end of the world, and perhaps learn more about each other.… Expand"}, {"name": "Final Fantasy X-2", "details_link": "https://www.metacritic.com/game/playstation-2/final-fantasy-x-2", "publisher": "Square Enix", "release_date": "Nov 18 2003", "developers": ["SquareSoft"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/bcabeffc03483d5cd3f77d55f7a03930-98.jpg", "descriptions": "Taking place two years after Yuna's fateful journey to defeat Sin, the once chaotic world \"Eternal Calm.\" The people of Spira now shun the teachings of Yevon and have opened their arms to former foes, the Al Bhed and the use of machina. It is a time of the \"Machina Revolution\" where peopleTaking place two years after Yuna's fateful journey to defeat Sin, the once chaotic world \"Eternal Calm.\" The people of Spira now shun the teachings of Yevon and have opened their arms to former foes, the Al Bhed and the use of machina. It is a time of the \"Machina Revolution\" where people now believe that machina is useful and beneficial, as long as it is used properly. However, even with the peaceful life they now lived, there is emptiness in Yunaís heart that is keeping her from moving on as the others have. One day, Yuna obtains a mystical sphere that contains imagery of what might be the Blitzball player she thought was gone forever. Although Yuna isnít certain that it is him or if he is even alive, she's driven to seek him out. Yuna needs closure to their unexpected parting, even if only to find that she will never see him again. So begins her journey, this is Yuna's story.… Expand"}, {"name": "Night in the Woods", "details_link": "https://www.metacritic.com/game/switch/night-in-the-woods", "publisher": "Finji", "release_date": "Feb  1 2018", "developers": ["Infinite Fall"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/e35c4298ad0ec4b5f1c2f8ec42986c04-98.jpg", "descriptions": "Night In The Woods is a 2D story-focused adventure/exploration game with many extracurricular activities to enjoy, characters to meet, and secrets to discover. Run, jump and use astral projection to explore the many sides of town of Possum Springs and the surrounding environs. Waste timeNight In The Woods is a 2D story-focused adventure/exploration game with many extracurricular activities to enjoy, characters to meet, and secrets to discover. Run, jump and use astral projection to explore the many sides of town of Possum Springs and the surrounding environs. Waste time around town with your crew of loser friends. Gain abilities that grant passage to new areas. Discover the secrets of a large cast of characters and the town itself. Experience a big crazy world and the remarkable events unfolding there. Play bass. Break stuff.… Expand"}, {"name": "Battlerite", "details_link": "https://www.metacritic.com/game/pc/battlerite", "publisher": "Stunlock Studios", "release_date": "Nov  8 2017", "developers": ["Stunlock Studios"], "platforms": "PC", "num_players": "Up to 6 ", "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/198e2a5b5a2508d01650de7364dd456b-98.jpg", "descriptions": "BATTLERITE is an action-packed team arena brawler. Experience the unique combination of a top-down shooter with a fast-paced fighting game. Challenge friends and others in a battle of reaction, unleashing the champion within you."}, {"name": "Command & Conquer 3: Tiberium Wars", "details_link": "https://www.metacritic.com/game/pc/command-conquer-3-tiberium-wars", "publisher": "EA Games", "release_date": "Mar 26 2007", "developers": ["EA LA"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/68d02cbe03099274ce4bb6aad00838af-98.jpg", "descriptions": "It is 2047 and the stakes could not be higher. Tiberium—a self-replicating alien substance that has infected the Earth—is spreading like a radioactive ice age. The GDI, a high-tech alliance of the world’s most advanced nations, is fighting to contain Tiberium, but Kane, the megalomaniacalIt is 2047 and the stakes could not be higher. Tiberium—a self-replicating alien substance that has infected the Earth—is spreading like a radioactive ice age. The GDI, a high-tech alliance of the world’s most advanced nations, is fighting to contain Tiberium, but Kane, the megalomaniacal leader of The Brotherhood of NOD has other plans for Earth. Kane’s secret society turned superpower is bent on using Tiberium to take control and transform humanity into his twisted vision of the future. All-out war rages over Tiberium and the fate of the planet rests in the balance. Experience a revolution in RTS gaming with a single player campaign that rewards you for your gameplay style. Add layers of strategy to your gaming experience by building mobile bases, wielding the power of terrifying Ion Storms on the battlefield, or customizing your armies by combining units. Battle it out online with native voice-over IP, integrated clan support, and new spectator modes that let you play RTS games like a sport. [Electronic Arts]… Expand"}, {"name": "Madden NFL 10", "details_link": "https://www.metacritic.com/game/xbox-360/madden-nfl-10", "publisher": "Electronic Arts", "release_date": "Aug 14 2009", "developers": ["EA Tiburon"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 85, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/a27c0bb154f81ca767912d43b5fd7250-98.jpg", "descriptions": "Experience first-hand what it's like to Fight for Every Yard in Madden NFL 10. With the all-new Pro-Tak animation technology, players have more control over the outcome of each play. Whether driving a receiver towards the first down, or battling for a fumble at the bottom of a pile, the playExperience first-hand what it's like to Fight for Every Yard in Madden NFL 10. With the all-new Pro-Tak animation technology, players have more control over the outcome of each play. Whether driving a receiver towards the first down, or battling for a fumble at the bottom of a pile, the play won't end until the whistle blows. Add to that the most immersive broadcast presentation and online innovation to date, and Madden NFL 10 captures the authenticity and emotion of the NFL like never before. Pro-Taks's all new animation technology provides unprecedented control over the outcome of every play. Drag defenders towards the first down marker, including up to 9-man gang tackles, fight for a fumble at the bottom of the pile, and evade the rush with all-new quarterback avoidance actions. Enhanced play at the line of scrimmage features a new blocking system that allows the quarterback to step into the pocket and gives the defensive line more control over the rush. Authenticity - Referees peeling players off a fumble pile, the chain gang rushing in to measure for a key first down, and all-new player equipment ensure that if you see it on Sunday, you’ll see it in Madden NFL 10. Fight for Online Dominance - Delivering the most comprehensive online offerings in franchise history, Madden NFL 10 includes new modes to satisfy the competitive and cooperative football gamer. New TV broadcast-style presentation and cinematic cameras bring the suspense and intensity of the NFL to your living room. Enhanced Franchise Mode - Run each aspect of an NFL franchise: draft players, sign free agents, manage the salary cap - just like a real GM. Enjoy all of the action throughout the league via a new, network inspired highlight show. The most customizable version of Madden NFL to date. Alter gameplay options to adjust the experience to your liking. A revamped play calling system and menu takes you to kickoff faster than ever before. Speed up online matches with accelerated clocks, streamlined presentation and more. [Electronic Arts]… Expand"}, {"name": "Batman: Arkham Knight", "details_link": "https://www.metacritic.com/game/xbox-one/batman-arkham-knight", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 23 2015", "developers": ["Rocksteady Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["General", "Fantasy", "Action Adventure", "Open-World"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/9bc954d829de2865be72968cee637f75-98.jpg", "descriptions": "Batman confronts the ultimate threat against the city he has been sworn to protect. The Scarecrow returns to congeal an imposing array of super villains, including The Penguin, Two-Face and Harley Quinn, to summarily destroy The Dark Knight. The game introduces Rocksteady's uniquely-designedBatman confronts the ultimate threat against the city he has been sworn to protect. The Scarecrow returns to congeal an imposing array of super villains, including The Penguin, Two-Face and Harley Quinn, to summarily destroy The Dark Knight. The game introduces Rocksteady's uniquely-designed imagining of the Batmobile drivable for the first time in the franchise. Batman: Arkham Knight offers gamers a complete Batman experience as they rip through the streets and soar across the skyline of the iconic Gotham City.… Expand"}, {"name": "Assassin's Creed III", "details_link": "https://www.metacritic.com/game/wii-u/assassins-creed-iii", "publisher": "Ubisoft", "release_date": "Nov 18 2012", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/13d9da941e1ba077d146fc69eeeb4f2a-98.jpg", "descriptions": "The Colonies, 1775: A brave your warrior fights to save his homeland. But what begins as a struggle over territory turns into a journey that will transform him into a Master Assassin - one that will forever change the destiny of a newborn nation. Assume the role of Connor, warrior son of aThe Colonies, 1775: A brave your warrior fights to save his homeland. But what begins as a struggle over territory turns into a journey that will transform him into a Master Assassin - one that will forever change the destiny of a newborn nation. Assume the role of Connor, warrior son of a Native American mother and British father. As the colonies draw closer to revolution, you will dedicate your life to the freedom of your clan, becoming the spark that ignites the revolution into a full blaze. Your crusade will lead you through blood-soaked battlefields and crowded city streets, to the perilous wilderness and stormy seas.  Always know where your enemies are with a larger, more expansive overhead map at your fingertips. Easily change your weapons on the fly to vary your combos without ever stopping the action on-screen.… Expand"}, {"name": "Astro Boy: Omega Factor", "details_link": "https://www.metacritic.com/game/game-boy-advance/astro-boy-omega-factor", "publisher": "Sega", "release_date": "Aug 18 2004", "developers": ["Hitmaker"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/a6f73aaa723337381b767f8a5ad2749c-98.jpg", "descriptions": "Join Astro, the robotic superhero with a human mind, in a quest to reunite the robotic race with humans. Astro uses his seven super abilities to face off against the likes of Atlas, Blue Knight, and more than 40 other characters. The game brings classic 2D gaming to the Game Boy AdvanceJoin Astro, the robotic superhero with a human mind, in a quest to reunite the robotic race with humans. Astro uses his seven super abilities to face off against the likes of Atlas, Blue Knight, and more than 40 other characters. The game brings classic 2D gaming to the Game Boy Advance along with an original seven-episode story. Playing as Astro Boy, you'll learn about justice, compassion, evil, courage, and the history of Astro Boy--all while building Astro's Omega Factor and strengthening his character and superhuman abilities.… Expand"}, {"name": "BlazBlue: Continuum Shift", "details_link": "https://www.metacritic.com/game/xbox-360/blazblue-continuum-shift", "publisher": "Aksys Games", "release_date": "Jul 27 2010", "developers": ["Arc System Works"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/897d87c50c40acac2bca742782c63253-98.jpg", "descriptions": "BlazBlue: Continuum Shift inherits all the key features of its predecessor while adding a few twists of its own. Tsubaki, ?-12 and Hazama will join the ranks of the veterans, who will be reborn with additional moves added to their arsenals. With new modes like Beginner Mode and TutorialBlazBlue: Continuum Shift inherits all the key features of its predecessor while adding a few twists of its own. Tsubaki, ?-12 and Hazama will join the ranks of the veterans, who will be reborn with additional moves added to their arsenals. With new modes like Beginner Mode and Tutorial Mode, even fighting game beginners can pull off combos like the pros and dive right into the action. [Aksys Games]… Expand"}, {"name": "Life is Strange", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange", "publisher": "Square Enix", "release_date": "Oct 20 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Action Adventure", "General"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/24cd881090a8cf092259ebec82bb6b22-98.jpg", "descriptions": "Life is Strange is a hand drawn work of art and every action enacts a butterfly effect - but with the power to rewind time, what would you change? And would it turn out to be a change for the better or worse?"}, {"name": "Bit.Trip Presents...Runner2: Future Legend of Rhythm Alien", "details_link": "https://www.metacritic.com/game/pc/bittrip-presentsrunner2-future-legend-of-rhythm-alien", "publisher": "Gaijin Games", "release_date": "Feb 26 2013", "developers": ["Gaijin Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/69bae588ec1f57957f72d77f34e92ecf-98.jpg", "descriptions": "Runner 2 - Future Legend of Rhythm Alien is inspired by the Bit.Trip series originally released on Nintendo platforms."}, {"name": "Hotline Miami", "details_link": "https://www.metacritic.com/game/pc/hotline-miami", "publisher": "Devolver Digital", "release_date": "Oct 23 2012", "developers": ["Dennaton"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Stadia", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/1aac83d8f81dd440140cf527fa6ba1f8-98.jpg", "descriptions": "Step into the neon-soaked underground of 1980s Miami as bizarre messages on your answering machine seem to be urging you to commit terrible acts of violence - but will you obey? Hotline Miami overflows with raw brutality and skull crushing close combat as you find yourself outgunned andStep into the neon-soaked underground of 1980s Miami as bizarre messages on your answering machine seem to be urging you to commit terrible acts of violence - but will you obey? Hotline Miami overflows with raw brutality and skull crushing close combat as you find yourself outgunned and using your wits to choreograph your way through impossible situations. An unmistakable visual style, a driving soundtrack, and a surreal plot that will have you question your own thirst for blood. Bash and blast through over 20 multiscreen levels with 35 unique weapons and collect 25 game-altering masks in one of the darkest and most unusual independent games on the scene.… Expand"}, {"name": "Guitar Hero World Tour", "details_link": "https://www.metacritic.com/game/xbox-360/guitar-hero-world-tour", "publisher": "Activision", "release_date": "Oct 26 2008", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 85, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/99f4e84da1cd5c38b8ce3b4a88a236aa-98.jpg", "descriptions": "Guitar Hero World Tour marries Guitar Hero's guitar gameplay, with a cooperative band experience that combines the most advanced wireless instruments with revolutionary new online and offline gameplay modes. The game features a slick newly redesigned guitar, a genuine electronic drum kit andGuitar Hero World Tour marries Guitar Hero's guitar gameplay, with a cooperative band experience that combines the most advanced wireless instruments with revolutionary new online and offline gameplay modes. The game features a slick newly redesigned guitar, a genuine electronic drum kit and a microphone, as well as an innovative Music Studio music creator that lets players compose, record, edit and share their own rock and roll anthems, along with online Band Career and 8-player \"Battle of the Bands.\" Guitar Hero World Tour is comprised entirely of master recordings from some of the greatest classic and modern rock bands of all-time including Ozzy Osbourne, Van Halen, Linkin Park, The Eagles, Sublime and many more. Additionally, the game offers significantly more localized downloadable music than ever before on all of the next-generation consoles. Budding rock stars are also given creative license to fully customize everything from their characters’ appearance and instruments to their band’s logo and album covers. Featuring three drum pads, two raised cymbals and a bass kick pedal, the drum controller combines larger and quieter, velocity-sensitive drum heads with soft rubber construction to deliver authentic bounce back and is easy to set up, move, break down and store. Virtual musicians can live out their rock and roll fantasies by playing either a single instrument, or any combination of instruments, in addition to the full band experience. Guitar Hero World Tour introduces Battle of the Bands mode which allows eight players to join online and challenge each other band-to-band to determine who is the best of the best. In the Band modes, up to four players can jam together, online or off, as they progress through the game, and in single-player Career Mode, players can jam on any of the instruments in branching venue progression enabling them to rock out in the order of their choice. The game's Music Studio lets players express their musical creativity by giving them access to a full compliment of tools to create digital music from scratch, utilizing all of the instruments, and then play their compositions in the game.  Music creators can share their recordings with their friends online through GHTunes where other gamers can download their unique compositions and play them. [Activision]… Expand"}, {"name": "Metro Exodus: Enhanced Edition", "details_link": "https://www.metacritic.com/game/pc/metro-exodus-enhanced-edition", "publisher": "Deep Silver", "release_date": "May  6 2021", "developers": ["4A Games"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/4c4f2ec078d89c6adc4744f3241ee0b8-98.jpg", "descriptions": "For PC players, we’re taking advantage of our new Fully Ray Traced Lighting Pipeline and the latest GPU-capable hardware from NVIDIA and AMD to offer the ultimate Ray Traced experience – the Metro Exodus PC Enhanced Edition. This upgrade is so extensive, it will require a Ray Tracing capableFor PC players, we’re taking advantage of our new Fully Ray Traced Lighting Pipeline and the latest GPU-capable hardware from NVIDIA and AMD to offer the ultimate Ray Traced experience – the Metro Exodus PC Enhanced Edition. This upgrade is so extensive, it will require a Ray Tracing capable GPU as the minimum spec, and we will need to deliver this version as a separate product – it is not a simple ‘patch’ to the base game – instead it will be offered as an extra entitlement to all existing Metro Exodus PC players.… Expand"}, {"name": "Final Fantasy XV: Windows Edition", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-xv-windows-edition", "publisher": "Square Enix", "release_date": "Mar  6 2018", "developers": ["Square Enix"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/f22464b10687e26b549bdc775c8285d4-98.jpg", "descriptions": "Set in modern times but with a touch of medieval influences, Final Fantasy XV focuses on Noctis Lucis Caelum, the prince of a dynasty which rules a city state that has the last remaining crystal. After the crystal is stolen by an invading nation, Niflheim, a global conflict ensues with allSet in modern times but with a touch of medieval influences, Final Fantasy XV focuses on Noctis Lucis Caelum, the prince of a dynasty which rules a city state that has the last remaining crystal. After the crystal is stolen by an invading nation, Niflheim, a global conflict ensues with all other nations wishing to gain it for themselves. Alongside the main protagonist, Noctis is joined by a military tactician Ignis Scienta, who can deftly handle a katana in battle, a melee fighter named Gladiolus Amicitia, gun-wielding Prompto Argentum, and head of the Royal Family Guards Cor Leonis. There's one other character that appears to get close with Noctis, even if her connection with him is still unknown. Her name is Stella Nox Fleuret, she seems to be strong and fight well with her rapier. Against this backdrop of a world at war, Noctis Lucis Caelum and his closest friends embark on an epic journey to try and get the crystal back.… Expand"}, {"name": "Nioh: Bloodshed's End", "details_link": "https://www.metacritic.com/game/playstation-4/nioh-bloodsheds-end", "publisher": "Sony Interactive Entertainment", "release_date": "Sep 26 2017", "developers": ["Team Ninja"], "platforms": "PlayStation 4", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/2c577480dfb19251acc16e3786f7f3de-98.jpg", "descriptions": "The Siege of Osaka is over. The bloody Sengoku period is nearing its end and so too is William's adventure.In this final story expansion for Nioh return to Japan months after the events of \"Defiant Honor\" as the country teeters on the verge of war. With new allies at his side, William mustThe Siege of Osaka is over. The bloody Sengoku period is nearing its end and so too is William's adventure.In this final story expansion for Nioh return to Japan months after the events of \"Defiant Honor\" as the country teeters on the verge of war. With new allies at his side, William must face-off against the last remaining anti-shogunate forces led by Yodogimi, as she prepares for battle against Tokugawa himself.Conquer new missions, wield powerful weapons and gear, master two Guardian Spirits including the mythical Nine-Tailed Fox, and end the bloodshed once and for all.Finally, veteran samurai are invited to The Abyss a perpetual battleground of the underworld from which only the strongest of warriors can hope to emerge.… Expand"}, {"name": "Out of the Park Baseball 13", "details_link": "https://www.metacritic.com/game/pc/out-of-the-park-baseball-13", "publisher": "Out Of The Park Developments", "release_date": "Apr  9 2012", "developers": ["Out Of The Park Developments"], "platforms": "PC", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/9d9984d62e435cd925fccba50ac417fa-98.jpg", "descriptions": null}, {"name": "NHL 2004", "details_link": "https://www.metacritic.com/game/gamecube/nhl-2004", "publisher": "EA Sports", "release_date": "Sep 22 2003", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/b3f3572f6c633dc9376d8dfefee36b5c-98.jpg", "descriptions": "It's been called the fastest sport on Earth--and the faster the players, the tougher the contact.  NHL 2004 brings professional hockey to life like never before, with crisp passes, searing slap-shots, and a variety of new ways to check your opponent to regain control of the puck.  NHL 2004It's been called the fastest sport on Earth--and the faster the players, the tougher the contact.  NHL 2004 brings professional hockey to life like never before, with crisp passes, searing slap-shots, and a variety of new ways to check your opponent to regain control of the puck.  NHL 2004 is the hockey fan's dream come true, with the addition of international leagues, Bruise Control fighting system, online play, and a Dynasty Mode that lets you build a powerhouse.'.… Expand"}, {"name": "World Series Baseball", "details_link": "https://www.metacritic.com/game/xbox/world-series-baseball", "publisher": "Sega", "release_date": "May 19 2002", "developers": ["Blueshift"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/b24b69785b0bfcdaef04b5ea3cdd26ce-98.jpg", "descriptions": "World Series® Baseball takes the Xbox™ field with ultra-responsive controls and the deepest Franchise Mode in town. Throw in old school players and unis, advanced gameplay and more stats thank you know what to do with and you've got the ultimate hardball sim."}, {"name": "Wizardry 8", "details_link": "https://www.metacritic.com/game/pc/wizardry-8", "publisher": "Sir-Tech Software Inc.", "release_date": "Nov 14 2001", "developers": ["Sir-Tech Software Inc."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "First-Person", "General", "Western-Style"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/57cfc43d2add0c7c4d70d793277bb5af-98.jpg", "descriptions": "An epic fantasy RPG that picks up where \"Wizardry 7\" left off. The Dark Savant had taken flight with a device called the Astral Dominae, an incredibly powerful artifact containing the secret of life itself. Following him are two powerful races, the T'Rang and the Umpani, as well as your ownAn epic fantasy RPG that picks up where \"Wizardry 7\" left off. The Dark Savant had taken flight with a device called the Astral Dominae, an incredibly powerful artifact containing the secret of life itself. Following him are two powerful races, the T'Rang and the Umpani, as well as your own brave party of adventurers. Everyone is headed to Dominus, a world on the cusp of the Cosmic Circle, birthplace of the Astral Dominae and home of the Cosmic Lords. Many paths will converge on Dominus, and many long-hidden secrets will be revealed. [Sirtech]… Expand"}, {"name": "Aliens Versus Predator 2", "details_link": "https://www.metacritic.com/game/pc/aliens-versus-predator-2", "publisher": "Fox Interactive", "release_date": "Oct 31 2001", "developers": ["Monolith Productions"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/d4ce5c1e1406c0924cb623123391d409-98.jpg", "descriptions": "AVP 2 takes you to Planet LV1201, where three diverse and bloodthirsty species battle for survival. The story-driven plot weaves together the fates of all three races.  Choose to play as Alien, Predator, or Marine as you use your physical prowess, killer instincts, or superior firepower toAVP 2 takes you to Planet LV1201, where three diverse and bloodthirsty species battle for survival. The story-driven plot weaves together the fates of all three races.  Choose to play as Alien, Predator, or Marine as you use your physical prowess, killer instincts, or superior firepower to stay alive. [Sierra]… Expand"}, {"name": "Operation Flashpoint: Cold War Crisis", "details_link": "https://www.metacritic.com/game/pc/operation-flashpoint-cold-war-crisis", "publisher": "Codemasters", "release_date": "Aug 30 2001", "developers": ["Bohemia Interactive"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/6942788cf772fb6ab754bfac891e783d-98.jpg", "descriptions": "Players assume the role of a U.S. NATO private on a training mission in a fictional 1985 Cold War storyline, where a new Soviet regime seizes control of an island community, and underground resistance groups have mobilized in opposition. The new Soviet government, unable to fight thePlayers assume the role of a U.S. NATO private on a training mission in a fictional 1985 Cold War storyline, where a new Soviet regime seizes control of an island community, and underground resistance groups have mobilized in opposition. The new Soviet government, unable to fight the resistance, calls upon NATO to act as a peacekeeping force and help restore order to the region. NATO responds with Operation Flashpoint. [Codemasters]… Expand"}, {"name": "Rumble Racing", "details_link": "https://www.metacritic.com/game/playstation-2/rumble-racing", "publisher": "Electronic Arts", "release_date": "Apr 23 2001", "developers": ["Electronic Arts"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/a7304e88cb15abc2175720e66789d248-98.jpg", "descriptions": "The follow-up to last year's PlayStation racer \"NASCAR Rumble\" is an arcade racer featuring 35 cars and 15 tracks, in either Single Race, Stunt, Showdown, or Championship modes.  Ready to feel a little speed?"}, {"name": "Metal Slug X", "details_link": "https://www.metacritic.com/game/playstation/metal-slug-x", "publisher": "Agetec Inc.", "release_date": "Apr 14 2001", "developers": ["ProSoft"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One", "PlayStation"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/a6f762ddc5932f5e08e3479d611040b2-98.jpg", "descriptions": "Brace yourself for non-stop battle action in the hit straight from the arcades! In Metal Slug X, you'll chose from four tough-as-nails soldiers ready for missions that only the best could survive. Rescue hostages while blowing terrorists back to the stone-age using your personal weaponry ANDBrace yourself for non-stop battle action in the hit straight from the arcades! In Metal Slug X, you'll chose from four tough-as-nails soldiers ready for missions that only the best could survive. Rescue hostages while blowing terrorists back to the stone-age using your personal weaponry AND their own machine!… Expand"}, {"name": "Tropico", "details_link": "https://www.metacritic.com/game/pc/tropico", "publisher": "Gathering", "release_date": "Apr  5 2001", "developers": ["PopTop Software"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1 Player", "genres": ["Strategy", "Miscellaneous", "Real-Time", "Management", "Compilation", "Modern", "Modern", "Government"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/2cb436ea54d68f557de19523570ab9a2-98.jpg", "descriptions": "Picture a city-building simulation, god game combination with a good splash of humor set in a third world, Caribbean island setting."}, {"name": "Giants: Citizen Kabuto", "details_link": "https://www.metacritic.com/game/pc/giants-citizen-kabuto", "publisher": "Interplay", "release_date": "Dec  6 2000", "developers": ["Planet Moon Studios"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-10 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/7a6cd0a7cebf78aef727b4906afa8b4e-98.jpg", "descriptions": "A frenzied action game in which players battle each other with one of three distinct races: The Meccs, the Sea Reapers, or the giant named Kabuto. These three species are highly incompatible with one another, and are all battling for supremacy over the islands on which they inhabit.  [Interplay]"}, {"name": "MotoGP 3: Ultimate Racing Technology", "details_link": "https://www.metacritic.com/game/xbox/motogp-3-ultimate-racing-technology", "publisher": "THQ", "release_date": "Aug 30 2005", "developers": ["Climax Group"], "platforms": "Xbox", "num_players": "16  Online", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/491c97d2958468fda31f468b1ad82f6e-98.jpg", "descriptions": "MotoGP 3 straps you on the greatest two-stroke and four-stroke performance cycles. Bikes from a variety of manufacturers--including Honda, Suzuki, Yamaha, Aprilia, and Kawasaki--appear in the game. With each bike, you can control both the rider's weight placement and an optional brake-assistMotoGP 3 straps you on the greatest two-stroke and four-stroke performance cycles. Bikes from a variety of manufacturers--including Honda, Suzuki, Yamaha, Aprilia, and Kawasaki--appear in the game. With each bike, you can control both the rider's weight placement and an optional brake-assist feature. Test your bikes on 15 circuits, plus 20 new fantasy tracks. Challenges include drag races, time trials, slalom courses, and one-on-one races with the sport's top riders. As you conquer each unique challenge, you'll unlock special motorcycles and racers. The Xbox version of MotoGP 3 features photo-realistic circuits and an all-new gameplay mode.… Expand"}, {"name": "Rocket League", "details_link": "https://www.metacritic.com/game/playstation-4/rocket-league", "publisher": "505 Games", "release_date": "Jul  7 2015", "developers": ["Psyonix", "Panic Button"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Futuristic", "Sports", "Team", "Soccer", "Arcade"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/b85809ba32f249c3f944b96333d69e43-98.jpg", "descriptions": "Features improved physics, faster gameplay, and better visuals. An all-new Season Mode with unlockable items, multiple arenas, and more\rThe return of 2-, 3- and 4-player split-screen."}, {"name": "Dead or Alive 4", "details_link": "https://www.metacritic.com/game/xbox-360/dead-or-alive-4", "publisher": "Tecmo", "release_date": "Dec 29 2005", "developers": ["Team Ninja"], "platforms": "Xbox 360", "num_players": "Up to 16 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/0ebe3dcb4f18bc09919d8826ad252c53-98.jpg", "descriptions": "Taking advantage of the superior technology of the new Xbox 360, Dead or Alive 4 raises the bar in both online and offline fighting. By utilizing the advanced technology of the new Xbox 360 hardware, Dead or Alive 4 redefines 3-D high definition graphics and sound, creating the most visuallyTaking advantage of the superior technology of the new Xbox 360, Dead or Alive 4 raises the bar in both online and offline fighting. By utilizing the advanced technology of the new Xbox 360 hardware, Dead or Alive 4 redefines 3-D high definition graphics and sound, creating the most visually beautiful and realistic looking video game to date. Unsurpassed online capabilities via Xbox Live, new interactive stages, an all star line-up of old and new favorite characters, and the most complex DOA countering system yet. [Tecmo]… Expand"}, {"name": "NASCAR SimRacing", "details_link": "https://www.metacritic.com/game/pc/nascar-simracing", "publisher": "EA Games", "release_date": "Feb 15 2005", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PC"], "num_players": "44  Online", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 85, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/9/b995e1200433f4a9696fc2b189a96439-98.jpg", "descriptions": "NASCAR SimRacing has been redefined specifically for the unique tastes of the PC gaming community. Featuring the top three NASCAR Series - the NASCAR Craftsman Truck Series, NASCAR Busch Series, and NASCAR NEXTEL Cup Series - NASCAR SimRacing gives you the full experience of the track. TakeNASCAR SimRacing has been redefined specifically for the unique tastes of the PC gaming community. Featuring the top three NASCAR Series - the NASCAR Craftsman Truck Series, NASCAR Busch Series, and NASCAR NEXTEL Cup Series - NASCAR SimRacing gives you the full experience of the track. Take on racing?s biggest challenge in the all-new Career Mode, where you battle your way through the different series against the NASCAR elite. Or, choose your favorite series and take on a full pack of 800 horse-powered monsters?the authentic sights and sounds of NASCAR racing will blow you away. See it, feel it, hear it... authentic NASCAR. [Electronic Arts]… Expand"}, {"name": "Pure", "details_link": "https://www.metacritic.com/game/xbox-360/pure", "publisher": "Disney Interactive Studios", "release_date": "Sep 23 2008", "developers": ["Black Rock Studio"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/d5ff5de30ebbb177f42347a48593db6d-98.jpg", "descriptions": "Thrill seekers race against skilled rivals and performing gravity-defying aerial tricks in Pure, an extreme sports off-road racing video game. Featuring vertigo-inducing massive aerial jumps and spectacular airborne tricks in photo-realistic real-world locations all over the globe, PureThrill seekers race against skilled rivals and performing gravity-defying aerial tricks in Pure, an extreme sports off-road racing video game. Featuring vertigo-inducing massive aerial jumps and spectacular airborne tricks in photo-realistic real-world locations all over the globe, Pure delivers heart-pounding experiences unique to the genre. Players start by choosing among a variety of male and female character riders.  They can then either race against deft A.I. opponents or online players (up to 16-player multiplayer) in frenetic races and freestyle competitions all over the world. [Disney Interactive Studios]… Expand"}, {"name": "LocoRoco 2", "details_link": "https://www.metacritic.com/game/psp/locoroco-2", "publisher": "SCEA", "release_date": "Feb 10 2009", "developers": ["SCE Japan Studio"], "platforms": ["PlayStation 4", "PSP"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/428a8995267719db019ca29024a850f5-98.jpg", "descriptions": "The LocoRoco are in danger again, the evil Moja have returned and this time they've brought with them a terrible song that sucks the life out of living things! The LocoRoco must once again save their planet - this time by making lots of sweet music. LocoRoco 2 is easy to play, instantlyThe LocoRoco are in danger again, the evil Moja have returned and this time they've brought with them a terrible song that sucks the life out of living things! The LocoRoco must once again save their planet - this time by making lots of sweet music. LocoRoco 2 is easy to play, instantly addictive and guaranteed to make you feel all warm and fuzzy while you hum along to the soundtrack! Explore 25 new stages, including hidden challenges, and meet a colourful cast of new characters. Enhance your LocoRoco through music and song, learning new actions to overcome the Moja. Perform new actions such as climbing inside shells to destroy thorns, jumping from grass blade to grass blade and swimming underwater. Expand your fun with six new mini games, including an Ad-hoc four player game. [Sony]… Expand"}, {"name": "Crysis 2", "details_link": "https://www.metacritic.com/game/playstation-3/crysis-2", "publisher": "EA Games", "release_date": "Mar 22 2011", "developers": ["Crytek"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/6e742dacf4c45950ddad51652f795296-98.jpg", "descriptions": "First-person shooter Crysis returns powered by CryEngline 3 and is coming to the PS3 and Xbox 360, as well as the PC."}, {"name": "The Lord of the Rings Online: Mines of Moria", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-online-mines-of-moria", "publisher": "Turbine Inc.", "release_date": "Nov 17 2008", "developers": ["Turbine Inc."], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/2e301a518b24dc414a03e32339bd6e40-98.jpg", "descriptions": "Mines of Moria  expands the online world of Middle-earth to let players explore the ancient underground cities of the dwarves, battle epic characters in the depths, face off with the Watcher, be a part of the fateful release of Durin’s Bane and more. Speak Friend, and Enter – Moria, calledMines of Moria  expands the online world of Middle-earth to let players explore the ancient underground cities of the dwarves, battle epic characters in the depths, face off with the Watcher, be a part of the fateful release of Durin’s Bane and more. Speak Friend, and Enter – Moria, called Khazad-dûm by the dwarves, was their capital and the grandest of cities.  This enormous underground cavern in north-western Middle-earth, comprises an immense network of tunnels, chambers, mines and huge halls that run beneath and ultimately through the Misty Mountains. For the first time, players of The Lord of the Rings Online enter this ancient city which has served as the foundation for the modern-day dungeon-crawling adventures to battle the hordes of goblins and the Nameless of the Deep and journey through hundreds of new quests within six new kinds of stunning environments. The Mines of Moria represents the beginning of Volume II of The Lord of the Rings Online. Players can experience six new books as part of this update and participate in the release of Durin’s Bane, battle the Watcher, aid Galadriel and more. Players advance their characters up to level 60, gaining access to new traits, virtues, skills and class quests.  The crafting system will also expand, giving players the ability to craft even more powerful items. The Rune-keeper and the Warden, the first new classes to be introduced since the launch of the game, allow players to build exciting and powerful new characters in The Lord of the Rings Online in diverse new ways. The Mines of Moria introduces Turbine’s new item advancement system to The Lord of the Rings Online.  Players will be able to forge weapons and class-related equipment and evolve them to build a legacy the likes of Bilbo’s Sting and Gandalf’s Glamdring. These legendary weapons level-up along with the player, allowing customization by advancing the item’s virtues, adding runic legacies, modifying its titles and forming fables. [Turbine]… Expand"}, {"name": "SoulCalibur IV", "details_link": "https://www.metacritic.com/game/playstation-3/soulcalibur-iv", "publisher": "Namco Bandai Games", "release_date": "Jul 29 2008", "developers": ["Namco", "Project Soul"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "4  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/48813baeea04e14d527dc13aabcd0e4f-98.jpg", "descriptions": "[Also known as \"Soul Calibur IV\"]   Swords will be honed and weapons optimized as the world renowned weapon-based fighting series Soulcalibur unveils a fourth installment. Delivering new gameplay modes, characters and enhanced features with unprecedented 3D modeling and animation,[Also known as \"Soul Calibur IV\"]   Swords will be honed and weapons optimized as the world renowned weapon-based fighting series Soulcalibur unveils a fourth installment. Delivering new gameplay modes, characters and enhanced features with unprecedented 3D modeling and animation, Soulcalibur IV strives to be the definitive fighting game experience. The unrelenting pursuit of two legendary swords continues as Soulcalibur IV re-introduces classic warriors from the series as well as debuting new characters bringing new conflict and intrigue. Soulcalibur IV propels the fighting genre into the next-gen era with visually realistic environments, interactive stages, enhanced AI, and a new battle system. [Namco Bandai]… Expand"}, {"name": "Kingdom Hearts", "details_link": "https://www.metacritic.com/game/playstation-2/kingdom-hearts", "publisher": "SquareSoft", "release_date": "Sep 16 2002", "developers": ["SquareSoft"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/9b91e9862fe003c644ed649348cc62d4-98.jpg", "descriptions": "Kingdom Hearts is the story of Sora, a 14-year-old boy whose world is shattered when a violent storm hits his island-paradise home, and is separated from his two closest friends, Riku, a 15-year-old boy, and Kairi, a 14-year-old girl. The storm scatters the three to differnt and unknownKingdom Hearts is the story of Sora, a 14-year-old boy whose world is shattered when a violent storm hits his island-paradise home, and is separated from his two closest friends, Riku, a 15-year-old boy, and Kairi, a 14-year-old girl. The storm scatters the three to differnt and unknown worlds. At the same time, there's turmoil in Disney Castle. King Mickey is missing, and Court Wizard Donald and Captain Goofy set out to find him. On their travels they meet Sora on his own search for his lost friends. The three are told of ominous creatures known as the Heartless - beings without hearts derived from an unknown dimension and as it turns out, manipulated by Disney villains and the ones responsible for the devastating storm. Upon discovering the link between the Heartless, the storm and the disappearance of King Mickey, Sora, Donald and Goofy join forces and help familiar Disney heroes to save their worlds. [Square]… Expand"}, {"name": "Marvel's Spider-Man: Miles Morales", "details_link": "https://www.metacritic.com/game/playstation-5/marvels-spider-man-miles-morales", "publisher": "PlayStation Studios", "release_date": "Nov 12 2020", "developers": ["Insomniac Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/b98a1d69c467b0ad796ded383599eb72-98.jpg", "descriptions": "The latest adventure in the Spider-Man universe builds on and expand Marvel’s Spider-Man through an all-new story. Players experience the rise of Miles Morales as he masters new powers to become his own Spider-Man. With PS5’s SSD, players can near-instantaneously fast-travel across Marvel’sThe latest adventure in the Spider-Man universe builds on and expand Marvel’s Spider-Man through an all-new story. Players experience the rise of Miles Morales as he masters new powers to become his own Spider-Man. With PS5’s SSD, players can near-instantaneously fast-travel across Marvel’s New York City, or feel the tension of each one of Miles’s web-swings, punches, web shots, and venom blasts with the DualSense wireless controller’s haptic feedback. Highly-detailed character models and enhanced visuals across the game intensify the story of Miles Morales as he faces great, new challenges while learning to be his own Spider-Man.… Expand"}, {"name": "The Binding of Isaac: Afterbirth", "details_link": "https://www.metacritic.com/game/pc/the-binding-of-isaac-afterbirth", "publisher": "Nicalis", "release_date": "Oct 30 2015", "developers": ["Nicalis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/ad82742e049c34d9ee0f9bf2c9e7abb8-98.jpg", "descriptions": "When Isaac’s mother starts hearing the voice of God demanding a sacrifice be made to prove her faith, Isaac escapes into the basement facing droves of deranged enemies, lost brothers and sisters, his fears, and eventually his mother."}, {"name": "Hotline Miami", "details_link": "https://www.metacritic.com/game/playstation-vita/hotline-miami", "publisher": "Devolver Digital", "release_date": "Jun 25 2013", "developers": ["Abstraction Games", "Dennaton"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Stadia", "PlayStation Vita"], "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/88e67e5ec07f1a443c7e33480c6459f9-98.jpg", "descriptions": "Step into the neon-soaked underground of 1980s Miami as bizarre messages on your answering machine seem to be urging you to commit terrible acts of violence - but will you obey? Hotline Miami is full of raw brutality and skull crushing close combat as you find yourself outgunned and usingStep into the neon-soaked underground of 1980s Miami as bizarre messages on your answering machine seem to be urging you to commit terrible acts of violence - but will you obey? Hotline Miami is full of raw brutality and skull crushing close combat as you find yourself outgunned and using your wits to choreograph your way through impossible situations. An unmistakable visual style, a driving soundtrack, and a surreal plot that will have you question your own thirst for blood. Bash and blast through over 20 multiscreen levels with 35 unique weapons and collect 25 game-altering masks in one of the darkest and most unusual independent games on the scene.… Expand"}, {"name": "Amnesia: The Dark Descent", "details_link": "https://www.metacritic.com/game/pc/amnesia-the-dark-descent", "publisher": "THQ", "release_date": "Sep  8 2010", "developers": ["Frictional Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/7ad8341a5c9286d75d8776cdb2122f66-98.jpg", "descriptions": "The last remaining memories fade away into darkness. Your mind is a mess and only a feeling of being hunted remains. You must escape. Awake... Amnesia: The Dark Descent, a first person survival horror. A game about immersion, discovery and living through a nightmare. An experience that willThe last remaining memories fade away into darkness. Your mind is a mess and only a feeling of being hunted remains. You must escape. Awake... Amnesia: The Dark Descent, a first person survival horror. A game about immersion, discovery and living through a nightmare. An experience that will chill you to the core.… Expand"}, {"name": "SoulCalibur IV", "details_link": "https://www.metacritic.com/game/xbox-360/soulcalibur-iv", "publisher": "Namco Bandai Games", "release_date": "Jul 29 2008", "developers": ["Namco", "Project Soul"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/915f59bb2e749da48ea9e928f5420542-98.jpg", "descriptions": "[Also known as \"Soul Calibur IV\"]  Swords will be honed and weapons optimized as the world renowned weapon-based fighting series Soulcalibur unveils a fourth installment. Delivering new gameplay modes, characters and enhanced features with unprecedented 3D modeling and animation, Soulcalibur[Also known as \"Soul Calibur IV\"]  Swords will be honed and weapons optimized as the world renowned weapon-based fighting series Soulcalibur unveils a fourth installment. Delivering new gameplay modes, characters and enhanced features with unprecedented 3D modeling and animation, Soulcalibur IV strives to be the definitive fighting game experience. The unrelenting pursuit of two legendary swords continues as Soulcalibur IV re-introduces classic warriors from the series as well as debuting new characters bringing new conflict and intrigue. Soulcalibur IV propels the fighting genre into the next-gen era with visually realistic environments, interactive stages, enhanced AI, and a new battle system. [Namco Bandai]… Expand"}, {"name": "Control: Ultimate Edition", "details_link": "https://www.metacritic.com/game/playstation-5/control-ultimate-edition", "publisher": "505 Games", "release_date": "Feb  2 2021", "developers": ["Remedy Entertainment"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/18eee2fdc213d1dd441cfcdca0d27af9-98.jpg", "descriptions": "After a secretive agency in New York is invaded by an otherworldly threat, you become the new Director struggling to regain Control. This supernatural third-person action-adventure game will challenge you to master a combination of supernatural abilities, modifiable loadouts and reactiveAfter a secretive agency in New York is invaded by an otherworldly threat, you become the new Director struggling to regain Control. This supernatural third-person action-adventure game will challenge you to master a combination of supernatural abilities, modifiable loadouts and reactive environments, while fighting through a deep and unpredictable world.\r Become the new Director struggling to regain Control.\rYou are Jesse Faden, a young woman with a troubled past. You become the new Director of the Bureau of Control Our frontline in researching and fighting against supernatural enemies like the Hiss threatening our very existence.\r You'll uncover the secret activities of the Bureau agents and explore the strange and shifting halls of the Bureau's headquarters, The Oldest House. Unlock new abilities with Objects of Power and upgrade your Service Weapon to take on bigger and more powerful enemies. Venture into lost sectors in the challenging Expeditions mode. Solve puzzles and complete quests to discover the secret of Jesse's past and the true purpose of the Bureau of Control. Above all, you must defeat the relentless Hiss.\r Control is Jesse Fadens's story. The main plot focuses on her personal search for answers as she grows into the role of the Director. The world of Control has its own story, as do the allies Jesse meets along the way. Side-quests and Secrets are everywhere. Jesse works with other Bureau agents, decodes cryptic ciphers and discovers strange Bureau experiments.\r World Within a Location\rExplore diverse environments and shifting architecture in a deep unpredictable world, set within a sprawling New York building.\r \rFlexible and Supernatural Combat System\rDefine your playstyle by integrating supernatural abilities, upgrades, and modifiable loadouts. \r\rReactive Environments6\rHarness dynamic environmental destruction for exciting combat possibilities and master complex rituals to alter your surroundings.\r \rReality Meets the Unexplainable\rDive into a dark and brutalist-inspired world where daily reality has been corrupted by an otherworldly force.… Expand"}, {"name": "Project Gotham Racing", "details_link": "https://www.metacritic.com/game/xbox/project-gotham-racing", "publisher": "Microsoft Game Studios", "release_date": "Nov 14 2001", "developers": ["Bizarre Creations"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/d4f44e204b702db5fe1e5deb784f03c1-98.jpg", "descriptions": "In Project Gotham Racing, it's just as important to look good racing as it to drive fast.  You receive \"Kudos\" points for your style, skill, and willingness to take risks during races.  Choose from more than 25 different cars from top manufacturers such as Ferrari, Porsche, andIn Project Gotham Racing, it's just as important to look good racing as it to drive fast.  You receive \"Kudos\" points for your style, skill, and willingness to take risks during races.  Choose from more than 25 different cars from top manufacturers such as Ferrari, Porsche, and BMW, and compete on 200 city-based circuits.  You can also race shoulder-to-shoulder with up to three friends in multiplayer mode.  Fun and reward come from focusing equally on speed, flair, and risk-taking.… Expand"}, {"name": "Fable", "details_link": "https://www.metacritic.com/game/xbox/fable", "publisher": "Microsoft Game Studios", "release_date": "Sep 14 2004", "developers": ["Big Blue Box"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/8a61391a5622240f56b875bc94be71b1-98.jpg", "descriptions": "In Fable, every action determines your skill, appearance, and reputation. From childhood to death, you'll age and evolve a hero or villain through the actions you choose and the path you follow--be it good, evil, or in between. Your muscles expand with each feat of strength; your bodyIn Fable, every action determines your skill, appearance, and reputation. From childhood to death, you'll age and evolve a hero or villain through the actions you choose and the path you follow--be it good, evil, or in between. Your muscles expand with each feat of strength; your body becomes fatter with gluttony; your skin tans with exposure to sunlight; and your battle wounds turn into scars. Competitive and cooperative heroes, deadly creatures, dynamic weather systems, and deformable environments all exist in the ever-changing land of Fable. … Expand"}, {"name": "Forza Horizon", "details_link": "https://www.metacritic.com/game/xbox-360/forza-horizon", "publisher": "Microsoft Game Studios", "release_date": "Oct 23 2012", "developers": ["Playground", "Playground Games"], "platforms": "Xbox 360", "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/648729efe48cbfd0512baae5b2775d28-98.jpg", "descriptions": "Combining the traditional Forza with a music festival vibe, Horizon promises to take freedom of the open road to the next level. Explore vast and varied driving playgrounds. Team up or compete with friends and rivals online. Show off your unique driving skills and become the star of theCombining the traditional Forza with a music festival vibe, Horizon promises to take freedom of the open road to the next level. Explore vast and varied driving playgrounds. Team up or compete with friends and rivals online. Show off your unique driving skills and become the star of the world's most rocking motorsport party. … Expand"}]