[{"name": "Claire: Extended Cut", "details_link": "https://www.metacritic.com/game/xbox-one/claire-extended-cut", "publisher": "Hailstorm Games Inc", "release_date": "Sep  6 2016", "developers": ["Hailstorm Games Inc"], "platforms": ["PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Adventure", "General"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/47074b5fe5ae30b497ca9bfa411e4a4c-98.jpg", "descriptions": "Extended Cut goes a little deeper into Claire’s history, bringing up more questions and more answers."}, {"name": "Redeemer: Enhanced Edition", "details_link": "https://www.metacritic.com/game/playstation-4/redeemer-enhanced-edition", "publisher": "Buka Entertainment", "release_date": "Jul 19 2019", "developers": ["Sobaka"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/88237e5354c009717410ae9efee3ae2b-98.jpg", "descriptions": "The stern Russian man Vasily is an ex-security officer of the world’s largest weapons company. But when Vasily decides to leave this dirty business and escapes to an isolated monastery in the East, he becomes a wanted man. Well, they’ve asked for it…"}, {"name": "Picross S", "details_link": "https://www.metacritic.com/game/switch/picross-s", "publisher": "Jupiter Corporation", "release_date": "Sep 28 2017", "developers": ["Jupiter Corporation"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Logic"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/24e786b3bd882ace18b962e3ec262b17-98.jpg", "descriptions": "The new Picross series is now playable on the Nintendo Switch. Comes with Picross and Mega Picross, with 300 puzzles in total, including plenty of difficulty levels. Traditional Picross with comfortable controls! We've brought back the handy assist functions, too. Check out the tutorial forThe new Picross series is now playable on the Nintendo Switch. Comes with Picross and Mega Picross, with 300 puzzles in total, including plenty of difficulty levels. Traditional Picross with comfortable controls! We've brought back the handy assist functions, too. Check out the tutorial for more details.Even if you're new to Picross, give it a try! Unique to the Switch version, 2 players can now play simultaneously! Enjoy with friends and family. \"Picross\" is a picture crossword puzzle game that uses numbers as hints to complete an illustration. The rules are simple and easy to understand, so anyone can pick it up and enjoy. [Nintendo]\r… Expand"}, {"name": "Disney's Chicken Little", "details_link": "https://www.metacritic.com/game/gamecube/disneys-chicken-little", "publisher": "Buena Vista Games", "release_date": "Oct 20 2005", "developers": ["Avalanche Software"], "platforms": "GameCube", "genres": ["Action", "Platformer", "3D"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/b75ec6ebad4a5628bf99c4f3e5b6bdbb-98.jpg", "descriptions": "Chicken Little brings you into the middle of Oakey Oaks, where you'll experience all the action and adventure of Disney's animated film of the same name. Taking on the roles of Chicken Little and his friends, Abby Mallard, Runt-of-the-Litter, and Fish-out-of-Water, you must try to outwitChicken Little brings you into the middle of Oakey Oaks, where you'll experience all the action and adventure of Disney's animated film of the same name. Taking on the roles of Chicken Little and his friends, Abby Mallard, Runt-of-the-Litter, and Fish-out-of-Water, you must try to outwit bully Foxy Loxy and save the town from an alien invasion, all the while attempting to reverse Chicken Little's tarnished reputation from that unfortunate \"acorn incident.\" The game features innovative gadgets, pickups, side quests, and minigames, plus multiplayer gameplay.… Expand"}, {"name": "Crash Bandicoot Purple: Ripto's Rampage", "details_link": "https://www.metacritic.com/game/game-boy-advance/crash-bandicoot-purple-riptos-rampage", "publisher": "VU Games", "release_date": "Jun  3 2004", "developers": ["Vicarious Visions"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/fbab74e13da565338683e05483be8d59-98.jpg", "descriptions": "In Crash Bandicoot Purple: Ripto's Rampage and Spyro Orange: The Cortex Conspiracy, Dr. Neo Cortex--Crash's nemesis--and Ripto--Spyro's nemesis--have accidentally met up through underground portals and are set on taking over the entire universe. Crash and Spyro must team up with each otherIn Crash Bandicoot Purple: Ripto's Rampage and Spyro Orange: The Cortex Conspiracy, Dr. Neo Cortex--Crash's nemesis--and Ripto--Spyro's nemesis--have accidentally met up through underground portals and are set on taking over the entire universe. Crash and Spyro must team up with each other to discover the identity of the new menace and save the universe from this evil plot. In these side-scrolling adventures, you can link up with three friends for a variety of multiplayer modes, including Party Games, Wager Games, and Card Trading. Connecting both Crash Bandicoot Purple and Spyro Orange gives you the option of unlocking special content and allows you to trade and wager the cards with friends.… Expand"}, {"name": "Lupin the 3rd: Treasure of the Sorcerer King", "details_link": "https://www.metacritic.com/game/playstation-2/lupin-the-3rd-treasure-of-the-sorcerer-king", "publisher": "Bandai", "release_date": "Feb 11 2004", "developers": ["Banpresto"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/6a6601e79e6baf84eadf20cb793aedcd-98.jpg", "descriptions": "Fantastic heists, impossible escapes, and busty brunettes - all in a day's work for anime's favorite thief. Play with all the style and panache of a British spy while committing crimes even the most accomplished cat-burglar would be proud of. Use disguises, stealth and of course the loot, toFantastic heists, impossible escapes, and busty brunettes - all in a day's work for anime's favorite thief. Play with all the style and panache of a British spy while committing crimes even the most accomplished cat-burglar would be proud of. Use disguises, stealth and of course the loot, to solve puzzles, gather clues and tackle obstacles. Will you reach the King's palace and its golden treasures? And watch out for the lovely Fujiko - she might steal more than your heart... [Bandai]… Expand"}, {"name": "R: Racing Evolution", "details_link": "https://www.metacritic.com/game/gamecube/r-racing-evolution", "publisher": "Namco", "release_date": "Dec  9 2003", "developers": ["Namco"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/0a81c4e3689cffbf848f74913a523684-98.jpg", "descriptions": "Not your ordinary racer, R: Racing Evolution features a story mode, in-game radio communications, and authentic licensed cars. R: Racing Evolution chronicles the intense competition and deep rivalries found only within the professional racing circuit. Upgrade and modify your vehicle toNot your ordinary racer, R: Racing Evolution features a story mode, in-game radio communications, and authentic licensed cars. R: Racing Evolution chronicles the intense competition and deep rivalries found only within the professional racing circuit. Upgrade and modify your vehicle to compete in five game modes, including Racing Life, Event Challenge, Time Attack, Arcade, and Versus. New features such as the Interactive Driver AI System and in-game radio communications bring players close to the racing action.… Expand"}, {"name": "Pirate Hunter", "details_link": "https://www.metacritic.com/game/pc/pirate-hunter", "publisher": "Encore Software, Inc.", "release_date": "Oct 17 2003", "developers": ["Ascaron Entertainment GmbH", "Ascaron Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 67, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/a5488e655f05185daa6e4875d4dfef0d-98.jpg", "descriptions": "Experience the swashbuckling world of Pirate Hunter and run amuck through the Caribbean. Through 16 scenarios, grow your riches as you steal ships, plunder towns, and earn bounties placed by town governors. Stay vigilant to avoid treachery, mutiny and defeat or else you'll end up in DaveyExperience the swashbuckling world of Pirate Hunter and run amuck through the Caribbean. Through 16 scenarios, grow your riches as you steal ships, plunder towns, and earn bounties placed by town governors. Stay vigilant to avoid treachery, mutiny and defeat or else you'll end up in Davey Jones' locker. [Encore Software]… Expand"}, {"name": "Earth 2150: Lost Souls", "details_link": "https://www.metacritic.com/game/pc/earth-2150-lost-souls", "publisher": "Strategy First", "release_date": "Sep  9 2002", "developers": ["Zuxxez"], "platforms": "PC", "num_players": "Up to 15 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Command"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/bc507606b32ca33c1f1199914914b393-98.jpg", "descriptions": "It is the 7th of December, 2150 and the Earth is quickly coming to an end. An ongoing feud between the Eurasian Dynasty and the United Civilized States has left the planet in disarray - people are hungry, resources are scarce and agricultural production has stopped. But the situation isIt is the 7th of December, 2150 and the Earth is quickly coming to an end. An ongoing feud between the Eurasian Dynasty and the United Civilized States has left the planet in disarray - people are hungry, resources are scarce and agricultural production has stopped. But the situation is getting even worse. A series of nuclear explosions near Antarctica have altered the Earth's orbit around the sun, making glaciers melt and the seas rise to threatening levels and the catastrophe has been worsened by meteorite showers that have buried whole parts of the planet. Thanks to a group of scientists from the Lunar Corporation, a long forgotten colony on the Moon, many people have managed to escape the terror and make their way to the nearby safety of Mars, but an unlucky few - the Lost Souls - have been left behind. And now they are seeking revenge. [Strategy First]… Expand"}, {"name": "Tom Clancy's Rainbow Six Rogue Spear: Black Thorn", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six-rogue-spear-black-thorn", "publisher": "Ubisoft", "release_date": "Oct 31 2001", "developers": ["Red Storm Entertainment"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 67, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/a8cef776f16b84fd07624eba4a56e01f-98.jpg", "descriptions": "Someone is recreating terrorism's most violent acts, and RAINBOW is back on the job. But this new, deadly enemy knows how RAINBOW thinks, how RAINBOW acts, and how to stay one step ahead. [Red Storm Entertainment]"}, {"name": "Extermination", "details_link": "https://www.metacritic.com/game/playstation-2/extermination", "publisher": "SCEA", "release_date": "Jul 23 2001", "developers": ["Deep Space"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 67, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/f48971bb48a9bc670789bc5741373ea4-98.jpg", "descriptions": "Developed by members of the original \"Resident Evil\" creative team, Extermination, a survival horror/action/adventure games, casts you as Dennis Riley, a Marine Special Forces RECON operative on an Antarctica mission to stop the outbreak of a virus mutating people unearthly creatures."}, {"name": "World War Z", "details_link": "https://www.metacritic.com/game/playstation-4/world-war-z", "publisher": "Saber Interactive", "release_date": "Apr 16 2019", "developers": ["Saber Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "First-Person", "Third-Person", "Tactical"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/28c73fa81bcda0c463103bb7e731a5b8-98.jpg", "descriptions": "World War Z is a thrilling four-player cooperative third-person shooter featuring massive swarms of zombies that recklessly rush their living prey. Focused on fast-paced gameplay -- and based on the incredibly popular Paramount Pictures property of the same name -- World War Z explores newWorld War Z is a thrilling four-player cooperative third-person shooter featuring massive swarms of zombies that recklessly rush their living prey. Focused on fast-paced gameplay -- and based on the incredibly popular Paramount Pictures property of the same name -- World War Z explores new storylines and characters from around the world in tense, overwhelming, gruesomely exciting missions crafted specifically for modern consoles and PC.The swarm feels neither fear nor mercy. It rolls forward to spread and consume. Together, make your stand and unload an arsenal of deadly weaponry into these hundreds of swarming zombies. Feel the satisfying rush of life as you cheat death and prevail against such overwhelming odds. Cut the undead down with rocket launchers, machine guns, sentries, turrets, grenade launchers, barbed wire, and more.… Expand"}, {"name": "MudRunners: A Spintires Game", "details_link": "https://www.metacritic.com/game/playstation-4/mudrunners-a-spintires-game", "publisher": "Maximum Games", "release_date": "Oct 31 2017", "developers": ["Koch Media"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Simulation", "Vehicle", "Civilian"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/26ee29f7db4663c725f69c82e54855fc-98.jpg", "descriptions": "Spintires: MudRunner is the ultimate version of the million-seller indie hit Spintires. Like Spintires before it, Spintires: MudRunner puts players in the driver seat and dares them to take charge of incredible all-terrain vehicles, venturing across extreme Siberian landscapes with only aSpintires: MudRunner is the ultimate version of the million-seller indie hit Spintires. Like Spintires before it, Spintires: MudRunner puts players in the driver seat and dares them to take charge of incredible all-terrain vehicles, venturing across extreme Siberian landscapes with only a map and compass as guides!\r A huge upgrade over its predecessor, this edition comes complete with a brand new Sandbox Map joining the original game's 5 environments, a total graphical overhaul, a new Challenge mode with 9 new dedicated maps, 13 new vehicles and other comprehensive improvements. It's not just an enhanced edition, it's the ultimate off-road simulation experience!\r Drive 19 powerful all-terrain vehicles, each with its own characteristics and attachable equipment. Complete your objectives and deliveries by enduring perilous conditions across wild, untamed landscapes in extreme conditions with dynamic day-night cycles. Explore an immersive sandbox environment, enhanced by improved graphics. Overcome muddy terrain, raging rivers and other obstacles that all realistically react to the weight and movement of your vehicle powered by the game's advanced physics engine.\r With your map, compass, winch, and your driving skills as allies, go solo or join up to three others in the coop multiplayer. Download mods created by the passionate community for truck-loads of content and an ever-evolving Spintires: MudRunner experience.… Expand"}, {"name": "Oddworld: Soulstorm", "details_link": "https://www.metacritic.com/game/playstation-5/oddworld-soulstorm", "publisher": "Oddworld Inhabitants", "release_date": "Apr  6 2021", "developers": ["Oddworld Inhabitants"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/298589978c48a28b447ba983338b5f83-98.jpg", "descriptions": "In Oddworld: Soulstorm, you pick-up where New 'N' Tasty left off. Abe has undergone an unwanted transformation from being a clueless Mudokon cog, literally about to be chewed up by the Glukkons' big business machine, into an unlikely hero, a beacon of hope. \r\rAbe was someone who went aboutIn Oddworld: Soulstorm, you pick-up where New 'N' Tasty left off. Abe has undergone an unwanted transformation from being a clueless Mudokon cog, literally about to be chewed up by the Glukkons' big business machine, into an unlikely hero, a beacon of hope. \r\rAbe was someone who went about his life, blind to what was happening around him, and then woke to a deeper uncomfortable reality and had no choice but to make a change. Abe may not have wanted to be a hero, but there was, and remains, some greatness in Abe. A greater purpose. A greater good. All of which got him into enormous amounts of trouble and continues to do so. \r\rRevolutions start small and build from unexpected places. You and Abe are the beginning. In Oddworld: Soulstorm, you will begin to understand the power of many will be needed to solve problems that the individual alone cannot. \r\rBased on the concept of Scavenger's Economy, you will loot from trash cans, pickpocket, and search through lockers for items to craft into weapons and tools to use to help save your fellow Mudokons while you try to unlock the dark secrets behind Brew.\r Whether you prefer the classic Abe playstyle of sneaking and problem solving or using scavenge for what you need to create an arsenal that you can hand off to your followers that you have saved along the way, Oddworld: Soulstorm gives you more choices to replay with different approaches. \r\rAdd in light RPG elements, leader boards, trophies for completionists, and a progression system and Soulstorm sets a new standard for next-generation action adventure platformers.… Expand"}, {"name": "The Sims 3: Showtime", "details_link": "https://www.metacritic.com/game/pc/the-sims-3-showtime", "publisher": "Electronic Arts", "release_date": "Mar  6 2012", "developers": ["The Sims Studio"], "platforms": "PC", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 67, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/6068c77b7f9e64c8d790fe764f838cd4-98.jpg", "descriptions": "The latest expansion to The Sims 3 will let players see their Sims hit the road as singers, acrobats, magicians, and DJs."}, {"name": "Dungeonland", "details_link": "https://www.metacritic.com/game/pc/dungeonland", "publisher": "Paradox Interactive", "release_date": "Jan 29 2013", "developers": ["Critical Studio"], "platforms": "PC", "genres": ["Action", "Strategy", "General", "Real-Time", "General", "MOBA"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/f09ad32bde286e1675c553be6e71f514-98.jpg", "descriptions": "A theme park is a magical place reserved only for children, right? Wrong. DEAD wrong. Dungeonland redefines the idea of having \"fun\" in a fantasy theme park as it attempts to entrap your heroes and let them line up for their demise. Playing as the Rogue, the Warrior, or the Mage,A theme park is a magical place reserved only for children, right? Wrong. DEAD wrong. Dungeonland redefines the idea of having \"fun\" in a fantasy theme park as it attempts to entrap your heroes and let them line up for their demise. Playing as the Rogue, the Warrior, or the Mage, heroes will adventure in a classic co-op dungeon crawl, with a sinister twist: three players can play as the daring heroes, while a fourth takes on the role of Dungeonland's Game Master, using a pool of traps and monsters to annihilate their unwelcome guests! Featuring hero customization, looting and dozens of items, Dungeonland is an amoral, atypical take on asymmetric gameplay.… Expand"}, {"name": "The Legend of Spyro: A New Beginning", "details_link": "https://www.metacritic.com/game/gamecube/the-legend-of-spyro-a-new-beginning", "publisher": "Sierra Entertainment", "release_date": "Oct 10 2006", "developers": ["Krome Studios"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/bd1cfd15f0e627c0caba31d96a79e8a0-98.jpg", "descriptions": "The Legend of Spyro: A New Beginning explores the true origins of Spyro as you embark on a dangerous, combat-driven quest that will bring you face to face with the Dark Master's ultimate creation, Cynder. Experience the true power of the purple dragon as you unleash devastating fury attacks,The Legend of Spyro: A New Beginning explores the true origins of Spyro as you embark on a dangerous, combat-driven quest that will bring you face to face with the Dark Master's ultimate creation, Cynder. Experience the true power of the purple dragon as you unleash devastating fury attacks, upgradeable breaths and ground to aerial melee combos in a frenzied battle with hordes of menacing enemies and bone-chilling bosses. It's an epic and cinematic gameplay experience.… Expand"}, {"name": "Into the Pit", "details_link": "https://www.metacritic.com/game/pc/into-the-pit", "publisher": "Humble Games", "release_date": "Oct 19 2021", "developers": ["Nullpointer Games"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 67, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/7/3f34acf5b478bbee183bc02226b1e9d1-98.jpg", "descriptions": "A fast-paced retro-FPS roguelite. As a member of a family of lore-hunting mystics you are summoned to a cursed village, drawn by rumors of a demonic portal. Dark magics have overwhelmed the village, It's up to you to rescue the survivors, grow your powers, and journey forth INTO THE PIT."}, {"name": "Felix the Reaper", "details_link": "https://www.metacritic.com/game/switch/felix-the-reaper", "publisher": "Daedalic Entertainment", "release_date": "Oct 17 2019", "developers": ["Kong Orange"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 67, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/c6c92f7b2354bdc97faa74d2f51eb2a4-98.jpg", "descriptions": "Felix The Reaper is a romantic comedy about the life of Death. A 3D shadow manipulation puzzle adventure game of dance, dying people and love. Felix works at The Ministry of Death and is in love with Betty The Maiden from The Ministry of Life. He believes that going to the human world as aFelix The Reaper is a romantic comedy about the life of Death. A 3D shadow manipulation puzzle adventure game of dance, dying people and love. Felix works at The Ministry of Death and is in love with Betty The Maiden from The Ministry of Life. He believes that going to the human world as a field reaper will enable him to one day meet her. Hence he’s taken the job of making sure people die – and taught himself to dance to impress the love of his life. Since Felix only moves in the shadows, he needs to manipulate his surroundings to find his way through the world. Luckily reapers like Felix are able to turn the sun and move shadowing objects around. This enables him to create the necessary shadow paths. He does so to solve the adventure plots, that makes people die according to the ministerial plans.… Expand"}, {"name": "Infernium", "details_link": "https://www.metacritic.com/game/switch/infernium", "publisher": "Carlos Coronado", "release_date": "Apr  5 2018", "developers": ["Carlos Coronado"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/4208db04c6ca0264a7427d8e77bec33e-98.jpg", "descriptions": null}, {"name": "Monster Energy Supercross - The Official Videogame", "details_link": "https://www.metacritic.com/game/playstation-4/monster-energy-supercross---the-official-videogame", "publisher": "Milestone S.r.l", "release_date": "Feb 13 2018", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 67, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/4/2b73162db04603c8f32e1c505460a21d-98.jpg", "descriptions": "Race with the official riders from 250SX and 450SX on the official tracks, Daytona included, to experience one of the most spectacular and entertaining racing competition ever! Customize your rider and bike as you like, with countless possibilities, with more than 80 official brands and 300Race with the official riders from 250SX and 450SX on the official tracks, Daytona included, to experience one of the most spectacular and entertaining racing competition ever! Customize your rider and bike as you like, with countless possibilities, with more than 80 official brands and 300 items available, and challenge yourself in conquering the top of the leaderboard.Race alone or against players from all over the world thought different offline and online game modes! Feel the rush of adrenaline, enter the arena and be the King of Supercross!… Expand"}, {"name": "Dead Island: Definitive Collection", "details_link": "https://www.metacritic.com/game/xbox-one/dead-island-definitive-collection", "publisher": "Deep Silver", "release_date": "May 31 2016", "developers": ["Techland"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 67, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/b4ac84fd76807fa62aa8490779a694c2-98.jpg", "descriptions": "(Also known as \"Dead Island: Definite Edition\") Definitive Collection contains Dead Island Definitive Edition, Dead Island: Riptide Definitive Edition and a brand new stand-alone 16-bit game Dead Island Retro Revenge. Dead Island Definitive Edition and Dead Island: Riptide Definitive Edition(Also known as \"Dead Island: Definite Edition\") Definitive Collection contains Dead Island Definitive Edition, Dead Island: Riptide Definitive Edition and a brand new stand-alone 16-bit game Dead Island Retro Revenge. Dead Island Definitive Edition and Dead Island: Riptide Definitive Edition are fully remastered versions of Dead Island and Dead Island Riptide including all released DLC and patches. Dead Island Retro Revenge: A brand new stand-alone 16-bit game set in the style of a classic side-scrolling action/endless runner within the Dead Island universe. Smash heads, crack skulls and slice em up with visceral melee combat and true story-based 4-player co-op in a sprawling open world just waiting for exploration. Enhance and develop your unique character using RPG-like elements including an XP/leveling system and unlockable skill trees. Collect and customize thousands of weapons ranging from simple wooden bats and fire axes to heavy rifles as you search for the makings of the ultimate zombie-slaying tool.\r… Expand"}, {"name": "Trivial Pursuit", "details_link": "https://www.metacritic.com/game/wii/trivial-pursuit", "publisher": "Electronic Arts", "release_date": "Mar 10 2009", "developers": ["EA Bright Light"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 67, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/8/3f362595f92b6e66a178160dea0dd7d2-98.jpg", "descriptions": "The console version of Trivial Pursuit brings the party to the living room TV allowing players to customize the experience with several ways to play. Players can connect with friends in classic Trivial Pursuit mode, hone their knowledge with the single player mode, and gather their buddiesThe console version of Trivial Pursuit brings the party to the living room TV allowing players to customize the experience with several ways to play. Players can connect with friends in classic Trivial Pursuit mode, hone their knowledge with the single player mode, and gather their buddies and bet on their brains with the high stakes mode where every answer counts. [Electronic Arts]… Expand"}, {"name": "WALL-E", "details_link": "https://www.metacritic.com/game/playstation-2/wall-e", "publisher": "THQ", "release_date": "Jun 24 2008", "developers": ["Asobo Studio"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 67, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/03bf9f4202c9b9bbefdee9f89cf2e643-98.jpg", "descriptions": "What if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets aWhat if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets a sleek search robot named EVE. EVE comes to realize that WALL-E has inadvertently stumbled upon the key to the planet’s future, and races back to space to report her findings to the humans (who have been eagerly awaiting word that it is safe to return home). Meanwhile, WALL-E chases EVE across the galaxy and sets into motion one of the most exciting and imaginative comedy adventures ever brought to the big screen. Joining WALL-E on his fantastic journey across a universe of never-before-imagined visions of the future, is a hilarious cast of characters including a pet cockroach, and a heroic team of malfunctioning misfit robots. Players of the game take control of WALL-E and EVE through a fast-paced adventure based on the Disney/Pixar film. The game allows fans to relive some of the movie’s most thrilling moments as they explore 10 worlds filled with non-stop action and adventure, along with head-to-head multiplayer challenges. Players will recognize the storyline, characters and key locations from the WALL-E film as they carry out intense missions, dodge dangerous enemies and navigate their way through a futuristic world. In addition, the game contains new storylines and environments that movie-goers will not see in theaters. [THQ]… Expand"}, {"name": "Two Worlds II", "details_link": "https://www.metacritic.com/game/xbox-360/two-worlds-ii", "publisher": "SouthPeak Games", "release_date": "Jan 25 2011", "developers": ["Reality Pump"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Role-Playing", "Third-Person", "Third-Person", "General", "Action RPG"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/fdf462992185a97ce0eb60fc8969a7e2-98.jpg", "descriptions": "Taking place shortly after the events portrayed in the first Two Worlds, The Temptation takes place in Eastern Antaloor, in the regions surrounding Oswaroh and the Drak’ar Desert. Featuring as much content as the original, Two Worlds: The Temptation features more intricate missions, improvedTaking place shortly after the events portrayed in the first Two Worlds, The Temptation takes place in Eastern Antaloor, in the regions surrounding Oswaroh and the Drak’ar Desert. Featuring as much content as the original, Two Worlds: The Temptation features more intricate missions, improved voice-overs and animations, retooled horseback riding, completely revamped combat, and a new game engine that delivers improved visuals. [SouthPeak Interactive]… Expand"}, {"name": "Full Auto 2: Battlelines", "details_link": "https://www.metacritic.com/game/playstation-3/full-auto-2-battlelines", "publisher": "Sega", "release_date": "Dec  7 2006", "developers": ["Pseudo Interactive"], "platforms": "PlayStation 3", "num_players": "Up to 8 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/d334a5a65f5539ef7249cf5d8f87f305-98.jpg", "descriptions": "Full Auto 2: Battlelines puts high-speed vehicles outfitted with weapons and armor into fully realized and fully destructible urban street environments. Fierce combat-racing will ensue as you strategically use destruction to win races as well as leave massive devastation in your wake.Full Auto 2: Battlelines puts high-speed vehicles outfitted with weapons and armor into fully realized and fully destructible urban street environments. Fierce combat-racing will ensue as you strategically use destruction to win races as well as leave massive devastation in your wake. Players can destroy the environment to dynamically change track conditions to block competitors, open new paths, or crush opponents with falling debris caused by well-timed missiles. Full Auto 2: Battlelines also introduces a new Arena Mode featuring team play and six different levels, each specifically designed for a unique type of multiplayer car combat. In the new multi-path single player campaign, players battle to take control of Staunton City by conquering the six different districts and taking control of opponent cars and weapons. The game's six different carnage-filled multiplayer modes, which incorporate team play and objectives ranging from classic deathmatches to unique base assaults and gladiator-style gameplay, deliver a diverse range of competitive options. The sequel implements the fan-favorite Unwreck feature, which allows players to turn back time and take another shot at a treacherous turn, avoid a deadly obstacle, or simply avoid enemy fire. [Sega]… Expand"}, {"name": "The Little Acre", "details_link": "https://www.metacritic.com/game/playstation-4/the-little-acre", "publisher": "Curve Digital", "release_date": "Dec 13 2016", "developers": ["Curve Digital"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Point-and-Click", "Linear"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/97ade0fca7bc0c49c119731148d83025-98.jpg", "descriptions": "The Little Acre is the story of Aidan and his daughter, Lily, set in 1950’s Ireland. After discovering clues as to the whereabouts of his missing father, Aidan begins investigating until he inadvertently finds himself transported to a strange new world."}, {"name": "Taito Legends 2", "details_link": "https://www.metacritic.com/game/playstation-2/taito-legends-2", "publisher": "Destineer", "release_date": "May 16 2007", "developers": ["Empire Oxford"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 67, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/04d46403ae5042b2fe71872930ff7a40-98.jpg", "descriptions": "Taito Legends 2 includes: Alpine Ski, Kuri Kinton, Arabian Magic, Legend Of Kage, Bonze Adventure, Liquid Kids, Cameltry, Lunar Rescue, Chack'n Pop, Majestic 12, Cleopatra Fortune, Metal Black, Crazy Balloon,Puchi Carat, Darius Gaiden, Puzzle Bobble 2, Don Doko Don,Qix Dungeon Magic,Taito Legends 2 includes: Alpine Ski, Kuri Kinton, Arabian Magic, Legend Of Kage, Bonze Adventure, Liquid Kids, Cameltry, Lunar Rescue, Chack'n Pop, Majestic 12, Cleopatra Fortune, Metal Black, Crazy Balloon,Puchi Carat, Darius Gaiden, Puzzle Bobble 2, Don Doko Don,Qix Dungeon Magic, Raimais, Elevator Action Returns, Rastan 2, The Fairyland Story, Space Invaders 95, Football Champ, Space Invaders DX, Front Line, Violence Fight, Gekirindan, Wild Western, Grid Seeker: Project Storm Hammer, Insector X, Growl, KiKi KaiKai, Gun Frontier.… Expand"}, {"name": "Hard Reset Redux", "details_link": "https://www.metacritic.com/game/xbox-one/hard-reset-redux", "publisher": "Gambitious", "release_date": "Jun  3 2016", "developers": ["Flying Wild Hog"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 67, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/f5033794177f7343b2abd2c3e8bac96d-98.jpg", "descriptions": "An action-focused and hardcore single-player shooter which embraces the paradigmatic qualities that the genre has it offer. It includes over-the-top destruction, myriads of enemies, weapon variety, a challenging campaign and a cyberpunk setting."}, {"name": "The Way", "details_link": "https://www.metacritic.com/game/pc/the-way", "publisher": "PlayWay", "release_date": "May 19 2016", "developers": ["Puzzling Dream"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/15adb3a3697cd7aeb4bf29724803265e-98.jpg", "descriptions": "Journey to another planet and discover its secrets in order to bring your loved one back to life. Experience an adventure, inspired by old school classics like Another World, Heart of Darkness and Flashback."}, {"name": "D4: Dark Dreams Don't Die", "details_link": "https://www.metacritic.com/game/pc/d4-dark-dreams-dont-die", "publisher": "Active Gaming Media Inc.", "release_date": "Jun  5 2015", "developers": ["Access Games"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "Third-Person"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/5fdb97391e86cf021ea335fb6bb42895-98.jpg", "descriptions": "Follow the story of Detective David Young, who has the curious ability to dive back in time, and use the power of Kinect or your controller to help David solve the mystery of his murdered wife and prevent it from ever occurring."}, {"name": "Fuel", "details_link": "https://www.metacritic.com/game/playstation-3/fuel", "publisher": "Codemasters", "release_date": "Jun  2 2009", "developers": ["Asobo Studio"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "General", "General"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/92ef2fcd24571a0a4b7fde6b7194eba9-98.jpg", "descriptions": "Get fuelled up and prepare to race and explore the world's largest ever racing environment - over 5,000 square miles of spectacular wilderness. Set to revolutionise multi-terrain, multi-vehicle racing, FUEL is a fiercely competitive game without boundaries. On and off-road, two andGet fuelled up and prepare to race and explore the world's largest ever racing environment - over 5,000 square miles of spectacular wilderness. Set to revolutionise multi-terrain, multi-vehicle racing, FUEL is a fiercely competitive game without boundaries. On and off-road, two and four-wheeled vehicles race a massively diverse environment, from scaling the highest snow-capped mountain to racing the deepest arid canyon. In a fictional present, vast swathes of the United States have been ravaged by the extreme effects of accelerated global warming: tornados, brush fires, hurricanes and tsunamis have driven people from their homes leaving huge areas of America abandoned. Now these dangerous areas have created the perfect playground for a new breed of adrenaline junkies who set out to conquer each other, and Mother Nature, in closely fought races. There are over 70 different vehicles with which to take on any challenge that FUEL’s stunning environment throws at you. On-road and off-road bikes, cars, quads, trucks, buggies and dragsters take dangerous short-cuts, perform death-defying jumps and tear through spectacular cross-over points. FUEL's landscape is powered by cutting-edge technology and, using satellite data, features some of the most exciting and inspiring areas of America - including the Grand Canyon, Yosemite National Park, Mount Rainier and much more. In FUEL, if you can see it, you can drive to it, taking any route - on or off-road - that you want.  With a draw distance of 40KM, 100,000 miles of roads, tracks and trails and hundreds of race events FUEL’s epic world demands to be explored. [Codmasters]… Expand"}, {"name": "Namco Museum DS", "details_link": "https://www.metacritic.com/game/ds/namco-museum-ds", "publisher": "Namco Bandai Games America", "release_date": "Sep 18 2007", "developers": ["M2"], "platforms": "DS", "num_players": "4  Online", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/ed1ffbb8b2f287c60571ceacc041e7f4-98.jpg", "descriptions": "Namco Museum DS allows gamers to experience a virtual arcade portal where they can choose from up to eight games: \"Pac-Man,\" \"Pac-Man VS,\" \"Galaga,\" \"Xevious,\" \"Dig Dug II,\" \"Galaxian,\" \"Mappy,\" and \"The Tower of Druaga.\" Features that are unique to Namco Museum DS include a screen modeNamco Museum DS allows gamers to experience a virtual arcade portal where they can choose from up to eight games: \"Pac-Man,\" \"Pac-Man VS,\" \"Galaga,\" \"Xevious,\" \"Dig Dug II,\" \"Galaxian,\" \"Mappy,\" and \"The Tower of Druaga.\" Features that are unique to Namco Museum DS include a screen mode selection that allows the use of different screen combinations on the Nintendo DS. This allows players the chance to fit their classic games specifically to the Nintendo DS or in the \"stand-up\" arcade style. Players can also enjoy wireless battles in Pac-Man VS, an addictive take on Pac-Man which was previously only available exclusively with the purchase or pre-order of previous games.  This version of the game features downloadable play where up to four players can battle using only one Game Card. [Namco Bandai Games]… Expand"}, {"name": "Warhammer 40,000: Squad Command", "details_link": "https://www.metacritic.com/game/psp/warhammer-40000-squad-command", "publisher": "THQ", "release_date": "Nov 12 2007", "developers": ["RedLynx"], "platforms": "PSP", "num_players": "8  Online", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "Tactics"], "meta_score": 67, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/40544d900b6c068dfb9c9400a05a31e1-98.jpg", "descriptions": "Warhammer 40,000: Squad Command features fast, action-packed combat through turn-based strategy and an engaging, authentic single-player storyline. Gamers play as the elite Space Marines of the Ultramarines chapter and strive to combat the encroaching evil of the ruthless and daemonicWarhammer 40,000: Squad Command features fast, action-packed combat through turn-based strategy and an engaging, authentic single-player storyline. Gamers play as the elite Space Marines of the Ultramarines chapter and strive to combat the encroaching evil of the ruthless and daemonic influenced Chaos Space Marines through 13 cinematically-tied missions. With a robust multiplayer mode featuring 9 unique missions, gamers will team up and go head-to-head with other gamers worldwide as either the Imperium of Man or Chaos Space Marines, ensuring hours of unique replayability. Compelling single player game consisting of 13 unique missions. 9 unique multiplayer maps for Local or Global games, with small, medium and large map variants to cater for games from 2 to 8 players. Fully destructible, real time 3D battlefields mean that no two games will be the same. Pick from two Space Marine chapters or two Chaos Space Marine Legions to play as in Multiplayer games, in battles between Imperium vs. Imperium, Forces of Chaos vs. Forces of Chaos, or Imperium vs. Forces of Chaos.… Expand"}, {"name": "Blood Will Tell", "details_link": "https://www.metacritic.com/game/playstation-2/blood-will-tell", "publisher": "Sega", "release_date": "Sep 21 2004", "developers": ["Paon Corporation"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 67, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/b3fa252188a34ad904ae274fefd4166d-98.jpg", "descriptions": "Blood Will Tell is a modern day action epic adapted from the classic manga by Osamu Tezuka (Astro Boy). Like the original manga, the game follows the adventures of Hyakkimaru, a samurai haunted by a shocking secret who embarks on a quest to uncover his past and regain his humanity. As aBlood Will Tell is a modern day action epic adapted from the classic manga by Osamu Tezuka (Astro Boy). Like the original manga, the game follows the adventures of Hyakkimaru, a samurai haunted by a shocking secret who embarks on a quest to uncover his past and regain his humanity. As a newborn baby he was robbed of every limb, every organ and even the ability to cry. He replaced his missing parts with weapons and departed on a quest to destroy the fiends who robbed his organs, hoping to regain his body and his future. Throughout the game, Hyakkimaru's friend Dororo is there to help and guide players and fight alongside Hyakkimaru. [Sega]… Expand"}, {"name": "Chronos: Before the Ashes", "details_link": "https://www.metacritic.com/game/pc/chronos-before-the-ashes", "publisher": "Gunfire Games", "release_date": "Dec  1 2020", "developers": ["Gunfire Games"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/f14dd4ed24466fdf260336c984bd862c-98.jpg", "descriptions": "An Adventure RPG with a refreshing combination of adventure game elements and RPG mechanics. Deep combat - a variety of weapons, abilities and powers are available to the player in the pursuit of their quest. Unique aging mechanic - Every time the player dies they age One year. Players mustAn Adventure RPG with a refreshing combination of adventure game elements and RPG mechanics. Deep combat - a variety of weapons, abilities and powers are available to the player in the pursuit of their quest. Unique aging mechanic - Every time the player dies they age One year. Players must adapt to their advancing age as they progress their character; starting the game young, nimble and quick, and ending wise and more attuned to magic.… Expand"}, {"name": "Super Daryl Deluxe", "details_link": "https://www.metacritic.com/game/playstation-4/super-daryl-deluxe", "publisher": "Dan & Gary Games", "release_date": "Apr 10 2018", "developers": ["Dan & Gary Games"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/d442d1bde22d78c9efd54a3f00d10aff-98.jpg", "descriptions": "Super Daryl Deluxe is an RPGvania with brawler-style combat set inside of a perfectly normal, sprawling, multi-dimensional high school."}, {"name": "Disney's Meet the Robinsons", "details_link": "https://www.metacritic.com/game/playstation-2/disneys-meet-the-robinsons", "publisher": "Disney Interactive Studios", "release_date": "Mar 27 2007", "developers": ["Avalanche Software"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 67, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/76a60fb4a094fe43808a931ba788f892-98.jpg", "descriptions": "What if you could change the past? What if you could control the future? What if time was on your side? Play as Wilbur Robinson and experience the thrills of time travel adventure.  With a ton of crazy gadgets at your disposal, battle enemies and solve puzzles while in pursuit of theWhat if you could change the past? What if you could control the future? What if time was on your side? Play as Wilbur Robinson and experience the thrills of time travel adventure.  With a ton of crazy gadgets at your disposal, battle enemies and solve puzzles while in pursuit of the dastardly Bowler Hat Guy and his diabolical robotic hat, Doris. It's up to you to thward their evil plans and save the future! Explore ancient Egypt, the Robinsons' mansion, The Hive and other supercool locales. Break out the Charge Glove, the Disassembler, the Scanner, the family Album, the Havoc Gloves and the Leviathon device. [Buena Vista Games]… Expand"}, {"name": "Blair Witch", "details_link": "https://www.metacritic.com/game/xbox-one/blair-witch", "publisher": "Bloober Team", "release_date": "Aug 30 2019", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/c3e7270584a9c840fce4765718419b3c-98.jpg", "descriptions": "Your darkest fears will awaken in these woods.\rIt's 1996. A young boy disappears in the Black Hills Forest near Burkittsville, Maryland. As Ellis, a former police officer with a troubled past, you join the search. What starts as an ordinary investigation soon turns into an endless nightmareYour darkest fears will awaken in these woods.\rIt's 1996. A young boy disappears in the Black Hills Forest near Burkittsville, Maryland. As Ellis, a former police officer with a troubled past, you join the search. What starts as an ordinary investigation soon turns into an endless nightmare as you confront your fears and the Blair Witch, a mysterious force that haunts the woods\r Blair Witch is a first-person, story-driven psychological horror game based on the cinematic lore of Blair Witch.\rA STORY OF THE HUMAN DESCENT INTO DARKNESS\rFrom the creative minds behind the critically acclaimed Layers of Fear, experience first-hand the toll that fear can take on the mind in an original story inspired by the cinematic lore of Blair Witch.\rFIND THE WAY THROUGH THE HAUNTED WOODS\rWith just your loyal dog Bullet by your side, navigate your way through a cursed forest that warps and distorts both time and space.\rYOUR SANITY AGAINST HER CURSE\rStand against the horrors of the Blair Witch and the decaying sanity of a man burdened by his past.\rHOW WILL YOU FACE YOUR FEARS?\rAs you delve deeper into the woods, how you react to danger and behave under pressure will ultimately teach you more about yourself.… Expand"}, {"name": "Frozenheim", "details_link": "https://www.metacritic.com/game/pc/frozenheim", "publisher": "Hyperstrange", "release_date": "Jun 16 2022", "developers": ["Paranoid Interactive"], "platforms": "PC", "num_players": "", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/ce6fc7f2edb6f317bcb048a5d329c238-98.jpg", "descriptions": "Frozenheim is a serene Norse city builder with elaborate management gameplay and RTS tactical combat. Lead your Viking clan through hardships of the frozen north, season by season, year after year. Build and survive. Set sail, explore and conquer. Win Odin’s favor and secure your place inFrozenheim is a serene Norse city builder with elaborate management gameplay and RTS tactical combat. Lead your Viking clan through hardships of the frozen north, season by season, year after year. Build and survive. Set sail, explore and conquer. Win Odin’s favor and secure your place in Valhalla!\r… Expand"}, {"name": "Small Radios Big Televisions", "details_link": "https://www.metacritic.com/game/pc/small-radios-big-televisions", "publisher": "Adult Swim", "release_date": "Nov  8 2016", "developers": ["Owen Deery", "Fire Face"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 67, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/33966aa14c0c7c7e656c856fdf12e2a8-98.jpg", "descriptions": "Explore the inner workings of deserted factories in search of data cassettes that contain boundless virtual worlds. Collect more tapes and explore more worlds and you'll soon discover new methods of traversal and control that will take you farther than you'd ever expect."}, {"name": "Rogue Wizards", "details_link": "https://www.metacritic.com/game/pc/rogue-wizards", "publisher": "Spellbind Studios", "release_date": "Sep 27 2016", "developers": ["Spellbind Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike", "Western-Style"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/b35d21628b05051fca9a75432ff90fec-98.jpg", "descriptions": "The Council oversees the elam families, aristocrats who are descended from the first humans in Rilfanor, and the banlits, who were originally people born without magical abilities. The Guild has never admitted banlits because of their lack of magical capacity; and they've never admittedThe Council oversees the elam families, aristocrats who are descended from the first humans in Rilfanor, and the banlits, who were originally people born without magical abilities. The Guild has never admitted banlits because of their lack of magical capacity; and they've never admitted women because they believed women were too weak-minded to control such power. Now, many generations later, the elam magic is weakening, and latent magic talent has reappeared among the banlit population. Many of the elam are in denial, but some of them want to take the radical step of allowing banlits, including women, into the Guild. … Expand"}, {"name": "CALENDULA", "details_link": "https://www.metacritic.com/game/pc/calendula", "publisher": "Blooming Buds Studio", "release_date": "Feb  2 2016", "developers": ["Blooming Buds Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/1f88fbfef4cd228bd1115fcaabd35e14-98.jpg", "descriptions": "Calendula is an experimental meta game about trying to play a game. Use your logic to thrive against conventions and get surrounded by a dark atmosphere."}, {"name": "Tecmo Bowl Throwback", "details_link": "https://www.metacritic.com/game/xbox-360/tecmo-bowl-throwback", "publisher": "Tecmo", "release_date": "Apr 28 2010", "developers": ["Southend Interactive"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/f65e2fff29d495040409931f9567f319-98.jpg", "descriptions": "TECMO BOWL THROWBACK brings back the gameplay you loved, and stays true to the Tecmo Super Bowl legacy! Challenge friends in online multiplayer mode in either the classic 2D style or in the new, modern 3D graphics. Local and online multiplayer mode is up to two players. [Tecmo]"}, {"name": "Rayman Raving Rabbids", "details_link": "https://www.metacritic.com/game/xbox-360/rayman-raving-rabbids", "publisher": "Ubisoft", "release_date": "Apr 24 2007", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Platformer", "Party / Minigame", "3D", "3D"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/d93cd6eb2797b0e1c49ac3454da72775-98.jpg", "descriptions": "Rayman Raving Rabbids marks the return of the iconic video-game hero, Rayman, in his funniest and zaniest adventure ever. When the world of Rayman is threatened by a devastating invasion of crazed, out-of-control bunnies Rayman must rise up against his furry foes to foil their wicked plans.Rayman Raving Rabbids marks the return of the iconic video-game hero, Rayman, in his funniest and zaniest adventure ever. When the world of Rayman is threatened by a devastating invasion of crazed, out-of-control bunnies Rayman must rise up against his furry foes to foil their wicked plans. Utilizing an array of amazing new abilities, and with the help of magical creatures, Rayman must break out all the moves to save his world from these delirious bunnies and their hare-raising antics. Combat the Ultra-Crazed Evil Rabbits – Take control of Rayman and his knack for attack to help save his world from the raving rabbids. They are mischievous, insane and completely out of control. There are several types of rabbids each with its own mischievous characteristics. Tame and control various creatures such as sharks, eagles, rhinos, spiders and angelfish. Rayman can master each animal's unique capabilities to help in his battle against the devious rabbits. Customize and disguise Rayman. Go punk, pop, rock or hip hop to infiltrate the bunnies and foil their devious plans. Explore amazing free-roaming environments and beautiful epic landscapes that mix real and fantastical styles to create a visually stunning experience. [Ubisoft]… Expand"}, {"name": "Sega Superstars Tennis", "details_link": "https://www.metacritic.com/game/playstation-3/sega-superstars-tennis", "publisher": "Sega", "release_date": "Mar 18 2008", "developers": ["Sumo Digital"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 67, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/d14ab8849cb38a19bddb8176dcef9e49-98.jpg", "descriptions": "Sixteen fan-favorite SEGA characters from Sonic to NiGHTS are serving up fun in SEGA Superstars Tennis. Multiple madcap mini-games keep the party rolling and up to four friends can challenge each other in tournaments, exhibitions and unlockable special events. With hilarious cameos andSixteen fan-favorite SEGA characters from Sonic to NiGHTS are serving up fun in SEGA Superstars Tennis. Multiple madcap mini-games keep the party rolling and up to four friends can challenge each other in tournaments, exhibitions and unlockable special events. With hilarious cameos and comical guest umpires from SEGA's rich gaming history, this fun-filled tennis party promises to be a smashing good time for the whole family. Zany SEGA Characters with Superstar Abilities - Each of the 16 characters has their own superstar alter-ego, which gives them the winning edge on the court. Ten Fantastical Themed Courts - Guest umpires will supervise the action on a wide variety of colorful courts, from Sonic's lush Green Hill Zone to Ulala's galactic Space Channel 5 world, just to name a couple. Four Action-Packed Tournaments - As you slice your way through the competitive tournaments, you will unlock loads of bonus content. Classic Soundtrack - Faithfully recreated in full Dolby Digital 5.1, treasured SEGA tunes will entertain SEGA fans new and old. [Sega]… Expand"}, {"name": "Harry Potter and the Order of the Phoenix", "details_link": "https://www.metacritic.com/game/playstation-3/harry-potter-and-the-order-of-the-phoenix", "publisher": "EA Games", "release_date": "Jun 25 2007", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 67, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/dae1998dafcf59a9851a0b15d68b299f-98.jpg", "descriptions": "In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster,In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster, Albus Dumbledore, is lying about Voldemort's return in order to undermine his power and take his job, the Minister for Magic, Cornelius Fudge, appoints a new Defense Against the Dark Arts teacher to keep watch over Dumbledore and the Hogwarts students. But Professor Dolores Umbridge's Ministry-approved course of defensive magic leaves the young wizards woefully unprepared to defend themselves against the dark forces threatening them and the entire wizarding community, so at the prompting of his friends Hermione and Ron, Harry takes matters into his own hands. Meeting secretly with a small group of students who name themselves \"Dumbledore’s Army,\" Harry teaches them how to defend themselves against the Dark Arts, preparing the courageous young wizards for the extraordinary battle that lies ahead. With the ability to play multiple characters, including Harry Potter, Dumbledore and Sirius Black, the videogame of Harry Potter and the Order of the Phoenix offers fans the opportunity to wield a wand, explore all around Hogwarts, and experience one of the most exciting and dangerous years in the life of the Boy Who Lived. [Electronic Arts / Warner Bros.]… Expand"}, {"name": "Psikyo Shooting Stars Bravo", "details_link": "https://www.metacritic.com/game/switch/psikyo-shooting-stars-bravo", "publisher": "NIS America", "release_date": "Feb 18 2020", "developers": ["Psikyo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/61033e7aed73899b5a137464aa6d1a8f-98.jpg", "descriptions": "Classic shooting games in a retro compliation for NSW.\rIncludes Samurai Aces, TENGAI, [SENGOKU CANNON/SAMURAI ACES 3], GUNBIRD, GUNBIRD2, and GUNBARICH."}, {"name": "Fragile Dreams: Farewell Ruins of the Moon", "details_link": "https://www.metacritic.com/game/wii/fragile-dreams-farewell-ruins-of-the-moon", "publisher": "XSEED Games", "release_date": "Mar 16 2010", "developers": ["Tri-Crescendo"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 67, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/bb8f6bca60a284dc5125ac29d105fd99-98.jpg", "descriptions": "Marked by a remarkably haunting score, FRAGILE DREAMS: FAREWELL RUINS OF THE MOON finds protagonist Seto exploring an eerie and abandoned world, seemingly populated only by haunting ghosts and demons. As this lonely and lost soul, players encounter memorable characters, and discover the backMarked by a remarkably haunting score, FRAGILE DREAMS: FAREWELL RUINS OF THE MOON finds protagonist Seto exploring an eerie and abandoned world, seemingly populated only by haunting ghosts and demons. As this lonely and lost soul, players encounter memorable characters, and discover the back story behind scavenged items that provide insight into the population’s last days before a devastating apocalypse. Amidst this strangely beautiful atmosphere, players utilize the Wii Remote as a flashlight to illuminate Seto’s surroundings, solve puzzles and interact with the bleak, devastated environment, set to a moving, emotional soundtrack. [XSEED]… Expand"}, {"name": "Dewy's Adventure", "details_link": "https://www.metacritic.com/game/wii/dewys-adventure", "publisher": "Konami", "release_date": "Sep 25 2007", "developers": ["Konami"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/7300faa668e5c60ca47100fdd4a43007-98.jpg", "descriptions": "The evil Don Hedron has descended upon the peaceful forest with Black Water and it's up to Dewy, a small droplet of water, to eliminate the terrible scourge and save the towering Elder Tree. Take control of Dewy using the Wii Remote, rolling him around the environment and using specialThe evil Don Hedron has descended upon the peaceful forest with Black Water and it's up to Dewy, a small droplet of water, to eliminate the terrible scourge and save the towering Elder Tree. Take control of Dewy using the Wii Remote, rolling him around the environment and using special elemental powers with unique gesture-based controls to take on the dastardly forces of Don Hedron. Control heat and cold to transform Dewy into ice and steam to solve puzzles and restore a beautiful world of peace! Unleash special elemental powers with the Wii Remote to take on enemies and solve puzzles - shoot bolts of lightning, create earthquakes or wind and more. Control temperature that heat or cool Dewy down to turn him into ice and steam for even more choices in battle. [Konami]… Expand"}, {"name": "Jak and Daxter Collection", "details_link": "https://www.metacritic.com/game/playstation-vita/jak-and-daxter-collection", "publisher": "SCEA", "release_date": "Jun 18 2013", "developers": ["Mass Media"], "platforms": ["PlayStation 3", "PlayStation Vita"], "genres": ["Action", "Miscellaneous", "Platformer", "Compilation", "Compilation", "3D"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/0467f9dec3da74418187dcf66e420c35-98.jpg", "descriptions": "Nearly 10 years ago, the Jak and Daxter franchise debuted on PlayStation 2, raising the bar for the platforming genre and quickly becoming a fan favorite. Today, we announced that the original Jak and Daxter trilogy will be coming together for the first time ever on one Blu-ray disc in theNearly 10 years ago, the Jak and Daxter franchise debuted on PlayStation 2, raising the bar for the platforming genre and quickly becoming a fan favorite. Today, we announced that the original Jak and Daxter trilogy will be coming together for the first time ever on one Blu-ray disc in the Jak and Daxter Collection. Available exclusively for PlayStation 3, The Jak and Daxter Collection includes the dynamic duo's first three adventures: Jak and Daxter: The Precursor Legacy, Jak II and Jak 3.… Expand"}, {"name": "Cooking Mama", "details_link": "https://www.metacritic.com/game/ds/cooking-mama", "publisher": "Majesco Games", "release_date": "Sep 12 2006", "developers": ["Taito Corporation", "Office Create"], "platforms": ["iPhone/iPad", "DS"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "General", "General", "Virtual", "Career"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/0b15ce22d347f1f90b8fdc6cc9ef3fc5-98.jpg", "descriptions": "Learn how to cook with your Nintendo DS! As a budding chef you must first prepare foods then combine raw ingredients together as you cook them on the stove. Follow real recipes or experiment with your own combinations to create a culinary masterpiece with your stylus. Create 76 different,Learn how to cook with your Nintendo DS! As a budding chef you must first prepare foods then combine raw ingredients together as you cook them on the stove. Follow real recipes or experiment with your own combinations to create a culinary masterpiece with your stylus. Create 76 different, real world dishes from fried eggs to cabbage meat rolls. By mastering the first 15 recipes you can unlock 61 increasingly complex bonus recipes to expand your skills in the kitchen. The stylus is your master kitchen tool. Use it in more than 200 mini-games to chop, slice, pan fry, knead, grate, mash, tenderize, mix, peel, carve, roll and more. Once your dish is ready, you can even use the stylus to prepare the final layout of your meal. Cool food down by blowing into the Nintendo DS microphone. Combine recipes to create more advanced dishes. Share recipes with up to 4 other people or transfer a saved game to a friend via the DS wireless link. Earn bronze, silver and gold medals based on the quality of your cooking. Practice mode lets you finetune your cooking skills without being judged. [Majesco]… Expand"}, {"name": "Isonzo", "details_link": "https://www.metacritic.com/game/playstation-5/isonzo", "publisher": "M2H", "release_date": "Sep 13 2022", "developers": ["M2H & BlackMill Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 40 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 67, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/64aa7b990e06f7d901564a0dc8a277d3-98.jpg", "descriptions": "Ferocious Alpine warfare will test your tactical skills in this authentic WW1 FPS. Battle among the scenic peaks, rugged valleys and idyllic towns of northern Italy. The Great War on the Italian Front is brought to life and elevated to unexpected heights."}, {"name": "Wonder Boy Collection", "details_link": "https://www.metacritic.com/game/switch/wonder-boy-collection", "publisher": "ININ Games", "release_date": "Jun  3 2022", "developers": ["Bliss Brain"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/76fbd72e0c9968e0d3da45221369612e-98.jpg", "descriptions": "Bringing together four of the very best Wonder Boy games - from the original 1986 arcade version to 1994's Monster World IV - this remarkable collection gives you a chance to experience one of the most influential series from gaming's past. Through the 1980s and 1990s the Wonder Boy gamesBringing together four of the very best Wonder Boy games - from the original 1986 arcade version to 1994's Monster World IV - this remarkable collection gives you a chance to experience one of the most influential series from gaming's past. Through the 1980s and 1990s the Wonder Boy games built up a huge following with their dazzling blend of energetic platforming and action-RPG gameplay. Unlike other titans from the platform genre, however, the Wonder Boy games have seen very limited release in the West on modern gaming hardware. Until now! The Wonder Boy games are designed to be simple to pick-up and play for gamers of every ability - but contain enough depth and challenge to keep even the most skilled players busy. And now they're updated with modern features such as the ability to rewind your game at any moment. So whether you're looking to try this iconic gaming series for the first time, revisit a youth spent playing Wonder Boy, or add a refreshingly distinct platformer to your collection, Wonder Boy Collection is the perfect package for you!… Expand"}, {"name": "Samurai Jack: Battle Through Time", "details_link": "https://www.metacritic.com/game/playstation-4/samurai-jack-battle-through-time", "publisher": "Adult Swim", "release_date": "Aug 21 2020", "developers": ["Soleil", "Soleil Ltd."], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/7bc4809a9c7aee9a44deac6d8fb26af1-98.jpg", "descriptions": "Become Samurai Jack, the greatest warrior of the past, present and future. Journey through time to finally stop Aku’s evil reign in this new adventure told by the creators of Samurai Jack. Encounter your favorite characters from the show including The Scotsman, Scaramouche, Sir Rothchild and more."}, {"name": "City of Brass", "details_link": "https://www.metacritic.com/game/xbox-one/city-of-brass", "publisher": "Uppercut Games Pty Ltd", "release_date": "May  5 2018", "developers": ["Uppercut Games Pty Ltd"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/1/5669b2330e9b14ca3512262717f6af45-98.jpg", "descriptions": "Assume the role of a daring thief in City of Brass, a first-person action adventure from senior BioShock developers. Armed with scimitar and a versatile whip, you’ll lash and slash, bait and trap your way to the heart of an opulent, Arabian Nights-themed metropolis."}, {"name": "Operation Flashpoint: Red River", "details_link": "https://www.metacritic.com/game/pc/operation-flashpoint-red-river", "publisher": "Codemasters", "release_date": "Jun  6 2011", "developers": ["Codemasters"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 67, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/8/e977830a6e9b134277a93e6d1c948df8-98.jpg", "descriptions": "Taking a small step into the future, Red River depicts a fictional conflict with contemporary geopolitical themes, which will unfold over three distinct acts in both single player and drop-in-drop-out co-operative play for up to four players online. Faced with new counter-insurgency combatTaking a small step into the future, Red River depicts a fictional conflict with contemporary geopolitical themes, which will unfold over three distinct acts in both single player and drop-in-drop-out co-operative play for up to four players online. Faced with new counter-insurgency combat and the returning threat of the Chinese PLA, players will feel the tension, brutality and carnage of modern conflict from the perspective of a marine fireteam on deployment in a hostile country, thousands of miles from home.… Expand"}, {"name": "The Sims: Pet Stories", "details_link": "https://www.metacritic.com/game/pc/the-sims-pet-stories", "publisher": "EA Games", "release_date": "Jun 19 2007", "developers": ["Maxis"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 67, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/be564d84c7582d09eca591d7eb88fd22-98.jpg", "descriptions": "Train, play, and care for your cats and dogs, and count on many unexpected twists and turns in this easy-to-play, laptop-friendly version of The Sims. The Sims Pet Stories features two great ways to play. In the new and engaging directed Story mode, you take on a variety of challenges as youTrain, play, and care for your cats and dogs, and count on many unexpected twists and turns in this easy-to-play, laptop-friendly version of The Sims. The Sims Pet Stories features two great ways to play. In the new and engaging directed Story mode, you take on a variety of challenges as you compete for 1st place in a local pet show and learn to tame a variety of pet personalities. You even unlock rewards along the way as you achieve set goals. In open-ended Classic mode, you create your Sims and their pets, design their homes, and teach your pets tricks. You decide how their stories unfold. [Electronic Arts]… Expand"}, {"name": "Freestyle MetalX", "details_link": "https://www.metacritic.com/game/xbox/freestyle-metalx", "publisher": "Midway", "release_date": "Sep 14 2003", "developers": ["Deibus Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/04983d9e454a2e68b144d0a576d071ca-98.jpg", "descriptions": "Freestyle Metal X unleashes anarchy with the freedom to do what you want, when you want. Break windows, run over people, ride where you normally can't ride--and get away with it. With a variety of stunt combinations, Freestyle Metal X encourages you to push the envelope with psychotic tricksFreestyle Metal X unleashes anarchy with the freedom to do what you want, when you want. Break windows, run over people, ride where you normally can't ride--and get away with it. With a variety of stunt combinations, Freestyle Metal X encourages you to push the envelope with psychotic tricks in freestyle environments full of challenges and side events. A sizable dose of insanity will help you perform stunts on the tops of buildings, jump over the Vegas Strip, or shoot yourself out  of  a cannon onto the Marina streets. … Expand"}, {"name": "Circus Maximus: Chariot Wars", "details_link": "https://www.metacritic.com/game/xbox/circus-maximus-chariot-wars", "publisher": "Encore Software, Inc.", "release_date": "Feb 24 2002", "developers": ["Kodiak Interactive"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Driving", "Demolition Derby"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/c953c42f9d8f3a0c96f3eadf7b64bfe2-98.jpg", "descriptions": "As the FIRST and ONLY game to combine the classic themes of chariot racing and gladiator fighting, Circus Maximus: Chariot Wars brings the raw excitement of survival racing to the majestic coliseums and arenas of the Roman Empire. There is no other game like it!"}, {"name": "Dark Summit", "details_link": "https://www.metacritic.com/game/playstation-2/dark-summit", "publisher": "THQ", "release_date": "Nov 26 2001", "developers": ["Radical Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/97152dce4445a6ae600d89be925b5fcc-98.jpg", "descriptions": "Chief O?Leary has mysteriously closed the summit of Mt. Garrick to all boarders and is trying desperately to drive them away. As the young and rebellious Naya, players will shred, jib and stomp sick tricks in the first ever mission-based snowboarding game. Free ride this vast mountain andChief O?Leary has mysteriously closed the summit of Mt. Garrick to all boarders and is trying desperately to drive them away. As the young and rebellious Naya, players will shred, jib and stomp sick tricks in the first ever mission-based snowboarding game. Free ride this vast mountain and unlock restricted areas on your way to the summit. But be prepared, Chief O?Leary will not go down without a fight. [THQ]… Expand"}, {"name": "18 Wheeler: American Pro Trucker", "details_link": "https://www.metacritic.com/game/dreamcast/18-wheeler-american-pro-trucker", "publisher": "Sega", "release_date": "May 22 2001", "developers": ["Sega"], "platforms": ["PlayStation 2", "Dreamcast"], "genres": ["Driving", "Racing", "Arcade"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/0483e38e794de10d41ccdac190cbf53a-98.jpg", "descriptions": "Get behind the wheel of a 60-foot-long, 20-ton, 18-wheeled truck and buckle up as you drive in locations from New York to California. 18 Wheeler: American Pro Trucker features arcade-style racing in four gameplay modes: arcade, parking, score attack, and versus. You'll transport cargo andGet behind the wheel of a 60-foot-long, 20-ton, 18-wheeled truck and buckle up as you drive in locations from New York to California. 18 Wheeler: American Pro Trucker features arcade-style racing in four gameplay modes: arcade, parking, score attack, and versus. You'll transport cargo and race against other truck drivers--all while protecting your rig from damage. In versus mode, you can take on a friend in split-screen action on four different raceways.… Expand"}, {"name": "In Cold Blood", "details_link": "https://www.metacritic.com/game/pc/in-cold-blood", "publisher": "DreamCatcher Interactive", "release_date": "Mar 25 2001", "developers": ["Revolution Software"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/2a5ca36ec7c4543480f4fb0d63a67546-98.jpg", "descriptions": "Travel the world controlling M16 Secret British Secret Service agent John Cord in this Spy action action adventure."}, {"name": "RayCrisis: Series Termination", "details_link": "https://www.metacritic.com/game/playstation/raycrisis-series-termination", "publisher": "Working Designs", "release_date": "Oct 25 2000", "developers": ["Taito Corporation"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "An ambitious and unethical scientist, a secret experiment gone horribly awry, and an artificially intelligent supercomputer gone mad; all the necessary ingredients for the imminent extinction of mankind. You are humanity's last hope, a hotshot pilot given the unenviable task of flying anAn ambitious and unethical scientist, a secret experiment gone horribly awry, and an artificially intelligent supercomputer gone mad; all the necessary ingredients for the imminent extinction of mankind. You are humanity's last hope, a hotshot pilot given the unenviable task of flying an experimental fighter into the dark heart of the Con-Human Network. Seize the controls of three Wave Rider spacecraft, each equippped with the WR-01 primary weapon array, WR-02 secondary lock-on laser system, and WR-03 single-use weapon for emergency situations. RayCrisis: Series Termination is the final entry in Taito's acclaimed trilogy of shooters, and it bombards your CRT with an abundance of fourth-generation optical stimulation: multilevel scrolling, transparency and lighting effects, and enough polygons to overload your cerebral cortex. Dodge, weave, and blast through two play modes, disintegrating wave after wave of relentless bogeys, to achieve high scores and unlock hidden bonuses. Prepare your senses, reinforce your nerves, and limber your trigger finger - the final assault has begun!… Expand"}, {"name": "Last Stop", "details_link": "https://www.metacritic.com/game/switch/last-stop", "publisher": "Annapurna Interactive", "release_date": "Jul 22 2021", "developers": ["Variable State"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/946200f874aa3a980875d275bec10733-98.jpg", "descriptions": "An adventure set in present day London, where you play as three separate characters whose worlds collide in the midst of a supernatural crisis.\r Last Stop is a single-player third-person adventure set in present day London.  \r\nWritten and developed by Variable State, creators of theAn adventure set in present day London, where you play as three separate characters whose worlds collide in the midst of a supernatural crisis.\r Last Stop is a single-player third-person adventure set in present day London.  \rWritten and developed by Variable State, creators of the award-winning Virginia, Last Stop tells three interconnected tales featuring three playable main characters. \r\rDonna, a spaced-out high-schooler who feels trapped by her stifling home life and her overprotective big sister. Away from home, Donna seeks teenage thrills with her friends Becky and Vivek, but gets more than she bargained for when the trio become unexpected kidnappers in a game of amateur detective gone wrong. \r John, an overworked middle-aged single dad. Burdened with debt and the pressures of being an only parent, John jealously pines after the free and easy life of his twenty-something bachelor neighbour, Jack. When the pair unwittingly fall foul of a vengeful stranger, a cursed artefact threatens to transform their lives forever. \r Meena, a ruthlessly ambitious professional who struggles to find the same satisfaction with her family that she does in the thrill of her work. As Meena vies with an upstart colleague for a crucial promotion, something ancient stirs in the basement beneath her workplace. \r\rLast Stop is fully voice acted, featuring hours of dialogue and a voice cast of dozens, with performances from some of the brightest talent in the UK today, including rising stars Lulu Simpson as Molly Smith and Kassian Akhtar as Dylan Hughes. \r\rLast Stop features an original soundtrack by BAFTA award winning composer Lyndon Holland, performed by the Prague Philharmonic Orchestra. \r\rRoleplay as 3 unique characters. Make choices to shape their conversations. Walk in their shoes and discover where their individual stories lead. … Expand"}, {"name": "A-Train: All Aboard! Tourism", "details_link": "https://www.metacritic.com/game/switch/a-train-all-aboard!-tourism", "publisher": "Artdink", "release_date": "Mar 12 2021", "developers": ["Artdink"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Management", "Vehicle", "Train", "Business / Tycoon"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/3ae5da7d4cfad4fa76c95f0fc64b3cb0-98.jpg", "descriptions": "All aboard! Tourism is a one-way ticket to urban planning. A-Train, the classic urban development simulation game that allows you to create the city of your dreams, is now available on the Nintendo Switch. Become the president of your very own railroad company, laying tracks and running yourAll aboard! Tourism is a one-way ticket to urban planning. A-Train, the classic urban development simulation game that allows you to create the city of your dreams, is now available on the Nintendo Switch. Become the president of your very own railroad company, laying tracks and running your trains as you see fit. However, you will be responsible for more than the railroad. You'll also be tasked with managing subsidiaries, playing the stock market, and participating in urban planning, in order to develop and expand your town.\r This latest installment in the A-Train series introduces the element of tourism to the urban planning formula, and focuses on building up towns into bustling tourism capitals. Providing realistic business management simulations of financing, investing, and more, as well as a wide variety of customizable options for all your vehicles, A-Train: All Aboard! Tourism is packed full of features for you to explore. But don't be overwhelmed—players old and new alike will be able to jump right into the series thanks to the fun and practical tutorials provided in the early stages.\r So why not hop aboard the A-Train with your trusted team of advisors, and start crafting a bright future for your town?\r… Expand"}, {"name": "Interrogation: You will be deceived", "details_link": "https://www.metacritic.com/game/pc/interrogation-you-will-be-deceived", "publisher": "Mixtvision", "release_date": "Dec  5 2019", "developers": ["Critique Gaming"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 67, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/cf3cf7b00ade49e90403d23378a7d1c4-98.jpg", "descriptions": "As a police detective tasked with bringing down a dangerous terrorist group, you fight on two fronts: interrogating suspects & managing your team and its reputation. With time running out, how far will you go to stop these criminals? Manipulation, threats or even torture? Does the endAs a police detective tasked with bringing down a dangerous terrorist group, you fight on two fronts: interrogating suspects & managing your team and its reputation. With time running out, how far will you go to stop these criminals? Manipulation, threats or even torture? Does the end justify the means?\r… Expand"}, {"name": "LEGRAND LEGACY: Tale of the Fatebounds", "details_link": "https://www.metacritic.com/game/switch/legrand-legacy-tale-of-the-fatebounds", "publisher": "Another Indie", "release_date": "Jan 24 2019", "developers": ["Another Indie"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 67, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/5c6f52465344190958bf9a2937697d9e-98.jpg", "descriptions": "A tactical turn-based RPG that takes you on a journey through Legrand, a chaotic world that's torn apart by civil war and threatened by an otherworldly invasion. You play as Finn, the reluctant leader of a band of unlikely heroes, who soon discovers that the true peril to their universe liesA tactical turn-based RPG that takes you on a journey through Legrand, a chaotic world that's torn apart by civil war and threatened by an otherworldly invasion. You play as Finn, the reluctant leader of a band of unlikely heroes, who soon discovers that the true peril to their universe lies within themselves.… Expand"}, {"name": "Onimusha: Warlords", "details_link": "https://www.metacritic.com/game/pc/onimusha-warlords", "publisher": "Capcom", "release_date": "Jan 15 2019", "developers": ["Capcom"], "platforms": ["PlayStation 2", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/6f75f143e28f9e84f8586e6155ff23fd-98.jpg", "descriptions": "As power-hungry warlords battle one another for control of feudal Japan, a young princess is kidnapped. Now, one lone swordsman, Samanosuke, boldly volunteers to rescue and avenge her. An entire legion of demon warriors stands between you and the princess, so you'll need all your weapons andAs power-hungry warlords battle one another for control of feudal Japan, a young princess is kidnapped. Now, one lone swordsman, Samanosuke, boldly volunteers to rescue and avenge her. An entire legion of demon warriors stands between you and the princess, so you'll need all your weapons and magic to break through. The world of Onimusha: Warlords comes alive with waterfalls, wind effects, insects, and weather, but in order to triumph, you must stay focused on your mission.… Expand"}, {"name": "CrossworDS", "details_link": "https://www.metacritic.com/game/ds/crosswords", "publisher": "Nintendo", "release_date": "May  5 2008", "developers": ["Nuevo Retro Games"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Logic", "General"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/39528f6b526845f565c9ddd400c6b417-98.jpg", "descriptions": "[Also known as \"Nintendo Presents: Crossword Collection\" in the UK/EU\"] Choose from more than a thousand crossword puzzles or hone your word skills with Wordsearch or Anagrams. No matter which type of puzzle you choose, you can easily save your progress at any time and return later to[Also known as \"Nintendo Presents: Crossword Collection\" in the UK/EU\"] Choose from more than a thousand crossword puzzles or hone your word skills with Wordsearch or Anagrams. No matter which type of puzzle you choose, you can easily save your progress at any time and return later to finish. Crosswords DS is designed for all players—just select your difficulty level and start off with a basic four-by-four puzzle. As you progress, the game will increase in difficulty and puzzle size. Use the DS stylus like a pencil to write or circle your answers on the touch-control screen. Erasing mistakes is as simple as writing the new answer over the old one. A hint system is also included in case you need some friendly assistance. In Crosswords DS, you'll find puzzles perfect for everyone regardless of age or experience. Exercise your word skills in more than a thousand touch-control word puzzles to challenge every skill level. [Nintendo]… Expand"}, {"name": "MVP Baseball", "details_link": "https://www.metacritic.com/game/psp/mvp-baseball", "publisher": "Electronic Arts", "release_date": "May 18 2005", "developers": ["EA Canada"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/b46c1c1ee4528a6da4b69e9bb1f0c312-98.jpg", "descriptions": "Dominate from Wire to Wire: Take your team all the way from opening day to the World Series in Season mode. Wireless Head-to-Head Gameplay: Challenge friends sitting next to you or across the room to an Exhibition Game, Homerun Shootout, or Pitcher Showdown. Party Play: Four players canDominate from Wire to Wire: Take your team all the way from opening day to the World Series in Season mode. Wireless Head-to-Head Gameplay: Challenge friends sitting next to you or across the room to an Exhibition Game, Homerun Shootout, or Pitcher Showdown. Party Play: Four players can compete in Batting and Pitching mini-games using one PSP unit. EA Pocket Trax: This new feature designed for PSP allows you to listen and watch music content via this built in player. [Electronic Arts]… Expand"}, {"name": "Disintegration", "details_link": "https://www.metacritic.com/game/xbox-one/disintegration", "publisher": "Private Division", "release_date": "Jun 16 2020", "developers": ["V1 Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/f1a9ca92566492774961dde369995cf0-98.jpg", "descriptions": "Dive into an action-drived first-person shooter, set in near-future sci-fi universe created by V1 Interactive, a newly-assembled studio of industry veterans. Journey into a vision of tomorrow where humankind is on the brink of extinction and has turned to technology in the hope of survival.Dive into an action-drived first-person shooter, set in near-future sci-fi universe created by V1 Interactive, a newly-assembled studio of industry veterans. Journey into a vision of tomorrow where humankind is on the brink of extinction and has turned to technology in the hope of survival. Using a process known as Integration, human minds are surgically implanted into robotic armatures creating a new form of sentient life. As a domineering enemy superpower known as the Rayonne emerges, take on the role of Romer Shoal, an expert Gravcycle pilot. Astride your heavily-modified craft (fitted with an armoured chassis and a powerful array of weapons), lead a small resistance force in the fight to save what remains of humanity.\r… Expand"}, {"name": "Shape of the World", "details_link": "https://www.metacritic.com/game/switch/shape-of-the-world", "publisher": "Hollow Tree Games", "release_date": "Jun  6 2018", "developers": ["Seaven Studio", "Hollow Tree Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/326ec6ec9670126aac2948de97aa1f85-98.jpg", "descriptions": "A first-person exploration game that grows around you. Without your presence, will the forest still come alive?"}, {"name": "Rocketbirds 2: Evolution", "details_link": "https://www.metacritic.com/game/playstation-4/rocketbirds-2-evolution", "publisher": "Ratloop Asia Pte Ltd", "release_date": "Apr 26 2016", "developers": ["Ratloop Asia Pte Ltd"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/3df6d3f93b8660609eeea4e6986d7d93-98.jpg", "descriptions": "iL Putzki, that dastardly Penguin despot, is still alive - and the evil totalitarian Penguin regime seems stronger than ever! What's up with that? Uncover the sinister plot as Hardboiled Chicken, the Original Coq of War, and put an end to it, once and for all - in the full, single playeriL Putzki, that dastardly Penguin despot, is still alive - and the evil totalitarian Penguin regime seems stronger than ever! What's up with that? Uncover the sinister plot as Hardboiled Chicken, the Original Coq of War, and put an end to it, once and for all - in the full, single player story campaign. After the fall of Albatropolis, General Puff and the Budgie Commandos have set up residence in the old hotel and are getting themselves organized. Assemble a strike force of great magnitude and go on rescue missions behind enemy lines in the game's 1 - 4 player Rescue Mode. Leave no bird behind.… Expand"}, {"name": "Death end re;Quest 2", "details_link": "https://www.metacritic.com/game/switch/death-end-request-2", "publisher": "Idea Factory", "release_date": "Feb  8 2022", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/07a64d0a0a12d3d8ea916028eb6147f7-98.jpg", "descriptions": "Mai Toyama seeks an escape from her traumatic past. She enrolls at Wordsworth, an all-girl's dormitory situated in the small, mountainous town known as Le Choara where it was rumored that her sister, Sanae, was last seen. Hopeful, Mai seeks to find her kin, but she soon finds terrifyingMai Toyama seeks an escape from her traumatic past. She enrolls at Wordsworth, an all-girl's dormitory situated in the small, mountainous town known as Le Choara where it was rumored that her sister, Sanae, was last seen. Hopeful, Mai seeks to find her kin, but she soon finds terrifying inhabitants which lurk throughout the town after dark. At night, Le Choara's streets are filled with Shadow Matter -- a horrific group of menacing creatures. Around every cobblestone corner, Mai discovers that her hope of finding her sister lies beneath the long-buried secrets which haunt Le Choara.… Expand"}, {"name": "Agatha Christie: The ABC Murders", "details_link": "https://www.metacritic.com/game/playstation-4/agatha-christie-the-abc-murders", "publisher": "Microids", "release_date": "Feb 23 2016", "developers": ["Microids", "Artefacts Studio"], "platforms": ["iPhone/iPad", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 67, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/58323f99ec9e8a95a0dca7ac260b9be4-98.jpg", "descriptions": "The ABC Murders is an adventure and investigation game adapted from the classic Agatha Christie novel. Assume the role of the famous private detective Hercule Poirot and, once again, you find yourself up against a mysterious serial killer who goes by the name of \"ABC\"."}, {"name": "Roogoo: Twisted Towers", "details_link": "https://www.metacritic.com/game/wii/roogoo-twisted-towers", "publisher": "SouthPeak Games", "release_date": "Jun 30 2009", "developers": ["SpiderMonk"], "platforms": "Wii", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/5c7daebf278bdb2dc6a87d2c0dd0782d-98.jpg", "descriptions": "Players help the Roogoo by guiding colorful meteors through rotating platforms in an effort to stop the evil Meemoos from draining their planets energy. Utilizing unique, motion-sensitive Wii controls, players rotate platforms, capture pieces and stop the evil Meemoos in entirely new ways.Players help the Roogoo by guiding colorful meteors through rotating platforms in an effort to stop the evil Meemoos from draining their planets energy. Utilizing unique, motion-sensitive Wii controls, players rotate platforms, capture pieces and stop the evil Meemoos in entirely new ways. Interactive backgrounds and new gameplay twists builds upon the addicting action found in the original. Up to four players can play in new modes that feature adversarial, cooperative and party play. [SouthPeak Games]… Expand"}, {"name": "Major League Baseball 2K8", "details_link": "https://www.metacritic.com/game/playstation-3/major-league-baseball-2k8", "publisher": "2K Sports", "release_date": "Mar  3 2008", "developers": ["Kush Games"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 67, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/c2492186e6282756cb090b178b40c73e-98.jpg", "descriptions": "Although he is best known for his speed and base-stealing ability, the Mets' Jose Reyes is also one of the most well-rounded players in the game and is the first player in baseball history to have more than 63 steals, 120 runs, 192 hits, and 19 homers in a single season. Reyes led the MajorAlthough he is best known for his speed and base-stealing ability, the Mets' Jose Reyes is also one of the most well-rounded players in the game and is the first player in baseball history to have more than 63 steals, 120 runs, 192 hits, and 19 homers in a single season. Reyes led the Major League in 2006 with 17 triples and 64 stolen bases and set a new Mets club record with 104 hits at Shea Stadium. Also an avid video gamer and long time fan of 2K Sports’ products, All-Star Shortstop Jose Reyes is a natural fit as the official spokesperson for this year's edition of the critically acclaimed Major League Baseball 2K series. [2K Sports]… Expand"}, {"name": "Midway Arcade Treasures 3", "details_link": "https://www.metacritic.com/game/playstation-2/midway-arcade-treasures-3", "publisher": "Midway", "release_date": "Sep 27 2005", "developers": ["Digital Eclipse"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/6c63e4920f031fcc789810206125b6d5-98.jpg", "descriptions": "Midway Arcade Treasures 3 features eight classic arcade racing games including: Badlands, Hydro Thunder, Off Road Thunder: Mud, Sweat 'N Gears, Race Drivin', San Francisco Rush The Rock: Alcatraz Edition, San Francisco Rush 2049, S.T.U.N. Runner and Super Off Road & Bonus Tracks Pack. [Midway]"}, {"name": "Turok", "details_link": "https://www.metacritic.com/game/playstation-3/turok", "publisher": "Touchstone", "release_date": "Feb  5 2008", "developers": ["Propaganda Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 67, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/52c3c33a3ff508ab9ef9081a2c11f134-98.jpg", "descriptions": "Turok is an epic, story-driven FPS game set on a dark, mysterious planet in the near future. Players take on the role of Joseph Turok, a former Black Ops commando, now part of an elite Special Forces squad on a mission to take down a war criminal on a genetically-altered planet. After theTurok is an epic, story-driven FPS game set on a dark, mysterious planet in the near future. Players take on the role of Joseph Turok, a former Black Ops commando, now part of an elite Special Forces squad on a mission to take down a war criminal on a genetically-altered planet. After the ship is shot down while approaching the planet, Joseph Turok must use his instincts and elite military training to elude an army of well-trained soldiers, and the ravenous, unpredictable creatures that populate the dangerous environment. Joseph Turok’s mission? Survive at all costs. [Touchstone]… Expand"}, {"name": "Giga Wrecker Alt.", "details_link": "https://www.metacritic.com/game/switch/giga-wrecker-alt", "publisher": "Rising Star Games", "release_date": "Apr 12 2019", "developers": ["Game Freak"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/1/f1f32b9ace5543be2d270d716402b269-98.jpg", "descriptions": "In the near future, where Earth has been ravaged by robot invaders, the fate of the planet rests of the shoulders of a young girl who becomes more than human. Saved from death and cursed with cybernetic powers beyond comprehension, it's up to Reika Rekkeiji to save humanity from the evilIn the near future, where Earth has been ravaged by robot invaders, the fate of the planet rests of the shoulders of a young girl who becomes more than human. Saved from death and cursed with cybernetic powers beyond comprehension, it's up to Reika Rekkeiji to save humanity from the evil Ajeet in this exciting new game from legendary developer Game Freak. GIGA WRECKER ALT. combines frantic platforming, intense combat and physics-based puzzle challenges into one exciting adventure. By destroying robotic enemies and the world around her, Reika can form the resulting debris into all manner of weapons and tools. Use these to overcome obstacles and solve puzzles, navigate through platform-laiden levels, then take the fight to the robot invaders and save mankind from extinction before it's too late.… Expand"}, {"name": "Prince of Persia: Epilogue", "details_link": "https://www.metacritic.com/game/xbox-360/prince-of-persia-epilogue", "publisher": "Ubisoft", "release_date": "Mar  5 2009", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Platformer", "General", "Fantasy", "3D"], "meta_score": 67, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/e2595ed10c816537e32e0f3c406ec948-98.jpg", "descriptions": "[Xbox Live Downloadable Content]  As the Prince and Elika, chased by unleashed Evil forces, enter the Underground Palace area and play a brand new region in the fantastic universe of Prince of Persia. With an all new powers, fighting skills, and bosses you’re sure to enjoy hours of[Xbox Live Downloadable Content]  As the Prince and Elika, chased by unleashed Evil forces, enter the Underground Palace area and play a brand new region in the fantastic universe of Prince of Persia. With an all new powers, fighting skills, and bosses you’re sure to enjoy hours of additional gameplay and continue the epic saga right from where you left off at the original Prince of Persia. New Region: The Underground Palace - A corrupted underground palace from which the Prince and Elika need to escape in a new epic journey. New Power: Energize - Reconstruct destroyed areas of the environment to create a path and rush through it before it vanishes. New High Pace: The new trap challenge - The Prince and Elika will face more cunning foes, more clever traps and level design, adding more to the difficulty level in over three hours of gameplay. New Attack: Sprinting Clash - A duel move that lets you or the enemy trigger a sprint attack, charging towards each other, clashing your weapons fiercely. New Unlockable Skins:  From the early development of the game, the Prototype characters of the Prince and Elika. [Ubisoft]… Expand"}, {"name": "Runaway: The Dream of the Turtle", "details_link": "https://www.metacritic.com/game/pc/runaway-the-dream-of-the-turtle", "publisher": "cdv Software", "release_date": "Mar 14 2007", "developers": ["Pendulo Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/0e90031df33083190334720e22ed02ae-98.jpg", "descriptions": "The adventure is made up of 6 main chapters. Players can explore more than 100 different places in all four corners of the globe: Alaska, Hawaii, underwater or in the sky, in the heart of the jungle or on board a huge yacht. There are tons of different colourful places, marvellous backdropsThe adventure is made up of 6 main chapters. Players can explore more than 100 different places in all four corners of the globe: Alaska, Hawaii, underwater or in the sky, in the heart of the jungle or on board a huge yacht. There are tons of different colourful places, marvellous backdrops for an unforgettable adventure. Pendulo Studio has concocted a large number of tasty puzzles and scintillating enigmas of advancing difficulty levels for players to solve. But Pendulo Studio has also taken care that nobody will get stuck for too long in certain game passages; difficulty levels in comparison with the first episode remain the same. All players have to do is open their eyes and ears for clues that emerge throughout and deploy the basic level of nous required for all adventure games. [Pendulo Studios]… Expand"}, {"name": "Maglam Lord", "details_link": "https://www.metacritic.com/game/switch/maglam-lord", "publisher": "PQube", "release_date": "Feb  4 2022", "developers": ["Felistella"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/334c75c4a32dd0a851ae4460a1f5d4e5-98.jpg", "descriptions": "The Demon King is an endangered species Magic Sword Creation Action RPG!\n\nThe hero was making a name for himself as the worst demon king. When they wake up from a long sleep, they are designated as an \"endangered species\"!\n\nCraft a magic sword with your friends and fight for a completeThe Demon King is an endangered species Magic Sword Creation Action RPG!The hero was making a name for himself as the worst demon king. When they wake up from a long sleep, they are designated as an \"endangered species\"!Craft a magic sword with your friends and fight for a complete revival!In order to avoid extinction, it is possible to \"concatenate\" with heroes and cooperators ...?An exhilarating action RPG!… Expand"}, {"name": "Olympic Games Tokyo 2020: The Official Video Game", "details_link": "https://www.metacritic.com/game/switch/olympic-games-tokyo-2020-the-official-video-game", "publisher": "Sega", "release_date": "Jun 22 2021", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Athletics"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/b6fc76b943574036899f3d154a547a27-98.jpg", "descriptions": "The Olympic Games are back, and this time it's your chance for glory. Whether you play with friends, family, or go for gold on the global leaderboards, this is a party game that anyone can pick up and enjoy. Prepare to unleash the competitor within as you create your athlete, customize theirThe Olympic Games are back, and this time it's your chance for glory. Whether you play with friends, family, or go for gold on the global leaderboards, this is a party game that anyone can pick up and enjoy. Prepare to unleash the competitor within as you create your athlete, customize their skills and pick the perfect costume. Why settle for standard sportswear when you can take centre stage as a pirate, astronaut or cowboy? Choose between 18 fun-fueled sporting events—from Tennis and Football to the 100m, Basketball and Boxing—there’s always a record to beat and a score to settle.… Expand"}, {"name": "WE ARE FOOTBALL", "details_link": "https://www.metacritic.com/game/pc/we-are-football", "publisher": "THQ Nordic", "release_date": "Jun 10 2021", "developers": ["Winning Streak Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Sports", "Team", "Soccer", "Management"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/7ecbe89a1c3b31859a1055225dd7f78b-98.jpg", "descriptions": "As a manager and trainer in WE ARE FOOTBALL, you'll come face to face with the latest trends in the world of football, experiencing all the emotional highs and lows of your favorite club.For the first time ever, this modern football manager game also offers a women's football game mode,As a manager and trainer in WE ARE FOOTBALL, you'll come face to face with the latest trends in the world of football, experiencing all the emotional highs and lows of your favorite club.For the first time ever, this modern football manager game also offers a women's football game mode, featuring all the same functionality as well as many unique gameplay elements. To maintain and ensure the highest quality across all game modes, WE ARE FOOTBALL has been developed with experienced football management veterans such as Gerald Kohler, Rolf Langenberg, and Dirk Winter.WE ARE FOOTBALL focuses on real management tasks. The goal of the game is to build up the club over the long haul, including growing the team, colleagues, infrastructure, fans, and more. As a result, the football players in the game are individual personalities who spin their own stories.… Expand"}, {"name": "Rise of Incarnates", "details_link": "https://www.metacritic.com/game/pc/rise-of-incarnates", "publisher": "Bandai Namco Games", "release_date": "Jul  1 2015", "developers": ["Bandai Namco Games"], "platforms": "PC", "genres": ["Action", "General"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/555139779c1faba653a01a499e6f17ec-98.jpg", "descriptions": "A free-to-play action game blending fighting and shooting in a 2v2 battle arena. Feel a rush of power as you awaken latent character abilities and string together combos, all while working strategically with your partner to dominate opponents."}, {"name": "Malicious", "details_link": "https://www.metacritic.com/game/playstation-3/malicious", "publisher": "SCEA", "release_date": "Jul 24 2012", "developers": ["Alvion"], "platforms": "PlayStation 3", "genres": ["Action", "General", "General"], "meta_score": 67, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/f44a4856899d3daf2b4ef7289043643e-98.jpg", "descriptions": "Malicious is an original action game for the PS3. You are a \"Spirit Vessel\" called into the world by the Prophets to vanquish evil. Armed with the \"Mantle of Cinders,\" a cloak that can absorb power from destroyed objects as well as shift form, you wage battle with the Malicious. [Playstation EU]"}, {"name": "The Dark Crystal: Age of Resistance Tactics", "details_link": "https://www.metacritic.com/game/pc/the-dark-crystal-age-of-resistance-tactics", "publisher": "En Masse Entertainment", "release_date": "Feb  4 2020", "developers": ["BonusXP"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/fc15bc9d734d2d86d20b3e4dbc06b88c-98.jpg", "descriptions": "Netflix's The Dark Crystal: Age of Resistance comes to life as a thrilling tactical strategy game!In The Dark Crystal: Age of Resistance Tactics, lead the heroic Gelfling to restore light to the world of Thra! Experience everything the fantasy world has to offer by playing throughand goingNetflix's The Dark Crystal: Age of Resistance comes to life as a thrilling tactical strategy game!In The Dark Crystal: Age of Resistance Tactics, lead the heroic Gelfling to restore light to the world of Thra! Experience everything the fantasy world has to offer by playing throughand going beyondthe events of the Netflix series. Encounter never-seen-before playable characters, stories, and environments. Over the course of 80 unique turn-based campaign battles taking place across the lands of Thra, recruit new allies and customize their forces by assigning them jobs and outfitting them with new equipment.Continue the Story in an Expanded World of Thra - Delve deeper into the legend of The Dark Crystal to learn more about the Gelfling clans and their histories across more than 5 diverse, modular territories. Choose from over 15 character jobs, play through reimagined and brand-new battles against the malicious Skeksis and help lead the proud Gelfling to victory.Gelfling Tactics - Devise unique ways for the outmatched Gelfling to fulfill their prophecy in multi-layered, turn-based tactical combat. Units can be customized for specific fights with gear, upgradable abilities and a job system. Use guile, planning and cunning to overcome superior foes!Highly Replayable - Replay finished battles to earn full marks or replay the entire game! Once completed, challenge New Game+ mode, keeping all progress from the first playthrough while facing more difficult versions of battles.Rich, Dynamic Environments - The world of Thra is a living, unpredictable environment as dangerous as it is beautiful. Dynamic events on the battlefield may create opportunities or put the Gelflings at a disadvantage, necessitating rapid changes in strategy.… Expand"}, {"name": "Scanner Sombre", "details_link": "https://www.metacritic.com/game/pc/scanner-sombre", "publisher": "Introversion", "release_date": "Apr 26 2017", "developers": ["Introversion", "Introversion Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/9ce546d6a83521b758afdfca813073a7-98.jpg", "descriptions": "Regaining consciousness you smell the damp. Opening your eyes you see the stone walls of the chamber flickering by the light of the fire; you stumble to your feet and kick a helmet clattering across the floor. Slowly the ache in your head begins to subside and you notice the beginnings of aRegaining consciousness you smell the damp. Opening your eyes you see the stone walls of the chamber flickering by the light of the fire; you stumble to your feet and kick a helmet clattering across the floor. Slowly the ache in your head begins to subside and you notice the beginnings of a passage. After a few steps the darkness consumes you. Returning to the safely of the fire you see a LIDAR scanner on the floor - a trigger press results in a faint glow coming from inside the helmet. You put the helmet on, adjust the beam-width and proceed into the abyss.… Expand"}, {"name": "Pacific Storm", "details_link": "https://www.metacritic.com/game/pc/pacific-storm", "publisher": "cdv Software", "release_date": "Oct  2 2006", "developers": ["Lesta Studio"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 67, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/ca0cba7ff10bf2efb2875e4a71fc81ab-98.jpg", "descriptions": "On December 7, 1941, a major part of the U.S. Pacific navy stationed at Pearl Harbor was assaulted by Japanese planes. Japanese fighters were destroying American aircraft on land and in the air, without giving them a chance for a counterattack. The furious battle of Pearl Harbor became theOn December 7, 1941, a major part of the U.S. Pacific navy stationed at Pearl Harbor was assaulted by Japanese planes. Japanese fighters were destroying American aircraft on land and in the air, without giving them a chance for a counterattack. The furious battle of Pearl Harbor became the first in the sequence of gory sea combats. Now you can take part in all major Pacific battles of the World War II in the Pacific Storm game that is a mixture of RTS, war-game and simulator. All major and important sea battles of World War II, which took place in the Pacific Ocean, are included and you can play either for the USA or Japan.Mine the resources (money, iron and nickel ore, bauxites and oil), train various units and retaliate! Sink'em all! [Buka Entertainment]… Expand"}, {"name": "Supersonic Acrobatic Rocket-Powered Battle-Cars", "details_link": "https://www.metacritic.com/game/playstation-3/supersonic-acrobatic-rocket-powered-battle-cars", "publisher": "Psyonix", "release_date": "Oct  9 2008", "developers": ["Psyonix"], "platforms": "PlayStation 3", "num_players": "1-4 ", "genres": ["Action", "General", "General"], "meta_score": 67, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/3238cfac0aeee20eb759c8c8a7da3d3e-98.jpg", "descriptions": "Get ready for non-stop action as you take control of a rocket-powered super car! It is a sport like no other, where supersonic cars jump, flip, and rocket boost their way to victory. [Sony]"}, {"name": "Touch Detective 2 1/2", "details_link": "https://www.metacritic.com/game/ds/touch-detective-2-12", "publisher": "Atlus", "release_date": "Oct  9 2007", "developers": ["BeeWorks"], "platforms": ["iPhone/iPad", "DS"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/2d0773b7c4ee1e90fda4c477dde6afcb-98.jpg", "descriptions": "Boasting a longer, overarching storyline, more characters and locations to visit, and various game design enhancements, Touch Detective 2½ delivers in every way a sequel should. Fans of the original Touch Detective, fear not: the same humor and quirkiness that made the first adventure soBoasting a longer, overarching storyline, more characters and locations to visit, and various game design enhancements, Touch Detective 2½ delivers in every way a sequel should. Fans of the original Touch Detective, fear not: the same humor and quirkiness that made the first adventure so memorable is back in full force for the sequel. Accepted into the Great Detective Society, Mackenzie has become a fully-accredited sleuth. Trouble is, people still do not take her seriously. All that changes when a string of strange thefts pulls her into a puzzling plot, and she'll have to use all of her skills and intuition to discover the motive behind the crimes and solve the mystery! The new plot develops over the course of 5 interrelated chapters, each playing off the one before. Over twice the locations to visit and all-new characters to compliment the returning cast from the original.Cromwell, Penelope, and even your trusty sidekick Funghi all make a return in Touch Detective 2½, and if you want to get to the bottom of the mystery, you will need their help. More unlockables: Solve side quests and complete an all-new Touch List and Investigation Report to gain access to new music and art. [Atlus USA]… Expand"}, {"name": "TT Isle of Man: Ride On The Edge", "details_link": "https://www.metacritic.com/game/playstation-4/tt-isle-of-man-ride-on-the-edge", "publisher": "Bigben Interactive", "release_date": "Mar  6 2018", "developers": ["Kylotonn", "Maximum Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 67, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/419358a088a334e5e88d5879be261c7e-98.jpg", "descriptions": "For bikers, there are only 2 types of speed races: the Isle of Man TT, and the rest. No other race is as grueling for the motorbikes and demanding for the riders. Assume the challenge of the Snaefell Mountain course: all 37.73 miles faithfully reproduced with the champions and their bikes."}, {"name": "Teenage Mutant Ninja Turtles: Smash-Up", "details_link": "https://www.metacritic.com/game/wii/teenage-mutant-ninja-turtles-smash-up", "publisher": "Ubisoft", "release_date": "Sep 22 2009", "developers": ["Game Arts"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Beat-'Em-Up", "Fighting", "3D", "2D"], "meta_score": 67, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/86ae448c49dbd889e724ef225cc5aa59-98.jpg", "descriptions": "FIGHT AS YOUR FAVORITE TMNT CHARACTERS: Choose from a wide variety of classic TMNT heroes and villains, each with unique acrobatic moves, weapons and combat skills that will come in handy during the free-for-all brawls. SHARE THE FUN: Not only can you immerse yourself in the world of TMNTFIGHT AS YOUR FAVORITE TMNT CHARACTERS: Choose from a wide variety of classic TMNT heroes and villains, each with unique acrobatic moves, weapons and combat skills that will come in handy during the free-for-all brawls. SHARE THE FUN: Not only can you immerse yourself in the world of TMNT through the story mode, you can also challenge your friends at home or online in a variety of multiplayer modes including tournament, battle royal, and more. IT’S A SHELL OF A BRAWL: Packed with over-the-top ninja action and smack-talking gameplay, Smash-Up offers hours of fun for novice players as well as ninja masters. Finding unique combos and unlocking and special attacks add more elements to each character and battle. EXPECT THE UNEXPECTED: Be prepared for interactive levels with moving arenas, gators jumping from the water, and many more surprises. Collect \"shells\" during battles and mini-games to unlock memorable moments and exclusive content of TMNT’s 25-year history. ORIGINAL STORY CREATED WITH PETER LAIRD: The single-player story mode offers a completely original story written by Peter Laird (the co-creator of TMNT). But unlike his previous comic books and movies, this time you get to be a part of the story. [Ubisoft]… Expand"}, {"name": "Faces of War", "details_link": "https://www.metacritic.com/game/pc/faces-of-war", "publisher": "Ubisoft", "release_date": "Sep 12 2006", "developers": ["Best Way"], "platforms": "PC", "num_players": "16  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 67, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/96aa7cb721f44cac939ebf753c485be2-98.jpg", "descriptions": "Faces of War combines real-time strategy with advanced tactics and the ability to control a single unit in battle. This game is being developed by the same team that created the original title, Soldiers: Heroes of World War II. Faces of War immerses players right in the heat of WWII action.Faces of War combines real-time strategy with advanced tactics and the ability to control a single unit in battle. This game is being developed by the same team that created the original title, Soldiers: Heroes of World War II. Faces of War immerses players right in the heat of WWII action. The game includes all the highlights of the original and provides even better physics and unit models, complex team AI and new tactical opportunities. New unit commands such as move to cover and charge position help team survival while new personal moves like climbing over fences and aimed-shots keep individual soldiers fighting. Four new campaigns give players an opportunity to command American, English, Soviet and German troops during world-renowned battles that include D-Day and the storming of Berlin. On top of all that players will also have a chance to fight through new winter missions that give them a whole new experience. Faces of War demonstrates a completely new level of AI that allows players to gain full control of units on one hand and to concentrate on more strategic aspects on the other. AI controlled soldiers don’t simply execute any order given by a player, they think how to do it the most efficient and safe way. From now on all human units in the game possess a new characteristic - morale, which is influenced by many in-game events. [1C Company]… Expand"}, {"name": "Resident Evil Village: Winters' Expansion", "details_link": "https://www.metacritic.com/game/xbox-series-x/resident-evil-village-winters-expansion", "publisher": "Capcom", "release_date": "Oct 28 2022", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X"], "genres": ["Action Adventure", "Survival"], "meta_score": 67, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/3/392b07367d995364fb66183708beecca-98.jpg", "descriptions": "New Content in the Winters' Expansion:- Third Person Mode - Allows you to enjoy the main game from a third-person perspective.\n- The Mercenaries Additional Orders - Adds new playable characters and stages.\n- Shadows of Rose - Introduces a new story with Ethan's daughter Rose as theNew Content in the Winters' Expansion:- Third Person Mode - Allows you to enjoy the main game from a third-person perspective.- The Mercenaries Additional Orders - Adds new playable characters and stages.- Shadows of Rose - Introduces a new story with Ethan's daughter Rose as the protagonist.16 years have passed since that incident... Ethan's beloved daughter, Rosemary Winters, is living a healthy life. But struggling to come to terms with her innate special powers, she decides to dive into the world of the Megamycete's consciousness, or the \"realm of consciousness,\" to seal them.What she discovers is an extraordinary world far from the reality of the past. A collection of memories of \"that village\" absorbed by the Megamycete.… Expand"}, {"name": "Ultra Age", "details_link": "https://www.metacritic.com/game/playstation-4/ultra-age", "publisher": "DANGEN Entertainment", "release_date": "Sep  9 2021", "developers": ["Visual Dart", "Next Stage"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/636bd76b4b39a500f365dd595314e16a-98.jpg", "descriptions": "Change Your Blade, Change Your Destiny. Ultra Age is a high-speed, sword-swinging action game set in the far future that follows the story of young warrior Age, who embarks on a mission to save humankind from extinction. Use your blades to cut through robotic and mutant foes, exploreChange Your Blade, Change Your Destiny. Ultra Age is a high-speed, sword-swinging action game set in the far future that follows the story of young warrior Age, who embarks on a mission to save humankind from extinction. Use your blades to cut through robotic and mutant foes, explore futuristic locales, and unravel a vast conspiracy concerning the fate of the planet. Far in the future, the resources of Earth have become insufficient, its ecosystem long ago changed irrevocably by a passing meteor. Humankind has divided into two: the people who have escaped Earth and relocated to the space colony, 'Orbital Arc,' and the others who have remained on Earth in a facility called ‘The Shelter.’\r Humanity vanished from Earth after civilians from The Shelter failed an experiment that was meant to be the last hope for humanity, while people from Orbital Arc sent expeditions to Earth in search of resources. Failing to find any signs of life, a young sword-wielding warrior named ‘Age’ falls down from orbit to Earth. Accompanied by his floating android, Helvis, he must find the indispensable key to the survival of humankind.\r -Unleash Combos with Blade-Changing Action-\rSlash through foes with a variety of blades in high-speed, stylish action! Change blades on the fly with powerful moves to create linkage and run devastating combos. Different attributes and varied actions call for unique strategy against different types of foes.\r -Narrow Gaps Using the Wire-\rLaunch the wire skill to pull smaller enemies toward you, or Quantum Warp to get instant access to larger foes! Use the wire to strategically overcome numerical inferiority, traverse gaps on land and quickly grab items.\r -Get the Edge with Skills-\rGather elements to enhance your blades, expand your skills, and learn new combos. Install modules and power gear to level up Age and increase your arsenal of blades to take down the toughest of enemies. Use Helvis to burst into Critical Rage, cast Healing Pocket to recover, or Time Shift to loot more items.\r -Experience a Post-Apocalyptic Earth-\rFollow Age on his journey in the year 3174. Experience cutscenes that tell the story of Age’s mission across futuristic mecha, forests and deserts developed with Unreal Engine. Encounter mysterious characters and overcome menacing bosses to uncover the story behind the fate of humankind.… Expand"}, {"name": "Pac-Man: Mega Tunnel Battle", "details_link": "https://www.metacritic.com/game/stadia/pac-man-mega-tunnel-battle", "publisher": "Bandai Namco Games", "release_date": "Nov 17 2020", "developers": ["Bandai Namco Games"], "platforms": "Stadia", "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/122df3d3208340710662678674044c17-98.jpg", "descriptions": "Prove your mettle in the world’s biggest simultaneous multiplayer PAC-MAN experience! Jump into 64-player games and show everyone who's the leader of the PAC! Invade other players' mazes, eat their dots and power ups - even other players! - and dominate the mazes! But watch out: viewers canProve your mettle in the world’s biggest simultaneous multiplayer PAC-MAN experience! Jump into 64-player games and show everyone who's the leader of the PAC! Invade other players' mazes, eat their dots and power ups - even other players! - and dominate the mazes! But watch out: viewers can vote on power-ups that can cause you - or your opponents! - to stumble on the field and be eliminated from battle! Invade, defend, and rack up high scores across a field of 64 interconnected mazes. Take advantage of brand-new power-ups, spy on neighboring boards, and much more! Spectator interactivity means even viewers are part of all the thrilling action! And customize your PAC-MAN and your home maze with fun skins to show off unique looks!… Expand"}, {"name": "V-Rally 4", "details_link": "https://www.metacritic.com/game/xbox-one/v-rally-4", "publisher": "Bigben Interactive", "release_date": "Sep 11 2018", "developers": ["Kylotonn"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 67, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/c17534fa58b29bb2a4f63eb0cead7a75-98.jpg", "descriptions": "Enjoy an extreme off-road racing experience while becoming an expert in a demanding simulation. Take on the challenges of rallies, rallycross, drifts, buggies and hill climbs, and set off on a spectacular journey across every continent."}]