[{"name": "Rainbow Islands Revolution", "details_link": "https://www.metacritic.com/game/ds/rainbow-islands-revolution", "publisher": "Codemasters", "release_date": "Oct  3 2006", "developers": ["Marvelous Entertainment"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/f2f968b4058beeb073a68b1f85adc6be-98.jpg", "descriptions": "(Also known as \"New Rainbow Islands\")  Rainbow Islands Revolution is an update of a Rainbow Islands, the sequel to Bubble Bobble, taking the form of a platform game where the player must ascend through vertical levels that are slowly sinking into the ocean. The objective of the source(Also known as \"New Rainbow Islands\")  Rainbow Islands Revolution is an update of a Rainbow Islands, the sequel to Bubble Bobble, taking the form of a platform game where the player must ascend through vertical levels that are slowly sinking into the ocean. The objective of the source material is to reach the top of each level, taking out any enemies in the way by firing magical rainbows that can trap or eliminate foes as well as providing bridges for the player to walk on. Rainbows remain onscreen for a short amount of time but can be ?broken? by the player if they jump on them. Once broken, the rainbow will fall off the screen, taking out the first enemy it touches. The game also features a pleasing bonus item system where dispatched enemies leave behind items of food that have varying point values and power-ups that have a range of helpful effects. The major feature of this re-interpretation is shifting the entire game away from traditional controls by implementing a global touchscreen control system which radically alters the way in which the game plays. The game is also displayed across both screens of the DS. Rather than being fired by a button press, rainbows are now drawn directly onto the gameplay area using the stylus and movement is executed by dragging the player?s character around the levels. The objective is still to reach the top of the level, but the time limit has been extended to account for the player being unable to move and use rainbows simultaneously. Rainbows are now broken by pressing the stylus onto them. [Atari]… Expand"}, {"name": "Smashbox Arena", "details_link": "https://www.metacritic.com/game/playstation-4/smashbox-arena", "publisher": "BigBox VR, Inc.", "release_date": "Jul 25 2017", "developers": ["BigBox VR", "Inc.", "BigBox VR"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 54, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/b56eb1bbbead27b1d9f072e0816919ba-98.jpg", "descriptions": "An action-packed multiplayer VR game, Smashbox Arena throws players into a shootout battle of team versus team, power-up versus power-up. Combatants can play single-player, party up with their friends, or face off against opponents across the globe."}, {"name": "Rise of Nightmares", "details_link": "https://www.metacritic.com/game/xbox-360/rise-of-nightmares", "publisher": "Sega", "release_date": "Sep  6 2011", "developers": ["Sega"], "platforms": "Xbox 360", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 54, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/0b734878969131effe87ad7b48ddfffc-98.jpg", "descriptions": "Rise of Nightmares offers a spine-tingling horror experience which uses the innovative new controls of Kinect to give players new encounters filled with fearful anticipation and terror. Using their whole body the player will experience fear and tension as never before in this first personRise of Nightmares offers a spine-tingling horror experience which uses the innovative new controls of Kinect to give players new encounters filled with fearful anticipation and terror. Using their whole body the player will experience fear and tension as never before in this first person horror adventure. … Expand"}, {"name": "Kingdom Come: Deliverance - From The Ashes", "details_link": "https://www.metacritic.com/game/pc/kingdom-come-deliverance---from-the-ashes", "publisher": "Deep Silver", "release_date": "Jul  5 2018", "developers": ["Warhorse Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 54, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/4b212d38dd5d2f8bc9cba1c0e6be2805-98.jpg", "descriptions": "The first DLC for Kingdom Come: Deliverance introduces an entirely new type of adventure! You have an opportunity to participate in building a new village from the ground up and experience first-hand what it was like to create a new settlement. As a newly appointed bailiff, you must decideThe first DLC for Kingdom Come: Deliverance introduces an entirely new type of adventure! You have an opportunity to participate in building a new village from the ground up and experience first-hand what it was like to create a new settlement. As a newly appointed bailiff, you must decide what buildings to erect and what people to bring in, and you must also settle disputes between the villagers. Each building is unique and comes with its own upgrades, material and labour requirements, so you will face some difficult decisions. A bailiff's lot is not an easy one, but he can still enjoy some fun after a hard day's work. Get yourself one of the new horses available and take it for a ride, throw a few dice against seasoned players in your new local tavern, match your skills against variously skilled opponents in your combat arena or just rest at home in your own comfortably furnished house. … Expand"}, {"name": "The Da Vinci Code", "details_link": "https://www.metacritic.com/game/playstation-2/the-da-vinci-code", "publisher": "2K Games", "release_date": "May 15 2006", "developers": ["Double Helix Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 54, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/d7462ca87fca07ec3ffbb5429e102f3e-98.jpg", "descriptions": "Guide Robert Langdon and Sophie Neveu on their quest to solve a bizarre murder-mystery and uncover the ultimate treasure protected by an ancient secret society. Expands upon \"The Da Vinci Code\" universe by giving the player new experiences and locations not visited in the book or the film.Guide Robert Langdon and Sophie Neveu on their quest to solve a bizarre murder-mystery and uncover the ultimate treasure protected by an ancient secret society. Expands upon \"The Da Vinci Code\" universe by giving the player new experiences and locations not visited in the book or the film. Combines a unique blend of stealth, frantic chases and combat, diversely cryptic puzzles, and exploration. Explore detailed environments and discover hidden clues in world famous locations such as The Louvre, Westminster Abbey, St. Sulpice and more. Players must solve a wide variety of challenging physical and intellectual puzzles that will ultimately lead them to the resting ground of the Holy Grail.… Expand"}, {"name": "Frogger: Ancient Shadow", "details_link": "https://www.metacritic.com/game/gamecube/frogger-ancient-shadow", "publisher": "Konami", "release_date": "Sep 27 2005", "developers": ["Hudson Soft"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 54, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/54a50fe702e8c65e1dd17abce8bfb4af-98.jpg", "descriptions": "Frogger is Back to His Classic Beginnings. His home of Firefly Swamp is being overrun by Dr. Wani and his evil plans. Join Frogger in his latest adventure as he explores seven different worlds and tries to restore order to his beloved swamp. Features classic, addictive \"hop andFrogger is Back to His Classic Beginnings. His home of Firefly Swamp is being overrun by Dr. Wani and his evil plans. Join Frogger in his latest adventure as he explores seven different worlds and tries to restore order to his beloved swamp. Features classic, addictive \"hop and dodge\" gameplay. Mini games with up to 4 players on all platforms. Over 30 levels of play. Wide range of character moves, such as the double jump, tongue grab, and more. Special bonus - orignial 1981 Frogger arcade game included on all platforms.… Expand"}, {"name": "Carmageddon: Reincarnation", "details_link": "https://www.metacritic.com/game/pc/carmageddon-reincarnation", "publisher": "Stainless Games", "release_date": "May 21 2015", "developers": ["Stainless Games"], "platforms": "PC", "genres": ["Driving", "Car Combat", "Car Combat", "Simulation", "Vehicle", "Combat"], "meta_score": 54, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/8ffcd60edcd274028393e998337eb8ad-98.jpg", "descriptions": "Play a bunch of game modes against the new improved AI opponents, or online against the rest of the Carmafan masses, such as they are. Progress your Career through the Carma ranks or have a MultiPlayer romp in a Car Crusher, Fox 'n' Hounds, Death Race or Checkpoint Stampede event,Play a bunch of game modes against the new improved AI opponents, or online against the rest of the Carmafan masses, such as they are. Progress your Career through the Carma ranks or have a MultiPlayer romp in a Car Crusher, Fox 'n' Hounds, Death Race or Checkpoint Stampede event, characterized by Carmageddon’s trademark over-the-top violence, crazy PowerUps and laughs.… Expand"}, {"name": "Virtual-On Marz", "details_link": "https://www.metacritic.com/game/playstation-2/virtual-on-marz", "publisher": "Sega", "release_date": "Oct 14 2003", "developers": ["Hitmaker"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/ff63100f269958848a8e8e625c4ed39a-98.jpg", "descriptions": "Corporate crime has plunged the Planet Mars into an explosive war zone overrun with towering mech warriors known as Virtuaroids. As a member of the MARZ Special Investigation Unit, you'll pilot your war machine into the heart of intense battles unleashing a hail of grenades, air mines,Corporate crime has plunged the Planet Mars into an explosive war zone overrun with towering mech warriors known as Virtuaroids. As a member of the MARZ Special Investigation Unit, you'll pilot your war machine into the heart of intense battles unleashing a hail of grenades, air mines, lasers, and missiles on the aggressive enemies. These enormous sword and mace-wielding robots stand 49-feet tall and are surprisingly fast. Headquarters will constantly update your position with information and warnings as you stalk and defeat enemy Virtuaroids and gigantic bosses throughout your missions. You'll also be called upon to attack enemy locations and convoys, defend allied bases and convoys, and fight alongside other Virtuaroids in battle. Ultimately, you must restore peace on the planet by discovering the true identity of the mysterious forces that have infiltrated Mars. Good luck! [Sega]… Expand"}, {"name": "The Great Escape (2003)", "details_link": "https://www.metacritic.com/game/pc/the-great-escape-2003", "publisher": "Gotham Games", "release_date": "Jul 22 2003", "developers": ["Pivotal Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Shooter", "General", "Modern", "Third-Person", "Historic"], "meta_score": 54, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/3a4b2526308de4fc8b7c32f256a202f2-98.jpg", "descriptions": "The Nazis have constructed the highest-security prisoner of war camp in history. As the Allies' top escape artist you must command your squad of POWs to break through the walls and wreak havoc on the soft underbelly of the Reich. You will command four unique soldiers, each with their ownThe Nazis have constructed the highest-security prisoner of war camp in history. As the Allies' top escape artist you must command your squad of POWs to break through the walls and wreak havoc on the soft underbelly of the Reich. You will command four unique soldiers, each with their own skills, strengths, and stories through their capture, escape, and vengeance in the heart of the evil Nazi empire. Use advanced espionage skills in stealth missions, a wide variety of weapons in combat sorties, and a huge array of authentic vehicles in your fight for freedom. Superstar Steve McQueen is digitally resurrected for the fistfights, shootouts, and vehicular mayhem of this WWII classic. You are the new mastermind in this saga of indomitable spirit and daring heroism, can you pull off The Great Escape? [Gotham Games]… Expand"}, {"name": "Gauntlet Dark Legacy", "details_link": "https://www.metacritic.com/game/xbox/gauntlet-dark-legacy", "publisher": "Midway", "release_date": "Apr 15 2002", "developers": ["Midway"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 54, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/51b6425327e1da28833f9142f7b8b95c-98.jpg", "descriptions": "Gauntlet's hack-and-slash gameplay continues in Gauntlet: Dark Legacy. You and up to three of your friends must work as a team through eight dangerous worlds. As one of eight different characters, you'll vanquish creatures, evade traps, and search for treasure. Character-based power attacks,Gauntlet's hack-and-slash gameplay continues in Gauntlet: Dark Legacy. You and up to three of your friends must work as a team through eight dangerous worlds. As one of eight different characters, you'll vanquish creatures, evade traps, and search for treasure. Character-based power attacks, magic potions, new power-ups, and combination moves add to the mayhem. The game save system allows players to transfer evolving characters from their own machine to a friend's to take on the dungeon together.… Expand"}, {"name": "Werewolf: The Apocalypse - Earthblood", "details_link": "https://www.metacritic.com/game/playstation-5/werewolf-the-apocalypse---earthblood", "publisher": "Nacon", "release_date": "Feb  4 2021", "developers": ["Cyanide"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 54, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/c013b43c3707cba014bcb81ec8e1d5fb-98.jpg", "descriptions": "A unique experience full of savage combat and mystical adventures, inspired by the famous role-playing game. You are Cahal, a powerful Garou who chose to go into exile after losing control of his destructive rage. On his quest for redemption and blood, Cahal plays a crucial role in the greatA unique experience full of savage combat and mystical adventures, inspired by the famous role-playing game. You are Cahal, a powerful Garou who chose to go into exile after losing control of his destructive rage. On his quest for redemption and blood, Cahal plays a crucial role in the great war between the Garous and Endron, a powerful oil company that serves the Wyrm, whose destruction is ravaging the planet.\rHe can transform into a wolf and a Crinos, a huge ferocious beast. Each form has its advantages: the wolf can sneak around undetected, Cahal as a human can interact with other people, and the Werewolf can unleash its rage to tear enemies apart.… Expand"}, {"name": "Jagged Alliance: Rage!", "details_link": "https://www.metacritic.com/game/playstation-4/jagged-alliance-rage!", "publisher": "HandyGames", "release_date": "Dec  6 2018", "developers": ["HandyGames"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 54, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/6/3aeb9269e6e4c8dfd4e132bff1307c1a-98.jpg", "descriptions": "Jagged Alliance returns with a new take on turn-based tactics, adventure elements and the well-known quirky mercenaries. Set 20 years after the first Jagged Alliance, this spin-off lets you experience a road trip into a jungle hell to test your mind and body to the limits. This time it’sJagged Alliance returns with a new take on turn-based tactics, adventure elements and the well-known quirky mercenaries. Set 20 years after the first Jagged Alliance, this spin-off lets you experience a road trip into a jungle hell to test your mind and body to the limits. This time it’s just you and a few allies versus an entire island ruled by a drug overlord and his crazed army. Do you have what it takes to rise to old glory?… Expand"}, {"name": "Dakar 18", "details_link": "https://www.metacritic.com/game/xbox-one/dakar-18", "publisher": "Deep Silver", "release_date": "Sep 25 2018", "developers": ["Bigmoon Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/70c3f220976756da21b04b9d615a09bb-98.jpg", "descriptions": "Dakar 18 is a simulation of the world-famous annual rally raid organized by Amaury Sport Organisation (A.S.O.) in South America, and features visuals and many vehicles including motorcycles, cars, trucks, quads and SxS."}, {"name": "Temple of Yog", "details_link": "https://www.metacritic.com/game/wii-u/temple-of-yog", "publisher": "CHUDCHUD INDUSTRIES", "release_date": "Dec 16 2015", "developers": ["CHUDCHUD INDUSTRIES"], "platforms": "Wii U", "genres": ["Action", "General"], "meta_score": 54, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/7982f691124eb0d37d0378b3144528ae-98.jpg", "descriptions": "A mysterious temple and a developing village have an ancient pact: a life for progress. Tributes are offered, but none survive: sacrifice guaranteed. TEMPLE OF YOG is a roguelike adventure through procedurally generated dungeons that span two screens. Brave the dangerous depths of the TempleA mysterious temple and a developing village have an ancient pact: a life for progress. Tributes are offered, but none survive: sacrifice guaranteed. TEMPLE OF YOG is a roguelike adventure through procedurally generated dungeons that span two screens. Brave the dangerous depths of the Temple for the sake of progress.… Expand"}, {"name": "The Golden Horde", "details_link": "https://www.metacritic.com/game/pc/the-golden-horde", "publisher": "DreamCatcher Interactive", "release_date": "Jul 15 2008", "developers": ["WorldForge"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 54, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/a1b7d606754d47290d6e65fd3bf61f3e-98.jpg", "descriptions": "Lead armored crusaders, flexible Mongolians or impregnable Russians into historic battles! The Scenario is based on a on the events which took place in Europe, central Asia and Russia at the beginning of the XIII century. The game will offer recreated versions of famous battles and politicalLead armored crusaders, flexible Mongolians or impregnable Russians into historic battles! The Scenario is based on a on the events which took place in Europe, central Asia and Russia at the beginning of the XIII century. The game will offer recreated versions of famous battles and political crises as well as an epic campaign which outcome is yours to determine. Thanks to sophisticated RPG elements, individual Heroes, fancy graphics and easy controls The Golden Horde offers a perfect access to the real-time strategy genre in the exotic setting of the early middle ages in Europe and Asia. [JoWood Productions]… Expand"}, {"name": "Star Trek: Conquest", "details_link": "https://www.metacritic.com/game/playstation-2/star-trek-conquest", "publisher": "Bethesda Softworks", "release_date": "Nov 20 2007", "developers": ["4J Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Sci-Fi"], "meta_score": 54, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/b015bb5aecf172c7384350e34531a9fe-98.jpg", "descriptions": "Star Trek: Conquest is a single-player game of galactic conquest featuring a blend of strategy and action set in The Next Generation era. Players take control of Federation, Klingon, Romulan, Cardassian, Dominion, and Breen forces and lead them in a campaign to control the galaxy, one planetStar Trek: Conquest is a single-player game of galactic conquest featuring a blend of strategy and action set in The Next Generation era. Players take control of Federation, Klingon, Romulan, Cardassian, Dominion, and Breen forces and lead them in a campaign to control the galaxy, one planet at a time. Players must build and manage their growing empires in turn-based strategy, and then engage in all out starship combat in real-time action. Strategically, players must effectively manage their limited resources to expand their empire. Players can decide how to best achieve objectives by managing fleets, admirals, building support structures, researching technology and engaging enemies in combat. Once battle is initiated, the game switches to a ship level tactical view allowing players to take direct command of their ships and engage in real-time combat. Strategy game set in The Next Generation era - Planets held by Next Generation era races are set in a large galactic map, where turn-based strategy allows you to build and expand your empire. Real-time Starship combat - Take direct control of any ship and experience intense action as you engage in real-time combat. Resource Management - Wise spending on starbases, factories, research facilities, and starships determines success. Six Playable Races - Choose to command the Federation, Klingon, Romulan, Cardassian, Dominion, or Breen race, each with their own unique set of strengths and weaknesses. [Bethesda Softworks]… Expand"}, {"name": "Legendary Eleven", "details_link": "https://www.metacritic.com/game/switch/legendary-eleven", "publisher": "Eclipse Games", "release_date": "Jun  8 2018", "developers": ["Eclipse Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Team", "Soccer", "Arcade"], "meta_score": 54, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/4d01953c876d203c1026ed0268da4cc7-98.jpg", "descriptions": null}, {"name": "Avatar: The Last Airbender - The Burning Earth", "details_link": "https://www.metacritic.com/game/xbox-360/avatar-the-last-airbender---the-burning-earth", "publisher": "THQ", "release_date": "Nov 19 2007", "developers": ["THQ"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 54, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/d173f72c18dc8d3d14dd2c33546215fd-98.jpg", "descriptions": "Avatar: The Burning Earth continues the epic adventure of Aang and his courageous battle to restore balance to his war-torn world. Join him and his friends Katara, Toph, and Sokka as they master their skills and fight their way to defend the greatest Earth Kingdom city against a Fire NationAvatar: The Burning Earth continues the epic adventure of Aang and his courageous battle to restore balance to his war-torn world. Join him and his friends Katara, Toph, and Sokka as they master their skills and fight their way to defend the greatest Earth Kingdom city against a Fire Nation invasion! [THQ]… Expand"}, {"name": "X-Blades", "details_link": "https://www.metacritic.com/game/pc/x-blades", "publisher": "SouthPeak Games", "release_date": "Feb  9 2009", "developers": ["Gaijin Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 54, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/0499d16cef18b2b8b717efbc7223746a-98.jpg", "descriptions": "In the game, players control an anime-style heroine that destroys anything in her path using guns, blades, magic, and a healthy dose of cinematic flair. X-Blades features a special combination of cinematic style, beautiful animation, and relentless, high speed gameplay. Players assume theIn the game, players control an anime-style heroine that destroys anything in her path using guns, blades, magic, and a healthy dose of cinematic flair. X-Blades features a special combination of cinematic style, beautiful animation, and relentless, high speed gameplay. Players assume the role of Ayumi, a stunningly seductive yet tenacious heroine who battles enemies with her pistol blades, acrobatic ability, and magic spells. With full anime cut scenes, the story unfolds revealing demonic powers and spectacular landscapes, all ripe for exploration and battles. [SouthPeak Interactive]… Expand"}, {"name": "FaceBreaker", "details_link": "https://www.metacritic.com/game/xbox-360/facebreaker", "publisher": "EA Sports", "release_date": "Sep  5 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 54, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/1afc7d87478eccb2b234aaf2b07ef397-98.jpg", "descriptions": "Created by the same team that developed Fight Night Round 3, FaceBreaker offers irreverent fun, immersive gameplay and eye-popping stylized graphics. In this in-your-face, arcade world full of ego-wielding characters, each boxer comes to life with unique attributes and distinct personalCreated by the same team that developed Fight Night Round 3, FaceBreaker offers irreverent fun, immersive gameplay and eye-popping stylized graphics. In this in-your-face, arcade world full of ego-wielding characters, each boxer comes to life with unique attributes and distinct personal style, including Romeo, a Latin lover known for his pelvic thrusts, and Molotov, an oversized Russian demolitions expert with a penchant for fighting dirty. Add a little personal motivation to your fight by uploading a photo of your face to create a realistic likeness using Photo Game Face, and go toe-to-toe with a real-life friend or foe. Laugh out loud as you pummel your opponent with a barrage of blows to the face and watch in satisfaction as your progress is illustrated by real-time facial deformation. With haymakers, face shots and body blows, wait for the right moment to drop a super punch to make your presence known. Taunt your adversaries and flaunt your talent, by tying one hand behind your back to add ultimate humiliation to your bout. In FaceBreaker, it just feels good to rearrange your opponent's face. [Electronic Arts]… Expand"}, {"name": "Dragon Ball: The Breakers", "details_link": "https://www.metacritic.com/game/playstation-5/dragon-ball-the-breakers", "publisher": "Bandai Namco Games", "release_date": "Oct 14 2022", "developers": ["Dimps Corporation"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action Adventure", "General"], "meta_score": 54, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/e8982f53b1c13659d4302212b60efdbb-98.jpg", "descriptions": "Caught out by an unexpected temporal phenomenon, seven ordinary citizens find themselves stranded in a Temporal Seam; they share their imprisonment with a Raider, a menacing enemy from another timeline with overwhelming power.Their only hope for survival is to break out of the TemporalCaught out by an unexpected temporal phenomenon, seven ordinary citizens find themselves stranded in a Temporal Seam; they share their imprisonment with a Raider, a menacing enemy from another timeline with overwhelming power.Their only hope for survival is to break out of the Temporal Seam with the Super Time Machine but the Raider is on their backs and getting stronger minute-by-minute.DRAGON BALL: THE BREAKERS is a 1-on-7 online asymmetrical action game in which a band of seven everyday humans tries to survive the Raider (a classic DRAGON BALL rival such as Cell and Frieza) who will hunt and evolve into an unstoppable force.… Expand"}, {"name": "Rush Bros", "details_link": "https://www.metacritic.com/game/pc/rush-bros", "publisher": "XYLA Entertainment", "release_date": "Jan 29 2013", "developers": ["XYLA Entertainment"], "platforms": "PC", "num_players": "2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 54, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/dbd964b5e9751a6588ebb30192ad8732-98.jpg", "descriptions": "Rush Bros. is a unique platforming game which uses your MP3 collection as an integral part of the overall experience. Your music directly influence how the levels move, look, and feel. The entire world revolves around your music."}, {"name": "Ninja Reflex", "details_link": "https://www.metacritic.com/game/ds/ninja-reflex", "publisher": "Electronic Arts", "release_date": "Mar  4 2008", "developers": ["Sanzaru Games"], "platforms": ["PC", "DS"], "genres": ["Action", "General", "General"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/21bfcbda5254893fb095dde8b16dac63-98.jpg", "descriptions": "Ninja Reflex uses a series of martial arts challenges to test gamers' reflexes and measure their reaction times with millisecond precision.  As players develop their ninja skills, they will strive to earn a black belt from their own personal Sensei.  Players can also compete for ninjaNinja Reflex uses a series of martial arts challenges to test gamers' reflexes and measure their reaction times with millisecond precision.  As players develop their ninja skills, they will strive to earn a black belt from their own personal Sensei.  Players can also compete for ninja supremacy against their friends in fierce multiplayer battles with up to four players. [Electronic Arts]… Expand"}, {"name": "Hyperdimension Neptunia PP: Producing Perfection", "details_link": "https://www.metacritic.com/game/playstation-vita/hyperdimension-neptunia-pp-producing-perfection", "publisher": "NIS America", "release_date": "Jun  3 2014", "developers": ["Tamsoft"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "Miscellaneous", "Rhythm", "Virtual", "Music", "Music", "Career"], "meta_score": 54, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/fee3c4a208767ea8ab6046aa7185c1f9-98.jpg", "descriptions": "The player takes on the role of the main character, who happens to fall into Gamindustri and is immediately hired by one of the four CPUs-Neptune, Noire, Blanc, and Vert-to be their producer and manage their idol careers. Get your training wheels on, ladies, because a new producer is in townThe player takes on the role of the main character, who happens to fall into Gamindustri and is immediately hired by one of the four CPUs-Neptune, Noire, Blanc, and Vert-to be their producer and manage their idol careers. Get your training wheels on, ladies, because a new producer is in town and the fate of Gamindustri hangs in the balance! Will you be able to properly raise these CPUs into idols, or will their citizens be stolen away from them by the popular idol group MOB-48!? Teach these girls to sing, dance, and properly promote themselves to the general populace thanks in part to your expertise in training video game idols back on Earth. As the girls' popularity rises, they will be able to join one another in singing duets, or maybe even come together for a full ensemble!… Expand"}, {"name": "Transformers: The Game", "details_link": "https://www.metacritic.com/game/playstation-3/transformers-the-game", "publisher": "Activision", "release_date": "Jun 26 2007", "developers": ["Traveller's Tales"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 54, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/7fd59a35143fd9e855c233fa06335cb4-98.jpg", "descriptions": "Based on the 2007 live-action feature film, Transformers: The Game lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in DisguiseBased on the 2007 live-action feature film, Transformers: The Game lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in Disguise such as BumbleBee, Barricade and others. As the Transformers robot's war comes to Earth, gamers make the choice to join the Autobots in protecting our planet or to join the Decepticons in destroying it. With dual campaigns, the fate of the world is in players' hands. Instantly change from a larger than life robot to a high-powered vehicle such as a sports car, fighter jet or helicopter. Players crush, topple and wreck every object, including buildings and vehicles, in their path or use the objects as weapons. An unprecedented line-up lets gamers experience the massive scale, unique abilities and sheer strength of an army of characters from the Transformers universe when they choose to play as Optimus Prime, Megatron, Ironhide, Starscream, BumbleBee and more. For head-to-head battles, fans engage in melee combat that reflects each Transformers robot's character, scale, weight and power along with melee weapons and special moves unique to each character. The game's ranged combat offers a wide array of projective weapons designed to take out enemies from afar. [Activision]… Expand"}, {"name": "Dead to Rights: Reckoning", "details_link": "https://www.metacritic.com/game/psp/dead-to-rights-reckoning", "publisher": "Namco", "release_date": "Jun 28 2005", "developers": ["Rebellion"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 54, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/d079eebde7ace3f1f7715281aa596ce4-98.jpg", "descriptions": "Dead to Rights: Reckoning returns to crime-infested Grant City, as an important informant is kidnapped on the eve of the investigation of a major crime lord. Anticipating the worst if the crime boss is not brought to justice, Jack Slate and his K-9 companion Shadow thrust themselves intoDead to Rights: Reckoning returns to crime-infested Grant City, as an important informant is kidnapped on the eve of the investigation of a major crime lord. Anticipating the worst if the crime boss is not brought to justice, Jack Slate and his K-9 companion Shadow thrust themselves into hostile gang territory to save the informant and bring peace to the City. Dead to Rights: Reckoning expands upon the blistering action of the series with a robust ranged and melee fighting system that allows Jack to spit lead and bust heads with ease, and an all-new selection of weapons and lethal disarms. Players will also have unprecedented control of Shadow, utilizing him to watch Jack's back and unleash savage canine fury on lowlife thugs. For the first time in the series Dead to Rights: Reckoning allows players to go head to head through wireless multiplayer death matches, adding hours of replay value to an already extensive single player campaign. [Namco]… Expand"}, {"name": "Cloudpunk", "details_link": "https://www.metacritic.com/game/switch/cloudpunk", "publisher": "Merge Games", "release_date": "Oct 15 2020", "developers": ["ION LANDS"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "Vehicle", "Open-World", "Civilian"], "meta_score": 54, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/3/e3c3854962fd33970e5e1ef0bf2ae2fa-98.jpg", "descriptions": "Your name is Rania. This is your first night working for Cloudpunk, the semi-legal delivery company based in the sprawling city of Nivalis. You go everywhere, from the Marrow below to the spires that pierce the grey clouds high above before scraping the edge of the troposphere. No deliveryYour name is Rania. This is your first night working for Cloudpunk, the semi-legal delivery company based in the sprawling city of Nivalis. You go everywhere, from the Marrow below to the spires that pierce the grey clouds high above before scraping the edge of the troposphere. No delivery job is too dangerous, and no one is faster than a Cloudpunk driver.In this story-based exploration game, you will meet a diverse range of characters including androids, AI and unscrupulous humans at every level of society. Everyone has a story, and in the course of one night in Nivalis, everything will change.… Expand"}, {"name": "The Padre", "details_link": "https://www.metacritic.com/game/switch/the-padre", "publisher": "Feardemic", "release_date": "Apr 18 2019", "developers": ["Shotgun with Glitters"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/ce080bfe850447c4f80d0395fb3daa39-98.jpg", "descriptions": "Unravel the mystery of a missing cardinal by solving the riddle of a demonic power you did not expect to come upon. Face your inner demons and fight the power of evil while it seduces your soul. Play as the wittiest, pop-culture referencing priest in video game history and face an ultimateUnravel the mystery of a missing cardinal by solving the riddle of a demonic power you did not expect to come upon. Face your inner demons and fight the power of evil while it seduces your soul. Play as the wittiest, pop-culture referencing priest in video game history and face an ultimate game over, if you make the angels cry you a river.… Expand"}, {"name": "Pirates of the Caribbean: At World's End", "details_link": "https://www.metacritic.com/game/playstation-2/pirates-of-the-caribbean-at-worlds-end", "publisher": "Disney Interactive Studios", "release_date": "May 22 2007", "developers": ["Eurocom Entertainment Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Historic"], "meta_score": 54, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/84718598cf111c3afa079aa7774c99b7-98.jpg", "descriptions": "At World's End video games from Disney Interactive Studios invite players to \"live and die by the sword\" as they venture to the worlds of the films and beyond while playing as Captain Jack Sparrow, Will Turner and Elizabeth Swann. [Disney Interactive Studios]"}, {"name": "Strike Force Bowling", "details_link": "https://www.metacritic.com/game/xbox/strike-force-bowling", "publisher": "Crave", "release_date": "May 10 2004", "developers": ["Lab Rats Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Bowling"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/2e3d2874d4faa2fe94ea44ec81734153-98.jpg", "descriptions": "Forget renting bowling shoes--you can enjoy the fun of competitive bowling in the comfort of your own home. Strike Force Bowling brings the game to you with authentic real- time physics and an arcade-style control. Pins never quite fall the same way twice, and bowling balls react accordingForget renting bowling shoes--you can enjoy the fun of competitive bowling in the comfort of your own home. Strike Force Bowling brings the game to you with authentic real- time physics and an arcade-style control. Pins never quite fall the same way twice, and bowling balls react according to a combination of spin, material, and lane friction. From the Sphinx in ancient Egypt to a tropical island pier, you can play in a variety of exotic locations with up to four players.… Expand"}, {"name": "Disney's Lilo & Stitch", "details_link": "https://www.metacritic.com/game/playstation/disneys-lilo-stitch", "publisher": "SCEA", "release_date": "Jun 14 2002", "developers": ["Blitz Games"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/d721ce63fda3d77543a2015d902bf7fe-98.jpg", "descriptions": "While Lilo & Stitch was clearly designed as one for the kiddies, they likely will not be able to surmount its technical limitations."}, {"name": "Real Pool", "details_link": "https://www.metacritic.com/game/playstation-2/real-pool", "publisher": "Infogrames", "release_date": "Nov  6 2000", "developers": ["Takara"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Parlor", "Billiards"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/0e83b7656e7889e9254efd60b37d2e5d-98.jpg", "descriptions": "Real Pool offers most of the same elements as Q-Ball Billiards Master, but it goes about it in a bare-bones way."}, {"name": "Blades of Time", "details_link": "https://www.metacritic.com/game/playstation-3/blades-of-time", "publisher": "Konami", "release_date": "Mar  6 2012", "developers": ["Gaijin Entertainment"], "platforms": ["PC", "Switch", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 53, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/9e8f4ceb59b838073bb878a7ea657609-98.jpg", "descriptions": "In Blades of Time, players don the persona of the gorgeous gunsword-wielding treasure hunter, Ayumi. Blessed with beauty and a trigger happy finger, she's on a mission to find lost bounties in a mysterious and dangerous island. Quickly, she learns this island isn't just trees, berries andIn Blades of Time, players don the persona of the gorgeous gunsword-wielding treasure hunter, Ayumi. Blessed with beauty and a trigger happy finger, she's on a mission to find lost bounties in a mysterious and dangerous island. Quickly, she learns this island isn't just trees, berries and gold – but something more sinister lies beneath the surface. As the wonderment of the island becomes to reveal itself, she learns this land can gift her powers man can only dream of, but also she's not alone on this island! Thank goodness she brought her own weapons. Ayumi then proceeds to battle against menacing villains on the island by destroying them and everything in her path while looking to acquire magical powers that only the strongest warrior can possess.… Expand"}, {"name": "Where the Wild Things Are", "details_link": "https://www.metacritic.com/game/playstation-3/where-the-wild-things-are", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 13 2009", "developers": ["Griptonite Games"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 53, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/24c2283ca8a1e2ffa3e7c39a9b3e2ba9-98.jpg", "descriptions": "Playing as the mischievous Max, players explore the Wild Things' mysterious island, journeying over dangerous terrain, battling fierce creatures and interacting with the fearsome but loveable Wild Things. Through your adventure, you'll befriend and team up with the Wild Things - each withPlaying as the mischievous Max, players explore the Wild Things' mysterious island, journeying over dangerous terrain, battling fierce creatures and interacting with the fearsome but loveable Wild Things. Through your adventure, you'll befriend and team up with the Wild Things - each with their own unique skills or special talents - learning valuable new abilities, working together to solve action puzzles, overcoming obstacles and have a rumpus of a good time! Following a unique storyline inspired by Where the Wild Things Are, the game take players on a journey beyond the movie to explore the mysterious island of the Wild Things on an adventurey that you'll never forget. Run, jump, climb and swing your way across the island's dangerous terrain while battling fierce creatures with your trusty scepter. Collect a variety of special items and \"power-ups\" to gain new abilities and overcome obstacles. On your journey you'll team up with the fearsome but loveable Wild Things discovering their unique personalities and abilities. At any time return to the Wild Things Village to play through a variety of mini games, start dirt-clog fights and have a rumpus good time. Journey across the hostile of the Wild Things filled with fierce creatures and hazardous obstacles around every corner. Go beyond the movie to explore a unique storyline inspired by the book and movie. [Warner Bros.]… Expand"}, {"name": "James Patterson Women's Murder Club: Games of Passion", "details_link": "https://www.metacritic.com/game/ds/james-patterson-womens-murder-club-games-of-passion", "publisher": "THQ", "release_date": "Sep 22 2009", "developers": ["THQ"], "platforms": ["PC", "DS"], "genres": ["Action", "Puzzle", "General", "Hidden Object"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/2467087c9d0858ecbb0e130256d26834-98.jpg", "descriptions": "In Women’s Murder Club: Games of Passion, players step into the investigative shoes of the Women’s Murder Club members, Lindsay, Claire and Cindy, where they investigate a string of seemingly unrelated murders as they unfold. Beautiful women go missing and turn up dead around every corner,In Women’s Murder Club: Games of Passion, players step into the investigative shoes of the Women’s Murder Club members, Lindsay, Claire and Cindy, where they investigate a string of seemingly unrelated murders as they unfold. Beautiful women go missing and turn up dead around every corner, and the clues point to the least likely of suspects. With engrossing, story-driven gameplay and thought-provoking mini-games, Women’s Murder Club: Games of Passion lets players immerse themselves in a classic Patterson mystery as they examine locations for clues, and interrogate witnesses and suspects alike. A distinct mix of hidden object and puzzle gameplay, Women’s Murder Club: Games of Passion lets players become a part of the Women’s Murder Club. Additionally, a unique DSi feature allows fans to create their own mystery by utilizing the DSi camera! [THQ]… Expand"}, {"name": "Bakugan: Champions of Vestroia", "details_link": "https://www.metacritic.com/game/switch/bakugan-champions-of-vestroia", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov  3 2020", "developers": ["WayForward"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 53, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/4/1b78d4c37619c4f6acad2b427f850373-98.jpg", "descriptions": "Bakugan: Champions of Vestroia is an all-new action role-playing game with an original story that expands on the hit TV series and brings the Bakugan universe to the Nintendo Switch for the very first time. The adventure takes players on the ultimate Bakugan journey as they befriend powerfulBakugan: Champions of Vestroia is an all-new action role-playing game with an original story that expands on the hit TV series and brings the Bakugan universe to the Nintendo Switch for the very first time. The adventure takes players on the ultimate Bakugan journey as they befriend powerful creatures known as Bakugan, gear up and customize Bakugan teams for fiercely strategic battles, and master their skills to become the Champion of Vestroia. Players can also play online in head-to-head multiplayer.… Expand"}, {"name": "Scene It? Bright Lights! Big Screen!", "details_link": "https://www.metacritic.com/game/playstation-3/scene-it-bright-lights!-big-screen!", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 17 2009", "developers": ["Artificial Mind and Movement"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 53, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/b6ca410f6fd9e0f398383cc62d82adeb-98.jpg", "descriptions": "Scene It? Bright Lights! Big Screen! allows players to battle it out in a quiz containing movie trivia from the past four decades."}, {"name": "Red Goddess: Inner World", "details_link": "https://www.metacritic.com/game/pc/red-goddess-inner-world", "publisher": "Yanim Studio", "release_date": "Sep  1 2015", "developers": ["Yanim Studio"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Action", "Platformer", "2D"], "meta_score": 53, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/4f352a505a2e32d593b6653de374176a-98.jpg", "descriptions": "Red Goddess is a 2.5D nonlinear side-scroller platformer with combat situations in an adventure to explore the inner-mind of a Young Goddess with the objective of remembering and recovering her own powers.\r -Explore the mind of a young goddess.\r\n-Fight against the dark thoughts and anRed Goddess is a 2.5D nonlinear side-scroller platformer with combat situations in an adventure to explore the inner-mind of a Young Goddess with the objective of remembering and recovering her own powers.\r -Explore the mind of a young goddess.\r-Fight against the dark thoughts and an invisible enemy The Narrator.… Expand"}, {"name": "Sniper Elite: Nazi Zombie Army 2", "details_link": "https://www.metacritic.com/game/pc/sniper-elite-nazi-zombie-army-2", "publisher": "Rebellion", "release_date": "Oct 31 2013", "developers": ["Rebellion"], "platforms": "PC", "genres": ["Shooter", "Historic", "Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 53, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/be35c21683e4473ae49562a3c9774705-98.jpg", "descriptions": "With World War 2 Europe overrun by legions of the undead, you must find mankind’s salvation deep in the twisted bowels of Berlin by securing the sacred artefacts that unleashed this damnation. Every step must be paid in blood as players work together against impossible odds and descendWith World War 2 Europe overrun by legions of the undead, you must find mankind’s salvation deep in the twisted bowels of Berlin by securing the sacred artefacts that unleashed this damnation. Every step must be paid in blood as players work together against impossible odds and descend further into the demon-infested city and the terrifying Führerbunker itself. Tackle the campaign online in co-op for up to four players, or embark on the twisted missions alone if you’ve got the bottle. … Expand"}, {"name": "Planet 51 The Game", "details_link": "https://www.metacritic.com/game/xbox-360/planet-51-the-game", "publisher": "Sega", "release_date": "Nov 17 2009", "developers": ["Pyro Studios"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/01acd5bbbd412f5ff84a91db4ff8cd20-98.jpg", "descriptions": "Planet 51, the white picket-fence world reminiscent of 1950s America is happy, safe and predictable...until the unpredictable happens! Out of the blue, Captain Charles 'Chuck' Baker’s spaceship comes crashing down. Unaware of his surroundings, Chuck begins to realize that he is not alone.Planet 51, the white picket-fence world reminiscent of 1950s America is happy, safe and predictable...until the unpredictable happens! Out of the blue, Captain Charles 'Chuck' Baker’s spaceship comes crashing down. Unaware of his surroundings, Chuck begins to realize that he is not alone. Taking refuge while planning his return home, Chuck meets green-skinned local, Lem, and realizes that he may be the real 'alien' after all! Based on the family animated comedy from the writers of Shrek and Shrek 2. Test your skills in a series of action-filled adventures that are out of this world. Try to outrun and outwit the Planet 51 Police and Army, find Chuck’s spaceship and help Chuck return home to Earth. VEHICLES GALORE: Race and chase as you complete tasks and evade the enemy in an incredible array of hover vehicles, ranging from cars, pick-up trucks and bicycles through to taxis, police cars, heavy trucks and even lawnmowers. MAKE NEW FRIENDS: Take control of the main characters from the movie - suave Astronaut Charles \"Chuck\" Baker and his new alien friend 'Lem' -  utilising their special abilities and skills as you complete each mission. With numerous missions, minigames even multiplayer action you’ll get carried away exploring the world of Planet 51. Players relive memorable movie moments as well as discovering new environments and missions created exclusively for the videogame. [Sega]… Expand"}, {"name": "Assassin's Creed Chronicles: Russia", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-chronicles-russia", "publisher": "Ubisoft", "release_date": "Feb  9 2016", "developers": ["Climax Group", "Climax Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 53, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/f18a26f0a6e947e841e68d397691a040-98.jpg", "descriptions": "Assassin's Creed Chronicles: Russia occurs in Russia, 1918. Nikolai Orelov wants to leave with his family, but he is required to perform one last mission for the Assassin Order: infiltration of the house where the tsar's family is being held by the Bolsheviks and theft of an artifact thatAssassin's Creed Chronicles: Russia occurs in Russia, 1918. Nikolai Orelov wants to leave with his family, but he is required to perform one last mission for the Assassin Order: infiltration of the house where the tsar's family is being held by the Bolsheviks and theft of an artifact that has been fought over by Assassins and Templars for centuries. Along the way, he witnesses the massacre of the tsar's children, but manages to save the princess, Anastasia. He must escape the Templars while protecting the artifact and Anastasia. [Ubisoft]… Expand"}, {"name": "SimAnimals Africa", "details_link": "https://www.metacritic.com/game/wii/simanimals-africa", "publisher": "Electronic Arts", "release_date": "Oct 27 2009", "developers": ["Electronic Arts"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 53, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/bf8af9fb638d3daf07eff850fd202081-98.jpg", "descriptions": "With a playful new art style, SimAnimals Africa allows players to play with wild African animals while they venture across jungles, deserts, savannas, river deltas and more! Each brand new animal has their own unique skill and it’s up to you to find their secret abilities. Kicking zebras,With a playful new art style, SimAnimals Africa allows players to play with wild African animals while they venture across jungles, deserts, savannas, river deltas and more! Each brand new animal has their own unique skill and it’s up to you to find their secret abilities. Kicking zebras, rock-breaking rhinos and crocodiles that excel at hunting will assist players in keeping the environment happy and unlocking new areas, animals, and special items. New mini-games give players more ways to interact with the animals. The ring toss, drumming, and petting games help the animals hone their unique skill and assist players in achieving their goals more quickly. Additionally, there are over 70 rare objects for players to collect including bugs, fruits and flowers. If players feed one of these rare items to an animal they may get an unexpected surprise! Kids can now choose to play as an animal. Will they water the terrain with their trunk as an elephant, kick fruit off trees as a zebra or jump over riverbeds as a gazelle? Players can have fun developing relationships with wild animals and their babies, and experience the humor and drama of life in Africa. [Electronic Arts]… Expand"}, {"name": "Valhalla Knights", "details_link": "https://www.metacritic.com/game/psp/valhalla-knights", "publisher": "XSEED Games", "release_date": "Apr 17 2007", "developers": ["K2 LLC"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 53, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/c76a3358a8210c13d8a4ffe7f63f22f7-98.jpg", "descriptions": "A place that was forgotten by history, where humans, elves, dwarves, halflings and other various races lived together in harmony...it was a paradise, surrounded by deep green forests and crystal clear streams. However, the roar of the demons tore apart their peaceful lives. It was the returnA place that was forgotten by history, where humans, elves, dwarves, halflings and other various races lived together in harmony...it was a paradise, surrounded by deep green forests and crystal clear streams. However, the roar of the demons tore apart their peaceful lives. It was the return of the Dark Lord, the previous ruler of the land, which sparked a new round of battles that would eventually encompass all the races. Customizable characters give each player a unique experience. Select from five races (human, dwarf, halfling, elf, machine) and eight different job classes (Fighter, Mage, Priest, Thief, Knight, Samurai, Ninja, Anchor). Enjoy the vast selection of weapons, armor and accessories which also become visible on the in-game models when equipped. Real-time battles in which the player can switch between controlling any of the six party members on the fly. Complete quests to earn more gold to help recruit new party members or upgrade equipment. Network Play – Team up with other players in two multi-player modes, 2-Player Co-op Mode and 2-Player Versus Mode. All items and gold earned in multi-player can be carried back to the single-player game. [XSEED]… Expand"}, {"name": "Yu-Gi-Oh! The Dawn of Destiny", "details_link": "https://www.metacritic.com/game/xbox/yu-gi-oh!-the-dawn-of-destiny", "publisher": "Konami", "release_date": "Mar 23 2004", "developers": ["KCEJ"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 53, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/f83f4ae79396165192532c9438fe829b-98.jpg", "descriptions": "Marking the debut of the Yu-Gi-Oh franchise on the Xbox, Yu-Gi-Oh! The Dawn of Destiny brings the world of the popular trading card game to Xbox owners.  The game features over 1,000 of the latest Yu-Gi-Oh! cards and seamlessly integrates the Yu-Gi-Oh! trading card gameplay and rules withMarking the debut of the Yu-Gi-Oh franchise on the Xbox, Yu-Gi-Oh! The Dawn of Destiny brings the world of the popular trading card game to Xbox owners.  The game features over 1,000 of the latest Yu-Gi-Oh! cards and seamlessly integrates the Yu-Gi-Oh! trading card gameplay and rules with beautiful 3D monster battles.  The Dawn of Destiny also includes new duel modes such as Link Duel mode and Triple Duel mode, where players' can test their skills against three duelists.… Expand"}, {"name": "NBA ShootOut 2002", "details_link": "https://www.metacritic.com/game/playstation/nba-shootout-2002", "publisher": "SCEA", "release_date": "Sep  1 2001", "developers": ["989 Sports"], "platforms": "PlayStation", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/d9d2dcd42d46e4b00dfc960fab589e7f-98.jpg", "descriptions": "NBA ShootOut 2002 is virtually identical to last year's game."}, {"name": "Aidyn Chronicles: The First Mage", "details_link": "https://www.metacritic.com/game/nintendo-64/aidyn-chronicles-the-first-mage", "publisher": "THQ", "release_date": "Mar 14 2001", "developers": ["H2O Interactive"], "platforms": "Nintendo 64", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 53, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/5f347e53b81623a9ac50a54040e5d3cc-98.jpg", "descriptions": "Young Alaron is on a quest to discover the truth about himself, his name, and his heritage. Traveling to far and distant lands, pursued by forces he cannot understand, danger lurks around every corner. Alaron and his companions will seek to fulfill his destiny as the greatest mage ever known!"}, {"name": "Transformers: The Game", "details_link": "https://www.metacritic.com/game/wii/transformers-the-game", "publisher": "Activision", "release_date": "Jun 26 2007", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 53, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/37bb19e86b54f34d9001a052f01e19f7-98.jpg", "descriptions": "Based on the 2007 live-action feature film, Transformers: The Game lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in DisguiseBased on the 2007 live-action feature film, Transformers: The Game lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in Disguise such as BumbleBee, Barricade and others. As the Transformers robot's war comes to Earth, gamers make the choice to join the Autobots in protecting our planet or to join the Decepticons in destroying it. With dual campaigns, the fate of the world is in players' hands. Instantly change from a larger than life robot to a high-powered vehicle such as a sports car, fighter jet or helicopter. Players crush, topple and wreck every object, including buildings and vehicles, in their path or use the objects as weapons. An unprecedented line-up lets gamers experience the massive scale, unique abilities and sheer strength of an army of characters from the Transformers universe when they choose to play as Optimus Prime, Megatron, Ironhide, Starscream, BumbleBee and more. For head-to-head battles, fans engage in melee combat that reflects each Transformers robot's character, scale, weight and power along with melee weapons and special moves unique to each character. The game's ranged combat offers a wide array of projective weapons designed to take out enemies from afar. [Activision]… Expand"}, {"name": "Curious George", "details_link": "https://www.metacritic.com/game/playstation-2/curious-george", "publisher": "Namco", "release_date": "Feb  1 2006", "developers": ["Monkey Bar Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 53, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/9f5e4600005fd9ffb902027482fb9913-98.jpg", "descriptions": "The Man with the Yellow Hat sets out on a journey to Africa in hopes of finding an artifact exotic enough to save the museum where he works. George, a curious little monkey with an insatiable taste for adventure, follows the Man with the Yellow Hat back to the big city where his spunky andThe Man with the Yellow Hat sets out on a journey to Africa in hopes of finding an artifact exotic enough to save the museum where he works. George, a curious little monkey with an insatiable taste for adventure, follows the Man with the Yellow Hat back to the big city where his spunky and fun-loving nature endears him to new friends he meets along the way and lands him in a series of mis-adventures. Guide George through a variety of adventure-packed levels based on the Universal Pictures and Imagine Entertainment animated feature film, Curious George. Explore, solve puzzles, collect items and above all, be curious! Meet and greet your favorite movie characters, unlock special mini-games and more. Loads of bonus content will keep you playing long after the main quest is solved. [Namco]… Expand"}, {"name": "Active Soccer 2 DX", "details_link": "https://www.metacritic.com/game/xbox-one/active-soccer-2-dx", "publisher": "The Fox Software", "release_date": "Mar 30 2016", "developers": ["The Fox Software"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Action", "Sports", "General", "Team", "Soccer", "Arcade"], "meta_score": 53, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/d880a2d44744ce0c69a6a4a5230a3670-98.jpg", "descriptions": "Active Soccer 2 DX is a top-down arcade football game providing a fast-paced arcade experience, implementing playability and responsive easy-to-learn/hard-to-master controls. With Active Soccer 2 DX you have full control of the game, no scripted goals, no CPU-driven decisions. Active SoccerActive Soccer 2 DX is a top-down arcade football game providing a fast-paced arcade experience, implementing playability and responsive easy-to-learn/hard-to-master controls. With Active Soccer 2 DX you have full control of the game, no scripted goals, no CPU-driven decisions. Active Soccer 2 DX provides a complete career mode, implementing many international leagues, cups and championships. Imagine being the manager of a 5th division English team - you have a budget and your goal is to be promoted to higher divisions, by purchasing players, creating tactics, managing the team and playing real matches. [XBox.com]… Expand"}, {"name": "Disney Pirates of the Caribbean: At World's End", "details_link": "https://www.metacritic.com/game/wii/disney-pirates-of-the-caribbean-at-worlds-end", "publisher": "Disney Interactive Studios", "release_date": "May 22 2007", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-2 ", "genres": ["Action Adventure", "Historic", "Historic", "Linear"], "meta_score": 53, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/8aca5dd11782773136323c53d14fac98-98.jpg", "descriptions": "At World's End video games from Disney Interactive Studios invite players to \"live and die by the sword\" as they venture to the worlds of the films and beyond while playing as Captain Jack Sparrow, Will Turner and Elizabeth Swann. [Disney Interactive Studios]"}, {"name": "Grimshade", "details_link": "https://www.metacritic.com/game/pc/grimshade", "publisher": "TALEROCK", "release_date": "Mar 26 2019", "developers": ["TALEROCK"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 53, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/ba822717f52f5114ab07c4b0537bf8b9-98.jpg", "descriptions": "Grimshade is a party-based role-playing game inspired by JRPG of the 90s, featuring a tactical turn-based combat system and a grim story of war and personal choices."}, {"name": "Oure", "details_link": "https://www.metacritic.com/game/playstation-4/oure", "publisher": "Heavy Spectrum", "release_date": "Oct 30 2017", "developers": ["Heavy Spectrum"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 53, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/809725284c40f127679c3b03950af994-98.jpg", "descriptions": "Take flight in a dream-like cloudscape as you seek to reawaken the relics of a lost civilization. As a unique child born with the powers of the ancient dragons, your parents cast you from the stricken surface into the land above the skies.There you must use the abilities of both your humanTake flight in a dream-like cloudscape as you seek to reawaken the relics of a lost civilization. As a unique child born with the powers of the ancient dragons, your parents cast you from the stricken surface into the land above the skies.There you must use the abilities of both your human and dragon forms to amass magical power, solve strange mysteries and seek out the enigmatic 'Titans' that can revive the world.… Expand"}, {"name": "World Heroes Anthology", "details_link": "https://www.metacritic.com/game/playstation-2/world-heroes-anthology", "publisher": "SNK Playmore", "release_date": "Mar 11 2008", "developers": ["SNK Playmore"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b3e93e2fc12a50586563b8a50380b447-98.jpg", "descriptions": "WORLD HEROES ANTHOLOGY is the complete collection (on one disc) of one of SNK’s most popular 2D fighting game series World Heroes. The titles included are: WORLD HEROES, WORLD HEROES 2, WORLD HEROES JET, and WORLD HEROES PERFECT. The collection contains 56 characters using hand-to-hand andWORLD HEROES ANTHOLOGY is the complete collection (on one disc) of one of SNK’s most popular 2D fighting game series World Heroes. The titles included are: WORLD HEROES, WORLD HEROES 2, WORLD HEROES JET, and WORLD HEROES PERFECT. The collection contains 56 characters using hand-to-hand and weapons based fighting mixed with special super-human abilities enabling each character to perform special attacks. World Heroes Anthology follows the storyline of Dr. Brown, a scientist, who having perfected a time machine has organized a fighting tournament throughout all of history to see who is the best fighter of all time. True to this plot, many of the fighters are based on actual historical figures. [SNK Playmore]… Expand"}, {"name": "In Nightmare", "details_link": "https://www.metacritic.com/game/playstation-5/in-nightmare", "publisher": "Maximum Games", "release_date": "Mar 29 2022", "developers": ["Magicfish Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 53, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/0/a0a2ecc1dcba57e3cd58bdbf791044ef-98.jpg", "descriptions": "Closing his heart to reality, our protagonist falls into a deep slumber and awakens in a nightmarish dreamworld. In Nightmare is a narrative-driven horror adventure game combining sneak action with diverse puzzles. It follows a young boy in search for the last hope of love who is working outClosing his heart to reality, our protagonist falls into a deep slumber and awakens in a nightmarish dreamworld. In Nightmare is a narrative-driven horror adventure game combining sneak action with diverse puzzles. It follows a young boy in search for the last hope of love who is working out his own salvation by navigating through his fear.\r Experiencing effects of a broken family, and the heartache it brings, a young child will escape reality into a dark, whimsical world created from his own memories. This sets him on his journey to uncover what truly lies within. Having suffered in reality, his past trauma turns into terrifying monsters that want to keep him in an eternal nightmare. With the help of his dream spirit, the boy will find ways to sneak past enemies, overcome intricate puzzles, embrace his fear, and uncover the truth so that he may be able to purify the monsters he has created, and finally wake up.\r Will you overcome what you fear or be caught in the nightmare?… Expand"}, {"name": "Foreclosed", "details_link": "https://www.metacritic.com/game/pc/foreclosed", "publisher": "Merge Games", "release_date": "Aug 12 2021", "developers": ["Antab Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 53, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/0/f10926a479b1267c620f56634e97fd9b-98.jpg", "descriptions": "FORECLOSED is a narrative-driven action-shooter set in a Cyberpunk world filled with action, suspense, and experimental augmentations. Follow the story of Evan Kapnos, his identity recently Foreclosed, stripped of his job, his brain implants and his access to the city Block-chain, he mustFORECLOSED is a narrative-driven action-shooter set in a Cyberpunk world filled with action, suspense, and experimental augmentations. Follow the story of Evan Kapnos, his identity recently Foreclosed, stripped of his job, his brain implants and his access to the city Block-chain, he must now escape before his identity and implants are auctioned off.\r An Interactive Graphic Novel and Immersive Narrative\r FORECLOSED combines the playability of video games with the sleek visual aesthetic of comic books. Everything from game-play to cinematics are experienced within the stylistic framework of a graphic novel. Full screen and comic panel perspectives are seamlessly blended as you move throughout FORECLOSED's Cyberpunk city, uncovering a gripping conspiracy story. Cutscenes are also interactive and transition smoothly between alternative game-play styles.\r Firmware Upgrades\r Discover and unlock new abilities with an RPG-like skill system. Upgrade your weapon's potential with futuristic customisations and enhance your brain with implants which provide almost super-human abilities!\r Hi-Tech Combat\r Utilize experimental augmentations, weapons and tech to fight back against your enemies. Modify your Symbiotic Pistol with Explosive Rounds for maximum damage, or, go silent and equip the Stealth Bullets mod. Learn to control your augmentations to fight opponents and manipulate your surroundings. Acquire superhero-like abilities such as telekinesis to launch your enemies into the air or hurl huge objects at groups. Hack into different systems to create traps or even overload the implants in your enemies heads.… Expand"}, {"name": "Planar Conquest", "details_link": "https://www.metacritic.com/game/pc/planar-conquest", "publisher": "Wastelands Interactive", "release_date": "May 30 2016", "developers": ["Wastelands Interactive"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 53, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/799c2c845db4390ea088a8f486bb04e6-98.jpg", "descriptions": "Assume the roll of an all-powerful Sorcerer Lord and lead one of 8 different races to the ultimate victory. Explore multiple planes of existence, raid dungeons, and conquer cities. Expand your armies, cast mighty spells, and summon godly creatures to do your bidding. Fight the enemies in D20Assume the roll of an all-powerful Sorcerer Lord and lead one of 8 different races to the ultimate victory. Explore multiple planes of existence, raid dungeons, and conquer cities. Expand your armies, cast mighty spells, and summon godly creatures to do your bidding. Fight the enemies in D20 OGL battles. … Expand"}, {"name": "Tour de France 2014", "details_link": "https://www.metacritic.com/game/playstation-4/tour-de-france-2014", "publisher": "Focus Home Interactive", "release_date": "Jul 22 2014", "developers": ["Cyanide"], "platforms": ["PlayStation 3", "PlayStation 4"], "genres": ["Sports", "Alternative", "Individual", "Biking"], "meta_score": 53, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/656377c97edfd233bfe920029d599891-98.jpg", "descriptions": "Take control of cyclings greatest champions and compete in all 21 stages of the Tour de France 2014.\r Lead the peloton\r\n\r\nTake to the roads, hills and mountains of the worlds greatest cycling event and guide your favourite rider from the worlds best teams to win the hallowed yellow jersey.Take control of cyclings greatest champions and compete in all 21 stages of the Tour de France 2014.\r Lead the peloton\r Take to the roads, hills and mountains of the worlds greatest cycling event and guide your favourite rider from the worlds best teams to win the hallowed yellow jersey.\r Ride all 21 stages of the 2014 race, including the Grande Depart from the Yorkshire hills in England, all the way to the Champs-Elysees finish line. Issue orders to your team mates as you attack, protect and lead the peloton and use aerodynamics and real-life tactics to make that crucial break in thrilling downhill sections or gruelling mountain climbs.\r -Experience the race as a real professional rider  \r-The most realistic Tour de France experience\r-Take on exciting, team-specific challenges  \r-Multiplayer modes: Co-op and Versus… Expand"}, {"name": "Law & Order: Legacies", "details_link": "https://www.metacritic.com/game/pc/law-order-legacies", "publisher": "Telltale Games", "release_date": "Jan 24 2012", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Miscellaneous", "Adventure", "General", "General"], "meta_score": 53, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/a71fbb805be6c503a575a29953ce3a86-98.jpg", "descriptions": "In Law & Order: Legacies players will take on the roles of both investigator and district attorney as they hit the streets to gather evidence and then enter the court room to prosecute the case. As in every episode of the Law & Order series, choice and morality are key factors andIn Law & Order: Legacies players will take on the roles of both investigator and district attorney as they hit the streets to gather evidence and then enter the court room to prosecute the case. As in every episode of the Law & Order series, choice and morality are key factors and every decision made throughout Law & Order: Legacies will affect the outcome and can lead to multiple endings for each case.… Expand"}, {"name": "Rainbow Islands: Towering Adventure!", "details_link": "https://www.metacritic.com/game/wii/rainbow-islands-towering-adventure!", "publisher": "Square Enix", "release_date": "Jun 15 2009", "developers": ["Taito Corporation"], "platforms": ["Xbox 360", "Wii"], "num_players": "1-2 ", "genres": ["Action", "General", "General"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/4c770ff3c54dbab8cb31eae1efffcac3-98.jpg", "descriptions": "[WiiWare]   In Rainbow Islands: Towering Adventure!, players control the rainbow-magic-wielding Bubby or Bobby as they climb the seven seamless areas of a tower reaching the heavens while defeating enemies with their rainbow powers. Bosses controlled by the scientific genius Dr. Crescent[WiiWare]   In Rainbow Islands: Towering Adventure!, players control the rainbow-magic-wielding Bubby or Bobby as they climb the seven seamless areas of a tower reaching the heavens while defeating enemies with their rainbow powers. Bosses controlled by the scientific genius Dr. Crescent await players at the end of every area. Race through every area within the allotted time to meet the rainbow-colored Holly's Comet. There are three game modes: Story mode, which tells the tale of Holly's Comet; Challenge mode, where players attempt to climb as high as they can; and Time Attack, where players select an area and see how fast they can climb it. Rainbow Islands: Towering Adventure! is an exhilarating action game where you use rainbows to climb into the heavens. [Nintendo]… Expand"}, {"name": "Goat Simulator", "details_link": "https://www.metacritic.com/game/xbox-one/goat-simulator", "publisher": "Coffee Stain Studios", "release_date": "Apr 17 2015", "developers": ["Coffee Stain Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 53, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/7f0f5c4fd41783ad07cbc07d72ee7d1f-98.jpg", "descriptions": "Goat Simulator is the latest in goat simulation technology, bringing next-gen goat simulation to YOU. You no longer have to fantasize about being a goat, your dreams have finally come true."}, {"name": "American Conquest: Divided Nation", "details_link": "https://www.metacritic.com/game/pc/american-conquest-divided-nation", "publisher": "cdv Software", "release_date": "Mar 27 2006", "developers": ["Revolution of Strategy"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Command"], "meta_score": 53, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/bea98442b0f7b5086099e0bdb12399d1-98.jpg", "descriptions": "Divided Nation is the next installment in the American Conquest RTS series. CDV and GSC GameWorld return to offer the player an opportunity to experience the American Civil War and key events immediately prior to and following the conflict that changed the United States. In Divided Nation,Divided Nation is the next installment in the American Conquest RTS series. CDV and GSC GameWorld return to offer the player an opportunity to experience the American Civil War and key events immediately prior to and following the conflict that changed the United States. In Divided Nation, players take on multiple roles in 19th century America, including Civil War General, pirate commander and militia leader in the Texas War of Independence. [CDV]… Expand"}, {"name": "The Witch and the Hundred Knight", "details_link": "https://www.metacritic.com/game/playstation-3/the-witch-and-the-hundred-knight", "publisher": "NIS America", "release_date": "Mar 25 2014", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 4", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 53, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/ab63f05448c9759a17dcfb27b1bdd8df-98.jpg", "descriptions": "Two powerful witches have been battling one another for over a hundred years. Now, the Swamp Witch has unleashed the legendary Dark Knights, and seeks to destroy the Forest Witch once and for all!"}, {"name": "Blok Drop U", "details_link": "https://www.metacritic.com/game/wii-u/blok-drop-u", "publisher": "RCMADIAX", "release_date": "Mar  6 2014", "developers": ["RCMADIAX"], "platforms": ["iPhone/iPad", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Logic"], "meta_score": 53, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/c0a8d2accbcff281835715a4647c6aac-98.jpg", "descriptions": "BLOK DROP U is a simple, yet challenging, physics-based puzzle game exclusively for Wii U. Your goal is to guide the red blok safetly to rest on any of the normal platforms by tapping, and destroying, the grey bloks. A number of different obstacles such as open holes, blades, bounce bloksBLOK DROP U is a simple, yet challenging, physics-based puzzle game exclusively for Wii U. Your goal is to guide the red blok safetly to rest on any of the normal platforms by tapping, and destroying, the grey bloks. A number of different obstacles such as open holes, blades, bounce bloks and more will try to destroy your red blok. Players can pick which set of stages they would like to play, or begin with the basics and continue all the way through to the end.… Expand"}, {"name": "War Times", "details_link": "https://www.metacritic.com/game/pc/war-times", "publisher": "Strategy First", "release_date": "Apr  1 2004", "developers": ["Legend Studios"], "platforms": "PC", "num_players": "1-12 ", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/8b26b4306b2777a98881f42c909b1d52-98.jpg", "descriptions": "These are times of fear. These are times of chaos. These are War Times. Follow the tumultuous era of the Second World War through the actions of Germany, Great Britain, the USA or the USSR; each nation is totally different and uses unique strategies in their attack and defense and all theThese are times of fear. These are times of chaos. These are War Times. Follow the tumultuous era of the Second World War through the actions of Germany, Great Britain, the USA or the USSR; each nation is totally different and uses unique strategies in their attack and defense and all the campaigns are based on real historical events, bringing an unparalleled realism to the fight. Use the impenetrable German offensive squads, complete with the most powerful ground units, weapons and artillery. Conquer special missions with the USA's elite soldiers army and advanced vehicles. Stay on the defensive with Great Britain's unparalleled defensive units and radar detection. Or knock em' dead with the Russians unstoppable firepower on land, air or in the sea. [Strategy First]… Expand"}, {"name": "HSX HyperSonic.Xtreme", "details_link": "https://www.metacritic.com/game/playstation-2/hsx-hypersonicxtreme", "publisher": "Majesco Games", "release_date": "Jan 26 2003", "developers": ["Blade Interactive"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 53, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/c22a89eff8239c8a3f0c6b009690979e-98.jpg", "descriptions": "All out anti-gravity racing at its best. This game is about speed! Stay on the track and come in first place is your mission. Featuring the exclusive Track Editor option where you build your own track then race on it. [Majesco]"}, {"name": "The History Channel: Civil War - A Nation Divided", "details_link": "https://www.metacritic.com/game/xbox-360/the-history-channel-civil-war---a-nation-divided", "publisher": "Activision", "release_date": "Nov 14 2006", "developers": ["Cauldron Ltd."], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 53, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/e033027eff965d80916424dfa26280f1-98.jpg", "descriptions": "The game casts players in the role of a Confederate or Union soldier battling through 12 of the most famous battles in U.S. history.  Each mission is introduced with a documentary video describing the historic moments in a battle, movements of armies, local fights, historical photos andThe game casts players in the role of a Confederate or Union soldier battling through 12 of the most famous battles in U.S. history.  Each mission is introduced with a documentary video describing the historic moments in a battle, movements of armies, local fights, historical photos and battle statistics. Gamers experience the intense conflicts of the Civil War in famous locations like Little Round Top and Lookout Mountain to the diverse landscapes of train yards, saw mills and military forts while using bayonets, sabers, the butt of a gun and even their fists to take down the enemy.  A wide arsenal of rifles, multiple types of grenades, exploding artillery, revolvers, muskets and more are at the soldier's disposal to set charges, place explosives, sabotage enemy lines, destroy buildings and more to complete mission objectives. [Activision]… Expand"}, {"name": "SolSeraph", "details_link": "https://www.metacritic.com/game/playstation-4/solseraph", "publisher": "Sega", "release_date": "Jul 10 2019", "developers": ["ACE Team"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 53, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/1/44479905384009b37c9e257422593015-98.jpg", "descriptions": "Build your cities and set up defensive structures to protect them from the constant threat of monsters. Brought to you by ACE Team, SolSeraph combines action and strategy for a rich gameplay experience reminiscent of the 16-bit era (ActRaiser)."}, {"name": "The Game of Life 2", "details_link": "https://www.metacritic.com/game/switch/the-game-of-life-2", "publisher": "Marmalade Game Studio", "release_date": "Mar 29 2021", "developers": ["Marmalade Game Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/1ec0c454c33154dfb1abb0d89d19c0fe-98.jpg", "descriptions": "Customize your peg, hop in your car and race your friends and family through THE GAME OF LIFE 2 game, a contemporary multiplayer sequel to THE GAME OF LIFE board game.\r Pre-order on Nintendo Switch™ now from 15th March - 29th March (08:59 PT) and get an exclusive FREE additional in-gameCustomize your peg, hop in your car and race your friends and family through THE GAME OF LIFE 2 game, a contemporary multiplayer sequel to THE GAME OF LIFE board game.\r Pre-order on Nintendo Switch™ now from 15th March - 29th March (08:59 PT) and get an exclusive FREE additional in-game outfit for your peg!\r THE GAME OF LIFE 2 is here on Nintendo Switch! This digital board game is an official, contemporary sequel to the classic THE GAME OF LIFE game. It offers more choices and more freedom every stage of the game on a fully animated and immersive 3D board. You’ve got thousands of meaningful ways to live your life before reaching the finish line.\r THE GAME OF LIFE 2 is another one of Marmalade Game Studio’s classic board games for kids and adults alike. … Expand"}, {"name": "Food Network: Cook or Be Cooked", "details_link": "https://www.metacritic.com/game/wii/food-network-cook-or-be-cooked", "publisher": "Namco Bandai Games America", "release_date": "Nov  3 2009", "developers": ["Red Fly Studio"], "platforms": "Wii", "genres": ["Miscellaneous", "General", "General"], "meta_score": 53, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/2340701479688e31aa2bf15bba07b7d1-98.jpg", "descriptions": "With inviting introductory lessons for the novice cook or for \"foodies\" who want to put their gastronomic skills to the test, Food Network: Cook or Be Cooked provides players with the proper instructions and techniques to become a star chef no matter the experience level. Designed inWith inviting introductory lessons for the novice cook or for \"foodies\" who want to put their gastronomic skills to the test, Food Network: Cook or Be Cooked provides players with the proper instructions and techniques to become a star chef no matter the experience level. Designed in collaboration with the chefs of the Food Network Kitchens to ensure authenticity, Food Network: Cook or Be Cooked is a fun and entertaining game that can improve a player's cooking skills with real-world training. Providing an engaging realistic experience, challenges explain not only how to perform tasks, but also why they are executed a specific way.  The Wii Remote and Nunchuk's motion-based controls teach players how to use a wide assortment of kitchen utensils and appliances needed to create numerous delicious Food Network recipes. Having too many cooks in the kitchen is hardly an issue as Food Network Cook or Be Cooked offers multiplayer options where friends and family can cook side-by-side in cooperative mode or face each other in a cook-off with up to two players. Aspiring chefs can also tackle different themed Chef Challenges to unlock new recipes. These events occur in a variety of real-life situations which involve applying the techniques learned to cook an entire meal rather than just one dish. [Namco Bandai Games]… Expand"}, {"name": "Tetris Splash", "details_link": "https://www.metacritic.com/game/xbox-360/tetris-splash", "publisher": "Tetris Online, Inc", "release_date": "Oct  3 2007", "platforms": "Xbox 360", "num_players": "6  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Stacking", "Stacking"], "meta_score": 53, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/969f1cc56d2263374df48cd70ed2865e-98.jpg", "descriptions": "[Xbox Live Arcade]  The most popular electronic game of all time is back, with new variants, enhanced graphics, and beautiful aquatic playscapes in Tetris Splash. Now, with new modes and team play, Tetris Splash introduces even more exciting, enjoyable ways to play this classic favorite. As[Xbox Live Arcade]  The most popular electronic game of all time is back, with new variants, enhanced graphics, and beautiful aquatic playscapes in Tetris Splash. Now, with new modes and team play, Tetris Splash introduces even more exciting, enjoyable ways to play this classic favorite. As easy to learn as it is addictive, it's equally fun for the casual player and the seasoned Tetris pro. Three different modes of play including Tetris, T-Spin, and Combo, plus a unique screensaver mode. Playable solo, competitively or in teams, with an online multiplayer mode via Xbox LIVE for up to six players. New, enhanced graphics, and beautiful aquatic backscapes add a real splash to the fun of Tetris. Exciting downloadable content will be made available including themes and background aquatic creatures. Twelve new achievements to master and conquer. [Microsoft]… Expand"}, {"name": "MX vs. ATV Untamed", "details_link": "https://www.metacritic.com/game/playstation-2/mx-vs-atv-untamed", "publisher": "THQ", "release_date": "Dec 17 2007", "developers": ["Rainbow Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "6  Online", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 53, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/835c8c1a52327a2564947e6a0e348003-98.jpg", "descriptions": "MX vs ATV kicks it up a notch and shifts into high gear as the best selling offroad franchise returns. MX vs ATV’s legendary Rhythm Racing lets players pre-load into massive jumps and clutch through hairpin turns at full speed all while retaining the smooth and authentic feel not found inMX vs ATV kicks it up a notch and shifts into high gear as the best selling offroad franchise returns. MX vs ATV’s legendary Rhythm Racing lets players pre-load into massive jumps and clutch through hairpin turns at full speed all while retaining the smooth and authentic feel not found in any other game. Attempt to own the offroad by dominating the innovative new \"X-Cross Tournament \". X-Cross brings together 6 unique racing series like Opencross, Supercross, Rally and Supermoto and then crosses them into one ultimate offroad championship. Brand new styles of racing are born as powerful vehicles tear through treacherous trails in the new Opencross mode, while then shifting gears to navigate asphalt and dirt in Supermoto. Players can take control of the Monster and Trophy Trucks as they blitz through rough rivers, rip though the swampy Everglades, and blaze through the desert dunes. Customize your ride with new sponsorship logos on your vehicle. Be the last vehicle standing as 6 players compete online. [THQ]… Expand"}, {"name": "Phantaruk", "details_link": "https://www.metacritic.com/game/pc/phantaruk", "publisher": "PlayWay", "release_date": "Aug 16 2016", "developers": ["Polyslash"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 53, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/cd20ab697da065c4fa8d7862f8091108-98.jpg", "descriptions": "Phantaruk combines survival horror with adventure and stealth mechanics. Expect true shivers down your spine as you fight for your life not only facing the dangers of the Purity-02 spaceship, but most of all - when you try to get rid of toxins continually destroying you from the inside."}, {"name": "Namco Museum Megamix", "details_link": "https://www.metacritic.com/game/wii/namco-museum-megamix", "publisher": "Namco Bandai Games", "release_date": "Nov 16 2010", "developers": ["Namco Bandai Games"], "platforms": "Wii", "genres": ["Miscellaneous", "Compilation", "Party", "Compilation"], "meta_score": 53, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/db8e7b49685fc701aee1170364ba37c7-98.jpg", "descriptions": "Namco Museum Megamix gives players a new take on classic franchises while staying true to the core gameplay that made them so popular. Each game will deliver a unique experience with updated Pac-Man themed graphics and specially designed Wii motion controls that will have gamers of all skillNamco Museum Megamix gives players a new take on classic franchises while staying true to the core gameplay that made them so popular. Each game will deliver a unique experience with updated Pac-Man themed graphics and specially designed Wii motion controls that will have gamers of all skill levels wanting to join in on the fun.  … Expand"}, {"name": "The Adventures of Darwin", "details_link": "https://www.metacritic.com/game/playstation-2/the-adventures-of-darwin", "publisher": "D3", "release_date": "Jun 25 2007", "developers": ["Vingt-et-un Systems"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Fantasy"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/1312a9ef43ab4519dbc75a0b2c11f1be-98.jpg", "descriptions": "You are the leader of a primitive village. If you want to survive life in a hostile world, you must evolve! In The Adventures of Darwin, you drive the evolution of your village from a small group of simple primates to a powerful, intelligent colony of humans. Lead your tribe on adventures,You are the leader of a primitive village. If you want to survive life in a hostile world, you must evolve! In The Adventures of Darwin, you drive the evolution of your village from a small group of simple primates to a powerful, intelligent colony of humans. Lead your tribe on adventures, teach them to hunt, teach them to build, and teach them the power of language. Are you the leader of the evolution, or doomed to a life of monkey business? Help your tribe evolve by hunting and gathering food and developing the culture of your village. Vast prehistoric world filled with wooly mammoths, sabretooth tigers, ferocious dinosaurs, and more. Squad-based gameplay with distinct battle formations and commands. Unique AI system where your tribe becomes more intelligent as they evolve. Upgradeable weapons as your tribe evolves: Start with rocks and evolve to spears, axes, and bows.… Expand"}, {"name": "The Da Vinci Code", "details_link": "https://www.metacritic.com/game/pc/the-da-vinci-code", "publisher": "2K Games", "release_date": "May 19 2006", "developers": ["The Collective"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 53, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/a94c56c34f88425f6492b56e70ed4ed6-98.jpg", "descriptions": "Guide Robert Langdon and Sophie Neveu on their quest to solve a bizarre murder-mystery and uncover the ultimate treasure protected by an ancient secret society. Expands upon \"The Da Vinci Code\" universe by giving the player new experiences and locations not visited in the book or the film.Guide Robert Langdon and Sophie Neveu on their quest to solve a bizarre murder-mystery and uncover the ultimate treasure protected by an ancient secret society. Expands upon \"The Da Vinci Code\" universe by giving the player new experiences and locations not visited in the book or the film. Combines a unique blend of stealth, frantic chases and combat, diversely cryptic puzzles, and exploration. Explore detailed environments and discover hidden clues in world famous locations such as The Louvre, Westminster Abbey, St. Sulpice and more. Players must solve a wide variety of challenging physical and intellectual puzzles that will ultimately lead them to the resting ground of the Holy Grail.… Expand"}, {"name": "NFL Quarterback Club 2002", "details_link": "https://www.metacritic.com/game/gamecube/nfl-quarterback-club-2002", "publisher": "Acclaim", "release_date": "Dec 14 2001", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "GameCube"], "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/c0f48e474a21426467b0aa6f7c335a4f-98.jpg", "descriptions": "Aside from the game's exceptional QB challenge mode, there isn't much that really stands out in Quarterback Club 2002."}, {"name": "Legends of Might and Magic", "details_link": "https://www.metacritic.com/game/pc/legends-of-might-and-magic", "publisher": "3DO", "release_date": "Jun 18 2001", "developers": ["3DO"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "General", "General"], "meta_score": 53, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/faf11eabcca8fdf18fdf05d082b83c52-98.jpg", "descriptions": "Travel to distant worlds of epic fantasy-filled lands, perilous dungeons and bloodstained battlefields. Join a troop of courageous heroes to battle the forces of darkness, or brawl alongside evil cohorts bent on destruction and chaos. Battle hundreds of creatures and recover unknownTravel to distant worlds of epic fantasy-filled lands, perilous dungeons and bloodstained battlefields. Join a troop of courageous heroes to battle the forces of darkness, or brawl alongside evil cohorts bent on destruction and chaos. Battle hundreds of creatures and recover unknown treasures as you strive to be crowned champion. [3DO]… Expand"}, {"name": "Lair", "details_link": "https://www.metacritic.com/game/playstation-3/lair", "publisher": "SCEA", "release_date": "Aug 30 2007", "developers": ["Factor 5", "SCE/WWS"], "platforms": "PlayStation 3", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 53, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/f1a6d12235da7e7efebf39a684bd970d-98.jpg", "descriptions": "In a world ravaged by endless conflict and natural disaster, a call for peace turns into a bloodbath of betrayal and deceit. Playing as a warrior riding a voracious dragon trained for deadly aerial and ground combat, and capable of scorching, clawing and smashing thousands of enemies, gamersIn a world ravaged by endless conflict and natural disaster, a call for peace turns into a bloodbath of betrayal and deceit. Playing as a warrior riding a voracious dragon trained for deadly aerial and ground combat, and capable of scorching, clawing and smashing thousands of enemies, gamers must defeat countless armies to save a civilization. Together, the gamer and the beast will attempt to change the destiny of a world on the brink of extinction. Engage in a struggle on an epic scale as your civilization repels the onslaught of an unrelenting army. A seamless combination of vast battles in air and on the ground, against other beasts, and armies of thousands. Unleash your might through large-scale battles that span both the sky and ground. Turn the tides of war with your ferocious dragon. Scorch the ground with flames and command the skies against vicious enemies. Immerse yourself in a living, breathing world of voracious beasts, a deep storyline and visceral gameplay. Fully supports the Playstation 3 motion sensitive controller. [SCEA]… Expand"}, {"name": "Fable II Pub Games", "details_link": "https://www.metacritic.com/game/xbox-360/fable-ii-pub-games", "publisher": "Microsoft Game Studios", "release_date": "Aug 13 2008", "developers": ["Lionhead Studios"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Action", "Miscellaneous", "General", "Gambling"], "meta_score": 53, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/737b68c5f82f522b1d00b9913349d869-98.jpg", "descriptions": "[Xbox Live Arcade]  Available exclusively on Xbox LIVE Arcade, you can transfer the gold earned in these casino-style mini-games to the world of Fable II. Play these mini-games and build your Fable II bankroll. The Fable II Pub Games (available as one download) are: Keystone: A combination[Xbox Live Arcade]  Available exclusively on Xbox LIVE Arcade, you can transfer the gold earned in these casino-style mini-games to the world of Fable II. Play these mini-games and build your Fable II bankroll. The Fable II Pub Games (available as one download) are: Keystone: A combination of Craps and Roulette; Spinnerbox: An updated take on slot machines; Fortune's Tower: A \"press your luck\" style of game. The download also includes a Shell, which is a tutorial of all three games. [Microsoft]… Expand"}, {"name": "Solar Shifter EX", "details_link": "https://www.metacritic.com/game/xbox-one/solar-shifter-ex", "publisher": "Headup Games", "release_date": "Aug 26 2016", "developers": ["Elder Games"], "platforms": ["PC", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/d2e2ed213908e0c1c98d91a06fe1921b-98.jpg", "descriptions": "A sci-fi bullet hell shooter with the unique ability to \"shift\" (teleport)- either right into the action or, in tough situations, out of it for your own sake."}, {"name": "Medal of Honor: Warfighter", "details_link": "https://www.metacritic.com/game/xbox-360/medal-of-honor-warfighter", "publisher": "Electronic Arts", "release_date": "Oct 23 2012", "developers": ["Danger Close"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 20 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Modern", "Arcade"], "meta_score": 53, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/6fb3e007a18ba7bf1f77a0a48534544e-98.jpg", "descriptions": "Medal of Honor Warfighter is inspired by and has been developed in association with Tier 1 Operators. This personal story was written by Tier 1 Operators while deployed around the world. In it, players assume the roles of these warfighters and apply unique skill sets to track down a genuineMedal of Honor Warfighter is inspired by and has been developed in association with Tier 1 Operators. This personal story was written by Tier 1 Operators while deployed around the world. In it, players assume the roles of these warfighters and apply unique skill sets to track down a genuine global threat, in real international locations, sponsored by real enemies.… Expand"}, {"name": "Family Guy", "details_link": "https://www.metacritic.com/game/xbox/family-guy", "publisher": "2K Games", "release_date": "Oct 16 2006", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Adventure", "General"], "meta_score": 53, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/6ff697068fdc23782c3d8907cab6709c-98.jpg", "descriptions": "Play through three stories that intersect in typical Family Guy fashion. Be Stewie and match wits against his brother and arch-nemesis Bertram as they vie to take over the world. Take control of Peter and fight to stop Mr. Belvedere who he thinks is trying to take over the world. Slip on aPlay through three stories that intersect in typical Family Guy fashion. Be Stewie and match wits against his brother and arch-nemesis Bertram as they vie to take over the world. Take control of Peter and fight to stop Mr. Belvedere who he thinks is trying to take over the world. Slip on a collar and down a martini as Brian attempt to escape prison and prove your innocence in a puppy parental case gone awry.… Expand"}, {"name": "Warpath", "details_link": "https://www.metacritic.com/game/xbox/warpath", "publisher": "Groove Games", "release_date": "Jul 24 2006", "developers": ["Digital Extremes"], "platforms": ["iPhone/iPad", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/bfd64aed688d4285b45a25a4b4069c24-98.jpg", "descriptions": "Three distinct races have converged in a virtual Eden, in the outermost reaches of the galaxy, each with a unique reason for settling this new world. Conflict is inevitable, victory is not. WarPath is a fast-paced FPS game featuring a unique single player mode that allows gamers to battleThree distinct races have converged in a virtual Eden, in the outermost reaches of the galaxy, each with a unique reason for settling this new world. Conflict is inevitable, victory is not. WarPath is a fast-paced FPS game featuring a unique single player mode that allows gamers to battle for control of different territories, with each providing distinct strategic advantages. Once players have honed their skills in the single player missions, they can jump online and let the real action begin. 3 different races to choose from, each with their own unique weapon load-out and appearance. 4 land-based vehicles. 8 weapons, the Wolverine, Tyrant, Long Bow, Judge, Vanguard, Vibro Blade, and EMAC, allowing for a highly diversified range of play styles. Upgradeable weapons that unlock more functionality and greater destructive force with each new level. UNREAL engine and Karma physics technology providing stunning visuals and effects. In single player practice mode, gamers can go up against 32 bots for an adrenaline-filled multiplayer simulation. 4 Modes of high-speed, intensely addictive multiplayer action - Death Match, Team Death Match, Capture the Flag, and Frontline Assault. 25 Multiplayer levels that take players across the diverse indoor and outdoor environments of Kaladi. Support for 2-16 players via LAN or Online, allowing battles to be intimate grudge matches, or all out clan carnage. Access to all the weapons and upgrades that players unlocked and mastered in the single player campaign.… Expand"}, {"name": "Bedlam: The Game by Christopher Brookmyre", "details_link": "https://www.metacritic.com/game/playstation-4/bedlam-the-game-by-christopher-brookmyre", "publisher": "RedBedlam", "release_date": "Oct 13 2015", "developers": ["Standfast Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 53, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/1/8e2fd22b680dce61ba5e75b84b46d41a-98.jpg", "descriptions": "The game is based on the novel of the same name by award-winning author, Christopher Brookmyre, and sees the player take on the role of protagonist Heather Quinn as she negotiates a variety of levels, all of which reference classic games and genres of years gone by."}, {"name": "Spider-Man 3", "details_link": "https://www.metacritic.com/game/wii/spider-man-3", "publisher": "Activision", "release_date": "May  4 2007", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "General", "Platformer", "3D", "3D"], "meta_score": 53, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/36a73b89d1e29f6e2609c1db535ee59a-98.jpg", "descriptions": "Possess the never-before-experienced powers of Black-Suited Spider-Man. Unleash incredible agility, amazing durability and awe-inspiring web abilities. But be warned - the rush your intensified powers bring could overwhelm you. More freedom than ever. More city than ever. For the first time,Possess the never-before-experienced powers of Black-Suited Spider-Man. Unleash incredible agility, amazing durability and awe-inspiring web abilities. But be warned - the rush your intensified powers bring could overwhelm you. More freedom than ever. More city than ever. For the first time, enjoy unprecedented freedom—choosing what you want to do, when you want to do it. There's no checklist to complete in order to progress. You set your own next goal, roaming anywhere you want - including subterranean areas such as subways, sewers and villains' lairs - in the most massive, detailed New York City ever seen in a Spider-Man game. Experience an all-new combat system, two exciting ways. Redesigned from the ground up, a unique combat system empowers both Spider-Man and Black-Suited Spider-Man to perform suit-specific powers and abilities. State of the art animations, combos and finishers make punch, kick and web attacks more super-heroic than ever. Battle 10 of Spider-Man’s most infamous enemies from the movie and Marvel universe, including Sandman and Venom. [Activision]… Expand"}, {"name": "X-Men Origins: Wolverine", "details_link": "https://www.metacritic.com/game/wii/x-men-origins-wolverine", "publisher": "Activision", "release_date": "May  1 2009", "developers": ["Amaze Entertainment"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 53, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/4ca7509261961f1da0ce1f775b06125f-98.jpg", "descriptions": "X-Men Origins: Wolverine is an action-adventure game based on the movie of the same name and will take you through and beyond the movie's storyline."}, {"name": "Castle of Heart", "details_link": "https://www.metacritic.com/game/switch/castle-of-heart", "publisher": "7Levels", "release_date": "Mar 23 2018", "developers": ["7Levels"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 53, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/15f62f4baf1ebb452bf0491d9d23f48e-98.jpg", "descriptions": "A classic action platformer at the genre's best… and most challenging, with plentiful of new twists on formula to experience. The players take control over a cursed knight, turned to stone by the evil sorcerer's spell, but ready to prove that love and courage can conquer even the darkest magic."}, {"name": "Shadwen", "details_link": "https://www.metacritic.com/game/pc/shadwen", "publisher": "Frozenbyte, Inc.", "release_date": "May 17 2016", "developers": ["Frozenbyte", "Inc."], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 53, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/730f6f02e94634a178201013c6417384-98.jpg", "descriptions": "Shadwen is a stealth-action game where the only rule is to remain unseen. Stay hidden - or the ruthless guards will kill you on sight."}, {"name": "Hyperdimension Neptunia mk2", "details_link": "https://www.metacritic.com/game/playstation-3/hyperdimension-neptunia-mk2", "publisher": "NIS America", "release_date": "Feb 28 2012", "developers": ["Idea Factory", "Compile Heart"], "platforms": "PlayStation 3", "num_players": "1 Player", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 53, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/f39a7dd79b3ce1435dad5ce18517caaf-98.jpg", "descriptions": "Hyperdimension Neptunia MK2 is a fantasy RPG from NIS for the PlayStation 3."}, {"name": "Little Friends: Dogs & Cats", "details_link": "https://www.metacritic.com/game/switch/little-friends-dogs-cats", "publisher": "Sold Out", "release_date": "May 28 2019", "developers": ["Imagineer"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Pet"], "meta_score": 53, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/9/58f16f327c62852c3f84e14aa52c9a3e-98.jpg", "descriptions": "It's time to meet your new Little Friends! These adorable puppies and kittens can't wait to meet you in the first pet training game for Nintendo Switch. Play with up to 3 pets at once and own up to 12. Get to know their personalities and feed them their favorite food. Play with your petIt's time to meet your new Little Friends! These adorable puppies and kittens can't wait to meet you in the first pet training game for Nintendo Switch. Play with up to 3 pets at once and own up to 12. Get to know their personalities and feed them their favorite food. Play with your pet using their favorite new toy or take them out for walks and compete in the flying disc tournament, using the Joy-Con™ motion controls or Nintendo Switch touch screen. Each pet has its own personality, behavior and looks. Look after your pet to develop a bond and grow your friendship. Dress them up in more than 600 stylish accessories to make them look their best. Care for your new furry friend to develop a long-lasting friendship.… Expand"}, {"name": "Doodle God: Ultimate Edition", "details_link": "https://www.metacritic.com/game/xbox-one/doodle-god-ultimate-edition", "publisher": "JoyBits", "release_date": "Jan 27 2017", "developers": ["JoyBits Ltd.", "JoyBits"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/15978e7a32b129743d80584ccf2e34f2-98.jpg", "descriptions": "Doodle God puts the power of creation in your hands!\r The power of creation is in your hands! In this addictive, ALL ages, puzzle game mix and match different combinations of fire, earth, wind and air to create an entire universe! Of course the universe was not created in a day. Youll haveDoodle God puts the power of creation in your hands!\r The power of creation is in your hands! In this addictive, ALL ages, puzzle game mix and match different combinations of fire, earth, wind and air to create an entire universe! Of course the universe was not created in a day. Youll have to work your up from a simple microorganism to create animals, tools, storms and even build armies before you have what it takes to build the universe! But beware, the power of creation may have unintended consequences, inventing the wheel might just trigger a zombie plague… Expand"}, {"name": "Windforge", "details_link": "https://www.metacritic.com/game/pc/windforge", "publisher": "Snowed In Studios", "release_date": "Mar 11 2014", "developers": ["Snowed In Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Adventure", "General", "Platformer", "Sandbox", "2D"], "meta_score": 53, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/f10450fc9338f99f6ee8dd557a3e7cdd-98.jpg", "descriptions": "You find yourself awakening in a new world, on floating islands in the sky with no memory of how you got there. It's a strange, exotic and seemingly endless realm filled with both friendly and hostile encounters alike. You start your adventure discovering how you arrived, why you're in thisYou find yourself awakening in a new world, on floating islands in the sky with no memory of how you got there. It's a strange, exotic and seemingly endless realm filled with both friendly and hostile encounters alike. You start your adventure discovering how you arrived, why you're in this place and where to go from there. Use your imagination to explore and build to your heart's content or unravel your story and dig deeper into the mystery!… Expand"}, {"name": "CSI: NY", "details_link": "https://www.metacritic.com/game/pc/csi-ny", "publisher": "Ubisoft", "release_date": "Nov 18 2008", "developers": ["Legacy Interactive"], "platforms": "PC", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 53, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/1/a58bc1f61515ea4e7ce9799e94ee14a4-98.jpg", "descriptions": "For the first time in the CSI video game series, CSI: NY – The Game allows you to play as actual characters from the hit TV show. The video game features a brand-new graphic novel art style, interactive mini-games and interrogations, as well as original cases crafted by writers from theFor the first time in the CSI video game series, CSI: NY – The Game allows you to play as actual characters from the hit TV show. The video game features a brand-new graphic novel art style, interactive mini-games and interrogations, as well as original cases crafted by writers from the \"CSI: NY” television series. [Ubisoft]… Expand"}, {"name": "Godzilla: Domination!", "details_link": "https://www.metacritic.com/game/game-boy-advance/godzilla-domination!", "publisher": "Atari", "release_date": "Nov 11 2002", "developers": ["WayForward"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 53, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/857eee89c48109db3d2de4a2ecc5fb69-98.jpg", "descriptions": "There are better traditional fighting games out there that will probably spend more time in your GBA than this one--but Godzilla, Mothra, and King Ghidorah aren't in those games."}, {"name": "Ice Cream Surfer", "details_link": "https://www.metacritic.com/game/wii-u/ice-cream-surfer", "publisher": "Dolores Entertainment SL", "release_date": "Sep  4 2014", "developers": ["Dolores Entertainment SL", "Dolores Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 53, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/6560bcd80b9b4e1664aa093ffa68fc4b-98.jpg", "descriptions": "The evil Broccoli, irritated by the fact that kids hate vegetables and love ice creams, has created an army of vegetables to destroy the flavor galaxy. Only the Ice Cream Surfer with the help of his 4 super tasty friends can prevent that. Straight to the action, we aren't here to tellThe evil Broccoli, irritated by the fact that kids hate vegetables and love ice creams, has created an army of vegetables to destroy the flavor galaxy. Only the Ice Cream Surfer with the help of his 4 super tasty friends can prevent that. Straight to the action, we aren't here to tell stories, but for button-mashing, well in this case iPhone-mashing. Are you ready to shot Ice Cream balls filled with pure cooling energy?… Expand"}, {"name": "Doctor Lautrec and the Forgotten Knights", "details_link": "https://www.metacritic.com/game/3ds/doctor-lautrec-and-the-forgotten-knights", "publisher": "Konami", "release_date": "Dec 13 2011", "developers": ["WinkySoft"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 53, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/f76ac050af88287d7af1f26ef79951ce-98.jpg", "descriptions": "Enter 19th century Europe and the world of Doctor Jean-Pierre Lautrec. He’s a brilliant, eccentric, sarcastic professor with few friends but a healthy obsession for solving mysteries. One day, a woman named Marie visits Lautrec bearing a curious gadget. The mysterious map that the gadgetEnter 19th century Europe and the world of Doctor Jean-Pierre Lautrec. He’s a brilliant, eccentric, sarcastic professor with few friends but a healthy obsession for solving mysteries. One day, a woman named Marie visits Lautrec bearing a curious gadget. The mysterious map that the gadget displayed seemed to point the way to a fantastic hidden treasure belonging to Louis XIV of the House of Bourbon, a dynasty that had collapsed a century earlier. As they search for the treasure, they find themselves targeted by a mysterious man named Vidocq. They are blocked at every turn by the Knights of the Iron Mask, a mysterious group of men with iron masks and claws. Work as Doctor Lautrec, aided by his perky and emotional sidekick Sophie, to unlock the mysteries within and search for the lost treasure of Louis XIV. Search for clues, solve puzzles to unlock new mysteries and gain more information as the quest continues. The story is told in both 2D and uses the power of the Nintendo 3DS in 3D to enhance game play giving gamers the ability to look around for clues like they’re in the game. Immerse yourself in the world of Doctor Lautrec where mystery and adventure can be found around every corner.… Expand"}, {"name": "WarioWare: Snapped!", "details_link": "https://www.metacritic.com/game/ds/warioware-snapped!", "publisher": "Nintendo", "release_date": "Apr  5 2009", "developers": ["Intelligent Systems"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Party / Minigame", "General"], "meta_score": 53, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/9/2b33c28a2cd3e470bc2d370b23bd8f12-98.jpg", "descriptions": "[DSiWare]  Put yourself in the frame for some motion-controlled fun with WarioWare: Snapped! Created especially for Nintendo DSiWare, the latest game in the WarioWare series uses the Nintendo DSi’s inner camera to make you the star of the show as you play wacky mini-games that are guaranteed[DSiWare]  Put yourself in the frame for some motion-controlled fun with WarioWare: Snapped! Created especially for Nintendo DSiWare, the latest game in the WarioWare series uses the Nintendo DSi’s inner camera to make you the star of the show as you play wacky mini-games that are guaranteed to get you moving. To get started, you'll line yourself up for a photo - positioning your head and hands as instructed so that your body can become your means to control the madness. You can choose from four game modes to play, each mode featuring five different challenges and hosted by different characters. Whichever mode you opt to play, the fact that it reflects the personality of your host is a guarantee that things will get crazy! In Wario's challenges, you'll have to make big movements with your face and body to succeed - perhaps collecting coins or shaking your head at high speed to dry off a dog! Mona’s mini-games, on the other hand, will require you to line yourself up with targets on the screen. You might have to move your head into place to catch a falling hat or squash a fly just by clapping your hands. In Jimmy’s challenges, you'll play peek-a-boo with a baby, stick fingers up nostrils and dish out a quick massage just by performing the right actions. The remaining set of mini-games are hosted by ninja twins, Kat and Ana. This duo know the value of good friends, which means all their challenges require you to have a sidekick handy. Line your faces up in a totem pole, smash through a stone block together and figure out the right formations to get through whatever comes your way. [Nintendo]… Expand"}, {"name": "Akiba's Trip: Hellbound & Debriefed", "details_link": "https://www.metacritic.com/game/switch/akibas-trip-hellbound-debriefed", "publisher": "XSEED Games", "release_date": "Jul 20 2021", "developers": ["Acquire"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Beat-'Em-Up", "3D"], "meta_score": 53, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/2232bf01bbc9ec40686febad0dcd48f7-98.jpg", "descriptions": "AKIBA’S TRIP: Hellbound & Debriefed is the precursor to AKIBA’S TRIP: Undead & Undressed, the smash hit that introduced a Western audience to the seedy underworld lurking in the shadows of the haven of “otaku” culture in the Akihabara district of Tokyo. Released as AKIBA’S TRIP Plus inAKIBA’S TRIP: Hellbound & Debriefed is the precursor to AKIBA’S TRIP: Undead & Undressed, the smash hit that introduced a Western audience to the seedy underworld lurking in the shadows of the haven of “otaku” culture in the Akihabara district of Tokyo. Released as AKIBA’S TRIP Plus in Japan, players explore a rich setting based on the famous “Akiba” district circa 2011, hunting vampiric foes and tearing off their clothes to expose them to sunlight. This remaster brings the game up to modern HD graphical standards, all while retaining the charm of the original classic that sparked a cult hit series. … Expand"}, {"name": "Belief & Betrayal", "details_link": "https://www.metacritic.com/game/pc/belief-betrayal", "publisher": "Lighthouse Interactive", "release_date": "Mar 25 2008", "developers": ["Artematica"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 53, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/7/8581fdbb8c37d37b4811249dd66d39f2-98.jpg", "descriptions": "As journalist Jonathan Danter, you discover that a ten year old murder is somehow part of a greater mystery that could destroy humanity itself. Filled with baffling plot twists and conspiracy theories, you must uncover the mystery that reaches back through history from 1194 A.D. to the timeAs journalist Jonathan Danter, you discover that a ten year old murder is somehow part of a greater mystery that could destroy humanity itself. Filled with baffling plot twists and conspiracy theories, you must uncover the mystery that reaches back through history from 1194 A.D. to the time Judas received 30 pieces of silver to betray Christ. Travel to exotic locations throughout Europe including: London, Venice, Rome and the Vatican, to uncover skeletons hidden deep within the closets of some of the most powerful leaders around the World. Play as 3 different characters throughout the game to solve the mystery. Find lost ancient manuscripts and decipher mind-boggling codes and symbols. Explore stunning environments and incredibly re-created historic locations. Strong action/adventure storyline creates a compelling gameplay experience. Use the memories and thoughts of the intriguing cast of characters to solve puzzles and expose dark mysteries. Game based on historical events though the story is pure fiction. Easy to navigate 3rd person point & click interface using the Virtools engine. [Lighthouse Interactive]… Expand"}, {"name": "#KILLALLZOMBIES", "details_link": "https://www.metacritic.com/game/xbox-one/killallzombies", "publisher": "Digerati Distribution", "release_date": "Aug 10 2016", "developers": ["Beatshapers"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/bc84f2d2cd7b639d5ed9ed266d89ee74-98.jpg", "descriptions": "In the distant future; #KILLALLZOMBIES is thrusting civilians into a sport of survival were a ravenous zombie population is unleashed in the name of sports entertainment with television spectators voting upon how many zombies they want to uncage to make survival all the more harder for youIn the distant future; #KILLALLZOMBIES is thrusting civilians into a sport of survival were a ravenous zombie population is unleashed in the name of sports entertainment with television spectators voting upon how many zombies they want to uncage to make survival all the more harder for you to accomplish with the potential of a collective horde of over 1,000 zombies.… Expand"}]