[
  {
    "name": "Nioh: Dragon of the North",
    "details_link": "https://www.metacritic.com/game/playstation-4/nioh-dragon-of-the-north",
    "publisher": "Koei Tecmo Games",
    "release_date": "May  2 2017",
    "developers": [
      "Team Ninja"
    ],
    "platforms": "PlayStation 4",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 76,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/4/71dcc76dc88c55451ec7996508cba65e-98.jpg",
    "descriptions": "Return once more to the Yokai infested landscape of Japan’s warring states and venture deep into its embattled northern provinces. In this story expansion for Nioh - Dragon of the North follows William’s valiant struggle in the main game and opens up the Oshu region, where ambitious rulerReturn once more to the Yokai infested landscape of Japan’s warring states and venture deep into its embattled northern provinces. In this story expansion for Nioh - Dragon of the North follows William’s valiant struggle in the main game and opens up the Oshu region, where ambitious ruler Masamune Date is secretly gathering spirit stones. Encounter fearsome enemies and allies across three distinct stages, and develop William’s combat skills further with powerful new Ninjutsu, Onmyo magic and Guardian Spirits. Plus, discover legendary armour sets and weapons, including the Odachi great katana. [Playstation.com]… Expand"
  },
  {
    "name": "The Club",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-club",
    "publisher": "Sega",
    "release_date": "Feb 19 2008",
    "developers": [
      "Bizarre Creations"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 76,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/7/e7e20106f1102bf8f895742b6b611fd4-98.jpg",
    "descriptions": "The Club is a new breed of third-person shooter, combining fast-paced run and gun gameplay, destructive environments, lethal weapons and an in-depth story structure. You will fight to survive in a shadowy underground blood-sport controlled by a faceless, obscenely wealthy and influentialThe Club is a new breed of third-person shooter, combining fast-paced run and gun gameplay, destructive environments, lethal weapons and an in-depth story structure. You will fight to survive in a shadowy underground blood-sport controlled by a faceless, obscenely wealthy and influential elite who place their bets on who will survive as the blood-bath ensues before them. Take control of up to eight uniquely trained killers motivated by greed, driven by pure insane bloodlust, and hell bent on earning respect on a global level. As one of eight fighters, blast your way through five single player game modes including: Standard Mode, Time Attack, Survivor, Siege, and Run the Gauntlet. Earn Respect Online. Shoot your way to the top of the leader boards in over nine cut-throat multiplayer modes.  Face-off with 15 real-time opponents online or battle with your friends offline in 4-player split-screen action modes. Battle in eight unique real-world locations from around the globe, including war-torn cities, abandoned factories, steel mills and many more. Extreme Gun Battles in Hazardous Environments: A motion blur camera system intensifies the adrenaline rush in both open range and close quarter firefights. Destroy and manipulate objects in the environment to your advantage. A unique score-based accumulation system creates even more competition among players; the faster, more efficient and accurate that you are, the more points you will earn to unlock weapons, characters and maps. There are 17 high-powered assault weapons to choose from and customize, including Automatic Weapons, Sniper Rifles, High Caliber Pistols, Sub Machine Guns, and Mounted Weapons. Each Character has a Story to Tell. [Sega]… Expand"
  },
  {
    "name": "Shadow Hearts: From the New World",
    "details_link": "https://www.metacritic.com/game/playstation-2/shadow-hearts-from-the-new-world",
    "publisher": "XSEED Games",
    "release_date": "Mar  7 2006",
    "developers": [
      "Nautilus"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 76,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/6/99015b9ffa25d168627739a96f224e3f-98.jpg",
    "descriptions": "The story begins as Johnny Garland, a young, 16-year old detective who lost his father, sister and his memory in an accident, accepts an investigation to track down a criminal suspect who escaped from custody. As he closes in on the suspect, Johnny witnesses a supernatural occurrence - aThe story begins as Johnny Garland, a young, 16-year old detective who lost his father, sister and his memory in an accident, accepts an investigation to track down a criminal suspect who escaped from custody. As he closes in on the suspect, Johnny witnesses a supernatural occurrence - a huge monster appears from a green light known as the \"window\" and swallows up the criminal. Apparently, a series of horrific incidents similar to this have been plaguing the cities across the nation. Johnny's female counterpart is 21-year-old bounty hunter Shania, a Native American who is searching for these mysterious windows and determined to fight them using her spiritual powers. Together, they travel around the states and are joined by other characters.… Expand"
  },
  {
    "name": "PixelJunk SideScroller",
    "details_link": "https://www.metacritic.com/game/playstation-3/pixeljunk-sidescroller",
    "publisher": "SCEA",
    "release_date": "Oct 25 2011",
    "developers": [
      "Q-Games"
    ],
    "platforms": "PlayStation 3",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Scrolling",
      "Scrolling",
      "Shoot-'Em-Up",
      "Horizontal"
    ],
    "meta_score": 76,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/5/00d62ebfbaebbaee590f7fafd587d3d4-98.jpg",
    "descriptions": "Q-Games, developer of the award-winning PixelJunk series, returns this summer with a nostalgic take on the series with its new side-scrolling shooter, PixelJunk SideScroller.  Based on the unlockable stage from PixelJunk Shooter 2, PixelJunk Sidescroller is a complex and dynamic fluidQ-Games, developer of the award-winning PixelJunk series, returns this summer with a nostalgic take on the series with its new side-scrolling shooter, PixelJunk SideScroller.  Based on the unlockable stage from PixelJunk Shooter 2, PixelJunk Sidescroller is a complex and dynamic fluid simulation system, which fills the game world with flowing liquids and hazardous gases, while putting a new spin on arcade shooters.  Blast holes in walls or use your ship itself to drill past scorching hot magma.  The fluids react in real-time to the player’s actions and to other liquids, creating unique and exciting situations with every play.  … Expand"
  },
  {
    "name": "Fantasy Strike",
    "details_link": "https://www.metacritic.com/game/switch/fantasy-strike",
    "publisher": "Sirlin Games",
    "release_date": "Jul 25 2019",
    "developers": [
      "Sirlin Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Fighting",
      "2D"
    ],
    "meta_score": 76,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/2/b2e4b453a9d915d3ab3da6048aaa56ce-98.jpg",
    "descriptions": "Fantasy Strike is a colorful fighting game where fantasy meets martial arts. It focuses on depth and strategy rather than difficult execution. It's designed for tournament play, but also to welcome you to the genre if you haven't played other fighting games before. Online play uses theFantasy Strike is a colorful fighting game where fantasy meets martial arts. It focuses on depth and strategy rather than difficult execution. It's designed for tournament play, but also to welcome you to the genre if you haven't played other fighting games before. Online play uses the excellent GGPO networking technology. Includes several single player modes.… Expand"
  },
  {
    "name": "Flinthook",
    "details_link": "https://www.metacritic.com/game/playstation-4/flinthook",
    "publisher": "Limited Run Games",
    "release_date": "Apr 14 2017",
    "developers": [
      "Tribute Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 76,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/5/593f8ecb27a56d2cdc1d0e1cc9fd1874-98.jpg",
    "descriptions": "Live the life of space captain Flinthook. Armed with your mighty hookshot, your uncanny slow-motion powers, and your trusty blasma pistol, plunder and fight your way through an infinite variety of randomly-assembled spaceships for treasure, loot, and fame."
  },
  {
    "name": "Azure Striker Gunvolt 2",
    "details_link": "https://www.metacritic.com/game/3ds/azure-striker-gunvolt-2",
    "publisher": "Inti Creates",
    "release_date": "Sep 29 2016",
    "developers": [
      "Inti Creates"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "3DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 76,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/1/90efa6712f901cd8a7dc8d6815475733-98.jpg",
    "descriptions": "The 2D high speed, old-school style side-scrolling action that you remember from Azure Striker Gunvolt is back. In this game, Gunvolt's rival Copen from the first installment returns to the fray as a playable character. Prevasion: This ability allows Gunvolt to neutralize enemy attacks atThe 2D high speed, old-school style side-scrolling action that you remember from Azure Striker Gunvolt is back. In this game, Gunvolt's rival Copen from the first installment returns to the fray as a playable character. Prevasion: This ability allows Gunvolt to neutralize enemy attacks at the cost of his EP energy. Copen also has an ability exactly like this. Kudos is a point system that increases whenever you deal damage to an enemy. Whenever you take damage, your Kudos are reduced to zero. When activating a save point, using a special skill or clearing a mission, Kudos are converted into bonus points. The Muse's song: For as long as you can maintain 1000 or more Kudos, the BGM will change and Lumen AKA The Muse (or in Copen's story, Lola) will sing for you. Anthem: When Gunvolt or Copen's HP reaches 0, the Muse's power can bring them back to life, with additional power-ups. In that state, the BGM will change to the Muse's song. [Nintendo.com]\r… Expand"
  },
  {
    "name": "Phoenix Wright: Ace Attorney - Justice for All",
    "details_link": "https://www.metacritic.com/game/ds/phoenix-wright-ace-attorney---justice-for-all",
    "publisher": "Capcom",
    "release_date": "Jan 16 2007",
    "developers": [
      "Capcom"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "First-Person",
      "Visual Novel",
      "Modern",
      "Modern"
    ],
    "meta_score": 76,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/1/90c814f4225cd2b891cf3073b4eba96e-98.jpg",
    "descriptions": "The second game in the popular court room battle series from Japan introduces four new cases featuring new characters, plot twists and gameplay features.  Players resume the role of Phoenix Wright, a defence attorney who must prove his client’s innocence against the toughest of odds and mostThe second game in the popular court room battle series from Japan introduces four new cases featuring new characters, plot twists and gameplay features.  Players resume the role of Phoenix Wright, a defence attorney who must prove his client’s innocence against the toughest of odds and most ruthless of adversaries.  Players must exercise their legal prowess as they collect evidence, examine witnesses, analyse testimonies and seek the truth to ensure that justice prevails. New \"Psyche-Lock\" feature – some witnesses may be keeping the truth under tight lock and key, so in order to break them down, successfully open up their Psyche- Locks with a series of correct questions or catch them on their inconsistent testimony. New life bar represents Phoenix’s status in court – by presenting incorrect evidence or following misguided attempts to break Psyche Locks, Phoenix’s life bar will go down; the only way to regain this stat is to successfully open a witness’s Psyche-Lock. Colourful cast of characters include both new & familiar faces:  Franziska von Karma – the new D.A. and daughter of former adversary, Manfred von Karma, is on the warpath to take Phoenix down and avenge her father by any means necessary; Maya Fey – having honed her psychic powers, she is now a mystic of the Kurain Channeling Technique and will continue to be a valuable ally for Phoenix in his trials; Pearl Fey – Maya’s cousin is an up and coming psychic herself and looks up to her as a role model. [Capcom]… Expand"
  },
  {
    "name": "Kirby Super Star Ultra",
    "details_link": "https://www.metacritic.com/game/ds/kirby-super-star-ultra",
    "publisher": "Nintendo",
    "release_date": "Sep 22 2008",
    "developers": [
      "HAL Labs"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 76,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/9/9f0a4726cf3eb23e4fb5f3ea3fb9c609-98.jpg",
    "descriptions": "Kirby Super Star Ultra re-imagines one of the most beloved Kirby games of all time. Kirby Super Star Ultra features new graphics and fully rendered animated cut scenes. With so many adventures waiting to be unlocked, there's never be a dull moment as Kirby runs, floats, copies enemies andKirby Super Star Ultra re-imagines one of the most beloved Kirby games of all time. Kirby Super Star Ultra features new graphics and fully rendered animated cut scenes. With so many adventures waiting to be unlocked, there's never be a dull moment as Kirby runs, floats, copies enemies and uses Helpers to fight King Dedede and Meta Knight. New modes like Revenge of the King and Meta Knight Ultra await, along with classics like The Great Cave Offensive and Milky Way Wishes. On top of the main modes, there are also three new touch-screen-controlled mini-games that can be played with up to three friends via DS Download Play. Not only that, but players can go on Kirby adventures with a friend via local wireless as well. [Nintendo]… Expand"
  },
  {
    "name": "Candleman: The Complete Journey",
    "details_link": "https://www.metacritic.com/game/pc/candleman-the-complete-journey",
    "publisher": "Spotlightor Interactive",
    "release_date": "Jan 31 2018",
    "developers": [
      "Spotlightor Interactive"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 76,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/6/a7d5f6c438a61a4f051a153efceba16d-98.jpg",
    "descriptions": "Despite only being able to burn for 10 seconds, a little candle journeys into the darkness, with the purpose of seeking light."
  },
  {
    "name": "MAG",
    "details_link": "https://www.metacritic.com/game/playstation-3/mag",
    "publisher": "SCEA",
    "release_date": "Jan 26 2010",
    "developers": [
      "Zipper Interactive"
    ],
    "platforms": "PlayStation 3",
    "num_players": "Massively Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Tactical",
      "Modern",
      "Arcade"
    ],
    "meta_score": 76,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/1/932d490ee4586ac116fae09ca1f0d10e-98.jpg",
    "descriptions": "2026: The Post WW3 political climate forces the world's superpowers to eliminate their military and turn to Private Military Corporation. The three largest PMCs engage in a Shadow War to control the global, paramilitary contract market. Enlist and enter the world of MAG. Join a Private2026: The Post WW3 political climate forces the world's superpowers to eliminate their military and turn to Private Military Corporation. The three largest PMCs engage in a Shadow War to control the global, paramilitary contract market. Enlist and enter the world of MAG. Join a Private Military Corporation and begin your paramilitary career. Intense 256 player FPS battles are fueled by a simple Command & Control system. Gain a personal advantage by working as a team. Enlist and pursue the career of your choosing with one of three different PMCs (Private Military Corporations). Customize your look and select your skills and equipment to create your own custom warrior. Each victory will strengthen your PMC’s standing with the Global Superpowers; resulting in faction and player benefits. Your contributions matter. [SCEA]… Expand"
  },
  {
    "name": "Metal Slug 3",
    "details_link": "https://www.metacritic.com/game/xbox/metal-slug-3",
    "publisher": "SNK",
    "release_date": "May 26 2004",
    "developers": [
      "SNK"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Shooter",
      "Scrolling"
    ],
    "meta_score": 76,
    "users_score": 5.4,
    "image": "https://static.metacritic.com/images/products/games/9/cd83dc398b26134b13a84e39f09bf6d3-98.jpg",
    "descriptions": "Not merely an arcade port, Metal Slug 3 for the Xbox sports brand-new features and original missions. Now you can choose from more than 10 new slug vehicles, including the Slug Copter and the Elephant Slug, and go head-to-head against submarines, large locusts, and giant bosses. UseNot merely an arcade port, Metal Slug 3 for the Xbox sports brand-new features and original missions. Now you can choose from more than 10 new slug vehicles, including the Slug Copter and the Elephant Slug, and go head-to-head against submarines, large locusts, and giant bosses. Use handguns, power-up grenades, cannons, and more to battle evil forces. Fight alone or cooperatively with a friend in such locations as a deserted island in the South Seas, an underwater bioweapons factory, and outer space. … Expand"
  },
  {
    "name": "Momodora: Reverie Under the Moonlight",
    "details_link": "https://www.metacritic.com/game/playstation-4/momodora-reverie-under-the-moonlight",
    "publisher": "Playism",
    "release_date": "Mar 16 2017",
    "developers": [
      "Bombservice"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "Platformer",
      "Open-World",
      "Metroidvania"
    ],
    "meta_score": 76,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/5/7933550adc8f7258efc1579afcdabeae-98.jpg",
    "descriptions": "Momodora: Reverie Under the Moonlight explores a cursed land in decline. Evil spreads, the dead rise, and corruption reigns. Hope is but a faded memory for all but one, a priestess named Kaho from the village of Lun. An audience with her majesty, the queen, would surely save the land--butMomodora: Reverie Under the Moonlight explores a cursed land in decline. Evil spreads, the dead rise, and corruption reigns. Hope is but a faded memory for all but one, a priestess named Kaho from the village of Lun. An audience with her majesty, the queen, would surely save the land--but time is short and each night darker than the last. \r\rFeatures:\r *    Beautifully animated graphics\r*    Exciting action gameplay - combo, dodge and skewer enemies with arrows\r*    Intense boss battles with challenging patterns and epic scale\r*    Difficulty settings appropriate for all, from story and setting lovers to hardcore action enthusiasts\r*    A breadth of items that can be combined to create new strategies\r*    A widely varied world to explore, filled with secrets and treasures\r*    Eccentric allies and foes with compelling personalities\r*    Mysterious lore and rich backstory in events, dialog and item descriptions… Expand"
  },
  {
    "name": "The Golf Club 2",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-golf-club-2",
    "publisher": "Maximum Games",
    "release_date": "Jun 27 2017",
    "developers": [
      "HB Studios Multimedia",
      "Maximum Games"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Sports",
      "Individual",
      "Golf",
      "Arcade"
    ],
    "meta_score": 76,
    "users_score": 5.9,
    "image": "https://static.metacritic.com/images/products/games/4/b36f1e09d0b01ad761fce24c9d4da496-98.jpg",
    "descriptions": "Rise to fame and fortune in the largest, most dynamic golf game ever created. Assemble and join online societies with friends, compete in tournaments, and earn money to climb the ranks in golf's largest gaming community.\r The Golf Club 2 offers a dynamic, single-player career mode,Rise to fame and fortune in the largest, most dynamic golf game ever created. Assemble and join online societies with friends, compete in tournaments, and earn money to climb the ranks in golf's largest gaming community.\r The Golf Club 2 offers a dynamic, single-player career mode, infinite hours of interactive golfing with online opponents, a new and improved course creator, cutting-edge swing mechanics, and a host of brand new, lush environments - all blending together seamlessly to create your dream golfing experience.… Expand"
  },
  {
    "name": "Minutes",
    "details_link": "https://www.metacritic.com/game/playstation-4/minutes",
    "publisher": "Red Phantom Games",
    "release_date": "Feb 10 2015",
    "developers": [
      "Red Phantom Games"
    ],
    "platforms": [
      "PlayStation Vita",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 76,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/8/43d66e3e759da9f629bc31fff9d09951-98.jpg",
    "descriptions": "Simply explained, the player controls a circle and moves it around the screen to collect light energy shapes (for points) and avoid dark (which damage the player). The key mechanic is that the size of the circle can be changed. Go small to stay safe and dodge through the dark energy. GoSimply explained, the player controls a circle and moves it around the screen to collect light energy shapes (for points) and avoid dark (which damage the player). The key mechanic is that the size of the circle can be changed. Go small to stay safe and dodge through the dark energy. Go large to collect more light and, critically, boost your score multiplier. [Developer via Playstation Blog]… Expand"
  },
  {
    "name": "Spec Ops: The Line",
    "details_link": "https://www.metacritic.com/game/pc/spec-ops-the-line",
    "publisher": "2K Games",
    "release_date": "Jun 25 2012",
    "developers": [
      "Yager"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Tactical",
      "Modern",
      "Modern"
    ],
    "meta_score": 76,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/3/b5d9ed8048fa995f44c0020a10d76e94-98.jpg",
    "descriptions": "Spec Ops: The Line is a provocative third-person modern military shooter that challenges players' morality by putting them in the middle of unspeakable situations where unimaginable choices affecting human life must be made. Spec Ops: The Line unfolds within the destroyed opulence of Dubai.Spec Ops: The Line is a provocative third-person modern military shooter that challenges players' morality by putting them in the middle of unspeakable situations where unimaginable choices affecting human life must be made. Spec Ops: The Line unfolds within the destroyed opulence of Dubai. Once the playground for the world's wealthiest elite, Dubai has fallen victim to a series of cataclysmic sandstorms. The city's ultramodern architecture lies half-buried under millions of tons of sand. The very sand that blankets the city plays a marquee role in altering combat situations and serves as a powerful but unpredictable force that will both help and hinder players throughout the course of the game. While most people have fled the now-barren wasteland before the sandstorms swept through, U.S. Army Colonel John Konrad and his loyal squad remained behind to protect those incapable of escape. Unable to reach anyone in Dubai after the storm hit, the U.S. Army feared Konrad and his team dead until they picked up a weak distress signal and launched a rescue operation. As U.S. Army Captain Martin Walker, you and your elite Delta Force team are sent to infiltrate the treacherous region to bring Konrad home. Players experience “\"The Line,\" that razor's edge known only to men who deal in war. It is the line they cross when death and duty become one and the same. It is the end -- of self and sanity -- when their duty is done and only they remain. [2K Games]… Expand"
  },
  {
    "name": "SingStar Vol. 2",
    "details_link": "https://www.metacritic.com/game/playstation-3/singstar-vol-2",
    "publisher": "SCEA",
    "release_date": "Oct 28 2008",
    "developers": [
      "SCEE London Studio"
    ],
    "platforms": "PlayStation 3",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 76,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/4/2a5ad0c841d11a34768c973487e6553d-98.jpg",
    "descriptions": "SingStar Vol. 2 features a harmony duet mode: a new way of playing that allows two players to sing different lines to a song at the same time, showing off their harmonising skills. This is your chance to showcase your talent and adds a new dimension to the SingStar experience. Special tracksSingStar Vol. 2 features a harmony duet mode: a new way of playing that allows two players to sing different lines to a song at the same time, showing off their harmonising skills. This is your chance to showcase your talent and adds a new dimension to the SingStar experience. Special tracks have been included to showcase this new mode such as Kool and the Gang: Celebration, the Paul McCartney & the Frog Chorus: We all Stand Together and The Mamas & The Papas: California Dreamin'. SingStar Vol. 2 also includes Remote Play functionalities with PSP. Using PSP and a wireless Internet connection, players can access various areas of the game such as: SingStore: browse, select and download new songs, from SingStore remotely. This is your chance to get your favourite party tracklist ready before you're heading back home. My SingStar Online: browse and participate in all areas, rate media, leave comments, take part in polls, etc.). You can now continue to be part of the SingStar community on the go: share and show off your performances to your friends and family!… Expand"
  },
  {
    "name": "Far Cry 6 - Vaas: Insanity",
    "details_link": "https://www.metacritic.com/game/pc/far-cry-6---vaas-insanity",
    "publisher": "Ubisoft",
    "release_date": "Nov 16 2021",
    "developers": [
      "Ubisoft Toronto"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 76,
    "users_score": 4.6,
    "image": "https://static.metacritic.com/images/products/games/1/3b18a646b502e75a6cca2ec9a6797705-98.jpg",
    "descriptions": "In Vaas: Insanity, players become the Far Cry 3 villain portrayed by Michael Mando (Better Call Saul). Mando came back for the DLC, which offers an experience inspired by roguelites. Starting with nothing more than a pistol to defend themselves, players will need to find new weapons andIn Vaas: Insanity, players become the Far Cry 3 villain portrayed by Michael Mando (Better Call Saul). Mando came back for the DLC, which offers an experience inspired by roguelites. Starting with nothing more than a pistol to defend themselves, players will need to find new weapons and unlock power-ups to become stronger and progress deeper into the depths of Vaas' psyche. Blending intense action and storytelling, Vaas: Insanity will provide a unique opportunity to better understand Vaas' past, personal demons, and motivations.… Expand"
  },
  {
    "name": "SuperEpic: The Entertainment War",
    "details_link": "https://www.metacritic.com/game/switch/superepic-the-entertainment-war",
    "publisher": "Numskull Games",
    "release_date": "Dec 12 2019",
    "developers": [
      "Numskull Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 76,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/af52eaf3e6c430548018cd6afd0aa61a-98.jpg",
    "descriptions": "In a not-too-distant future dystopia​, a single videogame development company, ​Regnantcorp, controls an Orwellian society by enslaving the population with their addictive free game​s. As a rebellious racoon, along with your llama steed, you'll explore a surreal castle-like office full ofIn a not-too-distant future dystopia​, a single videogame development company, ​Regnantcorp, controls an Orwellian society by enslaving the population with their addictive free game​s. As a rebellious racoon, along with your llama steed, you'll explore a surreal castle-like office full of enemies, challenges, secrets and corporate pigs.… Expand"
  },
  {
    "name": "Sundered: Eldritch Edition",
    "details_link": "https://www.metacritic.com/game/switch/sundered-eldritch-edition",
    "publisher": "Thunder Lotus Games",
    "release_date": "Dec 21 2018",
    "developers": [
      "Thunder Lotus Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "Platformer",
      ""
    ],
    "meta_score": 76,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/0/e49d223c46c21fae2e805839d25bdbc2-98.jpg",
    "descriptions": "Sundered is a horrifying fight for survival and sanity, a hand-drawn epic from the creators of Jotun. You play Eshe, a wanderer in a ruined world, trapped in ever-changing caverns teeming with eldritch horrors. Harness the power of corrupted relics to defeat gigantic bosses, at the cost ofSundered is a horrifying fight for survival and sanity, a hand-drawn epic from the creators of Jotun. You play Eshe, a wanderer in a ruined world, trapped in ever-changing caverns teeming with eldritch horrors. Harness the power of corrupted relics to defeat gigantic bosses, at the cost of your humanity. Resist or embrace.… Expand"
  },
  {
    "name": "Deponia Doomsday",
    "details_link": "https://www.metacritic.com/game/pc/deponia-doomsday",
    "publisher": "Daedalic Entertainment",
    "release_date": "Mar  1 2016",
    "developers": [
      "Daedalic Entertainment"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 76,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/4/aefe0eafa29f91852962bc98d4a571b1-98.jpg",
    "descriptions": "Can you alter Deponia's fate? Do you have what it takes to change Rufus' past, present and future without accidently destroying the whole planet? Fight time itself in this action-packed, platypus-tastic and insanely hilarious story."
  },
  {
    "name": "Dr. Mario Express",
    "details_link": "https://www.metacritic.com/game/ds/dr-mario-express",
    "publisher": "Nintendo",
    "release_date": "Apr 20 2009",
    "developers": [
      "Arika",
      "Nintendo"
    ],
    "platforms": "DS",
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "General",
      "Puzzle",
      "Matching",
      "General"
    ],
    "meta_score": 76,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/3/ad27a082645a4d3d3c9a07917f6036dc-98.jpg",
    "descriptions": "[DSiWare]  Mario once again dons his stethoscope to battle the forces of illness in this downloadable version of the classic puzzle game. Use vitamins to eliminate viruses in Classic mode, or play against a computer opponent in Vs. CPU mode. Make an appointment with Dr. Mario today. [Nintendo]"
  },
  {
    "name": "Ever Oasis",
    "details_link": "https://www.metacritic.com/game/3ds/ever-oasis",
    "publisher": "Nintendo",
    "release_date": "Jun 23 2017",
    "developers": [
      "GREZZO"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 76,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/2/99c15fba3e05fa842afd3e9635d8cff4-98.jpg",
    "descriptions": "Explore the world to expand your oasis - and your adventuring horizons. From the team behind The Legend of Zelda: Majora's Mask 3D comes a daring new adventure that expands on everything RPG fans love about the genre. As a chosen Seedling, your mission is to build a prosperous oasis byExplore the world to expand your oasis - and your adventuring horizons. From the team behind The Legend of Zelda: Majora's Mask 3D comes a daring new adventure that expands on everything RPG fans love about the genre. As a chosen Seedling, your mission is to build a prosperous oasis by working with your partner, lsuna. Meet and ally with members of other tribes to complete your mission, while battling against the Chaos threatening peace in the desert. Battle enemies in real-time combat as you switch between three party members and explore a savage desert. Forage for materials in caves and puzzle-filled dungeons to earn dewadems, which are used to grow new shops and even grow gear!\r Features:\r *    Dive into a new take on the Adventure RPG genre in a brand new IP.\r*    Explore a savage desert, deep caves, and puzzle-filled dungeons.\r*    Forage materials to make products at shops, or synthesize equipment and items at your treehouse.\r*    Complete missions to recruit new villagers, each with their own shops, weapons and abilities, then bring them exploring/foraging.\r*    Earn dewadem, currency, over time as shops sell their wares to build new Bloom Booths.\r*    Developed by GREZZO Co., Ltd. the team behind The Legend of Zelda: Majora's Mask 3D\r*    Battle wildlife that are possessed by Chaos and other enemies in real-time combat, while actively switching between party members.\r*    Immerse into a beautifully created world inspired by Egyptian culture/mythology.… Expand"
  },
  {
    "name": "Final Fantasy IX",
    "details_link": "https://www.metacritic.com/game/switch/final-fantasy-ix",
    "publisher": "Square Enix",
    "release_date": "Feb 13 2019",
    "developers": [
      "SquareSoft",
      "Square Enix"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 76,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/3/d8930ce0c1ef2b77f66a6b7e3aaa14d4-98.jpg",
    "descriptions": "The last Final Fantasy for the PlayStation, Final Fantasy IX returns to the pure fantasy roots that spawned the series. This latest installment features highly detailed characters, vehicles, and environments, and breathtaking cinema-graphics. The addition of brand new features such as theThe last Final Fantasy for the PlayStation, Final Fantasy IX returns to the pure fantasy roots that spawned the series. This latest installment features highly detailed characters, vehicles, and environments, and breathtaking cinema-graphics. The addition of brand new features such as the story-enhancing Active Time Event system and the return of minigames that grant additional gameplay make Final Fantasy IX not only a memorable gaming experience, but also a significant step forward in the series.… Expand"
  },
  {
    "name": "Rocketbirds: Hardboiled Chicken",
    "details_link": "https://www.metacritic.com/game/playstation-vita/rocketbirds-hardboiled-chicken",
    "publisher": "Ratloop Asia Pte Ltd",
    "release_date": "Feb 12 2013",
    "developers": [
      "Ratloop Asia Pte Ltd"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Adventure",
      "General",
      "General",
      "Platformer",
      "2D"
    ],
    "meta_score": 76,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/9/17e89b79d4236e43f13988e2ffe6154e-98.jpg",
    "descriptions": "Rocketbirds: Hardboiled Chicken builds upon the browser-based game Rocketbirds: Revolution! and expands the Rocketbirds universe with new characters, missions, puzzles, exclusive music videos, retro cut scenes and more. Set in Albatropolis, a land full of birds taken over by a totalitarianRocketbirds: Hardboiled Chicken builds upon the browser-based game Rocketbirds: Revolution! and expands the Rocketbirds universe with new characters, missions, puzzles, exclusive music videos, retro cut scenes and more. Set in Albatropolis, a land full of birds taken over by a totalitarian penguin regime, Hardboiled Chicken, the original Coq of War, must assassinate the evil penguin leader Putzki.  His mission will unlock the secrets to his mysterious, hard boiled past and uncover the real enemies of Albatropolis.  In single-player mode, take on the role of Hardboiled Chicken and destroy your enemies with a slew of weapons you collect and unlock in each chapter. Master fowl play in the co-op campaign as a pair of Budgie commandos on a mission to save the general's daughter.  Many lives will be destroyed, countless penguins will die, and an astonishing past will be unveiled through a series of unlockable cut scenes and videos.  … Expand"
  },
  {
    "name": "Hyper Light Drifter",
    "details_link": "https://www.metacritic.com/game/xbox-one/hyper-light-drifter",
    "publisher": "Heart Machine",
    "release_date": "Jul 26 2016",
    "developers": [
      "Heart Machine"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 76,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/6/e63ed908eb4f00aed87e7e1a228edbc5-98.jpg",
    "descriptions": "Explore a beautiful, vast and ruined world riddled with unknown dangers and lost technologies. Inspired by nightmares and dreams alike."
  },
  {
    "name": "Final Fantasy Fables: Chocobo's Dungeon",
    "details_link": "https://www.metacritic.com/game/wii/final-fantasy-fables-chocobos-dungeon",
    "publisher": "Square Enix",
    "release_date": "Jul  8 2008",
    "developers": [
      "h.a.n.d. Inc."
    ],
    "platforms": "Wii",
    "num_players": "2  Online",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG",
      "Roguelike"
    ],
    "meta_score": 76,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/95cacfc59a854d9af620e8819d801e50-98.jpg",
    "descriptions": "Chocobo and Cid, Final Fantasy mainstays-turned-treasure hunters, are magically transported to a mysterious town whose people’s memories are lost with each bell toll of the clocktower. One day, a strange boy named Raffaello arrives and creates dungeons of memories to help the townspeopleChocobo and Cid, Final Fantasy mainstays-turned-treasure hunters, are magically transported to a mysterious town whose people’s memories are lost with each bell toll of the clocktower. One day, a strange boy named Raffaello arrives and creates dungeons of memories to help the townspeople remember who they are. Now it's up to Chocobo to journey through the dungeons and retrieve everyone's memories! A gaming experience utilizing a variety of classic FINAL FANTASY job classes such as the knight, black mage and white mage to aid Chocobo in his fight against evil. Duel against friends via Nintendo Wi-Fi Connection in addictive card battles featuring popular FINAL FANTASY creatures in a unique 3D pop-up book style. Collect hidden letters throughout the adventure and form special phrases to unlock secret dungeons and job classes. The signature Mog House offers arcade-style mini-games that can be played with intuitive Wii Remote controls. [Square Enix]… Expand"
  },
  {
    "name": "Phantasy Star Collection",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/phantasy-star-collection",
    "publisher": "THQ",
    "release_date": "Nov 24 2002",
    "developers": [
      "Digital Eclipse"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 76,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/9/8d2d40e17ba285d1d8a67328c6f9f9bc-98.jpg",
    "descriptions": "Relive the series that revolutionized RPG gaming!  Explore the vast Algo Solar System and do battle with an arsenal of weapons, magical spells, and armor.  Defeat the evil King Lassic to restore peace to the galaxy!  Uncover the shocking secrets of the Motavian society!  Live through threeRelive the series that revolutionized RPG gaming!  Explore the vast Algo Solar System and do battle with an arsenal of weapons, magical spells, and armor.  Defeat the evil King Lassic to restore peace to the galaxy!  Uncover the shocking secrets of the Motavian society!  Live through three generations to conquer monstrous mutations!… Expand"
  },
  {
    "name": "Beach Spikers: Virtua Beach Volleyball",
    "details_link": "https://www.metacritic.com/game/gamecube/beach-spikers-virtua-beach-volleyball",
    "publisher": "Sega",
    "release_date": "Aug 12 2002",
    "developers": [
      "Sega AM2"
    ],
    "platforms": "GameCube",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Volleyball"
    ],
    "meta_score": 76,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/0/2b515615037697c75c3eef5755520af0-98.jpg",
    "descriptions": "Beach Spikers delivers intense beach volleyball action for up to four players, and it showcases beautiful female athletes as they battle it out under the summer sun. You must cooperate and compete as you take control of bikini-clad athletes and go two-on-two at the net. Those craving aBeach Spikers delivers intense beach volleyball action for up to four players, and it showcases beautiful female athletes as they battle it out under the summer sun. You must cooperate and compete as you take control of bikini-clad athletes and go two-on-two at the net. Those craving a deeper experience can create their own athlete and teammate and enter the all-new World Tour mode. With each win, you'll compete to earn attributes and use a mixture of encouragements and insults to develop your teammate's AI.… Expand"
  },
  {
    "name": "High Heat Major League Baseball 2002",
    "details_link": "https://www.metacritic.com/game/playstation-2/high-heat-major-league-baseball-2002",
    "publisher": "3DO",
    "release_date": "Mar 26 2001",
    "developers": [
      "3DO"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Baseball",
      "Sim"
    ],
    "meta_score": 76,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/9/ce9246a511d99ba1af618b4829a135dd-98.jpg",
    "descriptions": "The 2001 PS2 game for baseball purists who prefer a realistic simulation to eye-popping graphics."
  },
  {
    "name": "The Final Station",
    "details_link": "https://www.metacritic.com/game/pc/the-final-station",
    "publisher": "tinyBuild",
    "release_date": "Aug 30 2016",
    "developers": [
      "tinyBuild",
      "Do My Best Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General",
      "Linear"
    ],
    "meta_score": 76,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/6/b78b3dccf4c7cbd50a67e170b6765ff6-98.jpg",
    "descriptions": "Travel by train through a dying world. Look after your passengers, keep your train operational, and make sure you can always reach the next station. Make your way through swarms of infected at each station. Explore mysterious and abandoned stations looking for supplies and survivors."
  },
  {
    "name": "EA Sports UFC 2",
    "details_link": "https://www.metacritic.com/game/xbox-one/ea-sports-ufc-2",
    "publisher": "Electronic Arts",
    "release_date": "Mar 15 2016",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "2 ",
    "genres": [
      "Sports",
      "General",
      "Individual",
      "Combat",
      "Boxing / Martial Arts"
    ],
    "meta_score": 76,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/1/fc99ab8d8e7a861f6b3699f165934f99-98.jpg",
    "descriptions": "A new physics-driven hit reaction and knockout system delivers more visceral KOs than before. Every knockout is now unique. Simultaneous two-fighter interaction brings the ground game to life with greater responsiveness and variety. Surprise your opponent with a flying armbar from theA new physics-driven hit reaction and knockout system delivers more visceral KOs than before. Every knockout is now unique. Simultaneous two-fighter interaction brings the ground game to life with greater responsiveness and variety. Surprise your opponent with a flying armbar from the clinch, or with a quick transition from a knee bar to a heel hook. Standing submissions and submission chaining have been added.  Add an improved blocking and parrying system to the mix and you have new tools to fend off your opponent’s most devastating attacks.… Expand"
  },
  {
    "name": "Pillars of Eternity: The White March - Part 1",
    "details_link": "https://www.metacritic.com/game/pc/pillars-of-eternity-the-white-march---part-1",
    "publisher": "Paradox Interactive",
    "release_date": "Aug 25 2015",
    "developers": [
      "Obsidian Entertainment"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Western-Style"
    ],
    "meta_score": 76,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/5/2110315b4bd0d49e251beafe142a5a56-98.jpg",
    "descriptions": "Pillars of Eternity: The White March - Part I is a sprawling expansion pack with hours of gameplay integrated into the main adventure. Along with the new quests and area content, the add-on includes additions of Player Party AI and Enhanced Enemy AI."
  },
  {
    "name": "Dying Light 2 Stay Human",
    "details_link": "https://www.metacritic.com/game/playstation-5/dying-light-2-stay-human",
    "publisher": "Square Enix",
    "release_date": "Feb  4 2022",
    "developers": [
      "Techland"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 76,
    "users_score": 5.0,
    "image": "https://static.metacritic.com/images/products/games/4/36196cf4526a7271fb645bddbfe26087-98.jpg",
    "descriptions": "THE FATE OF THE CITY IS IN YOUR HANDS It's been 15 years since humanity lost to the virus. The last great human settlement exists within an unforgiving, infected world, plunged into a modern dark age. During the day, bandits, factions and starving survivors roam the streets scavenging forTHE FATE OF THE CITY IS IN YOUR HANDS It's been 15 years since humanity lost to the virus. The last great human settlement exists within an unforgiving, infected world, plunged into a modern dark age. During the day, bandits, factions and starving survivors roam the streets scavenging for scraps - or someone to take them from, by violence if necessary. At night the infected roam free, evacuating their dark hideouts to prey on the living. You are Aiden Caldwell, an infected survivor. Your exceptional agility and brutal combat skills make you a powerful ally and a valuable commodity in this dangerous world. You can achieve things no one else can. Enter places no one else dares. With your unique abilities you have the power to be an agent of change within this decaying metropolis.\r YOUR CHOICES, YOUR WORLD\rYou must make tough decisions and hard sacrifices as you decide the fate of a society on the brink of collapse. The effect of the choices you make will have a huge impact on entire regions of the city, uncovering new land masses and areas to explore. Play the entire campaign in up to four-player co-op. Host your own games or join other players' and see how their choices have played out differently to your own.\r EXCEPTIONAL AGILITY AND BRUTAL COMBAT\rOn your journey from humble beginnings to a person of great power, you have unprecedented freedom of movement across the city, seamlessly integrated with brutal first person combat.\r A MODERN DARK AGE\rIn a desperate city, where resources and power are scarce, unstable, and trust in ruling bodies is all but eroded; humankind has reverted to a dark age. Civilization is gone but the relics are still there. This is a violent, primal & unforgiving world - and so are its inhabitants.\r THE INFECTION HAS EVOLVED\rThe infection has evolved and become more sensitive to UV light. Society exists in the relative safety of sunlight, while the infected hide in the shadows of buildings. At night the infected roam the streets freely searching for prey, presenting opportunities for you to explore areas of the city inaccessible by day.… Expand"
  },
  {
    "name": "MVP 06 NCAA Baseball",
    "details_link": "https://www.metacritic.com/game/playstation-2/mvp-06-ncaa-baseball",
    "publisher": "EA Sports",
    "release_date": "Jan 18 2006",
    "developers": [
      "EA Canada"
    ],
    "platforms": "PlayStation 2",
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Baseball",
      "Sim"
    ],
    "meta_score": 76,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/6/5471ac02c82ef7aea8c0a47c2820a04f-98.jpg",
    "descriptions": "This new version of the best-selling and critically acclaimed MVP Baseball franchise celebrates everything that makes NCAA baseball unique – aluminum bats, intense action, and stadiums filled with school spirit and packed with passionate fans. MVP 06 NCAA Baseball debuts new batting andThis new version of the best-selling and critically acclaimed MVP Baseball franchise celebrates everything that makes NCAA baseball unique – aluminum bats, intense action, and stadiums filled with school spirit and packed with passionate fans. MVP 06 NCAA Baseball debuts new batting and throwing systems, the nation's top universities and conferences, and a deep college-specific Dynasty Mode that takes you on the \"Road to Omaha\" with baseball's brightest young stars. Complete with an engaging visual presentation and ESPN's Mike Patrick and former Stanford All-American Kyle Peterson calling the action, MVP 06 NCAA Baseball features an all-new Custom Ballpark feature and a robust Create a Player option. The game also includes exclusive new online features for the PlayStation2 computer entertainment system and Xbox Live. [Electronic Arts]… Expand"
  },
  {
    "name": "Room to Grow",
    "details_link": "https://www.metacritic.com/game/pc/room-to-grow",
    "publisher": "Mischka Kamener",
    "release_date": "Feb 25 2021",
    "developers": [
      "Mischka Kamener"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "General"
    ],
    "meta_score": 76,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/2/4bc60fcd8ae46516a95b9f7974752eaa-98.jpg",
    "descriptions": "Tackle thorny problems in this plant pushing puzzle game. Learn to maneuver like a cactus as you grow your way back to the desert!"
  },
  {
    "name": "The Survivalists",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-survivalists",
    "publisher": "Team17",
    "release_date": "Oct  9 2020",
    "developers": [
      "Team17"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 76,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/9/4e5779dd2c27194416dea9300e4106a3-98.jpg",
    "descriptions": "A living world full of surprises, secrets and danger awaits in The Survivalists, an adventure-filled survival sandbox set in The Escapists universe. Explore, build, craft and even train monkeys with up to three friends in a desperate bid to survive. Have you got what it takes to be a Survivalist?"
  },
  {
    "name": "Bombslinger",
    "details_link": "https://www.metacritic.com/game/switch/bombslinger",
    "publisher": "Mode4",
    "release_date": "Apr 11 2018",
    "developers": [
      "Mode4"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "Action"
    ],
    "meta_score": 76,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/9/bcfefb5ad55de29995458fcc9952cffd-98.jpg",
    "descriptions": "A Bomberman-inspired Spaghetti Western action game with rogue-like elements.Wear the poncho of the Bombslinger, a former ruthless bandit turned rancher, as he sets out on a journey to avenge the brutal murder of his wife. Bomb your way through hordes of enemies, defeat your former posse andA Bomberman-inspired Spaghetti Western action game with rogue-like elements.Wear the poncho of the Bombslinger, a former ruthless bandit turned rancher, as he sets out on a journey to avenge the brutal murder of his wife. Bomb your way through hordes of enemies, defeat your former posse and get to the final showdown with its leader, the Gunslinger.… Expand"
  },
  {
    "name": "Skylanders SuperChargers",
    "details_link": "https://www.metacritic.com/game/xbox-one/skylanders-superchargers",
    "publisher": "Activision",
    "release_date": "Sep 20 2015",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "PlayStation 4",
      "Wii U",
      "Xbox 360",
      "Xbox One"
    ],
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 76,
    "users_score": 5.3,
    "image": "https://static.metacritic.com/images/products/games/8/986e4a8d22588612088799699bf68313-98.jpg",
    "descriptions": "Skylanders SuperChargers features a brand-new class of heroes, called SuperChargers who are distinct with fresh moves, powerful attacks and all-new weapons.  These SuperChargers also have special in-game abilities that help Portal Masters fight Kaos.  Twenty new SuperChargers character toysSkylanders SuperChargers features a brand-new class of heroes, called SuperChargers who are distinct with fresh moves, powerful attacks and all-new weapons.  These SuperChargers also have special in-game abilities that help Portal Masters fight Kaos.  Twenty new SuperChargers character toys and 20 new vehicle toys will be available.… Expand"
  },
  {
    "name": "Brave Story: New Traveler",
    "details_link": "https://www.metacritic.com/game/psp/brave-story-new-traveler",
    "publisher": "XSEED Games",
    "release_date": "Jul 31 2007",
    "developers": [
      "Game Republic"
    ],
    "platforms": "PSP",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "General",
      "General",
      "Japanese-Style"
    ],
    "meta_score": 76,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/4/3232aac27cd70eae8e3a7c34fdbd6eaa-98.jpg",
    "descriptions": "On a day that starts out like any other, an 11-year-old boy's life is changed forever. As the main character and his friend Miki pass a leisurely afternoon, Miki suddenly collapses from an unknown illness. When the girl shows no sign of waking, the main character grows distraught over notOn a day that starts out like any other, an 11-year-old boy's life is changed forever. As the main character and his friend Miki pass a leisurely afternoon, Miki suddenly collapses from an unknown illness. When the girl shows no sign of waking, the main character grows distraught over not being a better friend and not having the means to save her. Suddenly, a strange voice offers him a second chance: \"Beyond the door you can change your destiny!\" He soon leaves the real world and journeys to the world of Vision, where, as a novice \"Traveler,\" he will surmount myriad ordeals in hopes of ultimately meeting with the Goddess of Fortune to have a single wish granted. The would-be hero quickly makes friends both strange and fascinating as he finds himself blossoming into a successful Traveler. His courage and resolve are tested time and again as he and his newfound companions travel the mysterious lands of Vision. The challenges he faces are daunting, but his growing sense of self and responsibility propel him ever forward. Valuable friendships, unbounded courage, and his own personal growth will all prove indispensable as he seeks out his destiny: a life-changing adventure and the discovery of a hero inside an ordinary kid. [XSEED]… Expand"
  },
  {
    "name": "ATV Offroad Fury Pro",
    "details_link": "https://www.metacritic.com/game/psp/atv-offroad-fury-pro",
    "publisher": "SCEA",
    "release_date": "Oct 26 2006",
    "developers": [
      "Climax Group",
      "Climax Studios"
    ],
    "platforms": "PSP",
    "num_players": "4  Online",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Rally / Offroad",
      "Rally / Offroad",
      "Automobile"
    ],
    "meta_score": 76,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/4/676cfe1e1531578560bf626ba59f83cb-98.jpg",
    "descriptions": "Supporting up to four players via wireless multiplayer connectivity, players will speed through more than 30 visually stunning environments with six distinct terrain types including snow, dirt, mud, ice, water, and grass. Featuring five new events, new vehicles and mini-games, and crossSupporting up to four players via wireless multiplayer connectivity, players will speed through more than 30 visually stunning environments with six distinct terrain types including snow, dirt, mud, ice, water, and grass. Featuring five new events, new vehicles and mini-games, and cross compatibility with ATV Offroad Fury 4 for the PlayStation2, ATV Offroad Fury Pro will provide players the opportunity to tackle the trickiest off-road courses anytime, anywhere. [SCEA]… Expand"
  },
  {
    "name": "Fallout 3: The Pitt",
    "details_link": "https://www.metacritic.com/game/xbox-360/fallout-3-the-pitt",
    "publisher": "Bethesda Softworks",
    "release_date": "Mar 23 2009",
    "developers": [
      "Bethesda Game Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 76,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/7/1db364b8cd1b3b011967850efc356290-98.jpg",
    "descriptions": "[Downloadable Content]  Pittsburgh was once the industrial center of the pre-war world. The city was spared the horrors of nuclear fire, only to have its people infected by a nightmare plague of disease, infection, and mutation.  Travel to the ruins of this industrial city, now called The[Downloadable Content]  Pittsburgh was once the industrial center of the pre-war world. The city was spared the horrors of nuclear fire, only to have its people infected by a nightmare plague of disease, infection, and mutation.  Travel to the ruins of this industrial city, now called The Pitt, and discover a secret that could send shockwaves through the entire Wasteland. Battle vicious mutated Trogs, employ deadly new weapons like the AutoAxe and Infiltrator silenced assault rifle, and decide the fate of the infected slaves and slavers that call this city home. [Bathesda Softworks]… Expand"
  },
  {
    "name": "Neo Cab",
    "details_link": "https://www.metacritic.com/game/pc/neo-cab",
    "publisher": "Chance Agency",
    "release_date": "Oct  3 2019",
    "developers": [
      "Chance Agency"
    ],
    "platforms": [
      "iPhone/iPad",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 76,
    "users_score": 5.5,
    "image": "https://static.metacritic.com/images/products/games/9/c832c0d8f6322cafabbd061a79970b1a-98.jpg",
    "descriptions": "Stay human in a world overcome by automation. Play as Lina, one of the last human driver-for-hire on the streets of Los Ojos. Your friend and only lifeline has gone missing; with no money and nowhere to stay, the only thing you can do is keep driving."
  },
  {
    "name": "Hot Shots Golf: World Invitational",
    "details_link": "https://www.metacritic.com/game/playstation-vita/hot-shots-golf-world-invitational",
    "publisher": "SCEA",
    "release_date": "Feb  7 2012",
    "developers": [
      "Clap Hanz"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation Vita"
    ],
    "num_players": "Up to 30 ",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Golf",
      "Arcade",
      "Arcade"
    ],
    "meta_score": 76,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/6/7b05ac397127a497b53a6ebd363e6031-98.jpg",
    "descriptions": "The over-the-top golf franchise is back using a wide array of PS Vita system features including front and rear touch for shot preparation, 3G asynchronous gameplay, online tournaments, and the ability to peruse the course in real time. [Sony]"
  },
  {
    "name": "The Sims 3",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-sims-3",
    "publisher": "Electronic Arts",
    "release_date": "Oct 26 2010",
    "developers": [
      "The Sims Studio"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "Virtual Life",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 76,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/8/43a747aa5678e3b32e9c55ed72fa29d0-98.jpg",
    "descriptions": "With The Sims 3 for consoles and handheld, create Sims with unique personalities, fulfill their desires...or not, and control their lives within a living neighborhood. Customize your Sims’ appearance and choose up to five traits to create individual personalities. From the “Romantic” traitWith The Sims 3 for consoles and handheld, create Sims with unique personalities, fulfill their desires...or not, and control their lives within a living neighborhood. Customize your Sims’ appearance and choose up to five traits to create individual personalities. From the “Romantic” trait or “kleptomaniac” trait to “evil” trait, create millions of unique Sims. All-new features make it easier than ever to mess with life as you unlock the ultimate “Karma Powers” for instant control and unleash them on your Sims. New goal-oriented game play enables you to choose which short or long-term objectives you want your Sims to pursue and even determine your Sims’ destinies in life.  Get inspired by the endless creative possibilities and unexpected moments of surprise and mischief in The Sims 3. [Electronic Arts]… Expand"
  },
  {
    "name": "Broken Lines",
    "details_link": "https://www.metacritic.com/game/pc/broken-lines",
    "publisher": "SUPER.COM",
    "release_date": "Feb 25 2020",
    "developers": [
      "PortaPlay"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Tactics"
    ],
    "meta_score": 76,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/3/82626de472b35a817c33f6858fa39e12-98.jpg",
    "descriptions": "Broken Lines is a story-driven tactical RPG set in an alternate-history version of World War II. It’s a game about a group of eight soldiers who crash-land behind enemy lines. It’s up to you to lead them home while fending off the enemy and helping them deal with the horrors of war."
  },
  {
    "name": "Plants vs. Zombies: Battle for Neighborville",
    "details_link": "https://www.metacritic.com/game/xbox-one/plants-vs-zombies-battle-for-neighborville",
    "publisher": "Electronic Arts",
    "release_date": "Oct 18 2019",
    "developers": [
      "PopCap"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "Up to 24 ",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Tactical"
    ],
    "meta_score": 76,
    "users_score": 5.5,
    "image": "https://static.metacritic.com/images/products/games/5/19951b9ce5235366b4a3db30e3ffc104-98.jpg",
    "descriptions": "Welcome to Neighborville, where all is well. Except that a crazy new coniferous conflict between brain-less and botanicals is brewing! What are you gonna do – call the crops? Soil your plants? It’s time to kick some grass in the wackiest shooter experience between plants and zombies yet:Welcome to Neighborville, where all is well. Except that a crazy new coniferous conflict between brain-less and botanicals is brewing! What are you gonna do – call the crops? Soil your plants? It’s time to kick some grass in the wackiest shooter experience between plants and zombies yet: Plants vs. Zombies: Battle for Neighborville™.… Expand"
  },
  {
    "name": "Bit.Trip Runner",
    "details_link": "https://www.metacritic.com/game/wii/bittrip-runner",
    "publisher": "Aksys Games",
    "release_date": "May 17 2010",
    "developers": [
      "Gaijin Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Wii"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 76,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/9/352fd2507f6cef6437e0a3338374a788-98.jpg",
    "descriptions": "[WiiWare]  Race across the moon, kicking down crystal walls and sliding under chomping moon-slugs. Bound through the Robotic Mines and face off against the MinerMech. Dash through the Big City on a quest to find friends and defeat the final boss together. RUNNER is the fourth entry in the[WiiWare]  Race across the moon, kicking down crystal walls and sliding under chomping moon-slugs. Bound through the Robotic Mines and face off against the MinerMech. Dash through the Big City on a quest to find friends and defeat the final boss together. RUNNER is the fourth entry in the award-winning and critically acclaimed BIT.TRIP  series. You control CommanderVideo as he runs, jumps, slides and kicks. With exciting modern and retro challenges, you can move through more than 50 levels of game play. Chiptune supergroup Anamanaguchi makes a guest appearance. Join CommanderVideo on his most epic journey yet! [Aksys]… Expand"
  },
  {
    "name": "Overwatch 2",
    "details_link": "https://www.metacritic.com/game/playstation-5/overwatch-2",
    "publisher": "Blizzard Entertainment",
    "release_date": "Oct  4 2022",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 76,
    "users_score": 1.8,
    "image": "https://static.metacritic.com/images/products/games/9/d5499a91dfc3e73a121b921739d59700-98.jpg",
    "descriptions": "Reunite and stand together in a new age of heroes. Overwatch 2 builds on an award-winning foundation of epic competitive play, and challenges the world's heroes to team up, power up, and take on an overwhelming outbreak of threats around the globe.\r Overwatch 2 evolves the look and feel ofReunite and stand together in a new age of heroes. Overwatch 2 builds on an award-winning foundation of epic competitive play, and challenges the world's heroes to team up, power up, and take on an overwhelming outbreak of threats around the globe.\r Overwatch 2 evolves the look and feel of the world, with more dynamic environments, larger scale battles, additional in-game storytelling events, and improved atmospheric effects and shadows. Heroes in Overwatch 2 will also have a brand-new look, with greater detail and higher fidelity.\r In Push, a new, symmetrical map type that will launch with Overwatch 2, teams battle to take control of a robot that begins in a central location, then push it toward the enemy base. Either team may take control of the robot at any time. The team that pushes the robot furthest onto the enemy side wins the game.\r Play an active role in the next chapter of the Overwatch saga through a series of intense four-player missions. Fight back against Null Sector, uncover the motives behind the omnic attacks, and confront a rising wave of new threats.\r Your accomplishments and loot collections will be carried forward to Overwatch 2. That means you'll keep your skins, player icons, sprays, emotes, and more!\r Current Overwatch players will battle side-by-side with Overwatch 2 players in PvP multiplayer; they'll also be able to play Overwatch 2 heroes and maps.… Expand"
  },
  {
    "name": "Ys Origin",
    "details_link": "https://www.metacritic.com/game/pc/ys-origin",
    "publisher": "XSEED Games",
    "release_date": "May 31 2012",
    "developers": [
      "Falcom"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 76,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/e49e3acffff2d9b7b043dd4f61ce3433-98.jpg",
    "descriptions": "Ys Origin is a game that takes place 700 years before the events of Ys I & II."
  },
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  {
    "name": "Rhythm Thief & the Emperor's Treasure",
    "details_link": "https://www.metacritic.com/game/3ds/rhythm-thief-the-emperors-treasure",
    "publisher": "Sega",
    "release_date": "Jul 10 2012",
    "developers": [
      "Sega",
      "Xeen"
    ],
    "platforms": "3DS",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Puzzle",
      "General",
      "Music",
      "Music"
    ],
    "meta_score": 76,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/5/94ef2b0a3e10f18359f7cdee20a2600b-98.jpg",
    "descriptions": "\"Rhythm Thief & the Emperor's Treasure blends rhythm, puzzles and a compelling story set in one of the world's most exciting cities in a way that has never been seen before,\"says Gary Knight, Senior Vice President of Marketing at SEGA Europe and SEGA of America. \"This\"Rhythm Thief & the Emperor's Treasure blends rhythm, puzzles and a compelling story set in one of the world's most exciting cities in a way that has never been seen before,\"says Gary Knight, Senior Vice President of Marketing at SEGA Europe and SEGA of America. \"This unique blend makes creative use of the Nintendo 3DS' technology, offering an engaging, challenging and most importantly fun experience throughout.\r Rhythm Thief & the Emperor's Treasure sees players enter the secret life of Raphael, infamous among Parisians as an honorable thief for stealing famous works of art only to return them days later. Dive into Raphael's world and help him find the Wristlet of Tiamat to unmask the mystery behind his father's disappearance. While unravelling the truth players will encounter an assortment of different rhythm challenges to master. Tap the screen, swipe the stylus and control the gyro to the beat of the music to maneuver Raphael through the unique streets of Paris, brought to life by stylish animations and vibrant 3D maps and landscapes.… Expand"
  },
  {
    "name": "Subnautica: Below Zero",
    "details_link": "https://www.metacritic.com/game/switch/subnautica-below-zero",
    "publisher": "Bandai Namco Games",
    "release_date": "May 14 2021",
    "developers": [
      "Unknown Worlds Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Adventure",
      "General",
      "Sandbox"
    ],
    "meta_score": 76,
    "users_score": 4.9,
    "image": "https://static.metacritic.com/images/products/games/5/6fa1e1951bfc0e35e2b69b8f84b33528-98.jpg",
    "descriptions": "Below Zero is an underwater adventure game set on an alien ocean world. It is a new chapter in the Subnautica universe and developed by Unknown Worlds. Return to planet 4546B. Dive into a freezing underwater adventure. Below Zero is set in an arctic region of planet 4546B. As a scientistBelow Zero is an underwater adventure game set on an alien ocean world. It is a new chapter in the Subnautica universe and developed by Unknown Worlds. Return to planet 4546B. Dive into a freezing underwater adventure. Below Zero is set in an arctic region of planet 4546B. As a scientist posted to a research station on the planet's surface, you are tasked with studying alien artifacts...\r The Vesper space station orbits high above you, sending supplies, instructions, and receiving samples you launch from the surface.When disaster strikes the research station, you must improvise to survive: Construct habitats, scavenge for resources, hunt for food, and craft equipment.… Expand"
  },
  {
    "name": "Pumpkin Jack",
    "details_link": "https://www.metacritic.com/game/playstation-4/pumpkin-jack",
    "publisher": "Headup Games",
    "release_date": "Feb 24 2021",
    "developers": [
      "Nicolas Meyssonnier"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 76,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/4/044d3f1786676d858f9bb1f9b2bcdcf4-98.jpg",
    "descriptions": "Pumpkin Jack is a Spooky Scary 3D platformer in which you embody Jack, the Mythical Pumpkin Lord! Dive into an Epic Adventure through otherworldly landscapes and help the Evil annihilate the Good!"
  },
  {
    "name": "7th Dragon III Code: VFD",
    "details_link": "https://www.metacritic.com/game/3ds/7th-dragon-iii-code-vfd",
    "publisher": "Sega",
    "release_date": "Jul 12 2016",
    "developers": [
      "Sega"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "General",
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 76,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/00e0d0021893d5444cabd6f0af11802f-98.jpg",
    "descriptions": "In the year 2100, dragons have descended upon earth and humanity is at the mercy of these terrifying beasts. However, not all is lost. As the protagonist, the player will team up with Nodens Enterprises-a video game company dedicated to stopping the dragon menace-to become a dragon hunterIn the year 2100, dragons have descended upon earth and humanity is at the mercy of these terrifying beasts. However, not all is lost. As the protagonist, the player will team up with Nodens Enterprises-a video game company dedicated to stopping the dragon menace-to become a dragon hunter and eventual savior of the universe. Although times are bleak, Nodens Enterprises has found a way to tip the scales in favor of mankind: By traveling through time to three different eras, the protagonist can upset the balance of the dragons' power. This will give them the edge to defeat the True Dragons, and stand a chance against the most powerful one of them all... the 7th Dragon: VFD.… Expand"
  },
  {
    "name": "The Ship",
    "details_link": "https://www.metacritic.com/game/pc/the-ship",
    "publisher": "Merscom LLC",
    "release_date": "Jul 11 2006",
    "developers": [
      "Outerlight"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Historic",
      "Historic",
      "Arcade"
    ],
    "meta_score": 76,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/6/9c3da77d82a38570dc82391ca26e038c-98.jpg",
    "descriptions": "The Ship is primarily a multiplayer, online murder game with a unique set of game rules. The Ship is owned by the mysterious Mr X and as one of many \"lucky\" recipients of a free ticket you arrive on board The Ship to find there's a catch to your luxury cruise. You are coerced into a brutalThe Ship is primarily a multiplayer, online murder game with a unique set of game rules. The Ship is owned by the mysterious Mr X and as one of many \"lucky\" recipients of a free ticket you arrive on board The Ship to find there's a catch to your luxury cruise. You are coerced into a brutal Hunt to indulge Mr. X's fantasies, under threat of death for not only yourself, but also your family. Your only chance to save yourself and your family is to play the Hunt and win. [Outerlight]… Expand"
  },
  {
    "name": "EverQuest II: Kingdom of Sky",
    "details_link": "https://www.metacritic.com/game/pc/everquest-ii-kingdom-of-sky",
    "publisher": "Sony Online Entertainment",
    "release_date": "Feb 21 2006",
    "developers": [
      "Sony Online Entertainment"
    ],
    "platforms": "PC",
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Fantasy",
      "Fantasy"
    ],
    "meta_score": 76,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/8/0dfe59526c26276b982670380bad8872-98.jpg",
    "descriptions": "High above the mightiest peaks of Norrath a secret world exists. This Overrealm, made up of enormous islands of land suspended in the air, is home to aviaks and creatures never-before seen, but it is the splintered and warring dragons who rule it. Higher level advancement - now reach levelHigh above the mightiest peaks of Norrath a secret world exists. This Overrealm, made up of enormous islands of land suspended in the air, is home to aviaks and creatures never-before seen, but it is the splintered and warring dragons who rule it. Higher level advancement - now reach level 70 as an adventurer or artisan. All-new Achievement system to further specialize your character's abilities. Guild advancement expanded to level 50. Four new arena champions and two new arenas. All new Heritage Quests allow players to gain amazingly powerful items, personal status, adventure experience and even a reward made famous in the original EverQuest or EverQuest Online Adventures. Signature Quests which reward large experience bonuses, personal status, entirely new items, and advance the lore of EverQuest II. Brand new pieces of armor, such as Profession Hats, Helmets and Pauldrons, will make your character look more distinct. [Sony Online Entertainment]… Expand"
  },
  {
    "name": "Project: Snowblind",
    "details_link": "https://www.metacritic.com/game/pc/project-snowblind",
    "publisher": "Eidos Interactive",
    "release_date": "Mar 15 2005",
    "developers": [
      "Nixxes Software"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "16  Online",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 76,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/4/0895726d2d155c42c9585cdafdbef141-98.jpg",
    "descriptions": "Experience the dramatic intensity of the frontlines of a war through the eyes of the first of a new breed of super soldiers in this gritty and epic first-person action game. In the not so distant Future, Lt. Nathan Frost is challenged to stop a renegade regime from eradicating the civilizedExperience the dramatic intensity of the frontlines of a war through the eyes of the first of a new breed of super soldiers in this gritty and epic first-person action game. In the not so distant Future, Lt. Nathan Frost is challenged to stop a renegade regime from eradicating the civilized world. Hong Kong, 2065. 2nd Lt. Nathan Frost is just a regular grunt until he volunteers for a super-soldier transformation for an international army called the Liberty Coalition. A painful series of surgeries gives Frost extra-normal abilities via implanted enhancements, which place him on the frontlines of a war against a destructive regime. After a military coup leaves him stranded in hostile territory, cut off from command with only a handful of men, Frost must stop the militia?s secret weapon that threatens to plunge the world into darkness. [Eidos Interactive]… Expand"
  },
  {
    "name": "LawBreakers",
    "details_link": "https://www.metacritic.com/game/playstation-4/lawbreakers",
    "publisher": "Nexon",
    "release_date": "Aug  8 2017",
    "developers": [
      "Boss Key Productions"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Third-Person",
      "Arcade",
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 76,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/9/5a8a5a321bb7888462f1d8b2cc824faa-98.jpg",
    "descriptions": "Prepare to deliver death from every angle, as you master your skills and compete in unprecedented gravity-defying combat in LawBreakers."
  },
  {
    "name": "Kingdom Come: Deliverance",
    "details_link": "https://www.metacritic.com/game/pc/kingdom-come-deliverance",
    "publisher": "Warhorse Studios",
    "release_date": "Feb 13 2018",
    "developers": [
      "Warhorse Studios"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General",
      "Historic",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 76,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/7/94130400b7f0d8d9c27660e574b7cd1b-98.jpg",
    "descriptions": "Kingdom Come: Deliverance is an open world, action-adventure, role-playing game featuring blockbuster production values, a nonlinear story and revolutionary, first-person melee combat."
  },
  {
    "name": "Tom Clancy's Ghost Recon: Wildlands",
    "details_link": "https://www.metacritic.com/game/xbox-one/tom-clancys-ghost-recon-wildlands",
    "publisher": "Ubisoft",
    "release_date": "Mar  7 2017",
    "developers": [
      "Ubisoft Paris"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Xbox One"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 76,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/4/c5ab3cd02ed59804108e7150861e5346-98.jpg",
    "descriptions": "Taking place a few years into the future, Ghost Recon Wildlands empowers players to lead a team of Ghosts, a four-player U.S. Elite Special Operations unit, on a covert mission to destroy the Santa Blanca drug cartel, an underworld force and growing global threat within Ubisoft’s imaginingTaking place a few years into the future, Ghost Recon Wildlands empowers players to lead a team of Ghosts, a four-player U.S. Elite Special Operations unit, on a covert mission to destroy the Santa Blanca drug cartel, an underworld force and growing global threat within Ubisoft’s imagining of a beautiful, yet dangerous Bolivia. With hundreds of villages and well-known landmarks, local legends and various factions and regions, players venture into a vast world with which to interact and explore. The Ghosts’ upgradable skills, along with a vast arsenal of weapons, vehicles and drones, help them defeat their almighty enemy. Gamers can play the entire game solo or they join up with as many as three friends in co-op to roam freely in this vast playground. [Ubisoft]… Expand"
  },
  {
    "name": "Assault Suits Valken Declassified",
    "details_link": "https://www.metacritic.com/game/switch/assault-suits-valken-declassified",
    "publisher": "Rainmaker Productions",
    "release_date": "Mar 30 2023",
    "developers": [
      "M2"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shoot-'Em-Up",
      "Horizontal"
    ],
    "meta_score": 76,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/4/0ada43d5029f9a3801f2b98595ed3657-98.jpg",
    "descriptions": "The original Assault Suits Valken was censored and edited for its international release as Cybernator. This new Declassified version finally offers the original Assault Suits Valken officially translated into English for the first time.In addition, a recreation of the original 80-pageThe original Assault Suits Valken was censored and edited for its international release as Cybernator. This new Declassified version finally offers the original Assault Suits Valken officially translated into English for the first time.In addition, a recreation of the original 80-page Japanese guidebook has been translated into English and included in this release, of which 40 pages cover the game's backstory.Following that, this Declassified release offers new artwork from the game's character designer Satoshi Urushihara and never before seen production artwork.The original and arranged soundtracks are also available to play in the game's music player, along with a new interview with Satoshi Nakai about the original game's mecha design.… Expand"
  },
  {
    "name": "Escape Academy",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/escape-academy",
    "publisher": "iam8bit",
    "release_date": "Jul 14 2022",
    "developers": [
      "Coin Crew Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "2 ",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 76,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/3/585d577cacaaec217f0d50c77a36a0fc-98.jpg",
    "descriptions": "You've just arrived at Escape Academy, a school where promising students train to become the ultimate Escape Room Master. Play over a dozen masterfully hand crafted rooms, designed by experienced experts in the field of REAL LIFE escape rooms. Experience the entirety of Escape Academy aloneYou've just arrived at Escape Academy, a school where promising students train to become the ultimate Escape Room Master. Play over a dozen masterfully hand crafted rooms, designed by experienced experts in the field of REAL LIFE escape rooms. Experience the entirety of Escape Academy alone in single player OR through two player co-operative play. Available in local or online splitscreen. Explore the campus of Escape Academy and get to know the faculty, a colorful cast of characters, each an expert in the art of Escape. And some with secrets yet to be uncovered... … Expand"
  },
  {
    "name": "Embers of Mirrim",
    "details_link": "https://www.metacritic.com/game/switch/embers-of-mirrim",
    "publisher": "Creative Bytes",
    "release_date": "Dec  7 2017",
    "developers": [
      "Creative Bytes"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General"
    ],
    "meta_score": 76,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/be4b8138a9ed28b719f6ad98b5c1aeb9-98.jpg",
    "descriptions": "To save their world from an alien threat, two proud races must set aside their differences and come together... literally. Embers of Mirrim is an adventure-platformer featuring a mystical creature with the ability to split into light and dark embers, each independently controlled by theTo save their world from an alien threat, two proud races must set aside their differences and come together... literally. Embers of Mirrim is an adventure-platformer featuring a mystical creature with the ability to split into light and dark embers, each independently controlled by the analog sticks.… Expand"
  },
  {
    "name": "Shadowrun Returns",
    "details_link": "https://www.metacritic.com/game/pc/shadowrun-returns",
    "publisher": "Harebrained Schemes LLC",
    "release_date": "Jul 25 2013",
    "developers": [
      "Harebrained Schemes LLC"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Strategy",
      "Turn-Based",
      "General",
      "General",
      "Tactics"
    ],
    "meta_score": 76,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/7/61f75606f9791e4fd92edf3528bcc3f5-98.jpg",
    "descriptions": "Jordan Weisman, the creator of Shadowrun, is back and Shadowrun Returns is the game that Shadowrun fans have been waiting for. A 2D turn-based single player game with deep story interaction, meaningful character development, and highly-contextual tactical combat. According to the MayanJordan Weisman, the creator of Shadowrun, is back and Shadowrun Returns is the game that Shadowrun fans have been waiting for. A 2D turn-based single player game with deep story interaction, meaningful character development, and highly-contextual tactical combat. According to the Mayan Calendar (and lots of tabloids), the world will end on December 21, 2012. Its part a 5,200 year cycle of death and rebirth that, in Shadowrun, actually charts the ebb and flow of magic from the Earth. So, on 12/21/12 magic will return, end this world, and wreak holy havoc while starting the next. Aboriginal cultures, who maintained their mystical traditions, are the first to feel the return of magic and use their newfound power to reshape the political, financial, and physical world around them.  As the magic increases, Elf and Dwarf babies are born to very surprised parents who carry the right combination of long-dormant genes. But all of these events pale in comparison to the horror of \"goblinization\", which painfully reshapes the teenage bodies of those unlucky enough to carry dominant Ork or Troll genes. And then the first Great Dragon rises from its 5,200 yearlong hibernation and circles over Tokyo, signaling that the world has truly AWAKENED.\r Fast forward two generations, to a world transformed not only by the growth of magic but by the acceleration of cyber technologya continual effort to improve upon the gifts that nature gave humanity; by the inevitable maturation of the World Wide Web into the Matrixa network directly accessible by the human brain; and by the near elimination of governments as they are replaced megacorporationsmonolithic entities who see only customers, not citizens.\r And moving through the dark shadows cast by the gleaming towers of the corps, are Shadowrunners  disposable assets and corporate pawns scratching out a living using a combination of technology, magic, and street smarts. Shadowrunners live between the cracks and operate outside the law, doing the dirty work that corporate wage-slaves wont soil their hands with and occasionally acting as the only protection the citizenry can turn to. \r\rWelcome to the world of Shadowrun, where man meets magic and machine.… Expand"
  },
  {
    "name": "Your Shape: Fitness Evolved 2013",
    "details_link": "https://www.metacritic.com/game/wii-u/your-shape-fitness-evolved-2013",
    "publisher": "Ubisoft",
    "release_date": "Nov 18 2012",
    "developers": [
      "Blue Byte"
    ],
    "platforms": "Wii U",
    "genres": [
      "Miscellaneous",
      "Exercise / Fitness"
    ],
    "meta_score": 76,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/6/290ef37d86aef58a5a3b4801703489a3-98.jpg",
    "descriptions": "With 125 different workouts and 215 moves Your Shape Fitness Evolved 2013 delivers a vast array of activities. Whether you’re pursuing a solution for strength building, cardio, stretching, or relaxation, the product promises to cover you."
  },
  {
    "name": "Vengeful Guardian: Moonrider",
    "details_link": "https://www.metacritic.com/game/playstation-5/vengeful-guardian-moonrider",
    "publisher": "The Arcade Crew",
    "release_date": "Jan 12 2023",
    "developers": [
      "JoyMasher"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 76,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/6/24e6f2a1f660c6cf747155522f2b86ec-98.jpg",
    "descriptions": "Vengeful Guardian: Moonrider is a side-scrolling action platformer that channels the golden age of classic 16-bit action games in a full-throttle quest for revenge.\r REVENGE OF THE MOONRIDER\r\n\r\nIn the oppressed world of Vengeful Guardian: Moonrider, humanity finds an unlikely hero. AfterVengeful Guardian: Moonrider is a side-scrolling action platformer that channels the golden age of classic 16-bit action games in a full-throttle quest for revenge.\r REVENGE OF THE MOONRIDER\r In the oppressed world of Vengeful Guardian: Moonrider, humanity finds an unlikely hero. After building an army of super soldiers as weapons of war, the authoritarians unwittingly seal their own fates by bringing online the ninja warrior known as Moonrider. Conceived as a tool to preserve the totalitarian state, the Moonrider instead rejects its intended purpose and wages a relentless battle for vengeance against its creators and fellow super soldiers.\r GEAR UP AND PREPARE TO BATTLE YOUR CREATORS\r The design of Vengeful Guardian: Moonrider puts the best classic action-game elements in the laser-precise sights of its starring ninja, ensuring snappy, responsive combat that’s supremely challenging.\r Powerful modifier chips are hidden and guarded throughout the adventure, allowing you to customize the Moonrider’s fighting style while gaining killer advantages and abilities.… Expand"
  },
  {
    "name": "Curious Expedition 2",
    "details_link": "https://www.metacritic.com/game/pc/curious-expedition-2",
    "publisher": "Thunderful",
    "release_date": "Jan 28 2021",
    "developers": [
      "Maschinen-Mensch"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Adventure",
      "Turn-Based",
      "General"
    ],
    "meta_score": 76,
    "users_score": 6.1,
    "image": "https://static.metacritic.com/images/products/games/8/43d55c2cee7f47937364a8fb3409ad3c-98.jpg",
    "descriptions": "Curious Expedition 2 is the follow-up to the award-winning 19th century expedition simulation. Join the legendary Explorer Clubs and venture on unprecedented expeditions to regions never explored before for fame, science and treasures."
  },
  {
    "name": "Resident Evil 4",
    "details_link": "https://www.metacritic.com/game/xbox-one/resident-evil-4",
    "publisher": "Capcom",
    "release_date": "Aug 30 2016",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "PlayStation 4",
      "Switch",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 76,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/3/c9ea5e94ac7120bfe868ce8c86509fd0-98.jpg",
    "descriptions": "Resident Evil 4 marks a new chapter in the Resident Evil series. You'll rejoin Leon S. Kennedy six years after his first mission as a rookie cop from Resident Evil 2. Now a US agent, Leon is on a top secret mission to investigate the disappearance of the president's daughter. As Leon, youResident Evil 4 marks a new chapter in the Resident Evil series. You'll rejoin Leon S. Kennedy six years after his first mission as a rookie cop from Resident Evil 2. Now a US agent, Leon is on a top secret mission to investigate the disappearance of the president's daughter. As Leon, you must make your way to a mysterious location in Europe, where new enemies await. Take them down by using enhanced aim-and-shoot features and a new action button.… Expand"
  },
  {
    "name": "Star Fox Command",
    "details_link": "https://www.metacritic.com/game/ds/star-fox-command",
    "publisher": "Nintendo",
    "release_date": "Aug 28 2006",
    "developers": [
      "Q-Games"
    ],
    "platforms": "DS",
    "num_players": "4  Online",
    "genres": [
      "Action",
      "Simulation",
      "Shooter",
      "Flight",
      "Shooter",
      "Third-Person",
      "Combat",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 76,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/7/0a0ae0e359bfdfd3a070be5cb097b10f-98.jpg",
    "descriptions": "Star Fox returns to its roots with a blistering space shooter on Nintendo DS. Lylat needs help. Players hop into their Arwing fighter and fight through a unique branching storyline of missions, all rendered in gorgeous 3-D. Star Fox DS brings a new strategic element to the series with aStar Fox returns to its roots with a blistering space shooter on Nintendo DS. Lylat needs help. Players hop into their Arwing fighter and fight through a unique branching storyline of missions, all rendered in gorgeous 3-D. Star Fox DS brings a new strategic element to the series with a commander's view of the mission. Using the touch screen, players can draw the routes they and their teammates will take, then battle the enemies they encounter as they take over bases and strategically advance across the map. Players can blow their friends out of the sky as they dogfight with up to eight players over a local wireless connection or take on up to four players from around the world on Nintendo Wi-Fi Connection. [Nintendo]… Expand"
  },
  {
    "name": "Far Cry Primal",
    "details_link": "https://www.metacritic.com/game/playstation-4/far-cry-primal",
    "publisher": "Ubisoft",
    "release_date": "Feb 23 2016",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "Stadia",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 76,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/5/206e0a1cc05cb8a2e95c2f06f1e55abc-98.jpg",
    "descriptions": "The era is the Stone Age, a time of imminent peril and limitless adventure, when giant mammoths and sabretooth tigers rule the globe, and humanity is at the low end of the food chain. As the last survivor of your hunting group, you will learn to build a deadly arsenal, fight off dangerousThe era is the Stone Age, a time of imminent peril and limitless adventure, when giant mammoths and sabretooth tigers rule the globe, and humanity is at the low end of the food chain. As the last survivor of your hunting group, you will learn to build a deadly arsenal, fight off dangerous predators, and outsmart enemy tribes to conquer the land of Oros and become the Apex Predator. You'll assume the role of Takkar, a seasoned hunter and the last surviving member of your group. You have a single goal: survive in a world where you are the hunted. Grow your tribe and sharpen your skills to lead your people, conquer the land of Oros, and become the apex predator. Encounter a cast of memorable characters who can help push back the dangers of the wild. Face enemy tribes who will do anything to eradicate you and your allies. [Ubisoft]\r … Expand"
  },
  {
    "name": "Lode Runner",
    "details_link": "https://www.metacritic.com/game/xbox-360/lode-runner",
    "publisher": "Tozai Games",
    "release_date": "Apr 22 2009",
    "developers": [
      "Southend Interactive"
    ],
    "platforms": [
      "iPhone/iPad",
      "Xbox 360"
    ],
    "num_players": "4  Online",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 76,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/9/2c9b1ce2f711e5a039306e7730ba3923-98.jpg",
    "descriptions": "[Xbox Live Arcade]  The classic action game Lode Runner is back, with 220 new levels and even more surprises! Confront crazed enemies in fresh sets of single-player levels and fun-filled co-op challenges, or lean back and master increasingly complex puzzles. Battle it out with endlessly[Xbox Live Arcade]  The classic action game Lode Runner is back, with 220 new levels and even more surprises! Confront crazed enemies in fresh sets of single-player levels and fun-filled co-op challenges, or lean back and master increasingly complex puzzles. Battle it out with endlessly spawning enemies in a feverish new mode, or challenge up to three friends in a cunning game of high speed tag, where the first to die are the first to avenge - as enemies! Create custom levels and host matches over Xbox LIVE. Lode Runner legacy: Inspired by the classic action title, but the game is recreated from the ground up for Xbox LIVE Arcade with 3-D graphics, all-new levels, and play modes. Game modes for everyone: Play expansive single-player and co-op Journey campaigns, frantic Hang On survival challenges, complex puzzles, and a four-player Last Man competition that rewards sabotage, revenge, and outright deviousness. New content: Explore five worlds inhabited by unique enemies and special terrain such as avalanche blocks, stalactites, and teleports. Blast blocks with bombs and collect energy balls to add lives. Unearth hidden enemies! Transition from one level to the next seamlessly. Master new co-operative play techniques like blasting blocks while riding on a buddy's head. Level editor and community: Design custom levels for any game mode and environment to challenge your friends. Host Xbox LIVE matches with your cunning creations or upload and download the coolest custom levels from the Lode Runner community. [Tozai]… Expand"
  },
  {
    "name": "City Life",
    "details_link": "https://www.metacritic.com/game/pc/city-life",
    "publisher": "cdv Software",
    "release_date": "Jun  2 2006",
    "developers": [
      "Monte Cristo Multimedia",
      "Monte Cristo"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Breeding/Constructing",
      "Management",
      "Breeding/Constructing",
      "Government"
    ],
    "meta_score": 76,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/1/77350773c882376b3778dc915a895b55-98.jpg",
    "descriptions": "City Life takes the city building genre into the 21st century with a powerful 3D engine and a variety of gameplay features. In the game, players take on the role of urban planner and real estate developer, creating a metropolitan paradise from dozens of beautifully rendered structures –City Life takes the city building genre into the 21st century with a powerful 3D engine and a variety of gameplay features. In the game, players take on the role of urban planner and real estate developer, creating a metropolitan paradise from dozens of beautifully rendered structures – including elaborately crafted villas and ultra-modern skyscrapers. City Life comprises the full city building experience, requiring players to take into account the need for municipal services, education, entertainment and a complete infrastructure system while maintaining harmony between the game's six distinct social classes. The graphics engine allows players to walk the streets of their cities, or zoom out to multiple levels for a better view of the overall action. A custom map editor will allow players to expand upon the 22 maps included with the game. [CDV Software]… Expand"
  },
  {
    "name": "The Evil Within 2",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-evil-within-2",
    "publisher": "Bethesda Softworks",
    "release_date": "Oct 13 2017",
    "developers": [
      "Tango Gameworks"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 76,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/7/f6bf41a8273e23b48ab5e653f7a599c0-98.jpg",
    "descriptions": "You are Detective Sebastian Castellanos and at your lowest point. But when given a chance to save your daughter, you must enter a world filled with nightmares and discover the dark origins of a once-idyllic town to bring her back. Horrifying threats emerge from every corner as the worldYou are Detective Sebastian Castellanos and at your lowest point. But when given a chance to save your daughter, you must enter a world filled with nightmares and discover the dark origins of a once-idyllic town to bring her back. Horrifying threats emerge from every corner as the world twists and warps around you. Will you face adversity head on with weapons and traps, or sneak through the shadows to survive?… Expand"
  },
  {
    "name": "Section 8: Prejudice",
    "details_link": "https://www.metacritic.com/game/xbox-360/section-8-prejudice",
    "publisher": "TimeGate Studios",
    "release_date": "Apr 20 2011",
    "developers": [
      "TimeGate Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 76,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/5/5b75b3f9d12770ac4095e1fc6ab9c360-98.jpg",
    "descriptions": "Section 8: Prejudice is a sci-fi shooter featuring online team-based multiplayer."
  },
  {
    "name": "Alan Wake's American Nightmare",
    "details_link": "https://www.metacritic.com/game/xbox-360/alan-wakes-american-nightmare",
    "publisher": "Microsoft Game Studios",
    "release_date": "Feb 22 2012",
    "developers": [
      "Remedy Entertainment"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern",
      "Linear"
    ],
    "meta_score": 76,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/5a949457e3b74a0e10024288e4c3ff72-98.jpg",
    "descriptions": "After the events of Alan Wake, our eponymous hero finds himself embroiled in a new adventure in Arizona, where his own words again hold the key to defeating his evil twin, the malevolent Mr. Scratch, who spreads darkness where he goes. Now more experienced at dealing with the weird andAfter the events of Alan Wake, our eponymous hero finds himself embroiled in a new adventure in Arizona, where his own words again hold the key to defeating his evil twin, the malevolent Mr. Scratch, who spreads darkness where he goes. Now more experienced at dealing with the weird and horrific, Wake is determined to turn the tide. [Microsoft]… Expand"
  },
  {
    "name": "Twelve Minutes",
    "details_link": "https://www.metacritic.com/game/pc/twelve-minutes",
    "publisher": "Luis Antonio",
    "release_date": "Aug 19 2021",
    "developers": [
      "Luis Antonio"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "Point-and-Click"
    ],
    "meta_score": 76,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/0/a53d19c9bf2c6f10337629274d802a50-98.jpg",
    "descriptions": "You are doomed to live the same TWELVE MINUTES inside your apartment, unless you use your knowledge of what is going to happen, to change the outcome, and break the loop.  (Also known as \"12 Minutes\")"
  },
  {
    "name": "Days Gone",
    "details_link": "https://www.metacritic.com/game/pc/days-gone",
    "publisher": "PlayStation Mobile Inc.",
    "release_date": "May 18 2021",
    "developers": [
      "Sony Bend"
    ],
    "platforms": [
      "PlayStation 4",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 76,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/9/cb4305968516489a18818c8df4310292-98.jpg",
    "descriptions": "HOPE NEVER DIES - At its core, Days Gone is about survivors and what makes them human: desperation, loss, madness, betrayal, friendship, brotherhood, regret, love and hope. It's about how even when confronted with such enormous tragedy they find a reason to live. Hope never dies. DEACON ST.HOPE NEVER DIES - At its core, Days Gone is about survivors and what makes them human: desperation, loss, madness, betrayal, friendship, brotherhood, regret, love and hope. It's about how even when confronted with such enormous tragedy they find a reason to live. Hope never dies. DEACON ST. JOHN - Play as Deacon St. John, a bounty hunter facing a brutal struggle for survival, searching for a reason to live.\rIn addition to human drifters, marauders, and other groups, Deacon must face a wilderness overrun by Freakers mindless, feral creatures, more animal than human but very much alive and quickly evolving. Freakers have needs, habits and behaviors that the player can learn and adapt to. \r\rUnique Setting\rThe harsh high-desert of the Pacific Northwest offers a large variety of environments in a single geographical area. One minute Deacon can be riding through a pristine forest, a snow field, a lush meadow, and the next, be in the harsh desert lava fields. The hazardous environments, scarred by millions of years of volcanic activity, are defined by ancient lava flows, mountains, caves, cliffs and river basins, delivering a breathtaking backdrop to an equally diverse style of gameplay. Cinnabar mines, lava tube caves and small rural towns offer a variety of environments to explore.\r A Dynamic World\rUsing the power of PlayStation 4 and Unreal Engine 4, Days Gone offers an incredibly realistic and detailed open-world experience. Vast and hostile environments can be fully explored on the back of Deacon's drifter bike. Abandoned vehicles can be searched for useful items. Towns and buildings can be entered and searched at great risk. All lighting is done in real time eye adaption technology creates a real sense of dread when entering dark buildings; day and night have an impact on the experience; weather affects enemy behavior.\r Brutal Sandbox Combat\rExemplifying true, free-form gameplay, Days Gone offers freedom to explore, strategize and play \"your way.\" Every challenge can be approached and completed in an almost infinite number of ways. Many different items and weapons can be crafted using items found in the field, including brutal melee weapons and traps. Customizable weapons and skills offer true freedom in how the game is played.… Expand"
  },
  {
    "name": "Close to the Sun",
    "details_link": "https://www.metacritic.com/game/xbox-one/close-to-the-sun",
    "publisher": "Wired Productions",
    "release_date": "Oct 29 2019",
    "developers": [
      "Storm in a Teacup"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 76,
    "users_score": 5.4,
    "image": "https://static.metacritic.com/images/products/games/2/1b5a4576885f21e219ff96057e1ac0dc-98.jpg",
    "descriptions": "It’s 1897. Deep in international waters, the Helios stands still. An unbound utopia for scientific research, born of Nikola Tesla’s vision. Journalist Rose Archer steps aboard in search of her sister Ada, quickly to discover not all is as it seems. The stench of rotting flesh lingers in theIt’s 1897. Deep in international waters, the Helios stands still. An unbound utopia for scientific research, born of Nikola Tesla’s vision. Journalist Rose Archer steps aboard in search of her sister Ada, quickly to discover not all is as it seems. The stench of rotting flesh lingers in the air. Silence. A single word is painted across the entrance… QUARANTINE!… Expand"
  },
  {
    "name": "Mutant Year Zero: Road to Eden",
    "details_link": "https://www.metacritic.com/game/playstation-4/mutant-year-zero-road-to-eden",
    "publisher": "Funcom",
    "release_date": "Dec  4 2018",
    "developers": [
      "High Voltage Software",
      "The Bearded Ladies Consulting"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Tactics"
    ],
    "meta_score": 76,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/5405bf5ed7d44dc9c95e48a2c89dd2c4-98.jpg",
    "descriptions": "A tactical adventure game combining the turn-based combat of XCOM with story, exploration, stealth, and strategy. Take control of a team of Mutants navigating a post-human Earth. Created by a team including former HITMAN leads and the designer of PAYDAY."
  },
  {
    "name": "Capcom Beat 'Em Up Bundle",
    "details_link": "https://www.metacritic.com/game/xbox-one/capcom-beat-em-up-bundle",
    "publisher": "Capcom",
    "release_date": "Sep 18 2018",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 76,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/3/9e0e6be69270b71e0861d34222d0adea-98.jpg",
    "descriptions": "Relive the glory days of cooperative arcade games with the Capcom Beat 'Em Up Bundle!This comprehensive collection includes seven classic games, each with various multiplayer options, online capabilities and detailed galleries!\n\nSay goodbye to game overs! Adjust your difficulty settings orRelive the glory days of cooperative arcade games with the Capcom Beat 'Em Up Bundle!This comprehensive collection includes seven classic games, each with various multiplayer options, online capabilities and detailed galleries!Say goodbye to game overs! Adjust your difficulty settings or give yourself more lives to battle through each game in its entirety. You can also play the English or Japanese versions of each title!Games included: Final Fight, Captain Commando, The King of Dragons, Knights of the Round and Warriors of Fate, as well as two games that were previously unavailable on consoles: Armored Warriors and Battle Circuit!Grab some friends, stare down the bad guys and BEAT 'EM UP!… Expand"
  },
  {
    "name": "Baldur's Gate: Dark Alliance",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/baldurs-gate-dark-alliance",
    "publisher": "Destination Software",
    "release_date": "Feb 10 2004",
    "developers": [
      "Magic Pockets"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Game Boy Advance"
    ],
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 76,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/9/284b46fddd903365578d8826186c6f44-98.jpg",
    "descriptions": "Baldur's Gate: Dark Alliance is an action RPG with an epic tale of intrigue, explosive spell effects, and highly detailed creatures and environments.  You play a one of three customizable characters, who returns to Baldur's Gate and joins the fight against the darkness that threatens itsBaldur's Gate: Dark Alliance is an action RPG with an epic tale of intrigue, explosive spell effects, and highly detailed creatures and environments.  You play a one of three customizable characters, who returns to Baldur's Gate and joins the fight against the darkness that threatens its peace.  Baldur's Gate: Dark Alliance is the first game to feature the real time application of the Dungeons & Dragons 3rd Edition rules.… Expand"
  },
  {
    "name": "Rayman 3: Hoodlum Havoc",
    "details_link": "https://www.metacritic.com/game/playstation-2/rayman-3-hoodlum-havoc",
    "publisher": "Ubisoft",
    "release_date": "Mar 17 2003",
    "developers": [
      "Ubisoft"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 76,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/9c971de5a480e417189072ad73e10ec1-98.jpg",
    "descriptions": "Adventurers beware - Rayman's universe has exploded into a whacked-out world of cartoon mayhem and mind-blowing battles! When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger happy Hoodlums wreaks total havoc to get their Lord back! Rayman's only chance?Adventurers beware - Rayman's universe has exploded into a whacked-out world of cartoon mayhem and mind-blowing battles! When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger happy Hoodlums wreaks total havoc to get their Lord back! Rayman's only chance? Journey the vast reaches of the world to purge the Dark Lum Lord from the manic Globox, scour the lands for unearthly new powers, and do battle with hordes of Hoodlum soldiers, contraptions, and maniacal bosses. This time, it's war! [Ubi Soft]… Expand"
  },
  {
    "name": "Battle Engine Aquila",
    "details_link": "https://www.metacritic.com/game/xbox/battle-engine-aquila",
    "publisher": "Atari",
    "release_date": "Jan 20 2003",
    "developers": [
      "Lost Toys"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 76,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/9/72a5de869c6715523bb73aadd664fb1a-98.jpg",
    "descriptions": "An epic battle rages between the Forseti and the Muspell as the oceans rise and land disappears. The Forseti compel you to help protect their remaining land by taking charge of a powerful war machine--the Battle Engine. Whether in walking or in flying mode, you have access to an array ofAn epic battle rages between the Forseti and the Muspell as the oceans rise and land disappears. The Forseti compel you to help protect their remaining land by taking charge of a powerful war machine--the Battle Engine. Whether in walking or in flying mode, you have access to an array of destructive weapons to use in expansive environments. You'll command a device so powerful and advanced that your battlefield decisions will shape the direction of each engagement and, ultimately, the entire war. … Expand"
  },
  {
    "name": "Alien Front Online",
    "details_link": "https://www.metacritic.com/game/dreamcast/alien-front-online",
    "publisher": "Sega",
    "release_date": "Aug  9 2001",
    "developers": [
      "Sega"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Sci-Fi"
    ],
    "meta_score": 76,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/0/88af27d18fdd3c38359dfe12bec7dae5-98.jpg",
    "descriptions": "The Triclops have invaded the Earth with a simple plan: the eradication of all human life! Become a tank commander and obliterate the alien invaders, or join the elite Triclops Guard and crush any human scum that stand in the way. Regardless of which side you choose, you'll possess enoughThe Triclops have invaded the Earth with a simple plan: the eradication of all human life! Become a tank commander and obliterate the alien invaders, or join the elite Triclops Guard and crush any human scum that stand in the way. Regardless of which side you choose, you'll possess enough weaponry to completely destroy your enemies. One team will decide the fate of the globe!… Expand"
  }
]