[{"name": "Hasbro Family Game Night: Yahtzee", "details_link": "https://www.metacritic.com/game/xbox-360/hasbro-family-game-night-yahtzee", "publisher": "Electronic Arts", "release_date": "Mar 18 2009", "developers": ["Electronic Arts"], "platforms": "Xbox 360", "genres": ["Miscellaneous", "Board Games", "Board / Card Game"], "meta_score": 78, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "[Xbox Live Arcade]  Join your host Mr. Potato Head as you play your favorite Hasbro games including CONNECT FOUR, BATTLESHIP, YAHTZEE, BOGGLE, SORRY! and SORRY! Sliders, as well as exciting new versions created for Xbox LIVE Arcade in Hasbro Family Game Night. Great family games: Play all[Xbox Live Arcade]  Join your host Mr. Potato Head as you play your favorite Hasbro games including CONNECT FOUR, BATTLESHIP, YAHTZEE, BOGGLE, SORRY! and SORRY! Sliders, as well as exciting new versions created for Xbox LIVE Arcade in Hasbro Family Game Night. Great family games: Play all your favorite Hasbro games that you know and love so well. Exciting new versions: And play those games like never before with exciting new variants including CONNECT 4 Power Chips, BOGGLE Portal Cubes, Reverse YAHTZEE, and BATTLESHIP Barrage! Customized game room: Choose the game room theme that's right for you. Earn new game themed trophies, furniture, and decorations to customize your game room. Party time: Build a custom Party Game by choosing your favorite games, number of players, and time you want to play. [Electronic Arts]… Expand"}, {"name": "Detroit: Become Human", "details_link": "https://www.metacritic.com/game/playstation-4/detroit-become-human", "publisher": "SCEA", "release_date": "May 25 2018", "developers": ["Quantic Dream"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World", "Adventure", "3D", "Third-Person"], "meta_score": 78, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/f563f84a927722ab1b2cda5e9e0beca2-98.jpg", "descriptions": "Inspired by the short called “Kara”, Detroit is a neo-noir thriller set in the near-future city of Detroit. Androids, who look exactly like human beings, have replaced humans in most tasks: they are workers, babysitters, gardeners, nurses, teachers, clerks. The story of Detroit starts withInspired by the short called “Kara”, Detroit is a neo-noir thriller set in the near-future city of Detroit. Androids, who look exactly like human beings, have replaced humans in most tasks: they are workers, babysitters, gardeners, nurses, teachers, clerks. The story of Detroit starts with an unexplained incident that begins to affect the Androids. Some disappear without any explanation, others have unexpected behaviors and strangely show signs of emotions. The rumors of “deviant” androids start spreading, but no one seems to know what’s really happening... [Quantic Dream]… Expand"}, {"name": "Tiger Woods PGA Tour", "details_link": "https://www.metacritic.com/game/psp/tiger-woods-pga-tour", "publisher": "EA Sports", "release_date": "Mar 23 2005", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/3f844f356685c6167dbb36e74b15339e-98.jpg", "descriptions": "Classic Courses: Play against opponents on a mix of 12 top courses including Sherwood Country Club, Pebble Beach, Harbor Town and Paradise Cove. All of these stunning courses are from Tiger Woods PGA Tour 2004 and 2005. Legend TOUR: Compete against the pros from past and present in mix &Classic Courses: Play against opponents on a mix of 12 top courses including Sherwood Country Club, Pebble Beach, Harbor Town and Paradise Cove. All of these stunning courses are from Tiger Woods PGA Tour 2004 and 2005. Legend TOUR: Compete against the pros from past and present in mix & match play events, tournaments and challenge modes, proving you've got what it takes to become a legend of the game. Head-to-Head Golf: Take on your friends in a range of new modes specifically designed for Wi-Fi. Play wireless multiplayer match ups complete with stat tracking & wagering. With this feature it’s all about bragging rights and earning cash points to upgrade your golfer. New Ways to Play Golf: Brand new game modes that capitalize on the cutting-edge hardware features of the PSP and deliver a highly competitive gameplay experience. [Electronic Arts]… Expand"}, {"name": "Broken Sword: Shadow of the Templars - The Director's Cut", "details_link": "https://www.metacritic.com/game/ds/broken-sword-shadow-of-the-templars---the-directors-cut", "publisher": "Ubisoft", "release_date": "Mar 24 2009", "developers": ["Revolution Software"], "platforms": ["iPhone/iPad", "PC", "DS"], "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/aca6d04fafb251de3a507cf5f4e8c714-98.jpg", "descriptions": "Broken Sword: Shadow of the Templars - The Director's Cut starts with the player in control of charming Parisian photo-journalist Nicole Collard, who witnesses the brutal and horrifying murder of one of Paris's richest and most influential statesmen. During her investigations, which featureBroken Sword: Shadow of the Templars - The Director's Cut starts with the player in control of charming Parisian photo-journalist Nicole Collard, who witnesses the brutal and horrifying murder of one of Paris's richest and most influential statesmen. During her investigations, which feature exclusive new locations, Nico meets amiable American George Stobbart, who has been unwittingly caught up in the sinister and bloody theft of an ancient manuscript. Together, they are drawn into a terrifying conspiracy rooted in a long-forgotten medieval legend. Expanding on the original classic storyline, The Director's Cut features tight scripting and an intense atmosphere from the explosive opening sequence to the gripping finale, where the full threat of the conspiracy is revealed. [Ubisoft]… Expand"}, {"name": "Layers of Fear", "details_link": "https://www.metacritic.com/game/xbox-one/layers-of-fear", "publisher": "Aspyr", "release_date": "Feb 16 2016", "developers": ["Bloober Team"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/7802ae3ee6fd2fd6d321b9119d6b74d6-98.jpg", "descriptions": "Layers of Fear is a psychedelic horror where you take control over an insane painter in his quest to finish his magnum opus."}, {"name": "Capcom Fighting Collection", "details_link": "https://www.metacritic.com/game/switch/capcom-fighting-collection", "publisher": "Capcom", "release_date": "Jun 24 2022", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 9 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/d1e8aa9d385245cefe1de113f02084a1-98.jpg", "descriptions": "Features 10 classic titles, including two Darkstalkers games never before released in North America! Take on all challengers in online play with rollback netcode for all ten games, and enjoy additional features including a gallery of official art, a music player with hundreds of tracks, andFeatures 10 classic titles, including two Darkstalkers games never before released in North America! Take on all challengers in online play with rollback netcode for all ten games, and enjoy additional features including a gallery of official art, a music player with hundreds of tracks, and more:\r Darkstalkers: The Night Warriors\r  Night Warriors: Darkstalkers’ Revenge\r  Vampire Savior: The Lord of Vampire\r  Vampire Hunter 2: Darkstalkers’ Revenge (Japanese version, first official release in North America)\r  Vampire Savior 2: The Lord of Vampire (Japanese version, first official release in North America)\r  Red Earth (First release outside of arcades)\r  Cyberbots: Fullmetal Madness\r  Super Gem Fighter Mini Mix\r  Super Puzzle Fighter II Turbo\r  Hyper Street Fighter II… Expand"}, {"name": "Baldur's Gate: Enhanced Edition", "details_link": "https://www.metacritic.com/game/pc/baldurs-gate-enhanced-edition", "publisher": "Beamdog", "release_date": "Nov 28 2012", "developers": ["Overhaul Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/2e7c9027bf6698947dd12024cb09270a-98.jpg", "descriptions": "Baldur's Gate: Enhanced Edition includes the entire Baldur's Gate adventure, the Tales of the Sword Coast expansion pack, and some never before seen content as well."}, {"name": "Disgaea 3: Absence of Justice", "details_link": "https://www.metacritic.com/game/playstation-3/disgaea-3-absence-of-justice", "publisher": "NIS America", "release_date": "Aug 26 2008", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/effa0ced22066bda8ecca3269390bb4d-98.jpg", "descriptions": "Disgaea 3 is a sequel to Disgaea, a hardcore, turn-based, strategy RPG popular on the PlayStation2 and PlayStation Portable. In Disgaea, character units have a limit to their movement and attack ranges, based on level and weapons equipped. There are other special game factors that let youDisgaea 3 is a sequel to Disgaea, a hardcore, turn-based, strategy RPG popular on the PlayStation2 and PlayStation Portable. In Disgaea, character units have a limit to their movement and attack ranges, based on level and weapons equipped. There are other special game factors that let you take advantage of the 3D battle map, many of which are unique to Disgaea. One of the many new feature to Disgaea 3 is the addition of a Geo Block, which creates a 3 dimensional battle instead of the traditional 2D. Geo Block is a cube-shaped terrain-altering object. Players can use it to access and attack enemies where normally they cannot reach. Geo Panel is a group of stat-altering elemental properties that are placed upon certain parts of the battlefield. When there are one or more colored panels on the battle grid, it means an element can affect that area. The effect can boost or reduce your unit's stats. Item World is a special randomly-generated battle stage within each and every item you find. By defeating these special battle stages, you are able to strengthen your items. [NIS America]… Expand"}, {"name": "DOOM 3: Resurrection of Evil", "details_link": "https://www.metacritic.com/game/pc/doom-3-resurrection-of-evil", "publisher": "Activision", "release_date": "Apr  4 2005", "developers": ["Nerve Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/ac2704e591f01c42979c818202f70bc1-98.jpg", "descriptions": "Following the events of \"Doom 3\" and featuring new locations, characters and weapons, including the return of the double-barreled shotgun, DOOM 3: Resurrection of Evil expands the terrifying action that fans have been raving about. The expansion pack continues right where the original leftFollowing the events of \"Doom 3\" and featuring new locations, characters and weapons, including the return of the double-barreled shotgun, DOOM 3: Resurrection of Evil expands the terrifying action that fans have been raving about. The expansion pack continues right where the original left off - with a terrifying atmosphere and a new story which delivers you deeper into the heart of the UAC to uncover new secrets and technology used to destroy the demon force that's Hell-bent on destroying you. The expansion continues the frightening and gripping single player experience of the blockbuster original.  The title also features even more multiplayer action with support for up to eight players in all new maps. (The expansion requires the full retail version of Doom 3.) [Activision]… Expand"}, {"name": "LEGO Indiana Jones: The Original Adventures", "details_link": "https://www.metacritic.com/game/pc/lego-indiana-jones-the-original-adventures", "publisher": "LucasArts", "release_date": "Jun  3 2008", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Adventure", "General", "General"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/8735ddd808735ee6ebe80032907189ee-98.jpg", "descriptions": "LEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones andLEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones and the Temple of Doom and Indiana Jones and the Last Crusade). With a unique tongue-in-cheek take on the original adventures, LEGO Indiana Jones follows Dr. Jones escapades through the jungles of South America to the mountaintops of India. Fans can build, battle and brawl their way through their favorite cinematic moments, from Indy's entanglements with snakes to his dashing boulder run. Pop culture's most iconic archeologist whips through all the classic moments with the help of a host of supporting characters including Marion Ravenwood and Short Round. Players can also mix and match the body parts of more than 60 playable characters to create new heroes just as they could in the LEGO Star Wars games. [LucasArts]… Expand"}, {"name": "Yakuza 4", "details_link": "https://www.metacritic.com/game/playstation-3/yakuza-4", "publisher": "Sega", "release_date": "Mar 15 2011", "developers": ["Ryu ga Gotoku Studios"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/ca7e7f486d85b35138209310472dea93-98.jpg", "descriptions": "Yakuza 4 returns for another round of open world adventure, this time with four main characters."}, {"name": "Cyber Shadow", "details_link": "https://www.metacritic.com/game/playstation-4/cyber-shadow", "publisher": "Yacht Club Games", "release_date": "Jan 26 2021", "developers": ["Mechanical Head Studios"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/48f032c453e7a9ad6467c19ba3556d11-98.jpg", "descriptions": "The world has been taken over by synthetic lifeforms. A desperate plea for help sets Shadow on a journey to uncover what started the path to perpetual ruin. Slash through the techno hordes, leap past traps, and nimbly navigate the ruins of Mekacity."}, {"name": "GreedFall", "details_link": "https://www.metacritic.com/game/xbox-one/greedfall", "publisher": "Focus Home Interactive", "release_date": "Sep 10 2019", "developers": ["Spiders"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/455b4430ca5fd587a6b1103dbd5accc2-98.jpg", "descriptions": "Explore uncharted new lands as you set foot on a remote island seeping with magic, and filled with riches, lost secrets, and fantastic creatures. Forge this new world's destiny, as you befriend or betray companions and entire factions. With diplomacy, deception and force, become part of aExplore uncharted new lands as you set foot on a remote island seeping with magic, and filled with riches, lost secrets, and fantastic creatures. Forge this new world's destiny, as you befriend or betray companions and entire factions. With diplomacy, deception and force, become part of a living, evolving world - influence its course and shape your story.\r * Engage in a core roleplaying experience achieve quests and complete objectives in a multitude of different ways through combat, diplomacy, deception, or stealth.\r* Complete freedom in character progression play as a male or female, customize your appearance, and freely choose your abilities, spells and skills.\r* Delve into a mysterious world of magic begin a grand journey and uncover ancient secrets protected by supernatural beings, manifestations of the island's earthly magic.… Expand"}, {"name": "Descenders", "details_link": "https://www.metacritic.com/game/pc/descenders", "publisher": "No More Robots", "release_date": "May  7 2019", "developers": ["RageSquid"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/23a23275a7fa456daddb3a19c714eddf-98.jpg", "descriptions": "Descenders is extreme downhill freeriding for the modern era, with procedurally generated worlds, and where mistakes have real consequences. Will you lead your team to glory and become the next legendary Descender?"}, {"name": "EVERSPACE", "details_link": "https://www.metacritic.com/game/playstation-4/everspace", "publisher": "ROCKFISH Games", "release_date": "May 22 2018", "developers": ["ROCKFISH Games"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "Space", "Open-World", "Combat"], "meta_score": 78, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/ce1ca337488dcc1edfbe6d1e8948dc49-98.jpg", "descriptions": "Everspace is an action-focused single-player space shooter combining roguelike elements with top-notch visuals and a captivating non-linear story."}, {"name": "Deathsmiles", "details_link": "https://www.metacritic.com/game/pc/deathsmiles", "publisher": "Degica", "release_date": "Mar 10 2016", "developers": ["Cave"], "platforms": ["iPhone/iPad", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/6a89f3445155bbee2bddfbaab7c46281-98.jpg", "descriptions": "Deathsmiles is CAVE's bullet-hell shoot-'em-up where you take the role of one of five Angels to defend the magical land of Gilverado from an invasion by Hell itself. Eradicate this devilish assault."}, {"name": "The Sims 3", "details_link": "https://www.metacritic.com/game/playstation-3/the-sims-3", "publisher": "Electronic Arts", "release_date": "Oct 26 2010", "developers": ["The Sims Studio"], "platforms": ["3DS", "iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/04e69732a404094e0d2bde8d6c922b4f-98.jpg", "descriptions": "With The Sims 3 for consoles and handheld, create Sims with unique personalities, fulfill their desires...or not, and control their lives within a living neighborhood. Customize your Sims’ appearance and choose up to five traits to create individual personalities. From the “Romantic” traitWith The Sims 3 for consoles and handheld, create Sims with unique personalities, fulfill their desires...or not, and control their lives within a living neighborhood. Customize your Sims’ appearance and choose up to five traits to create individual personalities. From the “Romantic” trait or “kleptomaniac” trait to “evil” trait, create millions of unique Sims. All-new features make it easier than ever to mess with life as you unlock the ultimate “Karma Powers” for instant control and unleash them on your Sims. New goal-oriented game play enables you to choose which short or long-term objectives you want your Sims to pursue and even determine your Sims’ destinies in life.  Get inspired by the endless creative possibilities and unexpected moments of surprise and mischief in The Sims 3. [Electronic Arts]… Expand"}, {"name": "Wade Hixton's Counter Punch", "details_link": "https://www.metacritic.com/game/game-boy-advance/wade-hixtons-counter-punch", "publisher": "Destination Software", "release_date": "Mar 15 2004", "developers": ["Inferno Games"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/fb206b09319e19cbd2ed80dbcddac7a4-98.jpg", "descriptions": "After his car breaks down, Wade Hixton stumbles upon the little-known town of Big Piney. Wade, however, gets himself into even more trouble, as town members challenge him to fight. Step into Wade's shoes as he boxes nine different fighters, each with a unique personality and fightingAfter his car breaks down, Wade Hixton stumbles upon the little-known town of Big Piney. Wade, however, gets himself into even more trouble, as town members challenge him to fight. Step into Wade's shoes as he boxes nine different fighters, each with a unique personality and fighting technique. Give yourself a competitive advantage by upgrading your attacks, purchasing new moves, and even paying off characters to assist you during matches. … Expand"}, {"name": "Baldur's Gate: Dark Alliance II", "details_link": "https://www.metacritic.com/game/playstation-2/baldurs-gate-dark-alliance-ii", "publisher": "Interplay", "release_date": "Jan 20 2004", "developers": ["Black Isle Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/01e72a0220c9e59ba36c13b3d33e2b42-98.jpg", "descriptions": "The anticipated sequel has arrived. Embark on a new adventure in Baldur's Gate and brave terrible dangers in search of fortune, glory, and power. Face a multitude of sinister enemies while traveling through many spectacular environments in this action-packed fantasy game. Rid the lands ofThe anticipated sequel has arrived. Embark on a new adventure in Baldur's Gate and brave terrible dangers in search of fortune, glory, and power. Face a multitude of sinister enemies while traveling through many spectacular environments in this action-packed fantasy game. Rid the lands of chaos, mastering skills, spells, and deadly weapons ? the fate of thousands hangs in the balance. [Interplay]… Expand"}, {"name": "NASCAR Thunder 2004", "details_link": "https://www.metacritic.com/game/pc/nascar-thunder-2004", "publisher": "EA Games", "release_date": "Sep 16 2003", "developers": ["EA Games"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-16 ", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/78b7bed35a52fbd485f17e834d44ff70-98.jpg", "descriptions": "From 200 MPH super-speedways to hairpin turns on 11 fantasy tracks, tuning your car and finding the line is no longer enough. Now you?re running to the edge against 42 other unique NASCAR® personalities every race, drivers who remember your every move and won?t think twice about paying youFrom 200 MPH super-speedways to hairpin turns on 11 fantasy tracks, tuning your car and finding the line is no longer enough. Now you?re running to the edge against 42 other unique NASCAR® personalities every race, drivers who remember your every move and won?t think twice about paying you back. Out-smart and out-drive them as you battle three-wide from green to checkers. Online or on your own, racing just became a contact sport. Grudges & Alliances: Emotion comes to a racing game for the first time as CPU drivers remember your every move and aren't afraid to pay you back. Pick up & Play controls help new fans navigate over 60 events including all real world NASCAR races, plus 12 winding road courses. NASCAR Thunder 2004 goes online with peer-to-peer racing on the PlayStation®2 and 16 player races on PC. The most extensive Career Mode in a NASCAR video game just got deeper and easier to navigate! The deepest NASCAR game ever created with over 70 drivers and 175 authentic cars and the first game with a full pack of 43 Cup Series cars. [Electronic Arts]… Expand"}, {"name": "Dave Mirra Freestyle BMX 3", "details_link": "https://www.metacritic.com/game/game-boy-advance/dave-mirra-freestyle-bmx-3", "publisher": "Acclaim", "release_date": "Nov 26 2002", "developers": ["Full-Fat"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/f50ccc03c9957c5c47051e0a11f105f3-98.jpg", "descriptions": "The game just feels like a BMX video game on a handheld system ought to feel--like a miniaturized version of its console cousin without any compromises or cutbacks."}, {"name": "Contra: Shattered Soldier", "details_link": "https://www.metacritic.com/game/playstation-2/contra-shattered-soldier", "publisher": "Konami", "release_date": "Oct 22 2002", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/db1c0d14b0e8913373d762453494f7b1-98.jpg", "descriptions": "All of the legendary action and adrenaline of the famed Contra series comes to the PS2. Massive, screen-filling boss characters, a Contra series staple, do everything they can to keep players from proceeding through the multiple action-packed missions, while environmental threats such asAll of the legendary action and adrenaline of the famed Contra series comes to the PS2. Massive, screen-filling boss characters, a Contra series staple, do everything they can to keep players from proceeding through the multiple action-packed missions, while environmental threats such as swarms of bugs, aggressive enemies and alien encounters keep players on their toes. [Konami]… Expand"}, {"name": "Freekstyle", "details_link": "https://www.metacritic.com/game/gamecube/freekstyle", "publisher": "EA Sports", "release_date": "Sep  5 2002", "developers": ["Page 44 Studios"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/cf9232f1c37eeea3dfd452bc0b8a5ffe-98.jpg", "descriptions": "Picture flying through rugged terrain performing massive jumps at more than 70 mph, hitting a 40-foot jump at the ledge of a 200-foot cliff, and pulling off a backflip, a Tsunami, and a 360 all before you land. In Freekstyle, you can perform these tricks on nine different tracks. Choose fromPicture flying through rugged terrain performing massive jumps at more than 70 mph, hitting a 40-foot jump at the ledge of a 200-foot cliff, and pulling off a backflip, a Tsunami, and a 360 all before you land. In Freekstyle, you can perform these tricks on nine different tracks. Choose from any of eight different riders with their own unique attitude and style, and then fly high in Circuit, Race, Freestyle, and Freeride game modes. If this sounds like your idea of a good time, then you're ready for the extreme lifestyle of motoX racing.… Expand"}, {"name": "Dynasty Warriors 3", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-3", "publisher": "Koei", "release_date": "Nov 26 2001", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 78, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/1/0b8d0c9e79a7d6b9e6ee95efd38bcade-98.jpg", "descriptions": "Dive into battlefield action with over 20 intense stages and 40 playable warriors. More than 10 stages of varying sizes and objectives have been added to the original game in addition to more troop types, such as the powerful elephant cavalry. [KOEI]"}, {"name": "Shadow of Destiny", "details_link": "https://www.metacritic.com/game/playstation-2/shadow-of-destiny", "publisher": "Konami", "release_date": "Mar  5 2001", "developers": ["Konami"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Fantasy"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/10589eb3bef8cf4a7e5cd4fa523c7145-98.jpg", "descriptions": "Step into the shoes of Eike, a man with the ability to travel through time. With this power, you must travel through changing time periods and use clues from the past to prevent your own murder. The actions you take affect your story path, resulting in one of multiple endings. Once youStep into the shoes of Eike, a man with the ability to travel through time. With this power, you must travel through changing time periods and use clues from the past to prevent your own murder. The actions you take affect your story path, resulting in one of multiple endings. Once you unravel the mystery in nine chapters, you can experience additional scenes. With multiple story paths and a variety of puzzles, Shadow of Destiny puts your dire fate into your own hands.… Expand"}, {"name": "Midnight Club: Street Racing", "details_link": "https://www.metacritic.com/game/playstation-2/midnight-club-street-racing", "publisher": "Rockstar Games", "release_date": "Oct 25 2000", "developers": ["Angel Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/4a81687109692347c19f9670526ed82f-98.jpg", "descriptions": "In secret gatherings around the world, a mysterious group of urban street racers known as the Midnight Club race for pride, power, and glory in sleekly customized, tricked-out sports cars. As a New York City cabdriver, you stumble upon this secret organization and decide to try somethingIn secret gatherings around the world, a mysterious group of urban street racers known as the Midnight Club race for pride, power, and glory in sleekly customized, tricked-out sports cars. As a New York City cabdriver, you stumble upon this secret organization and decide to try something new. Before you know it, you're speeding through crowded streets, running red lights, terrorizing pedestrians, driving on sidewalks, and outrunning the cops. Race anywhere in New York and London and win the pink slips of opposing players.… Expand"}, {"name": "Swing Away Golf", "details_link": "https://www.metacritic.com/game/playstation-2/swing-away-golf", "publisher": "Electronic Arts", "release_date": "Oct 25 2000", "developers": ["T&E Soft"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/c511a328667a2a521683d63c77c3e868-98.jpg", "descriptions": "Swing Away Golf is a game whose features and execution could barely be explained by a book, let alone by a review."}, {"name": "Harvest Moon 64", "details_link": "https://www.metacritic.com/game/nintendo-64/harvest-moon-64", "publisher": "Natsume", "release_date": "Nov 30 1999", "developers": ["Victor Interactive Software"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Strategy", "Breeding/Constructing"], "meta_score": 78, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/b527752ed3017d38ce4f9bd4992c9bca-98.jpg", "descriptions": "In Harvest Moon 64, you'll work hard to make a life for yourself on the run-down farm that you've inherited from your dearly departed grandfather.  It will take careful planning and a lot of help from your neighbors to ride out the seasons and succeed as a gentleman farmer.  Harvest Moon 64In Harvest Moon 64, you'll work hard to make a life for yourself on the run-down farm that you've inherited from your dearly departed grandfather.  It will take careful planning and a lot of help from your neighbors to ride out the seasons and succeed as a gentleman farmer.  Harvest Moon 64 has all the charm of the original Super Nintendo classic, plus many new surprises.… Expand"}, {"name": "Sphinx and the Cursed Mummy", "details_link": "https://www.metacritic.com/game/playstation-2/sphinx-and-the-cursed-mummy", "publisher": "THQ", "release_date": "Nov 10 2003", "developers": ["Eurocom Entertainment Software"], "platforms": ["PC", "Switch", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/1fd4a72044ab1f94697994bb44c4f466-98.jpg", "descriptions": "An original 3rd person action-adventure inspired by the mythology of Ancient Egypt. Traveling the world via magical portals to foil the evil plans of Set, Shinx's journey will require all his wits, agility, and special powers. He will also rely on his reluctant hero friend, The Mummy, toAn original 3rd person action-adventure inspired by the mythology of Ancient Egypt. Traveling the world via magical portals to foil the evil plans of Set, Shinx's journey will require all his wits, agility, and special powers. He will also rely on his reluctant hero friend, The Mummy, to help when being inconspicuous is the only solution. By finding the stolen magical crowns of Egypt, Sphinx can stop Set and save the world. [THQ]… Expand"}, {"name": "Skylanders: Spyro's Adventure", "details_link": "https://www.metacritic.com/game/xbox-360/skylanders-spyros-adventure", "publisher": "Activision", "release_date": "Oct 16 2011", "developers": ["Toys for Bob"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 78, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/1e09b8a1f266219ff673501377c8c0a7-98.jpg", "descriptions": "The small purple dragon returns, bringing with him new friends in this peripheral-based adventure."}, {"name": "AI: The Somnium Files", "details_link": "https://www.metacritic.com/game/playstation-4/ai-the-somnium-files", "publisher": "Spike Chunsoft", "release_date": "Sep 17 2019", "developers": ["Spike Chunsoft"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/3fb494372b1a0a3cf70179a8faec1a24-98.jpg", "descriptions": "Play as detective Kaname Date on the case of an elusive serial killer in this thrilling, sci-fi murder mystery."}, {"name": "Lost Ember", "details_link": "https://www.metacritic.com/game/pc/lost-ember", "publisher": "Mooneye Studios", "release_date": "Nov 22 2019", "developers": ["Mooneye Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/0f5b331004a018d0897406b187f11058-98.jpg", "descriptions": "A beautiful world holds the secrets of its past for you and your companion to uncover. Play any animal you meet to see the world from new perspectives and chase your destiny in the exploration adventure Lost Ember."}, {"name": "NHL 17", "details_link": "https://www.metacritic.com/game/playstation-4/nhl-17", "publisher": "EA Sports", "release_date": "Sep 13 2016", "developers": ["EA Canada", "EA Vancouver"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 78, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/8bafc66eedb621bddf44b866705d293a-98.jpg", "descriptions": "NHL 17 introduces three new modes that connect you to the sport to live out your hockey fantasy. The new Draft Champions mode introduces the fantasy draft with fast rounds of superstar picks. For the first time in EA SPORTS NHL history, the World Cup of Hockey game mode lets you take to theNHL 17 introduces three new modes that connect you to the sport to live out your hockey fantasy. The new Draft Champions mode introduces the fantasy draft with fast rounds of superstar picks. For the first time in EA SPORTS NHL history, the World Cup of Hockey game mode lets you take to the ice on a global stage and compete with your national hockey heroes. The next generation of Be a GM introduces Franchise Mode where you answer directly to the owner and take total control of the team and the business, from fan concessions to promotional nights to the arena and city you compete in. NHL 17 also brings gameplay control over every inch of the ice. The new Net Battle system lets you fight for that critical space in front of the crease on offense and defense. Authentic goaltenders both look and play the part with true-to-life stances and smarter Reactionary Save Intelligence that lets goalies read and react with an athletic save or get big with the body to block the puck. Improved hitting, passing, puck pick-ups and skating let you own every zone and dozens of new goal celebrations bring the crowd to their feet making your biggest moments memorable. [Electronic Arts]… Expand"}, {"name": "Madden NFL 12", "details_link": "https://www.metacritic.com/game/xbox-360/madden-nfl-12", "publisher": "EA Sports", "release_date": "Aug 30 2011", "developers": ["EA Tiburon"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 78, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/4c0cad592e1e4ce74b975d1d507c53c7-98.jpg", "descriptions": "Madden NFL 12 is the newest iteration in the Madden football series."}, {"name": "inFamous: Festival of Blood", "details_link": "https://www.metacritic.com/game/playstation-3/infamous-festival-of-blood", "publisher": "SCEA", "release_date": "Oct 25 2011", "developers": ["Sucker Punch"], "platforms": "PlayStation 3", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "Open-World"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/f35cb10edd04c5568a8d9fdf6a94834c-98.jpg", "descriptions": "Vampires swarm New Marais, and revered superhero Cole MacGrath has been bitten. To save his soul and city, he has just one night to find and kill the head vampire. Featuring hours of new gameplay, themed environment settings and new characters/enemies, Festival of Blood explores the darkerVampires swarm New Marais, and revered superhero Cole MacGrath has been bitten. To save his soul and city, he has just one night to find and kill the head vampire. Featuring hours of new gameplay, themed environment settings and new characters/enemies, Festival of Blood explores the darker side of the inFAMOUS universe. … Expand"}, {"name": "A Way Out", "details_link": "https://www.metacritic.com/game/playstation-4/a-way-out", "publisher": "Electronic Arts", "release_date": "Mar 23 2018", "developers": ["Hazelight"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/7a65cb94a348d48992b30768e9002498-98.jpg", "descriptions": "The story of A Way Out begins in prison with two separate inmates, Leo and Vincent, who don’t know each other. While their individual stories progress, players have to build a relationship based on trust as they break both men out of prison into the world beyond. This co-op only experienceThe story of A Way Out begins in prison with two separate inmates, Leo and Vincent, who don’t know each other. While their individual stories progress, players have to build a relationship based on trust as they break both men out of prison into the world beyond. This co-op only experience is meant to be played together with a friend on a couch or online. A Way Out is a game uniquely tailored for two players to work together no matter the situation. Through a compelling narrative, Leo and Vincent will embark on an emotional adventure, where they live some memorable action moments that they face together including car chases, stealth passages, melee fights, shootouts and many more. [Electronic Arts]… Expand"}, {"name": "The Sims 4: City Living", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-city-living", "publisher": "Electronic Arts", "release_date": "Nov  1 2016", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 78, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/b1df016ea9cd0ff6a87a822a0778e877-98.jpg", "descriptions": "Take your Sims to the city and explore everything it has to offer, from bustling action outside your door, to unique situations that come only with apartment living.\r Fulfil your Sims' dreams it in the vibrant city of San Myshuno. Explore diverse neighbourhoods and cultural festivals whereTake your Sims to the city and explore everything it has to offer, from bustling action outside your door, to unique situations that come only with apartment living.\r Fulfil your Sims' dreams it in the vibrant city of San Myshuno. Explore diverse neighbourhoods and cultural festivals where your Sims can watch street performers, enter competitions, and meet different walks of life. Find your Sims' first apartment, but be ready for the challenges that come with living in close quarters with other Sims. Work your way up from a charming but distressed starter unit to the penthouse of your Sims' dreams. Launch new, metropolitan careers.… Expand"}, {"name": "Rock Band Blitz", "details_link": "https://www.metacritic.com/game/playstation-3/rock-band-blitz", "publisher": "Harmonix Music Systems", "release_date": "Aug 28 2012", "developers": ["Harmonix Music Systems"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 78, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/976013a7d7d5dc69f4a17c32ae69d373-98.jpg", "descriptions": "Rock Band Blitz is the first download-only entry in the Rock Band franchise from Harmonix."}, {"name": "Lost Odyssey", "details_link": "https://www.metacritic.com/game/xbox-360/lost-odyssey", "publisher": "Microsoft Game Studios", "release_date": "Feb 12 2008", "developers": ["Mistwalker"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 78, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/43d08b11d8522844a6f0605200f7ccfc-98.jpg", "descriptions": "Lost Odyssey is the story of Kaim, an immortal character who has lived more than 1,000 years. He doesn't remember his past, and he doesn't know where his future lies. Throughout Kaim's journey, a handful of characters join him on an odyssey to discover their intricate past and destiny,Lost Odyssey is the story of Kaim, an immortal character who has lived more than 1,000 years. He doesn't remember his past, and he doesn't know where his future lies. Throughout Kaim's journey, a handful of characters join him on an odyssey to discover their intricate past and destiny, leading players through a dramatic story of massive scale. Massively multiplayer online role-playing game elements are blended into the game's traditional role-playing game system, enabling players to make strategic decisions for a more immersive and deep gameplay experience. With story sequences penned by award-winning Japanese novelist Kiyoshi Shigematsu in cooperation with producer Hironobu Sakaguchi, Lost Odyssey sets a new benchmark for the RPG genre with a combination of true-to-life cinematics and an intriguing story of an immortal man. Players will witness Kaim's life as he lives through many generations, becomes part of numerous families, falls in and out of love, and confronts all of the conflicts that arise. Kaim’s struggles are set in a world that is on the verge of a \"mystical industrial revolution,\" where mankind has attained dark powers. The massively scoped worlds, memorable characters and epic storyline play as an intense and unsettling blockbuster action film. Heading up the artistic demands of the title is famed Japanese comic artist Takehiko Inoue. Renowned composer Nobuo Uematsu has been recruited to create a contemporary soundtrack. [Microsoft]… Expand"}, {"name": "Rez", "details_link": "https://www.metacritic.com/game/playstation-2/rez", "publisher": "Sega", "release_date": "Jan  7 2002", "developers": ["UGA"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Rail"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/c3270b66c956f172714d339627238730-98.jpg", "descriptions": "Rez is fast-action shooter that takes you deep into the world's computer network. The \"Project K\" Network has recently been upgraded to handle the rapid expansion of the information age and the core, known as \"Eden,\" holds the most advanced artificial intelligence the world has ever seen.Rez is fast-action shooter that takes you deep into the world's computer network. The \"Project K\" Network has recently been upgraded to handle the rapid expansion of the information age and the core, known as \"Eden,\" holds the most advanced artificial intelligence the world has ever seen. Unfortunately, Eden cannot handle the ability to create her own thoughts and buckles under the pressure in an existential breakdown. She is lost deep inside the system, and you're the only one that can bring her back online, saving the world from utter chaos. [Sega]… Expand"}, {"name": "Axiom Verge 2", "details_link": "https://www.metacritic.com/game/pc/axiom-verge-2", "publisher": "Tom Happ", "release_date": "Aug 11 2021", "developers": ["Tom Happ"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 78, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/58010485f5691a34f57798a667a2dcb6-98.jpg", "descriptions": "Life. Afterlife. Real. Virtual. Dream. Nightmare. It’s a thin line. It’s Axiom Verge 2. The sequel to Axiom Verge, Axiom Verge 2 expands on the universe with completely new characters, abilities, and gameplay."}, {"name": "SNK vs. Capcom: Match of the Millennium", "details_link": "https://www.metacritic.com/game/switch/snk-vs-capcom-match-of-the-millennium", "publisher": "SNK Corporation", "release_date": "Feb 17 2021", "developers": ["Code Mystics Inc.", "SNK Corporation"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/d4c55abb03ea23d9b623b0b464bd279e-98.jpg", "descriptions": "It's history in the making when 2 premiere arcade game giants settle the score. The greatest fighters of all time will be crowned when 18 of SNK's and Capcom's most popular characters collide. It's the best of both worlds: fighters, techniques and formats."}, {"name": "Klonoa 2: Dream Champ Tournament", "details_link": "https://www.metacritic.com/game/game-boy-advance/klonoa-2-dream-champ-tournament", "publisher": "Namco", "release_date": "Feb 23 2005", "developers": ["Namco"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/eba8a6dfc1d81144999da3215e67c407-98.jpg", "descriptions": "Floppy-eared hero Klonoa returns in another fast-paced, colorful side-scrolling adventure for the Game Boy Advance. In his latest challenge, Klonoa must race against time and other dream travelers in the Dream Champ Tournament to collect stars, sun and moon stones to become the ultimateFloppy-eared hero Klonoa returns in another fast-paced, colorful side-scrolling adventure for the Game Boy Advance. In his latest challenge, Klonoa must race against time and other dream travelers in the Dream Champ Tournament to collect stars, sun and moon stones to become the ultimate Dream Champion. Combining platform, puzzle and adventure elements, Klonoa 2: Dream Champ Tournament is just the adventure fans of the series have been anticipating. Explore the intricate and puzzle-packed worlds where you’ll meet a wide variety of interesting creatures! Solve Fiendishly-Designed Puzzles — Use Boxes, Bomb Boxes, Switches, Pressure Switches, Goomis, Springs and Scales in your quest for glory. Hoverboard Races — Each world contains a fast-paced thrill ride of gem collecting fun! Master your Skills to Win — Klonoa must prove his skills against other dream travelers in the Dream Champ Tournament.… Expand"}, {"name": "Aokana - Four Rhythms Across the Blue", "details_link": "https://www.metacritic.com/game/switch/aokana---four-rhythms-across-the-blue", "publisher": "PQube", "release_date": "Aug 21 2020", "developers": ["NekoNyan Ltd.", "Sprite"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/91002fb7bf941a9b34ffa5499e022080-98.jpg", "descriptions": "Welcome to a world where people fly freely through the power of anti-gravity shoes. Become a coach for players who race in the sky and make the acquaintance of four charismatic girls. Follow their adventures as you all grow closer in this emotional story of hope, love and sportsmanship."}, {"name": "For Honor: Marching Fire", "details_link": "https://www.metacritic.com/game/playstation-4/for-honor-marching-fire", "publisher": "Ubisoft", "release_date": "Oct 16 2018", "developers": ["Ubisoft"], "platforms": ["Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/4/75baa446e66829007fc6cfb1e7811acf-98.jpg", "descriptions": "Join the fight as a Knight, Viking, Samurai, or Wu Lin Warrior, and fight for the survival of your people. Play in a variety of modes including PvP, story campaign, PvE, and co-op."}, {"name": "Death Road to Canada", "details_link": "https://www.metacritic.com/game/playstation-4/death-road-to-canada", "publisher": "UKIYO PUBLISHING LIMITED", "release_date": "May  8 2018", "developers": ["Rocketcat Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 78, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/33895b274a10e82d4debf451748ffb83-98.jpg", "descriptions": "Death Road is built to deliver replay value. Everything is randomized: locations, events, survivor appearances, and personalities. There’s a different story every time you play, set in a world that doesn’t take itself too seriously."}, {"name": "Doki Doki Literature Club!", "details_link": "https://www.metacritic.com/game/pc/doki-doki-literature-club!", "publisher": "Team Salvato", "release_date": "Oct  6 2017", "developers": ["Team Salvato"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/0c6f8f1250492fbb2c3d321a7aebb610-98.jpg", "descriptions": "Hi, Monika here!Welcome to the Literature Club! It's always been a dream of mine to make something special out of the things I love. Now that you're a club member, you can help me make that dream come true in this cute game!\n\nEvery day is full of chit-chat and fun activities with all of myHi, Monika here!Welcome to the Literature Club! It's always been a dream of mine to make something special out of the things I love. Now that you're a club member, you can help me make that dream come true in this cute game!Every day is full of chit-chat and fun activities with all of my adorable and unique club members:Sayori, the youthful bundle of sunshine who values happiness the most;Natsuki, the deceivingly cute girl who packs an assertive punch;Yuri, the timid and mysterious one who finds comfort in the world of books;...And, of course, Monika, the leader of the club! That's me!I'm super excited for you to make friends with everyone and help the Literature Club become a more intimate place for all my members. But I can tell already that you're a sweetheartwill you promise to spend the most time with me?… Expand"}, {"name": "Far Cry Instincts Evolution", "details_link": "https://www.metacritic.com/game/xbox/far-cry-instincts-evolution", "publisher": "Ubisoft", "release_date": "Mar 28 2006", "developers": ["Ubisoft Montreal"], "platforms": "Xbox", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/ce27a06251e5be0b6cbb4d4987e635bb-98.jpg", "descriptions": "Jack Carver thought he'd found paradise. But when a gorgeous woman draws him in on a dangerous heist, their sun drenched days take a chilling turn. Hunted for a murder he didn't commit, Jack must draw on his most savage instincts to make his predators his prey. The ultimate predator evolves:Jack Carver thought he'd found paradise. But when a gorgeous woman draws him in on a dangerous heist, their sun drenched days take a chilling turn. Hunted for a murder he didn't commit, Jack must draw on his most savage instincts to make his predators his prey. The ultimate predator evolves: Become stronger, faster and more powerful than ever with new and enhanced feral abilities. Power new weapons and vehicles: Destroy enemies with poisonous darts, Molotov cocktails and explosive pipe bombs. Take control of powerful new vehicles like pirate sampan boats, armored technical pickup-trucks and heavy transport trucks. Build an online paradise: Create custom maps to play and share on Xbox Live - backwards compatible with the original Far Cry Instincts. Updated and more customizable multiplayer: Includes the new \"Seek and Secure\" mode, as well as classic multiplayer modes - Chaos, Team Chaos, Steal the Sample and Predator.… Expand"}, {"name": "Fallout 4 VR", "details_link": "https://www.metacritic.com/game/pc/fallout-4-vr", "publisher": "Bethesda Softworks", "release_date": "Dec 11 2017", "developers": ["Bethesda Game Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 78, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/4/ccd392e2624452538856dfd4c4d6ec1c-98.jpg", "descriptions": "Fallout 4, the legendary post-apocalyptic adventure from Bethesda Game Studios and winner of more than 200 'Best Of' awards, including the DICE and BAFTA Game of the Year, finally comes in its entirety to VR. Fallout 4 VR includes the complete core game with all-new combat, crafting, andFallout 4, the legendary post-apocalyptic adventure from Bethesda Game Studios and winner of more than 200 'Best Of' awards, including the DICE and BAFTA Game of the Year, finally comes in its entirety to VR. Fallout 4 VR includes the complete core game with all-new combat, crafting, and building systems fully reimagined for virtual reality. The freedom of exploring the wasteland comes alive like never before. As the sole survivor of Vault 111, you enter a world destroyed by nuclear war. Every second is a fight for survival, and every choice is yours. Only you can rebuild and determine the fate of the Wasteland. Welcome home.… Expand"}, {"name": "Indivisible", "details_link": "https://www.metacritic.com/game/pc/indivisible", "publisher": "505 Games", "release_date": "Oct  8 2019", "developers": ["Lab Zero Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/f66c6c251958dd3b836d2a53b2b00cf9-98.jpg", "descriptions": "INDIVISIBLE is inspired by classics like Valkyrie Profile and Metroid, and has the unique character, world, and gameplay depth Lab Zero is known for.\r Meet Ajna, Indivisible protagonist.\r\n\r\nAjna is a headstrong girl raised in a remote village. Her father, the town's guardian, has trainedINDIVISIBLE is inspired by classics like Valkyrie Profile and Metroid, and has the unique character, world, and gameplay depth Lab Zero is known for.\r Meet Ajna, Indivisible protagonist.\r Ajna is a headstrong girl raised in a remote village. Her father, the town's guardian, has trained her to be strong in mind and body to prepare her for things to come. Ajna discovers a mysterious power in herself, and sets off on a world-spanning journey. Along the way, a number of unique heroes will join her on her quest.… Expand"}, {"name": "Transformers: Fall of Cybertron", "details_link": "https://www.metacritic.com/game/pc/transformers-fall-of-cybertron", "publisher": "Activision", "release_date": "Aug 20 2012", "developers": ["High Moon Studios", "Mercenary Technologies"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/d92fb3d5cc2abd9cc7cbd9197d82e31b-98.jpg", "descriptions": "This follow-up to 2010's War for Cybertron depicts the final hours of the civil war that led the Autobots and Decepticons to abandon their home planet."}, {"name": "Gurumin: A Monstrous Adventure", "details_link": "https://www.metacritic.com/game/psp/gurumin-a-monstrous-adventure", "publisher": "Mastiff", "release_date": "Feb 12 2007", "developers": ["Falcom"], "platforms": ["3DS", "PC", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/8f4c012a78dc16d88d8e1566ff53a1bf-98.jpg", "descriptions": "Gurumin stars a strong-willed girl named Parin, who is sent to live with her grandfather in a small mining town while her parents are off excavating an ancient ruin. With no other children living in this town, Parin is surprised one day to encounter a young girl being tormented by a strayGurumin stars a strong-willed girl named Parin, who is sent to live with her grandfather in a small mining town while her parents are off excavating an ancient ruin. With no other children living in this town, Parin is surprised one day to encounter a young girl being tormented by a stray dog. After Parin drives off the mongrel, she is shocked to discover the young girl is actually a monster, and like all monsters, invisible to adults. Parin is soon invited to pass through a crack in the wall behind her home and enter Monster Village. Parin has just started making monster friends when evil spirits, known as the Phantoms, invade the village and monsternap most of the inhabitants. Parin soon learns of the Legendary Drill, a weapon hidden underneath the village and, in the right hands, powerful enough to destroy the Phantoms. Thus begins Parin's quest to reclaim the Legendary Drill and set the world right. Features Non-linear game play set in vast world with a variety of stages in different environments. 23 non-player characters, 48 unique enemies, and over 90 items to collect. Destroy everything in your path with your legendary drill: almost all objects are destructible, and many hide money and valuable items. [Mastiff Games]… Expand"}, {"name": "Vanquish", "details_link": "https://www.metacritic.com/game/pc/vanquish", "publisher": "Sega", "release_date": "May 25 2017", "developers": ["PlatinumGames"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 78, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/9/f92661d7742e55f78f0ea2a88bdf07ad-98.jpg", "descriptions": "Directed by Shinji Mikami, VANQUISH is a sci-fi shooter of epic proportions with a fast, fluid and frenetic combat system, and an engaging and immersive storyline. Players take the role of Sam, a government agent kitted out with a futuristic battle suit, in a near future world where nationsDirected by Shinji Mikami, VANQUISH is a sci-fi shooter of epic proportions with a fast, fluid and frenetic combat system, and an engaging and immersive storyline. Players take the role of Sam, a government agent kitted out with a futuristic battle suit, in a near future world where nations war over the planet's remaining energy resources. A versatile fighter with a huge arsenal of weaponry at his disposal, Sam also has an array of martial arts skills that he can use to take down his robot enemies.… Expand"}, {"name": "Octahedron: Transfixed Edition", "details_link": "https://www.metacritic.com/game/switch/octahedron-transfixed-edition", "publisher": "Square Enix", "release_date": "Jan 17 2019", "developers": ["Demimonde"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/fe7304f54034faea0b8c03fb3d595c09-98.jpg", "descriptions": "Surf through a pulsating underworld on platforms YOU pull from thin air, where and when you want, in this psychedelic action platformer. Unlock devastating abilities across 50+ hand crafted levels as you defy gravity to a pumping beat.\r Fry enemies with laser beams, crumble walls, andSurf through a pulsating underworld on platforms YOU pull from thin air, where and when you want, in this psychedelic action platformer. Unlock devastating abilities across 50+ hand crafted levels as you defy gravity to a pumping beat.\r Fry enemies with laser beams, crumble walls, and solve puzzles, while obstacles & enemies move along with the beat. Ascend through the subterranean world of Veetragoul as you lose yourself to a pulse-pounding soundtrack from Chipzel, Andre Sobota, Derek Howell and Monomirror.\r Enjoy brand new features & content exclusive to the Transfixed Edition: New time trial medals, dozens of new special challenges and new post-game unlockables … Expand"}, {"name": "Madden NFL 07", "details_link": "https://www.metacritic.com/game/psp/madden-nfl-07", "publisher": "EA Sports", "release_date": "Aug 22 2006", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/5ac7bad8b5105e71cc32923836c8e097-98.jpg", "descriptions": "With the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback andWith the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback and smash through, overpower, or slash away from would-be tacklers as you fight for every yard. Innovative rushing controls give you a game-breaking ground attack featuring all-new jukes, cutbacks, and the distinct running styles of your favorite backs. [Electronic Arts]… Expand"}, {"name": "FIFA Soccer 06", "details_link": "https://www.metacritic.com/game/pc/fifa-soccer-06", "publisher": "EA Sports", "release_date": "Oct  4 2005", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PC"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/03fb70199794a14e4a3a9c0388294a16-98.jpg", "descriptions": "FIFA Soccer 06 brings the total football experience to your fingertips. It delivers a combination of attacking gameplay, complete customization, pure authenticity and the deepest manager mode ever. Intuitive gameplay enables you to command every move of your player with pinpoint accuracy.FIFA Soccer 06 brings the total football experience to your fingertips. It delivers a combination of attacking gameplay, complete customization, pure authenticity and the deepest manager mode ever. Intuitive gameplay enables you to command every move of your player with pinpoint accuracy. Passing, shooting and tackling is now more responsive than ever and enables you to trap, shield and dribble like a world-class football player. Experience 90 minutes of heart pumping football, feel the Team Chemistry of your side and the sense of momentum shift as you battle for supremacy on the pitch. As the Midfield General you'll control the overarching strategy of the game, dictating the pace and performance of your players as you execute strategic decisions on the fly using the tactical play button configurations. [EA Sports]… Expand"}, {"name": "Yoshi's Woolly World", "details_link": "https://www.metacritic.com/game/wii-u/yoshis-woolly-world", "publisher": "Nintendo", "release_date": "Oct 16 2015", "developers": ["Good-Feel"], "platforms": ["3DS", "Wii U"], "genres": ["Action Adventure", "Platformer", "2D", "Fantasy", "Action", "Platformer", "2D"], "meta_score": 78, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/2dfd56d08afa3fb52ce724684a378367-98.jpg", "descriptions": "Take Yoshi on an adventure to remember in Yoshi Land for Nintendo Wii U. Enjoy dual-screen control thanks to the Wii U Touchscreen GamePad, while you'll also be able to experience full integration with Nintendo's MiiVerse service."}, {"name": "Stellaris", "details_link": "https://www.metacritic.com/game/pc/stellaris", "publisher": "Paradox Interactive", "release_date": "May  9 2016", "developers": ["Paradox Development Studio"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Strategy", "Real-Time", "General"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/fdee374034f57d3d1966dba66ce15939-98.jpg", "descriptions": "Featuring deep strategic gameplay, an enormous selection of alien races and emergent storytelling, Stellaris has a deeply challenging system that rewards interstellar exploration as you traverse, discover, interact and learn more about the multitude of species you will encounter during yourFeaturing deep strategic gameplay, an enormous selection of alien races and emergent storytelling, Stellaris has a deeply challenging system that rewards interstellar exploration as you traverse, discover, interact and learn more about the multitude of species you will encounter during your travels. Etch your name across the cosmos by uncovering remote celestial outposts,and entire civilizations. Will you expand through war or walk the path of diplomacy to achieve your goals?… Expand"}, {"name": "The House of the Dead: Overkill", "details_link": "https://www.metacritic.com/game/wii/the-house-of-the-dead-overkill", "publisher": "Sega", "release_date": "Feb 10 2009", "developers": ["Headstrong Games"], "platforms": "Wii", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/ed59436fa0a78ccd7b19f32c40cfcb49-98.jpg", "descriptions": "The House of the Dead: Overkill charges you with mowing down waves of infected, blood-thirsty zombies in a last-ditch effort to survive Bayou City and uncover the horrific truth behind the origins of The House of the Dead. A pulp-style take on the classic SEGA light-gun shoot 'em upThe House of the Dead: Overkill charges you with mowing down waves of infected, blood-thirsty zombies in a last-ditch effort to survive Bayou City and uncover the horrific truth behind the origins of The House of the Dead. A pulp-style take on the classic SEGA light-gun shoot 'em up franchise. Back when the famous Agent G was still fresh out of the academy, he teamed up with hard-boiled bad-ass Agent Washington to investigate stories of mysterious disappearances in small-town Louisiana. Little did they know what blood-soaked mutant horror would await them in the streets and swamps of Bayou City. Pulp Funk Horror - Zombie cool, one of the most popular shooter classics injected with a whole new retro b-movie look. An utterly in-your-face zombie-dismembering blast. Non-stop light-gun style action on Wii, blow apart zombies for high-score thrills. Co-op action on Wii. Bring a friend and play the game as intended in your own buddy action movie as two of the meanest mofos in video gaming. Relentless, gore-drenched, over-the-top action - Only the coolest, most cold-hearted agent’s going to keep his head against the zombie flood. Use \"Slow-Mofo Time\" to make the perfect head-popping shot and \"Evil Eye\" to spot moments of opportunity that’ll send the whole environment up in flames. Wiimote reactions. Get knee-deep in the dead with motion-sensitive Wii-controls. Shuck a shotgun and when the zombies get too close, pistol whip jaws off or cave some heads in with the stock of your pump-action - all in stomach-churning close-up. [Sega]… Expand"}, {"name": "River City Girls 2", "details_link": "https://www.metacritic.com/game/switch/river-city-girls-2", "publisher": "Arc System Works", "release_date": "Dec 15 2022", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 78, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/2/455ef2339167b87010fdd6080d2f6113-98.jpg", "descriptions": "The River City Girls are ready for round 2! When an old foe resurfaces, Misako, Kyoko, Kunio, and Riki - joined by newcomers Marian and Provie - hit the streets for an all-new beat-'em-up adventure packed with new abilities, enemies, environments, and more! Team up for local or onlineThe River City Girls are ready for round 2! When an old foe resurfaces, Misako, Kyoko, Kunio, and Riki - joined by newcomers Marian and Provie - hit the streets for an all-new beat-'em-up adventure packed with new abilities, enemies, environments, and more! Team up for local or online co-op, then pound punks into the dirt with brand-new guard-crush attacks, lift-off combos, double-team maneuvers, and other knuckle-busting techniques! Level-up to earn new moves, buy items and accessories in more than 30 shops, and recruit defeated foes and hired heavies to help you on your way!River City is bigger than ever, with more locations to explore, more objects to destroy, and a day-night cycle! With nonlinear gameplay, a dynamic story system, and another epic soundtrack by Megan McDuffee, River City Girls 2 will keep you brawling until all your enemies yell \"BARF!\"… Expand"}, {"name": "Cotton Fantasy", "details_link": "https://www.metacritic.com/game/switch/cotton-fantasy", "publisher": "ININ Games", "release_date": "May 20 2022", "developers": ["Success", "Studio Saizensen"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/3ba0190313f21503b451569fc0139c7a-98.jpg", "descriptions": "Something sinister is in the making – the willows are vanishing from Fairyland and the Fairy Queen entrusts Silk with solving the case. Who could be behind this devious ploy? For a promised lifetime all-you-can-eat supply of tasty willows, the little witch Nata de Cotton is willing to helpSomething sinister is in the making – the willows are vanishing from Fairyland and the Fairy Queen entrusts Silk with solving the case. Who could be behind this devious ploy? For a promised lifetime all-you-can-eat supply of tasty willows, the little witch Nata de Cotton is willing to help her old friend out and embark on yet another adventure together, to save the Fairyland. Experience the most precise gameplay in the Cotton series, mixing up the iconic Cotton playstyle with a few new shoot ‘em up mechanics, 6 iconic playable characters and 16 colourful and varied stages to unlock, with vertical, horizontal and 3D movement. Each character has their own mechanics and attacks, creating a lot of variation and replayability on your hunt for the high score. Packaged with a light-hearted story full of charming, fun cutscenes, fully-voiced in Japanese, and an exhilarating soundtrack with iconic remastered tracks from the past, this is a great and accessible new shoot ’em up game for fans of the Cotton series and newcomers alike.… Expand"}, {"name": "Immortals Fenyx Rising", "details_link": "https://www.metacritic.com/game/switch/immortals-fenyx-rising", "publisher": "Ubisoft", "release_date": "Dec  3 2020", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Action Adventure", "Open-World"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/8ff96102f2d064c7c251a06a3c2ac82c-98.jpg", "descriptions": "Play as Fenyx, a new winged demigod, on a quest to save the Greek gods and their home from a dark curse. Take on mythological beasts, master the legendary powers of the gods, and defeat Typhon, the deadliest Titan in Greek mythology, in an epic fight for the ages."}, {"name": "The Jackbox Party Pack 5", "details_link": "https://www.metacritic.com/game/switch/the-jackbox-party-pack-5", "publisher": "Jackbox Games, Inc.", "release_date": "Oct 17 2018", "developers": ["Jackbox Games", "Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/260b4be2f63a1dc0cbfcfca20f989379-98.jpg", "descriptions": "It’s the biggest Party Pack yet, including the return of the classic pop culture trivia mash-up YOU DON'T KNOW JACK: Full Stream; the game of hilarious hypotheticals Split the Room; the lyric-writing, robot rap battle Mad Verse City; the inventive drawing game Patently Stupid; and the outerIt’s the biggest Party Pack yet, including the return of the classic pop culture trivia mash-up YOU DON'T KNOW JACK: Full Stream; the game of hilarious hypotheticals Split the Room; the lyric-writing, robot rap battle Mad Verse City; the inventive drawing game Patently Stupid; and the outer space fling-fest Zeeple Dome. Use your phones or tablets as controllers and play with up to 8 players, plus an audience of up to 10,000.… Expand"}, {"name": "Super Rude Bear Resurrection", "details_link": "https://www.metacritic.com/game/playstation-4/super-rude-bear-resurrection", "publisher": "Alex Rose", "release_date": "May  2 2017", "developers": ["Alex Rose"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/0b007ae04a9ebd0fc59b5e5221c06ce4-98.jpg", "descriptions": "Super Rude Bear Resurrection is an ultra-tight, masocore platformer that anyone can beat. Every time you die, your previous bodies stack up and you can jump on them, push them around and use them as shields. Each death makes the game slightly easier, but it’s possible to beat the whole gameSuper Rude Bear Resurrection is an ultra-tight, masocore platformer that anyone can beat. Every time you die, your previous bodies stack up and you can jump on them, push them around and use them as shields. Each death makes the game slightly easier, but it’s possible to beat the whole game without dying at all. [Playstation.com]… Expand"}, {"name": "Bomberman Land Touch!", "details_link": "https://www.metacritic.com/game/ds/bomberman-land-touch!", "publisher": "Atlus", "release_date": "Nov  7 2006", "developers": ["Hudson"], "platforms": "DS", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "General", "Action"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/644aad08919b7381b65d2b81fec4f3a0-98.jpg", "descriptions": "Explore the pirate theme park Bomber Island as the cheerful Bomberman. Trigger special events and solve puzzles to further the story. Take on CPU opponents in various attractions to earn items and gate keys. Complete the quest to become the Pirate King, and to unlock a special reward forExplore the pirate theme park Bomber Island as the cheerful Bomberman. Trigger special events and solve puzzles to further the story. Take on CPU opponents in various attractions to earn items and gate keys. Complete the quest to become the Pirate King, and to unlock a special reward for experienced gamers. Story Mode and Attraction Mode take full advantage of the Touch Screen and stylus. Besides everybody’s favorite, the classic Bomberman, there are tons of interesting characters to interact with. Up to 8-Player Wireless Single-Card Play! Attraction Mode and Battle Mode both support wireless multiplayer action with only one Game Card required. A 15-hour Story Mode, 36 stages in the Attraction Mode, and 20 stages in the Battle Mode. [Atlus]… Expand"}, {"name": "Big Bang Mini", "details_link": "https://www.metacritic.com/game/ds/big-bang-mini", "publisher": "SouthPeak Games", "release_date": "Jan 21 2009", "developers": ["Arkedo Studio"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/dd7318fe2fe1c5041f127d0aac03816c-98.jpg", "descriptions": "In Big Bang Mini, your main objective is to use the stylus to create fireworks and destroy the waves of enemies that loom overhead. Miss and you’ll be forced to tackle another challenge - avoiding the sparks created by your falling fireworks. Celebrate the completion of a level by designingIn Big Bang Mini, your main objective is to use the stylus to create fireworks and destroy the waves of enemies that loom overhead. Miss and you’ll be forced to tackle another challenge - avoiding the sparks created by your falling fireworks. Celebrate the completion of a level by designing the Final Bouquet – a one-of-a-kind masterpiece that will proclaim your victory. [SouthPeak Interactive]… Expand"}, {"name": "Mortal Kombat 11", "details_link": "https://www.metacritic.com/game/switch/mortal-kombat-11", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 23 2019", "developers": ["NetherRealm Studios", "Shiver Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 78, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/5/30db7641e5660c49f6a67d2b58d2aa4e-98.jpg", "descriptions": "Mortal Kombat is back and better than ever in the next evolution of the iconic franchise. The all new Custom Character Variations give you unprecedented control to customize the fighters and make them your own. The new graphics engine showcasing every skull-shattering, eye-popping moment,Mortal Kombat is back and better than ever in the next evolution of the iconic franchise. The all new Custom Character Variations give you unprecedented control to customize the fighters and make them your own. The new graphics engine showcasing every skull-shattering, eye-popping moment, brings you so close to the fight you can feel it. And featuring a roster of new and returning Klassic Fighters, Mortal Kombat's best in class cinematic story mode continues the epic saga over 25 years in the making.… Expand"}, {"name": "SIREN: Blood Curse", "details_link": "https://www.metacritic.com/game/playstation-3/siren-blood-curse", "publisher": "SCEA", "release_date": "Jul 24 2008", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/f69218314a0e2c58a4a389df970b4b47-98.jpg", "descriptions": "[Playstation Network]  Blood-splattered episodes of this Japanese Survival Horror are available as downloads, keeping you on the edge of your seat until the next episode arrives. The story follows a TV crew from America, who has journeyed to research and film an exposé on the urban myth of[Playstation Network]  Blood-splattered episodes of this Japanese Survival Horror are available as downloads, keeping you on the edge of your seat until the next episode arrives. The story follows a TV crew from America, who has journeyed to research and film an exposé on the urban myth of Hanuda, the Vanished Village. Frozen in the 1970s and surrounded by a red sea, it is said that an ancient curse has been set upon this town. The introduction of western characters to Siren Blood Curse brings a new dimension to the series and, in order to survive, they must defend themselves from the vicious Shibito, the living dead, and other terrifying monsters. Throughout the game you play each of the visitors to the village, while the game's unique Sight-Jack System enables you to switch seamlessly between the visions of the hunted and the hunters. As the plot thickens you discover you are stuck in a time loop in which events eternally repeat and change. [Sony]… Expand"}, {"name": "WWE '13", "details_link": "https://www.metacritic.com/game/xbox-360/wwe-13", "publisher": "THQ", "release_date": "Oct 30 2012", "developers": ["THQ", "Yuke's"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/681b15a73d7f7de9488aa6bee29f77c9-98.jpg", "descriptions": "WWE '13 features the franchise's Creation Suite, enabling players to develop and customize Superstars, entrances, arenas, finishing moves, storylines, highlight reels and more, as well as share and download creations with others from around the world. Furthermore, they compete with an arrayWWE '13 features the franchise's Creation Suite, enabling players to develop and customize Superstars, entrances, arenas, finishing moves, storylines, highlight reels and more, as well as share and download creations with others from around the world. Furthermore, they compete with an array of WWE Superstars and Attitude Era luminaries from a large roster, including cover Superstar CM Punk, Stone Cold Steve Austin, Sheamus, Undertaker, Mankind, Chris Jericho, Big Show and Mark Henry.… Expand"}, {"name": "Hyrule Warriors: Age of Calamity", "details_link": "https://www.metacritic.com/game/switch/hyrule-warriors-age-of-calamity", "publisher": "Nintendo", "release_date": "Nov 20 2020", "developers": ["Omega Force", "Koei Tecmo Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/f7f4eaa2b20b40171c034f1e4be1d22b-98.jpg", "descriptions": "See Hyrule 100 years before the Legend of Zelda: Breath of the Wild game and experience the events of the Great Calamity. Join the struggle that brought Hyrule to its knees. Learn more about Zelda, the four Champions, the King of Hyrule and more through dramatic cutscenes as they try to saveSee Hyrule 100 years before the Legend of Zelda: Breath of the Wild game and experience the events of the Great Calamity. Join the struggle that brought Hyrule to its knees. Learn more about Zelda, the four Champions, the King of Hyrule and more through dramatic cutscenes as they try to save the kingdom from Calamity. The Hyrule Warriors: Age of Calamity game is the only way to firsthand see what happened 100 years ago. - Battle hordes of Hyrule’s most formidable foes - From barbaric Bokoblins to towering Lynels, Ganon’s troops have emerged in droves. Playable heroes like Link, Zelda and more must use their distinct abilities to carve through hundreds of enemies to save Hyrule from the impending Calamity.\r… Expand"}, {"name": "Tell Me Why", "details_link": "https://www.metacritic.com/game/xbox-one/tell-me-why", "publisher": "Xbox Game Studios", "release_date": "Aug 27 2020", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/f872167d240ad6d912978a09ee0cd0c3-98.jpg", "descriptions": "Tell Me Why is the latest narrative adventure game from DONTNOD Entertainment, the studio behind the beloved franchise, Life Is Strange. In this intimate thriller, twins Tyler and Alyson Ronan use their special bond to unravel mysteries of their loving but troubled childhood. Set inTell Me Why is the latest narrative adventure game from DONTNOD Entertainment, the studio behind the beloved franchise, Life Is Strange. In this intimate thriller, twins Tyler and Alyson Ronan use their special bond to unravel mysteries of their loving but troubled childhood. Set in beautiful small-town Alaska, Tell Me Why features true-to-life characters, mature themes and gripping choices.… Expand"}, {"name": "Pro Evolution Soccer 2010", "details_link": "https://www.metacritic.com/game/playstation-3/pro-evolution-soccer-2010", "publisher": "Konami", "release_date": "Nov  3 2009", "developers": ["Konami"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "genres": ["Sports", "Traditional", "Team", "Football", "Soccer", "Sim", "Sim", "Sim"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/dddaf1dd36db28de15f819ecad3feccb-98.jpg", "descriptions": "PES 2010 focuses on enhancing the excitement of matches between players, making for a truly challenging experience that constantly tests the player. Intuitive zonal defending covers spaces and players need to look constantly for new ways to attack. PES 2010 focuses on being a real soccerPES 2010 focuses on enhancing the excitement of matches between players, making for a truly challenging experience that constantly tests the player. Intuitive zonal defending covers spaces and players need to look constantly for new ways to attack. PES 2010 focuses on being a real soccer simulation, as it requires both strategic play and quick reactions, as in real life. In addition to key out-field elements, goalkeepers are more versatile and with abilities matching those of modern shot-stoppers. The game's referees have also been reworked, with smarter AI elements allowing them to make more balanced calls during matches. PES 2010 has undergone a major visual revamp, with its celebrated player likenesses and animations now even closer to those of real-life players - including live player expressions to be depicted with an improved lighting system which differentiates between various conditions! [Konami]… Expand"}, {"name": "Hotel Dusk: Room 215", "details_link": "https://www.metacritic.com/game/ds/hotel-dusk-room-215", "publisher": "Nintendo", "release_date": "Jan 22 2007", "developers": ["Cing"], "platforms": "DS", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/9b172b5e87888cf5eb9687fefb06bbd5-98.jpg", "descriptions": "Los Angeles, 1979. You are Kyle Hyde, an ex-cop turned salesman trying to track down a missing friend. Clues lead you to an eerie, old hotel rumored to have one very strange room – a room where wishes are granted. It's up to you to unravel the mystery in Hotel Dusk: Room 215, a gritty newLos Angeles, 1979. You are Kyle Hyde, an ex-cop turned salesman trying to track down a missing friend. Clues lead you to an eerie, old hotel rumored to have one very strange room – a room where wishes are granted. It's up to you to unravel the mystery in Hotel Dusk: Room 215, a gritty new graphic adventure for Nintendo DS. Players hold their DS like a book and use the touch screen to grill characters, search for clues and solve mystifying puzzles. Players follow the plot twists and turns as they hunt for their missing friend and investigate the mysteries of Hotel Dusk. [Nintendo]… Expand"}, {"name": "Severed Steel", "details_link": "https://www.metacritic.com/game/playstation-5/severed-steel", "publisher": "Digerati Distribution", "release_date": "Jul 20 2022", "developers": ["Greylock Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/f4de4360fe003da2cfe07b169f883db6-98.jpg", "descriptions": "Severed Steel is a single-player FPS featuring a fluid stunt system, destructible voxel environments, loads of bullet time, and a unique one-armed protagonist. It's you, your trigger finger, and a steel-toed boot against a superstructure full of bad guys. Chain together wall runs, dives,Severed Steel is a single-player FPS featuring a fluid stunt system, destructible voxel environments, loads of bullet time, and a unique one-armed protagonist. It's you, your trigger finger, and a steel-toed boot against a superstructure full of bad guys. Chain together wall runs, dives, flips, and slides to take every last enemy down.\r Play as Steel, a nimble, one-armed sharpshooter on a mission. There is no reloading - pick your shots well and be ready to pry a loaded weapon from your enemies' cold dead hands.… Expand"}, {"name": "Unbound: Worlds Apart", "details_link": "https://www.metacritic.com/game/switch/unbound-worlds-apart", "publisher": "Digerati Distribution", "release_date": "Jul 28 2021", "developers": ["Alien Pixel Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/bb6af9d30f11ace5490f6c70ec9179c0-98.jpg", "descriptions": "Explore beautiful, hand-crafted Metroidvanian worlds by conjuring different magic portals. Each portal gives you unique abilities to solve puzzles, outsmart abominable creatures, and unravel mysteries."}, {"name": "DARQ: Complete Edition", "details_link": "https://www.metacritic.com/game/switch/darq-complete-edition", "publisher": "Bloober Team", "release_date": "Mar 18 2021", "developers": ["Unfold Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Linear"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/fff709aa4170ee07b68606deead2d119-98.jpg", "descriptions": "DARQ tells the story of Lloyd, a boy who becomes aware of the fact that he is dreaming. To Lloyd's misfortune, the dream quickly turns into a nightmare and all attempts to wake up end in failure. While exploring the darkest corners of his subconscious, Lloyd learns how to survive theDARQ tells the story of Lloyd, a boy who becomes aware of the fact that he is dreaming. To Lloyd's misfortune, the dream quickly turns into a nightmare and all attempts to wake up end in failure. While exploring the darkest corners of his subconscious, Lloyd learns how to survive the nightmare by bending the laws of physics and manipulating the fluid fabric of the dream world.… Expand"}, {"name": "Adios", "details_link": "https://www.metacritic.com/game/pc/adios", "publisher": "Mischief", "release_date": "Mar 16 2021", "developers": ["Mischief"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 78, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/d6fca0ed9999d2ea41d4a75009a11422-98.jpg", "descriptions": "You're a pig farmer in Kansas. It's October. Cold, crisp mornings are the norm, and you have decided that you're no longer okay with letting the mob use your pigs to dispose of bodies. When your old friend - a hitman - arrives with his assistant to deliver another body, you finally screw upYou're a pig farmer in Kansas. It's October. Cold, crisp mornings are the norm, and you have decided that you're no longer okay with letting the mob use your pigs to dispose of bodies. When your old friend - a hitman - arrives with his assistant to deliver another body, you finally screw up the courage to tell them that you're done.Your friend doesn't want you to stop. He knows that there's no such thing as quitting, so he'll try to convince you that you're making a mistake. You spend the day together, doing chores and exploring the nooks and crannies of an authentic environment in the American Midwest alongside the man who will be forced to kill you, if he can't convince you to stay.How you respond will determine the rest of your life.… Expand"}, {"name": "Shady Part of Me", "details_link": "https://www.metacritic.com/game/playstation-4/shady-part-of-me", "publisher": "Focus Home Interactive", "release_date": "Dec 10 2020", "developers": ["Douze Dixiemes"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/930a5e03fc482bb7033d01af4106be78-98.jpg", "descriptions": "Overcome emotional struggles across a touching narrative filled with twists and surprises. Embark on a dream-like journey, with breathtaking artistic direction and the enthralling voice of Hannah Murray (Game of Thrones, Skins)."}, {"name": "Budget Cuts", "details_link": "https://www.metacritic.com/game/playstation-4/budget-cuts", "publisher": "Neat Corporation", "release_date": "Jul 10 2020", "developers": ["Neat Corporation"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/682b636279f7484793eeb67b20586dba-98.jpg", "descriptions": "Put on your PlayStation VR headset to unleash your inner office spy ninja skills and save both your job and your life in this unique PS4 stealth game. As an employee at mega conglomerate TransCorp, your role as a paper shuffling filer has been put under threat by the arrival of cost-cuttingPut on your PlayStation VR headset to unleash your inner office spy ninja skills and save both your job and your life in this unique PS4 stealth game. As an employee at mega conglomerate TransCorp, your role as a paper shuffling filer has been put under threat by the arrival of cost-cutting robots. And as your latest co-worker has been dragged off to the terrifying HR department, your only chance to survive is to take matters into your own hands. \r\rDexterously zip or silently sneak your way through the office, and defend yourself using super sharp letter openers to disable your deadly robotic hunters in close quarter combat.… Expand"}, {"name": "Ibb & Obb", "details_link": "https://www.metacritic.com/game/switch/ibb-obb", "publisher": "Sparpweed", "release_date": "Mar  5 2020", "developers": ["Sparpweed"], "platforms": ["PC", "PlayStation 3", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/2f6ede84ebd36571656f6791a70a05d0-98.jpg", "descriptions": "ibb & obb is a two player cooperative game set in a puzzle filled world where gravity goes both up and down. You can only succeed by working closely together.\r Find a friend for some true local cooperative couch fun or match up online.\r\n\r\nFall up and jump down through 15 levels filled withibb & obb is a two player cooperative game set in a puzzle filled world where gravity goes both up and down. You can only succeed by working closely together.\r Find a friend for some true local cooperative couch fun or match up online.\r Fall up and jump down through 15 levels filled with double gravity puzzles and discover 8 hidden worlds that will test your new non-Newtonian skills to the maximum.… Expand"}, {"name": "Double Dragon & Kunio-kun Retro Brawler Bundle", "details_link": "https://www.metacritic.com/game/switch/double-dragon-kunio-kun-retro-brawler-bundle", "publisher": "Arc System Works", "release_date": "Feb 20 2020", "developers": ["Arc System Works"], "platforms": ["PlayStation 4", "Switch"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/5400fd805f2b047c15b3d6b005015c52-98.jpg", "descriptions": "DOUBLE DRAGON & Kunio-kun Retro Brawler Bundle, consists of 18 titles including 7 DOUBLE DRAGON and Kunio-kun vintage games from the 80’s and 90’s, and all 11 Kunio-kun classic titles from the Family Computer Disk System that have been localized into English for the first time ever. GameDOUBLE DRAGON & Kunio-kun Retro Brawler Bundle, consists of 18 titles including 7 DOUBLE DRAGON and Kunio-kun vintage games from the 80’s and 90’s, and all 11 Kunio-kun classic titles from the Family Computer Disk System that have been localized into English for the first time ever. Game genres vary from side-scrolling action, beat-’em-up, sports, and action RPG. Online play mode is available for all titles, and a total of 55 in-game missions are waiting for you to obtain nicknames and avatars to show off to your friends! Can you complete all the games?… Expand"}, {"name": "Borderlands 3", "details_link": "https://www.metacritic.com/game/playstation-4/borderlands-3", "publisher": "2K Games", "release_date": "Sep 13 2019", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/baab33eeb2b138de497292621cde2677-98.jpg", "descriptions": "At the hard edge of the galaxy lies a group of planets ruthlessly exploited by militarized corporations. Brimming with loot and violence, this is your home – the Borderlands. Answering the call of the Siren champion Lilith, four Vault Hunters charge head-first into a spray of bullets, blood,At the hard edge of the galaxy lies a group of planets ruthlessly exploited by militarized corporations. Brimming with loot and violence, this is your home – the Borderlands. Answering the call of the Siren champion Lilith, four Vault Hunters charge head-first into a spray of bullets, blood, and bandits to recover a map to ancient Vaults and prevent a universe-destroying power from falling into the wrong hands. The rest is history. Fearless renegade mercenaries on the wildest interplanetary treasure hunt of all time. FL4K is a wandering robotic tracker whose cold steel heart warms only for their pet beasts. Amara beats bad guys into pancakes with her psychic fists. Moze’s best friend is a 10-ton walking killing machine. And Zane, the semi-retired corporate hitman... well, he’s Zane.  Hunting Alone? No problem! Shoot and loot your way through the Borderlands, discovering the region’s untold stories and piling high your increasingly deadly cache of goodies and weapons. [2K Games]… Expand"}, {"name": "King's Quest Chapter 5: The Good Knight", "details_link": "https://www.metacritic.com/game/playstation-4/kings-quest-chapter-5-the-good-knight", "publisher": "Sierra Games", "release_date": "Oct 25 2016", "developers": ["The Odd Gentlemen"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/c75b91f8cb331f7e9afc5ba3a3c146f2-98.jpg", "descriptions": "In his latest adventure, King Graham tells of his final battle with the Goblin Sorcerer Manannan and his final adventure."}, {"name": "Prototype", "details_link": "https://www.metacritic.com/game/xbox-360/prototype", "publisher": "Activision", "release_date": "Jun  9 2009", "developers": ["Radical Entertainment"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "Open-World"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/6890bfd8b5f5f0f9f048d711b78099a5-98.jpg", "descriptions": "You are Alex Mercer, the Prototype: a shapeshifter with amazing powers of combat, destruction, and deception. Consume targets for their form and memories to assume a perfect disguise, or instantly transform your body into an array of deadly biological weapons, cutting your way to the heartYou are Alex Mercer, the Prototype: a shapeshifter with amazing powers of combat, destruction, and deception. Consume targets for their form and memories to assume a perfect disguise, or instantly transform your body into an array of deadly biological weapons, cutting your way to the heart of the conspiracy forty years in the making. Stalk the streets of New York City, searching for the life you lead before. Take the form of anyone in your path, using an arsenal of identities to confound, exploit or annihilate your enemies. Mankind is your mask. Wage a secret war against factions with complex agendas of their own, out to capture or kill you. They are your greatest threat and the key to the secrets of your past. Confront them, find those responsible and make them pay. Shapeshifting: Attack with brutal and devastating powers; instantly triggering hundreds of power combinations (Attack, Defensive and Sensory). Disguise: Assume the perfect disguise by transforming into any character and assuming the victim's powers, skills and abilities. New York City is your hunting ground! Jam-packed, vibrant, fully interactive city filled with thousands of people and enemies out to destroy you. Delve to the bottom of a conspiracy that has haunted the American government for decades. Who is responsible for your condition?… Expand"}, {"name": "Project: Snowblind", "details_link": "https://www.metacritic.com/game/playstation-2/project-snowblind", "publisher": "Eidos Interactive", "release_date": "Feb 23 2005", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 2"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/cf37a3acc9ae09fe7418f20c09889f1a-98.jpg", "descriptions": "Experience the dramatic intensity of the frontlines of a war through the eyes of the first of a new breed of super soldiers in this gritty and epic first-person action game. In the not so distant Future, Lt. Nathan Frost is challenged to stop a renegade regime from eradicating the civilizedExperience the dramatic intensity of the frontlines of a war through the eyes of the first of a new breed of super soldiers in this gritty and epic first-person action game. In the not so distant Future, Lt. Nathan Frost is challenged to stop a renegade regime from eradicating the civilized world. Hong Kong, 2065. 2nd Lt. Nathan Frost is just a regular grunt until he volunteers for a super-soldier transformation for an international army called the Liberty Coalition. A painful series of surgeries gives Frost extra-normal abilities via implanted enhancements, which place him on the frontlines of a war against a destructive regime. After a military coup leaves him stranded in hostile territory, cut off from command with only a handful of men, Frost must stop the militia?s secret weapon that threatens to plunge the world into darkness. [Eidos Interactive]… Expand"}, {"name": "The Thing", "details_link": "https://www.metacritic.com/game/playstation-2/the-thing", "publisher": "VU Games", "release_date": "Aug 19 2002", "developers": ["Computer Artworks"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/d0d51ae723288c8aa81800284e33eff4-98.jpg", "descriptions": "Dropped into the frozen wastelands of Antarctica, you're the leader of a military rescue team sent to investigate the mysterious deaths of an American scientific expedition. In the punishing wind and cold, your team encounters a strange, shape-shifting alien life form that assumes theDropped into the frozen wastelands of Antarctica, you're the leader of a military rescue team sent to investigate the mysterious deaths of an American scientific expedition. In the punishing wind and cold, your team encounters a strange, shape-shifting alien life form that assumes the appearances of the people it kills. This monster is difficult to see, hard to kill, and seemingly impossible to evade. And when you see it, it's often too late. [Universal Interactive]… Expand"}, {"name": "DeathSpank: Thongs of Virtue", "details_link": "https://www.metacritic.com/game/xbox-360/deathspank-thongs-of-virtue", "publisher": "Electronic Arts", "release_date": "Jan  4 2011", "developers": ["Hothead Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/82ecfac7e46dd349f24684318ab975c0-98.jpg", "descriptions": "Featuring the trademark humor found in the original, Thongs of Virtue centers on DeathSpank's journey through a massive war-torn land; explore the North Pole and the high seas to locate six mystical thongs to bring peace and harmony to the universe."}, {"name": "Hatsune Miku: Project Diva X", "details_link": "https://www.metacritic.com/game/playstation-4/hatsune-miku-project-diva-x", "publisher": "Sega", "release_date": "Aug 30 2016", "developers": ["Sega"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/7105f79dd1afb3a9268572e40e71e122-98.jpg", "descriptions": "Hatsune Miku is back and bigger than ever on the PlayStation 4 and PlayStation Vita in the upcoming rhythm game, Hatsune Miku: Project DIVA X . For those new to Project DIVA, it is an addictive core rhythm game starring the digital singer, Hatsune Miku. Project DIVA X is driven forwardHatsune Miku is back and bigger than ever on the PlayStation 4 and PlayStation Vita in the upcoming rhythm game, Hatsune Miku: Project DIVA X . For those new to Project DIVA, it is an addictive core rhythm game starring the digital singer, Hatsune Miku. Project DIVA X is driven forward though a narrative which centers on Miku and her friends undertaking various requests as they explore the five Clouds that make up their world. For the Miku veterans, Project DIVA X has 30 songs and 300 modules (costumes) that get dropped. Illustration by KEI.… Expand"}, {"name": "Granblue Fantasy: Versus", "details_link": "https://www.metacritic.com/game/playstation-4/granblue-fantasy-versus", "publisher": "XSEED Games", "release_date": "Mar  3 2020", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 64 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 78, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/105f4fe4e8b7091cf047a6cab4caf14b-98.jpg", "descriptions": "In a world where adventurers roam the skies on airships, and the floating islands of the Skydoms lead their way, the Grandcypheran airship of massive proportionssets out on a magnificent journey, traveling the islands, and picking up a veritable army of sellswords, knights, and mages alongIn a world where adventurers roam the skies on airships, and the floating islands of the Skydoms lead their way, the Grandcypheran airship of massive proportionssets out on a magnificent journey, traveling the islands, and picking up a veritable army of sellswords, knights, and mages along the way However, these heroes of the sky will soon embark on a brand-new adventure, where battle and glory await!An international mobile game hit, Granblue Fantasy has topped the charts, charming players across the globe with a plethora of lovable characters and story-driven mechanics. Now, legendary fighting game studio Arc System Works and Cygames are teaming up to bring the universe to home console in an action-packed head-to-head fighter. Featuring a colorful cast of their most popular \"crewmembers,\" each with a unique fighting style that is easy to learn but hard to master, Granblue Fantasy: Versus is sure to appeal to fans of Granblue lore and fighting games alike.KEY FEATURES* An Anime Fighter for Players of All Levels!Arc System Works, the team behind critically-acclaimed fighting series BlazBlue, Guilty Gear, and Dragon Ball FighterZ, and Cygames, the people behind the international mobile phenomenon Granblue Fantasy, usher in a new era of fighting games with a rich and accessible battle system suitable for beginners and veterans alike.* Fight as Your Favorite Granblue Characters!A balanced and varied cast of combatants are ready to duke it out, each with their own individual fighting styles and dazzling skills. Whether it's the well-rounded Katalina, the long-range specialist Ferry, or the dual blade wielder Lancelot, there is a character and style to suit almost anyone's tastes.* A Gorgeous 2.5D Style World, Accompanied by Memorable Melodies!High production values recreate the well-known locales of the Granblue Fantasy universe in vivid 2.5D, bringing these environments to life as crewmembers cheer in the background, all accompanied by Stelle Magna's stirring soundtrack.* Captivating Visuals, Designed by a Fantasy Expert!Hideo Minaba of Final Fantasy series fame contributes as art director, lending his extraordinary talents and unforgettable character and world designs to the Granblue Fantasy universe!… Expand"}, {"name": "Farming Simulator 22", "details_link": "https://www.metacritic.com/game/pc/farming-simulator-22", "publisher": "Giants Software", "release_date": "Nov 22 2021", "developers": ["Giants Software"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Simulation", "General", "Virtual", "Career"], "meta_score": 78, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/e83affff727eea85808162194c9edef6-98.jpg", "descriptions": "Cultivated to be bigger and better the ultimate and multimillion selling farming simulation returns this November! Farming Simulator 22 offers more depth and the highest extent of player freedom in the history of the series. With more than 400 machines and tools from over 100 authenticCultivated to be bigger and better the ultimate and multimillion selling farming simulation returns this November! Farming Simulator 22 offers more depth and the highest extent of player freedom in the history of the series. With more than 400 machines and tools from over 100 authentic agricultural brands, players can look forward to an improved and realistic as ever simulation. Suited for all ages, players dive into even more diverse agriculture, animal husbandry and forestry. Two new maps inspired by US and EU regions plus an updated alpine Erlengrat map emphasize different kinds of farming operations, including three new crops. The addition of seasonal cycles adds new challenges throughout the year, and enhances the atmosphere many times over. Players can now start various production chains to further extend their income whether they produce bread, oil, juice or more. To allow more individualization of farms and characters, the vastly improved customization tools add plentiful new possibilities. Based on the GIANTS Engine 9, Farming Simulator 22 also features many technical improvements such as more realistic AI behavior, richer worlds and a significant performance boost on all systems.… Expand"}, {"name": "Atelier Lulua: The Scion of Arland", "details_link": "https://www.metacritic.com/game/switch/atelier-lulua-the-scion-of-arland", "publisher": "Koei Tecmo Games", "release_date": "May 21 2019", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 78, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/5579e94482d8beca5c96d69bc5bb7113-98.jpg", "descriptions": "Following the events of Atelier Totori and Atelier Meruru, comes an all-new story. The title is set in a world proceeding the story of Atelier Meruru. It depicts how characters and locations have changed over time. Set in a world both nostalgic and new, the curtain lifts on another adventureFollowing the events of Atelier Totori and Atelier Meruru, comes an all-new story. The title is set in a world proceeding the story of Atelier Meruru. It depicts how characters and locations have changed over time. Set in a world both nostalgic and new, the curtain lifts on another adventure for the alchemists.… Expand"}, {"name": "Alien: Isolation", "details_link": "https://www.metacritic.com/game/xbox-one/alien-isolation", "publisher": "Sega", "release_date": "Oct  7 2014", "developers": ["Creative Assembly"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "General", "Survival"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/dfea30b247c8d4d3cda99047360ae9ef-98.jpg", "descriptions": "Alien: Isolation is a first-person survival horror game which captures the fear and tension evoked by Ridley Scott’s 1979 classic film. Players find themselves in an atmosphere of constant dread and mortal danger as an unpredictable, ruthless Xenomorph is stalking and killing deep in theAlien: Isolation is a first-person survival horror game which captures the fear and tension evoked by Ridley Scott’s 1979 classic film. Players find themselves in an atmosphere of constant dread and mortal danger as an unpredictable, ruthless Xenomorph is stalking and killing deep in the shadows. Underpowered and underprepared, you must scavenge resources, improvise solutions and use your wits, not just to succeed in your mission, but to simply stay alive.… Expand"}, {"name": "DeadCore", "details_link": "https://www.metacritic.com/game/pc/deadcore", "publisher": "Bandai Namco Games", "release_date": "Aug 13 2013", "developers": ["5-Bits Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/ac2e94de075f721e4bb67a73f8ec61d6-98.jpg", "descriptions": "DeadCore is a Platformer-First-Person-Shooter melding exploration and speedrun. Become immersed in a futuristic and dreamlike adventure which will see you climb a huge Tower born from the void and truly put your capabilities to the test. Can you reveal the secrets that lie beneath thisDeadCore is a Platformer-First-Person-Shooter melding exploration and speedrun. Become immersed in a futuristic and dreamlike adventure which will see you climb a huge Tower born from the void and truly put your capabilities to the test. Can you reveal the secrets that lie beneath this fog-ridden world? … Expand"}, {"name": "Conker: Live & Reloaded", "details_link": "https://www.metacritic.com/game/xbox/conker-live-reloaded", "publisher": "Microsoft Game Studios", "release_date": "Jun 21 2005", "developers": ["Rare Ltd."], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/509bb64f1a74ffb8052c5a76f34ca5c6-98.jpg", "descriptions": "The naughty squirrel returns to the Xbox in a new team-based shooter, Conker: Live and Reloaded. This sequel features both multiplayer deathmatch and campaign modes, which can be played via Xbox Live and system link. Now you and your friends can compete as one of six combat specialistsThe naughty squirrel returns to the Xbox in a new team-based shooter, Conker: Live and Reloaded. This sequel features both multiplayer deathmatch and campaign modes, which can be played via Xbox Live and system link. Now you and your friends can compete as one of six combat specialists across multimission campaigns. Whether you battle in the past or in the future, this game promises more action and humor during warfare. Also included in the game is the original Conker's Bad Fur Day, which has been re-created for the Xbox.… Expand"}, {"name": "Castlevania: The Adventure ReBirth", "details_link": "https://www.metacritic.com/game/wii/castlevania-the-adventure-rebirth", "publisher": "Konami", "release_date": "Dec 28 2009", "developers": ["M2"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/5314677fbd3c4856c0e7986bf2382e6a-98.jpg", "descriptions": "[WiiWare]  Another 100 years have passed since the death of Count Dracula, but his curse has emerged once again within the realms of Transylvania. Play the role of the ultimate gothic hero from the long lineage of vampire hunters, the Belmont clan, and rid the universe of Dracula's legion of[WiiWare]  Another 100 years have passed since the death of Count Dracula, but his curse has emerged once again within the realms of Transylvania. Play the role of the ultimate gothic hero from the long lineage of vampire hunters, the Belmont clan, and rid the universe of Dracula's legion of darkness and doom. Based on the classic 1989 original Castlevania: The Adventure, this WiiWare version will allow players of a new generation - and older fans - to experience one of the most popular games within the storied Castlevania timeline from a new perspective. [Nintendo]… Expand"}, {"name": "Jurassic World Evolution 2", "details_link": "https://www.metacritic.com/game/playstation-5/jurassic-world-evolution-2", "publisher": "Frontier Developments", "release_date": "Nov  9 2021", "developers": ["Frontier Developments"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/271add0e0f3be43bff08fbd925f911bf-98.jpg", "descriptions": "Jurassic World Evolution 2 is the sequel to Frontier’s Jurassic World Evolution, building upon the 2018 management simulation. It introduces a compelling, new narrative campaign, incredible new features, and awe-inspiring new dinosaurs brought to life with captivating authenticity. TogetherJurassic World Evolution 2 is the sequel to Frontier’s Jurassic World Evolution, building upon the 2018 management simulation. It introduces a compelling, new narrative campaign, incredible new features, and awe-inspiring new dinosaurs brought to life with captivating authenticity. Together with expanded construction and more customisation options, the result is an even bigger, better and authentic Jurassic World game.  \rFEATURES\r An Original Jurassic Story\rImmerse yourself in a compelling and original Jurassic World narrative set after the Earth-shattering events of Jurassic World: Fallen Kingdom. Lead efforts to control, conserve and contain dinosaurs as you work alongside iconic characters from the films, including Dr. Ian Malcolm (Jeff Goldblum) and Claire Dearing (Bryce Dallas Howard). \r\rCreate your own Jurassic World\rTake control with deeper management tools and creative options. Construct and customise new buildings and flex your managerial muscle across never-before-seen locations ranging from dense forests to rocky deserts. Rescue and bioengineer more than 75 prehistoric species, including highly requested flying and marine reptiles , and watch them seek territory, fight and interact with staggering realism. \r\rPlay with Chaos Theory\rChaos Theory mode lets you play through key moments of your favourite films - with a twist. Experience \"what-if\" scenarios from iconic Jurassic World and Jurassic Park films, with each level set across eras and locations from all five movies. Immerse yourself at the heart of the Jurassic World franchise and see how things turn out when you are put at the helm of managing new challenges with unpredictable outcomes. … Expand"}, {"name": "Horizon Chase Turbo", "details_link": "https://www.metacritic.com/game/xbox-one/horizon-chase-turbo", "publisher": "Aquiris Game Studio", "release_date": "Nov 28 2018", "developers": ["Aquiris Game Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/4d257866c78cc5cc0b472c8223c06ea6-98.jpg", "descriptions": "A tribute to 80s and 90s arcade racers. Chase horizons and find the thrill of 16-bit classics. Soundtrack by the legendary racing games composer Barry Leitch."}, {"name": "The Walking Dead: Season Two Episode 5 - No Going Back", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-season-two-episode-5---no-going-back", "publisher": "Telltale Games", "release_date": "Aug 26 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "genres": ["General", "Action", "Adventure", "General", "Point-and-Click"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/6056b6db89d55c6b810a5e96aef5f5fa-98.jpg", "descriptions": "No Going Back is the 5th and last episode of Telltale Games' The Walking Dead: Season Two."}, {"name": "MLB 2005", "details_link": "https://www.metacritic.com/game/playstation-2/mlb-2005", "publisher": "SCEA", "release_date": "Mar 16 2004", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/eca1dc17b6cdefad0784c7883c9f9bb5-98.jpg", "descriptions": "The long list of new features includes the following: New Interface Cameras: Choose from the catcher, umpire, pitcher, outfield zoom or offset plate camera options. New Interactive Hot/Cold Zones: Take hot and cold zones one stop further with the ability to alter them. Turn cold zones hotThe long list of new features includes the following: New Interface Cameras: Choose from the catcher, umpire, pitcher, outfield zoom or offset plate camera options. New Interactive Hot/Cold Zones: Take hot and cold zones one stop further with the ability to alter them. Turn cold zones hot and vice versa wtih your performance at the plate or from the bump. Double Switches: Effectively manage your lineup and put your weakest stick in the nine-slot when you take advantage of double switch opportunities. MLB 2005 is the only game with scaled strike zones proportionate to individual hitters. [989 Sports]… Expand"}, {"name": "Neverwinter Nights: Shadows of Undrentide", "details_link": "https://www.metacritic.com/game/pc/neverwinter-nights-shadows-of-undrentide", "publisher": "Atari", "release_date": "Jun 17 2003", "developers": ["BioWare"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/c92adaf726949d63e79d1c3135c1ba8f-98.jpg", "descriptions": "The first official expansion to Neverwinter Nights features a new 40-hour single player campaign as well as game features new to Neverwinter Nights, such as additional D&D skills, feats, classes, monsters, weapons and spells. In addition, the pack includes three new tile sets and otherThe first official expansion to Neverwinter Nights features a new 40-hour single player campaign as well as game features new to Neverwinter Nights, such as additional D&D skills, feats, classes, monsters, weapons and spells. In addition, the pack includes three new tile sets and other assets for use in the Aurora toolset that will enable amateur module designers to create completely different worlds. [BioWare]… Expand"}]