[{"name": "Wasteland 3", "details_link": "https://www.metacritic.com/game/playstation-4/wasteland-3", "publisher": "InXile Entertainment", "release_date": "Aug 28 2020", "developers": ["InXile Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 79, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/cdf2359ad5145260958cd7599d4a7427-98.jpg", "descriptions": "In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed PatriarchIn Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if you'll do a job he can only entrust to an outsider—rescue his land from the ambitions of his three bloodthirsty children. You’re dispatched on a desperate quest from the scorching deserts to the snowy mountains to start from scratch, building a new base, finding a snow-worthy vehicle, training new recruits, and fighting your way through hostile frozen wastes. All the while, you'll have to decide who to trust in this land torn apart by corruption, intrigue, warring factions, crazed cultists, cutthroat gangs, and bitter sibling rivalries. Build a reputation for yourself by making decisions that will profoundly impact Colorado, its inhabitants and the story you experience. Will you be Colorado’s savior or its worst nightmare? Wasteland 3 is a squad-based RPG from inXile entertainment, featuring challenging tactical turn-based combat and a deep, reactive story full of twists, turns, and brutal ethical decisions that will keep you hooked whether you’re a Wasteland veteran or new to the series. Create a squad of up to six Rangers and customize them with perks and abilities geared to your playstyle. You even get your own battle truck, which you can upgrade into a hardened war beast, bristling with weapons, to help mow down your enemies. … Expand"}, {"name": "Rival Megagun", "details_link": "https://www.metacritic.com/game/playstation-4/rival-megagun", "publisher": "Spacewave Software", "release_date": "Nov 29 2018", "developers": ["Spacewave Software"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 79, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/5e5c37f82a06092176a0bb78afb31557-98.jpg", "descriptions": "Transform into your Mega Gunship boss form to blast your rival head-on in this unique shooting game with a competitive twist."}, {"name": "The Book of Unwritten Tales 2", "details_link": "https://www.metacritic.com/game/xbox-one/the-book-of-unwritten-tales-2", "publisher": "Nordic Games Publishing", "release_date": "Sep 18 2015", "developers": ["KING Art"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/8f59736a7f62e4bdc360774599a6a3ff-98.jpg", "descriptions": "Join Wilbur, Ivo, Nate and Critter in another classic point-and-click adventure in the wicked world of Aventasia."}, {"name": "Tom Clancy's Rainbow Six Siege", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six-siege", "publisher": "Ubisoft", "release_date": "Dec  1 2015", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Modern", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 79, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/80b34e3548f1768ea4d5c24ad2239fba-98.jpg", "descriptions": "Tom Clancy’s Rainbow Six Siege is inspired by real world counter-terrorist organizations, and inserts players in the middle of lethal close-quarters engagements. For the first time in a Tom Clancy’s Rainbow Six game, players can choose from a variety of unique Counter Terrorist Operators andTom Clancy’s Rainbow Six Siege is inspired by real world counter-terrorist organizations, and inserts players in the middle of lethal close-quarters engagements. For the first time in a Tom Clancy’s Rainbow Six game, players can choose from a variety of unique Counter Terrorist Operators and engage in tangible sieges, a new style of assault in which enemies have the means to transform their environments into modern strongholds while Rainbow Six teams lead the assault to breach the enemy’s position.… Expand"}, {"name": "The Settlers 7: Paths to a Kingdom", "details_link": "https://www.metacritic.com/game/pc/the-settlers-7-paths-to-a-kingdom", "publisher": "Ubisoft", "release_date": "Mar 23 2010", "developers": ["Blue Byte"], "platforms": "PC", "genres": ["Strategy", "City Building", "Management", "Historic", "Historic", "Government"], "meta_score": 79, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/b173a7feb07c207ce9db799b38c6eb41-98.jpg", "descriptions": "The Settlers: Paths to a Kingdom is the latest game from the award-winning kingdom building strategy series. Created in 1993, The Settlers franchise is one of the best selling strategy brands with over 500,000 units sold in the US and over 7MM units worldwide LTD. In Paths to a Kingdom, theThe Settlers: Paths to a Kingdom is the latest game from the award-winning kingdom building strategy series. Created in 1993, The Settlers franchise is one of the best selling strategy brands with over 500,000 units sold in the US and over 7MM units worldwide LTD. In Paths to a Kingdom, the military, economic, and research systems are richer than ever. This allows players to play and win the way they want. Beyond the game campaign, fully customizable pre-designed maps, downloadable expansions and anticipated player-generated content will guarantee wide-ranging experiences. The innovation does not stop at the game content. The Settlers: Paths to a Kingdom will integrate the player’s social networks contacts on Facebook and Twitter. By allowing consumers to play the way they want and share their progress with their friends, this is truly the most accessible and innovative Settlers title to date. [Ubisoft]… Expand"}, {"name": "RollerCoaster Tycoon 3: Soaked!", "details_link": "https://www.metacritic.com/game/pc/rollercoaster-tycoon-3-soaked!", "publisher": "Atari", "release_date": "Jun 23 2005", "developers": ["Frontier Developments"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 79, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/1/2cd564eb15b2dcb61adcb4bff107e9a7-98.jpg", "descriptions": "With RollerCoaster Tycoon 3: Soaked! the park guests catch rays and ride the waves on more than fifty new rides and coasters including super-splash flume rides, massive water slides, wave pools and more. Players are also able to create aquatic spectaculars with performing dolphins, killerWith RollerCoaster Tycoon 3: Soaked! the park guests catch rays and ride the waves on more than fifty new rides and coasters including super-splash flume rides, massive water slides, wave pools and more. Players are also able to create aquatic spectaculars with performing dolphins, killer whale shows and customizable aquariums as well as to design dazzling laser light water shows and synch them to music with the H20 MixMaster. A new Swimming Pool Designer and Waterfall Designer let players add hundreds of new park enhancements to create the ultimate summer fun experience as well as other new features that extend and enhance the original game. [Atari]… Expand"}, {"name": "Subnautica: Below Zero", "details_link": "https://www.metacritic.com/game/playstation-5/subnautica-below-zero", "publisher": "Bandai Namco Games", "release_date": "May 14 2021", "developers": ["Unknown Worlds Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Action Adventure", "Sandbox"], "meta_score": 79, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/1728a4b904fd2bf91d569249344dbbc3-98.jpg", "descriptions": "Below Zero is an underwater adventure game set on an alien ocean world. It is a new chapter in the Subnautica universe and developed by Unknown Worlds. Return to planet 4546B. Dive into a freezing underwater adventure. Below Zero is set in an arctic region of planet 4546B. As a scientistBelow Zero is an underwater adventure game set on an alien ocean world. It is a new chapter in the Subnautica universe and developed by Unknown Worlds. Return to planet 4546B. Dive into a freezing underwater adventure. Below Zero is set in an arctic region of planet 4546B. As a scientist posted to a research station on the planet's surface, you are tasked with studying alien artifacts...\r The Vesper space station orbits high above you, sending supplies, instructions, and receiving samples you launch from the surface.When disaster strikes the research station, you must improvise to survive: Construct habitats, scavenge for resources, hunt for food, and craft equipment.… Expand"}, {"name": "BlazBlue: Cross Tag Battle", "details_link": "https://www.metacritic.com/game/switch/blazblue-cross-tag-battle", "publisher": "Arc System Works", "release_date": "Jun  5 2018", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/157225ac75cd7a44696ece00227aec95-98.jpg", "descriptions": "Created through an all-star collaboration between BlazBlue, Atlus' Persona, French Bread's Under Night In-Birth, and Rooster Teeth's hugely popular RWBY web series, Cross Tag Battle celebrates the fighting genre for pros and newcomers alike! Engage in fast paced 2v2 team battles filled withCreated through an all-star collaboration between BlazBlue, Atlus' Persona, French Bread's Under Night In-Birth, and Rooster Teeth's hugely popular RWBY web series, Cross Tag Battle celebrates the fighting genre for pros and newcomers alike! Engage in fast paced 2v2 team battles filled with the craziness you've come to love from BlazBlue, with all the tight mechanics, smooth gameplay, and gorgeous 2D graphics you expect from Arc System Works.… Expand"}, {"name": "Rune Factory Frontier", "details_link": "https://www.metacritic.com/game/wii/rune-factory-frontier", "publisher": "XSEED Games", "release_date": "Mar 17 2009", "developers": ["Neverland"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 79, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/5d3efbaf0a5c32e0ae273e0941f637af-98.jpg", "descriptions": "From the creators of Harvest Moon and Rune Factory for the DS comes the first installment of Rune Factory for a home console. Developed exclusively for Wii, Rune Factory: Frontier takes full advantage of the Wii's unique controls to fully immerse players in the Rune Factory universe. RuneFrom the creators of Harvest Moon and Rune Factory for the DS comes the first installment of Rune Factory for a home console. Developed exclusively for Wii, Rune Factory: Frontier takes full advantage of the Wii's unique controls to fully immerse players in the Rune Factory universe. Rune Factory: Frontier incorporates an open-ended structure that allows players to choose the type of game they wish to experience. Whether it's growing crops, expanding the town, fighting (or befriending) monsters or even falling in love, the experience is unique to each player. [XSEED]… Expand"}, {"name": "Mantis Burn Racing", "details_link": "https://www.metacritic.com/game/xbox-one/mantis-burn-racing", "publisher": "VooFoo Studios", "release_date": "Oct 12 2016", "developers": ["VooFoo Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/688acb12cd6aacb86880c50072627ddc-98.jpg", "descriptions": "Mantis Burn Racing is an arcade style top-down racer with stunning visuals, a comprehensive single-player career mode, and a deep, RPG-style upgrade system. [VooFoo Studios]"}, {"name": "Mighty Switch Force!", "details_link": "https://www.metacritic.com/game/3ds/mighty-switch-force!", "publisher": "WayForward", "release_date": "Dec 22 2011", "developers": ["WayForward"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/9b36aa1bcde82e1e081aea45c6566b99-98.jpg", "descriptions": "Space Hooligans have escaped custody and are wreaking havoc all over Planet Land! HQ calls on cybernetic peace-keeper Patricia Wagon to bring these renegades to justice. With the help of Corporal Gendarmor and her trusty Pellet Gun, there's nothing she can't handle. When the going getsSpace Hooligans have escaped custody and are wreaking havoc all over Planet Land! HQ calls on cybernetic peace-keeper Patricia Wagon to bring these renegades to justice. With the help of Corporal Gendarmor and her trusty Pellet Gun, there's nothing she can't handle. When the going gets tough, Wagon activates her Helmet Siren, altering the world around her in 3D space. Even the third dimension can’t hide criminal ne’er-do-wells from the long arm of the law. Enter the mechanical shape-shifting, dimension switching world of Mighty Switch Force and blow crime away.… Expand"}, {"name": "EVERSPACE", "details_link": "https://www.metacritic.com/game/pc/everspace", "publisher": "ROCKFISH Games", "release_date": "May 26 2017", "developers": ["ROCKFISH Games"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Simulation", "Action Adventure", "Space", "Open-World", "Combat"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/76a8ba71c2b830c1b8b9dcf12b666cce-98.jpg", "descriptions": "EVERSPACE combines fast-paced combat with roguelike elements, great visuals and a captivating story. It takes you on a challenging journey through an ever-changing, beautifully crafted universe full of surprises. Shoot, craft and loot your way to victory while the odds are stacked against you."}, {"name": "Angry Birds VR: Isle of Pigs", "details_link": "https://www.metacritic.com/game/pc/angry-birds-vr-isle-of-pigs", "publisher": "Resolution Games", "release_date": "Feb  7 2019", "developers": ["Resolution Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 79, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/147984b8169e3d8bbfd15ab5145784ef-98.jpg", "descriptions": "Join Red, Chuck, Bomb & the Blues to save the stolen eggs in Angry Birds VR: Isle of Pigs, an immersive VR game adventure from Resolution Games! Explore a remote island where the greedy green pigs take their vacation in 104 fun-filled levels! Make your way up to party city through theJoin Red, Chuck, Bomb & the Blues to save the stolen eggs in Angry Birds VR: Isle of Pigs, an immersive VR game adventure from Resolution Games! Explore a remote island where the greedy green pigs take their vacation in 104 fun-filled levels! Make your way up to party city through the serene \"Vacation Levels\" of exotic beaches, steep cliffs & snowy slopes while destroying structures in the most spectacular way. Once the new boss pig Dr. Frankenswine takes over, it's time to slingshot your way through even more challenging \"Spooky Levels\" gameplay, where the beaches are scary, the cliffs are creepy, the slopes are slimy & the peaks are terrifying.… Expand"}, {"name": "Dark Souls II: Crown of the Old Iron King", "details_link": "https://www.metacritic.com/game/pc/dark-souls-ii-crown-of-the-old-iron-king", "publisher": "Namco Bandai Games", "release_date": "Aug 26 2014", "developers": ["From Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/03d6795d5308de8d1b19db0edbf45911-98.jpg", "descriptions": "Crown of the Old Iron King features an entirely different world within the Dark Souls II universe where players will venture into a massive tower swamped by black mist where flames, smoke and sorcery sadistically lurk."}, {"name": "TrackMania 2 Valley", "details_link": "https://www.metacritic.com/game/pc/trackmania-2-valley", "publisher": "Ubisoft", "release_date": "Jul  4 2013", "developers": ["Nadeo"], "platforms": "PC", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/33364066b164f0b3db271980cac1e9dd-98.jpg", "descriptions": "TrackMania² Valley lets you experience the excitement and adrenaline of racing stunning cars on varied tracks in an enhanced sequel to Nadeo Studio’s online racing franchise TrackMania."}, {"name": "Skies of Fury DX", "details_link": "https://www.metacritic.com/game/switch/skies-of-fury-dx", "publisher": "IlluminationGames", "release_date": "Apr 12 2018", "developers": ["Seed Interactive"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Combat"], "meta_score": 79, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/32034ca5e22f4d239954dc1a08ebac4c-98.jpg", "descriptions": "Fight as both British and German pilots during WWI's battle for the skies. Take to the skies and experience WWI as a fighter pilot. Skies of Fury DX offers players the chance to engage in epic, aerial combat in historic Bloody April, 1917, as both British and German pilots. Using 10Fight as both British and German pilots during WWI's battle for the skies. Take to the skies and experience WWI as a fighter pilot. Skies of Fury DX offers players the chance to engage in epic, aerial combat in historic Bloody April, 1917, as both British and German pilots. Using 10 distinctive aircraft from WWI, players fly through stunning, hand-painted environments. Dogfight through the missions as a single player, or challenge your friends to a multiplayer, split-screen battle. [Nintendo]… Expand"}, {"name": "State of Decay", "details_link": "https://www.metacritic.com/game/pc/state-of-decay", "publisher": "Microsoft Game Studios", "release_date": "Nov  5 2013", "developers": ["Undead Labs"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 79, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/f4048bd1f79ec49cbb9be6c1a600b555-98.jpg", "descriptions": "The end is here. Life as you knew it has gone to hell after the mother of all zombie outbreaks. Now you and the few scattered survivors must band together to survive and rebuild in a 3rd-person action game set in a dynamic open world. You choose where to make your stand, designing andThe end is here. Life as you knew it has gone to hell after the mother of all zombie outbreaks. Now you and the few scattered survivors must band together to survive and rebuild in a 3rd-person action game set in a dynamic open world. You choose where to make your stand, designing and fortifying your home base, performing daring raids for food and ammunition, and rescuing other playable survivors with unique talents. The open, sandbox world develops in real-time, shaped by your actions, dynamically generating content based on your choices and the ever-increasing zombie threat.… Expand"}, {"name": "Rock Band 3", "details_link": "https://www.metacritic.com/game/ds/rock-band-3", "publisher": "MTV Games", "release_date": "Oct 26 2010", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "DS"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 79, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/985766a01298db60f4e2337e8242cd93-98.jpg", "descriptions": "Rock Band returns with another iteration of the popular music game featuring new songs and instruments."}, {"name": "Alba: a Wildlife Adventure", "details_link": "https://www.metacritic.com/game/pc/alba-a-wildlife-adventure", "publisher": "ustwo", "release_date": "Dec 11 2020", "developers": ["ustwo"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/9aa02e1cecfbda9138e49df0f8cf0838-98.jpg", "descriptions": "Even the smallest person can make a big difference. Join Alba, as she sets out to save her beautiful island and its wildlife. And possibly start a revolution."}, {"name": "High Hell", "details_link": "https://www.metacritic.com/game/pc/high-hell", "publisher": "Devolver Digital", "release_date": "Oct 23 2017", "developers": ["Terri Vellimann"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 79, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/07a648d557d08f5dacc70b9feb04b53c-98.jpg", "descriptions": "High Hell is a neon-soaked, arcade-action first-person shooter from Terri Vellmann (Heavy Bullets) and Doseone (Enter the Gungeon, Gang Beasts)."}, {"name": "Tom Clancy's The Division 2: Warlords of New York", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-the-division-2-warlords-of-new-york", "publisher": "Massive Entertainment", "release_date": "Mar  3 2020", "developers": ["Massive Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 79, "users_score": 0.9, "image": "https://static.metacritic.com/images/products/games/7/b6b27ddd0b2161072c22ce37c446af81-98.jpg", "descriptions": "While The Division was working to secure Washington, D.C., a familiar shadow fell over the streets of New York. Aaron Keener - one of The Division's original antagonists, as well as the first Division Agent to go rogue - has brought the factions of New York City under his control, and usedWhile The Division was working to secure Washington, D.C., a familiar shadow fell over the streets of New York. Aaron Keener - one of The Division's original antagonists, as well as the first Division Agent to go rogue - has brought the factions of New York City under his control, and used them to conquer Lower Manhattan. With other rogue Agents and a lethal new viral strain at his command, Keener is poised to eradicate what little has been rebuilt since the catastrophic Black Friday pandemic. The battle to restore order continues, but now The Division has a new mission: Stop Keener at any cost.… Expand"}, {"name": "EA Sports UFC 2", "details_link": "https://www.metacritic.com/game/playstation-4/ea-sports-ufc-2", "publisher": "Electronic Arts", "release_date": "Mar 15 2016", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "General", "Individual", "Combat", "Boxing / Martial Arts"], "meta_score": 79, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/4be908d8c074390fe6b94b952bd3356a-98.jpg", "descriptions": "A new physics-driven hit reaction and knockout system delivers more visceral KOs than before. Every knockout is now unique. Simultaneous two-fighter interaction brings the ground game to life with greater responsiveness and variety. Surprise your opponent with a flying armbar from theA new physics-driven hit reaction and knockout system delivers more visceral KOs than before. Every knockout is now unique. Simultaneous two-fighter interaction brings the ground game to life with greater responsiveness and variety. Surprise your opponent with a flying armbar from the clinch, or with a quick transition from a knee bar to a heel hook. Standing submissions and submission chaining have been added.  Add an improved blocking and parrying system to the mix and you have new tools to fend off your opponent’s most devastating attacks.… Expand"}, {"name": "F1 2013", "details_link": "https://www.metacritic.com/game/xbox-360/f1-2013", "publisher": "Codemasters", "release_date": "Oct  8 2013", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 79, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/6cffd0a64931f3bbfa0eff7b0c27c94d-98.jpg", "descriptions": "Experience all-new 80s classic content in addition to all the cars, stars and circuits from the 2013 FIA FORMULA ONE WORLD CHAMPIONSHIP in F1 2013. F1 2013 features F1 Classics, a new game mode introduced by legendary broadcaster Murray Walker, where you’ll race famous cars from Ferrari,Experience all-new 80s classic content in addition to all the cars, stars and circuits from the 2013 FIA FORMULA ONE WORLD CHAMPIONSHIP in F1 2013. F1 2013 features F1 Classics, a new game mode introduced by legendary broadcaster Murray Walker, where you’ll race famous cars from Ferrari, Williams and Lotus against icons of the sports including Nigel Mansell, Mario Andretti and Gerhard Berger. Classic content also includes two historic circuits – Brands Hatch and Circuito de Jerez - and can be played in a range of modes including split-screen and online multiplayer.… Expand"}, {"name": "LEGO Harry Potter: Years 1-4", "details_link": "https://www.metacritic.com/game/pc/lego-harry-potter-years-1-4", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 25 2010", "developers": ["Traveller's Tales"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/18835237033240a8cff82a6c3562d9e3-98.jpg", "descriptions": "Build the adventure from Privet Drive to the Triwizard Tournament and experience the fun of the first four Harry Potter stories – Lego style. Explore Hogwarts School of Witchcraft and Wizardry, learn spells, brew potions and relive the adventures with tongue-in-cheek humor and creativeBuild the adventure from Privet Drive to the Triwizard Tournament and experience the fun of the first four Harry Potter stories – Lego style. Explore Hogwarts School of Witchcraft and Wizardry, learn spells, brew potions and relive the adventures with tongue-in-cheek humor and creative customization that is unique to LEGO videogames.… Expand"}, {"name": "World of Warcraft: Battle for Azeroth", "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft-battle-for-azeroth", "publisher": "Blizzard Entertainment", "release_date": "Aug 13 2018", "developers": ["Blizzard Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "Massively Multiplayer", "Board / Card Game"], "meta_score": 79, "users_score": 2.4, "image": "https://static.metacritic.com/images/products/games/0/a0d950639067c43d093c576ef1e7088c-98.jpg", "descriptions": "DECLARE YOUR ALLEGIANCEAzeroth paid a terrible price to end the apocalyptic march of the Legion's crusadebut even as the world's wounds are tended, it is the shattered trust between the Alliance and Horde that may prove hardest to mend. As this age-old conflict reignites, join your alliesDECLARE YOUR ALLEGIANCEAzeroth paid a terrible price to end the apocalyptic march of the Legion's crusadebut even as the world's wounds are tended, it is the shattered trust between the Alliance and Horde that may prove hardest to mend. As this age-old conflict reignites, join your allies and champion your faction's causeAzeroth's future will be forged in the fires of war.RECRUIT ALLIED RACESExplore Azeroth as new playable Allied Races, including four you've encountered in your campaign against the Legion. Embark on a quest to earn their favor and unlock each race, adding their strength to your faction. Create a new character and complete the full leveling experience to earn a distinctive Heritage Armor set.KUL TIRASAs a hero of the mighty Alliance, journey to the seafaring kingdom of Kul Tiras, home of Jaina Proudmoore. Untangle a web of betrayal and dark magic as you encounter power-hungry pirates, witches wielding death magic, mystical sea priests, and more. Explore the stony peaks of Tiragarde Sound, trek across Drustvar's high plains and red forests, and navigate the intricate inland canals of Stormsong Valley as you convince this fractured kingdom to join your cause.ZANDALARPrepare the Horde for war by recruiting the ancient empire of Zandalar. In this troll-dominated territory, ancient evil waits to be unleashed on the world as you battle crazed blood-troll worshippers, gargantuan dinosaurs, and titan constructs. Discover Zuldazar, the oldest city in Azeroth; unveil the bleak swamps of Nazmir; and traverse the deadly deserts of Vol'dun.PLUNDER UNCHARTED ISLANDSSet sail for the previously unmapped isles of Azeroth. Battle in groups of three as you race against cunning rival intrudersor enemy playersto collect the island's resources. Constantly evolving challenges await as you traverse frozen landscapes near Northrend, open the gates of an abandoned Gilnean castle, navigate a war between elementals and more.STORM THE WARFRONTSHead to the frontlines and take part in a large-scale 20-player cooperative Warfront to claim a key strategic location. Build up your faction's forces, lead the charge as your troops lay siege to the objective, and battle the enemy commanders as they make their last stand in this new PvE mode inspired by classic Warcraft RTS battles.INFUSE ARMOR WITH TITANIC MIGHTTake control of the Heart of Azerotha legendary neck piece entrusted to you by Magni Bronzebeard. Imbue it with Azerite, an invaluable resource that's emerged in the Legion's wake, to customize your armor with new powers and traits.ENTER A WORLD DIVIDEDExperience the relentless conflict at the heart of the Warcraft saga. Play through six new zones filled with new World Quests, new World Bosses, new raids and more as you determine whether the Horde or Alliance will shape Azeroth's future.* NEW LEVEL CAPStop the spread of the Blood God's corruption, unearth the secrets of a lost titan vault, and much more as you quest to level 120.* NEW DUNGEONS & RAIDSFight through all-new dungeons like the golden city of Atal'Dazar, and the outlaw town of Freehold! * CHARACTER BOOSTAdvance a new or existing hero character to level 110 instantly, and be ready to join your new allies in battle!* COMMUNITIESFind adventurers who share common interests through in-game Communities and join cross-realm social groups.… Expand"}, {"name": "Mirror's Edge", "details_link": "https://www.metacritic.com/game/playstation-3/mirrors-edge", "publisher": "EA Games", "release_date": "Nov 11 2008", "developers": ["EA DICE"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Modern", "General", "Modern", "First-Person", "Modern"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/a1cb420d0804e8654953ce1a12d0c196-98.jpg", "descriptions": "In a city where information is heavily monitored, agile couriers called runners transport sensitive data away from prying eyes. In this seemingly utopian paradise, a crime has been committed, your sister has been framed and now you are being hunted. You are a runner called faith - and thisIn a city where information is heavily monitored, agile couriers called runners transport sensitive data away from prying eyes. In this seemingly utopian paradise, a crime has been committed, your sister has been framed and now you are being hunted. You are a runner called faith - and this innovative first-person action-adventure is your story. Flow is what keeps you running, what keeps you alive. Mirror's Edge delivers you straight into the shoes of this unique heroine as she traverses the vertigo-inducing cityscape, engaging in intense combat and fast paced chases. With a never before seen sense of movement and perspective, you will be drawn into Faith's world. A world that is visceral, immediate, and very dangerous. Live or die? Soar or plummet? One thing is certain: in this city you will learn how to run. [Electronic Arts]… Expand"}, {"name": "The Gardens Between", "details_link": "https://www.metacritic.com/game/switch/the-gardens-between", "publisher": "The Voxel Agents", "release_date": "Sep 20 2018", "developers": ["The Voxel Agents"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 79, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/d427e7e47bd6f4cf5c0262286672680b-98.jpg", "descriptions": "Best friends Arina and Frendt delve into a series of vibrant, dreamlike island gardens peppered with everyday objects from their childhood. Together they embark on an emotional journey that examines the significance of their friendship: the memories they’ve built, what must be let go, andBest friends Arina and Frendt delve into a series of vibrant, dreamlike island gardens peppered with everyday objects from their childhood. Together they embark on an emotional journey that examines the significance of their friendship: the memories they’ve built, what must be let go, and what should never be left behind. Lost in a mysterious realm where cause and effect are malleable, the friends find that time flows in all directions. Manipulate time to solve puzzles and reach the apex of each isle. Follow the duo as they unpack and explore their significant moments spent together, lighting up constellations and illuminating threads of a bittersweet narrative. … Expand"}, {"name": "Sid Meier's Civilization VI: Rise and Fall", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-vi-rise-and-fall", "publisher": "2K Games", "release_date": "Feb  8 2018", "developers": ["Firaxis Games"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 79, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/8c5555766bc718dbf2499e709e5c2782-98.jpg", "descriptions": "Civilization VI is a game about building an empire to stand the test of time, and the Rise and Fall expansion brings new choices, strategies, and challenges for players as they guide a civilization through the ages. Can you inspire the Loyalty of people around the world, or will you loseCivilization VI is a game about building an empire to stand the test of time, and the Rise and Fall expansion brings new choices, strategies, and challenges for players as they guide a civilization through the ages. Can you inspire the Loyalty of people around the world, or will you lose cities to your rivals? Will you establish a Golden Age for your civilization, or be mired in a Dark Age? In Civilization VI: Rise and Fall, you truly become a leader for the ages. Successful leadership of a civilization can send it into a prosperous Golden Age, but falling behind can usher in a Dark Age. Respond well to the challenges of a Dark Age, and your civilization can rise again into renewal with a Heroic Age.… Expand"}, {"name": "Mechstermination Force", "details_link": "https://www.metacritic.com/game/switch/mechstermination-force", "publisher": "Horberg Productions", "release_date": "Apr  3 2019", "developers": ["Horberg Productions"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 79, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/79521a51132c9c60e57bf8954ae69b79-98.jpg", "descriptions": "Battle against massive bosses, jump and climb onto them to find their weakspots and blow them to kingdom come in this action packed platforming boss rush, from the creator of the Gunman Clive series. When the MegaMechs have taken control of the world, one small group of brave soldiers areBattle against massive bosses, jump and climb onto them to find their weakspots and blow them to kingdom come in this action packed platforming boss rush, from the creator of the Gunman Clive series. When the MegaMechs have taken control of the world, one small group of brave soldiers are still fighting for humanity's independence. Join them and lead the charge against the mechanical menace. … Expand"}, {"name": "Blue Dragon", "details_link": "https://www.metacritic.com/game/xbox-360/blue-dragon", "publisher": "Microsoft Game Studios", "release_date": "Aug 28 2007", "developers": ["Mistwalker", "Artoon"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 79, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/fda6b822e750888369230fb98af65dc4-98.jpg", "descriptions": "Famed game producer Hironobu Sakaguchi of Mistwalker and developer Artoon present Blue Dragon. Featuring the character design of Akira Toriyama of Dragon Ball Z and music by Nobuo Uematsu of Final Fantasy, Blue Dragon is an epic role-playing game that centers on a young boy named Shu andFamed game producer Hironobu Sakaguchi of Mistwalker and developer Artoon present Blue Dragon. Featuring the character design of Akira Toriyama of Dragon Ball Z and music by Nobuo Uematsu of Final Fantasy, Blue Dragon is an epic role-playing game that centers on a young boy named Shu and several of his friends. These unlikely heroes possess the power to control phantom shadows that mirror the actions of their masters, giving Shu and his comrades miraculous strength and magical powers. The warriors can create and develop their combat styles by utilizing different types of Shadow Change, including Sword, Assassin, and Power Magic. Shu and his friends must use the shadows as weapons and wield their skills to save their world from impending doom.  Encountering various people on a planet where numerous ancient ruins remain, the characters and their shadows travel through a world full of mysteries and illusions, where the slightest touch can cause reactions of unparalleled magnitude. Innovative RPG gameplay features: As their quest progresses, warriors can create original attack methods by utilizing several types of Shadow Change, including Sword, Assassin, and Power Magic. You can choose to focus the hero on certain areas of expertise. Shadows level up and gain new abilities associated with the job they are currently doing. Once gained, abilities are not lost and remain available to use when needed. Massive scope and engrossing environments: Shu and his companions battle their way through an immense world filled with vividly illustrated remnants of ancient civilizations long forgotten. [Microsoft]… Expand"}, {"name": "Final Fight: Double Impact", "details_link": "https://www.metacritic.com/game/playstation-3/final-fight-double-impact", "publisher": "Capcom", "release_date": "Apr 15 2010", "developers": ["Capcom", "Proper Games Ltd"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Miscellaneous", "Beat-'Em-Up", "Compilation"], "meta_score": 79, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/3622cc6a55c08172cdb8a789f99e98d4-98.jpg", "descriptions": "[Playstation Network]  It's a double strike of arcade perfection as Final Fight: Double Impact takes you on a hard-hitting journey through Capcom history with the ultimate versions of arcade classics Final Fight and Magic Sword. Double Impact slams into your home with seamless online and[Playstation Network]  It's a double strike of arcade perfection as Final Fight: Double Impact takes you on a hard-hitting journey through Capcom history with the ultimate versions of arcade classics Final Fight and Magic Sword. Double Impact slams into your home with seamless online and local co-op multiplayer, new music by acclaimed remixologists, HD-filtered graphics, a host of unlockables to discover, and an integrated online leaderboard to prove your mettle! [Capcom]… Expand"}, {"name": "Blacktail", "details_link": "https://www.metacritic.com/game/playstation-5/blacktail", "publisher": "The Parasight", "release_date": "Dec 15 2022", "developers": ["The Parasight"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 79, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/7e0213471770133738c1d35572827376-98.jpg", "descriptions": "Create the myth of Baba Yaga by living out the origins of this classic Slavic folk story in BLACKTAIL, the first-person action-adventure from THE PARASIGHT. Experience a one-of-a-kind blend of intense archery combat and dark storytelling set in a vibrant fairy tale world. Choose your path toCreate the myth of Baba Yaga by living out the origins of this classic Slavic folk story in BLACKTAIL, the first-person action-adventure from THE PARASIGHT. Experience a one-of-a-kind blend of intense archery combat and dark storytelling set in a vibrant fairy tale world. Choose your path to become either the guardian of the woods or the terror nightmares are made of.\r You play as Yaga, a 16-year-old girl accused of witchcraft and expelled from an early medieval Slavic settlement. When living memories of her past return as foul, walking spirits, Yaga is faced with no other option than to hunt them down in hopes of unravelling her own mystery.… Expand"}, {"name": "The Knight Witch", "details_link": "https://www.metacritic.com/game/pc/the-knight-witch", "publisher": "Team17", "release_date": "Nov 29 2022", "developers": ["Super Mega Team", "Super Awesome Hyper Dimensional Mega Team"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Metroidvania"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/01bf1be420108d5319976434eb77fb2c-98.jpg", "descriptions": "The Knight Witch is a metroidvania adventure game with fast-paced, shoot 'em up combat set in a beautifully hand-drawn world.Cast devastating card-based spells, forge close bonds, and make moral choices all in your quest to save your home and discover who's behind the War Golem invasion."}, {"name": "Hardspace: Shipbreaker", "details_link": "https://www.metacritic.com/game/playstation-5/hardspace-shipbreaker", "publisher": "Focus Home Interactive", "release_date": "Sep 20 2022", "developers": ["Blackbird Interactive"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "Virtual", "Career"], "meta_score": 79, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/32d551ca7ff6c3c820257b0a5655c4ba-98.jpg", "descriptions": "Welcome to LYNX, the galaxy's leading ship-salvaging corporation!Across your career, you'll have the privilege of paying your debt to us by purchasing salvaging rights to increasingly large and valuable ships. Cut them open and extract as much value as possible!\n\nYou are equipped with theWelcome to LYNX, the galaxy's leading ship-salvaging corporation!Across your career, you'll have the privilege of paying your debt to us by purchasing salvaging rights to increasingly large and valuable ships. Cut them open and extract as much value as possible!You are equipped with the latest in LYNX tech. Carve entry points, salvage valuable materials and components with your cutting tool or slice scrap metal at any angle into a million pieces as you ponder a lonely existence... the possibilities are endless! Be cautious - dying is extremely unprofitable.We strongly advise upgrading your tools, helmet and suit to take on more lucrative contracts - all you need to worry about is how you'll pay for it!… Expand"}, {"name": "Curse of the Dead Gods", "details_link": "https://www.metacritic.com/game/playstation-4/curse-of-the-dead-gods", "publisher": "Focus Home Interactive", "release_date": "Feb 23 2021", "developers": ["Passtech Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/89e7b46c33635d8d6afdcfedd4cdae5c-98.jpg", "descriptions": "You seek untold riches, eternal life, divine powers -- it leads to this accursed temple, a seemingly-infinite labyrinth of bottomless pits, deadly traps, and monsters.Your greed will lead you to death, but that is not an escape. Rise to fight again. Delve deeper again. Defy the malignantYou seek untold riches, eternal life, divine powers -- it leads to this accursed temple, a seemingly-infinite labyrinth of bottomless pits, deadly traps, and monsters.Your greed will lead you to death, but that is not an escape. Rise to fight again. Delve deeper again. Defy the malignant deities that linger in this place. Battle through hordes of enemies in dark, cavernous passages filled with traps and secrets of all sorts -- fire-spewing statues, explosives, hidden spikes, and worse.Collect mystical Relics and an arsenal of weapons to make yourself unstoppable. Corruption builds in you with every step -- encourage or ignore it, but each powerful curse can be a double-edged sword.… Expand"}, {"name": "Olija", "details_link": "https://www.metacritic.com/game/xbox-one/olija", "publisher": "Devolver Digital", "release_date": "Jan 28 2021", "developers": ["Skeleton Crew Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 79, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/499e42decb99af7db69ed2c98aa4a0a3-98.jpg", "descriptions": "Olija is a game about Faraday's quest, a man shipwrecked then trapped in the mysterious country of Terraphage. Armed with a legendary harpoon, he and other castaways try to leave this hostile country to return to their homelands.\r Through adventurous exploration, narration and razor sharpOlija is a game about Faraday's quest, a man shipwrecked then trapped in the mysterious country of Terraphage. Armed with a legendary harpoon, he and other castaways try to leave this hostile country to return to their homelands.\r Through adventurous exploration, narration and razor sharp combat, the player will discover a strange world and its inhabitants, including Olija, an enigmatic lady that Faraday finds himself bound to over time. Inspired by swashbuckling tales and cinematic adventure games, Olija is a story about facing the unknown in adversity.… Expand"}, {"name": "Mafia: Definitive Edition", "details_link": "https://www.metacritic.com/game/xbox-one/mafia-definitive-edition", "publisher": "2K Games", "release_date": "Sep 25 2020", "developers": ["Hangar 13"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/533391a96a54a6baa1b7857ad1ffa0f0-98.jpg", "descriptions": "Part one of the Mafia crime saga - 1930s, Lost Heaven, IL Re-made from the ground up, rise through the ranks of the Mafia during the Prohibition era of organized crime. After a run-in with the mob, cab driver Tommy Angelo is thrust into a deadly underworld. Initially uneasy about falling inPart one of the Mafia crime saga - 1930s, Lost Heaven, IL Re-made from the ground up, rise through the ranks of the Mafia during the Prohibition era of organized crime. After a run-in with the mob, cab driver Tommy Angelo is thrust into a deadly underworld. Initially uneasy about falling in with the Salieri crime family, Tommy soon finds that the rewards are too big to ignore. \r\rPlay a Mob Movie:\rLive the life of a Prohibition-era gangster and rise through the ranks of the Mafia. \r\rLost Heaven, IL:\rRecreated 1930's cityscape, filled with interwar architecture, cars and culture to see, hear and interact with. \r\rRe-Made Classic:\rFaithfully recreated, with expanded story, gameplay and original score. This is the Mafia you remembered and much more.… Expand"}, {"name": "Moving Out", "details_link": "https://www.metacritic.com/game/pc/moving-out", "publisher": "Team17", "release_date": "Apr 28 2020", "developers": ["SMG Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Simulation", "Puzzle", "Action", "Virtual", "Career"], "meta_score": 79, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/523ac2c0562ee56b03ee6437e16a4679-98.jpg", "descriptions": "Moving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!Are you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. SmoothMoving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!Are you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. Smooth Moves may not be the biggest moving company, but there's no task too dangerous or strange for this busy team of go-getters. Grow your business to brave new heights, recruit colourful customizable characters, and save your town from furniture peril!… Expand"}, {"name": "WRC 8 FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/playstation-4/wrc-8-fia-world-rally-championship", "publisher": "Bigben Interactive", "release_date": "Sep 10 2019", "developers": ["Kylotonn"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 79, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/095e23c11d9f79b07235784e6480cba6-98.jpg", "descriptions": "The most complete and authentic official WRC simulation yet. New physics for all surfaces, a completely redesigned career mode, dynamic weather conditions, 50 teams, 14 countries, 100 tracks, weekly challenges and an eSports mode."}, {"name": "Druidstone: The Secret of the Menhir Forest", "details_link": "https://www.metacritic.com/game/pc/druidstone-the-secret-of-the-menhir-forest", "publisher": "Ctrl Alt Ninja Ltd.", "release_date": "May 15 2019", "developers": ["Ctrl Alt Ninja Ltd."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 79, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/19fa14949c122187b19803f7b1e24e1f-98.jpg", "descriptions": "A tactical, turn-based RPG from the makers of Legend of Grimrock games. Every action, every turn counts as you control your party of heroes through challenging, handcrafted missions in the ancient, mist-clad Menhir Forest."}, {"name": "God's Trigger", "details_link": "https://www.metacritic.com/game/xbox-one/gods-trigger", "publisher": "Techland", "release_date": "Apr 18 2019", "developers": ["Techland", "ONE MORE LEVEL"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Linear", "Shoot-'Em-Up", "Top-Down"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/74424fb606bf32eff74ab0689daf34f1-98.jpg", "descriptions": "Slay enemies with speed and precision in an over-the-top show of blood and explosions. Play solo or with others, make split-second decisions, dodge bullets, and use weapons and abilities to inflict violence in the most graphic way possible. When an Angel and a Demon team up to kill their waySlay enemies with speed and precision in an over-the-top show of blood and explosions. Play solo or with others, make split-second decisions, dodge bullets, and use weapons and abilities to inflict violence in the most graphic way possible. When an Angel and a Demon team up to kill their way into Heaven and stop the apocalypse, bullets will fly and blood will be shed. … Expand"}, {"name": "Tacoma", "details_link": "https://www.metacritic.com/game/playstation-4/tacoma", "publisher": "Fullbright", "release_date": "May  8 2018", "developers": ["Fullbright"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 79, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/2d8151fffaf9a32da6e5a8b57adbbfda-98.jpg", "descriptions": "Tacoma is a narrative-driven adventure set aboard a high-tech space station in the year 2088. Explore every detail of how the station’s crew lived and worked, finding clues that add up to a gripping story of trust, fear, and resolve in the face of disaster."}, {"name": "Call of Duty: WWII", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-wwii", "publisher": "Activision", "release_date": "Nov  3 2017", "developers": ["Sledgehammer Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 79, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/219a27bb187fee800d83e6dc0a202703-98.jpg", "descriptions": "Call of Duty returns to its roots with Call of Duty: WWII - a breathtaking experience that redefines World War II for a new gaming generation. Land in Normandy on D-Day and battle across Europe through iconic locations in historys most monumental war. Experience classic Call of Duty combat,Call of Duty returns to its roots with Call of Duty: WWII - a breathtaking experience that redefines World War II for a new gaming generation. Land in Normandy on D-Day and battle across Europe through iconic locations in historys most monumental war. Experience classic Call of Duty combat, the bonds of camaraderie, and the unforgiving nature of war against a global power throwing the world into tyranny.… Expand"}, {"name": "Monster Hunter Stories", "details_link": "https://www.metacritic.com/game/3ds/monster-hunter-stories", "publisher": "Capcom", "release_date": "Sep  8 2017", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "3DS"], "num_players": "2 ", "genres": ["Role-Playing", "Action RPG", "Japanese-Style"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/d0c49a81d620ce06ac969dafd293cd83-98.jpg", "descriptions": "When a monster strikes, the fearful hide, but the brave? They ride. Venture into monster nests to collect eggs and hatch a wide array of species with uniquely powerful skills. Form teams, battle alongside them, crush opponents with combo attacks, and ride into the sunset a champion. NeedWhen a monster strikes, the fearful hide, but the brave? They ride. Venture into monster nests to collect eggs and hatch a wide array of species with uniquely powerful skills. Form teams, battle alongside them, crush opponents with combo attacks, and ride into the sunset a champion. Need more muscle? Then mix and match genes to create monsters with more abilities! When a monster infected by the Black Blight attacks your remote village of riders, tragedy will thrust you into an exciting yet dangerous world, where you must bond with monsters on your adventure. As the story snakes along, you'll encounter a wealth of side quests and hours of challenging turn-based battles where you must coordinate monster skills, rider skills and enemy attack patterns. The instinctive rock-paper-scissors combat system is a series first, a breath of fresh air for veterans and newcomers alike. It's the perfect entry point into the popular Monster Hunter universe and a game unlike anything else in the series! You can even battle other players online, locally, or via the StreetPass feature. [Nintendo]… Expand"}, {"name": "Noitu Love: Devolution", "details_link": "https://www.metacritic.com/game/wii-u/noitu-love-devolution", "publisher": "MP2 Games", "release_date": "Sep 15 2016", "developers": ["Konjak", "MP2 Games"], "platforms": ["3DS", "PC", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 79, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/3376cda5402e568ef8158de1e8e22e6d-98.jpg", "descriptions": "The year is 2288. The city is protected by an organization called \"The Peacekeepers League\" and everything is swell except for that it's under attack! By a robot army lead by professor Darnacus Damnation!! Or is it... ?\r 100 years after the events of Noitu Love 1 the new star ofThe year is 2288. The city is protected by an organization called \"The Peacekeepers League\" and everything is swell except for that it's under attack! By a robot army lead by professor Darnacus Damnation!! Or is it... ?\r 100 years after the events of Noitu Love 1 the new star of the Peacekeepers is Xoda Rap, and what she has to endure is a sudden resurrection of the Darn armies, but adding to that the city is locally turning to places of the past! What could be causing this?\r Using a mouse reticule as a quick-dash-to-enemies and mouse gestures for special moves, Xoda will take on anything that stands in her way in the name of peace! The game shares little in pacing and action to Noitu Love 1. It is more of a continuation on that universe, so expect much more mindless action!\r Features:\r - 7 wholly different levels\r- 3 modes of playing the game\r- 3 difficulty levels befitting most players\r- Several bosses per level\r- Ratings for every level, difficulty and mode\r- A bunch of secrets and more!!… Expand"}, {"name": "Extreme Exorcism", "details_link": "https://www.metacritic.com/game/wii-u/extreme-exorcism", "publisher": "Ripstone", "release_date": "Sep 23 2015", "developers": ["Golden Ruby Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 79, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/d5c522f7655745545061ffe3ff4a99e5-98.jpg", "descriptions": "Extreme Exorcism is a paranormal platform experience in which every move you make comes back to haunt you. Assume the role of Mae Barrons, an extreme exorcist whose unconventional supernatural skills are called upon when everything and everyone else has failed to rid a haunted house of itsExtreme Exorcism is a paranormal platform experience in which every move you make comes back to haunt you. Assume the role of Mae Barrons, an extreme exorcist whose unconventional supernatural skills are called upon when everything and everyone else has failed to rid a haunted house of its ghostly presence.… Expand"}, {"name": "CastleStorm", "details_link": "https://www.metacritic.com/game/playstation-vita/castlestorm", "publisher": "Zen Studios", "release_date": "Nov  5 2013", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation Vita"], "num_players": "2 ", "genres": ["Strategy", "Real-Time", "General", "General", "Defense"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/97710b7c9c7baa72ac18a96c2c48ff0d-98.jpg", "descriptions": "CastleStorm features medieval ballista weaponry, allowing players to launch an assortment of explosive weapons including Morningstars, Apple Grenades, Homing Eagles, and even flying sheep to defeat an onslaught of enemies trying to capture your flag and destroy your castle. Deploy a fearsomeCastleStorm features medieval ballista weaponry, allowing players to launch an assortment of explosive weapons including Morningstars, Apple Grenades, Homing Eagles, and even flying sheep to defeat an onslaught of enemies trying to capture your flag and destroy your castle. Deploy a fearsome ground attack of swordsmen, knights, and donkey riders in order to protect your castle games, and if all else fails, call upon powerful spells to help keep the enemy at bay.… Expand"}, {"name": "Rift: Storm Legion", "details_link": "https://www.metacritic.com/game/pc/rift-storm-legion", "publisher": "Trion Worlds", "release_date": "Nov 13 2012", "developers": ["Trion Worlds"], "platforms": "PC", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/2273e03beed2099084a9c2e3d8b84835-98.jpg", "descriptions": "Storm Legion is the first expansion to Trion World's MMORPG game Rift."}, {"name": "Wizorb", "details_link": "https://www.metacritic.com/game/psp/wizorb", "publisher": "Beatshapers", "release_date": "Jul 24 2012", "developers": ["Beatshapers"], "platforms": ["iPhone/iPad", "PC", "Switch", "PSP"], "genres": ["Miscellaneous", "Puzzle", "Action", "General", "Puzzle", "Action"], "meta_score": 79, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/68e9b82df0391e8606979f7e9639a45a-98.jpg", "descriptions": "Wizorb is a unique combination of classic block-breaking action and light RPG elements."}, {"name": "Tom Clancy's Ghost Recon: Future Soldier", "details_link": "https://www.metacritic.com/game/playstation-3/tom-clancys-ghost-recon-future-soldier", "publisher": "Ubisoft", "release_date": "May 22 2012", "developers": ["Ubisoft Paris"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 79, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/a1fbef5939d7b9b36c57570895c0c8e1-98.jpg", "descriptions": "The Ghosts are an untraceable unit of soldiers who hunt down high value targets in the highest-risk conflict zones around the world. In the near future, four of these elite soldiers form the tip of the spear in a hidden war simmering world-wide. As the Ghosts accomplish their objectives,The Ghosts are an untraceable unit of soldiers who hunt down high value targets in the highest-risk conflict zones around the world. In the near future, four of these elite soldiers form the tip of the spear in a hidden war simmering world-wide. As the Ghosts accomplish their objectives, they discover a far greater threat - one that could permanently alter the international balance of power. Join the Ghosts – Control Sergeant Kozak and his unit through fourteen missions in eight exotic locales, from Africa to the Arctic Circle. Fight using the tech of tomorrow including optical camouflage, augmented reality and drones. Comandeer over 50 Weapons and customize them with Gunsmith Mode- Harness the formidable firepower of an army and optimize every aspect of your arsenal in the Gunsmith mode. Intense Multiplayer- four game modes, ten maps and multiple classes along with Ghost Recon's classic siege mode.… Expand"}, {"name": "Madden NFL 12", "details_link": "https://www.metacritic.com/game/playstation-3/madden-nfl-12", "publisher": "EA Sports", "release_date": "Aug 30 2011", "developers": ["EA Tiburon"], "platforms": ["iPhone/iPad", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 79, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/2bc559108b239c6fb04989ab54183093-98.jpg", "descriptions": "Madden NFL 12 is the newest iteration in the Madden football series."}, {"name": "Crayon Physics Deluxe", "details_link": "https://www.metacritic.com/game/pc/crayon-physics-deluxe", "publisher": "Petri Purho", "release_date": "Jan  7 2009", "developers": ["Petri Purho"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/ef8a61b25b5c8c0028583adb5e9f1c9b-98.jpg", "descriptions": "Crayon Physics Deluxe is a 2D physics puzzle game, in which you get to experience what it would be like if your drawings would be magically transformed into real physical objects. Solve puzzles with your artistic vision and creative use of physics. [Kloonigames]"}, {"name": "Tony Hawk's Proving Ground", "details_link": "https://www.metacritic.com/game/ds/tony-hawks-proving-ground", "publisher": "Activision", "release_date": "Oct 15 2007", "developers": ["Vicarious Visions"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "4  Online", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 79, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/1aab59572c9af9c3d80854f092ad674c-98.jpg", "descriptions": "For the first time, players will have the freedom to define their character, story and style based on the choices they make, the paths they choose and the style of skating they use on the proving grounds from Philadelphia and Baltimore to Washington, D.C. Tony Hawk's Proving Ground featuresFor the first time, players will have the freedom to define their character, story and style based on the choices they make, the paths they choose and the style of skating they use on the proving grounds from Philadelphia and Baltimore to Washington, D.C. Tony Hawk's Proving Ground features deeper customization than ever before, including a Video Editor with full-featured editing tools and visual effects for creating \"epic skate videos,\" and a fully customizable online Skate Lounge where players can skate with friends in the ultimate pad. In addition, players have the freedom to skate from single player to online seamlessly, as well as utilize new gameplay mechanics such as skateable terrain altering and building, and Bowl Carving. Tony Hawk’s Proving Ground also features even more Nail the Trick moves such as Nail the Grab and Nail the Manual intensifying the thrill of pulling off big tricks. [Activision]… Expand"}, {"name": "Nancy Drew: Legend of the Crystal Skull", "details_link": "https://www.metacritic.com/game/pc/nancy-drew-legend-of-the-crystal-skull", "publisher": "Her Interactive", "release_date": "Oct  8 2007", "developers": ["Her Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 79, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/3143ce58b5fd565507d3c2eee3d3e778-98.jpg", "descriptions": "Bruno Bolet was the proud owner of the \"Whisperer,\" a crystal skull rumored to protect its holder from almost any cause of death - except murder. When Bruno passed away, his nephew Henry came to wrap up his affairs, but he couldn't find the skull among the clutter of the creepy Bolet manor.Bruno Bolet was the proud owner of the \"Whisperer,\" a crystal skull rumored to protect its holder from almost any cause of death - except murder. When Bruno passed away, his nephew Henry came to wrap up his affairs, but he couldn't find the skull among the clutter of the creepy Bolet manor. You'll need to team up with Nancy's best friend Bess Marvin to find this mystical artifact before it falls into the wrong hands! [Her Interactive]… Expand"}, {"name": "Mario Strikers Charged", "details_link": "https://www.metacritic.com/game/wii/mario-strikers-charged", "publisher": "Nintendo", "release_date": "Jul 30 2007", "developers": ["Next Level Games"], "platforms": "Wii", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Arcade", "Arcade"], "meta_score": 79, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/956c15e3f95d9c5a1f94229ab147d00d-98.jpg", "descriptions": "(Also known as \"Mario Strikers Charged Football\")  Take to the pitch as Mario Strikers Charged arrives with a new roster of features. The follow-up to \"Super Mario Strikers\" delivers bigger shots, massive hits and the chance to play gamers around the world. Mario Strikers Charged is(Also known as \"Mario Strikers Charged Football\")  Take to the pitch as Mario Strikers Charged arrives with a new roster of features. The follow-up to \"Super Mario Strikers\" delivers bigger shots, massive hits and the chance to play gamers around the world. Mario Strikers Charged is high-impact, all the time. More captains, more playing fields, more sidekicks: It's crush or be crushed in this wild kickfest. Goal Control: Use the skill the Wii Remote and Nunchuk controllers provide to win the ball, score unstoppable goals and take control of the goal keeper to perform spectacular saves. Score Big with Mega Strikes: Each captain has his or her own set of skills and super abilities, as well as the ability to perform special shots called Mega Strikes, where the iron ball splits into five balls and flies at the goal. The defending player must use the Wii Remote controller to shoot these balls out of the air to stop a goal. [Nintendo]… Expand"}, {"name": "Mega Man Maverick Hunter X", "details_link": "https://www.metacritic.com/game/psp/mega-man-maverick-hunter-x", "publisher": "Capcom", "release_date": "Jan 31 2006", "developers": ["Capcom"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 79, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/aac7007fcfc2a16e7245519260517bf2-98.jpg", "descriptions": "Mega Man Maverick Hunter X is a remake of the original Mega Man X title that first appeared on the Super Nintendo Entertainment System. The game builds upon the original, adding newly rendered 3D character models, totally new environments and gameplay features that raise the bar forMega Man Maverick Hunter X is a remake of the original Mega Man X title that first appeared on the Super Nintendo Entertainment System. The game builds upon the original, adding newly rendered 3D character models, totally new environments and gameplay features that raise the bar for side-scrolling platformers. Mega Man Maverick Hunter X also includes an animated movie that provides real insight into the Mega Man X universe and even gives gamers a sneak peek at events that took place before the plot line of the first game. Plus to ensure that even the most veteran of gamers is given a real challenge, the level arrangements have been modified; with item locations, map layouts and the strategies needed for completing levels all updated. The year is 21XX. A mysterious robot named X has become the model from which further robots, called Reploids, were created to aid mankind. Unfortunately, some of the Reploids turned against the humans and were given the name Mavericks. In response to this, the Maverick Hunters, an elite squad of Reploids, was formed to combat these renegade Reploids and calm was restored until one of the Maverick Hunters, a powerful Reploid named Sigma, turned against the peacekeepers. Now X and his fellow Maverick Hunter friend, Zero, must prevent Sigma from executing his evil plans to destroy humanity. [Capcom]… Expand"}, {"name": "EverQuest II: Desert of Flames", "details_link": "https://www.metacritic.com/game/pc/everquest-ii-desert-of-flames", "publisher": "Sony Online Entertainment", "release_date": "Sep 12 2005", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 79, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/155568a452be07d3d1c5d29137b42417-98.jpg", "descriptions": "The first expansion is set within an Arabian Nights theme. It builds upon familiar EverQuest lore, and takes place within the desert of Ro and its city, Maj'Dul. Arena Champions: Take the form of exotic creatures or fight as yourself in battles for glory against other creatures or players.The first expansion is set within an Arabian Nights theme. It builds upon familiar EverQuest lore, and takes place within the desert of Ro and its city, Maj'Dul. Arena Champions: Take the form of exotic creatures or fight as yourself in battles for glory against other creatures or players. New movement: Search for treasure and find adventure in new areas by climbing up and down cliffs and walls. Voice-over emotes: Express yourself in a battle or expand your social circle with new voice emotes. Guild vaults: Share the loot of a hard won battle with the rest of your guild members. Level range increase: Now play up to level 60 as both an Adventurer and Artisan! New land: Discover over a dozen new zones and epic encounters. New creatures: Test your combat skills in battles with over 30 new fearsome creatures. [Sony Online Entertainment]… Expand"}, {"name": "Madden NFL 2005", "details_link": "https://www.metacritic.com/game/game-boy-advance/madden-nfl-2005", "publisher": "EA Sports", "release_date": "Aug  9 2004", "developers": ["Exient Entertainment"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/8c386efd3a9480ddd8e72b63878b52cd-98.jpg", "descriptions": "Madden NFL 2005 introduces the Hit Stick, a new feature that lets players turn a game around with a crucial tackle. Along with all-new defensive preplay controls and defensive artificial intelligence enhancements, the defense now has a diverse arsenal of weapons available. Also, the depth ofMadden NFL 2005 introduces the Hit Stick, a new feature that lets players turn a game around with a crucial tackle. Along with all-new defensive preplay controls and defensive artificial intelligence enhancements, the defense now has a diverse arsenal of weapons available. Also, the depth of Franchise mode grows with the addition of Storyline Central, a weekly radio talk show that discusses current stories regarding your team and the league. With even more Franchise mode additions, hundreds of new animations, and the new Create-a-Fan feature, Madden NFL 2005 takes the series to the next level.… Expand"}, {"name": "SimCity 4: Rush Hour", "details_link": "https://www.metacritic.com/game/pc/simcity-4-rush-hour", "publisher": "Electronic Arts", "release_date": "Sep 22 2003", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "City Building", "Management", "Modern", "Modern", "Government"], "meta_score": 79, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/2c68d3307d191f64b9809868c80d7eae-98.jpg", "descriptions": "Get your Sims on the road to happiness by taking control of your city's transportation including roads, rail, air, waterways, and even cars. Take complete charge of vehicles on the streets of your city. Is the fire department stuck in traffic on its way to a four-alarm fire? Take directGet your Sims on the road to happiness by taking control of your city's transportation including roads, rail, air, waterways, and even cars. Take complete charge of vehicles on the streets of your city. Is the fire department stuck in traffic on its way to a four-alarm fire? Take direct control of the \"hook and ladder\" and pursue the quickest route to the blazing inferno. Solve missions from chasing down bank robbers to catching car-jackers, and earn reward buildings and other vehicles. [Electronic Arts]… Expand"}, {"name": "The Simpsons: Hit & Run", "details_link": "https://www.metacritic.com/game/gamecube/the-simpsons-hit-run", "publisher": "VU Games", "release_date": "Sep 16 2003", "developers": ["Radical Entertainment"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Mission-based"], "meta_score": 79, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/2/433592e1690988e0e5675887e47008d1-98.jpg", "descriptions": "Explore Springfield as your favorite Simpsons characters as you unravel the plot that threatens the town's very existence.  Play as Homer, Bart, Marge, Lisa, and Apu in over 56 driving and on-foot missions in seven challenging levels.  Drive in 40 of Springfield's finest vehicles includingExplore Springfield as your favorite Simpsons characters as you unravel the plot that threatens the town's very existence.  Play as Homer, Bart, Marge, Lisa, and Apu in over 56 driving and on-foot missions in seven challenging levels.  Drive in 40 of Springfield's finest vehicles including Mr.  Plow and the Canyonero.  Unlock the multiplayer mode to play against three other players.  The world of the Simpsons has many gags and surprises in store for you. … Expand"}, {"name": "Tenchu: Wrath of Heaven", "details_link": "https://www.metacritic.com/game/playstation-2/tenchu-wrath-of-heaven", "publisher": "Activision", "release_date": "Mar  3 2003", "developers": ["K2 LLC"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 79, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/a23f97962db4d2175c09156de30efc10-98.jpg", "descriptions": "Move like a shadow. Strike like a snake... After amassing an army of ninjas and lords of darkness, the mysterious Tenrai has begun a quest to conquer 16th-century Japan. Now your master, Lord Gohda, has called upon you - a cunning stealth assassin - to stop Tenrai and his disciples beforeMove like a shadow. Strike like a snake... After amassing an army of ninjas and lords of darkness, the mysterious Tenrai has begun a quest to conquer 16th-century Japan. Now your master, Lord Gohda, has called upon you - a cunning stealth assassin - to stop Tenrai and his disciples before all is lost. [Activision]… Expand"}, {"name": "Uncommon Valor: Campaign for the South Pacific", "details_link": "https://www.metacritic.com/game/pc/uncommon-valor-campaign-for-the-south-pacific", "publisher": "Matrix Games", "release_date": "Dec  2 2002", "developers": ["2By3 Games"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "General"], "meta_score": 79, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/6269341cbfc45072b832831e1b557f0a-98.jpg", "descriptions": "You will find that you are not just playing a game but running a war! Uncommon Valor is a completely new operational game covering the campaigns for New Guinea, New Britain, New Ireland and the Solomon chain from May 1942 to the end of December 1943. The scale is 30 miles per hex and theYou will find that you are not just playing a game but running a war! Uncommon Valor is a completely new operational game covering the campaigns for New Guinea, New Britain, New Ireland and the Solomon chain from May 1942 to the end of December 1943. The scale is 30 miles per hex and the attrition factor is individual vehicles, guns and squads. Phases are one day, composed of two 12-hour impulses. A turn is composed of 1 to 7 phases, at the player's discretion. He may also choose continuous play and may interrupt that by pressing a key. [Matrix Games]… Expand"}, {"name": "Deathrow", "details_link": "https://www.metacritic.com/game/xbox/deathrow", "publisher": "Ubisoft", "release_date": "Oct 22 2002", "developers": ["Southend Interactive"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Futuristic"], "meta_score": 79, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/141018709677a354e7912a058efcbee7-98.jpg", "descriptions": "Enter a brutal fighting sport where only the fastest and toughest players are victorious. Deathrow combines the fast gameplay of third-person action games, the intensity of fighting games, and the cooperative team play and gritty roughness of rugby. The object of Deathrow is to win matchesEnter a brutal fighting sport where only the fastest and toughest players are victorious. Deathrow combines the fast gameplay of third-person action games, the intensity of fighting games, and the cooperative team play and gritty roughness of rugby. The object of Deathrow is to win matches by any means necessary, either by scoring as many points as possible before time runs out or by severely injuring your opponents and removing them from the field of combat. Engage in fierce hand-to-hand combat against your friends, enemies, or intelligent AI opponents that don't just get mad--they get even.… Expand"}, {"name": "Global Operations", "details_link": "https://www.metacritic.com/game/pc/global-operations", "publisher": "Crave", "release_date": "Mar 25 2002", "developers": ["Barking Dog"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 79, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/6325b7747b7423ae850832a1ea9723b0-98.jpg", "descriptions": "Global Operations puts you into present-day hot spots such as Chechnya, Sri Lanka, North Africa and the South China Seas. As a member of an elite military force, accomplish team-specific missions like hostage rescue, bomb disarmament and VIP escort. Only as a team can you defeat theGlobal Operations puts you into present-day hot spots such as Chechnya, Sri Lanka, North Africa and the South China Seas. As a member of an elite military force, accomplish team-specific missions like hostage rescue, bomb disarmament and VIP escort. Only as a team can you defeat the opposition. [Electronic Arts]… Expand"}, {"name": "Burnout", "details_link": "https://www.metacritic.com/game/playstation-2/burnout", "publisher": "Acclaim", "release_date": "Nov  1 2001", "developers": ["Criterion Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 79, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/047ab5339b081f6ce55803af3fc9fccb-98.jpg", "descriptions": "A high-energy arcade style racer in which you're rewarded for near-misses and the more risks you take. Civilians steer clear! Over 300 vehicles fill the streets and highways making reckless racing and wild demolition a certainty.  [Acclaim]"}, {"name": "Mega Man Battle Network", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-battle-network", "publisher": "Capcom", "release_date": "Oct 30 2001", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 79, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/9614e8d0a07da743f6d918b9eac30eb0-98.jpg", "descriptions": "In the future, a young net-battler named Lan, boots his 'personal exploration terminal' (PET) and prepares to hack into the network to battle net crime. Lan's PET is no ordinary network navigator. It's Mega Man.EXE, the cyber-identity, which infiltrates the crime-ridden network to battleIn the future, a young net-battler named Lan, boots his 'personal exploration terminal' (PET) and prepares to hack into the network to battle net crime. Lan's PET is no ordinary network navigator. It's Mega Man.EXE, the cyber-identity, which infiltrates the crime-ridden network to battle destructive computer viruses. Defeat viruses in real time and collect Battle Chips program data, containing valuable weapons data and critical system info. Collect over 175 Battle Chips to help Land and Mega Man.EXE restore peace and order to the network.… Expand"}, {"name": "StarLancer", "details_link": "https://www.metacritic.com/game/dreamcast/starlancer", "publisher": "Crave", "release_date": "Nov 27 2000", "developers": ["Digital Anvil"], "platforms": ["PC", "Dreamcast"], "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 79, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/3cc49551dbbb044847e8fb62715fc511-98.jpg", "descriptions": "From Erin and Chris Roberts, the award winning designers of Wing Commander comes a game beyond the reaches of your imagination. Battle for control of the galaxy as a member of the elite 45th Squadron or take on your friends in epic, multi-player deathmatch battles. With every hour, theFrom Erin and Chris Roberts, the award winning designers of Wing Commander comes a game beyond the reaches of your imagination. Battle for control of the galaxy as a member of the elite 45th Squadron or take on your friends in epic, multi-player deathmatch battles. With every hour, the Coalition grows stronger, and the fall of the Alliance is at hand. Fight for Freedom! The 45th Wants You!… Expand"}, {"name": "Mafia: Definitive Edition", "details_link": "https://www.metacritic.com/game/pc/mafia-definitive-edition", "publisher": "2K Games", "release_date": "Sep 24 2020", "developers": ["Hangar 13"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/7f81327661366c7f9b8fb4cae959c030-98.jpg", "descriptions": "Part one of the Mafia crime saga - 1930s, Lost Heaven, IL Re-made from the ground up, rise through the ranks of the Mafia during the Prohibition era of organized crime. After a run-in with the mob, cab driver Tommy Angelo is thrust into a deadly underworld. Initially uneasy about falling inPart one of the Mafia crime saga - 1930s, Lost Heaven, IL Re-made from the ground up, rise through the ranks of the Mafia during the Prohibition era of organized crime. After a run-in with the mob, cab driver Tommy Angelo is thrust into a deadly underworld. Initially uneasy about falling in with the Salieri crime family, Tommy soon finds that the rewards are too big to ignore. \r\rPlay a Mob Movie:\rLive the life of a Prohibition-era gangster and rise through the ranks of the Mafia. \r\rLost Heaven, IL:\rRecreated 1930's cityscape, filled with interwar architecture, cars and culture to see, hear and interact with. \r\rRe-Made Classic:\rFaithfully recreated, with expanded story, gameplay and original score. This is the Mafia you remembered and much more.… Expand"}, {"name": "Shadow Warrior 2", "details_link": "https://www.metacritic.com/game/pc/shadow-warrior-2", "publisher": "Devolver Digital", "release_date": "Oct 13 2016", "developers": ["Flying Wild Hog"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/e270a3b65173e61938e3e6e009bb80fd-98.jpg", "descriptions": "Shadow Warrior 2 is the evolution of Flying Wild Hog’s offbeat first-person shooter following the further misadventures of former corporate shogun Lo Wang. Now surviving as a reclusive mercenary on the edge of a corrupted world, the formidable warrior must again wield a devastatingShadow Warrior 2 is the evolution of Flying Wild Hog’s offbeat first-person shooter following the further misadventures of former corporate shogun Lo Wang. Now surviving as a reclusive mercenary on the edge of a corrupted world, the formidable warrior must again wield a devastating combination of guns, blades, magic and wit to strike down the demonic legions overwhelming the world. Battle alongside allies online in four-player co-op or go it alone in spectacular procedurally-generated landscapes to complete daring missions and collect powerful new weapons, armor, and arcane relics of legend.… Expand"}, {"name": "Dance Dance Revolution Ultramix 2", "details_link": "https://www.metacritic.com/game/xbox/dance-dance-revolution-ultramix-2", "publisher": "Konami", "release_date": "Nov 18 2004", "developers": ["Konami Computer Entertainment Hawaii"], "platforms": "Xbox", "num_players": "16  Online", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/7fc2c34adf27da94a2b88f3a2d1cd838-98.jpg", "descriptions": "The dance revolution continues on the Xbox with Dance Dance Revolution Ultramix 2. This sequel features new gameplay modes, exclusive songs, and enhanced Xbox Live support. Now you can compete head-to-head with other dancers nationwide, conduct online tournaments, and upload content, inThe dance revolution continues on the Xbox with Dance Dance Revolution Ultramix 2. This sequel features new gameplay modes, exclusive songs, and enhanced Xbox Live support. Now you can compete head-to-head with other dancers nationwide, conduct online tournaments, and upload content, in addition to downloading new songs, dance steps, and characters. The game also includes new game modes, including Team Battles (in which two pairs of players face off against each other) and Synch (a cooperative two-player mode where players must match up their steps while mastering the song).… Expand"}, {"name": "Apotheon", "details_link": "https://www.metacritic.com/game/pc/apotheon", "publisher": "Alientrap", "release_date": "Feb  3 2015", "developers": ["Alientrap"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Platformer", "2D", "Platformer", "Action", "Beat-'Em-Up", "2D"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/d48abb3c0359ac12543ecb63c3b7df19-98.jpg", "descriptions": "Apotheon is an action game set in the vivid world of Ancient Greek Mythology. Climb Mount Olympus, wrest the divine powers from the Pantheon of Gods, and save mankind."}, {"name": "Wild Hearts", "details_link": "https://www.metacritic.com/game/playstation-5/wild-hearts", "publisher": "Electronic Arts", "release_date": "Feb 17 2023", "developers": ["Omega Force"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action Adventure", "General", "Action RPG"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/2de4f3913ea8432f1a3d7c3f544815eb-98.jpg", "descriptions": "Master ancient tech to hunt down giant beasts through a fantasy world inspired by feudal Japan. WILD HEARTS is a unique twist on the hunting genre where technology gives you a fighting chance against fearsome beasts infused with the ferocious power of nature itself.  Take on these creaturesMaster ancient tech to hunt down giant beasts through a fantasy world inspired by feudal Japan. WILD HEARTS is a unique twist on the hunting genre where technology gives you a fighting chance against fearsome beasts infused with the ferocious power of nature itself.  Take on these creatures alone or hunt with friends in seamless co-op. Developed by Omega Force, the Japanese studio behind the Dynasty Warriors franchise and in partnership with EA Originals, WILD HEARTS takes you on an epic adventure set in a fantasy world inspired by feudal Japan.\r… Expand"}, {"name": "The Walking Dead: The Telltale Series - A New Frontier Episode 2: Ties That Bind Part Two", "details_link": "https://www.metacritic.com/game/xbox-one/the-walking-dead-the-telltale-series---a-new-frontier-episode-2-ties-that-bind-part-two", "publisher": "Telltale Games", "release_date": "Dec 20 2016", "developers": ["Telltale Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/48de396df95a06a8de24fbf91e6a7157-98.jpg", "descriptions": "When family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken fromWhen family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken from him, you meet a young girl who has experienced her own unimaginable loss. Her name is Clementine, and your fates are bound together in a story where every choice you make could be your last.… Expand"}, {"name": "Need for Speed: Most Wanted - A Criterion Game", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-most-wanted---a-criterion-game", "publisher": "Electronic Arts", "release_date": "Oct 30 2012", "developers": ["Criterion Games"], "platforms": ["PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 78, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/0/616808b42357d11baca1a535dbb1aa45-98.jpg", "descriptions": "To be Most Wanted, you’ll need to outrun the cops, outdrive your friends, and outsmart your rivals."}, {"name": "Star Wars: Battlefront II", "details_link": "https://www.metacritic.com/game/pc/star-wars-battlefront-ii", "publisher": "LucasArts", "release_date": "Oct 31 2005", "developers": ["Pandemic Studios"], "platforms": ["PlayStation 2", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/bd80581d4bf62bfab2ba5804d2ea7fc5-98.jpg", "descriptions": "Star Wars Battlefront II improves upon the original game's single-player experience with open-ended, mission-based objectives inspired from all six Star Wars films. The compelling storyline spans more than 12 new locations, many from Episode III, including volcanic Mustafar and the spaceStar Wars Battlefront II improves upon the original game's single-player experience with open-ended, mission-based objectives inspired from all six Star Wars films. The compelling storyline spans more than 12 new locations, many from Episode III, including volcanic Mustafar and the space battle above Coruscant. All-new classic movie moments complete the Star Wars Battlefront II experience, as players battle within the interior of the Death Star and visit Princess Leia’s blockade runner, the Tantive IV, as seen at the beginning of Episode IV A New Hope. In addition, at certain key moments within the battles, players can feel the Force as a Jedi. For the first time ever, Star Wars Battlefront II players can engage in space combat and, during the same battle, board enemy ships to attack from within. Starting on foot inside a capital ship, players can enter the spacecraft of their choice and travel into space to dogfight with the rival faction. From there, they can dock within the enemy’s capital ship, overtake the ship’s command posts, man its turrets to disable its shields and destroy it from within! Or, they can simply stay inside their own capital ship and defend it from attacks and enemy fire. The choice is theirs. The stellar online play that marked the original Star Wars Battlefront returns even bigger and better for Star Wars Battlefront II. Players can locate their buddies and track their stats as they battle alongside more players than ever (up to 24 on PS2, 32 on Xbox, 64 on Windows). [LucasArts]… Expand"}, {"name": "The Walking Dead: Season Two Episode 1 - All That Remains", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-season-two-episode-1---all-that-remains", "publisher": "Telltale Games", "release_date": "Dec 17 2013", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "genres": ["General", "Action", "Adventure", "General", "Point-and-Click"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/f47e9d0dfc08b0cbcd0c66777b8927c7-98.jpg", "descriptions": "The Walking Dead: Season Two continues the story of Clementine, a young girl orphaned by the zombie apocalypse. Left to fend for herself, she has been forced to learn how to survive in a world gone mad. Many months have passed since the events seen in Season One of The Walking Dead, andThe Walking Dead: Season Two continues the story of Clementine, a young girl orphaned by the zombie apocalypse. Left to fend for herself, she has been forced to learn how to survive in a world gone mad. Many months have passed since the events seen in Season One of The Walking Dead, and Clementine is in search of safety. But what can an ordinary child do to stay alive when the living can be just as bad – and sometimes worse – than the dead? As Clementine, you will be tested by situations and dilemmas that will test your morals and your instinct for survival. Your decisions and actions will change the story around you.… Expand"}, {"name": "WWE SmackDown vs. Raw 2010", "details_link": "https://www.metacritic.com/game/wii/wwe-smackdown-vs-raw-2010", "publisher": "THQ", "release_date": "Oct 20 2009", "developers": ["Yuke's"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/e37533888329d503acbf8a621261c8b1-98.jpg", "descriptions": "Featuring unparalleled creation tools, a robust Superstar roster, key franchise improvements and a few surprises, WWE SmackDown vs. Raw 2010 delivers the empowering freedom to create, customize and share gameplay experiences.  It’s the player’s world now. [THQ]"}, {"name": "Roogoo", "details_link": "https://www.metacritic.com/game/xbox-360/roogoo", "publisher": "SouthPeak Games", "release_date": "Jun  4 2008", "developers": ["SpiderMonk"], "platforms": ["PC", "Xbox 360"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/ae8ceab9952876f8c26f1ffddb35dbef-98.jpg", "descriptions": "[Xbox Live Arcade]  Roogoo updates the square peg in a round hole premise to a whole new level. Help the Roogoo defeat their enemies, the evil Meemoo, in Roogoo, a new and innovative action-based puzzler. Players line up multiple platforms on different levels to allow shaped blocks to pass[Xbox Live Arcade]  Roogoo updates the square peg in a round hole premise to a whole new level. Help the Roogoo defeat their enemies, the evil Meemoo, in Roogoo, a new and innovative action-based puzzler. Players line up multiple platforms on different levels to allow shaped blocks to pass through and once enough of them stack up, that particular shape closes off. A simple premise becomes more complicated as Meemoos begin to obstruct players' paths, and butterflies attempt to steal blocks away. Players must swivel, roll, and boost their way through 45 puzzle-filled levels alone or with up to four friends in cooperative party mode play. For those with a more competitive spirit, Roogoo offers a two-player multiplayer mode over Xbox Live where players battle to solve the same puzzle and can build up attacks to thwart their competitors' efforts. [SpiderMonk]… Expand"}, {"name": "Golf Story", "details_link": "https://www.metacritic.com/game/switch/golf-story", "publisher": "SideBar Games", "release_date": "Sep 28 2017", "developers": ["SideBar Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/bac531b112667d13e2c1fb6ebfe20b76-98.jpg", "descriptions": "Tee up anywhere - on and off the course. Golf Story combines the sheer excitement of golf with a serious story that plays out over 8 different courses. Play the story of a golfer who is forced to give up all that he holds dear for one last shot at accomplishing his dreams. But all is not soTee up anywhere - on and off the course. Golf Story combines the sheer excitement of golf with a serious story that plays out over 8 different courses. Play the story of a golfer who is forced to give up all that he holds dear for one last shot at accomplishing his dreams. But all is not so simple in the world of golf. To best today's players you have to be able to keep up with them both on and off the course.\r Features:\r *    Tee up anywhere! Youll be surprised by how many problems can be solved by hitting a golf ball at them.\r*    Explore 8 unique environments, each with their own courses, challenges, people and secrets.\r*    Play through a dramatic story with a diverse cast of characters.… Expand"}, {"name": "DG2: Defense Grid 2", "details_link": "https://www.metacritic.com/game/xbox-one/dg2-defense-grid-2", "publisher": "505 Games", "release_date": "Sep 24 2014", "developers": ["Hidden Path Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Strategy", "Real-Time", "General", "Defense"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/d5e49d8f672707397ff38341a6ec105e-98.jpg", "descriptions": "Defense Grid 2, DG2, is the highly-anticipated sequel to Hidden Path Entertainments 2008 Defense Grid: The Awakening. Setting the bar as the definitive tower defense game, Defense Grid 2 introduces new worlds and threats to test your tower placement strategies. With a bold new look, aDefense Grid 2, DG2, is the highly-anticipated sequel to Hidden Path Entertainments 2008 Defense Grid: The Awakening. Setting the bar as the definitive tower defense game, Defense Grid 2 introduces new worlds and threats to test your tower placement strategies. With a bold new look, a compelling single-player campaign, and the addition of new game modes, online player-versus-player and multiplayer co-op, every play-through brings fun new opportunities and challenges. DG2 comes with a story campaign featuring 21 stunning maps, dynamic level movement, an expanded story and cast of characters, hundreds of challenge mode experiences, new multiplayer modes, a procedurally driven audio score and the ability for players to build their own levels. DG2 also introduces players to DG Architect, a level creation tool set connected to Steam Workshop where players can create their own unique levels to share and possibly even sell if selected. DG2 for the PC was funded in part by Dracogen, a private investor after a 2012 Kickstarter campaign funded the original game's DLC, Defense Grid: Containment. DG2 is developed by Hidden Path Entertainment and published by 505 Games.… Expand"}, {"name": "The Journey Down: Chapter Two", "details_link": "https://www.metacritic.com/game/pc/the-journey-down-chapter-two", "publisher": "SkyGoblin", "release_date": "Aug 25 2014", "developers": ["SkyGoblin"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/2e42db75085424c9aeb34fd616283b16-98.jpg", "descriptions": "The Journey Down is a point-and-click saga with an Afro-Caribbean vibe."}, {"name": "Muramasa Rebirth", "details_link": "https://www.metacritic.com/game/playstation-vita/muramasa-rebirth", "publisher": "Aksys Games", "release_date": "Jun 25 2013", "developers": ["Vanillaware"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 78, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/a9d50080ea613e47c6672dc2feb4dd10-98.jpg", "descriptions": "Muramasa Rebirth is the follow-up to Muramasa: The Demon Blade that tells the tale of two souls and 108 deadly blades."}, {"name": "Star Trek: Elite Force II", "details_link": "https://www.metacritic.com/game/pc/star-trek-elite-force-ii", "publisher": "Activision", "release_date": "Jun 25 2003", "developers": ["Ritual Entertainment"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/36f7dad3e4e13bb552f7b678a39f667d-98.jpg", "descriptions": "Resume the role of Alexander Munro, chief of the Hazard Team, Starfleet's elite security unit. Now assigned to the U.S.S. Enterprise NCC 1701-E, you'll explore strange new worlds, battle against both new and familiar civilizations and go on the most dangerous assignments in the galaxy. AfterResume the role of Alexander Munro, chief of the Hazard Team, Starfleet's elite security unit. Now assigned to the U.S.S. Enterprise NCC 1701-E, you'll explore strange new worlds, battle against both new and familiar civilizations and go on the most dangerous assignments in the galaxy. After a brief prologue on the U.S.S. Voyager and a short stint at Starfleet Academy, the Hazard Team is assigned its toughest mission yet - duty onboard the Federation?s renowned flagship, the U.S.S. Enterprise NCC 1701-E. Powered by id Software's QUAKE III: Team Arena engine, Star Trek Elite Force II permits players to break out of the confines of ship bulkheads and spacestation corridors, and undertake away team missions in open environments such as expansive alien landscapes, the void of space and deadly swamps.… Expand"}, {"name": "Tiger Woods PGA Tour 11", "details_link": "https://www.metacritic.com/game/playstation-3/tiger-woods-pga-tour-11", "publisher": "Electronic Arts", "release_date": "Jun  8 2010", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/387251602cfcf6878cec0425fcbd79c4-98.jpg", "descriptions": "One of the most prestigious tournaments in golf, The Ryder Cup, is featured in Tiger Woods PGA TOUR 11. Gamers select a team and square off to try and bring home The Ryder Cup for their squad. The Ryder Cup is one of the last great sporting events to be founded in prestige rather than prizeOne of the most prestigious tournaments in golf, The Ryder Cup, is featured in Tiger Woods PGA TOUR 11. Gamers select a team and square off to try and bring home The Ryder Cup for their squad. The Ryder Cup is one of the last great sporting events to be founded in prestige rather than prize money.  Choose from the U.S. or European squad and participate in the various competition formats – foursomes where players hit alternate shots, fourballs and singles which traditionally bring the biennial event to a close with players going head to head. When playing The Ryder Cup mode offline, gamers have the option to swap matches, thus giving you the ultimate control over the outcomes of other matches. [Electronic Arts]… Expand"}, {"name": "Pinball FX3", "details_link": "https://www.metacritic.com/game/playstation-4/pinball-fx3", "publisher": "Zen Studios", "release_date": "Sep 26 2017", "developers": ["Zen Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Pinball"], "meta_score": 78, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/a7189ae12b725dbb0ab791c5aa5c5885-98.jpg", "descriptions": "Multiplayer matchups, user generated tournaments and league play create endless opportunity for pinball competition."}, {"name": "This War of Mine: The Little Ones", "details_link": "https://www.metacritic.com/game/xbox-one/this-war-of-mine-the-little-ones", "publisher": "Deep Silver", "release_date": "Jan 29 2016", "developers": ["11 bit studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Miscellaneous", "Action Adventure", "Real-Time", "Survival", "Board / Card Game", "General"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/573a1d915c725074d3dc5d3ef56b2436-98.jpg", "descriptions": "This War of Mine: The Little Ones explores the hardships of wartime survival as seen from an entirely new perspective; that of a child.\r Based on This War of Mine, The Little Ones puts you in charge of a group of adults and children stuck in the middle of hell, trying to survive in aThis War of Mine: The Little Ones explores the hardships of wartime survival as seen from an entirely new perspective; that of a child.\r Based on This War of Mine, The Little Ones puts you in charge of a group of adults and children stuck in the middle of hell, trying to survive in a besieged city; struggling with lack of food, medicine and constant danger. The question is: how far will you go to make it through another day?\r This War of Mine: The Little Ones focuses not only on the reality of enduring war, but also the fact that even in times of conflict, kids are still kids - they laugh, cry, play with toys and see the world differently. In addition to thinking about survival, you'll have to bring back the kid in yourself to understand how to protect the little ones. Their faith, and their futures, are in your hands.\r The pace of This War of Mine is imposed by the day and night cycle. During the day snipers outside stop you from leaving your refuge, so you need to focus on maintaining your hideout: crafting, trading and taking care of young and adult civilians. At night, take one of your people on a mission to scavenge through a city for items that will help you stay alive.… Expand"}, {"name": "Call of Juarez: Bound in Blood", "details_link": "https://www.metacritic.com/game/playstation-3/call-of-juarez-bound-in-blood", "publisher": "Ubisoft", "release_date": "Jun 30 2009", "developers": ["Techland"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/3adf7bf82c40fa6e1b42a9b7a09139b9-98.jpg", "descriptions": "Call of Juarez: Bound in Blood transports players from a ravaged Civil War-era Georgia to the Aztec ruins of Mexico. In the wildest West ever depicted, players can embody both McCall brothers in an intense storyline full of greed, lust and lawlessness that takes place during a legendaryCall of Juarez: Bound in Blood transports players from a ravaged Civil War-era Georgia to the Aztec ruins of Mexico. In the wildest West ever depicted, players can embody both McCall brothers in an intense storyline full of greed, lust and lawlessness that takes place during a legendary period of American history.  Become a Gunslinger - Harness a variety of weapons from various revolvers to heavy-caliber cannons and machine guns. Every accurate shot increases concentration, which allows players to unleash deadly shooting modes when outnumbered and even deadlier ones when the brothers work together. Dual Collaborative Gameplay - Players choose to embody Ray or Thomas, each with a distinctive gameplay style (close or long range), specific abilities (lasso, dynamite, etc.) and arsenal of deadly weapons (dual guns, long-range carbine, etc.). Take advantage of each of their strengths and join in the fiercest fights imaginable. Never Before Seen Western Experience - Experience the iconic settings full of outlaws - the West before it was tamed. The McCall brothers face a renegade Apache Chief, a greedy Mexican bandit, a vindictive Colonel, and others, all driven by greed with moral disregard. Enjoy a wide variety of situations, using horses, canoes and wagons to explore the vast natural landscapes of the fabled Wild West and its legendary period. Innovative Online Multiplayer - Developed in unison with the single player mode, multiplayer offers numerous modes and maps, resulting in endless hours of Wild West mayhem. Gunslingers, bandits and marshals struggle online for the bounty. Multiple characters are unlocked for team-based objective modes or the straightforward team death match. With a new Bounty system, players increase the bounty on their head with more kills. Get rid of the deadliest among you to increase your bank roll. [Ubisoft]… Expand"}, {"name": "Zuma's Revenge!", "details_link": "https://www.metacritic.com/game/pc/zumas-revenge!", "publisher": "PopCap", "release_date": "Sep 15 2009", "developers": ["PopCap"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/9c3e6ad707da2df58e376afcf1ac4265-98.jpg", "descriptions": "Enter an all-new world of Zuma where evil tiki bosses rule the land! Conquer over 60 levels by firing stone spheres to make matches and destroy the deadly stream of balls, then take on six tiki boss battles and guide your agile amphibian to victory! Leap into action in four game modes withEnter an all-new world of Zuma where evil tiki bosses rule the land! Conquer over 60 levels by firing stone spheres to make matches and destroy the deadly stream of balls, then take on six tiki boss battles and guide your agile amphibian to victory! Leap into action in four game modes with explosive new features and amazing new gameplay: Slide and hop for smarter shots, hit targets for exotic bonuses, and detonate new power-up balls! Will you succumb to the perilous pitfalls, or can you tame the jungle in this PopCap ball-blasting challenge? [PopCap Games]… Expand"}, {"name": "BattleTech", "details_link": "https://www.metacritic.com/game/pc/battletech", "publisher": "Harebrained Schemes LLC", "release_date": "Apr 24 2018", "developers": ["Harebrained Schemes LLC"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/3aa46f30a1c11f8f79b8ffa5937c42ce-98.jpg", "descriptions": "Assume command of your own mercenary outfit of 'Mechs and the MechWarriors that pilot them, struggling to stay afloat as you find yourself drawn into a brutal interstellar civil war."}, {"name": "LEGO Star Wars: The Skywalker Saga", "details_link": "https://www.metacritic.com/game/pc/lego-star-wars-the-skywalker-saga", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  5 2022", "developers": ["TT Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/eaae08a4d0a7fe3567083397641187f2-98.jpg", "descriptions": "LEGO Star Wars: The Skywalker Saga will feature hundreds of playable characters - the most ever for a LEGO Star Wars game - and ships, LEGO's signature sense of humour and fun, and new innovations, options, and gameplay features. Players can start the game at any point in the Star WarsLEGO Star Wars: The Skywalker Saga will feature hundreds of playable characters - the most ever for a LEGO Star Wars game - and ships, LEGO's signature sense of humour and fun, and new innovations, options, and gameplay features. Players can start the game at any point in the Star Wars timeline; fans can jump in with Star Wars: The Phantom Menace, begin the original trilogy with Star Wars: A New Hope, or launch right into Star Wars: The Rise of Skywalker.\r LEGO Star Wars: The Skywalker Saga marks the return to the franchise that kicked off the LEGO video game series. The game will give fans an all-new LEGO Star Wars experience with complete freedom to explore the LEGO Star Wars galaxy. With the Skywalker saga coming to an end, LEGO Star Wars: The Skywalker Saga will bring to life all those Star Wars adventures remembered and undiscovered in an epic culmination of all nine saga films as fans celebrate the closing of this chapter in Star Wars.… Expand"}, {"name": "Xanadu Next", "details_link": "https://www.metacritic.com/game/pc/xanadu-next", "publisher": "XSEED Games", "release_date": "Nov  3 2016", "developers": ["Falcom"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/667f38b04c7e072423d4637515f58df6-98.jpg", "descriptions": "The village chief's daughter, Momo, has been kidnapped and you have been asked to rescue her. Finding her will not be easy. You will have to battle hordes of demons and monsters, even challenging King-Dragon himself! Can you conquer the darkness hanging over the land and return the light ofThe village chief's daughter, Momo, has been kidnapped and you have been asked to rescue her. Finding her will not be easy. You will have to battle hordes of demons and monsters, even challenging King-Dragon himself! Can you conquer the darkness hanging over the land and return the light of the gods to XANADU! You are the only one who can save this world. It's time to plunge into the darkness!… Expand"}, {"name": "Obliteracers", "details_link": "https://www.metacritic.com/game/pc/obliteracers", "publisher": "Space Dust Studios", "release_date": "Feb 23 2016", "developers": ["Space Dust Studios", "Varkian Empire"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/f5f1fdbbc7360365a7d6d7e7239885bf-98.jpg", "descriptions": "Same-screen party racing for up to 16 players. Race brutal-cute aliens on exotic planets, using weapon powerups and physics-based vehicles to annihilate your competition in frantic round-based combat. Connect spare gamepads, laptops and smart devices as extra controllers."}, {"name": "ZEN Pinball 2: Balls of Glory", "details_link": "https://www.metacritic.com/game/playstation-4/zen-pinball-2-balls-of-glory", "publisher": "Zen Studios", "release_date": "Oct 20 2015", "developers": ["Zen Studios"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "Pinball"], "meta_score": 78, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/631df36ee16683cf37d8893e0b7f920e-98.jpg", "descriptions": "Balls of Glory combines four hit animated TV show properties: FAMILY GUY, AMERICAN DAD!, BOB’S BURGERS, and ARCHER, representing one epic pinball experience and features voice talent and sound effects from each hit TV show."}, {"name": "The Denpa Men: They Came By Wave", "details_link": "https://www.metacritic.com/game/3ds/the-denpa-men-they-came-by-wave", "publisher": "Genius Sonority Inc.", "release_date": "Sep 27 2012", "developers": ["Genius Sonority Inc."], "platforms": "3DS", "num_players": "1 Player", "genres": ["Role-Playing", "General", "General"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/9422ebaa7fbd58e6b43946cb0aa80796-98.jpg", "descriptions": "The Denpa Men: They Came By Wave is a role-playing game in which you collect Denpa Men to form a party, and use this party to explore dungeons."}, {"name": "Traxxpad", "details_link": "https://www.metacritic.com/game/psp/traxxpad", "publisher": "Eidos Interactive", "release_date": "Jun 26 2007", "developers": ["Definitive Studios"], "platforms": "PSP", "num_players": "Up to 16 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 78, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/12fe513f111f6de8097624ab7baea3e5-98.jpg", "descriptions": "Traxxpad: Portable Studio turns your PSP into a music studio. The power of a drum machine, sequencer, mixer and sampler is now portable. Produce, record, mix, sequence, share, sample and export your own original music and sounds. Record the sounds around you or choose from over a thousandTraxxpad: Portable Studio turns your PSP into a music studio. The power of a drum machine, sequencer, mixer and sampler is now portable. Produce, record, mix, sequence, share, sample and export your own original music and sounds. Record the sounds around you or choose from over a thousand sounds and kits provided. Export to mp3 and make your own ringtones and CDs. [Eidos Interactive]… Expand"}, {"name": "Olija", "details_link": "https://www.metacritic.com/game/playstation-4/olija", "publisher": "Devolver Digital", "release_date": "Jan 28 2021", "developers": ["Skeleton Crew Studio"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/d7a2c7e72e1772105551734d17d9b90a-98.jpg", "descriptions": "Your PS4, a powerful gate to other worlds, will take you to Terraphage, a wild land filled with new challenges and ancient tales."}, {"name": "Lost in Random", "details_link": "https://www.metacritic.com/game/playstation-5/lost-in-random", "publisher": "Electronic Arts", "release_date": "Sep 10 2021", "developers": ["Electronic Arts", "Zoink"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/f9a855bb4f9815eda7e8afe2b6038e22-98.jpg", "descriptions": "Play the odds in Lost in Random™, a gothic fairytale-inspired action adventure where every citizen’s fate is determined by the roll of a dice. Ruled by a wicked Queen, the kingdom of Random is divided into six shadowy realms where life is dictated by a cursed black dice. In this story, fromPlay the odds in Lost in Random™, a gothic fairytale-inspired action adventure where every citizen’s fate is determined by the roll of a dice. Ruled by a wicked Queen, the kingdom of Random is divided into six shadowy realms where life is dictated by a cursed black dice. In this story, from the award-winning Swedish game studio Zoink and penned by Eisner Award-winning Adventure Time and Marvel Comics The Unbeatable Squirrel Girl author Ryan North, you’ll join Even, a penniless girl who’s down on her luck, in a dark quest to save her beloved sister. With her companion Dicey, a small and strange living dice, Even must learn to embrace the chaos of Random, uncovering an age-old tale with a modern message. Walk Random’s mysterious cobbled streets, meet its unpredictable residents, and take on courageous quests. Engage in fearsome battles with a unique blend of tactical combat, card collection, and explosive dice gameplay. It’s time to adapt or perish, as you battle inside giant board game arenas that change with every dice throw! Learn how to tip the odds in your favor, and dive into a dark wonderland where only the brave survive.… Expand"}, {"name": "Like a Dragon: Ishin!", "details_link": "https://www.metacritic.com/game/xbox-series-x/like-a-dragon-ishin!", "publisher": "Sega", "release_date": "Feb 18 2023", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/09048778f581e2570a40cfe6b13a18b8-98.jpg", "descriptions": "1860s Kyo is plagued by widespread inequality, and one samurai will change the course of history in his search for justice. Take up the sword of Sakamoto Ryoma and venture to Kyoto to find your father’s killer, clear yourself of a framed murder, and restore your honor. In doing so, you will1860s Kyo is plagued by widespread inequality, and one samurai will change the course of history in his search for justice. Take up the sword of Sakamoto Ryoma and venture to Kyoto to find your father’s killer, clear yourself of a framed murder, and restore your honor. In doing so, you will bring an end to the samurai era and forever change the future of Japan. Draw your blade, load your revolver, and join the revolution in this heated historical adventure that only the creators of Yakuza: Like a Dragon could produce. … Expand"}, {"name": "Alien Hominid", "details_link": "https://www.metacritic.com/game/gamecube/alien-hominid", "publisher": "O3 Entertainment", "release_date": "Nov 23 2004", "developers": ["The Behemoth"], "platforms": ["Xbox 360", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/fffb1ba541384d9549f76007f13c9976-98.jpg", "descriptions": "Your UFO has crash landed, and the FBI is out to get you! Time to take them out!"}, {"name": "Othercide", "details_link": "https://www.metacritic.com/game/pc/othercide", "publisher": "Focus Home Interactive", "release_date": "Jul 27 2020", "developers": ["Lightbulb Crew"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/d6a7647c97467748604f0994f03f08da-98.jpg", "descriptions": "Othercide is a horror-themed turn-based strategy game where the lore and game mechanics are tightly intertwined to deliver a twisted, dark and challenging experience. Enter a brutal world under assault from terrifying creatures from another dimension, hold back the tide with limitedOthercide is a horror-themed turn-based strategy game where the lore and game mechanics are tightly intertwined to deliver a twisted, dark and challenging experience. Enter a brutal world under assault from terrifying creatures from another dimension, hold back the tide with limited resources and endure brutal conditions in visually stunning world.\r Experience dynamic turn-based combat and a new way to anticipate enemy movements to perform a flawless tactical plan. Using the Initiative Sequence System and unique set of skills, you will be able to interrupt an enemy attack, plan a delayed action that will be triggered later on in the timeline and use reaction skill to respond to any threat.\r Prepare to suffer and face close calls in our terrifying and ruthless universe. With roguelite features, deadly missions, limited resources and permanent death, there is no room for errors.\r Level up, unlock new skills and collect memories from the death of your enemies. A limited number of these bonuses can be implemented to your skills to boost their stats. But choose wisely as once implemented, you can't take them back, unless... you decide to sacrifice your Daughter!\r Make dramatic choices and endure with your Daughters traumatic experiences which will make them stronger or weaker.\r Othercide invites you in a ethereal monochromatic dimension with only dashes of crimson red where your worst nightmares come to life.… Expand"}]