[{"name": "Warhammer 40,000: Sanctus Reach", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-sanctus-reach", "publisher": "Slitherine", "release_date": "Jan 19 2017", "developers": ["Strayllight Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/5e62069648237d2449dd99e19e6040ab-98.jpg", "descriptions": "Warhammer 40,000: Sanctus Reach is a 3D turn-based strategy game like you’ve never seen before: fast, immediate, deep, impressive to look at and incredibly fun! Fight through a dark era of carnage and endless war and lead the Space Wolves in a struggle to defend the last bastion of mankind."}, {"name": "Livelock", "details_link": "https://www.metacritic.com/game/playstation-4/livelock", "publisher": "Perfect World Entertainment", "release_date": "Aug 30 2016", "developers": ["Tuque Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/e98913a06f06389e4210177f20bb8d95-98.jpg", "descriptions": "Livelock is a cooperative top-down shooter in which you play solo or with up to 2 allies to break the cycle of infinite war between machines. As one of the remaining Capital Intellects, your role is to unlock Eden and revive humanity. [Playstation.com]"}, {"name": "Nightmares from the Deep 2: The Siren's Call", "details_link": "https://www.metacritic.com/game/xbox-one/nightmares-from-the-deep-2-the-sirens-call", "publisher": "Artifex Mundi", "release_date": "Aug 26 2016", "developers": ["Artifex Mundi"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Puzzle", "Hidden Object", "General"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/83d82118f3c2c7c20adfce79fa6e9bf6-98.jpg", "descriptions": "Answer the siren`s call and defeat the cruel Mayor Murray and his pet sea monster, the Kraken."}, {"name": "Deadlight: Director's Cut", "details_link": "https://www.metacritic.com/game/xbox-one/deadlight-directors-cut", "publisher": "Deep Silver", "release_date": "Jun 21 2016", "developers": ["Tequila Works"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/4ad15ae39ed3a25c07e1391b44a01639-98.jpg", "descriptions": "Set in an apocalyptic 1986, you play Randall Wayne, a lone survivor searching for his loved ones in the ruins of Seattle. Through tense platforming and deadly encounters with the undead, known as ‘shadows’, you’ll either fight using scarce resources, or navigate the environment to run andSet in an apocalyptic 1986, you play Randall Wayne, a lone survivor searching for his loved ones in the ruins of Seattle. Through tense platforming and deadly encounters with the undead, known as ‘shadows’, you’ll either fight using scarce resources, or navigate the environment to run and hide from them.… Expand"}, {"name": "Fruit Ninja Kinect 2", "details_link": "https://www.metacritic.com/game/xbox-one/fruit-ninja-kinect-2", "publisher": "Halfbrick Studios", "release_date": "Mar 18 2015", "developers": ["Halfbrick Studios"], "platforms": "Xbox One", "genres": ["General", "Action", "Arcade"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/64549e488b64a34b811187769e3929d7-98.jpg", "descriptions": "Your arms are weapons. Use your body to slice fruit as it flies across the screen. Dodge spotlights, throw shurikens and strike ninja poses."}, {"name": "Gratuitous Tank Battles", "details_link": "https://www.metacritic.com/game/pc/gratuitous-tank-battles", "publisher": "Positech Games", "release_date": "May 17 2012", "developers": ["Positech Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/7eef51c091315a6e706685e8e7c367ec-98.jpg", "descriptions": "Gratuitous Tank Battles is coming to the PC and Mac, developed by Positech Games, makers of Democracy, Kudos and of course Gratuitous Space Battles. Gratuitous Tank Battles is an RTS/Tower Defense hybrid with online elements and customisable units. The player can take the role of theGratuitous Tank Battles is coming to the PC and Mac, developed by Positech Games, makers of Democracy, Kudos and of course Gratuitous Space Battles. Gratuitous Tank Battles is an RTS/Tower Defense hybrid with online elements and customisable units. The player can take the role of the defender or the attacker in a series of top-down explodey battles. A built-in map editor will allow easy sharing of custom maps and defensive challenges with other GTB players in a similar fashion to GSB's challenge system.\r GTB takes place in an alternate reality where the 'central powers' never surrender and the 'great war' continues for two hundred years. Soldiers still fight in the trenches of the Somme, although rifles have (mostly) become laser rifles and giant armored mechs stride across no-mans land. The two great armies continue to fight with patriotic zeal and little memory of who Franz Ferdinand was and what happened to him. One thing is certain: It will all be over by Christmas 2114.\r FEATURES:\r - Play as attacker or defender on any map.\r- Design your own unique units from a huge range of components.\r- Use Turrets, Tanks, Mechs, Infantry and special command units.\r- Integrated map editor to allow trivial sharing of custom maps.\r- Upload your maps and armies as online challenges for other players\r- It will all be over by Christmas.… Expand"}, {"name": "Sherlock Holmes: Chapter One", "details_link": "https://www.metacritic.com/game/playstation-5/sherlock-holmes-chapter-one", "publisher": "Frogwares", "release_date": "Nov 16 2021", "developers": ["Frogwares"], "platforms": ["PC", "PlayStation 4", "Xbox Series X", "PlayStation 5"], "genres": ["Action Adventure", "Adventure", "General", "3D", "Open-World", "First-Person"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/3d8ed9df5b49313d42181f2978574bf5-98.jpg", "descriptions": "In this story-driven detective thriller, a young Sherlock Holmes struggles to prove himself as he navigates an exotic, dangerous island in the Mediterranean to investigate the mystery of his mother’s death."}, {"name": "World Series of Poker: Tournament of Champions", "details_link": "https://www.metacritic.com/game/xbox-360/world-series-of-poker-tournament-of-champions", "publisher": "Activision", "release_date": "Sep 21 2006", "developers": ["Left Field Productions"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/9fd5144e7e03991fa50dc874a3de398d-98.jpg", "descriptions": "World Series of Poker: Tournament of Champions takes a story-based approach putting players on the Pro Circuit as a new pro and protégé of Chris \"Jesus\" Ferguson. Players test their skills at the premier Circuit Events in hopes of qualifying for the winner-take-all, invitation-onlyWorld Series of Poker: Tournament of Champions takes a story-based approach putting players on the Pro Circuit as a new pro and protégé of Chris \"Jesus\" Ferguson. Players test their skills at the premier Circuit Events in hopes of qualifying for the winner-take-all, invitation-only Tournament of Champions at the Rio Resort in Las Vegas.  Along the way, they face-off against more top pros than ever before, including Joseph Hachem, the 2006 World Series of Poker Main Event Champion and Jennifer Tilly, the Academy Award nominated actress and World Series of Poker bracelet holder, among others in hopes of bringing home the Tournament of Champions trophy. [Activision]… Expand"}, {"name": "LEGO The Hobbit", "details_link": "https://www.metacritic.com/game/xbox-one/lego-the-hobbit", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  8 2014", "developers": ["TT Games"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Action Adventure", "General", "Fantasy"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/e692b779fb927ece5d6a657320fb832d-98.jpg", "descriptions": "From the makers of LEGO The Lord of the Rings, comes LEGO The Hobbit, inspired by the first two films in The Hobbit Trilogy: The Hobbit: An Unexpected Journey and The Hobbit: Desolation of Smaug as well as the collection  of LEGO The Hobbit constructions sets.  The interactive game of LEGOFrom the makers of LEGO The Lord of the Rings, comes LEGO The Hobbit, inspired by the first two films in The Hobbit Trilogy: The Hobbit: An Unexpected Journey and The Hobbit: Desolation of Smaug as well as the collection  of LEGO The Hobbit constructions sets.  The interactive game of LEGO The Hobbit allows gamers to play along with their favorite scenes from the films, and follows the Hobbit Bilbo Baggins as he is recruited by the Wizard Gandalf to aid Thorin Oakenshield and his Company of Dwarves. Bilbo leaves the comforts of the Shire on a journey through Middle-earth to help the Dwarves reclaim their lost Kingdom of Erebor within the Lonely Mountain. Along the way, he is introduced to ravenous Trolls, dangerous Orcs and, of course, Gollum and his precious Ring.  Players utilize and combine the Dwarves’ unique abilities to solve a diverse array of Quests.\r… Expand"}, {"name": "Clockwork Aquario", "details_link": "https://www.metacritic.com/game/playstation-4/clockwork-aquario", "publisher": "Strictly Limited Games", "release_date": "Dec 14 2021", "developers": ["Westone Bit Entertainment"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/ef45d1d31bef5ff122be939eb1d72aff-98.jpg", "descriptions": "The side-scrolling action game can either be played alone or with a friend in co-op. Players can choose from three different characters, each of them with her/his individual moveset: Huck Londo, the daring ghost hunter, Elle Moon, the brave adventuress and Gush, the warmhearted giant robot."}, {"name": "R-Type Final 2", "details_link": "https://www.metacritic.com/game/switch/r-type-final-2", "publisher": "NIS America", "release_date": "Apr 30 2021", "developers": ["Granzella Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 69, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/67b3b20fcd2f39e78a99773d4c39c02a-98.jpg", "descriptions": "Wave Cannon attacks by trans-dimensional fighters equipped with firepower equivalent of that of a battleship. This game is thoroughly focused on expressions of how enemies are destroyed. The feeling of exhilaration in the destructions is thoroughly pursued."}, {"name": "Manhunt 2", "details_link": "https://www.metacritic.com/game/psp/manhunt-2", "publisher": "Rockstar Games", "release_date": "Oct 29 2007", "developers": ["Rockstar London"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 69, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/4bfed27c700cd965d9a81641304f042b-98.jpg", "descriptions": "An experiment at a secret research facility has gone catastrophically wrong. Daniel Lamb and Leo Kasper are the only surviving subjects. The Pickman Project will stop at nothing to hunt them down and stop the truth from getting out. Demented screams echo around the dank Dixmor asylum thatAn experiment at a secret research facility has gone catastrophically wrong. Daniel Lamb and Leo Kasper are the only surviving subjects. The Pickman Project will stop at nothing to hunt them down and stop the truth from getting out. Demented screams echo around the dank Dixmor asylum that has caged you for the last six years. You open your eyes. A white-coated body slumps to the floor through your shaking hands. A bloody syringe slips from your arm. Waves of confusion and paranoia crash over you.  You have no idea who you are or how you got here. The door to your cell is open. One choice. One chance. They took your life. Time to take it back. [Rockstar Games]… Expand"}, {"name": "Broken Sword 5: The Serpents' Curse - Part I", "details_link": "https://www.metacritic.com/game/pc/broken-sword-5-the-serpents-curse---part-i", "publisher": "Revolution Software", "release_date": "Dec  4 2013", "developers": ["Revolution Software"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General", "Point-and-Click"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/9bc7c2e86d392746be79c48c79fc4c2b-98.jpg", "descriptions": "George Stobbart and Nico Collard reunite for a new adventure in Broken Sword: The Serpent's Curse."}, {"name": "PQ: Practical Intelligence Quotient", "details_link": "https://www.metacritic.com/game/psp/pq-practical-intelligence-quotient", "publisher": "D3Publisher", "release_date": "Jan 10 2006", "developers": ["Now Production"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/8caba4a8735788bf3916d3671b50e546-98.jpg", "descriptions": "(Also known as \"Intelligent License\")  Based upon psychological research, your PQ score will be determined by how quickly and effectively you solve each life-like situation. Test your wits, bend your brain, and match wits with the minds of users worldwide. A 3D puzzle game that tests players(Also known as \"Intelligent License\")  Based upon psychological research, your PQ score will be determined by how quickly and effectively you solve each life-like situation. Test your wits, bend your brain, and match wits with the minds of users worldwide. A 3D puzzle game that tests players problem solving skills, PQ uses the PSP system's Infrastructure Mode and allows players to post their PQ score on the worldwide ranking site to see how they rank against other players around the world. [D3 Publisher]… Expand"}, {"name": "Section 8", "details_link": "https://www.metacritic.com/game/xbox-360/section-8", "publisher": "SouthPeak Games", "release_date": "Sep  1 2009", "developers": ["TimeGate Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/4859abe3eb0c0d526f9593eb588957ce-98.jpg", "descriptions": "On the war-torn planets of tomorrow, mankind's greatest battle is about to begin. With its frontier colonies devastated by a growing insurrection, Earth dispatches the elite 8th Armored Infantry (nicknamed \"Section 8\") to repel the coming onslaught. The nickname refers to an old UnitedOn the war-torn planets of tomorrow, mankind's greatest battle is about to begin. With its frontier colonies devastated by a growing insurrection, Earth dispatches the elite 8th Armored Infantry (nicknamed \"Section 8\") to repel the coming onslaught. The nickname refers to an old United States military regulation where a soldier would be dismissed from service through being mentally unfit for duty. The near-suicidal missions that this division volunteers for brands them as insane by other military units. Section 8 deploys by 'burning in' from their orbital drop ships tens of thousands of feet above the battlefield, utilizing the most advanced arsenal of military hardware known to man. Their mission: to scout and secure difficult objectives and smash enemy defenses in lightning-quick assaults. An intense first-person shooter, Section 8 allows players to dynamically alter the flow of combat as they see fit. Employing tactical assets and on-demand vehicle deliveries, players are given unprecedented strategic control over epic sci-fi battlefields. [SouthPeak Interactive]… Expand"}, {"name": "NBA Ballers: Rebound", "details_link": "https://www.metacritic.com/game/psp/nba-ballers-rebound", "publisher": "Midway", "release_date": "May  9 2006", "developers": ["Backbone Entertainment"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/f7140454d3d3eaa14bbe330902abf26f-98.jpg", "descriptions": "NBA Ballers: Rebound is the only one-on-one basketball videogame highlighting the rags-to-riches path from an unknown Baller to today’s NBA superstar and is based on the original Midway title, NBA Ballers. [Midway]"}, {"name": "Black & White 2 - Battle of the Gods", "details_link": "https://www.metacritic.com/game/pc/black-white-2---battle-of-the-gods", "publisher": "EA Games", "release_date": "Apr 24 2006", "developers": ["Lionhead Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 69, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/8fc93cf0ae2305dced86c28f8ab70031-98.jpg", "descriptions": "The Battle of the Gods expansion pack for Black & White 2 offers player a host of new challenges in a much darker, more sinister game world. It takes the player back once more to the world of Eden where something strange has started to happen: The Aztecs have not accepted defeat lightly andThe Battle of the Gods expansion pack for Black & White 2 offers player a host of new challenges in a much darker, more sinister game world. It takes the player back once more to the world of Eden where something strange has started to happen: The Aztecs have not accepted defeat lightly and by making a huge number of human sacrifices they have raised their own evil deity, forcing the player to return to Eden to fight it head on. As customary in the Black & White world, the player has the freedom to choose how they will rise to this new challenge by either countering the evil deity’s actions with good deeds or attempting to defeat him with extreme evil. Black & White 2: Battle of the Gods features a brand new creature, two new lands and four new miracles. An all new enemy unit AI system enhances the battle experience but players have to watch out for two new enemy armies and their ultimate weapon: the new enemy creature. There are also six new challenges and other new content for players of the PC game to explore. [Electronic Arts]… Expand"}, {"name": "Fusion: Genesis", "details_link": "https://www.metacritic.com/game/xbox-360/fusion-genesis", "publisher": "Microsoft Game Studios", "release_date": "Nov  9 2011", "developers": ["Starfire Studios"], "platforms": "Xbox 360", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/96aaf91a2acbf94f08d472e64eb5c039-98.jpg", "descriptions": "Unravel a sinister conspiracy in a galaxy on the brink of civil war. Choose your side. Expose the truth. Become a hero. Follow six epic storylines as a trader, mercenary, peacekeeper, soldier, or seeker Explore an \"always connected\" dynamic environment Complete 100s of solo andUnravel a sinister conspiracy in a galaxy on the brink of civil war. Choose your side. Expose the truth. Become a hero. Follow six epic storylines as a trader, mercenary, peacekeeper, soldier, or seeker Explore an \"always connected\" dynamic environment Complete 100s of solo and co-op quests across 23 levels Fly over 100 ships with 1000s of upgrades Acquire 40 combat skills and 200 weapons Enjoy cooperative (1-4) and PvP (1-8) gameplay Connect with Fusion: Sentient on Windows Phone 7… Expand"}, {"name": "Cris Tales", "details_link": "https://www.metacritic.com/game/playstation-5/cris-tales", "publisher": "Modus Games", "release_date": "Jul 20 2021", "developers": ["Dreams Uncorporated"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/fa644c69303e952dfae686aff8a1a990-98.jpg", "descriptions": "Cris Tales is a gorgeous, indie love letter to classic JRPGs with a new perspective. Peer into the past, act in the present, and watch as your choices dynamically change the future -- all on one screen as you play! Join the newly awakened Time Mage Crisbell and her fantastical companions onCris Tales is a gorgeous, indie love letter to classic JRPGs with a new perspective. Peer into the past, act in the present, and watch as your choices dynamically change the future -- all on one screen as you play! Join the newly awakened Time Mage Crisbell and her fantastical companions on their journey across a dark, fairytale world facing a grim future.\r Crisbell must embark across Crystallis and the four Kingdoms in a bid to stop the powerful Time Empress and rewrite the future of the world and all those living in it. Along the way, she'll meet and recruit powerful allies with their own unique stories and skills like Matias the Frog and Willhelm the Child Mage.\r As she explores the world and meets her unique companions, Crisbell will have to make choices with far-reaching consequences for the people she meets consequences that will impact the world you'll experience in real-time throughout your journey. Each companion will be invaluable as you face these choices and the myriad enemies who stand in your way. Will you buffet them with attacks, or discover creative ways to use Crisbell's time powers to alter the reality of each fight? \r\rKey Features\r > A Love Letter to Classic JRPGs\rInspired by timeless JRPGs like Chrono Trigger, Final Fantasy VI, Valkyrie Profile, and modern classics like Bravely Default and Persona 5, meet and recruit a unique cast of teammates, challenge myriad enemies, and make your way through an expansive world.\r > Experience the Past, Present, and Future Simultaneously\rPeer into and learn from the past, decide on actions in the present, and alter the course of the future in ways that will reshape the world dynamically depending on the choices you make.\r > Master Strategic Turn-Based Combat\rWarp your enemies into the past or future, synchronize attacks for enhanced group abilities, and master the timing of attack and defense to go beyond your party's limits in combat.\r > Uncover a Fascinating Story & Characters\rThe Empress' plot to destroy the world is complex and layered. Use your wits and recruit powerful allies throughout the world to uncover and undo her multi-faceted web and make your way to the True Ending of this enchanting tale.\r > Discover a Beautiful World\rClimb aboard an airship or boat and traverse this handcrafted, dark fairytale world. From the shining kingdom of Crystallis to the slums of Vinez, discover each unique location and shape its future.… Expand"}, {"name": "SimCity DS", "details_link": "https://www.metacritic.com/game/ds/simcity-ds", "publisher": "Electronic Arts", "release_date": "Jun 19 2007", "developers": ["Aki Corp."], "platforms": "DS", "num_players": "1-2 ", "genres": ["Strategy", "City Building", "Management", "Modern", "Modern", "Government"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/6688736b453d4a83617ee168a7efb77a-98.jpg", "descriptions": "True to the SimCity series, players can create and control their city in the palm of their hands...and more. Maximizing the stylus and built-in microphone controls of the Nintendo DS, SimCity DS brings to the franchise like never before the feeling of personal involvement with your city -True to the SimCity series, players can create and control their city in the palm of their hands...and more. Maximizing the stylus and built-in microphone controls of the Nintendo DS, SimCity DS brings to the franchise like never before the feeling of personal involvement with your city - from blowing into the microphone to put out fires in the city to signing off on mayoral proclamations with your stylus. By enabling the players to communicate with each other, the \"wireless data exchange\" feature brings additional interactivity into the game. As an added bonus to SimCity fans around the world, the game also offers a wide array of recognizable international landmarks to spice up your city. [Electronic Arts]… Expand"}, {"name": "KINGDOM of the DEAD", "details_link": "https://www.metacritic.com/game/pc/kingdom-of-the-dead", "publisher": "Dirigo Games", "release_date": "Feb 10 2022", "developers": ["Dirigo Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/f5e3a7c7f29a89f7d13a149cacd752b8-98.jpg", "descriptions": "Immerse yourself in a dreadful hand-drawn horror world and push Death’s armies back to the underworld."}, {"name": "The Shattering", "details_link": "https://www.metacritic.com/game/pc/the-shattering", "publisher": "Deck 13", "release_date": "Apr 21 2020", "developers": ["SuperSexySoftware"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/0d72d4d19f5505ad588491cca1769b22-98.jpg", "descriptions": "The Shattering is a first-person, story-driven, psychological thriller. Its defining features are the dynamic environments, beautiful aesthetic and intriguing story. The gameplay is meant to submerge you in the mind of John, as you take each step forward into the twisted mystery of what happened."}, {"name": "Mayan Death Robots", "details_link": "https://www.metacritic.com/game/pc/mayan-death-robots", "publisher": "Sileni Studios", "release_date": "Nov 20 2015", "developers": ["Sileni Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/fe01390d6c12431583d17fcc210fa859-98.jpg", "descriptions": "Mayan Death Robots reinvents the artillery genre in a Mayan setting invaded by alien killing machines. Pick a robot from the roster and enter the arena to destroy your opponent's power core. Aim your weapon before the timer runs out, but don't be distracted by the pretty scenery: when theMayan Death Robots reinvents the artillery genre in a Mayan setting invaded by alien killing machines. Pick a robot from the roster and enter the arena to destroy your opponent's power core. Aim your weapon before the timer runs out, but don't be distracted by the pretty scenery: when the rockets start flying, you already need to plan your next move! Will you choose to move your robot to a better vantage point, or will you build defenses to keep your opponent from landing a killing blow?… Expand"}, {"name": "Tom Clancy's Ghost Recon: Wildlands", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-ghost-recon-wildlands", "publisher": "Ubisoft", "release_date": "Mar  6 2017", "developers": ["Ubisoft Paris"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "genres": ["Action Adventure", "Open-World"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/6e1cd1cee54368df1abc843a347a4346-98.jpg", "descriptions": "Taking place a few years into the future, Ghost Recon Wildlands empowers players to lead a team of Ghosts, a four-player U.S. Elite Special Operations unit, on a covert mission to destroy the Santa Blanca drug cartel, an underworld force and growing global threat within Ubisoft’s imaginingTaking place a few years into the future, Ghost Recon Wildlands empowers players to lead a team of Ghosts, a four-player U.S. Elite Special Operations unit, on a covert mission to destroy the Santa Blanca drug cartel, an underworld force and growing global threat within Ubisoft’s imagining of a beautiful, yet dangerous Bolivia. With hundreds of villages and well-known landmarks, local legends and various factions and regions, players venture into a vast world with which to interact and explore. The Ghosts’ upgradable skills, along with a vast arsenal of weapons, vehicles and drones, help them defeat their almighty enemy. Gamers can play the entire game solo or they join up with as many as three friends in co-op to roam freely in this vast playground. [Ubisoft]… Expand"}, {"name": "Murasaki Baby", "details_link": "https://www.metacritic.com/game/playstation-vita/murasaki-baby", "publisher": "SCEA", "release_date": "Sep 16 2014", "developers": ["Ovosonico"], "platforms": "PlayStation Vita", "genres": ["Action Adventure", "Fantasy", "Action", "Platformer", "2D"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/803a61e5e88c16330bcac0eab2167216-98.jpg", "descriptions": "Murasaki Baby tells the story of a little girl who wakes up in a weird world, populated by children's fantasies and fears. Holding a purple, heart-shaped balloon in her hand, she feels lost, homesick and vulnerable. She wants her mommy."}, {"name": "Vampyr", "details_link": "https://www.metacritic.com/game/switch/vampyr", "publisher": "Focus Home Interactive", "release_date": "Oct 29 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/c9a77227263c816de5e039df7a11f13b-98.jpg", "descriptions": "Set in early 20th century Britain during a bout of the lethal Spanish flu, the streets of London are crippled by disease, violence and fear. In a completely disorganized and ghostly city, those who are either fools, desperate, or unlucky enough to walk the streets lay prey to Britains mostSet in early 20th century Britain during a bout of the lethal Spanish flu, the streets of London are crippled by disease, violence and fear. In a completely disorganized and ghostly city, those who are either fools, desperate, or unlucky enough to walk the streets lay prey to Britains most elusive predators: the Vampires.\r Emerging from the chaos, a tormented figure awakes; as the player it is you who determines how to harness your new powers, by specializing in deadly, versatile RPG skill-trees that change the way you play. As a doctor recently turned into a Vampire, you try to understand your new affliction. Your quest of intuition, discoveries and struggles, will be filled with death and drama, while your attempt to stem the irrepressible thirst that constantly drives you to take human lives.\r As you cling to what remains of your humanity, your decisions will ultimately shape the fate of your hero while searching for answers in the coughing, foggy aftermath of the Spanish Flu.\r FEATURES:\r * Explore a darkly atmospheric early 20th century London.\r * Play a tormented and powerful Vampire learning the rules of your new condition. A man of science, a beast of the night: Your toughest battles will be within yourself.\r * Build your own combat style through a wide range of crafted weapons and powerful Vampire abilities to defeat a large and unique bestiary.\r * Choose your fate: moral choices will shape your story. How human could a Vampire be, when he must feed?… Expand"}, {"name": "Magicka 2", "details_link": "https://www.metacritic.com/game/pc/magicka-2", "publisher": "Paradox Interactive", "release_date": "May 26 2015", "developers": ["Pieces Interactive"], "platforms": ["PlayStation 4", "PC"], "genres": ["Fantasy", "Action Adventure", "General"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/5be1cbba9a6460171c399a6775aadd69-98.jpg", "descriptions": "Magicka 2 brings the spellcasting system, irreverent humor, and relationship-testing friendly fire into an all-new adventure with up to 4-player co-op for the PlayStation 4 and PC."}, {"name": "Magician's Quest: Mysterious Times", "details_link": "https://www.metacritic.com/game/ds/magicians-quest-mysterious-times", "publisher": "Konami", "release_date": "May 11 2009", "developers": ["Konami", "Aquria"], "platforms": "DS", "num_players": "Up to 4 ", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/80d4fabab53bf042643588e2c991dd82-98.jpg", "descriptions": "(Also known as \"Enchanted Folk and the School of Wizardry\" in the UK/EU)  Set in a magic school, the game entails mastering a series of spells and incantations in order to achieve a Magician Licence and become Master Wizard. To this end, the player enrolls in the Magic Academy where(Also known as \"Enchanted Folk and the School of Wizardry\" in the UK/EU)  Set in a magic school, the game entails mastering a series of spells and incantations in order to achieve a Magician Licence and become Master Wizard. To this end, the player enrolls in the Magic Academy where alongside over 150 fully interactive pupils, they must learn and implement key spells and use them wisely. During the course of a term, however, the player is asked to solve a series of puzzles by mysterious beings that appear once a week throughout the game. Doing so will reward the user with extra items for use in their magic, and contribute towards the player's advancement.The other inhabitants of the School are key to the player's progress. They can make friends with anybody in the school and through these friendships learn new spells and abilities, as well as go shopping or take up hobbies, join bands to play music together, and even go on dates. Similarly, the school is rife with gossip related to available mysterious events, romance, stories among the pupils and players can even lend their character to friends in a unique 'Study Abroad' scheme wherein they are imported to a friend's game world for tutoring - and will even discuss their adventures on their return! Different stories and adventures will be revealed depending on what bonds are formed with the game's characters and how the player chooses to solve each of the 52 adventures. With its truly immersive game world and adaptive gameplay - all of which is played in real time courtesy of the DS internal clock - Enchanted Folk and the School of Wizardry is a truly magical experience. Packed with unique items for use in magic, the player faces many long and hard challenges as they strive to attain the coveted five-star rating that will earn the Master Wizard accolade. [Konami Europe]… Expand"}, {"name": "Enchanted Arms", "details_link": "https://www.metacritic.com/game/xbox-360/enchanted-arms", "publisher": "Ubisoft", "release_date": "Aug 29 2006", "developers": ["From Software"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Role-Playing", "Console-style RPG", "General", "Japanese-Style"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/1c4d59fcacf809e85d94d6c0332ddeb6-98.jpg", "descriptions": "(Known is Japan as \"[eM] -eNCHANT arM-\")  In Enchanted Arms, players embark on an epic adventure filled with unique characters and more than 75 special controllable creatures that players can unlock as they progress. Players take on the role of Atsuma, an Enchanter-in-training who will(Known is Japan as \"[eM] -eNCHANT arM-\")  In Enchanted Arms, players embark on an epic adventure filled with unique characters and more than 75 special controllable creatures that players can unlock as they progress. Players take on the role of Atsuma, an Enchanter-in-training who will transform from a naïve student to the most powerful savior in a war 1,000 years in the making. As the story develops, players face increasingly difficult challenges and learn to master Atsuma's special fighting and magical abilities. [Ubisoft]… Expand"}, {"name": "Scars Above", "details_link": "https://www.metacritic.com/game/xbox-series-x/scars-above", "publisher": "Deep Silver", "release_date": "Feb 28 2023", "developers": ["Mad Head Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/e3defb9ca4ab25586c717615e1580189-98.jpg", "descriptions": "Something strange has entered Earth's orbit; an object alien and unknowable, made out of matter that seems not to obey the laws of physics - the Metahedron. As a part of a hastily gathered group of astronauts and scientists sent off to explore it, your fate takes a jarring turn as you awakenSomething strange has entered Earth's orbit; an object alien and unknowable, made out of matter that seems not to obey the laws of physics - the Metahedron. As a part of a hastily gathered group of astronauts and scientists sent off to explore it, your fate takes a jarring turn as you awaken in another world - dazed, alone on an alien planet... but determined to stay alive.  Scars Above is a challenging, immersive third-person shooter inspired by modern type action-adventure games. It takes the genre staples, such as the rewarding feeling of overcoming difficulty, and combines it with a compelling and intricate story, meticulous and lavish world design, and a living, breathing ecosystem to explore and endure.\r This is a game of mystery and discovery.… Expand"}, {"name": "Aeterna Noctis", "details_link": "https://www.metacritic.com/game/playstation-5/aeterna-noctis", "publisher": "SIE Spain", "release_date": "Dec 15 2021", "developers": ["Aeternum Game Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Metroidvania"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/e63e47fbc3e579346062c7ef36dd25d5-98.jpg", "descriptions": "Aeterna Noctis is a challenging 2D Metroidvania drawn by hand, with intense combats and skill-based platform sections. Taking the role of the 'King of Darkness' you must help him regain his power across 16 different and connected areas in an epic journey with environmental storytelling."}, {"name": "Fatal Frame: Maiden of Black Water", "details_link": "https://www.metacritic.com/game/pc/fatal-frame-maiden-of-black-water", "publisher": "Koei Tecmo Games", "release_date": "Oct 27 2021", "developers": ["Koei Tecmo Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Wii U", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/7b052f32f60ca3b8daf67027e23aa362-98.jpg", "descriptions": "The Fatal Frame series lives again!\r Fatal Frame: Maiden of Black Water is comprised of three interconnected stories that converge to uncover the truth behind a recent string of tragic deaths in a forest marred by a history of suicides. As one of three people with the power of the CameraThe Fatal Frame series lives again!\r Fatal Frame: Maiden of Black Water is comprised of three interconnected stories that converge to uncover the truth behind a recent string of tragic deaths in a forest marred by a history of suicides. As one of three people with the power of the Camera Obscura and the ability to see the shadows of those spirited away, youll explore the ruins of an eerie inn, a shrine filled with life-size dolls, and a lake full of dead priestesses. Each shadowy location is connected by a stream of water flowing throughout the mountain, and this once holy water is tied to the darkest mystery of allthe history of death and darkness on Mt. Hikami.\r Features:\r *    Survive this horrifying new entry in the Fatal Frame series\r*    Explore sinister locales like an underground cave for human sacrifices and a shrine for life-sized dolls\r*    Use the Wii U GamePad controller as your Camera Obscurayour only defense against fatal ghosts\r*    Mt. Hikami is coursing with inexplicably dangerous water; stay dry or die\r*    Investigate and stay alive on the deadly Mt. Hikami… Expand"}, {"name": "Banner of the Maid", "details_link": "https://www.metacritic.com/game/pc/banner-of-the-maid", "publisher": "CE-Asia", "release_date": "May 27 2019", "developers": ["CE-Asia"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/06bb957dcc62bce60d76d0e59b19396a-98.jpg", "descriptions": "Banner of the Maid is a turn-base strategy game set in the time of the French Revolution. You will lead the army to break through the difficulties and experience the different stories of that most uncommon time with wine of salon and the smoke of battlefield."}, {"name": "The Liar Princess and the Blind Prince", "details_link": "https://www.metacritic.com/game/playstation-4/the-liar-princess-and-the-blind-prince", "publisher": "NIS America", "release_date": "Feb 12 2019", "developers": ["Nippon Ichi Software"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/9a26e8acc87f7ecd9185ca3fd04f82bf-98.jpg", "descriptions": "Unleash Your Inner Monster - Transform at will from a princess into a wolf to guide the blind prince towards a cure. Weave through the dangerous forest, but be careful... A blind prince has no place in an all-seeing forest. Brute Strength Meets Sharp Wit - Various obstacles will require theUnleash Your Inner Monster - Transform at will from a princess into a wolf to guide the blind prince towards a cure. Weave through the dangerous forest, but be careful... A blind prince has no place in an all-seeing forest. Brute Strength Meets Sharp Wit - Various obstacles will require the wolf's strength, and others will require the princess's wit. With so many traps and perilous hurdles that await, can the two make it safely to their final destination? … Expand"}, {"name": "The Sun and Moon", "details_link": "https://www.metacritic.com/game/xbox-one/the-sun-and-moon", "publisher": "Digerati Distribution", "release_date": "Jan 27 2017", "developers": ["Digerati Distribution"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/c4130a6deb254f3b784ce628930536df-98.jpg", "descriptions": "The Sun and Moon, the winner of Ludum Dare 29, is a platformer with a unique mechanic: you can dive into the ground. Momentum is conserved but gravity is reversed, letting you fling yourself high into the air or deep beneath the surface."}, {"name": "Pokemon Sword / Shield: The Isle of Armor", "details_link": "https://www.metacritic.com/game/switch/pokemon-sword-shield-the-isle-of-armor", "publisher": "Nintendo", "release_date": "Jun 17 2020", "developers": ["Game Freak"], "platforms": "Switch", "genres": ["Role-Playing", "Trainer"], "meta_score": 69, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/1665f8c52dc0e220840c6d99b0b216e6-98.jpg", "descriptions": "THE ISLE OF ARMOR - In The Isle of Armor expansion, you'll head to The Isle of Armor, the stage of your new adventure in the Galar region. The Isle of Armor is a giant island full of environments not seen in Galar beforeyou'll find wave-swept beaches, forests, bogs, caves, and sandTHE ISLE OF ARMOR - In The Isle of Armor expansion, you'll head to The Isle of Armor, the stage of your new adventure in the Galar region. The Isle of Armor is a giant island full of environments not seen in Galar beforeyou'll find wave-swept beaches, forests, bogs, caves, and sand dunes!,There are also plenty of Pokémon that make this island their home, living freely amid the lush natural surroundings.,There's even a dojo here that specializes in some very particular training styles! You and your Pokémon will take up an apprenticeship under the master of this dojo and train hard to become even stronger.… Expand"}, {"name": "Guitar Hero Encore: Rocks the 80s", "details_link": "https://www.metacritic.com/game/playstation-2/guitar-hero-encore-rocks-the-80s", "publisher": "Activision", "release_date": "Jul 24 2007", "developers": ["Harmonix Music Systems"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/0d1711527d0e5575f67c64c5516b3e96-98.jpg", "descriptions": "Fans can once again whip out their Gibson-shaped SG guitar controllers and shred to their favorite rock tracks. PS2-exclusive Guitar Hero: Rocks the 80s features retro rock venues and hipster characters, unlockable guitars, intense game play modes, and most importantly 30 awesome new songsFans can once again whip out their Gibson-shaped SG guitar controllers and shred to their favorite rock tracks. PS2-exclusive Guitar Hero: Rocks the 80s features retro rock venues and hipster characters, unlockable guitars, intense game play modes, and most importantly 30 awesome new songs to experience the ultimate rock star fantasy. The list of finger-melting tracks includes: I Wanna Rock (by Twisted Sister), I Ran (by Flock of Seagulls), Round and Round (by Ratt), I Want Candy (by Bow Wow Wow), Metal Health (by Quiet Riot) Holy Diver (by Ronnie James Dio) and Heat Of The Moment (by Asia). [Activision]… Expand"}, {"name": "Asterix & Obelix: Slap Them All!", "details_link": "https://www.metacritic.com/game/playstation-4/asterix-obelix-slap-them-all!", "publisher": "Microids", "release_date": "Dec  2 2021", "developers": ["Mr.  Nutz Studio"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Beat-'Em-Up", "2D", "3D"], "meta_score": 69, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/e421cbf2ac122bdb9016f32763f69ffa-98.jpg", "descriptions": "Asterix & Obelix are back in a brand-new adventure full of slaps! Play as Asterix and Obelix and enjoy the most iconic landscapes of the saga while battling a hundreds of enemies in a Beat Them Up game filled with action… And lots of slaps!"}, {"name": "Star Ocean: The Divine Force", "details_link": "https://www.metacritic.com/game/playstation-5/star-ocean-the-divine-force", "publisher": "Square Enix", "release_date": "Oct 27 2022", "developers": ["Tri-Ace"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/f15421ef6e7e7a56b5eb104da572f0b5-98.jpg", "descriptions": "STAR OCEAN THE DIVINE FORCE features an original story with two individual narratives and many playable characters, a unique combat system, and the freedom to soar in the skies and explore planets. Featuring a blend of sci-fi and fantasy, this fresh Action RPG has challenging yet thrillingSTAR OCEAN THE DIVINE FORCE features an original story with two individual narratives and many playable characters, a unique combat system, and the freedom to soar in the skies and explore planets. Featuring a blend of sci-fi and fantasy, this fresh Action RPG has challenging yet thrilling battle experiences, with high-speed movement in 360-degree!\r Meet Raymond as he crashes onto an unfamiliar planet from his spaceship and is immediately attacked by some unfriendly local wildlife. Coming to his rescue is Laeticia, the crown princess of the Kingdom of Aucerius.\r Together, those two protagonists will challenge the fate of the Kingdom and their choices will have repercussions all over the galaxies...… Expand"}, {"name": "Super Dragon Ball Heroes: World Mission", "details_link": "https://www.metacritic.com/game/switch/super-dragon-ball-heroes-world-mission", "publisher": "Bandai Namco Games", "release_date": "Apr  5 2019", "developers": ["Dimps Corporation", "Safari Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/a46dcbbad4571d4b49fa49404b4e6456-98.jpg", "descriptions": "It's a strategic card battle game featuring characters from across the entire DRAGON BALL series. Collect cards & build your deck as you play through an all-new DRAGON BALL story."}, {"name": "Rebel Cops", "details_link": "https://www.metacritic.com/game/pc/rebel-cops", "publisher": "THQ Nordic", "release_date": "Sep 17 2019", "developers": ["Weappy Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/4a8ffdb796147d59903da9b4071c8228-98.jpg", "descriptions": "Lead a rag-tag squad of cops in rebellion against their town’s new criminal power, and see how long you can hold out in this unforgiving turn-based spin-off game from This Is the Police. You’ll be desperately short on supplies, and a single shot can cost a cop his life."}, {"name": "Harry Potter and the Prisoner of Azkaban", "details_link": "https://www.metacritic.com/game/game-boy-advance/harry-potter-and-the-prisoner-of-azkaban", "publisher": "EA Games", "release_date": "May 25 2004", "developers": ["Griptonite Games"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 69, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/6e972711675a9265d15a9b9876bf731b-98.jpg", "descriptions": "The Dementors are coming, and this time Harry needs his friends. From the opening scene on the Hogwarts Express to the climatic finale on the shore of the great lake at Hogwarts, Harry Potter and the Prisoner of Azkaban immerses you in the world of Harry Potter. As Harry, Ron, and Hermione,The Dementors are coming, and this time Harry needs his friends. From the opening scene on the Hogwarts Express to the climatic finale on the shore of the great lake at Hogwarts, Harry Potter and the Prisoner of Azkaban immerses you in the world of Harry Potter. As Harry, Ron, and Hermione, you'll face the dreaded Azkaban guards, fly the Hippogriff around towers, and explore Hogwarts with the Marauder's Map. Learn spells that allow you to freeze creatures, control dragons, and conjure a Patronus. New two-player minigames include Flying Seahorse Fishing and Dueling Club minigames.… Expand"}, {"name": "Gladiator: Sword of Vengeance", "details_link": "https://www.metacritic.com/game/pc/gladiator-sword-of-vengeance", "publisher": "Acclaim", "release_date": "Nov 18 2003", "developers": ["Acclaim", "Acclaim Studios Manchester"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "Beat-'Em-Up", "Linear", "2D"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/3eb181d9ae040f7c8aba309126312a6d-98.jpg", "descriptions": "A Warrior Slave... Chosen by the Gods... To restore the glory of an Empire. In the Year 106AD the Roman Empire is in terrible decline. After the untimely death of the much-liked Emperor Trajan, the despotic Emperor Arruntius has bled the once powerful Rome to its knees. Badly fought wars,A Warrior Slave... Chosen by the Gods... To restore the glory of an Empire. In the Year 106AD the Roman Empire is in terrible decline. After the untimely death of the much-liked Emperor Trajan, the despotic Emperor Arruntius has bled the once powerful Rome to its knees. Badly fought wars, famine and plague are rife in all corners of the Empire, whilst the Emperor and his elite enjoy every excess and vice that the emptying coffers can afford. As herald to this age of degradation, Arruntius has destroyed large portions of the city of Rome to create the battleground for the bloodiest gladiator event ever staged... [Acclaim]… Expand"}, {"name": "Ty the Tasmanian Tiger", "details_link": "https://www.metacritic.com/game/gamecube/ty-the-tasmanian-tiger", "publisher": "Electronic Arts", "release_date": "Sep 10 2002", "developers": ["Krome Studios"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/5d331783001df1da728b213be39c6483-98.jpg", "descriptions": "Meet TY, a fearless Tasmanian tiger in the wild and untamed Australian wilderness. Skilled in the art of boomerang combat, TY not only survives the dangerous Australian Outback, he runs, jumps, swims, and glides through it. As TY, you'll encounter more than 50 wild characters based onMeet TY, a fearless Tasmanian tiger in the wild and untamed Australian wilderness. Skilled in the art of boomerang combat, TY not only survives the dangerous Australian Outback, he runs, jumps, swims, and glides through it. As TY, you'll encounter more than 50 wild characters based on real-life indigenous animals of Australia. Not all of them are nice--so give your enemies a taste of eight different boomerangs. When you're not busy in combat, you'll solve puzzles, collect items, and participate in races.… Expand"}, {"name": "Motocross Maniacs Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/motocross-maniacs-advance", "publisher": "Konami", "release_date": "Mar 21 2002", "developers": ["Konami"], "platforms": "Game Boy Advance", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/8f4c08ea66d570d75bde42bd9e1b09a6-98.jpg", "descriptions": "Motocross Maniacs Advance offers just as much depth as the competition and is definitely worth taking a look at."}, {"name": "4x4 EVO 2", "details_link": "https://www.metacritic.com/game/pc/4x4-evo-2", "publisher": "Gathering", "release_date": "Oct 30 2001", "developers": ["Terminal Reality"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/328d480a7559da63cd071e647b290c97-98.jpg", "descriptions": "Simmers will have a chance to purchase one of 70 vehicles from 10 different manufactures for use in intense, pedal-to-the-metal, off-road rallies. In addition to individual racing, 4x4 EVO 2 gives virtual drivers the chance to join a factory race team or 4x4 club to participate in anSimmers will have a chance to purchase one of 70 vehicles from 10 different manufactures for use in intense, pedal-to-the-metal, off-road rallies. In addition to individual racing, 4x4 EVO 2 gives virtual drivers the chance to join a factory race team or 4x4 club to participate in an assortment of exciting missions that involve exploration and adventure. [Gathering of Developers]… Expand"}, {"name": "Prehistorik Man", "details_link": "https://www.metacritic.com/game/game-boy-advance/prehistorik-man", "publisher": "Titus Software", "release_date": "Oct 16 2001", "developers": ["Titus Software"], "platforms": ["iPhone/iPad", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/aaf16894585afc6a6bd56499c2bd7a4f-98.jpg", "descriptions": "At best, Prehistorik Man is a weekend diversion from the GBA's more substantial fare."}, {"name": "NASCAR Thunder 2002", "details_link": "https://www.metacritic.com/game/playstation/nascar-thunder-2002", "publisher": "EA Sports", "release_date": "Oct  2 2001", "developers": ["Black Box"], "platforms": ["PlayStation 2", "PlayStation"], "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/36369a17b5d3582e2ca2a645015f78d6-98.jpg", "descriptions": "A number of unfortunate gameplay adjustments overshadow the few welcome additions found in this year's release."}, {"name": "Destruction Derby Raw", "details_link": "https://www.metacritic.com/game/playstation/destruction-derby-raw", "publisher": "Midway", "release_date": "Sep 26 2000", "developers": ["Studio 33"], "platforms": "PlayStation", "genres": ["Driving", "Demolition Derby"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/e5cc558ea16a6a6dd679fd83008e4fb8-98.jpg", "descriptions": "Destruction Derby stands alone as the premier demolition racing series on the PlayStation."}, {"name": "D2", "details_link": "https://www.metacritic.com/game/dreamcast/d2", "publisher": "Sega", "release_date": "Aug 22 2000", "developers": ["WARP"], "platforms": "Dreamcast", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/4a71bcefb71cf00adca61203ff5024f5-98.jpg", "descriptions": "This terror-shrouded adventure takes you to a remote northern region of the Canadian mountains. Left stranded in a vast snowy landscape after a meteor strikes her airplane, Laura finds herself in a cabin with a mysterious woman named Kimberly. Outside, horrifying creatures of alien originThis terror-shrouded adventure takes you to a remote northern region of the Canadian mountains. Left stranded in a vast snowy landscape after a meteor strikes her airplane, Laura finds herself in a cabin with a mysterious woman named Kimberly. Outside, horrifying creatures of alien origin roam the area as the two are left to fend for themselves.… Expand"}, {"name": "Earth Defense Force 2017", "details_link": "https://www.metacritic.com/game/xbox-360/earth-defense-force-2017", "publisher": "D3Publisher", "release_date": "Mar 20 2007", "developers": ["Sandlot"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/aa2b6d5bfa91b4682297b635de73d2b7-98.jpg", "descriptions": "(Also known as \"Earth Defense Force X\" and \"Earth Defense Forces 3\" [JPN] )  This arcade-style third-person shooter equips players with an extensive arsenal of diverse weapons, pilotable vehicles and loyal teammates in order to defeat a wide variety of attackers ranging from gigantic ants(Also known as \"Earth Defense Force X\" and \"Earth Defense Forces 3\" [JPN] )  This arcade-style third-person shooter equips players with an extensive arsenal of diverse weapons, pilotable vehicles and loyal teammates in order to defeat a wide variety of attackers ranging from gigantic ants and spiders to robots and monsters standing more than 20 stories tall. Earth Defense Force 2017 lands players on the front lines of an onslaught of extraterrestrial invaders, with non-stop swarms of hundreds of enemies on screen at once.   Gamers aren’t alone.  Not only do they have more than 150 weapon variations to choose from - including assault rifles, rocket launchers and flamethrowers - but they have the support of AI-controlled Earth Defense Force teammates who battle beside them throughout the game.  Players can also join forces with live teammates in co-op mode and battle together.  Fighting within a wholly destructible environment where bridges, skyscrapers and other structures can just as easily be destroyed by friend or foe, players can either save their world or demolish it in the process.  With more than 50 missions to complete and a seemingly endless barrage of attackers, the Earth Defense Force has their work cut out for them. [D3 Publisher of America]… Expand"}, {"name": ".hack//G.U. vol. 1//Rebirth", "details_link": "https://www.metacritic.com/game/playstation-2/hackgu-vol-1rebirth", "publisher": "Namco Bandai Games America", "release_date": "Oct 24 2006", "developers": ["CyberConnect2"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/dcf27b6819dfb6d1ea1c70bb55add3d8-98.jpg", "descriptions": "Years after the events of the first .hack installment, the most popular MMORPG in the world has returned from the ashes as \"The World: R2\". As Haseo the Terror of Death, players are thrown into his quest for revenge in his search for the mysterious PK (Player Killer) Tri-Edge. This time,Years after the events of the first .hack installment, the most popular MMORPG in the world has returned from the ashes as \"The World: R2\". As Haseo the Terror of Death, players are thrown into his quest for revenge in his search for the mysterious PK (Player Killer) Tri-Edge. This time, players will interact in the real and virtual worlds with fellow \"The World\" players through various chats, mails, and fully voiced video news clips. Together with Haseo’s virtual partners, login to challenge and solve the mysteries of \"The World\". [Namco Bandai]… Expand"}, {"name": "Under Siege", "details_link": "https://www.metacritic.com/game/playstation-3/under-siege", "publisher": "Seed Studios, Lda", "release_date": "Jun  2 2011", "developers": ["Seed Studios", "Lda"], "platforms": "PlayStation 3", "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/c53648f2629f59c96ff0a0cb54fb8a1f-98.jpg", "descriptions": "Under Siege is a Real Time Strategy game developed exclusively for Playstation 3, it supports DualShock 3 and the new PlayStation Move Motion Controller."}, {"name": "Star Wars: Battlefront II", "details_link": "https://www.metacritic.com/game/psp/star-wars-battlefront-ii", "publisher": "LucasArts", "release_date": "Oct 31 2005", "developers": ["Pandemic Studios", "Savage Entertainment"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "4  Online", "genres": ["Shooter", "Sci-Fi", "Sci-Fi", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/bab43721883d4fdbcbdd39d92fe39546-98.jpg", "descriptions": "Star Wars Battlefront II improves upon the original game's single-player experience with open-ended, mission-based objectives inspired from all six Star Wars films. The compelling storyline spans more than 12 new locations, many from Episode III, including volcanic Mustafar and the spaceStar Wars Battlefront II improves upon the original game's single-player experience with open-ended, mission-based objectives inspired from all six Star Wars films. The compelling storyline spans more than 12 new locations, many from Episode III, including volcanic Mustafar and the space battle above Coruscant. All-new classic movie moments complete the Star Wars Battlefront II experience, as players battle within the interior of the Death Star and visit Princess Leia’s blockade runner, the Tantive IV, as seen at the beginning of Episode IV A New Hope. In addition, at certain key moments within the battles, players can feel the Force as a Jedi. For the first time ever, Star Wars Battlefront II players can engage in space combat and, during the same battle, board enemy ships to attack from within. Starting on foot inside a capital ship, players can enter the spacecraft of their choice and travel into space to dogfight with the rival faction. From there, they can dock within the enemy’s capital ship, overtake the ship’s command posts, man its turrets to disable its shields and destroy it from within! Or, they can simply stay inside their own capital ship and defend it from attacks and enemy fire. The choice is theirs. The stellar online play that marked the original Star Wars Battlefront returns even bigger and better for Star Wars Battlefront II. [LucasArts]… Expand"}, {"name": "Sword of the Stars: The Pit", "details_link": "https://www.metacritic.com/game/pc/sword-of-the-stars-the-pit", "publisher": "Kerberos Productions", "release_date": "Feb 22 2013", "developers": ["Kerberos Productions"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG", "Roguelike"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/bafee60eb08f6edcc8b98f47430b5c1d-98.jpg", "descriptions": "Sword of the Stars: The Pit is a fun, fast, light-hearted action RPG, made in the tradition of Rogue and other old school dungeon-diving games. Set in the popular Sword of the Stars universe, it delivers a rich backdrop and modern gameplay."}, {"name": "One Piece: Grand Battle", "details_link": "https://www.metacritic.com/game/playstation-2/one-piece-grand-battle", "publisher": "Bandai", "release_date": "Sep  7 2005", "developers": ["Ganbarion"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 69, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/17fceac36a849c2872b9547cf0e6e6d5-98.jpg", "descriptions": "Ahoy there mi hearties! In a world of pirates, one man wants to become the greatest of them all: Monkey D. Luffy. Join Luffy as he sets out to sea in a rowboat, in search of \"One Piece,\" the greatest treasure in the world. 16 playable pirates with 32 additional support characters from the TVAhoy there mi hearties! In a world of pirates, one man wants to become the greatest of them all: Monkey D. Luffy. Join Luffy as he sets out to sea in a rowboat, in search of \"One Piece,\" the greatest treasure in the world. 16 playable pirates with 32 additional support characters from the TV show. 6 game play modes including Grand Battle and 2 player Versus Mode. Interactive 3D environments: pick up objects and use them to attack your opponent. 7 environments in which to battle your opponents, all faithfully recreated from the TV series. Each character has more than 20 regular moves, as well as special attacks and ultimate attacks. Unlock hidden features such as additional characters, costumes, items and mini-games. Collect items and gimmicks to power up or increase your skills. [Bandai]… Expand"}, {"name": "Driver: Parallel Lines", "details_link": "https://www.metacritic.com/game/xbox/driver-parallel-lines", "publisher": "Atari", "release_date": "Mar 14 2006", "developers": ["Reflections Interactive"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 69, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/1434c6c5ee64f4302685bdd6ce75c7a8-98.jpg", "descriptions": "Driver: Parallel Lines is the fourth installment in the cinematic driver-for-hire series from Atari. You can play as an 18-year-old who is the most sought after driver in New York. The twist-filled storyline leads you through 40 missions and 80 drivable vehicles. Driver: Parallel LinesDriver: Parallel Lines is the fourth installment in the cinematic driver-for-hire series from Atari. You can play as an 18-year-old who is the most sought after driver in New York. The twist-filled storyline leads you through 40 missions and 80 drivable vehicles. Driver: Parallel Lines features more realistic damage modeling and improved city detail than its predecessors. You can go online and play against up to seven other players in a variety of multiplayer modes.… Expand"}, {"name": "Deception IV: The Nightmare Princess", "details_link": "https://www.metacritic.com/game/playstation-4/deception-iv-the-nightmare-princess", "publisher": "Koei Tecmo Games", "release_date": "Jul 14 2015", "developers": ["Koei Tecmo Games"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Strategy", "General"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/0c7858ac949617a07b390fadb029ada1-98.jpg", "descriptions": "Deception 4: The Nightmare Princess is the successor to Deception IV: Blood Ties, which revolved around Laegrinna, a deceitful fragment of the Devil’s soul who chose between Sadistic Torment, Elaborate Death, or Humiliating Demise to defeat her foes through trickery. In this new installment,Deception 4: The Nightmare Princess is the successor to Deception IV: Blood Ties, which revolved around Laegrinna, a deceitful fragment of the Devil’s soul who chose between Sadistic Torment, Elaborate Death, or Humiliating Demise to defeat her foes through trickery. In this new installment, players not only relive Laegrinna’s entire pursuit to free her father, the Devil, from his eternal prison, but they also get introduced to an entirely new, wickedly sadistic, and infernally mischievous character: Velguirie.… Expand"}, {"name": "Need for Speed: The Run", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-the-run", "publisher": "Electronic Arts", "release_date": "Nov 15 2011", "developers": ["Black Box", "EA Black Box"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/58fe1b60a4d408e55fcb679076800a47-98.jpg", "descriptions": "Need for Speed The Run lures players into an underground world of illicit, high-stakes racing. The heat is on – and it isn’t just the fuzz who are after you. Entering the race is just the beginning as you blow across borders, weave through dense urban traffic, rocket down icy mountain passesNeed for Speed The Run lures players into an underground world of illicit, high-stakes racing. The heat is on – and it isn’t just the fuzz who are after you. Entering the race is just the beginning as you blow across borders, weave through dense urban traffic, rocket down icy mountain passes and navigate narrow canyons at breakneck speeds. Powered by DICE’s state-of-the-art Frostbite 2 engine, Need for Speed The Run takes the action racing genre to new heights with stunning visuals and car physics that hug the road even at top speeds all built around a gripping storyline. The cars are hot, the racing is intense and the story will have you at the edge of your seat… all the way from the Golden Gate Bridge to the Empire State building.… Expand"}, {"name": "Crysis Remastered", "details_link": "https://www.metacritic.com/game/pc/crysis-remastered", "publisher": "Crytek", "release_date": "Sep 18 2020", "developers": ["Saber Interactive"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/1/1678c2c252d191206f8c50c91e7f967f-98.jpg", "descriptions": "The classic first person shooter from Crytek is back with the action-packed gameplay, sandbox world, and thrilling epic battles you loved the first time around.  What begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a North Korean islandThe classic first person shooter from Crytek is back with the action-packed gameplay, sandbox world, and thrilling epic battles you loved the first time around.  What begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a North Korean island chain. Armed with a powerful Nanosuit, players can become invisible to stalk enemy patrols, or boost strength to lay waste to vehicles. The Nanosuit's speed, strength, armor, and cloaking allow creative solutions for every kind of fight, while a huge arsenal of modular weaponry provides unprecedented control over play style. In the ever-changing environment, adapt tactics and gear to dominate your enemies, in an enormous sandbox world. \r\rSuit up: Your Nanosuit's speed, strength, armor, and cloaking allow creative solutions for every kind of fight.\r Adapt: In an ever-changing environment, adapt your tactics to dominate on battlefields ranging from frozen jungle to alien environments.\r Customize: A huge arsenal of modular weaponry provides unprecedented control over play style, with options ranging from the experimental to the alien.\r Conquer: Life-like enemy AI require a strategic and flexible playstyle, as new challenges including a zero-g battlefield require players to take the offensive and be proactive.\r Explore: Choose your own path through the open world of Crysis, destroying obstacles, driving vehicles, and using the environment itself against your enemies.… Expand"}, {"name": "Guns, Gore & Cannoli", "details_link": "https://www.metacritic.com/game/xbox-one/guns-gore-cannoli", "publisher": "Crazy Monkey Studios", "release_date": "Sep 25 2015", "developers": ["Claeys Brothers Arts"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "Shooter", "Third-Person", "2D", "Modern", "Arcade"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/6aed7c3485ec3b3d16396d1d2ebab350-98.jpg", "descriptions": "Guns, Gore & Cannoli is a Tarantino-esque homage to the exploitation/grindhouse films from the 70ies, the gangster classics, and the old school 2D arcade shooters."}, {"name": "Hyperdimension Neptunia Re;Birth1", "details_link": "https://www.metacritic.com/game/playstation-vita/hyperdimension-neptunia-rebirth1", "publisher": "Idea Factory", "release_date": "Aug 26 2014", "developers": ["Felistella"], "platforms": ["PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/b864fbddbcd562b36d63deb7bba2e13b-98.jpg", "descriptions": "Gamindustri: One of many parallel universes protected by four goddesses known as CPUs. Long ago, these four CPUs engaged in a war for supremacy known as the War of the Guardians. However, this war weakened their protective hold on the world inhabited by their people, and in turn it wasGamindustri: One of many parallel universes protected by four goddesses known as CPUs. Long ago, these four CPUs engaged in a war for supremacy known as the War of the Guardians. However, this war weakened their protective hold on the world inhabited by their people, and in turn it was flooded by monsters under the influence of an individual known as Arfoire. During the War of the Guardians, one of the CPUs—Neptune—was defeated by the others and hurled down to the world’s surface from the heavens. The drop caused Neptune to lose her memories, as learned by Compa and IF, who happen upon the fallen girl. A mysterious book containing knowledge of all Gamindustri’s history suddenly speaks out to Neptune, Compa, and IF. With the assistance of this sentient book, the trio embark on an extraordinary journey across four different nations on a quest to save the entire world.… Expand"}, {"name": "Trouble Witches Neo!", "details_link": "https://www.metacritic.com/game/xbox-360/trouble-witches-neo!", "publisher": "SNK Playmore", "release_date": "Apr 27 2011", "developers": ["Adventure Planning Service"], "platforms": "Xbox 360", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/ea8f5e1ecd5cb1a5301627ef0fb77506-98.jpg", "descriptions": "Discover  TROUBLE WITCHES NEO , horizontal shooting in which cute and comical little witches roam the skies of Xbox LIVE! Sakurako, a traditional Japanese young witch, joins the cast of the Arcade version! The \"Story Mode\" offers a full voice dubbing in English and in Japanese toDiscover  TROUBLE WITCHES NEO , horizontal shooting in which cute and comical little witches roam the skies of Xbox LIVE! Sakurako, a traditional Japanese young witch, joins the cast of the Arcade version! The \"Story Mode\" offers a full voice dubbing in English and in Japanese to enjoy twice the game! The Online Mode featured in \"TROUBLE WITCHES NEO\" will allow you to play in cooperation with players worldwide, or, at the contrary, to confront them to get the highest score! In addition to the \"ARRANGE MODE\" with its high quality HD graphics, you can enjoy two different types of \"CHALLENGE MODE\" and&#12288;the \"ARCADE MODE\", original version of the game, for a very low price &#9834;… Expand"}, {"name": "Tower of Guns", "details_link": "https://www.metacritic.com/game/playstation-4/tower-of-guns", "publisher": "Grip Games", "release_date": "Apr 10 2015", "developers": ["Terrible Posture Games"], "platforms": ["PC", "PlayStation 3", "Xbox One", "PlayStation 4"], "genres": ["Sci-Fi", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/050e4975f2819a9641924b1236c754cc-98.jpg", "descriptions": "Tower of Guns is a first-person shooter for gamers who simply want to arm themselves with the biggest guns imaginable, dispatching a whole array of enemies and perils in a tsunami of bullets, battle massive bosses, upgrade abilities and modify gear to make themselves the ultimate force.Tower of Guns is a first-person shooter for gamers who simply want to arm themselves with the biggest guns imaginable, dispatching a whole array of enemies and perils in a tsunami of bullets, battle massive bosses, upgrade abilities and modify gear to make themselves the ultimate force. Whenever the gamer dies, she returns to the beginning of the challenge, only stronger and better-equipped than before, ready to face varying level layouts and enemies, keeping the action fresh and challenging.… Expand"}, {"name": "Sword of the Necromancer", "details_link": "https://www.metacritic.com/game/pc/sword-of-the-necromancer", "publisher": "JanduSoft", "release_date": "Jan 28 2021", "developers": ["Grimorio of Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Role-Playing", "Roguelike"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/a29a69e2c8c20c16ddef584eb16fd0c8-98.jpg", "descriptions": "Help Tama to save Koko using the powers of the forbidden Sword of the Necromancer. Turn your foes into allies and reach the depths of the Necromancer's dungeon. Defeat the guardians to gain enough soul power to bring Koko back from the dead, no matter the cost."}, {"name": "NCAA March Madness 08", "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-march-madness-08", "publisher": "Electronic Arts", "release_date": "Dec 11 2007", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/745f7602938ff31586b89854078efa59-98.jpg", "descriptions": "NCAA March Madness 08 has created a strategic new gameplay experience called Dynamic Post Play that enables you to take complete control over running your offense through the post, and defending your opponent in the paint. Experience the intensity of a strategic match-up on each possession,NCAA March Madness 08 has created a strategic new gameplay experience called Dynamic Post Play that enables you to take complete control over running your offense through the post, and defending your opponent in the paint. Experience the intensity of a strategic match-up on each possession, outwit your opponent by creating a favorable mismatch, and then make a move that scores the bucket to lift your team and your fans to victory. For the first time, you have complete control over dozens of new offensive post moves, including finesse ones like an up-and-under, drop step, hook spin, jump hook, and pump fake, and the ability to combine moves together. Animations can be interrupted at any time to transition into a new move, enabling you to read and respond to the defense, just like real life. Take command of the post on defense with strategic positioning to dominate down low -- guard your opponent man-to-man, front him to deny the entry pass or read the offense and go for the steal. NCAA March Madness 08 finally makes dream match-ups a reality, enabling you to replay classic games in college basketball history. Featuring more than 70 classic teams, take the court as the 1972 UCLA Bruins against any of the great North Carolina Tar Heels teams of the 1980s, the Duke Blue Devils of the 1990s or the two-time defending national champion University of Florida Gators. In addition, the ultimate teams for dozens of Division I programs have been created enabling you to go head-to-head to determine the best team in the history of college basketball. [Electronic Arts]… Expand"}, {"name": "South of the Circle", "details_link": "https://www.metacritic.com/game/switch/south-of-the-circle", "publisher": "11 bit studios", "release_date": "Aug  3 2022", "developers": ["State of Play Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/0fb5b158571d28eec929b3535b1682e0-98.jpg", "descriptions": "Antarctica, 1964.A crashed aircraft, tail to the sky.\n\nCambridge academic Peter stumbles from the wreckage in search of help, fighting the cold. As his attempts to escape the ice grow more desperate, the lines between his past and present begin to blur.\n\nA love story between colleaguesAntarctica, 1964.A crashed aircraft, tail to the sky.Cambridge academic Peter stumbles from the wreckage in search of help, fighting the cold. As his attempts to escape the ice grow more desperate, the lines between his past and present begin to blur.A love story between colleagues Peter and Clara, set against the backdrop of the Cold War, South of the Circle is a narrative adventure game about memory, survival, and the consequences of not dealing with the past.… Expand"}, {"name": "Twin Breaker: A Sacred Symbols Adventure", "details_link": "https://www.metacritic.com/game/playstation-4/twin-breaker-a-sacred-symbols-adventure", "publisher": "Lillymo Games", "release_date": "Mar 24 2020", "developers": ["Lillymo Games"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/974f7b229b364a99a5960600155b5463-98.jpg", "descriptions": "The United States sends generation ships to nearby star systems to find new planets to colonize. But once in interstellar space, the ships mysteriously disappear. When clues emerge about the missing spacecraft, two pilots jump through a wormhole into a story-driven brick breaker in theThe United States sends generation ships to nearby star systems to find new planets to colonize. But once in interstellar space, the ships mysteriously disappear. When clues emerge about the missing spacecraft, two pilots jump through a wormhole into a story-driven brick breaker in the spirit of Arkanoid and Breakout.… Expand"}, {"name": "Where the Water Tastes Like Wine", "details_link": "https://www.metacritic.com/game/switch/where-the-water-tastes-like-wine", "publisher": "Serenity Forge", "release_date": "Nov 29 2019", "developers": ["Serenity Forge", "Dim Bulb Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General"], "meta_score": 69, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/1/a7b7b45f4aa33a443ca20cf9a125ffb6-98.jpg", "descriptions": "Where the Water Tastes Like Wine is a Narrative-Adventure game about traveling, sharing stories, and surviving manifest destiny. Featuring gorgeous hand-drawn illustrations, Where the Water Tastes Like Wine combines 2D visuals with a 3D overworld US map. Players wander across a folkloricWhere the Water Tastes Like Wine is a Narrative-Adventure game about traveling, sharing stories, and surviving manifest destiny. Featuring gorgeous hand-drawn illustrations, Where the Water Tastes Like Wine combines 2D visuals with a 3D overworld US map. Players wander across a folkloric Depression era United States at their own pace, meeting strangers with their own stories to tell. Through these interactions, players will be able to collect unique stories which can then be re-told to unlock new interactions. In this way the in-game stories themselves act as a currency to progress through the game, and it’s up to the player to pair the right story with the unique needs of each of the characters that you will encounter throughout your travels. Only through these right pairings will characters reveal their true selves, and bestow you with the most powerful stories, the true ones which reveal something about their own lives. In Where The Water Tastes Like Wine, stories organically take on a life of their own as they grow larger and transform as they're told- and re-told.\r… Expand"}, {"name": "The Long Reach", "details_link": "https://www.metacritic.com/game/xbox-one/the-long-reach", "publisher": "Painted Black Games", "release_date": "Jul 18 2018", "developers": ["Painted Black Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/9463c966a7822855ff0da184411bae6f-98.jpg", "descriptions": "The Long Reach is set in New Hampshire, in the fictional town of Baervox. The game draws its inspiration from Lone Survivor and The Cave and all the classical adventures (except that The Long Reach is set in the present day)."}, {"name": "The Golf Club 2", "details_link": "https://www.metacritic.com/game/xbox-one/the-golf-club-2", "publisher": "Maximum Games", "release_date": "Jun 27 2017", "developers": ["HB Studios Multimedia", "Maximum Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 69, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/5dd973b85ddb8e342b4c3854eb45dace-98.jpg", "descriptions": "Rise to fame and fortune in the largest, most dynamic golf game ever created. Assemble and join online societies with friends, compete in tournaments, and earn money to climb the ranks in golf's largest gaming community.\r The Golf Club 2 offers a dynamic, single-player career mode,Rise to fame and fortune in the largest, most dynamic golf game ever created. Assemble and join online societies with friends, compete in tournaments, and earn money to climb the ranks in golf's largest gaming community.\r The Golf Club 2 offers a dynamic, single-player career mode, infinite hours of interactive golfing with online opponents, a new and improved course creator, cutting-edge swing mechanics, and a host of brand new, lush environments - all blending together seamlessly to create your dream golfing experience.… Expand"}, {"name": "SimCity Creator", "details_link": "https://www.metacritic.com/game/ds/simcity-creator", "publisher": "EA Games", "release_date": "Sep 22 2008", "developers": ["Electronic Arts"], "platforms": "DS", "num_players": "1 Player", "genres": ["Strategy", "Breeding/Constructing", "General", "Management", "Breeding/Constructing", "Government"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/e6379e2f26b7151cc07da578c9c504cb-98.jpg", "descriptions": "Guide your city from ancient times into the future with SimCity Creator for Nintendo DS. Evolve your city through time, starting with ancient times, the middle ages, modern times, present day and the future. Four play modes are available, Challenge, Free Play, Chance Encounter and Gallery,Guide your city from ancient times into the future with SimCity Creator for Nintendo DS. Evolve your city through time, starting with ancient times, the middle ages, modern times, present day and the future. Four play modes are available, Challenge, Free Play, Chance Encounter and Gallery, giving options to make the game as challenging or as creative as you want. Earn epic landmarks along the way to enhance your city and mark your progress into the next era. Choose your path through history and make a city for the ages. Employing the new city advisor system, you can make the game as complex or simple as you want. [Electronic Arts]… Expand"}, {"name": "Dr. Mario: Miracle Cure", "details_link": "https://www.metacritic.com/game/3ds/dr-mario-miracle-cure", "publisher": "Nintendo", "release_date": "Jun 11 2015", "developers": ["Nintendo"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Stacking"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/33be39a0682d42ab2698463a805c34be-98.jpg", "descriptions": "Dr. Mario is back with a new arsenal of treatments. In the Miracle Cure Laboratory, you'll take on preset challenges with normal, two-sided pills and L-shaped pills. To aid your recovery, you'll fill a special gauge to earn Miracle Cures that will help alleviate your ailments. Pop inDr. Mario is back with a new arsenal of treatments. In the Miracle Cure Laboratory, you'll take on preset challenges with normal, two-sided pills and L-shaped pills. To aid your recovery, you'll fill a special gauge to earn Miracle Cures that will help alleviate your ailments. Pop in powerful Blasters to disinfect a section of the bottle, or apply cleverly placed Zappers to wipe out entire rows or columns. Then, self-prescribe some Miracle Cure power-ups in endless Dr. Mario or Dr. Luigi game modes to balance out your intake. A caution from the doctor: challenging your friends locally or online may be habit forming.… Expand"}, {"name": "AER: Memories of Old", "details_link": "https://www.metacritic.com/game/pc/aer-memories-of-old", "publisher": "Daedalic Entertainment", "release_date": "Oct 25 2017", "developers": ["Daedalic Entertainment", "Forgotten Key"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/7056b38a6aa2a600eda0680785cd6303-98.jpg", "descriptions": "AER puts you in the shoes of Auk, a magical shape-shifting girl who can transform between human and bird."}, {"name": "Graveyard Keeper", "details_link": "https://www.metacritic.com/game/pc/graveyard-keeper", "publisher": "tinyBuild", "release_date": "Aug 15 2018", "developers": ["Lazy Bear Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "Virtual", "Open-World", "Career"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/3ad622c4cd85c2a9244159fccd07f999-98.jpg", "descriptions": "Build and manage a medieval graveyard while facing ethical dilemmas and making questionable decisions. Welcome to Graveyard Keeper, the most inaccurate medieval cemetery sim of the year."}, {"name": "Sonic Frontiers", "details_link": "https://www.metacritic.com/game/switch/sonic-frontiers", "publisher": "Sega", "release_date": "Nov  8 2022", "developers": ["Sega", "Sonic Team"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World", "Action", "Platformer", "3D"], "meta_score": 69, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/e521119d7066c1847866ed77704f1ed2-98.jpg", "descriptions": "Worlds collide in Sonic the Hedgehog's newest adventure. Accelerate to new heights and experience the thrill of high velocity open-zone freedom. Battle powerful enemies as you speed through the Starfall Islands - landscapes brimming with dense forests, overflowing waterfalls, sizzlingWorlds collide in Sonic the Hedgehog's newest adventure. Accelerate to new heights and experience the thrill of high velocity open-zone freedom. Battle powerful enemies as you speed through the Starfall Islands - landscapes brimming with dense forests, overflowing waterfalls, sizzling deserts and more.… Expand"}, {"name": "Wet", "details_link": "https://www.metacritic.com/game/xbox-360/wet", "publisher": "Bethesda Softworks", "release_date": "Sep 15 2009", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/25959951ddb1db1410c3da0c74768004-98.jpg", "descriptions": "WET is a seamless integration of intense gunplay, death-defying acrobatics and exciting swordplay. The game  tells the story of Rubi, an acrobatic gun-for-hire. When she agrees to help a wealthy man find and bring back his wayward son, all hell breaks loose and the tables are turned, as theWET is a seamless integration of intense gunplay, death-defying acrobatics and exciting swordplay. The game  tells the story of Rubi, an acrobatic gun-for-hire. When she agrees to help a wealthy man find and bring back his wayward son, all hell breaks loose and the tables are turned, as the man who hired her isn't who he appeared to be. Now Rubi's on the run, needing to find the man who left her for dead and leaving a massive body count in her wake. Innovative 3rd person shooter gameplay: With her trusty twin custom made Colt Pythons, Rubi gracefully engages in amazing, cinematic high-body count gunplay against diverse and challenging enemies. Along with her guns, Rubi has an arsenal of death-defying acrobatic moves. Her incredible agility allows her to climb on ledges, slide under obstacles, swing on poles and run along walls. Rubi's sword is an instrument for deadly close-quarter proximity attacks.  Rubi will unleash a flurry of multi-staged stylized attack sequences. [Sierra Entertainment]… Expand"}, {"name": "The Blackout Club", "details_link": "https://www.metacritic.com/game/xbox-one/the-blackout-club", "publisher": "Question", "release_date": "Jul 30 2019", "developers": ["Question"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/99bc45794f4a1df360e4731c66cf7758-98.jpg", "descriptions": "You are a teenager from a small, modern town. Each morning, you awaken covered in mud or scratches, with no memory of the night before. You've heard of sleepwalking - but this is different. Sometimes you lose entire days.\r There are others like you. Your new group of friends bonded overYou are a teenager from a small, modern town. Each morning, you awaken covered in mud or scratches, with no memory of the night before. You've heard of sleepwalking - but this is different. Sometimes you lose entire days.\r There are others like you. Your new group of friends bonded over this shared secret, forming a club to investigate the cause of these BLACKOUTS. Together, you discovered a network of bizarre underground tunnels, hidden just beneath the surface of your quiet community. An uncanny, disorienting music beckoned from below.… Expand"}, {"name": "Cycle 28", "details_link": "https://www.metacritic.com/game/switch/cycle-28", "publisher": "Pill Bug Interactive", "release_date": "Aug  2 2018", "developers": ["Pill Bug Interactive"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/3b6df0db9db2a25dbcbf0da7673b4687-98.jpg", "descriptions": "Power slide your way between bullets and screen-shaking explosions, and maybe solve the mystery of Cycle 28, a space shooter in the classic arcade style that keeps you pushing for a high score. The controls are simple. The action is fast-paced. Intense dogfights lead to epic, screen-fillingPower slide your way between bullets and screen-shaking explosions, and maybe solve the mystery of Cycle 28, a space shooter in the classic arcade style that keeps you pushing for a high score. The controls are simple. The action is fast-paced. Intense dogfights lead to epic, screen-filling bosses.\r… Expand"}, {"name": "DOOM VFR", "details_link": "https://www.metacritic.com/game/pc/doom-vfr", "publisher": "Bethesda Softworks", "release_date": "Nov 30 2017", "developers": ["id Software"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Light Gun", "Arcade"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/c1a4690c6eef7746a97dda66b5f20466-98.jpg", "descriptions": "Available for PlayStation VR and VIVE platforms, this DOOM adventure will bathe you in virtual carnage. Developed by id Software, the studio that pioneered the first-person shooter genre and modern VR, DOOM VFR brings the fast-paced, brutal gameplay fans of the series love to virtualAvailable for PlayStation VR and VIVE platforms, this DOOM adventure will bathe you in virtual carnage. Developed by id Software, the studio that pioneered the first-person shooter genre and modern VR, DOOM VFR brings the fast-paced, brutal gameplay fans of the series love to virtual reality. Immerse yourself in the UAC facility on Mars and the depths of Hell, as your skills are put to the test through intense combat and challenging puzzle-solving. Play as a cybernetic survivor who is activated by the UAC to fight the demon invasion, maintain order, and prevent catastrophic failure at the Mars facility. Lay waste to an army of demonic foes as you explore and interact with the outlandish world of DOOM from an entirely new perspective.… Expand"}, {"name": "The Simpsons Arcade Game", "details_link": "https://www.metacritic.com/game/playstation-3/the-simpsons-arcade-game", "publisher": "Konami", "release_date": "Feb  7 2012", "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 69, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/f40ecd8b0316ed319ebca7ebf652a50e-98.jpg", "descriptions": "The long-awaited home console port of the classic Simpsons arcade game is finally here! Join three of your friends as you chase down Smithers and Mr. Burns on the epic quest to save Maggie. Battle your way through 8 classic Springfield locations in this hilarious blast from the past!"}, {"name": "Harvest Moon: Magical Melody", "details_link": "https://www.metacritic.com/game/wii/harvest-moon-magical-melody", "publisher": "Natsume", "release_date": "Aug 25 2009", "developers": ["Marvelous Entertainment"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Breeding/Constructing", "General", "Management", "Breeding/Constructing", "Business / Tycoon"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/afc6c3c3d631e9c2b521e67d533c2a03-98.jpg", "descriptions": "(Currently available in the UK/EU only)  Choose your plot of land from either Ocean Side, River Side or in the centre of Flower Bud village and start farming. With a wealth of animals to tend and crops to grow, Harvest Moon: Magical Melody offers gamers, young and old, hours of agricultural(Currently available in the UK/EU only)  Choose your plot of land from either Ocean Side, River Side or in the centre of Flower Bud village and start farming. With a wealth of animals to tend and crops to grow, Harvest Moon: Magical Melody offers gamers, young and old, hours of agricultural fun for the whole family. [Rising Star Games]… Expand"}, {"name": "The Callisto Protocol", "details_link": "https://www.metacritic.com/game/playstation-5/the-callisto-protocol", "publisher": "KRAFTON Inc.", "release_date": "Dec  2 2022", "developers": ["Striking Distance Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/51647d9292241df1c01ac126f93ca568-98.jpg", "descriptions": "Set on Jupiter's moon Callisto in the year 2320, The Callisto Protocol is a next-generation take on survival horror. The game challenges players to escape the maximum security Black Iron Prison and uncover its terrifying secrets. A blend of horror, action, and immersive storytelling, theSet on Jupiter's moon Callisto in the year 2320, The Callisto Protocol is a next-generation take on survival horror. The game challenges players to escape the maximum security Black Iron Prison and uncover its terrifying secrets. A blend of horror, action, and immersive storytelling, the game aims to set a new bar for horror in interactive entertainment.… Expand"}, {"name": "Captain Tsubasa: Rise of New Champions", "details_link": "https://www.metacritic.com/game/playstation-4/captain-tsubasa-rise-of-new-champions", "publisher": "Bandai Namco Games", "release_date": "Aug 28 2020", "developers": ["Tamsoft", "Bandai Namco Games"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Soccer", "Arcade"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/8116e3964c27da4f04ccaea34d913c37-98.jpg", "descriptions": "Captain Tsubasa: Rise of New Champions is an arcade football game bringing a refreshing look to the football genre with the exhilarating action and over the top shots that made the license famous."}, {"name": "Deliver Us Mars", "details_link": "https://www.metacritic.com/game/xbox-series-x/deliver-us-mars", "publisher": "Frontier Foundry", "release_date": "Feb  2 2023", "developers": ["KeokeN Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/6f98da7de89796b68a9d1e33b011cd3f-98.jpg", "descriptions": "Sequel to the award-winning Deliver Us The Moon, Deliver Us Mars is an atmospheric sci-fi adventure offering an immersive astronaut experience. Explore new frontiers on a suspense-fuelled, high-stakes mission to recover the ARK colony ships stolen by the mysterious Outward."}, {"name": "Gamedec", "details_link": "https://www.metacritic.com/game/switch/gamedec", "publisher": "Anshar Studios", "release_date": "Jul  1 2022", "developers": ["Anshar Studios"], "platforms": ["PC", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Western-Style"], "meta_score": 69, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/68a471f6f30f7e8bb80f92757d6348e2-98.jpg", "descriptions": "Gamedec is an adaptive cyberpunk RPG. As a private detective, it's your job to solve crimes inside virtual worlds. What decisions will you make in a world where child slavery is a F2P game, where murder over a game-clan dispute is an every-day reality? Who will you become in the XXII century?"}, {"name": "RiftStar Raiders", "details_link": "https://www.metacritic.com/game/playstation-4/riftstar-raiders", "publisher": "Climax Studios", "release_date": "Feb 27 2018", "developers": ["Climax Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/442d06ac53428e6be2aff6d7fe8a93a6-98.jpg", "descriptions": "The Spiral Arm has been plunged into chaos, hordes of WarSwarm, a hive-mind of alien AI, have waged war on humanity, and it’s fallen to the poster boy for the Federation’s “Most Wanted” to save the galaxy… and turn a profit."}, {"name": "BADLAND: Game of the Year Edition", "details_link": "https://www.metacritic.com/game/xbox-one/badland-game-of-the-year-edition", "publisher": "Frogmind", "release_date": "May 29 2015", "developers": ["Frogmind"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One"], "genres": ["Action", "Action Adventure", "Arcade", "Linear"], "meta_score": 69, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/640dee0352fd4afd6926fcda468fcab9-98.jpg", "descriptions": "BADLAND is a side-scrolling action adventure with physics-based gameplay and atmospheric graphics and audio. Players control a flying creature, Clony, and try to survive through an astonishing number of imaginative and deadly traps, puzzles and obstacles within a dense, beautiful forest. OneBADLAND is a side-scrolling action adventure with physics-based gameplay and atmospheric graphics and audio. Players control a flying creature, Clony, and try to survive through an astonishing number of imaginative and deadly traps, puzzles and obstacles within a dense, beautiful forest. One of the key gameplay mechanics is cloning, where you end up controlling dozens of Clones at the same time.… Expand"}, {"name": "The Conduit", "details_link": "https://www.metacritic.com/game/wii/the-conduit", "publisher": "Sega", "release_date": "Jun 23 2009", "developers": ["High Voltage Software"], "platforms": "Wii", "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/71c7e8227b7888027d425de315a5a96a-98.jpg", "descriptions": "The Conduit is a first-person action shooter that promises to provide some of the best visuals seen to date on Nintendo's Wii gaming console. Using their proprietary Quantum 3 Game Engine technology, the team at High Voltage Software fuses fast and fluid gameplay with an advanced set ofThe Conduit is a first-person action shooter that promises to provide some of the best visuals seen to date on Nintendo's Wii gaming console. Using their proprietary Quantum 3 Game Engine technology, the team at High Voltage Software fuses fast and fluid gameplay with an advanced set of visuals intended to squarely establish the Wii as a true next-generation gaming platform. The first-person shooter boasts a competitive online multiplayer component and a thrilling single-player campaign. Advanced graphical features include dynamic environment mapping, interactive water with real-time reflection, and four-stage texture composition including gloss, diffuse, and bump mapping. Featuring terrifying alien creatures, an advanced Artificial Intelligence System, and a rich, conspiracy-laden story, The Conduit has more than a pretty face. The Conduit's control scheme was carefully designed from the ground up with the Wii in mind, as were each of the weapons in the extensive armory, providing gameplay not possible on other platforms. As Secret Service Agent Ford, you must learn to master each of these weapons as well as the special \"All Seeing Eye\" device to defeat enemies, solve puzzles, and unravel the game's mysteries. [High Voltage Software]… Expand"}, {"name": "NHL 2K9", "details_link": "https://www.metacritic.com/game/xbox-360/nhl-2k9", "publisher": "Take-Two Interactive", "release_date": "Sep  8 2008", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/de7dd1bdbc3a3690a0158a523bfa5510-98.jpg", "descriptions": "Fans asked and 2K Sports answered with easy-to-learn controls that still provide depth for the season veteran. With 2K Sports' classic default controls, a player’s first game will be as enjoyable as their one-thousandth, while the new and intuitive hybrid controls will provide the depthFans asked and 2K Sports answered with easy-to-learn controls that still provide depth for the season veteran. With 2K Sports' classic default controls, a player’s first game will be as enjoyable as their one-thousandth, while the new and intuitive hybrid controls will provide the depth experienced vets are looking for. Enhanced Gameplay - An updated arsenal of highlight reel-worthy superstar moves, blocked shots, stick-handling moves, hit-by-puck collisions, and a greatly-enhanced skating engine make up for an exciting and all-new hockey experience complete with more than 1,400 new gameplay animations. All-New Presentation System – Pre-game intros, menus, new crowd animations, game summary replays, and brand new commentary featuring Randy Hahn and Drew Remenda of the San Jose Sharks bring a fresh new look and sound to NHL 2K9’s visual and audio experience. [2K Sports]… Expand"}, {"name": "Zeus Quest - The Rebirth of Earth", "details_link": "https://www.metacritic.com/game/playstation-5/zeus-quest---the-rebirth-of-earth", "publisher": "Infogrames", "release_date": "Jun 10 2022", "developers": ["Innerloop", "CrazySoft"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Adventure", "Alternative", "Point-and-Click", "Other"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/f188cee22a9def3efa4addaa092cd969-98.jpg", "descriptions": "Blazing Xtreme Sports action! Test your skills in 6 hot extreme sports including bungee jumping and skysurfing. Battle to victory in intense triple even racing! Explore 5 exotic real-world locations including Mt. Kilamanjaro, Maui, and the Himalayas, with 12 multi environment tracks toBlazing Xtreme Sports action! Test your skills in 6 hot extreme sports including bungee jumping and skysurfing. Battle to victory in intense triple even racing! Explore 5 exotic real-world locations including Mt. Kilamanjaro, Maui, and the Himalayas, with 12 multi environment tracks to choose from. Relive the action with instant replay!… Expand"}, {"name": "DESYNC", "details_link": "https://www.metacritic.com/game/pc/desync", "publisher": "Adult Swim", "release_date": "Feb 28 2017", "developers": ["Foregone"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/24bd13fbf1fd36e552eca28c06d32bec-98.jpg", "descriptions": "DESYNC is a single-player first person action game that begs you to play dangerously and creatively. Eliminate your opponents as you perform violent attack sequences using the explosive digital weaponry and lethal side-arms at your disposal."}, {"name": "HoopWorld", "details_link": "https://www.metacritic.com/game/wii/hoopworld", "publisher": "Virtual Toys", "release_date": "Jul 19 2010", "developers": ["Virtual Toys"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/ab90a1e43704cdd29a5fc8dc829d2b9e-98.jpg", "descriptions": "[WiiWare]  Long ago, a lost civilization called the Elders, who worshiped the magical power of Nature, built a network of sacred temples around the world. Millennia have since passed, and the temples now lie in ruins. But their energy still resonates from the land, attracting adventurers[WiiWare]  Long ago, a lost civilization called the Elders, who worshiped the magical power of Nature, built a network of sacred temples around the world. Millennia have since passed, and the temples now lie in ruins. But their energy still resonates from the land, attracting adventurers from distant lands. Drawn by the unknown force, friends have begun to rebuild the ruins into ball courts, knowing only that they must relive the time-honored test of the spirit of the Elders: the game now known as basketball. HoopWorld is a three-on-three basketball game with an arcade twist. Unique characters and beautiful natural locations set the stage, while fighting and random power-ups keep the game fast and rough. Choose your favorite team and basketbrawl across the globe to become the undisputed world champions. Play on your own or with a friend and see if you can beat the leaders of the HoopWorld global ranking.… Expand"}, {"name": "Assassin's Creed II: Discovery", "details_link": "https://www.metacritic.com/game/ds/assassins-creed-ii-discovery", "publisher": "Ubisoft", "release_date": "Nov 17 2009", "developers": ["Griptonite Games"], "platforms": ["iPhone/iPad", "DS"], "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/952d63afd7ce4ecd44a2f28d40997196-98.jpg", "descriptions": "Assassin's Creed II: Discovery takes players through an untold chapter from the Assassin's Creed II console storyline utilizing the unique strengths of the Nintendo DS platform. In this new adventure, Ezio travels to Spain to rescue fellow assassins being held under the guise of theAssassin's Creed II: Discovery takes players through an untold chapter from the Assassin's Creed II console storyline utilizing the unique strengths of the Nintendo DS platform. In this new adventure, Ezio travels to Spain to rescue fellow assassins being held under the guise of the Inquisition, only to uncover a Templar plot to sail west and discover the New World. The game takes platforming into the next generation with an emphasis on exhilarating speed and breathtaking acrobatics. The in-game animations provide players with a true visceral experience and the intuitive controls enable players to easily execute assassinations and nimbly navigate obstacles reaching daredevil speeds. Nintendo DSi owners will be able to take pictures of themselves and put them directly into the game as \"WANTED!\" posters. [Ubisoft]… Expand"}, {"name": "Rag Doll Kung Fu", "details_link": "https://www.metacritic.com/game/pc/rag-doll-kung-fu", "publisher": "Merscom LLC", "release_date": "Oct 12 2005", "developers": ["Mark Healey"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 69, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/176f35e31c6e16867908f213bc1800c4-98.jpg", "descriptions": "Imagine having a Kung Fu Fight with string puppets, except you don't have to worry about getting the strings tangled up, and you don't have to have a kung fu fight. You control the characters on screen with the mouse – there are no pre-scripted animations in the game – it's all up to you –Imagine having a Kung Fu Fight with string puppets, except you don't have to worry about getting the strings tangled up, and you don't have to have a kung fu fight. You control the characters on screen with the mouse – there are no pre-scripted animations in the game – it's all up to you – to walk, you have to literally pick up one foot, then place it in front of the other. Sounds tricky maybe, but it doesn't take long before you're spinning through the air like a Russian gymnast. This means you get to create your own style, and can act out whatever you feel like, and of course, if you really feel like it, you can have a fight. It's about Chi power. [Mark Healey]… Expand"}, {"name": "Harry Potter: Quidditch World Cup", "details_link": "https://www.metacritic.com/game/pc/harry-potter-quidditch-world-cup", "publisher": "Electronic Arts", "release_date": "Oct 28 2003", "developers": ["Electronic Arts"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Team", "Individual", "Other", "Other"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/1527d8707c283f1a23764267d271f866-98.jpg", "descriptions": "Take to the air in the first game that allows players to fully experience the magical speed, power, and competition of Quidditch, the favorite sport of witches and wizards, in the Harry Potter: Quidditch World Cup game. For the first time, gamers will experience  the full complexity andTake to the air in the first game that allows players to fully experience the magical speed, power, and competition of Quidditch, the favorite sport of witches and wizards, in the Harry Potter: Quidditch World Cup game. For the first time, gamers will experience  the full complexity and exciting challenge of Quidditch, which involves two teams of seven players who fly on broomsticks, playing four balls simultaneously. Players will control every position on their team, including three Chasers who try to score with the Quaffle, two Beaters who control the dangerous Bludgers, the Keeper who protects the goal, and the Seeker who chases the elusive Golden Snitch that must be caught to end the match. [Electronic Arts]… Expand"}, {"name": "The Haunted Mansion", "details_link": "https://www.metacritic.com/game/playstation-2/the-haunted-mansion", "publisher": "TDK Mediactive", "release_date": "Oct 14 2003", "developers": ["High Voltage Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/a9471bc1e2027bd0b4b7d5642ccdf733-98.jpg", "descriptions": "Trouble has found Zeke Holloway! In this famous house of wall-to-wall creeps and hot-and-cold running chills, Zeke must put unwelcome evil spirits to rest while trying to keep himself from being scared to death?literally. There's no turning back now. Naviagate through Disney's HauntedTrouble has found Zeke Holloway! In this famous house of wall-to-wall creeps and hot-and-cold running chills, Zeke must put unwelcome evil spirits to rest while trying to keep himself from being scared to death?literally. There's no turning back now. Naviagate through Disney's Haunted Mansion with game environments inspired by the movie and the ride. Run, jump, fight and climb as you attempt to rid the mansion of evil spirits. Release 999 trapped souls before becoming one. Unique puzzles that uncover hidden clues, passageways and secrets untold. [TDK Mediactive]… Expand"}, {"name": "Iron Storm", "details_link": "https://www.metacritic.com/game/pc/iron-storm", "publisher": "DreamCatcher Interactive", "release_date": "Oct 25 2002", "developers": ["4X Studios"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/1c8c75d1e848246339381054d80a5bcf-98.jpg", "descriptions": "Western Germany, March 1964...The last Great War continues to rage on. All you have ever known is the madness of the front lines and of men butchering each other. War-torn Europe stands ripped apart by a front line that runs straight through the heart of Germany where American and WesternWestern Germany, March 1964...The last Great War continues to rage on. All you have ever known is the madness of the front lines and of men butchering each other. War-torn Europe stands ripped apart by a front line that runs straight through the heart of Germany where American and Western European troops battle against enemy forces. In an eternal war that seems to have no end in sight, opposing forces mercilessly attack each other with unrelenting force, claiming small victories one day only to lose them the next. As Lieutenant James Anderson you must infiltrate and destroy key enemy positions deep behind enemy lines using your sharpened combat skills and stealth where necessary. If successful, your mission could finally put a stop to the carnage and restore what everybody has long since forgotten about: peace. Alternative history: between reality and fiction, Iron Storm takes place in an imaginary environment which has been inspired by real events. Iron Storm takes real elements from the First World War; trenches, barbed wire fences, mines, gas warfare, snipers?and combines them with more modern elements from the Second World War; automatic weapons, radar, tanks, flame throwers? as well as elements inspired by modern warfare; helicopters, lasers, electronics and more. [DreamCatcher Interactive]… Expand"}, {"name": "Castlevania Chronicles", "details_link": "https://www.metacritic.com/game/playstation/castlevania-chronicles", "publisher": "Konami", "release_date": "Oct  8 2001", "developers": ["Konami"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/46b044bfc01bd970a4a7caae7d2fb803-98.jpg", "descriptions": "Count Dracula has been resurrected to begin a new reign of terror across the land. As Simon Belmont, descendant of legendary vampire hunters, you enter Dracula's estate to face the Count and his minions - alone. Be prepared for one of the first adventures in the Castlevania series ever!"}, {"name": "Sports Champions 2", "details_link": "https://www.metacritic.com/game/playstation-3/sports-champions-2", "publisher": "SCEA", "release_date": "Oct 30 2012", "developers": ["SCEA", "Zindagi Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/38de6193e24f6e753d5caec55f42e4b6-98.jpg", "descriptions": "Sports Champions 2, sequel to the PlayStation Move launch title, is getting back in the ring with an array of new sports. Using single or double motion controllers, you will compete against friends in all-new events including Boxing, Golf, Bowling, Skiing and Tennis, and hit the bullseyeSports Champions 2, sequel to the PlayStation Move launch title, is getting back in the ring with an array of new sports. Using single or double motion controllers, you will compete against friends in all-new events including Boxing, Golf, Bowling, Skiing and Tennis, and hit the bullseye with an updated Archery mode.… Expand"}]