[{"name": "Bubsy: The Woolies Strike Back", "details_link": "https://www.metacritic.com/game/pc/bubsy-the-woolies-strike-back", "publisher": "Accolade", "release_date": "Oct 31 2017", "developers": ["Black Forest Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 44, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/6a492e585fd4a0efcc34c3cac7edd55e-98.jpg", "descriptions": "Watch Bubsy glide like a bat, jump like a jack rabbit, bounce like a red rubber ball and run…run Bubsy run. This is the Bubsy adventure you were born to play."}, {"name": "Harry Potter and the Deathly Hallows, Part 2", "details_link": "https://www.metacritic.com/game/xbox-360/harry-potter-and-the-deathly-hallows-part-2", "publisher": "Electronic Arts", "release_date": "Jul 12 2011", "developers": ["EA Bright Light"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 44, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/9/160961e3f90f0e27587db68e9feee0d5-98.jpg", "descriptions": "Harry Potter takes a dark turn in this third-person shooter as he battles death eaters and dementors while fleeing for his life across the wilds of England."}, {"name": "Swashbucklers: Blue vs. Grey", "details_link": "https://www.metacritic.com/game/pc/swashbucklers-blue-vs-grey", "publisher": "Atari", "release_date": "Nov  8 2007", "developers": ["Akella"], "platforms": "PC", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 44, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/5/29897c45de4fecac6d297fbe6b2c7926-98.jpg", "descriptions": "Swashbucklers: Blue vs. Grey is a Naval Action/RPG set in time of the American Civil War – the time of last pirate renaissance on the Caribbean. The Union fleet blockaded the Southern ports, rupturing all the trading connections of the Confederacy. In return, Confederate government startedSwashbucklers: Blue vs. Grey is a Naval Action/RPG set in time of the American Civil War – the time of last pirate renaissance on the Caribbean. The Union fleet blockaded the Southern ports, rupturing all the trading connections of the Confederacy. In return, Confederate government started giving out the privateer patents, thus building a powerful fleet of commercial raiders, the best example of which was the legendary captain Raphael Semmes. Also, smuggling the goods through the blockade became very profitable, though risky, business and attracted numerous traders to attempts of running the blockade. Abraham Gray, the main character, starts the game as a captain of a privately-owned vessel, but soon becomes involved into the story of blockade-running, military espionage and the ultimately powerful ironclad, built in Liverpool for the Confederacy. This ironclad alone could have change the course of war and bring the victory to the Rebel states. Then Abraham can join either Confederacy as a raider, or a Union as a spy. The player is free to sail across the game’s world – from southern coasts of the USA and Florida to Jamaica and North Caribbean. He can trade and smuggle goods between nineteen ports – both free and blockaded, raid the cargo ships, battle the warships and ironclads and complete quests for either Union or Confederacy. Aside from naval combat, Swashbucklers features strong on-foot gameplay, in which Abraham slashes his way through in various locations, confronting dozens of various enemies and bosses. The game’s role-playing system, based of three main characteristics and numerous perks, allows the player to develop the main character in various ways. He can improve his naval skills, learn new combos and shooting modes, or become the best trader in the Caribbean. Also, there are numerous options to upgrade the ship with Gatling guns, heavy weaponry, steam engines, or better sails. [1C Company]… Expand"}, {"name": "Discs of Tron", "details_link": "https://www.metacritic.com/game/xbox-360/discs-of-tron", "publisher": "Disney Interactive Studios", "release_date": "Feb 13 2008", "developers": ["Backbone Charlottetown"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 44, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/1f604a364f72e2b9136c7b5de7f8ab0e-98.jpg", "descriptions": "[Xbox Live Arcade]  Discs of Tron, a follow-up 1983 arcade game, enables players to fight Sark, the defender of Master Control Program, in one-on-one battles taking place in three-dimensional futuristic arenas. Players must move between platforms while throwing energy-charged discs at Sark[Xbox Live Arcade]  Discs of Tron, a follow-up 1983 arcade game, enables players to fight Sark, the defender of Master Control Program, in one-on-one battles taking place in three-dimensional futuristic arenas. Players must move between platforms while throwing energy-charged discs at Sark and deflecting oncoming discs to avoid being \"derezzed.\" The game includes the original version as well as an enhanced version with new graphics and audio features. Through Xbox LIVE Arcade, players can also compete in both games against another player in four online modes. [Disney Interactive Studios]… Expand"}, {"name": "Splat Renegade Paintball", "details_link": "https://www.metacritic.com/game/xbox/splat-renegade-paintball", "publisher": "Take-Two Interactive", "release_date": "Oct 11 2005", "developers": ["Cat Daddy Games"], "platforms": ["PC", "Xbox"], "num_players": "14  Online", "genres": ["Sports", "Alternative", "Other"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/4a0674ec4e4349fbe57d8d9f854b812f-98.jpg", "descriptions": "Splat Magazine Renegade Paintball challenges players with over 25 white-knuckle single player Tournament and Fieldball matches. For those who want more than single player competition, the game offers online multiplayer action via Xbox Live and System Link as well as Two Player Split Screen,Splat Magazine Renegade Paintball challenges players with over 25 white-knuckle single player Tournament and Fieldball matches. For those who want more than single player competition, the game offers online multiplayer action via Xbox Live and System Link as well as Two Player Split Screen, and Internet and LAN play for PC. Multiplayer and single player gamers can even design and customize their levels with the expansive Field Editor game feature. This option allows the player to create the ultimate paintball field to \"gog\" their opponents including choosing from 13 distinct indoor and outdoor environments such as arenas, stadiums, cities, hills, Wild West, military testing ground, and more. Additionally, hundreds of themed objects like trees; bushes, forts, buildings, junked cars and even a helicopter are available to be placed wherever needed. Adjust the size and texture of placed objects to increase the variety in the paintball arena. The ability to place power-ups such as: invincibility, ricochet, rapid fire, cannonball, sniper and ghost adds to the action and increase the competition.… Expand"}, {"name": "Big Mutha Truckers 2", "details_link": "https://www.metacritic.com/game/pc/big-mutha-truckers-2", "publisher": "THQ", "release_date": "Aug 23 2005", "developers": ["Eutechnyx"], "platforms": ["PlayStation 2", "PC"], "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 44, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/3/a22524bbed1929f91e72457924eb2ef9-98.jpg", "descriptions": "Big Mutha Truckers 2 begins with Ma Jackson being taken into police custody for tax evasion. The only way she can win her case is by hiring Cousin Jacob, the most \"fancy-talkin' legal fella\" this side of Booger's Canyon. Players will be challenged to raise the cash needed to bribe jurors toBig Mutha Truckers 2 begins with Ma Jackson being taken into police custody for tax evasion. The only way she can win her case is by hiring Cousin Jacob, the most \"fancy-talkin' legal fella\" this side of Booger's Canyon. Players will be challenged to raise the cash needed to bribe jurors to let Ma off by trucking, trading, wheeling and dealing. The go-anywhere, any-time philosophy that was utilized in the original Big Mutha Truckers is expanded in Big Mutha Truckers 2 with additional routes, hidden shortcuts, and the ability to drive numerous vehicles. Players have the freedom to deviate from their route and explore the highways and back roads to whichever city they decide to visit. In addition, the trading process is streamlined, with more focus on the on-road action. [THQ]… Expand"}, {"name": "Warriors Orochi 2", "details_link": "https://www.metacritic.com/game/xbox-360/warriors-orochi-2", "publisher": "Koei", "release_date": "Sep 23 2008", "developers": ["Omega Force"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 44, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/247bcd71e602cc641f6c00bbb18da72e-98.jpg", "descriptions": "Shattering time and space, the venomous Serpent King Orochi kidnapped the Dynasty Warriors and Samurai Warriors in scheme to test his might. The heroes eventually defeated Orochi and his menacing army. While the slain Orochi lies in the netherworld, a mysterious alliance is hatching anShattering time and space, the venomous Serpent King Orochi kidnapped the Dynasty Warriors and Samurai Warriors in scheme to test his might. The heroes eventually defeated Orochi and his menacing army. While the slain Orochi lies in the netherworld, a mysterious alliance is hatching an otherworldly plan so that the Serpent King may rise again. Now a new group of warriors must join forces with history's finest in an effort to stop this evil resurrection. Warriors Orochi 2 takes place after the events of the original game. The game's main \"Story\" mode features storylines for the kingdoms of Wu, Wei, and Shu, and the Samurai Warriors, while a new Orochi storyline looks back to the first series of wars to expose some of the Serpent King's secrets. The game's newly added \"Dream\" mode features an original storyline different from that of Story Mode. A new two-player \"Versus\" mode comes action-packed with four different games including \"Tag Team\" matches that pit individual fighters in lethal head-to-head combat. The popular \"Team Battle System\" which lets players create their own three-person fighting unit returns for this sequel. At any given time, one warrior will be engaged in battle, while the other two are recuperating; restoring their Life Meters and Musou Gauges. Warriors Orochi 2 features an overwhelming lineup of over 90 playable characters from both franchises including Samurai Warriors 2 Extreme Legends, plus new characters from Chinese and Japanese history. [Koei]… Expand"}, {"name": "Big Beach Sports", "details_link": "https://www.metacritic.com/game/wii/big-beach-sports", "publisher": "THQ", "release_date": "Jun 24 2008", "developers": ["HB Studios Multimedia"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General"], "meta_score": 44, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/b3d0d0a3c24b6712aa6374381e327e6d-98.jpg", "descriptions": "Big Beach Sports drops players into a seaside resort setting where up to four players can compete in sports including volleyball, soccer, American football, bocce, disc golf and cricket. The single player tournament structure encourages players to master each sport through the use ofBig Beach Sports drops players into a seaside resort setting where up to four players can compete in sports including volleyball, soccer, American football, bocce, disc golf and cricket. The single player tournament structure encourages players to master each sport through the use of creative control combinations and real-life sport motions. [THQ]… Expand"}, {"name": "The Sacred Rings", "details_link": "https://www.metacritic.com/game/pc/the-sacred-rings", "publisher": "The Adventure Company", "release_date": "Mar  7 2007", "developers": ["Streko-Graphics Inc."], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "First-Person", "Fantasy"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/d0edaece6e41b551aedd09294aa1160f-98.jpg", "descriptions": "Since ancient times, a clan of Keepers has guarded a collection of sacred rings that, when united with several hidden artifacts, grant the holder infinite power and immortality. When a rival clan, led by Durad, makes known its intention to obtain this power for an evil purpose, the KeepersSince ancient times, a clan of Keepers has guarded a collection of sacred rings that, when united with several hidden artifacts, grant the holder infinite power and immortality. When a rival clan, led by Durad, makes known its intention to obtain this power for an evil purpose, the Keepers send their prized student to uncover the artifacts and deliver them, along with the rings, to Grifit, the Old Master. Umang's journey leads him to the portal of a world unknown even to the powerful Keepers. In The Sacred Rings, the portal transports Umang to Manula Valley and a series of truths are revealed. To his dismay, Umang discovers that this world was once inhabited by the Keepers, hundreds of years ago, until it was taken from them by Durad and his clan. More disturbing, it is revealed that Umang's arrival in Manula Valley is just one more step in a plot manipulated by Durad to bring Umang and the rings one step closer to evil. He must now outwit Durad's powerful forces to complete his quest and return the sacred rings to his clan. [Adventure Company]… Expand"}, {"name": "Transformers: Rise of the Dark Spark", "details_link": "https://www.metacritic.com/game/xbox-360/transformers-rise-of-the-dark-spark", "publisher": "Activision", "release_date": "Jun 24 2014", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox One", "Xbox 360"], "genres": ["Action Adventure", "Sci-Fi", "General"], "meta_score": 44, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/dcb668078b94fd194c454d6490be55a1-98.jpg", "descriptions": "Fight your way through both Earth and Cybertron universes in an unforgettable battle to secure the Dark Spark. Play the expanded four-player co-op online escalation mode with new upgradeable defenses and challenging Power Foes. The new leveling system spans campaign and escalation, allowingFight your way through both Earth and Cybertron universes in an unforgettable battle to secure the Dark Spark. Play the expanded four-player co-op online escalation mode with new upgradeable defenses and challenging Power Foes. The new leveling system spans campaign and escalation, allowing players to unlock rewards that will aid progression in both modes.… Expand"}, {"name": "Tetris Worlds", "details_link": "https://www.metacritic.com/game/playstation-2/tetris-worlds", "publisher": "THQ", "release_date": "Mar 20 2002", "developers": ["Blue Planet Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Stacking"], "meta_score": 44, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/0479880197f9b00b1de601cef0a19667-98.jpg", "descriptions": "Features six variations of Tetris gameplay, including the all new Hot-Line Tetris, Cascade Tetris and Fusion Tetris. Play Tetris in six different worlds, each evolving as you clear levels. Multi-player game lets up to four players see who can clear levels the fastest. [THQ]"}, {"name": "NFL QB Club 2001", "details_link": "https://www.metacritic.com/game/dreamcast/nfl-qb-club-2001", "publisher": "Acclaim", "release_date": "Jul 30 2000", "developers": ["High Voltage Software"], "platforms": "Dreamcast", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/53e456cdaeae88fde523d14470b3739a-98.jpg", "descriptions": "It's clear that NFL QB Club 2001 is trying to play catch up with Sega's NFL 2K series, and the way things stand, QB Club still has a lot of cleaning up to do before it can smell as rosy fresh as Sega's superior offerings."}, {"name": "Q*bert: Rebooted", "details_link": "https://www.metacritic.com/game/playstation-4/qbert-rebooted", "publisher": "LOOT Entertainment", "release_date": "Feb 17 2015", "developers": ["LOOT Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Arcade"], "meta_score": 44, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/4671dd2e3a19721afcb2edff6f56ba28-98.jpg", "descriptions": "Q*bert is Back @!?@!\r One of the most critically acclaimed and commercially successful arcade games of the 1980s is back in its classic pixel perfect 2D form, and a re-imagined Rebooted version with state of the art 3D game-play and graphics that remain faithful to the original concept.Q*bert is Back @!?@!\r One of the most critically acclaimed and commercially successful arcade games of the 1980s is back in its classic pixel perfect 2D form, and a re-imagined Rebooted version with state of the art 3D game-play and graphics that remain faithful to the original concept. Now optimized for PS3, PS4 and 'PS VITA', both versions are exciting twitch games requiring keen puzzle solving skills and logic\r First introduced in 1982 by Gottlieb, Q*bert was critically-acclaimed and went on to become one of the most successful arcade game of all time (behind Pac-Man and Donkey Kong). It inspired home versions of cabinets, a variety of Q*bert merchandise, numerous copycat games and even an animated TV series.\r Q*bert Classic stays true to the original in all its jagged 2D pixel art glory, now optimized for PS3, PS4 and PS VITA. As the title grawlix spewing character, players jump around an isometric cube pyramid and convert each blocks color while avoiding familiar adversaries Coily, Ugg, Slick, Sam, Wrong Way and Red Ball. Levels become progressively harder with more enemies blocking your path and the tiles requiring multiple jumps to change to the required color.\r Q*bert Rebooted takes the arcade classic and catapults it into the 21st century 3D game play that takes full advantage of todays technologies yet remains faithful to the original Q*bert. Featuring hexagonal blocks instead of squares, Q*bert Rebooted introduces new enemies, playable characters, power-ups, traps, gem collecting, multiple characters, downloadable content and new ways to play.\r -Level Select  replay all previously unlocked levels and track progress against friends\r-New Playable Characters  introducing Q*zard, Q*bertha, Q*bot, Q*zilla, Q*tee, Q*knight and Q*nicorn, all based on the original Q*bert form\r-3 New Enemies  the classic cast of adversaries are joined by new enemies Homer, Uppercut and Treasure Chest… Expand"}, {"name": "Risen 3: Titan Lords", "details_link": "https://www.metacritic.com/game/xbox-360/risen-3-titan-lords", "publisher": "Deep Silver", "release_date": "Aug 12 2014", "developers": ["Piranha Bytes"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 44, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/1/b1314bbbb80d6671ef131deca575767b-98.jpg", "descriptions": "Risen 3: Titan Lords draws the player in to a hand-crafted role-playing world where every decision alters the events of the story."}, {"name": "Army Men: Sarge's War", "details_link": "https://www.metacritic.com/game/xbox/army-men-sarges-war", "publisher": "Global Star Software", "release_date": "Aug  2 2004", "developers": ["Tactical Development"], "platforms": ["PC", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/28769c8a1e0ca60fbd213d58a98590e4-98.jpg", "descriptions": "A new enemy, Colonel Malice, threatens the very existence of the Green nation. Now, with his squad destroyed, Sarge becomes a one-man army out to stop Colonel Malice and the Tan army at all costs. Guide Sarge through 12 dangerous levels, which span both the real world and the world of toys.A new enemy, Colonel Malice, threatens the very existence of the Green nation. Now, with his squad destroyed, Sarge becomes a one-man army out to stop Colonel Malice and the Tan army at all costs. Guide Sarge through 12 dangerous levels, which span both the real world and the world of toys. Sarge can wield authentic weapons such as assault rifles, shotguns, bazookas, time bombs, and more. Be careful--enemies can now duck, cover, flank your positions, and generally try to kill you as intensely as you try to kill them.… Expand"}, {"name": "Pac-Man World 3", "details_link": "https://www.metacritic.com/game/ds/pac-man-world-3", "publisher": "Namco", "release_date": "Dec  7 2005", "developers": ["Blitz Games", "Human Soft"], "platforms": ["PC", "PlayStation 2", "DS"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 44, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/1da9e82a38a825bd7c4850ecc3beff48-98.jpg", "descriptions": "Help Pac-Man uncover Erwin's evil plot and save the real world from the collapsing Spectral world. Fortunately, Pac-Man is not alone this time - Pinky and Clyde, the classic Ghosts, will help him along his journey. Pac-Man World 3 will have an arsenal of power-ups that will let Pac-Man beHelp Pac-Man uncover Erwin's evil plot and save the real world from the collapsing Spectral world. Fortunately, Pac-Man is not alone this time - Pinky and Clyde, the classic Ghosts, will help him along his journey. Pac-Man World 3 will have an arsenal of power-ups that will let Pac-Man be victorious and save everybody from Erwin's evil plans.… Expand"}, {"name": "The Uncertain: Light at the End", "details_link": "https://www.metacritic.com/game/pc/the-uncertain-light-at-the-end", "publisher": "ComonGames", "release_date": "Oct  8 2020", "developers": ["ComonGames"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 44, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/61168449b2e55b27ebcde0d9e20d7f1b-98.jpg", "descriptions": "You are afraid. You are forced to constantly hide. Those who just recently served you, turned against you, started hunting you. Your friends and family have been kidnapped. You do not know where they are or what has become of them. And there is nothing you can do about it. You can only hideYou are afraid. You are forced to constantly hide. Those who just recently served you, turned against you, started hunting you. Your friends and family have been kidnapped. You do not know where they are or what has become of them. And there is nothing you can do about it. You can only hide and survive, without hope, not understanding why this is happening. You are outcasted, outlawed. You are human.The Uncertain is an story-driven adventure game by ComonGames studio set in a post-apocalyptic world. Humanity disappeared from the face of the Earth and has been replaced by robots. In the first game The Uncertain : Last Quiet Day the main protagonist was an inventor robot RT, who finds himself among a small group of robots, trying to help surviving humans. In the second game The Uncertain: Light At The End we will see this post apocalyptic world through the eyes of one of the survivors: a girl named Emily. Together with her, the player has to find out the cause for humanity's disappearance: was it a rogue AI or something else entirely?… Expand"}, {"name": "Combat of Giants: Dinosaurs 3D", "details_link": "https://www.metacritic.com/game/3ds/combat-of-giants-dinosaurs-3d", "publisher": "Ubisoft", "release_date": "Mar 27 2011", "developers": ["Ubisoft"], "platforms": "3DS", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 44, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/03aa2cd765831d742e8aeeb5ae6b17f6-98.jpg", "descriptions": "150 million years ago, Nature's fury was unleashed, forcing Dinosaurs to fight for their survival. Dive into spectacular battles and deal powerful blows to your worst enemies. Master your fierce dinosaur and rule the cataclysmic Jurassic world!"}, {"name": "Husk", "details_link": "https://www.metacritic.com/game/pc/husk", "publisher": "IMGN.PRO", "release_date": "Feb  3 2017", "developers": ["UndeadScout"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 44, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/4/6680e44e944b066b98994cdce26d89cc-98.jpg", "descriptions": "Husk is a purebred FPP horror inspired by the most classical representatives of the genre. Discover Shivercliff - a daunting town where you uncover the ominous and tantalizing plot. Face the worst nightmares, solve mysteries and survive the devouring darkness in order to find your family."}, {"name": "Naughty Bear: Panic in Paradise", "details_link": "https://www.metacritic.com/game/playstation-3/naughty-bear-panic-in-paradise", "publisher": "505 Games", "release_date": "Oct  8 2012", "developers": ["Behaviour Interactive"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "General", "General"], "meta_score": 44, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/9d34e2f8de8d72f24e2fb20261d66bfa-98.jpg", "descriptions": "Naughty Bear 2 is a follow-up to 2010's surreal action game."}, {"name": "Johnny Kung Fu", "details_link": "https://www.metacritic.com/game/3ds/johnny-kung-fu", "publisher": "UFO Interactive", "release_date": "Jul 12 2012", "developers": ["UFO Interactive"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 44, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/7/5894cf54aedf73774e84fdda3d6c8a5f-98.jpg", "descriptions": "Johnny Kung Fu is an old school action game that fuses gameplay styles from different time periods."}, {"name": "FunTown Mahjong", "details_link": "https://www.metacritic.com/game/xbox-360/funtown-mahjong", "publisher": "Microsoft Game Studios", "release_date": "Jan 28 2009", "developers": ["FunTown World Limited"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Board / Card Game", "Matching"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/8095faf07a9f8ac07b0bfdb819d94b43-98.jpg", "descriptions": "[Xbox Live Arcade]  FunTown Mahjong brings the traditional Chinese board game to Xbox 360, with a well-balanced design and unique style that is sure to keep you coming back for more. Play against friends over Xbox LIVE, or take on the challenge of the A.I. opponents. With a tutorial for new[Xbox Live Arcade]  FunTown Mahjong brings the traditional Chinese board game to Xbox 360, with a well-balanced design and unique style that is sure to keep you coming back for more. Play against friends over Xbox LIVE, or take on the challenge of the A.I. opponents. With a tutorial for new players and featuring the 16-tile Mahjong rule set, FunTown Mahjong is great for Mahjong players of all experience levels. Get ready, you'll need strategy, wisdom, and luck to win! [FunTown World Limited]… Expand"}, {"name": "Crash Time: Autobahn Pursuit", "details_link": "https://www.metacritic.com/game/xbox-360/crash-time-autobahn-pursuit", "publisher": "Crave", "release_date": "Aug  5 2008", "developers": ["Synetic"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 44, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/2ac948669880d4615476675a985dd28c-98.jpg", "descriptions": "Fans of arcade-racing-action watch out, Crash Time hits the fast lane. Daring stunts, spectacular crashes, thrilling criminal cases: All fans of the racing genre will easily fall in love with the newest creation of Synetic – the well-known specialists for furious racing-games. VariousFans of arcade-racing-action watch out, Crash Time hits the fast lane. Daring stunts, spectacular crashes, thrilling criminal cases: All fans of the racing genre will easily fall in love with the newest creation of Synetic – the well-known specialists for furious racing-games. Various exciting cases await the player as part of the \"Cobra 11\" police force. Solving them requires several diverse missions to be successfully completed: Be it helicopter chases, jumps across moving trains or reconnaissance runs in tanks – top-notch entertainment is here. The debut of this brand-new racing-franchise is not short of daring stunts and spectacular crashes either. Unpredictable missions free from set tracks and opponents who seek their own escape routes thanks to the artificial intelligence make the racing both dynamic and authentic, and will not only delight racing aficionados. Truly extensive scenarios complete with highways, country roads and city streets add to variety and gaming fun, and no limits are set to the players' exploration of the environments and their secrets.… Expand"}, {"name": "Godzilla: Unleashed", "details_link": "https://www.metacritic.com/game/wii/godzilla-unleashed", "publisher": "Atari", "release_date": "Dec  5 2007", "developers": ["Pipeworks Software", "Inc."], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Sci-Fi", "Fighting", "General", "3D"], "meta_score": 44, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/b6292dd7dcddd204c9e8a324271b2111-98.jpg", "descriptions": "Godzilla: Unleashed is a fighting game on a giant scale. The game stars the legendary Godzilla and a slew of the most renowned monsters of all-time. Gamers are challenged to ultimately save the planet from mayhem and destruction. Set in urban arenas, Godzilla: Unleashed's interactive 3DGodzilla: Unleashed is a fighting game on a giant scale. The game stars the legendary Godzilla and a slew of the most renowned monsters of all-time. Gamers are challenged to ultimately save the planet from mayhem and destruction. Set in urban arenas, Godzilla: Unleashed's interactive 3D cityscapes, big destructible buildings, soaring skyscrapers and towering alien formations provide the backdrop to epic worldwide destruction. Players claw, kick, stomp, throw and blast their way through the streets of major world cities in order to claim the ultimate, beastly title: King of the Monsters. In addition to a fully reinvented combat system, Godzilla: Unleashed features an innovative non-linear storyline which allows players to influence how the story unfolds through their choices within battles. [Atari]… Expand"}, {"name": "Beowulf: The Game", "details_link": "https://www.metacritic.com/game/pc/beowulf-the-game", "publisher": "Ubisoft", "release_date": "Nov 13 2007", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 44, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/1c022c9299bc2d792d7b233314bd6e2a-98.jpg", "descriptions": "Gamers live the life of Beowulf, the legendary Norse warrior with the strength of 30 men who is torn between the nobility and brutality within him. Arrogant, self-serving and lustful for gold and glory, Beowulf journeys to Denmark to destroy a bloodthirsty beast wreaking havoc on a frigidGamers live the life of Beowulf, the legendary Norse warrior with the strength of 30 men who is torn between the nobility and brutality within him. Arrogant, self-serving and lustful for gold and glory, Beowulf journeys to Denmark to destroy a bloodthirsty beast wreaking havoc on a frigid land. But evil persists, and Beowulf succumbs to its lure of even greater fame, quietly maneuvering to claim the Danish throne. As King, Beowulf must face the consequences of ambition, even as war descends on the realm. As Beowulf, players lead their men, called thanes, into battle, slay the Titans of a dying age and crush the enemies that threaten to annihilate both their kingdom and people. Only then, when Beowulf looks Destiny in the eye, will he know what kind of hero he has truly become. Army of up to 12 thanes to unlock as players increase their heroic experience (by saving thanes, killing giant monsters, etc.). Players use the thane army to their advantage by giving orders, assigning positions, tailoring weapons to the situation or enemy and by triggering in-game mechanisms. The thane army evolves with upgradeable weapons (swords, mace and spears), skills and abilities. Use legacy experience points to gain thanes, replace weapons and upgrade Carnal abilities. Carnal Power allows the use of stronger attacks and special weapons. Carnal upgrades include less daze after use and prolonged use of Carnal Fury. But if used too much, there will be grave consequences. Dynamic combat system including combos, parries and increasing skills as the player progresses. Grab ability allows Beowulf to hold on to walls or climb, as well as fight up close with visceral hand-to-hand combat against enemies and giant monsters. [Ubisoft]… Expand"}, {"name": "NeverEnd (2006)", "details_link": "https://www.metacritic.com/game/pc/neverend-2006", "publisher": "DreamCatcher Interactive", "release_date": "Oct  2 2006", "developers": ["Mayhem Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 44, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/1/237d43e275b82028810577c3ebd5ad9a-98.jpg", "descriptions": "Neverend is a fantasy RPG game in the style of Final Fantasy that takes you to a world of fairies and knights. You will control a fallen fairy Agavaen and guide her on her mysterious path. Gradually, you will uncover the game-world and besides improving your skills you will be able also toNeverend is a fantasy RPG game in the style of Final Fantasy that takes you to a world of fairies and knights. You will control a fallen fairy Agavaen and guide her on her mysterious path. Gradually, you will uncover the game-world and besides improving your skills you will be able also to create your own spells and influence the fairy's persuasion. It is the persuasion that determines whether Agavean ends up as a good or evil fairy and which determines the storyline branching. These branches lead, of course, to different game endings. [Mayhem]… Expand"}, {"name": "Jonny Moseley Mad Trix", "details_link": "https://www.metacritic.com/game/playstation-2/jonny-moseley-mad-trix", "publisher": "3DO", "release_date": "Dec 26 2001", "developers": ["3DO"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 44, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/fff710459b4a3a21ee84a57521f6c7c0-98.jpg", "descriptions": "Show off your new school skiing tricks in Slopestyle mode and unlock Big Mountain mode to star in a ski movie! Then get heli-dropped onto a mountaintop, and pull insane grabs off snow-capped cottages, trains and more. Even use the Alaskan pipeline as a half-pipe. [3DO]"}, {"name": "Street Trace: NYC", "details_link": "https://www.metacritic.com/game/xbox-360/street-trace-nyc", "publisher": "Gaia Industries", "release_date": "Aug 22 2007", "developers": ["Gaia Industries"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 44, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/7aab501b5666a503e173d7b5659ba955-98.jpg", "descriptions": "[Xbox Live Arcade]  Grab a custom hover-board and lay trail across the urban sprawl, racing through abandoned streets and battling in war-torn arenas. It is an adrenaline pumping action game that combines both arena combat and racing. Meet the cast of rebel Tracers and trick-out your board[Xbox Live Arcade]  Grab a custom hover-board and lay trail across the urban sprawl, racing through abandoned streets and battling in war-torn arenas. It is an adrenaline pumping action game that combines both arena combat and racing. Meet the cast of rebel Tracers and trick-out your board and weapon through cash and pickup tournaments. Then race, shoot, and grind your way to victory, taking on the circuit champions in single player mode or compete in split screen multiplayer with friends [up to 4 players]. Take it to the next level and go live, competing against 7 fellow Tracers from around the world. Gain ranking supremacy across a range of over 40 leader boards. [Gaia Industries]… Expand"}, {"name": "Tom Clancy's Ghost Recon Advanced Warfighter", "details_link": "https://www.metacritic.com/game/playstation-2/tom-clancys-ghost-recon-advanced-warfighter", "publisher": "Ubisoft", "release_date": "Mar 28 2006", "developers": ["Ubisoft Shanghai"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 44, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/8/f186ce43779e3e3538f2d5f636d6800a-98.jpg", "descriptions": "In 2013, the U.S. Army will implement the Integrated Warfighter System (IWS), evolving what we know as the modern soldier. IWS combines advanced weapon systems, satellite communication devices and enhanced survivability into one fully integrated combat system. The IWS program has beenIn 2013, the U.S. Army will implement the Integrated Warfighter System (IWS), evolving what we know as the modern soldier. IWS combines advanced weapon systems, satellite communication devices and enhanced survivability into one fully integrated combat system. The IWS program has been developed to meet these new threats head on. Now, it can be tested on the battlefield. Following an insurgence in the heart of Mexico City, the U.S. Army's most elite Special Forces team is deployed to the center of the conflict to regain control of the city. Greatly outnumbered but fully equipped with the IWS, this elite team is the first and last line of defense on the battlefield. They are the \"Quiet\" professionals. They are the Ghosts. Gain access to the future of military technology. Using a fully integrated combat system with cutting-edge weapons and revolutionary communication systems, gamers embody the soldier of the future. Based on actual U.S. Army research, the Ghosts give gamers a realistic view of how war will be fought in the next decade. Use the revolutionary Cross-Com, a communication device powered by satellite technology. Attached to the soldier's monocle, the Cross-Com provides full situational awareness and command of the battlefield. Command the Ghost squad and remote allied forces and drones, and direct artillery and air strikes. See what the squad sees and receive visual and auditory intel from allied forces and unmanned drones. [Ubisoft]… Expand"}, {"name": "Harmonix Music VR", "details_link": "https://www.metacritic.com/game/playstation-4/harmonix-music-vr", "publisher": "Harmonix Music Systems", "release_date": "Oct 10 2016", "developers": ["Harmonix Music Systems"], "platforms": "PlayStation 4", "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 44, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/2d7eed3ff7b22d22e9ba2d6153920d4b-98.jpg", "descriptions": "From a wacky dance party, to 3D reactive art, and even a nice relaxing alien beach, Harmonix Music VR promises to be the next evolution of your music library."}, {"name": "COPS 2170 The Power of Law", "details_link": "https://www.metacritic.com/game/pc/cops-2170-the-power-of-law", "publisher": "GFI", "release_date": "Jun 10 2022", "developers": ["GFI"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 0, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/2325ac3dd0661a5f40d038b9a1cd9a5e-98.jpg", "descriptions": null}, {"name": "C.O.R.E.", "details_link": "https://www.metacritic.com/game/ds/core", "publisher": "Graffiti Entertainment", "release_date": "Aug 11 2009", "developers": ["NoWay Studio"], "platforms": "DS", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 44, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/c91033a7817538ac2717e00d1ca952c7-98.jpg", "descriptions": "In the single player mission a meteor has crashed into the Earth. The largest single impact on the earth in a millennium is being investigated by the government at a special research facility (C.O.R.E) built alongside impact site. For 20 years the scientists have been drilling into the EarthIn the single player mission a meteor has crashed into the Earth. The largest single impact on the earth in a millennium is being investigated by the government at a special research facility (C.O.R.E) built alongside impact site. For 20 years the scientists have been drilling into the Earth trying to reach the centre of the meteor and unlock its secrets. Just recently a news blackout was declared for the site and rumours started of an incredible find. Suddenly all communication with the base was lost. With no information on what might have happened and a new strange radiation emanating from the site a special forces team is needed to investigate, your mission as part of that team is to find the answers. 20 different enemies ranging from insane marines and mad scientists to big deadly mutants. A plethora of secret rooms and special quests. Choose among 8 types of weapons, including: blaster, shotgun, plasma gun or rocket launcher. Alternative firing modes for some weapons. 10 different multiplayer arenas. Capture the flag, team arena and death match. Up to 4 player multiplayer. [NoWay Studio]… Expand"}, {"name": "Oddworld: Munch's Oddysee", "details_link": "https://www.metacritic.com/game/game-boy-advance/oddworld-munchs-oddysee", "publisher": "THQ", "release_date": "Sep 24 2003", "developers": ["Art"], "platforms": ["iPhone/iPad", "PC", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 44, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/8/5b13b14d602a2f328717b121d58f17d2-98.jpg", "descriptions": "Munch, the Gabbit with \"odditude,\" and his sidekick Abe lead an off-beat revolution to save the world.  With their sacred land in jeopardy of being destroyed by the greedy Glukkons, Munch and Abe team up to teach those rascals a lesson by using their chanting prowess to control theMunch, the Gabbit with \"odditude,\" and his sidekick Abe lead an off-beat revolution to save the world.  With their sacred land in jeopardy of being destroyed by the greedy Glukkons, Munch and Abe team up to teach those rascals a lesson by using their chanting prowess to control the enemy, arming themselves with wacky weapons, and acquiring power-ups for extra boosts.  You can switch between Munch and Abe at anytime to utilize each character's unique abilities and access certain areas.… Expand"}, {"name": "Dragonriders: Chronicles of Pern", "details_link": "https://www.metacritic.com/game/pc/dragonriders-chronicles-of-pern", "publisher": "Red Storm Entertainment", "release_date": "Aug 13 2001", "developers": ["Ubisoft"], "platforms": "PC", "genres": ["Role-Playing", "Adventure", "General", "General"], "meta_score": 44, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/6729c8becfa69d07892e5bc1b42bcf7b-98.jpg", "descriptions": "For centuries, the dragons of Pern and their riders have protected their world from the alien oppressor, Thread. Mightiest among the dragons are the Gold Dragons, and their riders, the Weyrwomen ? crusading for the free people of Pern. But now your Weyrwoman is dead, and her gold dragon isFor centuries, the dragons of Pern and their riders have protected their world from the alien oppressor, Thread. Mightiest among the dragons are the Gold Dragons, and their riders, the Weyrwomen ? crusading for the free people of Pern. But now your Weyrwoman is dead, and her gold dragon is dying. Unless you can find a new rider to take up her mantle, your weyr ? and perhaps all of Pern ? is doomed.  [Ubi Soft]… Expand"}, {"name": "Iron Man", "details_link": "https://www.metacritic.com/game/psp/iron-man", "publisher": "Sega", "release_date": "May  2 2008", "developers": ["Artificial Mind and Movement"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 44, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/5616a440cc82ee7ff66a3142367e4423-98.jpg", "descriptions": "Iron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in IronIron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in Iron Man's suits of armour, gamers can take advantage of the wide array of high-impact weapons to strategically annihilate any enemy force standing in their way. Before tackling stunning and immense open battlefields, players can customise their armour suit as they encounter progressively more vicious enemies, and fight in epic battles that could challenge even the toughest Super Heroes. [Sega]… Expand"}, {"name": "Yu-Gi-Oh! The Falsebound Kingdom", "details_link": "https://www.metacritic.com/game/gamecube/yu-gi-oh!-the-falsebound-kingdom", "publisher": "Konami", "release_date": "Nov  4 2003", "developers": ["Konami"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Fantasy"], "meta_score": 44, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/08270580be926209fd69eec528ee05c0-98.jpg", "descriptions": "Yugi and his friends are trapped in a virtual reality world gone crazy.  As Yugi or Kaiba, you must form a team of three monsters to occupy towns across two different scenarios and take part in strategic team battles.  Delegate commands to your team to conquer each mission.  During battle,Yugi and his friends are trapped in a virtual reality world gone crazy.  As Yugi or Kaiba, you must form a team of three monsters to occupy towns across two different scenarios and take part in strategic team battles.  Delegate commands to your team to conquer each mission.  During battle, your team can perform devastating group attacks and combos.  Over 175 monsters from the Yu-Gi-Oh! animated TV series appear in the game--and all of them will fight to the finish for control of each map. … Expand"}, {"name": "Mike Tyson Boxing", "details_link": "https://www.metacritic.com/game/game-boy-advance/mike-tyson-boxing", "publisher": "Ubisoft", "release_date": "Mar  6 2002", "developers": ["Virtucraft"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/e331d1c46a774ae7cd5703f94412e13f-98.jpg", "descriptions": "The 2-time undisputed world champ isn't about to let you go the distance. In fact, he's planning to do some serious damage to your face on the Game Boy® Advance system. Get up-close and personal with every one of Tyson's rib-crunching body shots, brain-rattling roundhouses, andThe 2-time undisputed world champ isn't about to let you go the distance. In fact, he's planning to do some serious damage to your face on the Game Boy® Advance system. Get up-close and personal with every one of Tyson's rib-crunching body shots, brain-rattling roundhouses, and jaw-bustin' uppercuts!… Expand"}, {"name": "Mike Tyson Boxing", "details_link": "https://www.metacritic.com/game/playstation/mike-tyson-boxing", "publisher": "Codemasters", "release_date": "Oct 23 2000", "developers": ["Codemasters"], "platforms": "PlayStation", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/1da96aa5c7092f4594e1369ab3204076-98.jpg", "descriptions": "Mike Tyson's Boxing just doesn't have the depth of Knockout Kings or the immediate satisfaction found from the arcade style of play in Ready 2 Rumble."}, {"name": "TotemBall", "details_link": "https://www.metacritic.com/game/xbox-360/totemball", "publisher": "Freeverse Software", "release_date": "Oct  4 2006", "developers": ["Strange Flavour"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 44, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/9/69d176f774da938c074a820785fde9b7-98.jpg", "descriptions": "[Xbox Live Arcade]  The members of the ancient Ptolmec tribe compose striking and innovative music in TotemBall. When they simultaneously discover gunpowder and barbeque, the explosive results scatter their musical totems across the breadth of the jungle. Now Pterry the Pturtle must roll[Xbox Live Arcade]  The members of the ancient Ptolmec tribe compose striking and innovative music in TotemBall. When they simultaneously discover gunpowder and barbeque, the explosive results scatter their musical totems across the breadth of the jungle. Now Pterry the Pturtle must roll across mountains, islands, bridges, and through giant pinball games to retrieve the lost totems and bring the groovy Ptolmec music back to the party. Using your Xbox Live Vision camera, help Pterry recover all the musical totems while moving to the totem beat. Join in with a friend to juggle your totem collection using the camera and a controller. Use Free Play mode to practice and explore environments without affecting your progress. Sway to the sounds of the music generated in-game by you!  [Microsoft]… Expand"}, {"name": "Hellboy: The Science of Evil", "details_link": "https://www.metacritic.com/game/xbox-360/hellboy-the-science-of-evil", "publisher": "Konami", "release_date": "Jun 24 2008", "developers": ["Krome Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "Beat-'Em-Up", "Linear"], "meta_score": 44, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/3/ba395d7b43e1dcd3a7fd6fc236ea8926-98.jpg", "descriptions": "Hellboy provides players with fresh adventures featuring the acclaimed comic book's unmistakable fusion of action, atmosphere and humor. On the trail of a crazed witch, Hellboy uncovers a Nazi plot for world domination and must rush to defeat the crazed Hermann Von Klempt before he can exertHellboy provides players with fresh adventures featuring the acclaimed comic book's unmistakable fusion of action, atmosphere and humor. On the trail of a crazed witch, Hellboy uncovers a Nazi plot for world domination and must rush to defeat the crazed Hermann Von Klempt before he can exert his evil will upon a hapless world. As a visceral brawler, the game lets players unleash Hellboy's superhuman abilities as they smash their way through hordes of enemies with contextual use of the environment for added destructive power and strategy. An original storyline set in the Hellboy universe, filled with classic characters from the comic book. Explosive battle system with contextual grappling commands lets players experience Hellboy's supernatural might as he unleashes the Right Hand of Doom on his enemies. Use strategy to take down hordes of enemies - toss a straggler into the crowd or manipulate the environment to create more manageable groups of enemies. Play as series favorites Abe Sapein and Liz Sherman in cooperative multiplayer modes. [Konami]… Expand"}, {"name": "Vaccine", "details_link": "https://www.metacritic.com/game/switch/vaccine", "publisher": "Rainy Frog", "release_date": "Jul  6 2017", "developers": ["Rainy Night Creations"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 44, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/4/c8d42e6651de044472111804b3617595-98.jpg", "descriptions": "Find a vaccine for your infected friend before the time runs out, but be aware your friend will relapse sooner or later and you will have to find a new vaccine in a new randomly rebuilt house. Will you be able uncover the mystery to save your friend once and for all!?\r Vaccine is a newFind a vaccine for your infected friend before the time runs out, but be aware your friend will relapse sooner or later and you will have to find a new vaccine in a new randomly rebuilt house. Will you be able uncover the mystery to save your friend once and for all!?\r Vaccine is a new approach on Survival Horrors inspired by those of the 90s. You can choose between the two members of a special bio-hazard rapid response team, each starting with their own unique differential abilities. They are trapped in a strange house populated by dangerous mutated creatures, they will have to find a vaccine for another team member who is infected with a deadly virus.\r Unless you uncover the mystery of the house, every time you bring back the vaccine, the infected team member will relapse and you will be presented with a new randomly rebuilt house. You will be able to gain experience points from different actions and use them on the skills you think will be more beneficial, bringing a more tactical approach compared to the games it takes inspiration from.… Expand"}, {"name": "Cortex Command", "details_link": "https://www.metacritic.com/game/pc/cortex-command", "publisher": "Data Realms", "release_date": "Sep 28 2012", "developers": ["Data Realms"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "Platformer", "Platformer", "2D", "2D", "Command"], "meta_score": 44, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/f9790e15a72ce0d9a26f23887d38e919-98.jpg", "descriptions": "Mine precious gold from the deformable pixel terrain in order to buy more and better ships, soldiers, weapons, digging tools, and deployable defenses. Use these assets to defend your disembodied brain and bankrupt your opponent! Old-school 2D sidescroller pixel graphics coupled with anMine precious gold from the deformable pixel terrain in order to buy more and better ships, soldiers, weapons, digging tools, and deployable defenses. Use these assets to defend your disembodied brain and bankrupt your opponent! Old-school 2D sidescroller pixel graphics coupled with an extremely detailed physics simulation makes for a mix of nostalgia and surprising gameplay. … Expand"}, {"name": "NPPL Championship Paintball 2009", "details_link": "https://www.metacritic.com/game/xbox-360/nppl-championship-paintball-2009", "publisher": "Activision", "release_date": "Nov 25 2008", "developers": ["FUN Labs"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 14 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 44, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/6378c67a30b52b849aa2d2ddf576e41e-98.jpg", "descriptions": "The intensity of first-person-shooters and extreme sports collide in NPPL's Championship Paintball 2009. Feel the adrenaline of intense tournament and woodsball action as you take your game to the next level. Features over 35 tournaments including official NPPL and Millennium field locationsThe intensity of first-person-shooters and extreme sports collide in NPPL's Championship Paintball 2009. Feel the adrenaline of intense tournament and woodsball action as you take your game to the next level. Features over 35 tournaments including official NPPL and Millennium field locations and layouts; Huntington Beach, Commander's Cup, Toulouse, Malaga, and more; Plus intense woodsball levels; Includes Career, Quickplay, Multiplayer, Tutorial, and Training modes; Over 110+ pieces of officially licensed gear; JT Sports, Tippmann, Spyder, Smart Parts and many others! 3-D modeled using same technology used for Call of Duty weaponry. Upgradeable and unlockable markers, barrels, hoppers and protective gear. [Activision]… Expand"}, {"name": "Iron Man", "details_link": "https://www.metacritic.com/game/wii/iron-man", "publisher": "Sega", "release_date": "May  2 2008", "developers": ["Artificial Mind and Movement"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 44, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/827b09a86739b06d72b130b37446fda7-98.jpg", "descriptions": "Iron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in IronIron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in Iron Man's suits of armour, gamers can take advantage of the wide array of high-impact weapons to strategically annihilate any enemy force standing in their way. Before tackling stunning and immense open battlefields, players can customise their armour suit as they encounter progressively more vicious enemies, and fight in epic battles that could challenge even the toughest Super Heroes. [Sega]… Expand"}, {"name": "Black Stone: Magic & Steel", "details_link": "https://www.metacritic.com/game/xbox/black-stone-magic-steel", "publisher": "Xicat Interactive", "release_date": "Mar 19 2003", "developers": ["Xpec"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 44, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/089f044e5ff7d80aa4550f8d7591469d-98.jpg", "descriptions": "The protectors of good are ready to destroy all that is evil! Battle against the Dark Lord in an effort to save the world of Zedan. With 20 different characters, 26 levels, four-player gameplay, and non-stop, hack-and-slash action, Black Stone: Magic and Steel is the must-have action andThe protectors of good are ready to destroy all that is evil! Battle against the Dark Lord in an effort to save the world of Zedan. With 20 different characters, 26 levels, four-player gameplay, and non-stop, hack-and-slash action, Black Stone: Magic and Steel is the must-have action and roleplaying game on Xbox®!… Expand"}, {"name": "Ridge Racer", "details_link": "https://www.metacritic.com/game/playstation-vita/ridge-racer", "publisher": "Namco Bandai Games", "release_date": "Mar 13 2012", "developers": ["Namco Bandai Games", "Cellius"], "platforms": "PlayStation Vita", "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 44, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/9/1a086e487463ff74be18b19e537eb192-98.jpg", "descriptions": "Ridge Racer makes its debut on the PlayStation Vita with this installment of the racing series."}, {"name": "Battleship", "details_link": "https://www.metacritic.com/game/playstation-3/battleship", "publisher": "Activision", "release_date": "May 15 2012", "developers": ["Double Helix Games"], "platforms": ["3DS", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Shooter", "Board Games", "Shooter", "Board Games", "First-Person", "Sci-Fi", "Tactical"], "meta_score": 44, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/8/473699602144ef755758717c748bab69-98.jpg", "descriptions": "Combining naval strategy simulation with first-person shooter gameplay, players fend off the enemy beachside while ordering attacks against their marine counterparts. Seamlessly switching between battlefield and overview \"Battle Command\" map, the Hasbro game is brought to life asCombining naval strategy simulation with first-person shooter gameplay, players fend off the enemy beachside while ordering attacks against their marine counterparts. Seamlessly switching between battlefield and overview \"Battle Command\" map, the Hasbro game is brought to life as carriers, frigates, cruisers, destroyers, submarines and the legendary USS Missouri Battleship pummel the enemy in a race to strategic points that turn the tide of battle.  The Battleship videogame is a next-gen marvel perfectly suited to turn nostalgic game junkies into battle-hardened admirals.… Expand"}, {"name": "SunAge", "details_link": "https://www.metacritic.com/game/pc/sunage", "publisher": "GamersGate", "release_date": "Nov 30 2007", "developers": ["Vertex4"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Command"], "meta_score": 44, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/3bf178051f573948ad2048c67162a49a-98.jpg", "descriptions": "SunAge is a real-time strategy game where the player can experience immersive gameplay with 3 different races, each with their own arsenal of units, buildings and upgrades. The game takes place in a futuristic setting across 2 different worlds, ranging from a lush alien planet to desolateSunAge is a real-time strategy game where the player can experience immersive gameplay with 3 different races, each with their own arsenal of units, buildings and upgrades. The game takes place in a futuristic setting across 2 different worlds, ranging from a lush alien planet to desolate wastelands and through industrial cities...SunAge is upon us - the solar system is dying. With Earth teetering on the brink of extinction, human Federals and mutant-gene Raak-Zun are battling for control of its dwindling resources. Then, into this savage conflict step the mysterious Sentinel, exploiting superior technology that opens gateways to an alien and resource-rich planet. An epic clash is set to unfold, and along with it the mystery of a sinister creature that lurks at the very heart of their troubles. [Lighthouse Interactive]… Expand"}, {"name": "Submersed", "details_link": "https://www.metacritic.com/game/playstation-4/submersed", "publisher": "Factoria Cultural Gestio, S.L.", "release_date": "Jul 17 2019", "developers": ["Main Loop"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 44, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/5/0210eb0dfeaf88d23bd894fadf87be7d-98.jpg", "descriptions": "Coast Guard paramedic Jack Ballard, recently reincorporated after the death of his wife, responds to an emergency call from an offshore structure in high seas. The place seems to be abandoned, so who sent the message? Are you afraid of deep water? You will be."}, {"name": "Mindjack", "details_link": "https://www.metacritic.com/game/playstation-3/mindjack", "publisher": "Square Enix", "release_date": "Jan 18 2011", "developers": ["FeelPlus"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Sci-Fi", "Sci-Fi", "Sci-Fi", "Modern", "Arcade"], "meta_score": 44, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/3/73d2fc7e4669c93c027548759941d244-98.jpg", "descriptions": "With this unique action shooter set in 2031, Square Enix continues to expand its portfolio of video games across a wide variety of genres. Drawing upon the graphics and storytelling mastery of both Square Enix and feelplus, MINDJACK offers a distinctive experience that throws players into aWith this unique action shooter set in 2031, Square Enix continues to expand its portfolio of video games across a wide variety of genres. Drawing upon the graphics and storytelling mastery of both Square Enix and feelplus, MINDJACK offers a distinctive experience that throws players into a revolutionary playing field where an engaging solo campaign transitions seamlessly to thrilling, cooperative multiplayer gameplay.… Expand"}, {"name": "Waking", "details_link": "https://www.metacritic.com/game/pc/waking", "publisher": "tinyBuild", "release_date": "Jun 18 2020", "developers": ["Jason Oda"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 44, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/5/f9c9d113bd572fe2ef06732d31a96a47-98.jpg", "descriptions": "Combining third-person action and guided meditation, Waking is an emotional adventure through your dying mind. Battle the forces of oblivion, conjure the memories of loved ones, and join them in the fight for your life."}, {"name": "Infinity Runner", "details_link": "https://www.metacritic.com/game/xbox-one/infinity-runner", "publisher": "Wales Interactive", "release_date": "Apr 22 2015", "developers": ["Wales Interactive"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "Arcade", "3D"], "meta_score": 44, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/f446a01497fe9a49c7b3a2de44be13ed-98.jpg", "descriptions": "The Infinity is the grandest spaceship ever built by mankind; thrust into the void of space to secure humanity a new home among the stars. However, instead of discovering paradise, the inhabitants of The Infinity unlocked the door to a long-forgotten nightmare."}, {"name": "Tony Hawk Ride", "details_link": "https://www.metacritic.com/game/playstation-3/tony-hawk-ride", "publisher": "Activision", "release_date": "Nov 17 2009", "developers": ["Robomodo"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 44, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/8/034bd0f5e31c0b4ee66f858361f21582-98.jpg", "descriptions": "Players can experience skateboarding like never before in Tony Hawk: RIDE. For the first time, players have the ability to physically play the game using an innovative motion sensing skateboard controller, allowing for unprecedented freedom and movement. Tony Hawk: RIDE focuses on innovationPlayers can experience skateboarding like never before in Tony Hawk: RIDE. For the first time, players have the ability to physically play the game using an innovative motion sensing skateboard controller, allowing for unprecedented freedom and movement. Tony Hawk: RIDE focuses on innovation and fun, bringing the #1 best-selling action-sports franchise to the forefront with cutting-edge technology for the hardcore fans and accessibility for the mass audience. Tony Hawk: RIDE features a wireless skateboard controller designed in conjunction with the game to offer a dynamic gaming experience built from the ground up. Using a combination of accelerometers and motion sensors, the intuitive controller allows players to physically control the action by performing various movements and gestures on the board that directly translate into amazing tricks in the game.  Without complex button combinations or analog sticks, gamers of all skill levels can literally step on the board and play! [Activision]… Expand"}, {"name": "Combat: Task Force 121", "details_link": "https://www.metacritic.com/game/xbox/combat-task-force-121", "publisher": "Groove Games", "release_date": "Mar 27 2005", "developers": ["Direct Action Games"], "platforms": ["PC", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 44, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/da6f53c4a491660497f6a6be1ae25f35-98.jpg", "descriptions": "Terrorist acts have prompted the US government to call for the help of stronger military forces. As part of Task Force 121, you must travel to a variety of locations--such as the jungle, an oil rig, and an exotic island--to stop the terrorists before they become even more powerful. ToTerrorist acts have prompted the US government to call for the help of stronger military forces. As part of Task Force 121, you must travel to a variety of locations--such as the jungle, an oil rig, and an exotic island--to stop the terrorists before they become even more powerful. To survive, you must master military techniques and weapons, including pistols, assault rifles, grenade launchers, shotguns, sniper rifles, and more.… Expand"}, {"name": "Empire of Magic", "details_link": "https://www.metacritic.com/game/pc/empire-of-magic", "publisher": "Summitsoft Entertainment", "release_date": "Apr 30 2003", "developers": ["Mayhem Studios"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/7a004700732f939902c8d1dfc8189d56-98.jpg", "descriptions": "Empire of Magic is an unusual turn-based strategy developed by Mayhem Studios. It captures the adventures of the young mage Artemian, and the mystery he must unravel. The player becomes a witness to the fall of a mighty empire developing from the mysterious raids by undead hordes to a bloodyEmpire of Magic is an unusual turn-based strategy developed by Mayhem Studios. It captures the adventures of the young mage Artemian, and the mystery he must unravel. The player becomes a witness to the fall of a mighty empire developing from the mysterious raids by undead hordes to a bloody civil war raging within the very heart of the empire. Thanks to the extraordinary concept of Empire of Magic, it stands out against the masses of fantasy turn-based games and its genre approaches that of RPG?s. The atmosphere of a real adventure gives a new and rich dimension to the game. [Summitsoft]… Expand"}, {"name": "Evolution Skateboarding", "details_link": "https://www.metacritic.com/game/playstation-2/evolution-skateboarding", "publisher": "Konami", "release_date": "Oct  9 2002", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 44, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/54b76c9f8ba5b7a43644b286302d0555-98.jpg", "descriptions": "Say goodbye to the traditional skateboarding experience and embrace a game that will take skaters to levels never before imagined. From the neon streets of Tokyo to the dungeons of a European castle, Evolution Skateboarding enables virtual skaters to grab air and perform over 70Say goodbye to the traditional skateboarding experience and embrace a game that will take skaters to levels never before imagined. From the neon streets of Tokyo to the dungeons of a European castle, Evolution Skateboarding enables virtual skaters to grab air and perform over 70 death-defying tricks and continue the challenges with the exciting new \"Boss Skate\" mode - the first ever featured in a skateboarding game. [Konami]… Expand"}, {"name": "Salt Lake 2002", "details_link": "https://www.metacritic.com/game/pc/salt-lake-2002", "publisher": "Eidos Interactive", "release_date": "Jan 23 2002", "developers": ["Attention To Detail"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/e75c001ac5a68212be0da2e67bfe0bb0-98.jpg", "descriptions": "Fetaures 16 countries and six events (Men's Alpine Skiing Downhill, Ladies' Alpine Skiing Slalom, Men's Snowboard Parallel Giant Slalom, Women's Freestyle Skiing Aerials, Men's Ski Jumping K120 Individual, and Men's Two-man Bobsleigh ), authentic Olympic environments and competitiveFetaures 16 countries and six events (Men's Alpine Skiing Downhill, Ladies' Alpine Skiing Slalom, Men's Snowboard Parallel Giant Slalom, Women's Freestyle Skiing Aerials, Men's Ski Jumping K120 Individual, and Men's Two-man Bobsleigh ), authentic Olympic environments and competitive multi-player modes with fluid real-time animation and TV-style camera presentation creating an ultra-realistic and challenging sports gaming experience. [Eidos Interactive]… Expand"}, {"name": "Calvino Noir", "details_link": "https://www.metacritic.com/game/playstation-4/calvino-noir", "publisher": "Calvino Noir Ltd.", "release_date": "Aug 25 2015", "developers": ["Calvino Noir Ltd."], "platforms": ["iPhone/iPad", "PC", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 44, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/82e198a66474400834ff757d9b3c1742-98.jpg", "descriptions": "The film noir stealth game. Calvino Noir is the exploratory, sneaking adventure through the 1930s European criminal underworld. Architecture meets Noir as you become unwillingly entangled in a revolutionist plot. Inspired by the futuristic dystopian visions of Deus Ex and Blade Runner.The film noir stealth game. Calvino Noir is the exploratory, sneaking adventure through the 1930s European criminal underworld. Architecture meets Noir as you become unwillingly entangled in a revolutionist plot. Inspired by the futuristic dystopian visions of Deus Ex and Blade Runner.\r Play as a disparate group of last-chancers as they fight for the future of a city sliding slowly into the gutter. Some are broken souls, some are merely damaged - all are fighting to forge a future in an ugly world ruled by those whose hearts are cruel and dark.\r - Seven levels split across three acts.\r- Fully voiced, rich mystery plot.\r- Stunning visual style inspired by classic film noir cinema.\r- Explore a richly detailed and atmospheric world.\r- Coordinate multiple unique characters with a range of skills.\r- Use stealth or brute force to face those that stand in your way.… Expand"}, {"name": "Tornado", "details_link": "https://www.metacritic.com/game/ds/tornado", "publisher": "Ignition Entertainment", "release_date": "Oct 27 2008", "developers": ["Skonec"], "platforms": "DS", "genres": ["Action", "General", "General"], "meta_score": 44, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/1b0352ca84363c6116553605391c1234-98.jpg", "descriptions": "Tornado lets players join forces with Toki and the other members of the Cosmic Cleaners as they set out to restore all of Earth's buildings, vehicles, inhabitants and other obscure objects that have been stolen by the envious Prince using his mischievous \"Black Hole Device.\" Using aTornado lets players join forces with Toki and the other members of the Cosmic Cleaners as they set out to restore all of Earth's buildings, vehicles, inhabitants and other obscure objects that have been stolen by the envious Prince using his mischievous \"Black Hole Device.\" Using a combination of stylus and microphone activated controls, players will travel across Planet 69 as they level up and max out their \"Tornado Machines\" to literally uproot everything in their paths in effort to take back what Prince has wrongfully stolen and return it to Earth. [Ignition]… Expand"}, {"name": "Gothic 3: Forsaken Gods", "details_link": "https://www.metacritic.com/game/pc/gothic-3-forsaken-gods", "publisher": "JoWooD Entertainment AG", "release_date": "Nov 20 2008", "developers": ["Trine Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 44, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/5/69bf1f1560c3cf2abefefdd5602b7427-98.jpg", "descriptions": "After having banend the influence of the gods in Myrtana, the nameless hero and Xardas have left this world in order to prevail the balance of power. In their exile located somewhere between space and time, they watch the actions of the mortal beings. As they discover a growing of theAfter having banend the influence of the gods in Myrtana, the nameless hero and Xardas have left this world in order to prevail the balance of power. In their exile located somewhere between space and time, they watch the actions of the mortal beings. As they discover a growing of the differences between orcs and humans again, they start to accuse each other and finally even a fight between the companions breaks loose. The nameless hero leaves the secret realm and wakes up in Myrtana, where he tries to unite Myrtana once for good - in a new empire for both orcs and human. [JoWood Productions]… Expand"}, {"name": "MilitAnt", "details_link": "https://www.metacritic.com/game/playstation-4/militant", "publisher": "Xibalba Studios", "release_date": "Jul 12 2016", "developers": ["Xibalba Studios"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Platformer", "Shooter", "2D", "Shoot-'Em-Up", "Vertical"], "meta_score": 44, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/bf3b40372d4fd6dd377e73d9f02dce46-98.jpg", "descriptions": "Militant packs rich stylized insect worlds in high definition, novel 2.5D shooter gameplay action, customizable weapon load-outs, a large variety of enemies and epic boss battles. Militant immerses players in an insect based world through fast-paced unforgiving action gameplay combiningMilitant packs rich stylized insect worlds in high definition, novel 2.5D shooter gameplay action, customizable weapon load-outs, a large variety of enemies and epic boss battles. Militant immerses players in an insect based world through fast-paced unforgiving action gameplay combining classic side-scrolling controls with modern 3d visuals,  delivering a completely refreshing experience that players of all ages can enjoy.… Expand"}, {"name": "Pirates vs Ninjas Dodgeball", "details_link": "https://www.metacritic.com/game/xbox-360/pirates-vs-ninjas-dodgeball", "publisher": "SouthPeak Games", "release_date": "Sep  3 2008", "developers": ["Blazing Lizard"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Sports", "Alternative", "Individual", "Other", "Other"], "meta_score": 44, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/eb4e2eafabcb755e2d62f28ee36401ba-98.jpg", "descriptions": "[Xbox Live Arcade] Pirates vs. Ninjas Dodgeball transforms the innocent childhood game of dodgeball into a vindictive, heart-thumping battle between outlandish groups of characters including ninjas, pirates, zombies, and robots! Use a red rubber ball to tag opponents out of the game, and[Xbox Live Arcade] Pirates vs. Ninjas Dodgeball transforms the innocent childhood game of dodgeball into a vindictive, heart-thumping battle between outlandish groups of characters including ninjas, pirates, zombies, and robots! Use a red rubber ball to tag opponents out of the game, and utilize a variety of weapons, including ninja and pirate swords, to harm enemies along the way. Pirates vs. Ninjas Dodgeball features different arenas with unique gameplay challenges, from sandy beaches and snow capped forests to a spooky graveyard. [Microsoft]… Expand"}, {"name": "Buffy the Vampire Slayer: Wrath of the Darkhul King", "details_link": "https://www.metacritic.com/game/game-boy-advance/buffy-the-vampire-slayer-wrath-of-the-darkhul-king", "publisher": "THQ", "release_date": "Jun 24 2003", "developers": ["Natsume"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 44, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/fe89acb0f69424388f5581c5dc7cd5a5-98.jpg", "descriptions": "Buffy the Vampire Slayer on the GBA has little in common with the popular TV series it's based on, and it's a bad game to boot."}, {"name": "Metal Dungeon", "details_link": "https://www.metacritic.com/game/xbox/metal-dungeon", "publisher": "Xicat Interactive", "release_date": "Dec 15 2002", "developers": ["Panther Software"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 44, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/94c99425e7b078fe7bba039941d98a80-98.jpg", "descriptions": "In the futuristic world of Alansas, magic and technology are one.  Plagued by war and famine, Alansas has become a post-apocalyptic playground.  In the vast underground weapons complex of Force Valley, monstrous cyborg armies are created to wage war on the fields above.  In a moment ofIn the futuristic world of Alansas, magic and technology are one.  Plagued by war and famine, Alansas has become a post-apocalyptic playground.  In the vast underground weapons complex of Force Valley, monstrous cyborg armies are created to wage war on the fields above.  In a moment of folly, an experimental cyborg known as 'Magin', escapes and takes over the weapons laboratory and facility.  Creating an army of enhanced weapon monsters, Magin entombs the Gods of magic, turning Force Valley into a Metal Dungeon.  Now, a group of Cyborgs known as the Enforcers are enlisted to take back the facility, plunge into its depths and root out the evil that awaits.  So gear up, level up, and get ready for a horror-filled, futuristic RPG adventure in the Metal Dungeon.… Expand"}, {"name": "Jurassic Park III: The DNA Factor", "details_link": "https://www.metacritic.com/game/game-boy-advance/jurassic-park-iii-the-dna-factor", "publisher": "Konami", "release_date": "Jul 16 2001", "developers": ["Konami Computer Entertainment Hawaii"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 44, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/ac289bdfc127c3400a2d612ef74f2381-98.jpg", "descriptions": "This game has nothing to do whatsoever with Univeral's megahit movie. What it has to do with dinosaurs, or even video games in general, is also unclear."}, {"name": "Bombshell (2016)", "details_link": "https://www.metacritic.com/game/pc/bombshell-2016", "publisher": "3D Realms", "release_date": "Jan 29 2016", "developers": ["Interceptor Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 43, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/6/c7c68c3ad675232626c91144b90d0db1-98.jpg", "descriptions": "Bombshell is an Action Role-Playing game in which bomb disposal technician turned mercenary for hire, Shelly \"Bombshell\" Harrison must strong-arm her way across FOUR planets in an Unreal Engine-powered galactic adventure to rescue the president (and humanity) from an apocalyptic alien threat."}, {"name": "Enemy Front", "details_link": "https://www.metacritic.com/game/playstation-3/enemy-front", "publisher": "CI Games", "release_date": "Jun 10 2014", "developers": ["CI Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Shooter", "Historic", "Action", "Shooter", "First-Person", "Tactical", "Historic"], "meta_score": 43, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/dd172372407c2dee55ecd03c7a733a9d-98.jpg", "descriptions": "Enemy Front is the realistic tale of a hardened soldier dropped behind Nazi lines to engage in dynamic, diversified missions ranging from quick skirmishes, espionage assignments, and sabotage activities. The epic scope of Enemy Front spans several years and key battles as it progresses fromEnemy Front is the realistic tale of a hardened soldier dropped behind Nazi lines to engage in dynamic, diversified missions ranging from quick skirmishes, espionage assignments, and sabotage activities. The epic scope of Enemy Front spans several years and key battles as it progresses from the trenches of a desolate France right on through to Berlin and a secret weapons base. Once there, the player must thwart the plans for a terrifying weapon that will all but assure a global Nazis victory.… Expand"}, {"name": "Terminator Salvation", "details_link": "https://www.metacritic.com/game/playstation-3/terminator-salvation", "publisher": "Evolved Games", "release_date": "May 19 2009", "developers": ["GRIN"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 43, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/5/79819fdc207b73318744cd87930e9f8b-98.jpg", "descriptions": "Assume the role of John Connor and battle for survival against the far superior forces of Skynet."}, {"name": "Turning Point: Fall of Liberty", "details_link": "https://www.metacritic.com/game/xbox-360/turning-point-fall-of-liberty", "publisher": "Codemasters", "release_date": "Feb 26 2008", "developers": ["Spark Unlimited"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 43, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/b7254893830b4d9df197217f2330760d-98.jpg", "descriptions": "The game supposes that the incident in which a car struck Winston Churchill in New York on December 13th 1931 actually proved fatal – and that without his inspirational speeches to galvanise the Allies, the course of the Second World War took a very different route, with the Axis Powers evenThe game supposes that the incident in which a car struck Winston Churchill in New York on December 13th 1931 actually proved fatal – and that without his inspirational speeches to galvanise the Allies, the course of the Second World War took a very different route, with the Axis Powers even invading America.… Expand"}, {"name": "Star Trek The Video Game", "details_link": "https://www.metacritic.com/game/pc/star-trek-the-video-game", "publisher": "Namco Bandai Games America", "release_date": "Apr 23 2013", "developers": ["Digital Extremes"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 43, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/0/d94074ab2a961ec864efe2a5cc6f9c6b-98.jpg", "descriptions": "Gamers have the chance to play as two of the most famous science-fiction heroes ever -- Kirk and Spock – in STAR TREK, an original co-op experience that expands and builds on the Star Trek universe. Set in the 23rd Century world of the Star Trek reboot, this cover-based shooter enmeshesGamers have the chance to play as two of the most famous science-fiction heroes ever -- Kirk and Spock – in STAR TREK, an original co-op experience that expands and builds on the Star Trek universe. Set in the 23rd Century world of the Star Trek reboot, this cover-based shooter enmeshes players in an original story and action-packed combat.… Expand"}, {"name": "Danger Girl", "details_link": "https://www.metacritic.com/game/playstation/danger-girl", "publisher": "THQ", "release_date": "Sep  6 2000", "developers": ["n-Space"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 43, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/aef07504a4c2a1db69b256ed99b2ca31-98.jpg", "descriptions": "3rd person action-adventure has never been sexier with DANGER GIRL, the only videogame based on on the best-selling comic book series by J. Scott Campbell and Andy Hartnell. Dare to take control of 3 beautiful yet leathal Danger Girls in an espionage-themed thrill-ride deemed to dangerous3rd person action-adventure has never been sexier with DANGER GIRL, the only videogame based on on the best-selling comic book series by J. Scott Campbell and Andy Hartnell. Dare to take control of 3 beautiful yet leathal Danger Girls in an espionage-themed thrill-ride deemed to dangerous for any man to handle!… Expand"}, {"name": "Word Puzzle", "details_link": "https://www.metacritic.com/game/xbox-360/word-puzzle", "publisher": "InterServ International", "release_date": "Nov  7 2007", "developers": ["InterServ International"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Logic", "General"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/d2f28dfd5080ef406463fa3336b7efbd-98.jpg", "descriptions": "[Xbox Live Arcade]  Also known as \"Word Search.\"  You'll never think about word search puzzles the same way again. Word Puzzle takes a new spin on the classic game, plunging you into an action-packed arcade experience complete with combos, exploding word bombs, unique 3-D boards,[Xbox Live Arcade]  Also known as \"Word Search.\"  You'll never think about word search puzzles the same way again. Word Puzzle takes a new spin on the classic game, plunging you into an action-packed arcade experience complete with combos, exploding word bombs, unique 3-D boards, achievements, and the chance to prove your textual superiority against other players. Five different game modes and frequently updated downloadable word packs give you nearly unlimited flexibility and excitement. So put down that pen and paper, because this is a word search for the 21st century! New twists: Exploding word bombs, prop cards used to distract your opponents, 3-D game boards, and other effects combine to provide a word search game like you've never played before. Five unique gameplay modes: Try Freeplay for traditional word search fun, Arcade mode to score impressive combos, Local Battle for competitive play on a single console, Live Multiplayer with support for up to 4 players online, and check out the unique Survival Mode where word bombs can explode, and have to be defused.\rCamera-enabled: The game supports the Xbox LIVE Vision camera during live match play. Achievements and leaderboard: Twelve new achievements to master and a leaderboard to compare your word search skills with others. [Microsoft]… Expand"}, {"name": "Devil's Third", "details_link": "https://www.metacritic.com/game/wii-u/devils-third", "publisher": "Nintendo", "release_date": "Aug 28 2015", "developers": ["Valhalla Game Studios"], "platforms": "Wii U", "num_players": "Up to 16 ", "genres": ["Action Adventure", "General", "Modern", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 43, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/75aa7de834d3f707eb75dc6b34ae9a78-98.jpg", "descriptions": "[Available in the US in December 2015] The first project under THQ's partnership with game creator Tomonobu Itagaki and his newly formed Valhalla Game Studios, Devil's Third is a fast-paced action game set in the near future in the wake of a global catastrophe. Itagaki, whose credits include[Available in the US in December 2015] The first project under THQ's partnership with game creator Tomonobu Itagaki and his newly formed Valhalla Game Studios, Devil's Third is a fast-paced action game set in the near future in the wake of a global catastrophe. Itagaki, whose credits include the critically acclaimed Ninja Gaiden and Dead or Alive franchises, has pledged to deliver an experience like no other, combining a deep storyline with original combat mechanics all set against an atmospheric and explosive backdrop.… Expand"}, {"name": "Everreach: Project Eden", "details_link": "https://www.metacritic.com/game/pc/everreach-project-eden", "publisher": "Headup Games", "release_date": "Dec  4 2019", "developers": ["Elder Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 43, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/489dbf267bf6bd38fc104baefda5ec4d-98.jpg", "descriptions": "Assume the role of Nora Harwood, member of Everreach’s Security Division, on a mission to secure the colonization process of Eden and investigate mysterious incidents in this fast-paced, story-driven action-RPG set on the visually stunning Planet Eden."}, {"name": "Blood Knights", "details_link": "https://www.metacritic.com/game/xbox-360/blood-knights", "publisher": "DTP Entertainment", "release_date": "Nov  1 2013", "developers": ["Deck 13"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "Action Adventure", "Fantasy", "General", "Fantasy", "Action RPG"], "meta_score": 43, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/8/ef7b5525d7c8b6a37cac0fda548d1325-98.jpg", "descriptions": "Blood Knights is an action-adventure game, players assume the role of characters who must defeat evil forces in a mythical version of the Holy Land."}, {"name": "Digimon World Data Squad", "details_link": "https://www.metacritic.com/game/playstation-2/digimon-world-data-squad", "publisher": "Namco Bandai Games America", "release_date": "Sep 18 2007", "developers": ["Bec"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "General"], "meta_score": 43, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/feb7468fa59337a823875727c7d51672-98.jpg", "descriptions": "Marcus Damon is both a smart 14 year old and an undefeated street fighter, but he does not fight with his fists alone. As a member of the secretive DATS (Data Squad), Marcus and his team examine the mysterious disappearance of numerous kids. During the course of the investigation, the SevenMarcus Damon is both a smart 14 year old and an undefeated street fighter, but he does not fight with his fists alone. As a member of the secretive DATS (Data Squad), Marcus and his team examine the mysterious disappearance of numerous kids. During the course of the investigation, the Seven Demon Kings arrive, wreaking havoc across the world. As Marcus, it is up to players to find the missing kids all the while defeating the deadly Seven Demon Kings and their evil minions. Spanning over a dozen stages with a storyline that parallels the cartoon, players can team up with more than 140 Digimon characters to battle against evil and save the world. As gamers increase in skill and find new items, so too can their Digimon be upgraded through leveling up and \"Digivolution.\"  With over 250 items to collect and complex puzzles to solve, Digimon World Data Squad represents the evolution of the common RPG on the PS2. [Namco Bandai Games]… Expand"}, {"name": "Six Flags Fun Park", "details_link": "https://www.metacritic.com/game/wii/six-flags-fun-park", "publisher": "Ubisoft", "release_date": "Mar  3 2009", "developers": ["7 Studios"], "platforms": ["PC", "PlayStation 2", "Wii"], "genres": ["Action", "Miscellaneous", "General", "Party", "Party / Minigame"], "meta_score": 43, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/c8a94860eb0090afd3a58af41ac7181b-98.jpg", "descriptions": "Calling gamers of all ages - Six Flags Fun Park welcomes the whole family into a virtual theme park filled with everyone's favorite games, all re-imagined within a colossal park environment that is sure to keep gamers challenged. Upon entrance to the game, players are tasked with quests thatCalling gamers of all ages - Six Flags Fun Park welcomes the whole family into a virtual theme park filled with everyone's favorite games, all re-imagined within a colossal park environment that is sure to keep gamers challenged. Upon entrance to the game, players are tasked with quests that encourage them to explore the park's zany universe. After creating a unique custom character, Six Flags Fun Park patrons can test their skills, win prizes, and play against friends and family with 40 mini-games. [Brash Entertainment]… Expand"}, {"name": "Monster Jam", "details_link": "https://www.metacritic.com/game/xbox-360/monster-jam", "publisher": "Activision", "release_date": "Nov 13 2007", "developers": ["Torus Games"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Simulation", "Truck", "Truck", "Automobile"], "meta_score": 43, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/d462913444c5067b78de9053cd78b25d-98.jpg", "descriptions": "Experience extreme monster truck action as you catch massive air, crush cars, perform crazy stunts, destroy everything in your path, race to the finish line and more.  Battle through stadium races, freestyle competitions and outdoor circuit tracks on your way to becoming the Monster JamExperience extreme monster truck action as you catch massive air, crush cars, perform crazy stunts, destroy everything in your path, race to the finish line and more.  Battle through stadium races, freestyle competitions and outdoor circuit tracks on your way to becoming the Monster Jam world champion. 20 of the biggest names in monster trucks:  Grave Digger, Maximum Destruction, Monster Mutt, Blue Thunder, Bounty Hunter and more. Authentic Monster Jam action – Compete in 9 different stadiums on the Monster Jam tour as you compete in stadium racing, stadium circuit and stadium freestyle competitions. It’s like driving the real thing – Use 4 wheel steering to make hairpin turns and perform stunts such as crazy donuts.  Put the pedal to the metal with turbo boost to catch massive air and accelerate past competition or through objects. Race your truck outdoors – Take your truck out of the stadium and battle to the finish line on 12 outdoor circuit tracks.  Race on unique tracks such as an airport graveyard, a shipyard docks, a construction zone, and a ski resort. Destroy your environment –  Each race track and freestyle event has a wide variety of fully destructible objects and obstacles including school buses, gas stations, construction trailers, luxury yachts, loaded semi-trailers and much more. [Activision]… Expand"}, {"name": "Ghostbusters: Sanctum of Slime", "details_link": "https://www.metacritic.com/game/pc/ghostbusters-sanctum-of-slime", "publisher": "Atari", "release_date": "Mar 23 2011", "developers": ["Behavior Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Modern", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 43, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/5/dca3e6e87e8bbc8c10eee7eb46c75834-98.jpg", "descriptions": "Sanctum of Slime is a top-down action adventure following the star of 2009's Ghostbusters revamp."}, {"name": "Power Rangers Super Megaforce", "details_link": "https://www.metacritic.com/game/3ds/power-rangers-super-megaforce", "publisher": "Bandai Namco Games", "release_date": "Oct 28 2014", "developers": ["Bandai Namco Games", "7thChord"], "platforms": "3DS", "genres": ["Action", "General"], "meta_score": 43, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/aa366343a1ce9fb7380f46330454e311-98.jpg", "descriptions": "Go, Go, Super Megaforce!\r The Ruthless Prince Vekar has arrived with his massive alien Armada to conquer Earth. To face this new evil threat, the MEGAFORCE RANGERS utilize special Morphers and Keys, which allow them to morph into the SUPER MEGAFORCE RANGERS! Using these special Keys,Go, Go, Super Megaforce!\r The Ruthless Prince Vekar has arrived with his massive alien Armada to conquer Earth. To face this new evil threat, the MEGAFORCE RANGERS utilize special Morphers and Keys, which allow them to morph into the SUPER MEGAFORCE RANGERS! Using these special Keys, you'll have the incredible ability to play as Legendary Rangers from the past, gaining access to their amazing powers and weapons. Can you channel your inner Super Megaforce to stop the evil Prince Vekar once and for all?… Expand"}, {"name": "Quantum Theory", "details_link": "https://www.metacritic.com/game/playstation-3/quantum-theory", "publisher": "Tecmo", "release_date": "Sep 28 2010", "developers": ["Tecmo"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "10  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 43, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/d069f6b6e04bcf63c99f9664e53eb77b-98.jpg", "descriptions": "Experience Syd and Filena's adventurous ascent through a treacherous tower in this action-shooter game, presented in an art nouveau style world that is on the verge of becoming post-apocalyptic, which merges the beauty of organic motifs with technology and action-packed gameplay.Experience Syd and Filena's adventurous ascent through a treacherous tower in this action-shooter game, presented in an art nouveau style world that is on the verge of becoming post-apocalyptic, which merges the beauty of organic motifs with technology and action-packed gameplay. Shape-Shifting Battlefield: Navigate through a dark fantasy world where the intense battleground surprises you with new and challenging obstacles by changing its form in real-time. Two-Character Combination Actions: Syd and Filena perform actions as a pair-in some instances, that is the only way to overcome hurdles. Strategically perform combos for a more powerful, fierce attack against colossal enemies. Aesthetically Pleasing Gameplay Environment: Radiant colors and the mixture of organic elements complements both action and technology. Online Play: Continue your adventure with your friends in Team Battle and Battle Royale modes. [Tecmo]… Expand"}, {"name": "John Deere: Harvest in the Heartland", "details_link": "https://www.metacritic.com/game/ds/john-deere-harvest-in-the-heartland", "publisher": "Destineer", "release_date": "Nov 20 2007", "developers": ["Black Lantern Studios"], "platforms": "DS", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/dd3be0943c9153d2fd07dec1dc83e1d4-98.jpg", "descriptions": "John Deere: Harvest in the Heartland is a “hands-on” real-time farming game for the Nintendo DS. From soil to sustenance, John Deere: Harvest in the Heartland challenges players to create and maintain a fully functioning farm. Through an intuitive Touch Screen interface, players use theJohn Deere: Harvest in the Heartland is a “hands-on” real-time farming game for the Nintendo DS. From soil to sustenance, John Deere: Harvest in the Heartland challenges players to create and maintain a fully functioning farm. Through an intuitive Touch Screen interface, players use the Nintendo DS stylus to work the land, raise livestock, pick crops, milk cows, and more to earn cash and improve the farm by purchasing land, livestock, and authentic John Deere equipment. However, there is no such thing as a successful “lazy farmer’ and players who neglect their farm will reap what they sow as they watch their farm and crops turn to dust. Design & Detail: use the touch screen and stylus to layout the locations of fields and buildings. Use the top screen to monitor the farm via the mini-map and check on the status of crops and livestock with the Query Tool. Hands-On Farming: clear land, plant and harvest crops, and drive authentic John Deere equipment. Paint buildings and create a unique logo for the farm which identifies players at the Commodities Market. Feed, care for, and harvest products from the animals through a variety of fun and intuitive stylus actions. The Commodities Market and County Fair: raise crops and livestock for sale at the daily Commodities Market. Reinvest money earned from the sale of crops and animal products to upgrade John Deere equipment and make the farm more efficient and profitable. Or, enter your products and livestock in “Best of” contests at the County Fair for prizes and fame. [Destineer]… Expand"}, {"name": "New Rally-X", "details_link": "https://www.metacritic.com/game/xbox-360/new-rally-x", "publisher": "Namco Bandai Games", "release_date": "Dec 27 2006", "developers": ["Bandai Namco Games"], "platforms": ["PlayStation 4", "Switch", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Driving", "General", "General", "Arcade"], "meta_score": 43, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/e6211bb3fd34405f5893538932a46e4b-98.jpg", "descriptions": "[Xbox Live Arcade]  New Rally-X, the sequel to \"Rally-X,\" is an arcade classic that was released in 1981. It features new courses and adjustments to the enemy cars, improving the overall game balance, as well as new graphics and background music. Flags: Collect all the flags while avoiding[Xbox Live Arcade]  New Rally-X, the sequel to \"Rally-X,\" is an arcade classic that was released in 1981. It features new courses and adjustments to the enemy cars, improving the overall game balance, as well as new graphics and background music. Flags: Collect all the flags while avoiding enemy cars with new features such as the Lucky Flag, which awards you points depending on your remaining fuel. Specials: Collect the Special Flag to double the points of all remaining flags. [Microsoft]… Expand"}, {"name": "Harry Potter and the Deathly Hallows, Part 2", "details_link": "https://www.metacritic.com/game/pc/harry-potter-and-the-deathly-hallows-part-2", "publisher": "Electronic Arts", "release_date": "Jul 12 2011", "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 43, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/a6994f42c02306168414aed212c51dab-98.jpg", "descriptions": "Harry Potter takes a dark turn in this third-person shooter as he battles death eaters and dementors while fleeing for his life across the wilds of England."}, {"name": "Empire of Sin", "details_link": "https://www.metacritic.com/game/playstation-4/empire-of-sin", "publisher": "Paradox Interactive", "release_date": "Dec  1 2020", "developers": ["Romero Games Ltd."], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 43, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/595b60d7f6728a6b8397c23770c5cb49-98.jpg", "descriptions": "Empire of sin, the strategy game from romero games and Paradox interactive, puts you at the heart of the ruthless criminal underworld of 1920S prohibition-era Chicago. It's up to you to Hustle, charm and intimidate your way to the top of the pile and do whatever it takes to stay there. ThisEmpire of sin, the strategy game from romero games and Paradox interactive, puts you at the heart of the ruthless criminal underworld of 1920S prohibition-era Chicago. It's up to you to Hustle, charm and intimidate your way to the top of the pile and do whatever it takes to stay there. This character-driven, noir-inspired game puts players smack dab in the glitz and glamor of the roaring 20S, all while working behind the scenes in the gritty underbelly of organized crime. … Expand"}, {"name": "FIFA 20: Legacy Edition", "details_link": "https://www.metacritic.com/game/switch/fifa-20-legacy-edition", "publisher": "Electronic Arts", "release_date": "Sep 27 2019", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 43, "users_score": 0.9, "image": "https://static.metacritic.com/images/products/games/4/3e0db18018b89910944df004548ccd42-98.jpg", "descriptions": "Enjoy more control over the Decisive Moments that determine the outcome of every match in FIFA 20. Pick your target and time it right from the spot. Add curl, dip, or knuckle to free kicks. A new aiming mechanic gives you more creativity from dead balls. Move with more agility. Lure theEnjoy more control over the Decisive Moments that determine the outcome of every match in FIFA 20. Pick your target and time it right from the spot. Add curl, dip, or knuckle to free kicks. A new aiming mechanic gives you more creativity from dead balls. Move with more agility. Lure the defender in. Beat them with speed or skill. New strafe dribbling adds new dimensions for attacking play in FIFA 20. Take back possession with Active Touch Tackling and new animations that reward you for well-timed defensive play. More clinical finishing when one-on-one. More risk with volleys and long shots. Overhauled shooting creates more realism in front of goal in FIFA 20. [Electronic Arts]… Expand"}, {"name": "Soldner: Secret Wars", "details_link": "https://www.metacritic.com/game/pc/soldner-secret-wars", "publisher": "Encore Software, Inc.", "release_date": "Jun 22 2004", "developers": ["Wings Simulations"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 43, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/3/3b7f9d0447a0f9648d0bbd9ee508e16e-98.jpg", "descriptions": "After half a century of military interventions major countries like the United States of America or Russia are weary of their role as \"World Police\". The consequences of their military actions for their economy, national security, and internal ethnic conflicts let to the conclusion to tuneAfter half a century of military interventions major countries like the United States of America or Russia are weary of their role as \"World Police\". The consequences of their military actions for their economy, national security, and internal ethnic conflicts let to the conclusion to tune down their military campaigns. Due to that more and more countries choose unconventional warfare by using secret Special Forces. Military success is no longer made by major countries but by small and highly specialized mercenary forces. In \"SOLDNER - Secret Wars\" the player takes over the command of such a Special Forces team. As the Commander he leads a small high tech army consisting of soldiers, light armored vehicles, helicopters and VTOLS (Vertical Take Off and Landing Airplanes) to fulfill a wide variety of mission types. The players units are stationed on a multi purpose ship which is camouflaged as a merchantman to allow unrestrained travel of the seas to get their forces to the area of operation. The complete simulation of a complex political world system allows creating a dynamic campaign: each decision of the player, each success or failure has direct effect on the game flow. In addition the player has the ability to gain access to the latest weapon systems and technology, which currently exist in the research centers of the weapon industry only. [Encore Software]… Expand"}, {"name": "Spuds Unearthed", "details_link": "https://www.metacritic.com/game/playstation-4/spuds-unearthed", "publisher": "Gamedust", "release_date": "Apr 24 2020", "developers": ["Gamedust"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 43, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/b740eae0e4bbec8b0ec29fca1eab726c-98.jpg", "descriptions": "Fight to build your own Spud tribe and make your planet prosper in this hilarious action-strategy game with a dash of playing god. Journey to different planets, upgrade your heroes and create new weapons for your galactic conquest."}, {"name": "Hatred", "details_link": "https://www.metacritic.com/game/pc/hatred", "publisher": "Destructive Creations", "release_date": "Jun  1 2015", "developers": ["Destructive Creations"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Modern", "Action", "Shooter", "Third-Person", "Shoot-'Em-Up", "Arcade", "Top-Down"], "meta_score": 43, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/3/3c16753c82029088b7a50fafd0420c60-98.jpg", "descriptions": "Hatred is an isometric shooter with disturbing atmosphere of mass killing, where player takes the role of a cold blood antagonist, who is full of hatred for humanity. It's a horror, but here YOU are the villain. Wander the outskirts of New York State, seek for victims on seven free-roamHatred is an isometric shooter with disturbing atmosphere of mass killing, where player takes the role of a cold blood antagonist, who is full of hatred for humanity. It's a horror, but here YOU are the villain. Wander the outskirts of New York State, seek for victims on seven free-roam levels. Fight against law enforcement and take a journey into the antagonist's hateful mind. Gather equipment of the dead ‘human shields’ to spread Armageddon upon society. Destroy everything on your way of hunt and fight back when it's disturbed...… Expand"}, {"name": "Flushed Away", "details_link": "https://www.metacritic.com/game/playstation-2/flushed-away", "publisher": "D3", "release_date": "Oct 24 2006", "developers": ["Monkey Bar Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 43, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/9750b2dfe56339ddff157d77a7a41b82-98.jpg", "descriptions": "Flushed Away lets players relive the movie and beyond as they assume the roles of Roddy, Rita and take the wheel of the Jammy Dodger as they find their way through a dangerous underground city filled with enemies, waterfalls and traps in a struggle against the villainous Toad and his evilFlushed Away lets players relive the movie and beyond as they assume the roles of Roddy, Rita and take the wheel of the Jammy Dodger as they find their way through a dangerous underground city filled with enemies, waterfalls and traps in a struggle against the villainous Toad and his evil plans. Comprised of more than 10 levels and 3 mini-games, players use a rat trap catapult, a dashing cocktail sword, pudding mix, and other items found in the sewer as they defeat enemies and dodge floating debris. Fun mini-games such as Rat Traps & Crayons, Pathfinder, and more extend the gameplay and offer players a chance to increase their health by collecting and salvaging items, boost their energy through power-up items and unlock exclusive content such as concept art, film assets, and more. [D3 Publisher of America]… Expand"}, {"name": "XEL", "details_link": "https://www.metacritic.com/game/switch/xel", "publisher": "Assemble Entertainment", "release_date": "Jul 14 2022", "developers": ["Tiny Roar"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Action Adventure", "Open-World"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/5b01d748dbe7cc22c7a6cc6980024315-98.jpg", "descriptions": "XEL is an epic 3D sci-fi fantasy action-adventure. Explore the mysterious world of XEL and help protagonist Reid to uncover her enigmatic past. Make new friends and foes along the way and collect exciting gadgets to master challenging dungeons and solve time bending puzzles."}, {"name": "New Gundam Breaker", "details_link": "https://www.metacritic.com/game/playstation-4/new-gundam-breaker", "publisher": "Bandai Namco Games", "release_date": "Jun 22 2018", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "General"], "meta_score": 43, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/1/dcd00a3396778c2bae72c01f0a3cf4fd-98.jpg", "descriptions": "Break, build and battle with the Gunpla you’ve always wanted in NEW GUNDAM BREAKER. Blast through enemy Gunplas and collect their fallen weapons and armor to customize your Gunpla in real time and now you can team up with your friends in a 3v3 co-op mode. Don’t miss out on the action in theBreak, build and battle with the Gunpla you’ve always wanted in NEW GUNDAM BREAKER. Blast through enemy Gunplas and collect their fallen weapons and armor to customize your Gunpla in real time and now you can team up with your friends in a 3v3 co-op mode. Don’t miss out on the action in the newest installment of this series. [Bandai Namco]… Expand"}, {"name": "PDC World Championship Darts 2008", "details_link": "https://www.metacritic.com/game/psp/pdc-world-championship-darts-2008", "publisher": "O-Games", "release_date": "Jun 16 2009", "developers": ["Oxygen Interactive"], "platforms": ["PlayStation 2", "PSP"], "genres": ["Sports", "Alternative", "Individual", "Other", "Other"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/dd7f9950191dd98781819a5b271650fa-98.jpg", "descriptions": "The PSP System version offers wireless multiplayer and game sharing! You can import your own customized photos through your MEMORY STICK DUO and assign them to a profile. Or customize your playlist for the game using your MP3’s from your MEMORY STICK DUO, making PDC Darts World ChampionshipThe PSP System version offers wireless multiplayer and game sharing! You can import your own customized photos through your MEMORY STICK DUO and assign them to a profile. Or customize your playlist for the game using your MP3’s from your MEMORY STICK DUO, making PDC Darts World Championship Darts on the PSP System the most personalized version yet. [Oxygen Games]… Expand"}, {"name": "PlayStation Move Ape Escape", "details_link": "https://www.metacritic.com/game/playstation-3/playstation-move-ape-escape", "publisher": "SCEA", "release_date": "Jul  5 2011", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 43, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/3/338fe204d6a00ce11afcfc677dbad5cc-98.jpg", "descriptions": "You will travel through time in search for Specter to help your new partners, Tohko and Tsukushi.  Pipo monkeys will come and try to steal their favorite bananas from you.  Chase around and capture more than 700 monkeys, the largest number of franchise!  Get yourself ready with the MoveYou will travel through time in search for Specter to help your new partners, Tohko and Tsukushi.  Pipo monkeys will come and try to steal their favorite bananas from you.  Chase around and capture more than 700 monkeys, the largest number of franchise!  Get yourself ready with the Move controller and capture the pipo monkeys!!… Expand"}, {"name": "1950s Lawn Mower Kids", "details_link": "https://www.metacritic.com/game/ds/1950s-lawn-mower-kids", "publisher": "Zordix", "release_date": "Nov  3 2011", "developers": ["Zordix"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "General", "General"], "meta_score": 43, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/abeefc9a1e111db9849d2871917a2235-98.jpg", "descriptions": "1950s Lawn Mower Kids is a fun game where you under severe time constraints simultaneously keep the three TNT-kids mowing. All this while avoiding moving objects, well laid tables and intricate flower beds. Your opponents will be dogs, cats, ducks, and a menagerie of people lead by Angry Old1950s Lawn Mower Kids is a fun game where you under severe time constraints simultaneously keep the three TNT-kids mowing. All this while avoiding moving objects, well laid tables and intricate flower beds. Your opponents will be dogs, cats, ducks, and a menagerie of people lead by Angry Old Joe. On your side is Mr Mowman and his strange but wonderful contraptions.… Expand"}, {"name": "Painkiller Redemption", "details_link": "https://www.metacritic.com/game/pc/painkiller-redemption", "publisher": "THQ Nordic", "release_date": "Feb 25 2011", "developers": ["Eggtooth Team"], "platforms": "PC", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 0, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/4/9db8e49f5e5fe003bf3524d775444ef9-98.jpg", "descriptions": null}, {"name": "Final Fight: Streetwise", "details_link": "https://www.metacritic.com/game/playstation-2/final-fight-streetwise", "publisher": "Capcom", "release_date": "Feb 28 2006", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 43, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/df613fb7ec8768f0465156927292800e-98.jpg", "descriptions": "In Final Fight: Streetwise, players assume the role of Kyle Travers. As a streetwise underground pit fighter and brother of the infamous Cody from the classic Final Fight series, Kyle must try to solve his brother's disappearance. A major element to the game is quickly building 'respect.'In Final Fight: Streetwise, players assume the role of Kyle Travers. As a streetwise underground pit fighter and brother of the infamous Cody from the classic Final Fight series, Kyle must try to solve his brother's disappearance. A major element to the game is quickly building 'respect.' Earning this sought-after characteristic gives gamers a means to attain powerful new fighting skills, hardcore weapons, critical information and a wide variety of NPC (non-playable character) support; vital for completing various objectives. Featuring stylized and realistic visuals, the tumultuous energy of Metro City is brought to life with great detail. Explore dynamic environments and encounter intense street fights where players use hand-to-hand and weapon combat. Shocking story twists and disturbing connections are made as this epic story unfolds through adrenaline-pumping action and intense cinematics. [Capcom]… Expand"}, {"name": "Zathura", "details_link": "https://www.metacritic.com/game/playstation-2/zathura", "publisher": "2K Games", "release_date": "Nov  2 2005", "developers": ["High Voltage Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 43, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/2/de09c5ae7f1b2e9a132de9cb97360c1d-98.jpg", "descriptions": "The Zathura video game, based on the film of the same name, allows players to create their own high-action space adventures in a visually stunning 3D game environment. Based on the best-selling children's adventure book by Chris Van Allsburg (\"Polar Express,\" \"Jumanji\"), Zathura follows twoThe Zathura video game, based on the film of the same name, allows players to create their own high-action space adventures in a visually stunning 3D game environment. Based on the best-selling children's adventure book by Chris Van Allsburg (\"Polar Express,\" \"Jumanji\"), Zathura follows two young brothers who find a mysterious board game that takes them on a wild ride through outer space. Meteor showers, out-of-control rocket-propelled robots and nasty alien lizards are among the obstacles they must overcome to get back to Earth. [2K Games]… Expand"}, {"name": "Pac-Man Party 3D", "details_link": "https://www.metacritic.com/game/3ds/pac-man-party-3d", "publisher": "Namco Bandai Games America", "release_date": "Nov  8 2011", "developers": ["Namco Bandai Games"], "platforms": "3DS", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 43, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/2/c4cee20e9bd266ef0eb48d2074f24a65-98.jpg", "descriptions": "PAC-MAN PARTY 3D brings together family and friends with a fun experience that includes dozens of mini-games for gamers to play with or against each other. Perfect for the whole family, PAC-MAN PARTY 3D features a variety of control styles that utilize the system’s buttons, touchscreen,PAC-MAN PARTY 3D brings together family and friends with a fun experience that includes dozens of mini-games for gamers to play with or against each other. Perfect for the whole family, PAC-MAN PARTY 3D features a variety of control styles that utilize the system’s buttons, touchscreen, microphone, and accelerometer.  With support for download play, friends can join in on the fun using just one cartridge shared across Nintendo 3DS systems. … Expand"}, {"name": "G.I. Joe: The Rise of Cobra", "details_link": "https://www.metacritic.com/game/playstation-3/gi-joe-the-rise-of-cobra", "publisher": "Electronic Arts", "release_date": "Aug  4 2009", "developers": ["Double Helix Games"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1-2 ", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 43, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/9/fdd5f09c6688ee2dbd90b76c2dca2c07-98.jpg", "descriptions": "As COBRA unleashes its deadliest plot yet, the G.I. JOE Team is counting on you and your hand-picked team of heroes to lead the counterattack. Every mission is critical and so is every G.I. JOE character. Picking up where the Paramount Pictures live action film leaves off, G.I. JOE The RiseAs COBRA unleashes its deadliest plot yet, the G.I. JOE Team is counting on you and your hand-picked team of heroes to lead the counterattack. Every mission is critical and so is every G.I. JOE character. Picking up where the Paramount Pictures live action film leaves off, G.I. JOE The Rise of Cobra is an accessible third person action-arcade shooter that allows players to recreate and relive the greatest moments from the film, cartoon series and action toy line. Exclusive all-new storyline that picks up where the film ends and is inspired by 45 years of rich G.I.JOE history. Two player co-op lets players choose an elite team and call in support from other G.I. JOE characters. Choose from 16 playable characters (four of which are unlockable COBRA characters) - each with a unique set of abilities and weapons. G.I. JOE characters include Snake Eyes, Duke, Heavy Duty, Ripcord, Scarlett, Shipwreck and Gung Ho. Storm Shadow has been revealed as an unlockable playable COBRA character. Characters are classified into one of three units: Commandos who do well at close range, Heavys who possess extraordinary shooting skills but do it best from a distance and Combat Soldiers who are a balance between the two. Gear up with the latest in high-tech gadgets like the film-inspired Accelerator Suit which makes you invincible and gives you short bursts of additional fire power. Drivable G.I. JOE and COBRA vehicles designed for two-player co-op. Three difficulty levels - appealing to players of all ages and skill levels (Casual, Advanced and Hardcore). 20 levels - each with 3-5 areas to explore - across four environments. 75 file cards and various intelligence items hidden throughout the game which can be used to unlock additional playable characters, special missions, 4 PSAs and other bonus content. [Electronic Arts]… Expand"}]