[{"name": "LEGO The Lord of the Rings", "details_link": "https://www.metacritic.com/game/xbox-360/lego-the-lord-of-the-rings", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 13 2012", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Adventure", "General", "Fantasy", "General", "Compilation", "Linear"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/5a65516afb957da1c210284820f70a8f-98.jpg", "descriptions": "LEGO The Lord of the Rings retells the story of the Lord of the Rings Trilogy through the visuals of the LEGO universe."}, {"name": "Etrian Odyssey Untold: The Millennium Girl", "details_link": "https://www.metacritic.com/game/3ds/etrian-odyssey-untold-the-millennium-girl", "publisher": "Atlus", "release_date": "Oct  1 2013", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/970ca14b52aa61e1c5f22700b6034b7a-98.jpg", "descriptions": "Etrian Odyssey Untold: The Millennium Girl is a first-person, map-making dungeon crawler for the Nintendo 3DS."}, {"name": "Metro: Last Light", "details_link": "https://www.metacritic.com/game/playstation-3/metro-last-light", "publisher": "Square Enix", "release_date": "May 14 2013", "developers": ["4A Games"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/33dc09a9a7ab0cafe6537c9008dddff2-98.jpg", "descriptions": "Metro: Last Light immerses the player in the haunting, desolate ruins of post-apocalyptic Moscow. Developer 4A Games promises to deliver a terrifying, atmospheric single-player adventure that fuses combat with exploration and survival horror to create a unique, memorable experience."}, {"name": "Wii Sports Resort", "details_link": "https://www.metacritic.com/game/wii/wii-sports-resort", "publisher": "Nintendo", "release_date": "Jul 26 2009", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General", "Individual", "Athletics"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/9d95197ff686d919124e9455d9575462-98.jpg", "descriptions": "Wii Sports Resort is a collection of fun sports games that anyone can pick up and play. This sequel to the popular Wii Sports makes use of the Wii MotionPlus accessory, which gives players the most responsive and realistic experience possible. The Wii MotionPlus accessory, which is includedWii Sports Resort is a collection of fun sports games that anyone can pick up and play. This sequel to the popular Wii Sports makes use of the Wii MotionPlus accessory, which gives players the most responsive and realistic experience possible. The Wii MotionPlus accessory, which is included with Wii Sports Resort, plugs into the base of the Wii Remote controller and, combined with the accelerometer and sensor bar, provides an experience that gives players an even greater sense of immersion. Just as with Wii Sports, people compete against friends and family. As the competition heats up, Wii Sports Resort is as much fun to watch as it is to play. First-time players should find it easy to pick up a Wii Remote and jump into the action. Wii Sports Resort takes place on a tropical island. A wide range of activities keep players coming back for one more round. Some sample activities include Sword Play, Power Cruising (racing a water scooter) and Disc Dog, which involves accurately tossing a disc to a cute, Mii-like dog. [Nintendo]… Expand"}, {"name": "Sakuna: Of Rice and Ruin", "details_link": "https://www.metacritic.com/game/switch/sakuna-of-rice-and-ruin", "publisher": "XSEED Games", "release_date": "Nov 10 2020", "developers": ["Edelweiss"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/f5ec5f4e7426819681f9b8f8e5b0ab33-98.jpg", "descriptions": "Sakuna: Of Rice and Ruin combines side-scrolling action with deep crafting and farming simulation. Players take on the role of Sakuna, a spoiled harvest goddess banished to a dangerous island with a group of outcast humans. As she explores the beautiful, forbidding environments of theSakuna: Of Rice and Ruin combines side-scrolling action with deep crafting and farming simulation. Players take on the role of Sakuna, a spoiled harvest goddess banished to a dangerous island with a group of outcast humans. As she explores the beautiful, forbidding environments of the island, she will also find a home in a mountain village, proving herself worthy of her title by harvesting rice and bettering the lives of humans. In addition to being a fresh take on Japanese mythology and a love letter to action games, Sakuna: Of Rice and Ruin is an ode to rice and an engrossing simulation of the craft behind the agriculture.… Expand"}, {"name": "Crown Trick", "details_link": "https://www.metacritic.com/game/switch/crown-trick", "publisher": "NExT Studios", "release_date": "Oct 16 2020", "developers": ["NExT Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/0db8ad2c97e22c5fe322434dbc3a4a5e-98.jpg", "descriptions": "Enter a labyrinth that moves as you move, where mastering the elements is key to defeating enemies and uncovering the mysteries of this underground world. With a new experience awaiting every time you enter the dungeon, let the power bestowed by the crown guide you in this challenging adventure."}, {"name": "Torchlight II", "details_link": "https://www.metacritic.com/game/playstation-4/torchlight-ii", "publisher": "Perfect World Entertainment", "release_date": "Sep  3 2019", "developers": ["Panic Button"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/6d0ae9b3fc990fe0b670cbbffaa4db80-98.jpg", "descriptions": "Beyond the town of Torchlight lies a world shrouded in adventure and mystery. Guardian-warrior Syl appears in a prophetic dream, summoning the player to the Estherian Steppes. There, you meet with the Destroyer and soon venture across the continent of Vilderan, an exotic frontier besieged byBeyond the town of Torchlight lies a world shrouded in adventure and mystery. Guardian-warrior Syl appears in a prophetic dream, summoning the player to the Estherian Steppes. There, you meet with the Destroyer and soon venture across the continent of Vilderan, an exotic frontier besieged by forces of evil. A discovery unfolds, that the Alchemist, following his conquest of dark ember, disappeared on his quest to defeat the unknown corrupted force responsible for destroying the mystical race of Estherians. Aided by Syl, the remaining Estherian Guardians, and clues left behind by the missing Alchemist, you will find yourself battling a powerful enemy that threatens to unravel the elements of the entire world.… Expand"}, {"name": "Overcooked!", "details_link": "https://www.metacritic.com/game/xbox-one/overcooked!", "publisher": "Team17", "release_date": "Aug  3 2016", "developers": ["Ghost Town Games Ltd."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Simulation", "Arcade", "Virtual", "Career"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/8a3f736f126a1dc8a760036731694d23-98.jpg", "descriptions": "Overcooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook and serve up a variety of tasty orders before the baying customers storm out in a huff. Sharpen your knives and dust off your chef’s whites, there isn’tOvercooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook and serve up a variety of tasty orders before the baying customers storm out in a huff. Sharpen your knives and dust off your chef’s whites, there isn’t mushroom for error and the steaks are high in these crazy kitchens. [Xbox.com]… Expand"}, {"name": "Dariusburst: Chronicle Saviours", "details_link": "https://www.metacritic.com/game/pc/dariusburst-chronicle-saviours", "publisher": "Degica", "release_date": "Dec  3 2015", "developers": ["Pyramid"], "platforms": ["PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/1de59be42e7badb7ce1e027a71b35deb-98.jpg", "descriptions": "Game Features:\r - Brand-new story mode with hundreds of stages covering DARIUS history\r\n\r\n- 3000+ stages unlockable by global players in AC Chronicle mode\r\n\r\n- 9 playable ships to choose from including classic Silver Hawk variants, a new CS-exclusive ship, and gameplay-changing Burst modesGame Features:\r - Brand-new story mode with hundreds of stages covering DARIUS history\r - 3000+ stages unlockable by global players in AC Chronicle mode\r - 9 playable ships to choose from including classic Silver Hawk variants, a new CS-exclusive ship, and gameplay-changing Burst modes\r - Branching stages where you choose your own path and challenge level\r - Over 40 enormous, robotic sea-monster battleships (including new CS-exclusive bosses)\r - Haunting and memorable Zuntata soundtrack from classic tracks to new compositions\r - Cross-Save support with PlayStation(R)4Vita system… Expand"}, {"name": "Dariusburst: Chronicle Saviours", "details_link": "https://www.metacritic.com/game/playstation-4/dariusburst-chronicle-saviours", "publisher": "Degica", "release_date": "Dec  2 2015", "developers": ["Pyramid"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/531ee9414bb9c2bbf8607194c5cee380-98.jpg", "descriptions": "Game Features:\r - Brand-new story mode with hundreds of stages covering DARIUS history\r\n\r\n- 3000+ stages unlockable by global players in AC Chronicle mode\r\n\r\n- 9 playable ships to choose from including classic Silver Hawk variants, a new CS-exclusive ship, and gameplay-changing Burst modesGame Features:\r - Brand-new story mode with hundreds of stages covering DARIUS history\r - 3000+ stages unlockable by global players in AC Chronicle mode\r - 9 playable ships to choose from including classic Silver Hawk variants, a new CS-exclusive ship, and gameplay-changing Burst modes\r - Branching stages where you choose your own path and challenge level\r - Over 40 enormous, robotic sea-monster battleships (including new CS-exclusive bosses)\r - Haunting and memorable Zuntata soundtrack from classic tracks to new compositions\r - Cross-Save support with PlayStation(R)4Vita system… Expand"}, {"name": "Grandia II Anniversary Edition", "details_link": "https://www.metacritic.com/game/pc/grandia-ii-anniversary-edition", "publisher": "GungHo", "release_date": "Aug 24 2015", "developers": ["Game Arts", "GungHo", "SkyBox Labs"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/e3799219b650521f0e887cf589ce37bb-98.jpg", "descriptions": "The classic Japanese RPG returns with enhanced visuals, new difficulty level, and features both keyboard and gamepad support."}, {"name": "Assassin's Creed III", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-iii", "publisher": "Ubisoft", "release_date": "Nov 20 2012", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/e3296bc1d511e1793d5a01aada53bbbc-98.jpg", "descriptions": "Assume the role of Connor, the son of a Native American mother and English father. As a revolution is imminent, your people are threatened by a powerful movement aiming to quell the American revolution and seize control the colonies. After your village is decimated, you bind yourself to theAssume the role of Connor, the son of a Native American mother and English father. As a revolution is imminent, your people are threatened by a powerful movement aiming to quell the American revolution and seize control the colonies. After your village is decimated, you bind yourself to the cause of freedom, and set out on a decades-long quest to achieve it. Your predatory instincts, developed through years of hunting in rough tundra, enable you to pursue and kill your targets in silence. When overt combat becomes necessary, you can uncork a myriad of weapons including tomahawks, darts, and guns.… Expand"}, {"name": "TMNT", "details_link": "https://www.metacritic.com/game/game-boy-advance/tmnt", "publisher": "Ubisoft", "release_date": "Mar 20 2007", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/d558469ddc28b93c6ac7fbd280816132-98.jpg", "descriptions": "The new NT video game uses the same dark and dangerous environments and adventurous themes featured in the new NT CGI film being developed by Imagi Animation Studios and Mirage Licensing. The NT movie takes place in a New York City plagued by secretive villains and strange, otherworldlyThe new NT video game uses the same dark and dangerous environments and adventurous themes featured in the new NT CGI film being developed by Imagi Animation Studios and Mirage Licensing. The NT movie takes place in a New York City plagued by secretive villains and strange, otherworldly creatures. Faced with these perils, the Turtles will experience their most trying time as heroes and as a family, as Raphael, Donatello and Michelangelo lose their focus and struggle to maintain their unity and ninja discipline. … Expand"}, {"name": "Madden NFL 07", "details_link": "https://www.metacritic.com/game/pc/madden-nfl-07", "publisher": "EA Sports", "release_date": "Aug 22 2006", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/faea3e70feebbeac28ea7bf89b89f1e7-98.jpg", "descriptions": "With the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback andWith the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback and smash through, overpower, or slash away from would-be tacklers as you fight for every yard. Innovative rushing controls give you a game-breaking ground attack featuring all-new jukes, cutbacks, and the distinct running styles of your favorite backs. [Electronic Arts]… Expand"}, {"name": "Outlast", "details_link": "https://www.metacritic.com/game/pc/outlast", "publisher": "Red Barrels", "release_date": "Sep  4 2013", "developers": ["Red Barrels"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "Horror", "Survival"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/0fbccd865a0ed8191ba310a80fb8ea0c-98.jpg", "descriptions": "In the desolate mountains of Colorado, horrors await inside Mount Massive Asylum. An abandoned home for the mentally ill, recently re-opened by the “research and charity” branch of the transnational Murkoff Corporation, has been operating in complete secrecy… until now. Acting on a tip fromIn the desolate mountains of Colorado, horrors await inside Mount Massive Asylum. An abandoned home for the mentally ill, recently re-opened by the “research and charity” branch of the transnational Murkoff Corporation, has been operating in complete secrecy… until now. Acting on a tip from an inside source, independent journalist Miles Upshur breaks into the facility, and what he discovers walks a terrifying line between science and religion, nature and something entirely different. Once inside, his only hope of escape lies with the terrible truth at the heart of Mount Massive. … Expand"}, {"name": "The Chronicles of Riddick: Assault on Dark Athena", "details_link": "https://www.metacritic.com/game/pc/the-chronicles-of-riddick-assault-on-dark-athena", "publisher": "Atari", "release_date": "Apr  7 2009", "developers": ["Starbreeze"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/cb5197e3db6c56bb602f6fe9c5617818-98.jpg", "descriptions": "Taking advantage of new hardware technologies, this package presents a reinvention of \"Escape from Butcher Bay\", delivering 2004's award winning experience in high definition with enhancements. Also included is the Dark Athena chapter, an expansion of the original game with a new story andTaking advantage of new hardware technologies, this package presents a reinvention of \"Escape from Butcher Bay\", delivering 2004's award winning experience in high definition with enhancements. Also included is the Dark Athena chapter, an expansion of the original game with a new story and new gameplay features. With The Chronicles of Riddick: Assault on Dark Athena, players are not only be challenged to survive Butcher Bay, but also engage in a new single-player experience and, for the first time in the Riddick universe, take action in intense multi-player combat. The game introduces the ominous Merc-ship Dark Athena, which sits silent like a marauding spider, awaiting helpless prey in the dark reaches of the galaxy. Players must face a large, bloodthirsty operation led by the dreaded Captain Revas and her slaves-turned-controllable combat drones, storm though death-defying events and fight fierce enemies in a battle of malice and gore. [Sierra Entertainment]… Expand"}, {"name": "From Dust", "details_link": "https://www.metacritic.com/game/xbox-360/from-dust", "publisher": "Ubisoft", "release_date": "Jul 27 2011", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Strategy", "Miscellaneous", "Adventure", "General", "General", "General", "Puzzle", "General"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/d2a2abe97a3d847a6c0ce9040f2906cd-98.jpg", "descriptions": "From Dust is a Modern God Game where Nature is the Star."}, {"name": "Hearts of Iron II: Doomsday", "details_link": "https://www.metacritic.com/game/pc/hearts-of-iron-ii-doomsday", "publisher": "Paradox Interactive", "release_date": "Apr  7 2006", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/b340cd5590a00eddda1a35146e6be219-98.jpg", "descriptions": "As the German war machine falls, two great nations rise to claim power. In the West, there is the United States, leader of the allied nations, and in the East lies the Soviet Union under communist rule. As both nations attempt to claim superiority, a new war is waiting around the corner;As the German war machine falls, two great nations rise to claim power. In the West, there is the United States, leader of the allied nations, and in the East lies the Soviet Union under communist rule. As both nations attempt to claim superiority, a new war is waiting around the corner; this time, the conflict will decide who will be the remaining superpower. Play as the ruler of one of 175 countries through World Wars II and III. As the Allies and the Soviet Union clash in Europe, the fate of the world hangs in the balance. Hearts of Iron 2: Doomsday includes the original game and improvements requested from the previous title’s worldwide audience. World War III – Decide the remaining superpower to claim domination in world politics and warfare. Expanded tech trees with considerable detail in a new decade of warfare, allowing you to develop tactical nukes and other kinds of nuclear warfare as well as escort carriers and much more. Improved Diplomatic/Intelligence System reflects the increased political tension of the 1950s. Significantly improved AI. Tradeable Weapons – Equip your allies with the latest technological advances or get other nations to surrender their secrets to you. Complete scenario editor. [Paradox Interactive]… Expand"}, {"name": "Dishonored: The Brigmore Witches", "details_link": "https://www.metacritic.com/game/pc/dishonored-the-brigmore-witches", "publisher": "Bethesda Softworks", "release_date": "Aug 13 2013", "developers": ["Arkane Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/bdb8bfa20e1f95c87ffed95afcf7facb-98.jpg", "descriptions": "In The Brigmore Witches, continue your journey as the legendary assassin, Daud, and bring his twisted narrative that began with The Knife of Dunwall to a close. After discovering the identity and intentions of Delilah, the leader of the Brigmore Witch coven, you set out to disrupt her fromIn The Brigmore Witches, continue your journey as the legendary assassin, Daud, and bring his twisted narrative that began with The Knife of Dunwall to a close. After discovering the identity and intentions of Delilah, the leader of the Brigmore Witch coven, you set out to disrupt her from completing a powerful ritual that will spell your doom. Having already been betrayed by your lieutenant, Billie Lurk, you must rely on feuding gang factions-the Dead Eels and the Hatters-to negotiate your way through previously unseen districts of Dunwall en route to Delilah's stronghold.  Regardless of the way you reach your destination, one thing is for certain - you will finally answer for your treacherous actions and fall before the mercy, or punishment, of the Royal Bodyguard and Assassin, Corvo Attano. Additionally, your power, weapon and item upgrades, Chaos level, and player actions from The Knife of Dunwall will carry over via a compatible save file option.… Expand"}, {"name": "NBA Street Homecourt", "details_link": "https://www.metacritic.com/game/xbox-360/nba-street-homecourt", "publisher": "EA Sports Big", "release_date": "Feb 20 2007", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/5f50ebc7717e3ca661e4543998677246-98.jpg", "descriptions": "The fourth chapter in the multi-platinum selling NBA Street series expands on the fast-paced and larger-than-life 3-on-3 basketball gameplay that has made the franchise a hit. The newest iteration of NBA Street creates a hyper-real world that merges legendary courts with the hometown courtsThe fourth chapter in the multi-platinum selling NBA Street series expands on the fast-paced and larger-than-life 3-on-3 basketball gameplay that has made the franchise a hit. The newest iteration of NBA Street creates a hyper-real world that merges legendary courts with the hometown courts of your favorite NBA stars into one seamless city of streetball moments. Earn a name for yourself and garner respect as you progress along your hometown journey and become a legend. [Electronic Arts]… Expand"}, {"name": "Disgaea 4: A Promise Unforgotten", "details_link": "https://www.metacritic.com/game/playstation-3/disgaea-4-a-promise-unforgotten", "publisher": "NIS America", "release_date": "Sep  6 2011", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/1fdb63b1a8f325f15d1c5fcdc52bd721-98.jpg", "descriptions": "Disgaea 4 is a sequel to Disgaea, a hardcore, turn-based, strategy RPG popular on the PlayStation 3 and PlayStation 2. In Disgaea, character units have a limit to their movement and attack ranges, based on level and weapons equipped. There are other special game factors that let you takeDisgaea 4 is a sequel to Disgaea, a hardcore, turn-based, strategy RPG popular on the PlayStation 3 and PlayStation 2. In Disgaea, character units have a limit to their movement and attack ranges, based on level and weapons equipped. There are other special game factors that let you take advantage of the 3D\rbattle map, many of which are unique to Disgaea. As the 4th installment in the series Disgaea 4 adopts an all new graphic engine with a much more emphasis on a anime style graphics and also adopts many new game system for an exciting battle adventure.… Expand"}, {"name": "Virginia", "details_link": "https://www.metacritic.com/game/xbox-one/virginia", "publisher": "505 Games", "release_date": "Sep 22 2016", "developers": ["505 Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 80, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/3225d4b368946b984d6aa85b34dc7296-98.jpg", "descriptions": "Virginia is a single-player first-person thriller set in a small town with a secret. Experience a missing person’s investigation through the eyes of graduate FBI agent Anne Tarver."}, {"name": "Marvel's Guardians of the Galaxy", "details_link": "https://www.metacritic.com/game/playstation-5/marvels-guardians-of-the-galaxy", "publisher": "Square Enix", "release_date": "Oct 26 2021", "developers": ["Eidos Montreal"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action Adventure", "Linear"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/2349ba7a3ef2f0c94f7a2de8006da704-98.jpg", "descriptions": "Fire up Star-Lord’s jet boots for a wild ride across the cosmos in this third-person action-adventure game, a fresh take on Marvel’s Guardians of the Galaxy. With the unpredictable Guardians at your side, blast your way from one explosive situation to another, with original and iconic MarvelFire up Star-Lord’s jet boots for a wild ride across the cosmos in this third-person action-adventure game, a fresh take on Marvel’s Guardians of the Galaxy. With the unpredictable Guardians at your side, blast your way from one explosive situation to another, with original and iconic Marvel characters caught in a struggle for the fate of the universe. You got this. Probably.… Expand"}, {"name": "Oxenfree", "details_link": "https://www.metacritic.com/game/pc/oxenfree", "publisher": "Night School Studio", "release_date": "Jan 14 2016", "developers": ["Night School Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/93337bd525647fb5b4c742b07bfad210-98.jpg", "descriptions": "Oxenfree is a supernatural thriller about a gaggle of friends who inadvertently open a ghostly rift. You assume the role of Alex, and you’ve just brought your new stepbrother Jonas to an overnight island party gone horribly wrong."}, {"name": "Injustice: Gods Among Us - Ultimate Edition", "details_link": "https://www.metacritic.com/game/playstation-4/injustice-gods-among-us---ultimate-edition", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 12 2013", "developers": ["NetherRealm Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/64c1c28835dc3a289ab96f72b2f182de-98.jpg", "descriptions": "What if our greatest heroes became our greatest threat? Injustice: Gods Among Us Ultimate Edition features DC Comics icons such Batman, Cyborg, The Flash, Harley Quinn, Nightwing, Solomon Grundy, Superman and Wonder Woman, in a dark tale of power and corruption. Heroes and villains engage inWhat if our greatest heroes became our greatest threat? Injustice: Gods Among Us Ultimate Edition features DC Comics icons such Batman, Cyborg, The Flash, Harley Quinn, Nightwing, Solomon Grundy, Superman and Wonder Woman, in a dark tale of power and corruption. Heroes and villains engage in epic battles on a massive scale in a world where the line between good and evil has been blurred.… Expand"}, {"name": "Mutant Mudds", "details_link": "https://www.metacritic.com/game/3ds/mutant-mudds", "publisher": "Renegade Kid", "release_date": "Jan 26 2012", "developers": ["Renegade Kid"], "platforms": ["iPhone/iPad", "PC", "3DS"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/487d91e6a419c196366bd6ba6787022f-98.jpg", "descriptions": "Mutant Mudds is an exciting new platform game for the Nintendo 3DS from award-winning developer, Renegade Kid. This marks the company's first self-published title, available exclusively on the Nintendo 3DS eShop in 2011.\r Our hero may be a 2D sprite, but he can take advantage of the thirdMutant Mudds is an exciting new platform game for the Nintendo 3DS from award-winning developer, Renegade Kid. This marks the company's first self-published title, available exclusively on the Nintendo 3DS eShop in 2011.\r Our hero may be a 2D sprite, but he can take advantage of the third dimension by jetting between the background and the foreground playfields in this unique dimensionally-woven platform adventure (the stereo 3D effect looks amazing on the 3DS).\r Armed with a heavy-duty water cannon and H20-powered jet pack, Max steps out onto the porch of his (parents') home; determined to thwart the filthy plans of the Mutant Mudd army by blasting and hovering his way across the soiled landscape.… Expand"}, {"name": "Codename: Panzers, Phase Two", "details_link": "https://www.metacritic.com/game/pc/codename-panzers-phase-two", "publisher": "cdv Software", "release_date": "Jul 25 2005", "developers": ["Stormregion"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/22f4e26b2313146988a44567253a10dc-98.jpg", "descriptions": "The greatest part of the axis campaign in Phase Two takes place in Africa. And the missions are with the Allies residing in Italy. Whoever finishes both campaigns gets to enjoy a bonus campaign in Yugoslavia. The story is more important to us in comparison to its predecessor. That's why weThe greatest part of the axis campaign in Phase Two takes place in Africa. And the missions are with the Allies residing in Italy. Whoever finishes both campaigns gets to enjoy a bonus campaign in Yugoslavia. The story is more important to us in comparison to its predecessor. That's why we commissioned a world-famous author. We've built over 20 new units. The Italians now have the M13/40, the Carro Armato and the Semovente ATGs. The Allies, on the other hand, will have the M3 Grant/Lee, the Daimler Dingo and the Bofors 40mm Halftrack. An important feature is the various types of new buildings. It's possible in Phase Two to destroy parts of certain structures. For example, you can destroy only the watch towers of a palace. [CDV - Producer Interview Exerpts]… Expand"}, {"name": "Tokyo Mirage Sessions #FE", "details_link": "https://www.metacritic.com/game/wii-u/tokyo-mirage-sessions-fe", "publisher": "Nintendo", "release_date": "Jun 24 2016", "developers": ["Atlus"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["General", "Fantasy", "Role-Playing", "Strategy", "Turn-Based", "Japanese-Style", "General"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/42cb1d658422ca1ee46796358a52b5fc-98.jpg", "descriptions": "An Atlus-developed RPG for Wii U set in a modern-day world of music and art featuring characters and gameplay elements from Intelligent System's Fire Emblem franchise mixed with elements from the Shin Megami Tensei franchise."}, {"name": "Full Spectrum Warrior", "details_link": "https://www.metacritic.com/game/pc/full-spectrum-warrior", "publisher": "THQ", "release_date": "Sep 21 2004", "developers": ["Pandemic Studios"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/0f82affcc35d54976f71f16be78ab37f-98.jpg", "descriptions": "Full Spectrum Warrior is based on a game commissioned by the U.S. Army to train light Infantry troops in urban combat situations. Soldiers are placed in a tense, hostile, and claustrophobic environment where they must complete a variety of military objectives. Players act as the SquadFull Spectrum Warrior is based on a game commissioned by the U.S. Army to train light Infantry troops in urban combat situations. Soldiers are placed in a tense, hostile, and claustrophobic environment where they must complete a variety of military objectives. Players act as the Squad Leader, providing direction to Alpha and Bravo fire teams. The successful Squad Leader effectively uses cover in the environment and moves his fire teams in a coordinated fashion so they can protect themselves from possible attacks that could come from any direction. Full Spectrum Warrior puts you in the dirt with your men, where danger lurks around every corner. [THQ]… Expand"}, {"name": "Mega Man Zero / ZX Legacy Collection", "details_link": "https://www.metacritic.com/game/xbox-one/mega-man-zero-zx-legacy-collection", "publisher": "Capcom", "release_date": "Feb 25 2020", "developers": ["Capcom", "Access Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/f7cafd292717dd27007709b183e1eca3-98.jpg", "descriptions": "Mega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent.In addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual ScenarioMega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent.In addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual Scenario Mode and a Save-Assist feature are available for those who would like to enjoy the story at their own pace. Players can also try their hand at the new leaderboard-based Z Chaser Mode, an exclusive new mode created just for this set of games.… Expand"}, {"name": "Duke Nukem 3D", "details_link": "https://www.metacritic.com/game/xbox-360/duke-nukem-3d", "publisher": "3D Realms", "release_date": "Sep 24 2008", "developers": ["3D Realms"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/c2b4fd7d04ff16d677511623b3d34536-98.jpg", "descriptions": "[Xbox Live Arcade]  Duke Nukem, the politically incorrect action hero and ultimate alien ass kicker, defends Earth and its babes from alien invasion in Duke Nukem 3D. This is the award winning game that helped define the FPS genre, introducing unparalleled interactivity, and a main character[Xbox Live Arcade]  Duke Nukem, the politically incorrect action hero and ultimate alien ass kicker, defends Earth and its babes from alien invasion in Duke Nukem 3D. This is the award winning game that helped define the FPS genre, introducing unparalleled interactivity, and a main character that spoke. Take the fight to the aliens across 39 levels featuring Hollywood, Los Angeles, a moon base, and alien spacecraft. Innovative items like the Jetpack, HoloDuke, Shrink Ray, or Pipe Bombs allow you to fight the aliens in any style you want. Defeat the aliens, so Duke can get back to some R&R with a stogie, a warm belly, and a bottle of Jack. [3D Realms]… Expand"}, {"name": "Teardown", "details_link": "https://www.metacritic.com/game/pc/teardown", "publisher": "Tuxedo Labs", "release_date": "Apr 21 2022", "developers": ["Tuxedo Labs"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/0ce1563fcfac2b1b2eb96582f2a1872a-98.jpg", "descriptions": "Prepare the perfect heist in this simulated and fully destructible voxel world. Tear down walls with vehicles or explosives to create shortcuts. Stack objects to reach higher. Use the environment to your advantage in the most creative way you can think of."}, {"name": "Mega Man Anniversary Collection", "details_link": "https://www.metacritic.com/game/xbox/mega-man-anniversary-collection", "publisher": "Capcom", "release_date": "Mar 15 2005", "developers": ["Atomic Planet Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/a0d8866d5c9fe44840e2438fc48d6d4b-98.jpg", "descriptions": "For 15 years, Mega Man games have appeared on consoles, and now you can play ten of them on one disc.  Mega Man Anniversary Collection includes the first eight Mega Man games plus two that were never-before-released in the U.S.  See how Mega Man has crossed into other media by watchingFor 15 years, Mega Man games have appeared on consoles, and now you can play ten of them on one disc.  Mega Man Anniversary Collection includes the first eight Mega Man games plus two that were never-before-released in the U.S.  See how Mega Man has crossed into other media by watching unlockable bonus features, including footage from the original Mega Man TV Series, over 30 original artwork selections, and remixed music tracks inspired by the series.  … Expand"}, {"name": "Pro Evolution Soccer 2008", "details_link": "https://www.metacritic.com/game/psp/pro-evolution-soccer-2008", "publisher": "Konami", "release_date": "Mar 11 2008", "developers": ["Konami"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 80, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/01c96be18f5338a59c535aef29c86505-98.jpg", "descriptions": "PES 2008 features a brand new intelligence system, called Teamvision, that adapts and reacts to players own gameplay styles to ensure that the computer controlled opponents are always challenging and forcing the player to think and chance their style of play to avoid being out-thought by thePES 2008 features a brand new intelligence system, called Teamvision, that adapts and reacts to players own gameplay styles to ensure that the computer controlled opponents are always challenging and forcing the player to think and chance their style of play to avoid being out-thought by the game. It learns counter attacks that target your weaknesses and look to exploit any repetitive tactics players use. Defenders react better to danger, closing down the ball and charging at shots and the goalkeepers hold shots that are closer to them as well. Teammates make more intelligent runs into space and the close control has been sharpened to ensure quick and fluid passing and speedy attacks can be built. The next gen versions also feature extensive edit modes so players can completely customise their PES 2008 experience. [Konami]… Expand"}, {"name": "Baten Kaitos: Eternal Wings and the Lost Ocean", "details_link": "https://www.metacritic.com/game/gamecube/baten-kaitos-eternal-wings-and-the-lost-ocean", "publisher": "Namco", "release_date": "Nov 16 2004", "developers": ["Monolith Soft"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/ff8ed3b402a77b66cb92d6cef6cf9348-98.jpg", "descriptions": "The story of Baten Kaitos: Eternal Wings and the Lost Ocean takes place in a time when lands exist in the sky and once vast oceans are mere legend among men. In the game, you'll control a spirit that guides Kalas throughout his journey and fights by his side. Collect more than 1,000 types ofThe story of Baten Kaitos: Eternal Wings and the Lost Ocean takes place in a time when lands exist in the sky and once vast oceans are mere legend among men. In the game, you'll control a spirit that guides Kalas throughout his journey and fights by his side. Collect more than 1,000 types of Magnus cards to help you fight, heal yourself, solve puzzles, and more. Get ready to unlock the mystery of the lost sea in a story of friendship, betrayal, and prayer.… Expand"}, {"name": "The Banner Saga 1", "details_link": "https://www.metacritic.com/game/switch/the-banner-saga-1", "publisher": "Stoic", "release_date": "May 17 2018", "developers": ["Stoic"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/3cc0a13b51238c849d4d1a216980d0b8-98.jpg", "descriptions": "The Banner Saga is an epic role-playing game inspired by Viking legend. Hand-painted landscapes portray a world eerily suspended in perpetual twilight. Cities and towns begin to crumble into chaos. Heroes abandon their hearths and homes to traverse the snowy countryside, gaining allies alongThe Banner Saga is an epic role-playing game inspired by Viking legend. Hand-painted landscapes portray a world eerily suspended in perpetual twilight. Cities and towns begin to crumble into chaos. Heroes abandon their hearths and homes to traverse the snowy countryside, gaining allies along the way to help battle a strange, new threat.\r Decisions have consequences; wise choices must be made when conversing with possible allies during intricately crafted dialogues. Turn-based strategy brings tactical challenge in hand-animated battle sequences. With visuals evocative of the golden age of animation, The Banner Saga brings skillfully crafted art, story and strategy to gamers waiting to re-experience classic adventures and tactics.… Expand"}, {"name": "Tetris", "details_link": "https://www.metacritic.com/game/playstation-3/tetris", "publisher": "Electronic Arts", "release_date": "Jan  4 2011", "developers": ["EA Mobile"], "platforms": "PlayStation 3", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Stacking", "Stacking"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/3ad44ae2d6be96875cbb5ded7256e351-98.jpg", "descriptions": "The first Tetris game for the PlayStation 3 will feature a variety of online and offline multiplayer modes in cooperative and competitive flavors."}, {"name": "Gunman Clive 2", "details_link": "https://www.metacritic.com/game/3ds/gunman-clive-2", "publisher": "Horberg Productions", "release_date": "Jan 20 2015", "developers": ["Horberg Productions"], "platforms": ["PC", "3DS"], "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/0b4b89fc165560e2945816ffe8470392-98.jpg", "descriptions": "After successfully rescuing Mayor Johnson's daughter, Gunman Clive returns to again find his home town under attack by bandits. To stop them once and for all, he must chase after their leader; an adventure that takes him all the way around the world. This follow up to the 2012 indie releaseAfter successfully rescuing Mayor Johnson's daughter, Gunman Clive returns to again find his home town under attack by bandits. To stop them once and for all, he must chase after their leader; an adventure that takes him all the way around the world. This follow up to the 2012 indie release retains the same classic gameplay formula, but dials the action up a notch further and adds many new features and improvements.… Expand"}, {"name": "Renegade Ops", "details_link": "https://www.metacritic.com/game/playstation-3/renegade-ops", "publisher": "Sega", "release_date": "Sep 13 2011", "developers": ["Avalanche Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/2f41be9aed51f102bc14ec9370b2cdaa-98.jpg", "descriptions": "Renegade Ops puts players in a mobile commando unit sent behind enemy lines to defeat Inferno, a madman intent on global domination. Defeat enemies across a range of stunning environments using a wide variety of vehicles, from dispersing electromagnetic shock waves to the deployment of aRenegade Ops puts players in a mobile commando unit sent behind enemy lines to defeat Inferno, a madman intent on global domination. Defeat enemies across a range of stunning environments using a wide variety of vehicles, from dispersing electromagnetic shock waves to the deployment of a huge Gatling gun armed to the teeth. Players have the choice to fight alone in single player mode, team up offline with two-player split screen or join the dynamic 4-player online co-op experience. Blast your way through enemy lines by working together, or compete for achievements as you and your friends aim to top the online leader boards.… Expand"}, {"name": "Darwinia+", "details_link": "https://www.metacritic.com/game/xbox-360/darwinia+", "publisher": "Introversion", "release_date": "Feb 10 2010", "developers": ["Introversion"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 80, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/235b6d980fc62a4eaa4e6128599f4ac5-98.jpg", "descriptions": "[Xbox Live Arcade]  Over thousands of generations the peaceful Darwinians have been evolving in a beautiful digital world, but now their whole way of life is under threat from a devastating computer virus that has infected their world and decimated their numbers. Without your protection they[Xbox Live Arcade]  Over thousands of generations the peaceful Darwinians have been evolving in a beautiful digital world, but now their whole way of life is under threat from a devastating computer virus that has infected their world and decimated their numbers. Without your protection they don't stand a chance, and it’s up to you to lead them into battle to recapture their lost world in Darwinia+! Once you've proven your command ability, take your Darwinian army online and challenge your friends to strategic combat, as tribes of Darwinians slaughter one another in a desperate struggle for supremacy. [Introversion Software]… Expand"}, {"name": "The Darkness II", "details_link": "https://www.metacritic.com/game/xbox-360/the-darkness-ii", "publisher": "2K Games", "release_date": "Feb  7 2012", "developers": ["Digital Extremes"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/4d5e1cfb1c5b4fd7f5c728460d8c5879-98.jpg", "descriptions": "Inspired by the comic book series, The Darkness II is a first-person shooter that thrusts you into the role of Jackie Estacado, don of a New York crime family and wielder of an ancient chaotic force known as The Darkness. It has been 2 years since Jackie used his power to kill the guysInspired by the comic book series, The Darkness II is a first-person shooter that thrusts you into the role of Jackie Estacado, don of a New York crime family and wielder of an ancient chaotic force known as The Darkness. It has been 2 years since Jackie used his power to kill the guys responsible for his girlfriend’s murder. He has been unable to free himself of the  memory of Jenny’s death since bottling up The Darkness and now it wants out. A botched attempt to end Jackie’s life opens the door for The Darkness to reemerge and sets Jackie on a brutal journey as he unravels the mystery behind the attack and the motives of The Darkness. [2K Games]… Expand"}, {"name": "WindJammers 2", "details_link": "https://www.metacritic.com/game/xbox-one/windjammers-2", "publisher": "DotEmu", "release_date": "Jan 20 2022", "developers": ["DotEmu"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Sports", "Individual", "Other"], "meta_score": 80, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/6e03703e633e096bfeca91ae5f4b829b-98.jpg", "descriptions": "The best flying disc game of all time is back! With amazing hand-drawn graphics, crazy new moves, gameplay mechanics and awesome new characters and stages, Windjammers 2 is the sequel you've been dreaming of."}, {"name": "Dragon Age: Origins - Awakening", "details_link": "https://www.metacritic.com/game/playstation-3/dragon-age-origins---awakening", "publisher": "Electronic Arts", "release_date": "Mar 16 2010", "developers": ["BioWare"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/8b8a6d9d8b979cc64127d8d12f6f14e2-98.jpg", "descriptions": "Designed and written by the same team that brought you Dragon Age: Origins, the Awakening expansion pack offers a brand new area of the world to explore known as Amaranthine, featuring an epic story that will allow players to unravel the secrets of the darkspawn - and their true motivations!Designed and written by the same team that brought you Dragon Age: Origins, the Awakening expansion pack offers a brand new area of the world to explore known as Amaranthine, featuring an epic story that will allow players to unravel the secrets of the darkspawn - and their true motivations!  Players face a range of horrific and terrifying creatures including an evolved, intelligent breed of darkspawn and other menacing creatures such as the Inferno Golem and Spectral Dragon.  Dragon Age: Origins – Awakening provides exciting new ways for players to customize their heroes and party, including the ability to re-spec their character attributes, allowing even greater customization and replayability.  Featuring an increased level cap, new spells, abilities, specializations and items, plus five all-new party members, players can continue their adventures from Dragon Age: Origins, or begin with a brand new character. [BioWare]… Expand"}, {"name": "AI War: Fleet Command", "details_link": "https://www.metacritic.com/game/pc/ai-war-fleet-command", "publisher": "Arcen Games, LLC", "release_date": "May 14 2009", "developers": ["Arcen Games", "LLC"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/408f82d40eb4d9bcd09f2438284bd5df-98.jpg", "descriptions": "Space-based RTS, single player or up to 8 player co-op. Powerful emergent AI that retreats, probes defenses, and surprises even veterans with intelligent tactics. 30,000+ ships at a time on 10-120 simultaneous planetary battlefields. Different Every Time: 16 billion procedural maps, eachSpace-based RTS, single player or up to 8 player co-op. Powerful emergent AI that retreats, probes defenses, and surprises even veterans with intelligent tactics. 30,000+ ships at a time on 10-120 simultaneous planetary battlefields. Different Every Time: 16 billion procedural maps, each with specific units. - A focus on deep strategy with nearly no micromanagement. [Arcen Games]… Expand"}, {"name": "Final Fantasy Crystal Chronicles", "details_link": "https://www.metacritic.com/game/gamecube/final-fantasy-crystal-chronicles", "publisher": "Nintendo", "release_date": "Feb  9 2004", "developers": ["Square Enix"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/0/508d97aad08d65471660eccbd1b5ffc1-98.jpg", "descriptions": "The Final Fantasy series explodes onto the GameCube with action-packed multiplayer gameplay and an epic storyline seeped in Final Fantasy style and lore.  Final Fantasy: Crystal Chronicles tells the tale of a land covered in poisonous miasma where people depend on precious crystals to stayThe Final Fantasy series explodes onto the GameCube with action-packed multiplayer gameplay and an epic storyline seeped in Final Fantasy style and lore.  Final Fantasy: Crystal Chronicles tells the tale of a land covered in poisonous miasma where people depend on precious crystals to stay alive.  By using Game Boy Advance systems as controllers, four players can team up to solve puzzles, defeat enemies, and survive in a land teeming with danger.  While much of the gameplay involves hacking and slashing through colorful monsters, Crystal Chronicles is all about teamwork.… Expand"}, {"name": "NFL Street", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-street", "publisher": "EA Sports", "release_date": "Jan 13 2004", "developers": ["EA Tiburon"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 80, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/bc9275d1cf60854b625fa7a1b2116f22-98.jpg", "descriptions": "Hard-hitting 7-on-7 arcade gameplay challenges players to show their skills on both offense and defense. Big jukes with bone-crunching tackles, pitches, and a wealth of showboat moves are available. Create a player and build a team, filling all positions. Choose from hundreds of swappableHard-hitting 7-on-7 arcade gameplay challenges players to show their skills on both offense and defense. Big jukes with bone-crunching tackles, pitches, and a wealth of showboat moves are available. Create a player and build a team, filling all positions. Choose from hundreds of swappable clothing, accessories, colors and logos. NFL Challenge: Bulldoze through 31 teams while building the ultimate team with dozens of unlockables. Pick Up Game: You're always the captain and you take turns with your opponent, selecting your team from 40 randomly selected NFL stars. More than 300 current NFL stars and legends such as Barry Sanders. Each player model exaggerates the real-life features of their counterparts. Great plays earn Showboat points which will eventually reward gamers with a Gamebreaker. Gamebreakers put a player into \"the zone\" where they can plow through the opposing team or knock the ball loose on defense. Online Play for PlayStation 2: Rule the streets from coast-to-coast. [Electronic Arts]… Expand"}, {"name": "The King of Fighters EX2: Howling Blood", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-king-of-fighters-ex2-howling-blood", "publisher": "Atlus Co.", "release_date": "Dec 11 2003", "developers": ["Marvelous"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/5efd6d5f57cb0ea77a2de6eea84bf430-98.jpg", "descriptions": "In The King of Fighters EX 2: Howling Blood, you can play as or against 21 characters from the King of Fighters series, including three characters that are exclusive to this version. Each new match gives you an opportunity to refine your fighting skills, unlock secrets, and master powerfulIn The King of Fighters EX 2: Howling Blood, you can play as or against 21 characters from the King of Fighters series, including three characters that are exclusive to this version. Each new match gives you an opportunity to refine your fighting skills, unlock secrets, and master powerful moves. If you need help during a match, you can call on your partner to temporarily fight by your side. Perfect your fighting strategy in a variety of gameplay modes, such as 3-VS-3 Battle, two-player VS, and Story.… Expand"}, {"name": "Freedom Fighters", "details_link": "https://www.metacritic.com/game/pc/freedom-fighters", "publisher": "EA Games", "release_date": "Oct  1 2003", "developers": ["Io Interactive"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/50885b3a52210a08181e0dd470116091-98.jpg", "descriptions": "Wars are not won alone. In a world where the Soviet Union won the Cold War, a fierce conflict is beginning to unfold in the streets of America. Red Army troops are pouring across the borders of Mexico and Canada shortly after a nuclear missile is unleashed on Washington D.C. Chaos sets inWars are not won alone. In a world where the Soviet Union won the Cold War, a fierce conflict is beginning to unfold in the streets of America. Red Army troops are pouring across the borders of Mexico and Canada shortly after a nuclear missile is unleashed on Washington D.C. Chaos sets in when breaking news informs Americans that their President has been killed and the Russians have invaded the country. You take on the role of Christopher Walker, a man who evolves into a charismatic and fearless freedom fighter obsessed with finding and freeing his brother in the streets of occupied New York City. [Electronic Arts]… Expand"}, {"name": "Wakeboarding Unleashed Featuring Shaun Murray", "details_link": "https://www.metacritic.com/game/xbox/wakeboarding-unleashed-featuring-shaun-murray", "publisher": "Activision", "release_date": "Jun 10 2003", "developers": ["Shaba Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Wakeboarding"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/53d70d61693108c61f30695bf479baa2-98.jpg", "descriptions": "Wakeboarding Unleashed rips you across a lake by a high-powered speedboat as you perform tricks through dangerous terrain. As one of seven world-class wakeboarders, you'll crash into houseboats and catch huge air in nine exotic levels. If you become too tired, then drive the boat and helpWakeboarding Unleashed rips you across a lake by a high-powered speedboat as you perform tricks through dangerous terrain. As one of seven world-class wakeboarders, you'll crash into houseboats and catch huge air in nine exotic levels. If you become too tired, then drive the boat and help your friend pull off challenging technical tricks on the water. Wakeboarding Unleashed takes wakeboarding to the next level with realistic water, unique interaction with the rope, and a fun cooperative mode.… Expand"}, {"name": "NBA Live 2003", "details_link": "https://www.metacritic.com/game/pc/nba-live-2003", "publisher": "Electronic Arts", "release_date": "Nov 14 2002", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/74eb51110ea81de186cece67f4d22704-98.jpg", "descriptions": "Revolutionary Hand Control: Unprecedented control over both hands lets you make lightning-quick steals, monster shot blocks, and crossover dribbles. NBA Speed, NBA Power: Hundreds of new animations, including new signature moves. \"D Up\": Amazing control and new shot blocking animations bringRevolutionary Hand Control: Unprecedented control over both hands lets you make lightning-quick steals, monster shot blocks, and crossover dribbles. NBA Speed, NBA Power: Hundreds of new animations, including new signature moves. \"D Up\": Amazing control and new shot blocking animations bring defense to life. Real NBA Coaches: All the NBA head coaches are courtside in full 3D, reacting to the on-court action. Brand-new Commentary: Over 5,000 new lines keep the commentary fresh throughout the entire LIVE season. [EA Sports]… Expand"}, {"name": "Colin McRae Rally 2.0", "details_link": "https://www.metacritic.com/game/game-boy-advance/colin-mcrae-rally-20", "publisher": "Ubisoft", "release_date": "Sep 16 2002", "developers": ["Spellbound"], "platforms": "Game Boy Advance", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/6574d088031ee12ee1f14d9f667ca1fa-98.jpg", "descriptions": "The popular rally driving game comes to the Game Boy Advance."}, {"name": "Capcom vs. SNK", "details_link": "https://www.metacritic.com/game/dreamcast/capcom-vs-snk", "publisher": "Capcom", "release_date": "Nov  9 2000", "developers": ["Capcom"], "platforms": "Dreamcast", "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/823cbce49d5e455616a46ae0732f2342-98.jpg", "descriptions": "nster corporations at war. One solution. A massive martial arts event is organized to settle the score and eliminate conflict between the two parties. Join over 25 brawlers from Camcom's legendary Street Fighter® and SNK's world-renowned King of Fighters™ series as they fight fornster corporations at war. One solution. A massive martial arts event is organized to settle the score and eliminate conflict between the two parties. Join over 25 brawlers from Camcom's legendary Street Fighter® and SNK's world-renowned King of Fighters™ series as they fight for universal domination. Capcom vs. SNK... the ultimate collision of strength and power.… Expand"}, {"name": "Starcraft 64", "details_link": "https://www.metacritic.com/game/nintendo-64/starcraft-64", "publisher": "Nintendo", "release_date": "Jun 13 2000", "developers": ["Mass Media"], "platforms": "Nintendo 64", "genres": ["Strategy", "Real-Time", "Sci-Fi"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/caf2558dd7674f55ef4c8540e35ad943-98.jpg", "descriptions": "In the distant future, a small group of human exiles have been doomed to fight for their survival on the edge of the universe. Three powerful species, the Terrans, Protoss and Zerg, are locked in a fierce battle over the fate of the galaxy. The time for war has come. Manage resources, buildIn the distant future, a small group of human exiles have been doomed to fight for their survival on the edge of the universe. Three powerful species, the Terrans, Protoss and Zerg, are locked in a fierce battle over the fate of the galaxy. The time for war has come. Manage resources, build armies, devise strategies and master the specialized technologies of each species as you enter a universe of unparalleled tactical excitement. Over 50 single-player missions, including new scenarios specially created for the N64.… Expand"}, {"name": "Final Fantasy Anthology", "details_link": "https://www.metacritic.com/game/playstation/final-fantasy-anthology", "publisher": "Square EA", "release_date": "Sep 30 1999", "developers": ["SquareSoft"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/b2ba57ac65d550fb08b97c088499408e-98.jpg", "descriptions": "Final Fantasy Anthology combines two titles from the Final Fantasy series and offers PlayStation owners a glimpse into the past.  Huge worlds, in-depth storylines, and innovative battle and magic systems, and an incredible cast of characters all make for a deep gaming experience.  TheFinal Fantasy Anthology combines two titles from the Final Fantasy series and offers PlayStation owners a glimpse into the past.  Huge worlds, in-depth storylines, and innovative battle and magic systems, and an incredible cast of characters all make for a deep gaming experience.  The inclusion of Final Fantasy V marks the first time this title has appeared on a console in North America.  Final Fantasy VI, originally released as Final Fantasy III on the SNES system in the U.S., makes its first appearance on the PlayStation.  Both games in this compilation feature never-before-seen CG movies, adding to the appeal of these classics.  … Expand"}, {"name": "Pokemon Sword / Shield Dual Pack", "details_link": "https://www.metacritic.com/game/switch/pokemon-sword-shield-dual-pack", "publisher": "Nintendo", "release_date": "Nov 15 2019", "developers": ["Game Freak"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 80, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/bcba86f801821b425874e61850f37845-98.jpg", "descriptions": "A new generation of Pokémon has come to the Nintendo Switch system. Become a Pokémon Trainer, embark on a new journey in the new Galar region, and unravel the mystery behind the Legendary Pokémon Zacian and Zamazenta! Explore the Wild Area, a vast expanse of land where the player can freelyA new generation of Pokémon has come to the Nintendo Switch system. Become a Pokémon Trainer, embark on a new journey in the new Galar region, and unravel the mystery behind the Legendary Pokémon Zacian and Zamazenta! Explore the Wild Area, a vast expanse of land where the player can freely control the camera. And participate in Max Raid Battles** in which players will face off against gigantic and super-strong Pokémon known as Dynamax Pokémon. Begin your adventure by choosing one of three new partner Pokémon: Grookey, Scorbunny, or Sobble and encounter new and familiar Pokémon as you catch, battle, and trade. Players can control the camera and explore the vast areas around them in the Wild Area. Team up with other players locally or online in the new multiplayer co-op Max Raid Battles. Trainers who possess the special item Dynamax Band can Dynamax their own Pokémon. Get ready for the next Pokémon adventure in the Pokémon Sword and Pokémon Shield games.\r * Catch, battle, and trade Pokémon on an all-new adventure in the Galar region\r* Choose from three new partner Pokémon and encounter never-before-seen Pokémon\r* Unravel the mystery behind the Legendary Pokémon Zacian and Zamazenta!\r* Players can control the camera in the vast Wild Area\r* Team up with other Trainers to participate in Max Raid Battles**!\r* Battle wild Dynamax Pokémon in Max Raid Battles and try catching them**\r ** Nintendo Switch Online membership (sold separately) and Nintendo Account required for online play. Not available in all countries. Internet access required for online features. Terms apply. nintendo.com/switch-online **… Expand"}, {"name": "New Super Mario Bros. U Deluxe", "details_link": "https://www.metacritic.com/game/switch/new-super-mario-bros-u-deluxe", "publisher": "Nintendo", "release_date": "Jan 11 2019", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/659a73aeaa8705315e1e9e46e4c5b990-98.jpg", "descriptions": "Join Mario, Luigi, and pals for single-player or multiplayer fun anytime, anywhere. Take on two family-friendly, side-scrolling adventures with up to three friends* as you try to save the Mushroom Kingdom. Includes the New Super Mario Bros. U and harder, faster New Super Luigi U games—bothJoin Mario, Luigi, and pals for single-player or multiplayer fun anytime, anywhere. Take on two family-friendly, side-scrolling adventures with up to three friends* as you try to save the Mushroom Kingdom. Includes the New Super Mario Bros. U and harder, faster New Super Luigi U games—both of which include Nabbit and Toadette as playable characters. Two games in one. Simple, straightforward controls, new playable characters optimized for younger and less-experienced players, and a wealth of bonus content—like a Hints gallery and helpful reference videos**—make this a perfect choice for anyone looking to introduce their family to the wonderful world of Mario. All a player needs is one Joy-Con controller, so two people can team up right out of the box! Tackle 164 platforming courses in the two main game modes and enjoy extra replayability with three additional game modes in which you can also play as a Mii character: Challenges, Boost Rush, and Coin Battle.… Expand"}, {"name": "Luftrausers", "details_link": "https://www.metacritic.com/game/playstation-3/luftrausers", "publisher": "Devolver Digital", "release_date": "Mar 18 2014", "developers": ["Vlambeer"], "platforms": ["PC", "PlayStation Vita", "PlayStation 3"], "genres": ["General", "Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/824d050b79c682fddd6406c156d821af-98.jpg", "descriptions": "Luftrausers is an arcade-style aerial combat shooter where ace pilots will be able to customize their own \"rauser\" and battle wily enemy fighters amongst the clouds or charge colossal battleships scattered across the open seas."}, {"name": "The Elder Scrolls III: Tribunal", "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-iii-tribunal", "publisher": "Bethesda Softworks", "release_date": "Nov  6 2002", "developers": ["Bethesda Softworks"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/c0e5c46e48a26918ebf1569fe4806acc-98.jpg", "descriptions": "A ruthless new king has taken the throne of Morrowind, while an aging god drifts deeper into madness. Continue your epic journey into vast new cities, and through massive, epic-sized dungeons. The fate of Morrowind is in your hands again. [Bethesda Softworks]"}, {"name": "The Legend of Heroes: Trails from Zero", "details_link": "https://www.metacritic.com/game/playstation-4/the-legend-of-heroes-trails-from-zero", "publisher": "NIS America", "release_date": "Sep 27 2022", "developers": ["Falcom"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/fe9ab0f5ab953fef7888886287b7029f-98.jpg", "descriptions": "The Crossbell State, located in western Zemlya--Once the site of fierce territorial battles, it has since developed into one of the continent's leading trade and financial centers.\n\nHowever, pressure from the Erebonian Empire and the Calvard Republic is steadily increasing. While corruptThe Crossbell State, located in western Zemlya--Once the site of fierce territorial battles, it has since developed into one of the continent's leading trade and financial centers.However, pressure from the Erebonian Empire and the Calvard Republic is steadily increasing. While corrupt officials from both sides remain locked in political disputes, the mafia and underground criminal organizations are preparing to start a war.In the midst of all this chaos, the Crossbell Police Department has lost the trust of its people.Among them are Lloyd Bannings, a rookie agent,Elie MacDowell, granddaughter of Crossbell's mayor,Tio Plato, a young sorcereress who wields an orbal staff,and Randy Orlando, a former security guard.The foursome are assigned to a new department, the Special Support Section, where they are left with no choice but to join forces in the face of adversity.This is a story about four unlikely heroes fighting to overcome the walls defining their way of life.… Expand"}, {"name": "Trials Fusion", "details_link": "https://www.metacritic.com/game/xbox-one/trials-fusion", "publisher": "Ubisoft", "release_date": "Apr 16 2014", "developers": ["RedLynx"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Arcade", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/615a3751868e8a1ca8db1502f71b4033-98.jpg", "descriptions": "Trials Fusion melds the classic, proven Trials formula of simple yet addictive competition with the social and visual breakthroughs of the next generation of gaming."}, {"name": "Super Mega Baseball 3", "details_link": "https://www.metacritic.com/game/playstation-4/super-mega-baseball-3", "publisher": "Metalhead Software", "release_date": "May 13 2020", "developers": ["Metalhead Software"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Baseball", "Arcade"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/1416f2881fab460f7becfd5fc49bb986-98.jpg", "descriptions": "Run up the score in a relaxed slugfest or push the limits of your reflexes in this refined baseball simulator. The third entry in the series features an all-new Franchise mode, major graphical enhancements, and on-field additions including pickoffs and situational player traits."}, {"name": "Xenoblade Chronicles 2: Torna ~ The Golden Country", "details_link": "https://www.metacritic.com/game/switch/xenoblade-chronicles-2-torna-the-golden-country", "publisher": "Nintendo", "release_date": "Sep 14 2018", "developers": ["Monolith Soft"], "platforms": "Switch", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/97cb8e1518bb4e9650e49fc067dfbbdc-98.jpg", "descriptions": "Guide a group of legendary warriors on a journey through the tragic history that doomed a kingdom and drove a hero down a dark path 500 years before the events of the Xenoblade Chronicles 2 game. Defend yourself from Malos and his forces using all the fury of this refined battle system,Guide a group of legendary warriors on a journey through the tragic history that doomed a kingdom and drove a hero down a dark path 500 years before the events of the Xenoblade Chronicles 2 game. Defend yourself from Malos and his forces using all the fury of this refined battle system, allowing you to fight as both the artificial lifeforms known as Blades and their masters, the Drivers.… Expand"}, {"name": "Call of Duty: Modern Warfare", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-modern-warfare", "publisher": "Activision", "release_date": "Oct 25 2019", "developers": ["Infinity Ward"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 80, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/1/e9d2fefb6c1831cc4503fcdf976a36f3-98.jpg", "descriptions": "Prepare to go dark, Modern Warfare® is back! The stakes have never been higher as players take on the role of lethal Tier One operators in a heart-racing saga that will affect the global balance of power. Call of Duty®: Modern Warfare® engulfs fans in an incredibly raw, gritty, provocativePrepare to go dark, Modern Warfare® is back! The stakes have never been higher as players take on the role of lethal Tier One operators in a heart-racing saga that will affect the global balance of power. Call of Duty®: Modern Warfare® engulfs fans in an incredibly raw, gritty, provocative narrative that brings unrivaled intensity and shines a light on the changing nature of modern war. Developed by the studio that started it all, Infinity Ward delivers an epic reimagining of the iconic Modern Warfare® series from the ground up. In the visceral and dramatic single-player story campaign, Call of Duty®: Modern Warfare® pushes boundaries and breaks rules the way only Modern Warfare® can. Players will engage in breathtaking covert operations alongside a diverse cast of international special forces throughout iconic European cities and volatile expanses of the Middle East. And the story doesn't end there. In Call of Duty®: Modern Warfare®, players will be thrust into an immersive narrative spanning the entire game. Experience the ultimate online playground with classic multiplayer, or squad-up and play cooperatively in a collection of elite operations accessible to all skill levels.… Expand"}, {"name": "NBA 2K23", "details_link": "https://www.metacritic.com/game/xbox-series-x/nba-2k23", "publisher": "2K Games", "release_date": "Sep  9 2022", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 80, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/d686141c10a2c6011a7ab3fc08edfd24-98.jpg", "descriptions": "NBA 2K23 features a completely rebuilt version of NBA 2K11's Jordan Challenges that had players trying to virtually recreate Jordan's real-life feats. One of these was a challenge to score at least 38 points and grab 7+ rebounds like Jordan himself did in June 1997 during his memorable \"fluNBA 2K23 features a completely rebuilt version of NBA 2K11's Jordan Challenges that had players trying to virtually recreate Jordan's real-life feats. One of these was a challenge to score at least 38 points and grab 7+ rebounds like Jordan himself did in June 1997 during his memorable \"flu game\" when a sick Jordan still put up big numbers and drained the winning basket in the NBA Finals. [GameSpot]… Expand"}, {"name": "Neon Abyss", "details_link": "https://www.metacritic.com/game/playstation-4/neon-abyss", "publisher": "Veewo Games", "release_date": "Jul 14 2020", "developers": ["Veewo Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/7e7b10d177d612e80204ebfe2a50f4c0-98.jpg", "descriptions": "Neon Abyss is a frantic, roguelite action-platformer where you run ‘n’ gun your way into the Abyss. Featuring unlimited item synergies and a unique dungeon evolution system, each run diversifies the experience and every choice alters the ruleset."}, {"name": "Ghost Giant", "details_link": "https://www.metacritic.com/game/playstation-4/ghost-giant", "publisher": "Zoink!", "release_date": "Apr 16 2019", "developers": ["Zoink!"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/9378b9bbbf841fd329390c6aa9bb9f8c-98.jpg", "descriptions": "Experience a new puzzle adventure from the studio behind Fe and Flipping Death. In Ghost Giant, you are the protector of the lonely little boy, Louis. Invisible to everyone but him, you explore his world and use your size to help him and the citizens of Sancourt."}, {"name": "Elite: Dangerous", "details_link": "https://www.metacritic.com/game/pc/elite-dangerous", "publisher": "Frontier Developments", "release_date": "Dec 16 2014", "developers": ["Frontier Developments"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "genres": ["Sci-Fi", "Large Spaceship", "Large Spaceship", "Simulation", "Space", "Civilian"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/232ef0aee9fb590a7b0a1e3c3ee969d0-98.jpg", "descriptions": "The next game in the Elite series - a space epic with fully multi-player. Carve your own path through a rich gaming sandbox, set against a backdrop of raw anarchy, galactic powerplays and intrigue. Do whatever it takes to upgrade your ship’s hull, engines, weapons, defences, cargo hold;The next game in the Elite series - a space epic with fully multi-player. Carve your own path through a rich gaming sandbox, set against a backdrop of raw anarchy, galactic powerplays and intrigue. Do whatever it takes to upgrade your ship’s hull, engines, weapons, defences, cargo hold; constantly improve your capabilities and influence on your journey towards the most coveted rank in the history of gaming - ‘Elite’.… Expand"}, {"name": "Pure", "details_link": "https://www.metacritic.com/game/pc/pure", "publisher": "Disney Interactive Studios", "release_date": "Sep 16 2008", "developers": ["Black Rock Studio"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/adf08454535b933b3855b41e5f47f41e-98.jpg", "descriptions": "Thrill seekers race against skilled rivals and performing gravity-defying aerial tricks in Pure, an extreme sports off-road racing video game. Featuring vertigo-inducing massive aerial jumps and spectacular airborne tricks in photo-realistic real-world locations all over the globe, PureThrill seekers race against skilled rivals and performing gravity-defying aerial tricks in Pure, an extreme sports off-road racing video game. Featuring vertigo-inducing massive aerial jumps and spectacular airborne tricks in photo-realistic real-world locations all over the globe, Pure delivers heart-pounding experiences unique to the genre. Players start by choosing among a variety of male and female character riders.  They can then either race against deft A.I. opponents or online players (up to 16-player multiplayer) in frenetic races and freestyle competitions all over the world. [Disney Interactive Studios]… Expand"}, {"name": "South Park: The Fractured But Whole", "details_link": "https://www.metacritic.com/game/switch/south-park-the-fractured-but-whole", "publisher": "Ubisoft", "release_date": "Apr 24 2018", "developers": ["Ubisoft San Francisco"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/96800fbd74394e8e77e56973314f47a4-98.jpg", "descriptions": "From the creators of South Park, Trey Parker and Matt Stone, comes South Park: The Fractured but Whole, a sequel to 2014's award-winning South Park: The Stick of Truth.\r Players will once again assume the role of the New Kid, and join South Park favorites Stan, Kyle, Kenny and Cartman in aFrom the creators of South Park, Trey Parker and Matt Stone, comes South Park: The Fractured but Whole, a sequel to 2014's award-winning South Park: The Stick of Truth.\r Players will once again assume the role of the New Kid, and join South Park favorites Stan, Kyle, Kenny and Cartman in a new hilarious and outrageous RPG adventure. \r\rIn South Park: The Fractured but Whole, players will delve into the crime-ridden underbelly of South Park with Coon and Friends. This dedicated group of crime fighters was formed by Eric Cartman whose superhero alter-ego, The Coon, is half man, half raccoon. As the New Kid, players will join Mysterion, Toolshed, Human Kite, Mosquito, Mint Berry Crunch and a host of others to battle the forces of evil while Coon strives to make his team the most beloved superheroes in history.… Expand"}, {"name": "IL-2 Sturmovik: Birds of Prey", "details_link": "https://www.metacritic.com/game/xbox-360/il-2-sturmovik-birds-of-prey", "publisher": "1C", "release_date": "Sep  8 2009", "developers": ["Gaijin Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/03d06a000ed43a3462ddddf62c811145-98.jpg", "descriptions": "IL-2 Sturmovik: Birds of Prey is based around the large-scale aerial combat and ground military operations of World War II. Players can participate in some of the war's most famous battles piloting fighters, battle planes and heavy bombers across a range of thrilling missions. There are fiveIL-2 Sturmovik: Birds of Prey is based around the large-scale aerial combat and ground military operations of World War II. Players can participate in some of the war's most famous battles piloting fighters, battle planes and heavy bombers across a range of thrilling missions. There are five theatres of war to engage in 0 The Battle of Britain, Stalingrad, Berlin, Sicily and Korsun' representing the main airborne battles of World War II in Europe. IL-2 Sturmovik: Birds of Prey also boasts an all new damage effects engine as well as advanced environmental visuals enriching the game play. Players can see real time damage to the aircraft such as holes in the wings and trail lines during dog fights. IL-2 Sturmovik: Birds of Prey features hundreds of airplanes taking part in air battles. The unique environmental engine also produces highly detailed, realistic landscapes that allow players to see breathtaking ground support actions. [505 Games]… Expand"}, {"name": "Assetto Corsa Competizione", "details_link": "https://www.metacritic.com/game/playstation-5/assetto-corsa-competizione", "publisher": "505 Games", "release_date": "Feb 22 2022", "developers": ["505 Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 30 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/dff2c3c61b536d98aa552e0b0f13fdea-98.jpg", "descriptions": "Assetto Corsa Competizione is an extraordinary racing simulation game allowing players to experience the real atmosphere of the GT3 championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved. Sprint,Assetto Corsa Competizione is an extraordinary racing simulation game allowing players to experience the real atmosphere of the GT3 championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved. Sprint, Endurance and Spa 24 Hours races come to life with an incredible level of realism, in both single and multiplayer modes. Born from KUNOS Simulazioni's long-term experience, this racing simulator takes full advantage of Unreal Engine 4 to ensure photorealistic weather conditions and graphics, night races, motion capture animations, reaching a new standard in terms of driving realism and immersion, thanks to its further improved tyre and aerodynamic models.… Expand"}, {"name": "God of War: Ascension", "details_link": "https://www.metacritic.com/game/playstation-3/god-of-war-ascension", "publisher": "SCEA", "release_date": "Mar 12 2013", "developers": ["SCE Santa Monica"], "platforms": "PlayStation 3", "num_players": "Up to 8 ", "genres": ["Action Adventure", "Fantasy", "Fantasy", "Linear"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/dd4bf38689d3d93d3872dfc91423f5ff-98.jpg", "descriptions": "Ascension is a prequel to the initial God of War. 6 months have elapsed since Kratos stood before the bodies of his wife and child, his hands stained with their blood - duped by Ares into killing the only people he ever loved. Vowing to avenge them, Kratos shattered the blood oath that boundAscension is a prequel to the initial God of War. 6 months have elapsed since Kratos stood before the bodies of his wife and child, his hands stained with their blood - duped by Ares into killing the only people he ever loved. Vowing to avenge them, Kratos shattered the blood oath that bound him to Ares. Sentenced to an eternity chained within a prison for the living damned, Kratos battles insanity at the hands of the Furies. He will be tested as he seeks freedom, redemption for his sins, and the clarity to avenge his family.… Expand"}, {"name": "Tiger Woods PGA Tour 07", "details_link": "https://www.metacritic.com/game/xbox-360/tiger-woods-pga-tour-07", "publisher": "EA Sports", "release_date": "Oct 17 2006", "developers": ["EA Redwood Shores"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/7c2e79ed772d0638ca316603d39141d2-98.jpg", "descriptions": "Tiger Woods Comes Alive — See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure — With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournamentTiger Woods Comes Alive — See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure — With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournament play. Enhanced Career Mode — From working on your driving to mastering your putting skills, craft your game with training challenges in the Practice Facility, then take on the world's best golfers on the World Tour. All-New Championship Courses — The course content doubles with the addition of new licensed courses, including Firestone Country Club, Glen Abbey, Princeville, Spyglass Hill, St Andrews, and Bandon Dunes. The game features 15 of the world's top players, including Tiger Woods, John Daly, Vijay Singh, Ian Poulter, Michael Campbell, and Annika Sorenstam, the most decorated golfer on the LPGA Tour. Show Your GameFace — The innovative character creation tool is revamped with deeper modifications, more apparel, equipment licenses, and specialty items. Challenge up to three players in five new game modes, or play in online tournaments complete with money lists, full stat tracking, league leaders, and more. More Game Modes — Work on your game or take on a friend in Match Play, Battle Golf, 21, OneBall, and more. [EA Sports]… Expand"}, {"name": "Life is Strange: Episode 3 - Chaos Theory", "details_link": "https://www.metacritic.com/game/xbox-one/life-is-strange-episode-3---chaos-theory", "publisher": "Square Enix", "release_date": "May 19 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/28868cf7ce7c5f14b93050fe0ab384ec-98.jpg", "descriptions": "In the third installment of Life is Strange, Max & Chloe ramp up their investigation to find out what exactly is going on at Blackwell Academy and the whereabouts of Rachel Amber. Secrets will be uncovered and Max will find another use for her power."}, {"name": "Final Fantasy VIII Remastered", "details_link": "https://www.metacritic.com/game/switch/final-fantasy-viii-remastered", "publisher": "Square Enix", "release_date": "Sep  3 2019", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/f8488fa75848e033a7fab873b620481c-98.jpg", "descriptions": "In a world where an ancient energy known as the Sorceress Power is passed down through generations, the peace of the realm is threatened when the evil Sorceress Edea takes power as ruler of the Galbadia Republic. Squall, a member of Balamb Garden Military Academy's elite mercenary forceIn a world where an ancient energy known as the Sorceress Power is passed down through generations, the peace of the realm is threatened when the evil Sorceress Edea takes power as ruler of the Galbadia Republic. Squall, a member of Balamb Garden Military Academy's elite mercenary force SeeD, other allies from the Garden, and Rinoa, a member of the resistance, join together on a journey to fight against Sorceress Edea, who shows hostility toward the Garden. [Square Enix]… Expand"}, {"name": "Life is Strange: Before the Storm - Farewell", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-before-the-storm---farewell", "publisher": "Square Enix", "release_date": "Mar  5 2018", "developers": ["Deck Nine Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/43ecbefaabeccad04f2ed37676797cc3-98.jpg", "descriptions": "'Farewell' Bonus Episode is available as part of the Deluxe Edition of Life is Strange: Before the Storm."}, {"name": "Darkstalkers Resurrection", "details_link": "https://www.metacritic.com/game/playstation-3/darkstalkers-resurrection", "publisher": "Capcom", "release_date": "Mar 12 2013", "developers": ["Iron Galaxy Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Fighting", "Compilation", "2D"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/7a9298ae25c92683ae24e7391387b722-98.jpg", "descriptions": "The Darkstalkers fighting game franchise returns and ready to take the scrap to current gen consoles. Featuring a unique and colorful array of characters blended with fast-paced fighting action, Darkstalkers Resurrection sports 2 games (Night Warriors: Darkstalkers Revenge and DarkstalkersThe Darkstalkers fighting game franchise returns and ready to take the scrap to current gen consoles. Featuring a unique and colorful array of characters blended with fast-paced fighting action, Darkstalkers Resurrection sports 2 games (Night Warriors: Darkstalkers Revenge and Darkstalkers 3), in the same package. Each game has a bag of features added including: robust GGPO-enabled online game play, HD graphical filtering with multiple viewing options, replay sharing, Spectator Mode, in-game achievements, Challenge/Tutorial Mode and an un-lockable vault filled with concept artwork, videos and more.… Expand"}, {"name": "Boomerang X", "details_link": "https://www.metacritic.com/game/switch/boomerang-x", "publisher": "Devolver Digital", "release_date": "Jul  8 2021", "developers": ["DANG!"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 80, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/a89282881e3bead4d173652a3455f082-98.jpg", "descriptions": "Whispers bubble from fresh cracks in the ground, echoing through the abandoned depths and primordial woods. A black flow cuts through stone and threatens to spill once more across the world. The ancient tetraform calls, and with it come unearthly powers. Catapult yourself through the air,Whispers bubble from fresh cracks in the ground, echoing through the abandoned depths and primordial woods. A black flow cuts through stone and threatens to spill once more across the world. The ancient tetraform calls, and with it come unearthly powers. Catapult yourself through the air, use the power drawn from fallen creatures to slow time, and cut through the swarms of dark beings with a razor-edge boomerang. Travel through once bustling locales, sacrificed to hide a myth, and descend the Godpath into the lost realms below. Cleanse these halls and ensure that whatever lies beneath doesn’t come back.\r… Expand"}, {"name": "The Walking Dead: The Telltale Series - A New Frontier Episode 2: Ties That Bind Part Two", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-the-telltale-series---a-new-frontier-episode-2-ties-that-bind-part-two", "publisher": "Telltale Games", "release_date": "Dec 20 2016", "developers": ["Telltale Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/7f3c3ff8151b0f280a7c08345d52141c-98.jpg", "descriptions": "When family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken fromWhen family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken from him, you meet a young girl who has experienced her own unimaginable loss. Her name is Clementine, and your fates are bound together in a story where every choice you make could be your last.… Expand"}, {"name": "Buzz! Quiz TV", "details_link": "https://www.metacritic.com/game/playstation-3/buzz!-quiz-tv", "publisher": "SCEA", "release_date": "Sep 23 2008", "developers": ["Relentless Software"], "platforms": "PlayStation 3", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/db9048bdda8183f1595d55f1daf92063-98.jpg", "descriptions": "Buzz!, the popular quiz show franchise, makes its way for the first time to the Playstation 3 with BUZZ! Quiz TV. Developed by Relentless Software, BUZZ! Quiz TV comes packed with BUZZ! wireless buzzer peripherals for an easy, pick-up-and-play game show experience. Combining to deliver overBuzz!, the popular quiz show franchise, makes its way for the first time to the Playstation 3 with BUZZ! Quiz TV. Developed by Relentless Software, BUZZ! Quiz TV comes packed with BUZZ! wireless buzzer peripherals for an easy, pick-up-and-play game show experience. Combining to deliver over 5,000 questions divided into five different genre channels (Music, Movies & TV, Sports, Brainiac and Lifestyle), the new Channel Hopper mode allows players to switch between the different categories of questions in order to play a variety of quizzes that lets all your friends get into the action. [SCEA]… Expand"}, {"name": "Impostor Factory", "details_link": "https://www.metacritic.com/game/pc/impostor-factory", "publisher": "Freebird Games", "release_date": "Sep 30 2021", "developers": ["Freebird Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/e4c43ee156ffdf706176943daa34655d-98.jpg", "descriptions": "A bonkers time-loop tragicomedy murder mystery thriller featuring multiple casualties and a suspicious cat, from the creator of To the Moon & Finding Paradise."}, {"name": "OkunoKA", "details_link": "https://www.metacritic.com/game/switch/okunoka", "publisher": "Caracal Games", "release_date": "Nov 30 2018", "developers": ["Caracal Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/02762be304293dea46eb0aa17d723287-98.jpg", "descriptions": null}, {"name": "The Gardens Between", "details_link": "https://www.metacritic.com/game/pc/the-gardens-between", "publisher": "The Voxel Agents", "release_date": "Sep 19 2018", "developers": ["The Voxel Agents"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/74131cb25c75ee260b0b6dc7a56b827c-98.jpg", "descriptions": "The Gardens Between is a surreal puzzle adventure that follows best friends, Arina and Frendt, as they fall into a mysterious world of beautiful garden islands. Manipulate time to solve puzzles and discover the secrets of each island."}, {"name": "Goodbye Deponia", "details_link": "https://www.metacritic.com/game/pc/goodbye-deponia", "publisher": "Daedalic Entertainment", "release_date": "Oct 17 2013", "developers": ["Daedalic Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/d34349e663b0a40ebea3f57c207230eb-98.jpg", "descriptions": "Goodbye Deponia is the final game in Daedalic Entertainment's adventure trilogy."}, {"name": "Tekken 6", "details_link": "https://www.metacritic.com/game/xbox-360/tekken-6", "publisher": "Namco Bandai Games America", "release_date": "Oct 27 2009", "developers": ["Namco Bandai Games America", "Namco Bandai Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/91c22c5bd3d92601a44985a729b93e55-98.jpg", "descriptions": "Spanning over a 14 year legacy, Tekken is among the most popular and well-known gaming brands in the world with the entire franchise selling more than 32 million units to date. Displayed in HD detail, a new era begins in the sixth King of the Iron Fist Tournament complete with intenseSpanning over a 14 year legacy, Tekken is among the most popular and well-known gaming brands in the world with the entire franchise selling more than 32 million units to date. Displayed in HD detail, a new era begins in the sixth King of the Iron Fist Tournament complete with intense gameplay modes as well as new features and environments. TEKKEN 6 sees the return of many familiar faces as well as new characters to create the largest line-up the series has ever seen.  With a growing roster of fighters, each equipped with their own deadly techniques, moves and attack combinations, TEKKEN 6 will be the best King of Iron Fist Tournament yet.  Adding to the already rich gaming experience, a deeper character customization feature will only further enhance the incredible fighting intensity as players go mano-y-mano.  Players can also take the battle online for classic match-ups and to compete for world domination. [Namco Bandai Games]… Expand"}, {"name": "Mega Man X Legacy Collection 1 + 2", "details_link": "https://www.metacritic.com/game/playstation-4/mega-man-x-legacy-collection-1-+-2", "publisher": "Capcom", "release_date": "Jul 24 2018", "developers": ["Capcom"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/03249654d160797164acf73d46f12da6-98.jpg", "descriptions": "The celebrated Mega Man X series comes to PlayStation 4, Xbox One, Nintendo Switch, and PC! Play as Mega Man X the powerful evolution of classic fighting robot Mega Man as he battles a variety of deadly bosses known as Mavericks in eight exhilarating action-platformer games. Mega Man XThe celebrated Mega Man X series comes to PlayStation 4, Xbox One, Nintendo Switch, and PC! Play as Mega Man X the powerful evolution of classic fighting robot Mega Man as he battles a variety of deadly bosses known as Mavericks in eight exhilarating action-platformer games. Mega Man X Legacy Collection includes the legendary 16-bit titles and the series' exciting foray into 32-bits: Mega Man X, Mega Man X2, Mega Man X3, and Mega Man X4. The heroic robot grows stronger as he takes down Mavericks and steals their weapons, and also has the ability to dash and wall jump for thrilling, fast-paced combat. Mega Man X's mysterious friend, Zero, also joins the fray as a playable character later in this collection.Mega Man X Legacy Collection 2 also spans two gaming eras, showcasing the evolution of the series with Mega Man X5, Mega Man X6, Mega Man X7, and Mega Man X8. A third playable character, Axl, joins the cast in Mega Man X7 and Mega Man X8 as the series jumps into a new realm of 3D character models and environments.In addition to eight iconic Mega Man X titles, both Mega Man X Legacy Collection and Mega Man Legacy Collection 2 come with an armory of new features. Test your Maverick-hunting skills in the new X Challenge mode, which pits players against two deadly bosses in a series of two-on-one battles. Think you can take down the slippery Chill Penguin and hulking Frost Walrus simultaneously? Give it your best shot! Additionally, Mega Man X Legacy Collection includes a huge museum filled with rare production art, catalogs of classic merchandise, a playlist of nostalgic commercials, and more. The collection also includes an animated a prequel film starring the origins of Mega Man X villain, Sigma.… Expand"}, {"name": "Game of Thrones: Episode One - Iron From Ice", "details_link": "https://www.metacritic.com/game/xbox-one/game-of-thrones-episode-one---iron-from-ice", "publisher": "Telltale Games", "release_date": "Dec  3 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/4198f698163c3c076eac2b2e3a6df956-98.jpg", "descriptions": "Episode 1 - Iron From Ice. The series is based on the world, characters and events seen in HBO’s television show, which in turn is based on George R. R. Martin’s books (A Song of Ice and Fire). The events in the game series begin towards the end of Season 3 of the television show and endEpisode 1 - Iron From Ice. The series is based on the world, characters and events seen in HBO’s television show, which in turn is based on George R. R. Martin’s books (A Song of Ice and Fire). The events in the game series begin towards the end of Season 3 of the television show and end just before the beginning of Season 5. You'll traverse familiar locations such as King’s Landing and The Wall, as well as unfamiliar locations such as Ironrath, the home of House Forrester.… Expand"}, {"name": "Naruto Shippuden: Ultimate Ninja Storm 4", "details_link": "https://www.metacritic.com/game/xbox-one/naruto-shippuden-ultimate-ninja-storm-4", "publisher": "Bandai Namco Games", "release_date": "Feb  9 2016", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Fighting", "3D"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/89a547d14c13e5a73c51c69d52d345e5-98.jpg", "descriptions": "Recreate all the legendary teams from NARUTO SHIPPUDEN or create your own team. Players will be able to switch characters during the fight.  The roster spans the NARUTO SHIPPUDEN story arc and capture the latest character appearances from the anime. Almighty foes such as Kaguya, Madara (SixRecreate all the legendary teams from NARUTO SHIPPUDEN or create your own team. Players will be able to switch characters during the fight.  The roster spans the NARUTO SHIPPUDEN story arc and capture the latest character appearances from the anime. Almighty foes such as Kaguya, Madara (Six Paths) & Obito (Six Paths) join the fray.… Expand"}, {"name": "LEGO Dimensions", "details_link": "https://www.metacritic.com/game/playstation-4/lego-dimensions", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 27 2015", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/3578d4599d00dc6068a6646e72da228d-98.jpg", "descriptions": "LEGO characters from a melding of some of the most recognizable brands in the universe join forces and battle in worlds outside of their own. A Dark Knight, a Wizard, and a LEGO Master Builder traveling together down the Yellow Brick Road is just the beginning."}, {"name": "Borderlands: The Handsome Collection", "details_link": "https://www.metacritic.com/game/xbox-one/borderlands-the-handsome-collection", "publisher": "2K Games", "release_date": "Mar 24 2015", "developers": ["Gearbox Software", "Iron Galaxy Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/5c95fe7e4386526d50257843e959eed2-98.jpg", "descriptions": "Borderlands: The Handsome Collection includes the definitive versions of both Borderlands 2 and Borderlands: The Pre-Sequel, built specifically for next-gen consoles."}, {"name": "NCAA Football 10", "details_link": "https://www.metacritic.com/game/playstation-3/ncaa-football-10", "publisher": "Electronic Arts", "release_date": "Jul 14 2009", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/bac7624692383149925b6f52749a3eb3-98.jpg", "descriptions": "NCAA Football 10 brings the excitement of college football to fans across the nation like never before with its newest feature, Season Showdown. In this new mode, every game counts as fans declare their loyalty to a favorite school and give the ultimate show of support in a nationwideNCAA Football 10 brings the excitement of college football to fans across the nation like never before with its newest feature, Season Showdown. In this new mode, every game counts as fans declare their loyalty to a favorite school and give the ultimate show of support in a nationwide competition.  All college football fans have an opportunity to participate in Season Showdown, as credits not only accumulate in-game but players can also earn credits for their school via new web-based games.  Millions of college football fans around the country will be on a mission to prove their school is number one with NCAA Football 10’s Season Showdown. NCAA Football 10 envelopes the excitement and pageantry of college football at its best.  Enhanced stadiums filled with school colors, cheerleaders and mascots bring the college atmosphere to life.  Enjoy the sights of game day with new field goal nets, flags waving in the wind and camera flashes exploding during pivotal moments. With all 120 Football Bowl Subdivision schools represented in the game, NCAA Football 10 offers fans an exciting way to experience the thrill of authentic college football year-round. [Electronic Arts]… Expand"}, {"name": "Sid Meier's Civilization VI: Gathering Storm", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-vi-gathering-storm", "publisher": "2K Games", "release_date": "Feb 14 2019", "developers": ["Firaxis Games"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/c02ff1ceb15f1bcdda42e8e88378aa81-98.jpg", "descriptions": "In Gathering Storm, the second expansion to Civilization VI, the world around you is more alive than ever before. Chart a path to victory for your people by developing new advanced technologies and engineering projects and negotiating with the global community in the World Congress onIn Gathering Storm, the second expansion to Civilization VI, the world around you is more alive than ever before. Chart a path to victory for your people by developing new advanced technologies and engineering projects and negotiating with the global community in the World Congress on critical issues. The choices you make in the game will influence the world ecosystem and could impact the future of the entire planet. Natural disasters like floods, storms, and volcanoes can pillage or destroy your Improvements and Districts – but they may also refresh and enrich the lands after they pass. In addition to these new systems, Civilization VI: Gathering Storm introduces eight new civilizations and nine new leaders. Seven new world wonders can be constructed, as well as a variety of new units, districts, buildings, and improvements.… Expand"}, {"name": "Road 96", "details_link": "https://www.metacritic.com/game/playstation-5/road-96", "publisher": "Merge Games", "release_date": "Apr 14 2022", "developers": ["Digixart Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/ff014f442377b377d34b248160b6f7cb-98.jpg", "descriptions": "Summer 1996. Today is the day! You hit the road. Adventure. Freedom. Escape. Run. Flee the Regime. Try to survive. On this risky road trip to the border, you'll meet incredible characters, and discover their intertwined stories and secrets in an ever-evolving adventure.\rBut every mile opensSummer 1996. Today is the day! You hit the road. Adventure. Freedom. Escape. Run. Flee the Regime. Try to survive. On this risky road trip to the border, you'll meet incredible characters, and discover their intertwined stories and secrets in an ever-evolving adventure.\rBut every mile opens up a choice to make. Your decisions will change your adventure, change the people you meet, maybe even change the world.\r There are thousands of roads across the authoritarian nation of Petria.\r Which one will you take?… Expand"}, {"name": "The Banner Saga 2", "details_link": "https://www.metacritic.com/game/switch/the-banner-saga-2", "publisher": "Stoic", "release_date": "Jun  7 2018", "developers": ["Stoic"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/fc0855894602e25500b628c097603f0c-98.jpg", "descriptions": "The award winning and BAFTA nominated saga continues in The Banner Saga 2. Continue your journey soon after the climactic events of The Banner Saga. The choices you made in the first game will affect who is alive and who is dead in this exciting sequel."}, {"name": "2064: Read Only Memories", "details_link": "https://www.metacritic.com/game/pc/2064-read-only-memories", "publisher": "MidBoss", "release_date": "Oct  5 2015", "developers": ["MidBoss"], "platforms": ["PlayStation 4", "PlayStation Vita", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "Point-and-Click"], "meta_score": 80, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/df5cf23f192be105c650c63098f72d50-98.jpg", "descriptions": "The time December, 2064AD. Your life as a struggling journalist is interrupted by the world’s first sapient robot, a ROM named Turing. Explore the world of Neo-San Francisco, befriend the locals, and decide how to approach your encounters."}, {"name": "PixelJunk Eden", "details_link": "https://www.metacritic.com/game/playstation-3/pixeljunk-eden", "publisher": "SCEA", "release_date": "Jul 31 2008", "developers": ["Q-Games"], "platforms": ["PC", "PlayStation 3"], "num_players": "1-3 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/b3be660e619765b3a02eaea2c3f356ea-98.jpg", "descriptions": "[Playstation Network]  PixelJunk Eden is the third PSN title from the PixelJunk series by Japanese developer Q-Games. PixelJunk Eden welcomes you to a psychedelic world unlike anything you've ever experienced before. As a tiny, silk-spinning 'grimp', it is up to you to collect the lost[Playstation Network]  PixelJunk Eden is the third PSN title from the PixelJunk series by Japanese developer Q-Games. PixelJunk Eden welcomes you to a psychedelic world unlike anything you've ever experienced before. As a tiny, silk-spinning 'grimp', it is up to you to collect the lost \"Spectra\" that have been scattered across all the gardens of Eden. You grip, jump and swing, destroying \"Prowlers\" and collecting their pollen which lets you grow more plants to take you further and deeper into the garden to locate the precious \"Spectra.\" Lush visuals, slick controls and music make it an atmospheric and addictive experience. [Sony]… Expand"}, {"name": "Bayonetta Origins: Cereza and the Lost Demon", "details_link": "https://www.metacritic.com/game/switch/bayonetta-origins-cereza-and-the-lost-demon", "publisher": "Sega", "release_date": "Mar 17 2023", "developers": ["PlatinumGames"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/c32a0b894a512b690fd9f4cdb439878d-98.jpg", "descriptions": "Turn back the pages of the Umbra Witch’s story to learn where it all began. Take control of Cereza and her first demon Cheshire to fend off faeries and solve puzzles."}, {"name": "Demeo", "details_link": "https://www.metacritic.com/game/playstation-5/demeo", "publisher": "Resolution Games", "release_date": "Feb 22 2023", "developers": ["Resolution Games"], "platforms": ["PC", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/f39883c8675e117cf68a436d4ec933e1-98.jpg", "descriptions": "RPG fans, unite in virtual reality.A dark force has taken over the underworld in the upcoming RPG dungeon crawler, Demeo, and it's a world you're not likely to survive alone.\n\nTerrors and treasure await as you and your friends brave the corrupted catacombs of Demeo together. Choose yourRPG fans, unite in virtual reality.A dark force has taken over the underworld in the upcoming RPG dungeon crawler, Demeo, and it's a world you're not likely to survive alone.Terrors and treasure await as you and your friends brave the corrupted catacombs of Demeo together. Choose your champions wisely in this cooperative game, for once you have ventured below you must conquer the nether floors or perish in the attempt. The ultimate outcome depends on your choices, and whether the dice are rolled in your favorWill you have the mettle to survive all the way to the end in this monster-infested turn-based game that will take game night virtual in 2021?… Expand"}, {"name": "FAR: Changing Tides", "details_link": "https://www.metacritic.com/game/xbox-series-x/far-changing-tides", "publisher": "Frontier Foundry", "release_date": "Mar  1 2022", "developers": ["Okomotive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/c4ce82047227d9df1e192f972c381d7d-98.jpg", "descriptions": "Set sail and discover the wonders of a flooded world rife with mystery. Dive into unknown depths on the hunt for fuel and salvage, devise innovative solutions to overcome intricate obstacles, and unearth forgotten relics lost to time."}, {"name": "Sly Cooper Collection", "details_link": "https://www.metacritic.com/game/playstation-vita/sly-cooper-collection", "publisher": "SCEA", "release_date": "May 27 2014", "developers": ["Sanzaru Games"], "platforms": ["PlayStation 3", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/fe431dd21fd792e86457c725558306e0-98.jpg", "descriptions": "Also known as The Sly Trilogy. The Sly Collection features three PlayStation 2 action-packed classic hits (Sly Cooper and the Thievius Racconus, Sly 2: Band of Thieves and Sly 3: Honor Among Thieves)."}]