[{"name": "FIFA Soccer 2004", "details_link": "https://www.metacritic.com/game/playstation-2/fifa-soccer-2004", "publisher": "EA Sports", "release_date": "Nov  4 2003", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 84, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/c085503970112c9722f19bd2957ba1c6-98.jpg", "descriptions": "A new Career Mode gives you the chance to take a team from the lower divisions, battle through ranks, sign new players, and turn them into champions. Take control of players away from the ball, and run them into space for attacking passes or gain valuable position during dead ball kicks. AA new Career Mode gives you the chance to take a team from the lower divisions, battle through ranks, sign new players, and turn them into champions. Take control of players away from the ball, and run them into space for attacking passes or gain valuable position during dead ball kicks. A fine-tuned game engine, and new animations dramatically enhance the smoothness in player movement. Deeper team AI, attributes, tactics, playing styles, control, and individual player personalities. Build your franchise and guide your club to the Championship by making calculated front-office decisions with Career Mode. When one season ends and another begins new challenges will present themselves. More than 300 new crowd chants at an ever growing list of officially licensed stadiums help put you in the best seat in the house. Plus, an all-new dynamic weather feature even affects gameplay, so choose your home wisely. More than 500 official licenses, including 16 leagues, 350 teams and 10,000 players. From Europe?s super leagues to the Americas Club Championship, FIFA Soccer 2004 has the most authentic selection of the world?s best. A Game With No Boundaries: Go online and take on opponents from anywhere in the country. An online lobby area where gamers can meet, greet, chat and play head-to-head provides the ultimate interactive experience. [EA Sports]… Expand"}, {"name": "Command & Conquer: Generals", "details_link": "https://www.metacritic.com/game/pc/command-conquer-generals", "publisher": "EA Games", "release_date": "Feb 10 2003", "developers": ["EA Pacific"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Modern", "General", "Modern"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/d5cb20316d110063812e304c3526b9bb-98.jpg", "descriptions": "Command & Conquer Generals puts your trigger finger on the pulse of modern warfare. Choose a General in control of massive armies of bleeding-edge military weaponry across a globe teetering on the brink of Armageddon. Command either the mighty U.S. Army, the Chinese war machine or theCommand & Conquer Generals puts your trigger finger on the pulse of modern warfare. Choose a General in control of massive armies of bleeding-edge military weaponry across a globe teetering on the brink of Armageddon. Command either the mighty U.S. Army, the Chinese war machine or the resourceful Global Liberation Army, each packed with high-tech arsenals ready to deliver unprecedented firepower on land or in the skies. Prepare your forces, Commander... it's time to engage in the next generation of 3D real-time strategy. [Electronic Arts]… Expand"}, {"name": "Sid Meier's SimGolf", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-simgolf", "publisher": "EA Games", "release_date": "Jan 23 2002", "developers": ["Firaxis Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Modern", "General"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/5a1f361ab33e478ae43f73ac30691445-98.jpg", "descriptions": "Be the course designer, CEO, and resident Pro of your own golf resorts around the world. Grow your golf empire from a small, public pitch-and-putt to a global network of five-star resorts. From groundbreaking to par breaking, the ultimate golf design fantasies are in your hands. [Electronic Arts]"}, {"name": "Quake III Revolution", "details_link": "https://www.metacritic.com/game/playstation-2/quake-iii-revolution", "publisher": "Electronic Arts", "release_date": "Mar 26 2001", "developers": ["Bullfrog Productions"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/62288d86ce30995b4ae136df52759b5f-98.jpg", "descriptions": "A faced-paced shooter that hasn't changed much from its PC days for those who don't mind more than a little blood with their atmosphere."}, {"name": "Street Fighter III: Double Impact", "details_link": "https://www.metacritic.com/game/dreamcast/street-fighter-iii-double-impact", "publisher": "Capcom", "release_date": "Jun 19 2000", "developers": ["Capcom"], "platforms": "Dreamcast", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/0f97879167e9d81c2dcfada8ac297b9d-98.jpg", "descriptions": "Street Fighter® fans everywhere get a double-dose of double-trouble with Street Fighter III: Double Impact. This explosive street brawl for the Sega Dreamcast™ contains TWO arcade hits on one CD -- Street Fighter III: New Generation... and Street Fighter III: Second Impact. LoadedStreet Fighter® fans everywhere get a double-dose of double-trouble with Street Fighter III: Double Impact. This explosive street brawl for the Sega Dreamcast™ contains TWO arcade hits on one CD -- Street Fighter III: New Generation... and Street Fighter III: Second Impact. Loaded with a new legion of fighters, Street fighter III: Double Impact boasts new enhancements to the series like parrying, Super Art fighting styles and two-punch, two-kick fighting styles to inflict more damage.… Expand"}, {"name": "Tom Clancy's Ghost Recon Advanced Warfighter 2", "details_link": "https://www.metacritic.com/game/playstation-3/tom-clancys-ghost-recon-advanced-warfighter-2", "publisher": "Ubisoft", "release_date": "Aug 23 2007", "developers": ["Red Storm Entertainment", "Ubisoft Paris"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/985721fc49c344c86651fa3380f93029-98.jpg", "descriptions": "Tom Clancy's Ghost Recon Advanced Warfighter 2 builds off of the events in the first game and places gamers in control of the U.S. military's elite fighting unit, the Ghosts. In the year 2014, the rising conflict between Mexican loyalists and insurgent rebel forces has thrown Mexico intoTom Clancy's Ghost Recon Advanced Warfighter 2 builds off of the events in the first game and places gamers in control of the U.S. military's elite fighting unit, the Ghosts. In the year 2014, the rising conflict between Mexican loyalists and insurgent rebel forces has thrown Mexico into full-scale civil war. Under the command of Captain Scott Mitchell, the Ghosts are called upon to face an imminent threat to the United States. The fate of two countries now lies in the hands of the Ghosts as they fend off an attack on U.S. soil. Equipped with the most cutting-edge weaponry and technology, the Ghosts must battle on both sides of the border to neutralize the escalating rebel threat. The Ghosts will battle enemies in mountain terrains, barren deserts and even on their home turf in El Paso, Texas. Each environment presents its own benefits and challenges and will call for fresh tactical approaches. Vastly Improved Artificial Intelligence (AI): Watch your back as rebels send their own team members to flank your position or gain vantage points by utilizing vertical gameplay to pick you off from the rooftops above. Improved squad-mate AI will now feed you more of the information you need with descriptive commands. The revolutionary new Cross-Com 2.0 will give the player more information than ever before. You will be able to see what your friendly forces see in the top left display and the click of a button will expand that to full-screen view for a clearer and more precise picture. Command lethal air strikes with jet fighters, gain mobile cover for otherwise impassable situations and replenish armaments on the battlefield using an unmanned artillery MULE. Players can now heal their team on the battlefield, including squad leader Scott Mitchell, with an all-new Medic class of soldier. [Ubisoft]… Expand"}, {"name": "Middle-earth: Shadow of Mordor", "details_link": "https://www.metacritic.com/game/pc/middle-earth-shadow-of-mordor", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 30 2014", "developers": ["Monolith Productions"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "Fantasy", "Open-World"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/48539251d9a8df2ca9906587a3ff1fb4-98.jpg", "descriptions": "Fight your way through Mordor and reveal the truth of the spirit that compels you, discover the origins of the Rings of Power, build your legend and ultimately confront the evil of Sauron in this new story of Middle-earth."}, {"name": "Middle-earth: Shadow of Mordor", "details_link": "https://www.metacritic.com/game/playstation-4/middle-earth-shadow-of-mordor", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 30 2014", "developers": ["Monolith Productions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "Fantasy", "Open-World"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/ee6d95818555be8416f5830a34a02a62-98.jpg", "descriptions": "Fight your way through Mordor and reveal the truth of the spirit that compels you, discover the origins of the Rings of Power, build your legend and ultimately confront the evil of Sauron in this new story of Middle-earth."}, {"name": "SpaceChem", "details_link": "https://www.metacritic.com/game/pc/spacechem", "publisher": "Zachtronics Industries", "release_date": "Mar  2 2011", "developers": ["Zachtronics Industries"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/95619e1a08219367cf6fce894f4e6dbc-98.jpg", "descriptions": "Zachtronics Industries is back with an ambitious new design-based puzzle game. Take on the role of a Reactor Engineer working for SpaceChem, the leading chemical synthesizer for frontier colonies. Construct elaborate factories to transform raw materials into valuable chemical products!Zachtronics Industries is back with an ambitious new design-based puzzle game. Take on the role of a Reactor Engineer working for SpaceChem, the leading chemical synthesizer for frontier colonies. Construct elaborate factories to transform raw materials into valuable chemical products! Streamline your designs to meet production quotas and survive encounters with the sinister threats that plague SpaceChem.… Expand"}, {"name": "Viva Pinata", "details_link": "https://www.metacritic.com/game/xbox-360/viva-pinata", "publisher": "Microsoft Game Studios", "release_date": "Nov  9 2006", "developers": ["Rare Ltd."], "platforms": ["PC", "Xbox 360"], "num_players": "2  Online", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/6481eb3ec10b526500e867add39c9d42-98.jpg", "descriptions": "Viva Pinata is a customizable, social and spontaneous game that invites players of all ages and skills to explore an immersive world where they are challenged to create and maintain a living garden ecosystem that grows in real time. Beginning with a few basic tools, players build and takeViva Pinata is a customizable, social and spontaneous game that invites players of all ages and skills to explore an immersive world where they are challenged to create and maintain a living garden ecosystem that grows in real time. Beginning with a few basic tools, players build and take control of their environment to attract and host more than 60 species of wild pinata, utilizing hundreds of customizable elements to create their very own distinctively unique thriving paradise. Viva Pinata gameplay continues to evolve with new content available via the Xbox Live service and the ability to play, trade and interact with more than 2 million gamers via the online service. [Microsoft]… Expand"}, {"name": "OlliOlli World: VOID Riders", "details_link": "https://www.metacritic.com/game/pc/olliolli-world-void-riders", "publisher": "Private Division", "release_date": "Jun 15 2022", "developers": ["roll7"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/9f16c3f981cb55522ed1a7c66a5512f9-98.jpg", "descriptions": "With its DLC expansion, Void Riders, the side-scrolling skateboarding platformer is taking things a step further with a cosmic theme and the addition of a whole bunch of aliens."}, {"name": "Atelier Ryza 2: Lost Legends & the Secret Fairy", "details_link": "https://www.metacritic.com/game/pc/atelier-ryza-2-lost-legends-the-secret-fairy", "publisher": "Koei Tecmo Games", "release_date": "Jan 26 2021", "developers": ["Gust"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 84, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/7/7a26b418632f942a5531d315c8794dfb-98.jpg", "descriptions": "This story takes place three years after the events of the previous game “Atelier Ryza: Ever Darkness & the Secret Hideout,” and depicts the reunion of Ryza and her friends, who go through new encounters and goodbyes to discover a true priceless treasure."}, {"name": "Freedom Planet", "details_link": "https://www.metacritic.com/game/wii-u/freedom-planet", "publisher": "GalaxyTrail", "release_date": "Aug 20 2015", "developers": ["GalaxyTrail"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/ce0a2c55acf5aa4b171fdbd7be11d436-98.jpg", "descriptions": "Fight your way across the celestial world of Avalice where cats are green, motorcycles drive up walls and monster girls do most of the buttkicking. Freedom Planet is a cartoony, combat-based platform adventure that pits a spunky dragonoid and her friends against an alien attack force."}, {"name": "Pinball FX 2", "details_link": "https://www.metacritic.com/game/pc/pinball-fx-2", "publisher": "Microsoft Game Studios", "release_date": "Oct 27 2012", "developers": ["Zen Studios"], "platforms": ["Xbox 360", "Xbox One", "PC"], "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/66a540645775dd29e93ee8253737bf14-98.jpg", "descriptions": "Pinball FX is back, and it is better than ever! Pinball FX2 offers brand new tables and a host of new features and improvements, including a new state-of-the-art physics model that surpasses anything available so far."}, {"name": "Thronebreaker: The Witcher Tales", "details_link": "https://www.metacritic.com/game/switch/thronebreaker-the-witcher-tales", "publisher": "CD Projekt Red Studio", "release_date": "Jan 28 2020", "developers": ["CD Projekt Red Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/b3950d40a50edd2a639879ad334139f3-98.jpg", "descriptions": "Thronebreaker is a single player role-playing game set in the world of The Witcher that combines narrative-driven exploration with unique puzzles and card battle mechanics.Crafted by the developers responsible for some of the most iconic moments in The Witcher 3: Wild Hunt, the game spinsThronebreaker is a single player role-playing game set in the world of The Witcher that combines narrative-driven exploration with unique puzzles and card battle mechanics.Crafted by the developers responsible for some of the most iconic moments in The Witcher 3: Wild Hunt, the game spins a truly regal tale of Meve, a war-veteran and queen of two Northern Realms Lyria and Rivia. Facing an imminent Nilfgaardian invasion, Meve is forced to once again enter the warpath and set out on a dark journey of destruction and revenge.KEY FEATURESAN ALL NEW EPIC TALE* Experience an all-new 30-hour Witcher world tale with 20 possible world end-states.* Embark on a grand adventure full of thought-provoking quests.* Influence the state of the world around you by making difficult choices and face their consequences.* Meet a cast of rich, multidimensional characters some of them will join you on your quest, others you'll have to face on the battlefield.TRAVEL TO NEVER-BEFORE-SEEN KINGDOMS* Explore new and mysterious regions of the monster-infested world of The Witcher.* Traverse vast lands and unique locations, all with their distinct theme from vibrant countrysides and war-torn landscapes, to grand castles and snow-capped mountains.* Save villages from hordes of monsters, look for treasures hidden among ancient ruins, scour the land for resources, and more the world of Thronebreaker is teeming with things to do.PREPARE FOR WAR* Develop and customize your very own battle camp.* Train and recruit units, unlock new skills and work on your tactics.* Manage resources you find and trade them with local merchants.* Learn more about your companions and increase their strength in battle.LEAD YOUR ARMY IN EPIC BATTLES* Build an army from characters you meet and interact with during your journey.* Fight in epic story battles and solve unique puzzles and challenges.* Use unique skills and abilities of your army and lead it to victory.… Expand"}, {"name": "Pokemon Ultra Sun", "details_link": "https://www.metacritic.com/game/3ds/pokemon-ultra-sun", "publisher": "Nintendo", "release_date": "Nov 17 2017", "developers": ["Game Freak"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/ae7ebf70922d86ee901247143a20497f-98.jpg", "descriptions": "A new light shines on the Alola region.\r Take on the role of a Pokemon Trainer and uncover new tales, and unravel the mystery behind the two forms reminiscent of the Legendary Pokemon. With new story additions and features this earns Pokemon Ultra Sun and Pokemon Ultra Moon the nameA new light shines on the Alola region.\r Take on the role of a Pokemon Trainer and uncover new tales, and unravel the mystery behind the two forms reminiscent of the Legendary Pokemon. With new story additions and features this earns Pokemon Ultra Sun and Pokemon Ultra Moon the name \"Ultra!\" Another adventure is about to begin.\r New Pokemon forms have been discovered in the Aloha region in Pokemon Ultra Sun and Pokemon Ultra Moon! These forms are reminiscent of the Legendary Pokemon Solgaleo, Lunala, and Necrozma, first revealed in Pokemon Sun and Pokemon Moon. Head out on an epic journey as you solve the mystery behind these fascinating Pokemon! In this expanded adventure, get ready to explore more of the Alola region, catch more amazing Pokemon, and battle more formidable foes in Pokemon Ultra Sun and Pokemon Ultra Moon!… Expand"}, {"name": "Fatal Frame II: Crimson Butterfly Director's Cut", "details_link": "https://www.metacritic.com/game/xbox/fatal-frame-ii-crimson-butterfly-directors-cut", "publisher": "Tecmo", "release_date": "Nov  1 2004", "developers": ["Tecmo"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/40a69d40c0d182c2720a6786f075daeb-98.jpg", "descriptions": "Terror returns with Fatal Frame 2: Crimson Butterfly, the sequel to the highly popular survival horror title, Fatal Frame.  This time the terrifying journey takes you to a whole new creepy setting, an abandoned village, where you play the role of Mio Amakura, a young girl who is gifted withTerror returns with Fatal Frame 2: Crimson Butterfly, the sequel to the highly popular survival horror title, Fatal Frame.  This time the terrifying journey takes you to a whole new creepy setting, an abandoned village, where you play the role of Mio Amakura, a young girl who is gifted with a strong sixth sense and her twin sister Mayu, who notices a crimson butterfly faintly glowing in the sky.  Your only weapon, an antique camera, has received a variety of new features to kill ghosts.  Get lost in another horrifying tale.… Expand"}, {"name": "Shin Megami Tensei V", "details_link": "https://www.metacritic.com/game/switch/shin-megami-tensei-v", "publisher": "Atlus", "release_date": "Nov 12 2021", "developers": ["Atlus"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/7cc8cec651e057ffe5503a6e71a30bf4-98.jpg", "descriptions": "The ambitions of god and human clash amidst the horror of a dying world. Neither human nor demon, the newly-forged Nahobino and his friends must decide what is worth saving... and prepare to sacrifice everything in its name. In a world without its Creator, which path will you choose?"}, {"name": "South Park: The Fractured But Whole", "details_link": "https://www.metacritic.com/game/xbox-one/south-park-the-fractured-but-whole", "publisher": "Ubisoft", "release_date": "Oct 17 2017", "developers": ["Ubisoft San Francisco"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/843e1310c95336ecded0fa4e8d09f7f2-98.jpg", "descriptions": "South Park: The Fractured but Whole empowers players to delve into the tender, crime-ridden underbelly of South Park with Coon and Friends. This dedicated group of crime fighters was formed by Eric Cartman, whose superhero alter ego, The Coon, is half man, half raccoon. As The New Kid,South Park: The Fractured but Whole empowers players to delve into the tender, crime-ridden underbelly of South Park with Coon and Friends. This dedicated group of crime fighters was formed by Eric Cartman, whose superhero alter ego, The Coon, is half man, half raccoon. As The New Kid, players join Mysterion, Toolshed, Human Kite, Mosquito, Mint Berry Crunch and a group of others to battle the forces of evil while Coon strives to make his team some of the most beloved superheroes in history. Creators Matt Stone and Trey Parker were involved in every step of the development of the game. [Ubisoft]… Expand"}, {"name": "Blast Off", "details_link": "https://www.metacritic.com/game/psp/blast-off", "publisher": "Halfbrick Studios", "release_date": "Nov 24 2009", "developers": ["Halfbrick Studios"], "platforms": ["iPhone/iPad", "PSP"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/b3a81dc70934cfccd80db50aa9ce021e-98.jpg", "descriptions": "[PSP Minis]  Blast Off is an interstellar arcade game featuring gravity fields, lost astronauts and bizarre planetary systems. Use your rocket ship to rescue astronauts and carry them through the warpgate to safety. But be careful! The ever-present force of gravity can help you on your[PSP Minis]  Blast Off is an interstellar arcade game featuring gravity fields, lost astronauts and bizarre planetary systems. Use your rocket ship to rescue astronauts and carry them through the warpgate to safety. But be careful! The ever-present force of gravity can help you on your journey, but can also bring you crashing down. [Halfbrick]… Expand"}, {"name": "Star Wars: Starfighter", "details_link": "https://www.metacritic.com/game/playstation-2/star-wars-starfighter", "publisher": "LucasArts", "release_date": "Feb 19 2001", "developers": ["LucasArts"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/d662618a0092403a7fc2b2aed6cd1a86-98.jpg", "descriptions": "One of the most eagerly anticipated PS2 titles of the year, this console space shooter features 14 missions by three starfighter pilots attempting to save Naboo and the Galaxy from the oppressive abuses of the Trade Federation."}, {"name": "If Found...", "details_link": "https://www.metacritic.com/game/pc/if-found", "publisher": "Annapurna Interactive", "release_date": "May 19 2020", "developers": ["dreamfeel"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 84, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/6f2336c176a97ff57fbf4b65d4dae295-98.jpg", "descriptions": "If Found... is an interactive visual novel about going home, coming out and erasing everything."}, {"name": "Guitar Hero World Tour", "details_link": "https://www.metacritic.com/game/playstation-3/guitar-hero-world-tour", "publisher": "Activision", "release_date": "Oct 26 2008", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/6131b141755bd8f396459d3f0f4335c7-98.jpg", "descriptions": "Guitar Hero World Tour marries Guitar Hero's guitar gameplay, with a cooperative band experience that combines the most advanced wireless instruments with revolutionary new online and offline gameplay modes. The game features a slick newly redesigned guitar, a genuine electronic drum kit andGuitar Hero World Tour marries Guitar Hero's guitar gameplay, with a cooperative band experience that combines the most advanced wireless instruments with revolutionary new online and offline gameplay modes. The game features a slick newly redesigned guitar, a genuine electronic drum kit and a microphone, as well as an innovative Music Studio music creator that lets players compose, record, edit and share their own rock and roll anthems, along with online Band Career and 8-player \"Battle of the Bands.\" Guitar Hero World Tour is comprised entirely of master recordings from some of the greatest classic and modern rock bands of all-time including Ozzy Osbourne, Van Halen, Linkin Park, The Eagles, Sublime and many more. Additionally, the game offers significantly more localized downloadable music than ever before on all of the next-generation consoles. Budding rock stars are also given creative license to fully customize everything from their characters’ appearance and instruments to their band’s logo and album covers. Featuring three drum pads, two raised cymbals and a bass kick pedal, the drum controller combines larger and quieter, velocity-sensitive drum heads with soft rubber construction to deliver authentic bounce back and is easy to set up, move, break down and store. Virtual musicians can live out their rock and roll fantasies by playing either a single instrument, or any combination of instruments, in addition to the full band experience. Guitar Hero World Tour introduces Battle of the Bands mode which allows eight players to join online and challenge each other band-to-band to determine who is the best of the best. In the Band modes, up to four players can jam together, online or off, as they progress through the game, and in single-player Career Mode, players can jam on any of the instruments in branching venue progression enabling them to rock out in the order of their choice. The game's Music Studio lets players express their musical creativity by giving them access to a full compliment of tools to create digital music from scratch, utilizing all of the instruments, and then play their compositions in the game.  Music creators can share their recordings with their friends online through GHTunes where other gamers can download their unique compositions and play them. [Activision]… Expand"}, {"name": "Horizon Zero Dawn: Complete Edition", "details_link": "https://www.metacritic.com/game/pc/horizon-zero-dawn-complete-edition", "publisher": "PlayStation Mobile Inc.", "release_date": "Aug  7 2020", "developers": ["Guerrilla"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 84, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/5410c3d455b9c0341ef7a3023f0e29e4-98.jpg", "descriptions": "Experience Aloy’s legendary quest to unravel the mysteries of a future Earth ruled by Machines. An outcast from her tribe, the young hunter fights to uncover her past, discover her destiny… and stop a catastrophic threat to the future. Use devastating tactical attacks against your prey andExperience Aloy’s legendary quest to unravel the mysteries of a future Earth ruled by Machines. An outcast from her tribe, the young hunter fights to uncover her past, discover her destiny… and stop a catastrophic threat to the future. Use devastating tactical attacks against your prey and explore a majestic open world in this action RPG.… Expand"}, {"name": "TimeSplitters: Future Perfect", "details_link": "https://www.metacritic.com/game/playstation-2/timesplitters-future-perfect", "publisher": "EA Games", "release_date": "Mar 21 2005", "developers": ["Free Radical Design"], "platforms": "PlayStation 2", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 84, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/6/624fc206e899da29ae6b0ae0990d5f19-98.jpg", "descriptions": "In TimeSplitters Future Perfect, victory is in the hands of the player's past, present, and future self in a battle that stretches throughout time where humanity is on the brink of destruction from the malevolent TimeSplitters. Cortez--the tough-as-nails hero from previousIn TimeSplitters Future Perfect, victory is in the hands of the player's past, present, and future self in a battle that stretches throughout time where humanity is on the brink of destruction from the malevolent TimeSplitters. Cortez--the tough-as-nails hero from previous installments--finds himself in a frantic race against time in a desperate bid to trace the origin of the TimeSplitters and save mankind. This third installment of the best-selling franchise will feature hundreds of hours of gameplay and an improved Story mode that ties all the missions together, immersing gamers in an epic adventure between the years of 1914 and 2401. Innovative \"meet yourself\" time travel gameplay lets players be their own ally by teaming up with past and future versions of themselves. The game also will allow two players to fight through the Story in Co-op mode, and features extensive Challenge and Arcade modes, and a Multiplayer mode that allows gamers to battle in 16-player death match online on the PlayStation(R)2 computer entertainment system. In addition, gamers will experience an improved Map Maker feature allowing them to easily create and play their own maps and share them online. TimeSplitters Future Perfect promises to be one of the deepest arcade shooters on the console with hundreds of unlockables, more realistic environments, spectacular special effects, high quality animated cut scenes, an improved physics engine, smarter enemy AI, and much more. [Electronic Arts]… Expand"}, {"name": "PlanetSide 2", "details_link": "https://www.metacritic.com/game/pc/planetside-2", "publisher": "Sony Online Entertainment", "release_date": "Nov 20 2012", "developers": ["Sony Online Entertainment"], "platforms": ["PlayStation 4", "PC"], "genres": ["Role-Playing", "Massively Multiplayer Online", "Sci-Fi", "Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Tactical", "Arcade"], "meta_score": 84, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/5f85a7080f6743c06f07a2d8f1625017-98.jpg", "descriptions": "PlanetSide 2 is an MMO FPS set in an online persistent world where the war wages non-stop and the balance of power shifts with every base and territory captured and lost."}, {"name": "Planet Coaster", "details_link": "https://www.metacritic.com/game/pc/planet-coaster", "publisher": "Frontier Developments", "release_date": "Nov 17 2016", "developers": ["Frontier Developments"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/0f1dd81af65b0b82735c8fdd3edae93c-98.jpg", "descriptions": "Planet Coaster is the future of coaster park simulation games. From the developer: We’ve created a living world where every guest is an individual with their own personality and money in their pocket. We’re giving you limitless freedom to build rides and scenery piece by piece, and toPlanet Coaster is the future of coaster park simulation games. From the developer: We’ve created a living world where every guest is an individual with their own personality and money in their pocket. We’re giving you limitless freedom to build rides and scenery piece by piece, and to seamlessly blend them with your own hand-sculpted terrain. We’re building a connected global village where everyone can share in your creativity. And that’s just the start. We hope you’ll join us to dream, build and share the ultimate coaster parks in Planet Coaster. [Frontier]… Expand"}, {"name": "Wasteland 3", "details_link": "https://www.metacritic.com/game/xbox-one/wasteland-3", "publisher": "InXile Entertainment", "release_date": "Aug 28 2020", "developers": ["InXile Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Western-Style"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/b3c3a957ddeca74eb672ee46cdcf5abf-98.jpg", "descriptions": "In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed PatriarchIn Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if you'll do a job he can only entrust to an outsider—rescue his land from the ambitions of his three bloodthirsty children. You’re dispatched on a desperate quest from the scorching deserts to the snowy mountains to start from scratch, building a new base, finding a snow-worthy vehicle, training new recruits, and fighting your way through hostile frozen wastes. All the while, you'll have to decide who to trust in this land torn apart by corruption, intrigue, warring factions, crazed cultists, cutthroat gangs, and bitter sibling rivalries. Build a reputation for yourself by making decisions that will profoundly impact Colorado, its inhabitants and the story you experience. Will you be Colorado’s savior or its worst nightmare? Wasteland 3 is a squad-based RPG from inXile entertainment, featuring challenging tactical turn-based combat and a deep, reactive story full of twists, turns, and brutal ethical decisions that will keep you hooked whether you’re a Wasteland veteran or new to the series. Create a squad of up to six Rangers and customize them with perks and abilities geared to your playstyle. You even get your own battle truck, which you can upgrade into a hardened war beast, bristling with weapons, to help mow down your enemies. … Expand"}, {"name": "Valkyria Chronicles", "details_link": "https://www.metacritic.com/game/switch/valkyria-chronicles", "publisher": "Sega", "release_date": "Oct 16 2018", "developers": ["Sega"], "platforms": ["PC", "PlayStation 3", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/a32871d4222c7ecdb1a49302a72b6234-98.jpg", "descriptions": "Fierce Combat & Explosive Tactics!\r As heroic Commander Welkin, you must lead a small platoon in defense of your country against the evil invading Empire.\r\nTurn-Based tactics meet action-packed real-time shooting in this beautifully crafted epic.\r\n\r\nFight in third-person, real-timeFierce Combat & Explosive Tactics!\r As heroic Commander Welkin, you must lead a small platoon in defense of your country against the evil invading Empire.\rTurn-Based tactics meet action-packed real-time shooting in this beautifully crafted epic.\r Fight in third-person, real-time battles!\rEpic storyline filled with dramatic warfare!\rCustomize your platoon with 50 characters!… Expand"}, {"name": "Shovel Knight: Specter of Torment", "details_link": "https://www.metacritic.com/game/switch/shovel-knight-specter-of-torment", "publisher": "Yacht Club Games", "release_date": "Mar  3 2017", "developers": ["Yacht Club Games"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Switch"], "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/0f740cde52daa374c0381518d50fafa9-98.jpg", "descriptions": "Shovel Knight: Specter of Torment is the action-packed prequel to Shovel Knight! Take control of Specter Knight, servant to the Enchantress, in a quest to recruit a cadre of knights and create the Order of No Quarter. With his scythe and preternatural agility at the ready, he can glideShovel Knight: Specter of Torment is the action-packed prequel to Shovel Knight! Take control of Specter Knight, servant to the Enchantress, in a quest to recruit a cadre of knights and create the Order of No Quarter. With his scythe and preternatural agility at the ready, he can glide across the ground, clamber up walls, and command an arsenal of curious weapons.\r If he carries out his duties, Specter Knight may have a chance at regaining his lost humanity and breaking his chains of servitude. But what cruel tricks might the Enchantress have up her sleeve?… Expand"}, {"name": "Street Fighter X Tekken", "details_link": "https://www.metacritic.com/game/playstation-3/street-fighter-x-tekken", "publisher": "Capcom", "release_date": "Mar  6 2012", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "3D"], "meta_score": 84, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/45e3f1fc9d447ce4940b36742444ba44-98.jpg", "descriptions": "Welcome to Street Fighter X Tekken, where Street Fighter and Tekken series' stalwarts Ryu, Chun-Li, Kazuya Mishima and Nina Williams headline a memorable cast of your favorite fighters in a tag battle dream match for the ages. Street Fighter X Tekken (SFXT) is a 2 vs. 2 tag team-basedWelcome to Street Fighter X Tekken, where Street Fighter and Tekken series' stalwarts Ryu, Chun-Li, Kazuya Mishima and Nina Williams headline a memorable cast of your favorite fighters in a tag battle dream match for the ages. Street Fighter X Tekken (SFXT) is a 2 vs. 2 tag team-based fighting game where players can freely tag in and out between partners. The game promises to marry the styles of both a 2D and 3D fighting game for a fresh take on the genre. Fans from each series will also be able to play with either Street Fighter's traditional 6 button layout or Tekken's 4 button layout. Players who are new to either series will be able to join in on the fun with an easy-to-understand battle system that promises excitement and countless hours of fun. [Capcom]… Expand"}, {"name": "Guilty Gear Xrd -SIGN-", "details_link": "https://www.metacritic.com/game/playstation-4/guilty-gear-xrd--sign-", "publisher": "Aksys Games", "release_date": "Dec 16 2014", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/35bb21810b998fffe0a5222b0bd2d983-98.jpg", "descriptions": "Guilty Gear Xrd -SIGN-, the newest entry of the Guilty Gear fighting game series, brings its redesigned, extreme style and unique 3D animation to players everywhere."}, {"name": "'Splosion Man", "details_link": "https://www.metacritic.com/game/xbox-360/splosion-man", "publisher": "Twisted Pixel Games", "release_date": "Jul 22 2009", "developers": ["Twisted Pixel Games"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/6e3ef148f4fa880e14ad31520b084805-98.jpg", "descriptions": "[Xbox Live Arcade]  Fools they were, to tread where knowledge should stay forbidden. For what emerged was not a man - it was Splosion Man. \"And all who saw him were 'sploded, for he was the fire and they were but meat.\" Able to 'splode himself at will, Splosion Man launches his way through[Xbox Live Arcade]  Fools they were, to tread where knowledge should stay forbidden. For what emerged was not a man - it was Splosion Man. \"And all who saw him were 'sploded, for he was the fire and they were but meat.\" Able to 'splode himself at will, Splosion Man launches his way through levels, an uncontainable force. From Twisted Pixel Games, developer of the award-winning The Maw, comes a single- or co-op multiplayer experience that 'splodes like no other. Play through 50 single-player levels split into three environmentally different chapters as Splosion Man escapes the underground Big Science Labs where he was created. Multiplayer action: Jump into 50 multiplayer levels supporting up to four player co-op split into three different chapters. Bonuses: Get free unlockable premium dashboard theme, gamerpics, and Avatar accessories. Visual style: The personality and humor shine through in film-like cinematics and hundreds of in-game animations. Vivid and colorful graphics advance character animation and emotion. Hours of fun: Splosion Man is a retail game's amount of content that can be downloaded from the comfort of your own living room. Musical talent: The original music score is from award-winning composers Joshua R. Mosley (single-player levels) and John DeBorde (multiplayer levels). [Twisted Pixel]… Expand"}, {"name": "Might & Magic: Clash of Heroes", "details_link": "https://www.metacritic.com/game/playstation-3/might-magic-clash-of-heroes", "publisher": "Ubisoft", "release_date": "Apr 12 2011", "developers": ["Capy Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "General", "General"], "meta_score": 84, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/602e2c3bc522c54d5d3b81d8039e1337-98.jpg", "descriptions": "Might and Magic Clash of Heroes takes place 40 years before the Heroes V saga. Scattered across five different regions of Ashan, 5 special heroes must travel their own dangerous paths to grow in strength, unravel a demonic plot, and ultimately save the world from Chaos."}, {"name": "TxK", "details_link": "https://www.metacritic.com/game/playstation-vita/txk", "publisher": "Llamasoft", "release_date": "Feb 11 2014", "developers": ["Llamasoft"], "platforms": "PlayStation Vita", "genres": ["Action", "Shooter", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/bce2dd4a9d714a792e80a3c05740afad-98.jpg", "descriptions": "Glowing vectors, explosive particle effects and a pulse-pounding soundtrack are core elements of many modern arcade shooters - a style that Llamasoft defined with its seminal 90s tube shooter. TxK is the spiritual successor to that genre-defining work and brings you 100 levels ofGlowing vectors, explosive particle effects and a pulse-pounding soundtrack are core elements of many modern arcade shooters - a style that Llamasoft defined with its seminal 90s tube shooter. TxK is the spiritual successor to that genre-defining work and brings you 100 levels of score-chasing gameplay married to an outstanding soundtrack that will have your head nodding as you blast your way onto the scoreboards. … Expand"}, {"name": "Pro Evolution Soccer 2009", "details_link": "https://www.metacritic.com/game/wii/pro-evolution-soccer-2009", "publisher": "Konami", "release_date": "Mar 17 2009", "developers": ["Konami"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/8131be700de5f1979284ddd72417b086-98.jpg", "descriptions": "Pro Evolution Soccer is back for 2009! The terms \"PES\" and \"Winning Eleven\" have always been synonymous with realism and superior gameplay, but this year PES will further narrow the gap between the game, and the real thing! New stadiums, players motions and gameplay modes will bolster a gamePro Evolution Soccer is back for 2009! The terms \"PES\" and \"Winning Eleven\" have always been synonymous with realism and superior gameplay, but this year PES will further narrow the gap between the game, and the real thing! New stadiums, players motions and gameplay modes will bolster a game already focused on providing an exciting soccer experience. In 2009, Pro Evolution will once again push the limits of soccer gaming. If it were any more real, you'd be on the field! [Konami]… Expand"}, {"name": "F1 2021", "details_link": "https://www.metacritic.com/game/playstation-5/f1-2021", "publisher": "Electronic Arts", "release_date": "Jul 13 2021", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 84, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/4b800a2c1615858b2d19608d81009364-98.jpg", "descriptions": "Every story has a beginning in F1 2021, the official videogame of the 2021 FIA Formula One world Championship. Enjoy the stunning new features of F1 2021, including the thrilling story experience 'braking point', two-player career, and get even closer to the grid with 'real-season start'.Every story has a beginning in F1 2021, the official videogame of the 2021 FIA Formula One world Championship. Enjoy the stunning new features of F1 2021, including the thrilling story experience 'braking point', two-player career, and get even closer to the grid with 'real-season start'. Take your team to the top in the acclaimed ten-year 'My team' Career mode, or race head-to-head in split-screen and multiplayer. Immerse yourself in the greatest racing spectacle on the planet and race with the authentic lineup of twenty heroic drivers and ten iconic teams from the 2021 Season: 'braking point' - the thrilling new story experience, new ways to play: two-player career and 'real-season start', acclaimed 'My team', split-screen and multiplayer … Expand"}, {"name": "Beyond Good & Evil HD", "details_link": "https://www.metacritic.com/game/xbox-360/beyond-good-evil-hd", "publisher": "Ubisoft", "release_date": "Mar  2 2011", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/427f209c1b0cc62a73747a584752a845-98.jpg", "descriptions": "Featuring epic boss fights, puzzle-solving and stealth-based games, Beyond Good & Evil broke the barriers of traditional action-adventure gameplay when it was released in 2003. The story follows Jade, and investigative reporter and martial artist, who works with a resistance agency toFeaturing epic boss fights, puzzle-solving and stealth-based games, Beyond Good & Evil broke the barriers of traditional action-adventure gameplay when it was released in 2003. The story follows Jade, and investigative reporter and martial artist, who works with a resistance agency to uncover a government conspiracy and reveal their horrific secrets. As Jade, players are tasked to solve puzzles, fight enemies, and obtain photographic evidence.… Expand"}, {"name": "Midnight Club 3: DUB Edition", "details_link": "https://www.metacritic.com/game/playstation-2/midnight-club-3-dub-edition", "publisher": "Rockstar Games", "release_date": "Apr 11 2005", "developers": ["Rockstar San Diego"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 84, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/a1ea7b982ba7672e6fd0e735a84ec081-98.jpg", "descriptions": "The series that took racing from tracks to the open urban streets is back, and the stakes are even higher. Midnight Club 3: Dub Edition delivers insanely fast, open city racing in Atlanta, San Diego, and Detroit, complete with 8-player online competition and the most comprehensive vehicleThe series that took racing from tracks to the open urban streets is back, and the stakes are even higher. Midnight Club 3: Dub Edition delivers insanely fast, open city racing in Atlanta, San Diego, and Detroit, complete with 8-player online competition and the most comprehensive vehicle customization ever seen in a video game. Drive the hottest licensed real life SUVs, import tuners, muscle cars, choppers and luxury rides, and trick them out with the latest rims, trims, and upgrades just like in the pages of DUB. Midnight Club 3: DUB Edition has more speed, more choices, and more chrome than any game has ever packed under the hood. [Rockstar Games]… Expand"}, {"name": "High Heat Major League Baseball 2003", "details_link": "https://www.metacritic.com/game/playstation-2/high-heat-major-league-baseball-2003", "publisher": "3DO", "release_date": "Feb  9 2002", "developers": ["3DO"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/40551b0d7b674ce9a439979ed3cd8d3f-98.jpg", "descriptions": "In addition to dabbling in B.P., Home Run Derby, Exhibition and All-Star games, HH 2003 features a Season mode with custom lengths, inactive players on each team, unsigned players, a fantasy draft, and intriguing A.I. trade acceptance decisions. A stand-alone Playoff system allows up to 8In addition to dabbling in B.P., Home Run Derby, Exhibition and All-Star games, HH 2003 features a Season mode with custom lengths, inactive players on each team, unsigned players, a fantasy draft, and intriguing A.I. trade acceptance decisions. A stand-alone Playoff system allows up to 8 players to play for the series title individually. There are options galore for the hot stove league fanatic.… Expand"}, {"name": "Super Street Fighter II: Turbo Revival", "details_link": "https://www.metacritic.com/game/game-boy-advance/super-street-fighter-ii-turbo-revival", "publisher": "Capcom", "release_date": "Oct 30 2001", "developers": ["Capcom"], "platforms": "Game Boy Advance", "genres": ["Action", "Fighting", "2D"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/38586878f25acdc7ed3998a189b2c803-98.jpg", "descriptions": "Capcom's timeless Street Fighter® masterpiece conquers the Game Boy® Advance system. Choose from over 16 brawlers from the Street Fighter universe and execute special moves, and super combos to wreak havoc on your opponent and become the best street fighter in the world. LightningCapcom's timeless Street Fighter® masterpiece conquers the Game Boy® Advance system. Choose from over 16 brawlers from the Street Fighter universe and execute special moves, and super combos to wreak havoc on your opponent and become the best street fighter in the world. Lightning fast animation, unbelievable graphics and Capcom's signature gameplay make Super Street Fighter II Turbo the most respected fighting game of all time.… Expand"}, {"name": "FIFA 17", "details_link": "https://www.metacritic.com/game/xbox-one/fifa-17", "publisher": "Electronic Arts", "release_date": "Sep 27 2016", "developers": ["EA Sports", "EA Vancouver"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 84, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/8a7374737c36930f1c4482db916ae7af-98.jpg", "descriptions": "EA SPORTS FIFA 17 The Journey isa new game mode powered by Frostbite. Immersed in The Journey, fans live their story on and off the pitch as Premier League prospect, Alex Hunter who is looking to make his mark. Fans visit new football worlds, meet new characters full of depth, and navigateEA SPORTS FIFA 17 The Journey isa new game mode powered by Frostbite. Immersed in The Journey, fans live their story on and off the pitch as Premier League prospect, Alex Hunter who is looking to make his mark. Fans visit new football worlds, meet new characters full of depth, and navigate emotional highs and lows of their unique story arc through decisions off the pitch, their performance on it, and character interactions throughout the 2016/17 season while playing for any of the 20 Premier League clubs. [Electronic Arts]… Expand"}, {"name": "The Excavation of Hob's Barrow", "details_link": "https://www.metacritic.com/game/switch/the-excavation-of-hobs-barrow", "publisher": "Wadjet Eye Games", "release_date": "Jan 25 2023", "developers": ["Cloak and Dagger Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 84, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/104bc0404082b30c0d85236539c95cec-98.jpg", "descriptions": "THE ANSWERS LIE IN THE SOIL...Antiquarian Thomasina Bateman is writing a book on the barrows of England, documenting the treasures she finds buried within. When an intriguing letter summons her to the small village of Bewlay, tucked away in the remote countryside, she sets off by trainTHE ANSWERS LIE IN THE SOIL...Antiquarian Thomasina Bateman is writing a book on the barrows of England, documenting the treasures she finds buried within. When an intriguing letter summons her to the small village of Bewlay, tucked away in the remote countryside, she sets off by train with her assistant a day behind.Upon her arrival, however, the mysterious man who summoned her is nowhere to be found. Her assistant never arrives. A stubborn landowner refuses access to the barrow, and the locals are wary of this woman who is traveling alone and (gasp!) wears trousers.The excavation of Hob's Barrow is off to a rocky start. And then Thomasina starts having strange dreamsFEATURES: * A dark, complex and evolving storyline featuring interwoven elements from real English folklore.* Traditional point and click adventure game puzzles and interactions, with an easy modern interface.* A cast of intriguing characters, from suspicious villagers to sickly vicars to lordly landowners, all with their own unique stories and motives.* A distinct folk horror tone and grounding. * Evocative pixel-art graphics, featuring cut-scenes and engaging animations.* A suitably atmospheric original soundtrack from The Machine. The Demon. - one half of the duo behind the award-winning \"Football Game\" soundtrack.* Fiends in the furrows, the smell of damp soil, and a cat or two.… Expand"}, {"name": "Planet Coaster: Console Edition", "details_link": "https://www.metacritic.com/game/xbox-series-x/planet-coaster-console-edition", "publisher": "Frontier Developments", "release_date": "Nov 10 2020", "developers": ["Frontier Developments"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 84, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/8d637fedeb5380e0c35a2550b3e937a5-98.jpg", "descriptions": "Welcome to a new era in coaster park simulation! Bring your ideas to life with easy-to-use tools, manage all aspects of your expanding empire, and harness the world’s best creations from an endlessly creative community in the Frontier Workshop."}, {"name": "Rakuen", "details_link": "https://www.metacritic.com/game/pc/rakuen", "publisher": "Laura Shigihara", "release_date": "May 10 2017", "developers": ["Laura Shigihara"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/04cb30e206f1d1387686821fa4aef046-98.jpg", "descriptions": "Rakuen is a story-based adventure game about a little Boy who becomes bored with living in a hospital, and eventually asks his mother if she'll escort him to the fantasy world from his favorite storybook. Throughout the game, the Boy begins to learn more about the patients who live aroundRakuen is a story-based adventure game about a little Boy who becomes bored with living in a hospital, and eventually asks his mother if she'll escort him to the fantasy world from his favorite storybook. Throughout the game, the Boy begins to learn more about the patients who live around him. They each have their own secrets and struggles that are mysteriously tied to the strange hospital. In helping those around him, the Boy deals with questions about empathy, hope, and what it means to leave behind a legacy by coming to terms with his own story.… Expand"}, {"name": "BioShock: The Collection", "details_link": "https://www.metacritic.com/game/xbox-one/bioshock-the-collection", "publisher": "2K Games", "release_date": "Sep 13 2016", "developers": ["2K Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "First-Person", "Arcade"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/5b06478ba925721ff6d4598d55f04922-98.jpg", "descriptions": "Return to the cities of Rapture and Columbia and experience the BioShock franchise like never before, remastered in 1080p. BioShock: The Collection contains all single-player content from BioShock, BioShock 2, and BioShock Infinite, all single-player add-on content, the “Columbia’s Finest”Return to the cities of Rapture and Columbia and experience the BioShock franchise like never before, remastered in 1080p. BioShock: The Collection contains all single-player content from BioShock, BioShock 2, and BioShock Infinite, all single-player add-on content, the “Columbia’s Finest” pack, and Director’s Commentary: Imagining BioShock, featuring Ken Levine and Shawn Robertson.… Expand"}, {"name": "GT Legends", "details_link": "https://www.metacritic.com/game/pc/gt-legends", "publisher": "Viva Media", "release_date": "Jan 23 2006", "developers": ["SimBin"], "platforms": "PC", "num_players": "16  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/fa91c6a9a772ae8d08ea85054c8cd0c2-98.jpg", "descriptions": "The golden age of motor sports has returned. Experience one of the world's most exciting racing series in GT Legends, including the legendary touring cars of the 60's and 70's. Collect more then 90 original FiA GTC-TC team vehicles and demonstrate your driving skill on real EuropeanThe golden age of motor sports has returned. Experience one of the world's most exciting racing series in GT Legends, including the legendary touring cars of the 60's and 70's. Collect more then 90 original FiA GTC-TC team vehicles and demonstrate your driving skill on real European racetracks. Original Tracks: Over 25 variations of real tracks like Imola, Monza, Donington and Mondello Park. 5 Difficulty Levels: Ranging from the easy beginner mode to the ultra realistic simulation mode. Career Mode: Win numerous cups and buy your dream car in this challenging mode. Pure Realism: Experience an unequalled level of realism in cooperation with FiA GTC-TC teams, incl. pit stops and car setups. Real Sounds: Sophisticated recording techniques guarantee an authentic acoustic profile for each vehicle. Incredible Graphics: Leading edge graphics technology enabling spectacular special effects and dynamic day and night cycles. Multiplayer Mode: Impress your friends with rare unlockable cars and challenge up to 15 opponents online. [Atari]… Expand"}, {"name": "F1 2010", "details_link": "https://www.metacritic.com/game/playstation-3/f1-2010", "publisher": "Codemasters", "release_date": "Sep 22 2010", "developers": ["Codemasters Birmingham"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/cc14a8b451ab5ef5dbfc38eb8082e0a6-98.jpg", "descriptions": "In F1 2010 gamers will take on the full, expanded grid in a variety of game modes including Grand Prix, Championship, Time Trial and an extensive, innovative Career mode. F1 2010 will also feature a highly advanced damage model, fully dynamic weather system and extensive competitiveIn F1 2010 gamers will take on the full, expanded grid in a variety of game modes including Grand Prix, Championship, Time Trial and an extensive, innovative Career mode. F1 2010 will also feature a highly advanced damage model, fully dynamic weather system and extensive competitive multiplayer options.… Expand"}, {"name": "Maximo: Ghosts to Glory", "details_link": "https://www.metacritic.com/game/playstation-2/maximo-ghosts-to-glory", "publisher": "Capcom", "release_date": "Feb 11 2002", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 84, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/fa5fdfe9ff9a9a8ea908957cbfc423bf-98.jpg", "descriptions": "You control the fate of the gallant Maximo, who returns home to find his kingdom in shambles. Your once trusted advisor, Achille has wrought evil on the land. Not only is the countryside filled with hoards of the roaming undead, but the four wise Sorceresses have been imprisoned at the fourYou control the fate of the gallant Maximo, who returns home to find his kingdom in shambles. Your once trusted advisor, Achille has wrought evil on the land. Not only is the countryside filled with hoards of the roaming undead, but the four wise Sorceresses have been imprisoned at the four corners of the Kingdom, and to make matters worse, your girlfriend, Princess Sophia has been forced to marry the scoundrel Achille. Help Maximo rescue the Sorceresses, restore good to the kingdom, whup Achille's butt, and while you're at it...get your girl back! [Capcom]… Expand"}, {"name": "BlazBlue: Central Fiction", "details_link": "https://www.metacritic.com/game/playstation-4/blazblue-central-fiction", "publisher": "Aksys Games", "release_date": "Nov  1 2016", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "Switch", "PlayStation 4"], "num_players": "Up to 32 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/126fae9e63cfbc9519660d173864580f-98.jpg", "descriptions": "BlazBlue: Central Fiction is the newest installment in the BlazBlue franchise of next gen 2D fighters. Prepare yourself for a new story, new characters, levels, modes, system mechanics and more. Choose from over 33 fighters as you battle for 2D supremacy."}, {"name": "80 DAYS", "details_link": "https://www.metacritic.com/game/switch/80-days", "publisher": "inkle", "release_date": "Oct  1 2019", "developers": ["inkle"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/11e81d7afedb08919d1a6c5175e66044-98.jpg", "descriptions": "1872, with a steampunk twist. Phileas Fogg has wagered he can circumnavigate the world in just eighty days. Choose your own route around a 3D globe, travelling by airship, submarine, mechanical camel, steam-train and more, racing other players and a clock that never stops."}, {"name": "Prey", "details_link": "https://www.metacritic.com/game/xbox-one/prey", "publisher": "Bethesda Softworks", "release_date": "May  5 2017", "developers": ["Arkane Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Role-Playing", "Shooter", "Action RPG", "First-Person", "Arcade"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/fc7b96d3cd59e304652db454d522d625-98.jpg", "descriptions": "You awaken aboard Talos I, a space station orbiting the moon in the year 2032. You are the key subject in an experiment meant to change humanity forever – but things have gone terribly wrong. The space station has been overrun by hostile aliens and you are now being hunted. As you delve intoYou awaken aboard Talos I, a space station orbiting the moon in the year 2032. You are the key subject in an experiment meant to change humanity forever – but things have gone terribly wrong. The space station has been overrun by hostile aliens and you are now being hunted. As you delve into the dark secrets of Talos I and your own past, you have to survive using the tools found on the station, your wits, weapons, and mind-bending abilities. [Bethesda Softworks]… Expand"}, {"name": "Sound Shapes", "details_link": "https://www.metacritic.com/game/playstation-vita/sound-shapes", "publisher": "SCEA", "release_date": "Aug  7 2012", "developers": ["SCEA"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music Maker", "Music Maker", "Music"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/049277cdf06d3403bbde7f8c045854b6-98.jpg", "descriptions": "Sound Shapes has you play, compose, and share on the NGP in this side-scrolling platformer, where you create music with your actions using the touch screen."}, {"name": "Gears 5", "details_link": "https://www.metacritic.com/game/xbox-one/gears-5", "publisher": "Microsoft Game Studios", "release_date": "Sep  6 2019", "developers": ["The Coalition"], "platforms": ["PC", "Xbox Series X", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/d8fb04c929a75f60d4757bc6a824affb-98.jpg", "descriptions": "Sera is crumbling, your enemies uniting. Humanity’s reliance on technology has become their downfall and enemies are uniting to wipe out all survivors. As Kait, journey back to uncover the origins of the Locust, and fight with your squad to protect what’s left."}, {"name": "Hearthstone: Heroes of Warcraft - Goblins Vs. Gnomes", "details_link": "https://www.metacritic.com/game/pc/hearthstone-heroes-of-warcraft---goblins-vs-gnomes", "publisher": "Blizzard Entertainment", "release_date": "Dec  8 2014", "developers": ["Blizzard Entertainment"], "platforms": "PC", "genres": ["Miscellaneous", "Strategy", "Turn-Based", "Card Battle"], "meta_score": 84, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/83cb0161fe5ade76f963cd14d2c3fbe0-98.jpg", "descriptions": "Goblins vs Gnomes delivers 143 newly added minions and spells."}, {"name": "MotorStorm", "details_link": "https://www.metacritic.com/game/playstation-3/motorstorm", "publisher": "SCEA", "release_date": "Mar  6 2007", "developers": ["Evolution Studios"], "platforms": "PlayStation 3", "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/1ed26b6e0a72c65c6113e370bb2f3398-98.jpg", "descriptions": "Welcome to MotorStorm, the world's most brutal off-road racing event where the goal is to win at all costs. Choose from seven vehicle types, from high-flying dirt bikes to powerful big rigs, and destroy anything that gets in your way in a no-holds barred sprint to the finish. Try andWelcome to MotorStorm, the world's most brutal off-road racing event where the goal is to win at all costs. Choose from seven vehicle types, from high-flying dirt bikes to powerful big rigs, and destroy anything that gets in your way in a no-holds barred sprint to the finish. Try and survive. Real-Time Deforming Terrain: The terrain literally gets torn up with each passing vehicle, causing each lap to be different. Advanced particle effects cause debris and muck to \"stick\" to each vehicle. Vehicular Combat and Damage: Destroy anything that gets in your way. Smash your opponents and view spectacular Hollywood-style crash sequences. [SCEE] Editor's Note:  This JPN Import Version title lacks multiplayer, which has had an effect on just about every import review.… Expand"}, {"name": "Fight Night Champion", "details_link": "https://www.metacritic.com/game/playstation-3/fight-night-champion", "publisher": "EA Sports", "release_date": "Mar  1 2011", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/dd03fa527473a0ac0a0f7986a5e372cd-98.jpg", "descriptions": "A new installment in EA Sports' boxing series will enter the ring in early 2011."}, {"name": "WHAT THE GOLF?", "details_link": "https://www.metacritic.com/game/switch/what-the-golf", "publisher": "Triband", "release_date": "May 21 2020", "developers": ["Triband"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/07bba4965651a717a5de48856783df24-98.jpg", "descriptions": "The golf game for people who hate golf!A silly physics-based golf parody where every golf course is a new surprising type of golf, some brilliant or hilarious, others so absurd they will make you go: WHAT THE GOLF?\n\nGolf a house, a horse or car!\n\nFeatures:\n- More surprising new golfThe golf game for people who hate golf!A silly physics-based golf parody where every golf course is a new surprising type of golf, some brilliant or hilarious, others so absurd they will make you go: WHAT THE GOLF?Golf a house, a horse or car!Features:- More surprising new golf mechanics than you can imagine- Epic golf boss fights- Made by people who know nothing about golf- First (and hopefully the last) game that let you golf a horse- Will NOT make you a better golf player- Surprises!… Expand"}, {"name": "Resident Evil 5", "details_link": "https://www.metacritic.com/game/playstation-3/resident-evil-5", "publisher": "Capcom", "release_date": "Mar 13 2009", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "2  Online", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/b12cfa49e878628368dbb29cb77a3d76-98.jpg", "descriptions": "The biohazard threat has not ended: Just when it seemed that the menace of Resident Evil had been destroyed, along comes a new terror to send shivers down players' spines. Chris Redfield, returning Resident Evil hero, has followed the path of the evil literally around the globe. AfterThe biohazard threat has not ended: Just when it seemed that the menace of Resident Evil had been destroyed, along comes a new terror to send shivers down players' spines. Chris Redfield, returning Resident Evil hero, has followed the path of the evil literally around the globe. After joining a new organization, Chris heads to Africa where the latest bioterrorism threat is literally transforming the people and animals of the city into mindless, maddened creatures. He is joined by a new partner, Sheva Alomar, who lends her strength, intelligence and sharp-shooting skills to the mission. In order to survive, Chris and Sheva must work together to take on the challenges of discovering the truth behind this evil plot. Utilizing a revolutionary new 2-player co-op mode of gameplay, players assume control of either Chris or Sheva and experience Resident Evil in new ways. In Resident Evil 5, Capcom has players fearing the daylight as much as they have feared shadow in previous games. [Capcom]… Expand"}, {"name": "God of War: Origins Collection", "details_link": "https://www.metacritic.com/game/playstation-3/god-of-war-origins-collection", "publisher": "SCEA", "release_date": "Sep 13 2011", "developers": ["Ready at Dawn"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 84, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/1be5a7d8c0ef6a7412d67e589336ca87-98.jpg", "descriptions": "God of War Origins Collection contains both PSP God of War games and upgrades them with HD visuals for play on the PlayStation 3."}, {"name": "Salt and Sanctuary", "details_link": "https://www.metacritic.com/game/playstation-4/salt-and-sanctuary", "publisher": "Ska Studios", "release_date": "Mar 15 2016", "developers": ["Ska Studios"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/a1ac161a1b5c07cfcd3cac8aa3622231-98.jpg", "descriptions": "Salt and Sanctuary casts you as a sailor shipwrecked on a strange, purgatorial island, insulated somehow against a backdrop of centuries-old worldwide perpetual war. What hope remains is isolated in Sanctuaries: protected dwellings where travelers band together under common creeds to takeSalt and Sanctuary casts you as a sailor shipwrecked on a strange, purgatorial island, insulated somehow against a backdrop of centuries-old worldwide perpetual war. What hope remains is isolated in Sanctuaries: protected dwellings where travelers band together under common creeds to take shelter from the hostile world outside.… Expand"}, {"name": "Xenogears", "details_link": "https://www.metacritic.com/game/playstation/xenogears", "publisher": "Square EA", "release_date": "Oct 20 1998", "developers": ["SquareSoft"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 84, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/6/868038a355288f21353a642d165835a8-98.jpg", "descriptions": "A mysterious organization is turning the tides of a century-long war with ancient technology - giant combat robots known as Gears. A failed attempt to steal one of these powerful weapons places it in the unwilling hands of young Fei and his dubious allies. Now he is pursued by militaryA mysterious organization is turning the tides of a century-long war with ancient technology - giant combat robots known as Gears. A failed attempt to steal one of these powerful weapons places it in the unwilling hands of young Fei and his dubious allies. Now he is pursued by military governments, royal pirates, spies, the emperor, and his own forgotten past. … Expand"}, {"name": "Space Rangers 2: Rise of the Dominators", "details_link": "https://www.metacritic.com/game/pc/space-rangers-2-rise-of-the-dominators", "publisher": "Cinemaware", "release_date": "Mar 27 2006", "developers": ["1C", "Elemental Games", "1C Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "General", "General"], "meta_score": 84, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/0/cbd890dae26a3352ffe08f794d92b3fd-98.jpg", "descriptions": "200 years after the first chapter for Space Rangers, a new, even more dangerous threat arises in the galaxy. A key planet producing war androids has become self-aware and is attempting to conquer the galaxy one planet at a time. These machines are not only capable of fulfilling any order,200 years after the first chapter for Space Rangers, a new, even more dangerous threat arises in the galaxy. A key planet producing war androids has become self-aware and is attempting to conquer the galaxy one planet at a time. These machines are not only capable of fulfilling any order, but they have their own intellect and force of will. This new type of cyber life is driven only by instinct of destruction and cares only about expanding the realm of the silicate. Freedom of choice is a distinguishing feature of the Space Rangers saga and continues as players explore the massive world. The game is not limited by borders and allows players an opportunity to influence the branching storyline. At the same time, the larger and more expansive game world lives and develops by itself. In Space Rangers 2 players will have an opportunity to test their skills not only in outer space, but on planets' surfaces as well. 3D real-time battles on planets is a new part of the game. By producing and upgrading war machines, gamers have a chance to defeat the ominous threat of the Dominators. [1C Company]… Expand"}, {"name": "Tetris DS", "details_link": "https://www.metacritic.com/game/ds/tetris-ds", "publisher": "Nintendo", "release_date": "Mar 20 2006", "developers": ["Nintendo"], "platforms": "DS", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Stacking", "Stacking"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/3ae2f25117147ac098027a9a6e3355eb-98.jpg", "descriptions": "10 DS players can battle with only one Tetris DS card. Each of the six modes of play features a theme based on a classic Nintendo game, such as Super Mario Bros., The Legend of Zelda or Metroid. The traditional Tetriminos (falling blocks) and line-clearing strategy remain the staples of the10 DS players can battle with only one Tetris DS card. Each of the six modes of play features a theme based on a classic Nintendo game, such as Super Mario Bros., The Legend of Zelda or Metroid. The traditional Tetriminos (falling blocks) and line-clearing strategy remain the staples of the game, but the touch screen adds a new element of interactivity. Some modes give players special Tetris puzzles to solve. Others feature head-to-head action between two players, or massive wireless battles between 10 DS users, even if only one player has a game card. Players also can log onto Nintendo Wi-Fi Connection to compete in two- or four-player battles. Tetris DS even includes a point-based rating system based on players' battle results. Opponents can see one another's ratings, which indicate their skill levels. Every gamer, whether competitive or casual, will find a way to reconnect with one of the most popular puzzle games in history. Look for more details about the new game play modes on Nintendo.com in the weeks leading up to the game's release. [Nintendo.com]… Expand"}, {"name": "Dark Souls Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/dark-souls-remastered", "publisher": "Bandai Namco Games", "release_date": "May 25 2018", "developers": ["From Software"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/2ec1c663e93bfeb14dfd38febe522e58-98.jpg", "descriptions": "Embark upon an epic dark fantasy in a universe stricken by decline and the Curse. Explore its intricate world design - full of hidden passages, dungeons and secrets - and uncover its deeply rooted lore."}, {"name": "Shin Megami Tensei: Devil Survivor", "details_link": "https://www.metacritic.com/game/ds/shin-megami-tensei-devil-survivor", "publisher": "Atlus", "release_date": "Jun 23 2009", "developers": ["Atlus"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 84, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/97919e87a3f239d7c7909238afda752f-98.jpg", "descriptions": "Tokyo is in full lockdown, the government's swift, coldblooded response to a surprise demon invasion. Trapped within the sprawling metropolis is the city's helpless populace, forced to turn on each other in order to survive.  A mysterious piece of technology, the COMP, falls into the handsTokyo is in full lockdown, the government's swift, coldblooded response to a surprise demon invasion. Trapped within the sprawling metropolis is the city's helpless populace, forced to turn on each other in order to survive.  A mysterious piece of technology, the COMP, falls into the hands of you and your peers.  This device allows you to form contracts, forcing demons to serve you in battle against the otherworldly creatures.  There are others with COMPs, so-called demon tamers, who seek to use the demons to satisfy their own whims-be they for justice, peace, or power-in the chaos that was once downtown Tokyo. Where did the demons come from?  Why did they appear?  Who created the COMPs, and what is their purpose?  These questions must soon be answered, for if you fail to solve the mystery, much more is at stake than your own lives. [Atlus USA]… Expand"}, {"name": "Prince of Persia: The Two Thrones", "details_link": "https://www.metacritic.com/game/gamecube/prince-of-persia-the-two-thrones", "publisher": "Ubisoft", "release_date": "Dec  1 2005", "developers": ["Ubisoft"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/39f278ea52dcf6b308d943e2f1b5f48f-98.jpg", "descriptions": "The Prince of Persia returns to his kingdom to find it decimated by war and turned against him in Prince of Persia: The Two Thrones. You can play as the time-bending prince or his evil alter-ego as he tries to return to the throne that is rightfully his. Now there are two distinctThe Prince of Persia returns to his kingdom to find it decimated by war and turned against him in Prince of Persia: The Two Thrones. You can play as the time-bending prince or his evil alter-ego as he tries to return to the throne that is rightfully his. Now there are two distinct characters, each with their own abilities and backgrounds, as you explore the urban setting of Babylon. Prince of Persia: The Two Thrones adds new Sands of Time abilities and an all-new setting for the third chapter in the Prince of Persia story.… Expand"}, {"name": "Tales From The Borderlands: Episode 1 - Zer0 Sum", "details_link": "https://www.metacritic.com/game/pc/tales-from-the-borderlands-episode-1---zer0-sum", "publisher": "Telltale Games", "release_date": "Nov 25 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "Adventure", "General"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/c878a8a52d7df74fc84a9cc55f582c03-98.jpg", "descriptions": "Episode 1 - Zer0 Sum - Set following the events seen in Borderlands 2, Tales from the Borderlands focuses on Rhys, a Hyperion company man who wants to become the next Handsome Jack, and it’s also about Fiona, a Pandoran con artist intending to score the biggest of all swindles. Baited intoEpisode 1 - Zer0 Sum - Set following the events seen in Borderlands 2, Tales from the Borderlands focuses on Rhys, a Hyperion company man who wants to become the next Handsome Jack, and it’s also about Fiona, a Pandoran con artist intending to score the biggest of all swindles. Baited into danger by a Vault key and all it promises, the unlikely pair are thrown together with a common purpose and a great amount of mistrust. Who is speaking the truth, and why is it important? That is for you to decide. It’s important to remember that there *are* two sides to every story, and you will tell this tale, or…tales, through the choices that you make. Your every decision as both Rhys and Fiona will affect the people and environment around you: this is a game where YOU are the final author in a brand new Borderlands story set on the unforgiving world of Pandora. [Telltale Games]… Expand"}, {"name": "Top Spin 4", "details_link": "https://www.metacritic.com/game/xbox-360/top-spin-4", "publisher": "2K Sports", "release_date": "Mar 15 2011", "developers": ["2K Czech"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/cf34a0b9ce662a02033d8b5f9ed66026-98.jpg", "descriptions": "Top Spin 4 is the latest iteration in the tennis sim, bringing 25 playable pros as well as the ability to create your own star."}, {"name": "PowerWash Simulator", "details_link": "https://www.metacritic.com/game/switch/powerwash-simulator", "publisher": "Square Enix", "release_date": "Jan 31 2023", "developers": ["FuturLab"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 6 ", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/539743a2b673e758117aabde3cc0d64c-98.jpg", "descriptions": "Release the Pressure with PowerWash Simulator! Wash away your worries with the soothing sounds of high-pressure water. Fire up your power washer and blast away every speck of dirt and grime you can find, all with the simple satisfaction of power-washing to a sparkling finish. Build up yourRelease the Pressure with PowerWash Simulator! Wash away your worries with the soothing sounds of high-pressure water. Fire up your power washer and blast away every speck of dirt and grime you can find, all with the simple satisfaction of power-washing to a sparkling finish. Build up your business in Career Mode and complete a variety of dirty jobs across the dusty town of Muckingham. There's no right or wrong; no time pressure or final score, just you and the tools you need to soak away your stress. Want a clean start? Chill out and replay your favourite jobs in Free Play.… Expand"}, {"name": "Sprint Vector", "details_link": "https://www.metacritic.com/game/pc/sprint-vector", "publisher": "Survios", "release_date": "Feb  2 2018", "developers": ["Survios"], "platforms": ["PlayStation 4", "PC"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Other"], "meta_score": 84, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/1c950b51c2c241a1a8493636e8a68da9-98.jpg", "descriptions": "Welcome to Sprint Vector championship intergalactica, where the physical thrill of extreme sports meets the unhinged energy of a crazy game show. Run, jump, climb, fling, and fly at extreme velocity as you race up to eight players and battle obstacles in this frenetic VR adrenalineWelcome to Sprint Vector championship intergalactica, where the physical thrill of extreme sports meets the unhinged energy of a crazy game show. Run, jump, climb, fling, and fly at extreme velocity as you race up to eight players and battle obstacles in this frenetic VR adrenaline platformer that puts your speed and finesse to the test.… Expand"}, {"name": "Battlefield 3", "details_link": "https://www.metacritic.com/game/xbox-360/battlefield-3", "publisher": "Electronic Arts", "release_date": "Oct 25 2011", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/4535953c07f0bb390a94b78cbae95eb9-98.jpg", "descriptions": "As bullets whiz by, walls crumble, and explosions throw you to the ground, the battlefield feels more alive and interactive than ever before. In Battlefield 3, players step into the role of the elite U.S. Marines where they will experience heart-pounding single player missions andAs bullets whiz by, walls crumble, and explosions throw you to the ground, the battlefield feels more alive and interactive than ever before. In Battlefield 3, players step into the role of the elite U.S. Marines where they will experience heart-pounding single player missions and competitive multiplayer actions ranging across diverse locations from around the globe including Europe, Middle-East and North America. … Expand"}, {"name": "UFC Undisputed 2010", "details_link": "https://www.metacritic.com/game/xbox-360/ufc-undisputed-2010", "publisher": "THQ", "release_date": "May 25 2010", "developers": ["Yuke's"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 84, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/616768132fb6db72cba507afbc388717-98.jpg", "descriptions": "UFC Undisputed 2010 is the only mixed martial arts (MMA) videogame this year that delivers the action, intensity and prestige of the Ultimate Fighting Championship. Players navigate a roster of more than 100 prolific UFC fighters, each fully rendered to convey a photorealistic appearance.UFC Undisputed 2010 is the only mixed martial arts (MMA) videogame this year that delivers the action, intensity and prestige of the Ultimate Fighting Championship. Players navigate a roster of more than 100 prolific UFC fighters, each fully rendered to convey a photorealistic appearance. Prominent UFC personalities, including commentators Joe Rogan and Mike Goldberg, veteran voice of the Octagon Bruce Buffer, the Octagon Girls, referees, trainers and more, return to showcase an authentic and memorable UFC videogame experience. Enhanced combat offers players a new Sway System with full upper body and head movement that allows for the dodging of attacks. On the ground, a new Posture System enables players to deliver stronger, fight-ending strikes from every position. In addition, players manage Octagon control with new strikes, submissions, transitions and cage positions, as well as experience added realism with the introduction of Southpaw stance. Players also enjoy customizable freedom with created fighters by combining moves from numerous MMA disciplines, including new moves taken from Sambo, Karate and Greco-Roman Wrestling, to become true mixed martial artists. [THQ]… Expand"}, {"name": "Monster Hunter Tri", "details_link": "https://www.metacritic.com/game/wii/monster-hunter-tri", "publisher": "Capcom", "release_date": "Apr 20 2010", "developers": ["Capcom"], "platforms": "Wii", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 84, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/03ffb61e6a59a8e5221c948b2a7dd504-98.jpg", "descriptions": "Monster Hunter Tri sets a new bar in the action/adventure genre with the introduction of new features and game play elements as the multi-million unit selling franchise makes its debut on the Wii system. Monster Hunter Tri depicts a living, breathing ecosystem where man co-exists withMonster Hunter Tri sets a new bar in the action/adventure genre with the introduction of new features and game play elements as the multi-million unit selling franchise makes its debut on the Wii system. Monster Hunter Tri depicts a living, breathing ecosystem where man co-exists with fantastic beasts that roam both the land and the sea. Featuring both online and offline cooperative modes, players can join online hunting parties with up to four players or play with two players on a single TV for select quests. Players also have the option to face Monster Hunter Tri's challenging quests as a single player experience accompanied by Cha-Cha, an AI hunting partner whose tracking and trapping skills prove invaluable in the hunt. New items, weapons and armor sets will also be available to assist the hunters as they embark on the most incredible Monster Hunter adventure to date. [Capcom]… Expand"}, {"name": "Castlevania Advance Collection", "details_link": "https://www.metacritic.com/game/playstation-4/castlevania-advance-collection", "publisher": "Konami", "release_date": "Sep 23 2021", "developers": ["Konami", "M2"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 84, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/0d4d8635de93fe2f529f4b05ca486368-98.jpg", "descriptions": "Count Dracula is once more back from the dead... Join the fight against Evil in the Castlevania Advance Collection, a compilation of timeless action-exploration masterpieces! In addition to the three legendary Castlevania games that were first released in the early 2000s, this collectionCount Dracula is once more back from the dead... Join the fight against Evil in the Castlevania Advance Collection, a compilation of timeless action-exploration masterpieces! In addition to the three legendary Castlevania games that were first released in the early 2000s, this collection also includes Castlevania: Dracula X and some never-before-seen sketches and artwork from the games!\r All four games are enhanced with newly added modern features such as Rewind, Save/Load and Replay, making this the best way possible to experience these classics or discover them for the first time! This collection also boasts a handy Encyclopedia, a Music Player with all soundtracks and you can even change the ROM Region to play all games in different versions.… Expand"}, {"name": "Puzzle Quest: Challenge of the Warlords", "details_link": "https://www.metacritic.com/game/pc/puzzle-quest-challenge-of-the-warlords", "publisher": "GamersGate", "release_date": "Oct 10 2007", "developers": ["Infinite Interactive"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/79048f2855cd3edce3a2141f1dafc7d5-98.jpg", "descriptions": "Designed specifically to entertain both casual and hardcore gamers with its deep immersion, five to fifteen minute play sessions and turn-based play style, Puzzle Quest: Challenge of the Warlords incorporates strategy, role-playing elements and a persistent storyline in a puzzle boardDesigned specifically to entertain both casual and hardcore gamers with its deep immersion, five to fifteen minute play sessions and turn-based play style, Puzzle Quest: Challenge of the Warlords incorporates strategy, role-playing elements and a persistent storyline in a puzzle board setting. Set in the Warlords universe, the game challenges players to create, develop and customize the ultimate hero in order to save the land of Etheria from evil Lord Bane. To advance their character, players battle in turn-based, head-to-head \"match-three\" style puzzle games in one of three distinct gameplay modes: Single-player allows gamers to battle against the AI as they embark on over 150 challenging quests, Instant Action allows gamers to jump in and immediately play continuous battles to level-up characters without participating in quests, and Multiplayer allows gamers to battle live opponents. Victory will advance the player’s hero, magical arsenal, creature companions and more - ultimately rewarding gamers at nearly every turn and providing endless hours of replayability. [D3Publisher of America]… Expand"}, {"name": "Destiny 2: Forsaken", "details_link": "https://www.metacritic.com/game/pc/destiny-2-forsaken", "publisher": "Activision", "release_date": "Sep  4 2018", "developers": ["Bungie Software", "Bungie"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 84, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/b04e06c326d572a1a480c5e1c7e803e6-98.jpg", "descriptions": "With 2 brand-new destinations to explore, and new weapons, armour and Supers to acquire, Forsaken takes players on an epic journey into the wild frontiers of our solar system where the lines between justice and revenge are blurred. Forsaken also features an all-new competitive andWith 2 brand-new destinations to explore, and new weapons, armour and Supers to acquire, Forsaken takes players on an epic journey into the wild frontiers of our solar system where the lines between justice and revenge are blurred. Forsaken also features an all-new competitive and collaborative endgame activity, called Gambit. A first-of-its kind for Destiny, Gambit is a new, hybrid 4v4 mode that merges both PvE and PvP experiences into an epic battle. This entirely new way to play Destiny 2 offers something for all types of gamers to enjoy, appealing to those who thrive on the competitive challenge of PvP gameplay, while seamlessly blending the collaborative and unpredictable elements of PvE. [Bungie] … Expand"}, {"name": "Toki Tori 2 +", "details_link": "https://www.metacritic.com/game/switch/toki-tori-2-+", "publisher": "Two Tribes", "release_date": "Feb 23 2018", "developers": ["Two Tribes"], "platforms": ["PC", "PlayStation 4", "Wii U", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/c667d821352e43a96a145a57a32fafa8-98.jpg", "descriptions": "Experience Toki Tori’s Epic Puzzle Adventure on the go, for the first time ever. Explore a forest island, learn magical songs and interact with the local wildlife to solve environmental puzzles. Toki Tori 2+’s game design requires just two moves: whistle and stomp. It's super accessible, yetExperience Toki Tori’s Epic Puzzle Adventure on the go, for the first time ever. Explore a forest island, learn magical songs and interact with the local wildlife to solve environmental puzzles. Toki Tori 2+’s game design requires just two moves: whistle and stomp. It's super accessible, yet it builds up to incredible complexity later on. There’s a ton to do, too. After puzzle-solving your way to five Ancient Frogs and saving the island from a strange pollution, you can still find 100s of golden wings, snap dozens of creature pictures and go Achievement hunting. You can now create checkpoints wherever you like, allowing for easy experimentation.\r - A unique take on the Metroidvania formula\r  - Follow the path, or stray off-road and tackle the expert puzzles\r  - Whistle magical songs to rewind, fast-travel and more\r  - Snap dozens of Tokidex creature pictures… Expand"}, {"name": "Steins;Gate 0", "details_link": "https://www.metacritic.com/game/playstation-vita/steinsgate-0", "publisher": "PQube", "release_date": "Nov 29 2016", "developers": ["5pb"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 84, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/8/993eb0a4bafd47d257f00c00099a57b4-98.jpg", "descriptions": "If you can't save the on you love... ... How can you save humanity?\r - A new story in the critically-acclaimed Steins;Gate series.\r- From the depths of despair - explore a whole new world line\r- Your favourite characters return alongside a brand new cast!"}, {"name": "Assassin's Creed III", "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed-iii", "publisher": "Ubisoft", "release_date": "Oct 30 2012", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 84, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/dd259137c6ae810824f12b6b2ebfe477-98.jpg", "descriptions": "It's 1775. The colonies are on the verge of revolt. Assume the role of Connor, an assassin sworn to achieve liberty for his people and his new nation. To accomplish this, you will pursue your enemies across an open world. You will utilize your killing power in a violent pursuit that will seeIt's 1775. The colonies are on the verge of revolt. Assume the role of Connor, an assassin sworn to achieve liberty for his people and his new nation. To accomplish this, you will pursue your enemies across an open world. You will utilize your killing power in a violent pursuit that will see you traverse chaotic city streets and blood-soaked battlefields in the dangerous American frontier and beyond. You will encounter legendary heroes of American history, and with them you will conspire to annihilate those who threaten to bring down  Liberty itself. Assassin's Creed 3.… Expand"}, {"name": "Deus Ex: Invisible War", "details_link": "https://www.metacritic.com/game/xbox/deus-ex-invisible-war", "publisher": "Eidos Interactive", "release_date": "Dec  2 2003", "developers": ["Ion Storm"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/e2e1ab9432bb8f5461d2f44838ad70ff-98.jpg", "descriptions": "Approximately 20 years after the events depicted in Deus Ex, the world is only beginning to recover from a catastrophic depression.  During this chaotic period of recovery, several religious and political factions see an opportunity to reshape a worldwide government to their agendas.  InApproximately 20 years after the events depicted in Deus Ex, the world is only beginning to recover from a catastrophic depression.  During this chaotic period of recovery, several religious and political factions see an opportunity to reshape a worldwide government to their agendas.  In this techno nightmare, take part in the dark struggle to raise the world from its own ashes.  With biotech modifications, you gain the ability to see through walls, leap 40 feet into the air, or regenerate critical injuries.  Whether you prefer the path of violence or nonviolence, Deus Ex: Invisible War offers multiple solutions to problems and allows for radically different styles of play.… Expand"}, {"name": "Return to Castle Wolfenstein: Tides of War", "details_link": "https://www.metacritic.com/game/xbox/return-to-castle-wolfenstein-tides-of-war", "publisher": "Activision", "release_date": "May  6 2003", "developers": ["Nerve Software"], "platforms": "Xbox", "num_players": "1-16 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/e0e55eccccf996dbebb32cf3177031fa-98.jpg", "descriptions": "You are U.S. Army Ranger B.J. Blazkowicz.  As World War II rages across Europe, the Office of Secret Actions has assigned you to investigate strange rumors of occult activity and genetic engineering.  You are about to embark on a journey deep into the heart of the Third Reich to battle theYou are U.S. Army Ranger B.J. Blazkowicz.  As World War II rages across Europe, the Office of Secret Actions has assigned you to investigate strange rumors of occult activity and genetic engineering.  You are about to embark on a journey deep into the heart of the Third Reich to battle the most horrific creatures ever unleashed.  You must face zombies brought back from the dead through dark magic and destroy mutants created through twisted science.  All the while there'll be legions of Nazi soldiers battling to win the war.… Expand"}, {"name": "Hitman 2: Silent Assassin", "details_link": "https://www.metacritic.com/game/xbox/hitman-2-silent-assassin", "publisher": "Eidos Interactive", "release_date": "Sep 30 2002", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 84, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/4c21a6c5a384ee3c2c56d39eb6a4fbaa-98.jpg", "descriptions": "The sequel to Hitman forces a retired assassin back into action by treason.  Visit the dark recesses of the world corrupted by crime, greed, degradation, and dishonor.  Your contracts will take you to exotic locations around the globe including Sicily, St. Petersburg, Japan, Malaysia, andThe sequel to Hitman forces a retired assassin back into action by treason.  Visit the dark recesses of the world corrupted by crime, greed, degradation, and dishonor.  Your contracts will take you to exotic locations around the globe including Sicily, St. Petersburg, Japan, Malaysia, and India.  A diverse arsenal of equipment, from armor-piercing rifles and explosives to chloroform and poison darts, are at your disposal.  Stalk and eliminate your targets up close and personal, in either first- or third-person perspectives.  You must decide whether to use stealth or aggression, but be careful--you'll have to deal with the consequences.… Expand"}, {"name": "Heroes of Might and Magic IV", "details_link": "https://www.metacritic.com/game/pc/heroes-of-might-and-magic-iv", "publisher": "3DO", "release_date": "Mar 28 2002", "developers": ["New World Computing"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/0da12b09e95ea45b82ba26ba903fba95-98.jpg", "descriptions": "Lead multiple hero-characters into battle to fight alongside troops for an intense combat experience. Encounter all-new heroes and over 60 creatures in 6 massive campaigns and 24 scenarios. \rWith an all-new game engine, lifelike isometric view, breathtaking graphics and richly detailedLead multiple hero-characters into battle to fight alongside troops for an intense combat experience. Encounter all-new heroes and over 60 creatures in 6 massive campaigns and 24 scenarios. \rWith an all-new game engine, lifelike isometric view, breathtaking graphics and richly detailed landscapes, the adventure map comes alive! With 48 Hero Classes and all-new skill and magic systems, summon all your strategic insight, tactical cunning and leadership abilities to ascend to the throne of this perilous new world! [3DO]… Expand"}, {"name": "Knockout Kings 2001", "details_link": "https://www.metacritic.com/game/playstation/knockout-kings-2001", "publisher": "EA Sports", "release_date": "Oct 30 2000", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PlayStation"], "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/bf611b569b081bd001fa521a09496c16-98.jpg", "descriptions": "Knockout Kings 2001 is easily the best iteration of the series thus far, thanks to improved AI, cleaner graphics, and tighter controls."}, {"name": "Command & Conquer: Red Alert 2", "details_link": "https://www.metacritic.com/game/pc/command-conquer-red-alert-2", "publisher": "Electronic Arts", "release_date": "Oct 21 2000", "developers": ["Westwood Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "Command"], "meta_score": 84, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/5/270506128ee0c0c928ccc3605f9526d8-98.jpg", "descriptions": "Wielding strange new technologies and hungering for revenge, the Soviet Empire invades America. New York City and Washington are overwhelmed. Allied forces, unprepared for the surprise attack, are decimated. Will freedom be crushed under the heels of Communist aggression?  [Electronic Arts]"}, {"name": "Shogun: Total War", "details_link": "https://www.metacritic.com/game/pc/shogun-total-war", "publisher": "Electronic Arts", "release_date": "Jun 13 2000", "developers": ["Creative Assembly"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Real-Time", "Historic", "Historic", "General", "Historic"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/f6c46860f09019ec05a7dca12562066b-98.jpg", "descriptions": "Japan, 1542. The land is in turmoil. The last Shogunate has collapsed, leaving the nation divided into seven warring factions. Out of this chaos will emerge one warlord who will master the Art Of War.  [Electronic Arts]"}, {"name": "Bayonetta", "details_link": "https://www.metacritic.com/game/switch/bayonetta", "publisher": "Nintendo", "release_date": "Feb 16 2018", "developers": ["Nintendo", "PlatinumGames"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/b69ed8beb89d50b7d2fef082fb302f6d-98.jpg", "descriptions": "Bayonetta is a cinematic and stylish action game from the creative mind of Hideki Kamiya. As a gun-wielding witch with powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless enemies in a game of 100% pure all-out action. Outlandish finishing moves areBayonetta is a cinematic and stylish action game from the creative mind of Hideki Kamiya. As a gun-wielding witch with powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless enemies in a game of 100% pure all-out action. Outlandish finishing moves are performed with acrobatic grace as Bayonetta flows from one fight to another. Bayonetta pushes the limits of the action genre with magnificent over-the-top action and fast-paced, dynamic climax combat.… Expand"}, {"name": "Outland", "details_link": "https://www.metacritic.com/game/xbox-360/outland", "publisher": "Ubisoft", "release_date": "Apr 27 2011", "developers": ["Housemarque"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "3D", "2D"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/cf5701387cbedf76d52ffcf14c280638-98.jpg", "descriptions": "Outland puts players in the middle of a world of balance and chaos where their efforts allow them to bridge the ancient divide, or doom the world to destruction. Each player’s adventure will take them between light and darkness and force them to adapt to an ever-changing world. This lightOutland puts players in the middle of a world of balance and chaos where their efforts allow them to bridge the ancient divide, or doom the world to destruction. Each player’s adventure will take them between light and darkness and force them to adapt to an ever-changing world. This light versus dark core gameplay is inspired by the arcade classic Ikaruga.… Expand"}, {"name": "Mega Man X Legacy Collection", "details_link": "https://www.metacritic.com/game/switch/mega-man-x-legacy-collection", "publisher": "Capcom", "release_date": "Jul 24 2018", "developers": ["Capcom", "M2"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/d83b23e662eebbab002488ece9b5e98d-98.jpg", "descriptions": "Mega Man X Legacy Collection includes Mega Man X, X2, X3, and X4"}, {"name": "Rayman Legends: Definitive Edition", "details_link": "https://www.metacritic.com/game/switch/rayman-legends-definitive-edition", "publisher": "Ubisoft", "release_date": "Sep 12 2017", "developers": ["Ubisoft Montpellier", "Pasta Games"], "platforms": "Switch", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/27596ceca4b2d2f86688686d7c948c31-98.jpg", "descriptions": "Rayman, winner of multiple artistic and musical achievements, is coming to Nintendo Switch with Rayman Legends Definitive Edition.\r Rayman, Globox, and the Teensies are off wandering through an enchanted forest when they discover a mysterious tent filled with a series of captivatingRayman, winner of multiple artistic and musical achievements, is coming to Nintendo Switch with Rayman Legends Definitive Edition.\r Rayman, Globox, and the Teensies are off wandering through an enchanted forest when they discover a mysterious tent filled with a series of captivating paintings. As they look more closely, they notice each painting seems to tell the story of a mythical world. While focusing on a painting that shows a medieval land, they are suddenly sucked into the painting, entering the world, and the adventure begins. The gang must run, jump, and fight their way through each world to save the day and discover the secrets of every legendary painting.\r *    Join the team with up to 4 players in local co-op!\r*    Compete with your friends in tournaments with the Kung Foot experience (local wireless multiplayer)\r*    Run, jump & smack your way through 100+ maps\r*    Jump to the rhythm and rock the party to beat the crazy musical levels… Expand"}, {"name": "Shin Megami Tensei: Devil Survivor 2 Record Breaker", "details_link": "https://www.metacritic.com/game/3ds/shin-megami-tensei-devil-survivor-2-record-breaker", "publisher": "Atlus", "release_date": "May  5 2015", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 84, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/52a22baefd6fb10749ee6e1d10d94ae8-98.jpg", "descriptions": "Your days are numbered. Your character in Shin Megami Tensei: Devil Survivor 2 Record Breaker is stuck in a world that has been invaded and is on the brink of non-existence. At the same time, you and your friends have gained the ability to summon demons via your cell phone, and with it, aYour days are numbered. Your character in Shin Megami Tensei: Devil Survivor 2 Record Breaker is stuck in a world that has been invaded and is on the brink of non-existence. At the same time, you and your friends have gained the ability to summon demons via your cell phone, and with it, a power to fight against fate. The countdown begins; will you be able to save the future of mankind?… Expand"}, {"name": "Gears of War 4", "details_link": "https://www.metacritic.com/game/xbox-one/gears-of-war-4", "publisher": "Microsoft Game Studios", "release_date": "Oct 11 2016", "developers": ["The Coalition"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Sci-Fi", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 84, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/53a2c888bb45d9d45da8f9a4e77cbf2a-98.jpg", "descriptions": "A new saga begins. After narrowly escaping an attack on their village, JD Fenix and his friends, Kait and Del, must rescue the ones they love and discover the source of a monstrous new enemy. Engage in a two-player co-op campaign with friends locally via split-screen, over Xbox Live or LAN.A new saga begins. After narrowly escaping an attack on their village, JD Fenix and his friends, Kait and Del, must rescue the ones they love and discover the source of a monstrous new enemy. Engage in a two-player co-op campaign with friends locally via split-screen, over Xbox Live or LAN. Player 2 can select either Kait or Del. Team up with four others and battle wave after wave of increasingly difficult enemies by choosing your combat class, leveling up your skills and deploying fortifications anywhere on the map. Compete online in new and favorite game types, all at 60fps on dedicated servers. A new visible ranking system means fairer matchmaking for social, competitive and professional players alike. [Xbox.com]… Expand"}, {"name": "Mass Effect 3: Citadel", "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-3-citadel", "publisher": "Electronic Arts", "release_date": "Mar  5 2013", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/f6dc5c360f2438a6a5534bb621d3f38f-98.jpg", "descriptions": "When a sinister conspiracy targets Commander Shepard, you and your team must uncover the truth, through battles and intrigue that range from the glamour of the Citadel's Wards to the top-secret Council Archives.  Uncover the truth and fight alongside your squad - as well as the cast from theWhen a sinister conspiracy targets Commander Shepard, you and your team must uncover the truth, through battles and intrigue that range from the glamour of the Citadel's Wards to the top-secret Council Archives.  Uncover the truth and fight alongside your squad - as well as the cast from the original Mass Effect and Mass Effect 2, including Urdnot Wrex!… Expand"}, {"name": "Halo 5: Guardians", "details_link": "https://www.metacritic.com/game/xbox-one/halo-5-guardians", "publisher": "Microsoft Game Studios", "release_date": "Oct 27 2015", "developers": ["343 Industries"], "platforms": "Xbox One", "num_players": "Up to 24 ", "genres": ["Shooter", "Sci-Fi", "Sci-Fi", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 84, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/fb5d25339531df685bc485bef5eb420f-98.jpg", "descriptions": "Peace has been devastated as colony worlds are unexpectedly attacked. What's more, when humanity's greatest hero goes missing, a new Spartan is assigned the task of hunting the Master Chief and solving a mystery that threatens the whole of the galaxy."}, {"name": "DiRT", "details_link": "https://www.metacritic.com/game/pc/dirt", "publisher": "Codemasters", "release_date": "Jun 19 2007", "developers": ["Codemasters"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/1a10219d7a4052d79392aea4e6f72de0-98.jpg", "descriptions": "(Formerly known as \"Colin McRae Rally 2007\" or \"CMR '07\")  After a two-year break for the series, Codemasters Studios' designers have created a reinvigorated McRae experience. The new Colin McRae title goes beyond the series' point-to-point rallying to deliver the most diverse selection of(Formerly known as \"Colin McRae Rally 2007\" or \"CMR '07\")  After a two-year break for the series, Codemasters Studios' designers have created a reinvigorated McRae experience. The new Colin McRae title goes beyond the series' point-to-point rallying to deliver the most diverse selection of extreme off-road competitions. Sensational gravel, mud and dirt racing events from the world over include perilous Hill Climb and collision-packed Rally Cross events. International rallying competitions are also featured, with official cars on tracks based on real roads and locations around the globe. The title also expands on beat-the-clock racing and includes events with multiple cars on track to satisfy anyone who wants to push their on-the-edge driving just that bit further. [Codemasters]… Expand"}, {"name": "SNK vs. Capcom: Card Fighters' Clash", "details_link": "https://www.metacritic.com/game/switch/snk-vs-capcom-card-fighters-clash", "publisher": "SNK", "release_date": "Jan 12 2022", "developers": ["SNK"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 84, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/ca934603c2c4959d9ffb9e295f908cfa-98.jpg", "descriptions": "Characters from SNK and CAPCOM clash in this epic card fighting game!\r Introducing! SNK VS. CAPCOM: CARD FIGHTERS' CLASH, a white-hot card fighting game for the NEOGEO POCKET COLOR (released in 1999), is coming to Nintendo Switch™!\r\n\r\nBack then, SNK VS. CAPCOM: CARD FIGHTERS' CLASH wasCharacters from SNK and CAPCOM clash in this epic card fighting game!\r Introducing! SNK VS. CAPCOM: CARD FIGHTERS' CLASH, a white-hot card fighting game for the NEOGEO POCKET COLOR (released in 1999), is coming to Nintendo Switch™!\r Back then, SNK VS. CAPCOM: CARD FIGHTERS' CLASH was sold as two separate games; the SNK Cardfighter's Version and the CAPCOM Cardfighter's Version. But now, both have been combined into one game! There's nothing stopping you from collecting all the cards!\r -SNK icons like Terry, Nakoruru, and Marco clash against CAPCOM legends Ryu, Chun-Li, and Mega Man in this insane card fighter!\r -There are 300 cards in total, where characters from both SNK and CAPCOM appear as Character Cards for fighting, and Action Cards for support during battle. Go out there and make the strongest fighting deck in the world!\r -You can trade between both the SNK and CAPCOM Cardfighters' Versions. What's more, you can even use their individual save data to have them battle each other!\r *You may switch between the SNK Cardfighter's Version and CAPCOM Cardfighter's Version at any time, but each has their own save data.\r *You may switch between the Japanese and English versions at any time, but each has their own save data.\r *Trading between Japanese and English versions is not possible.\r *The manual included in the game it is from the NEOGEO POCKET Color edition. Therefore, some of the controls may vary on Nintendo Switch.\r… Expand"}, {"name": "F1 2017", "details_link": "https://www.metacritic.com/game/xbox-one/f1-2017", "publisher": "Codemasters", "release_date": "Aug 25 2017", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/8abf3f741d54628bff55ff6e29bd358e-98.jpg", "descriptions": "Win the 2017 World Championship, break every record in the fastest ever F1 cars, and race some of the most iconic F1 cars of the last 30 years. The game sports an even deeper ten year Career, more varied gameplay in the new ‘Championships’ mode, and a host of other new features, both onlineWin the 2017 World Championship, break every record in the fastest ever F1 cars, and race some of the most iconic F1 cars of the last 30 years. The game sports an even deeper ten year Career, more varied gameplay in the new ‘Championships’ mode, and a host of other new features, both online and offline.… Expand"}, {"name": "Super Street Fighter IV: Arcade Edition", "details_link": "https://www.metacritic.com/game/pc/super-street-fighter-iv-arcade-edition", "publisher": "Capcom", "release_date": "Jul  7 2011", "developers": ["Capcom", "QLOC"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "3D"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/e6a857fbf4aa12074b5ed61cd40d531e-98.jpg", "descriptions": "Super Street Fighter IV Arcade Edition features a roster of 39 characters, with 4 new characters added."}, {"name": "NBA 2K7", "details_link": "https://www.metacritic.com/game/xbox-360/nba-2k7", "publisher": "2K Sports", "release_date": "Sep 25 2006", "developers": ["Kush Games", "Visual Concepts"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/6a6192108f83c9004efd5795fd71620a-98.jpg", "descriptions": "Be a Sharpshooter - The award winning technical achievement of 2K6 is new and improved. Take complete control of all of your shots with the shot stick. Run the Streets - Hit the street courts and showcase your playground game with completely all new streetball mode. Virtual Identity ProfileBe a Sharpshooter - The award winning technical achievement of 2K6 is new and improved. Take complete control of all of your shots with the shot stick. Run the Streets - Hit the street courts and showcase your playground game with completely all new streetball mode. Virtual Identity Profile - Learn the play style of your friends and foes with the V.I.P. System. The Association - Be the GM of your NBA team with the deepest Franchise Mode around. [2K Sports]… Expand"}]