[{"name": "The Alliance Alive", "details_link": "https://www.metacritic.com/game/3ds/the-alliance-alive", "publisher": "Atlus", "release_date": "Mar 27 2018", "developers": ["Cattle Call", "GREZZO", "FuRyu"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/2c2f4df02e38401d354cfb8635cfd710-98.jpg", "descriptions": "The makers of The Legend of Legacy bring the classic JRPG back to form in The Alliance Alive, a new adventure that evokes the nostalgia of the JRPG greats by offering huge world-exploration, an intertwining story of 9 protagonists, and well-designed battle mechanics. One thousand years ago,The makers of The Legend of Legacy bring the classic JRPG back to form in The Alliance Alive, a new adventure that evokes the nostalgia of the JRPG greats by offering huge world-exploration, an intertwining story of 9 protagonists, and well-designed battle mechanics. One thousand years ago, Daemons invaded the world of Humans. They subjugated Humanity and created the Great Barrier to separate the realms. The world was thrown into upheaval, and the Dark Current was born. Humanity was decimated and now Daemons rule atop a hierarchical society. However, the time for resistance has come. The world is about to change yet again... [Nintendo]… Expand"}, {"name": "Story of Seasons: Trio of Towns", "details_link": "https://www.metacritic.com/game/3ds/story-of-seasons-trio-of-towns", "publisher": "XSEED Games", "release_date": "Feb 28 2017", "developers": ["Marvelous Inc."], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/8ed49ab8e7ff8a3491f72dfe1b9bb254-98.jpg", "descriptions": "What will you do today? Take charge of an expansive farm near three unique and exciting towns and choose what kind of life to lead.\r The original and best-selling farming/life sim returns for its 20th anniversary with a brand new adventure!\r\n\r\nTake on the role of a young city slicker whoWhat will you do today? Take charge of an expansive farm near three unique and exciting towns and choose what kind of life to lead.\r The original and best-selling farming/life sim returns for its 20th anniversary with a brand new adventure!\r Take on the role of a young city slicker who has always wished for a life on the farm. Your dream leads you to a huge plot of open land just ready to be filled with crops, livestock, decorations, and more.\r Your new farm is at the crossroads of three different towns. Westown, with its cows and corrals, has everything the classic frontier settler needs. Right next door is Lulukoko Town, a warm, friendly paradise to rival any tropical island. Rounding out the neighborhood is Tsuyukusa, a traditional Far Eastern village. Become friends with the residents and help them improve their towns, then connect to other farmers like you, locally or via internet, to chat and trade useful items.\r Grow crops, raise adorable pets, become a renowned chef or fashionista, and even discover romance with the locals. It's all up to you in STORY OF SEASONS: Trio of Towns.… Expand"}, {"name": "MindSeize", "details_link": "https://www.metacritic.com/game/switch/mindseize", "publisher": "First Press Games", "release_date": "Sep 29 2020", "developers": ["Kamina Dimension"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/dbf1bfb958803752883030f73c325d98-98.jpg", "descriptions": "MindSeize is a single player 2D Metroidvania game set in a sci-fi universe. Explore untamed planets and stop the mysterious organization that stole the mind of your daughter.You play as the private investigator M.C. Fox, who is chasing a dangerous criminal organization 'The Ascended'MindSeize is a single player 2D Metroidvania game set in a sci-fi universe. Explore untamed planets and stop the mysterious organization that stole the mind of your daughter.You play as the private investigator M.C. Fox, who is chasing a dangerous criminal organization 'The Ascended' across the universe. The first confrontation between M.C. and the leader of The Ascended severely injured M.C. and left him crippled. They also managed to seize the mind of his daughter Taryn. This left only one choice for our protagonist: hire a crew, connect his consciousness into a robotic body called MAG and continue the chase!… Expand"}, {"name": "Death end re;Quest 2", "details_link": "https://www.metacritic.com/game/playstation-4/death-end-request-2", "publisher": "Idea Factory", "release_date": "Aug 25 2020", "developers": ["Compile Heart"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/f46fd02c144e88e8b8f19e56c148c401-98.jpg", "descriptions": "In collaboration with Corpse Party scenario writer Makoto Kedouin, this horror RPG follows Mai Toyama’s search for her sister in a quiet lakeside town. She’ll unravel clues to the town’s past by day, and battle Shadow Matter by night. Can you uncover the truth before reality is consumed byIn collaboration with Corpse Party scenario writer Makoto Kedouin, this horror RPG follows Mai Toyama’s search for her sister in a quiet lakeside town. She’ll unravel clues to the town’s past by day, and battle Shadow Matter by night. Can you uncover the truth before reality is consumed by darkness? … Expand"}, {"name": "The Coma 2: Vicious Sisters", "details_link": "https://www.metacritic.com/game/switch/the-coma-2-vicious-sisters", "publisher": "Headup Games", "release_date": "Jun 19 2020", "developers": ["Devespresso Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/ffb1d34f82f3af85dfb86dbd0ec420e4-98.jpg", "descriptions": "Mina Park, a student of Sehwa High, awakens at night in her school. It isn't long before she realizes that something is amiss. The once-familiar school where she spends her evenings studying looks twisted by something dark and sinister. She finds herself pursued by someone or something thatMina Park, a student of Sehwa High, awakens at night in her school. It isn't long before she realizes that something is amiss. The once-familiar school where she spends her evenings studying looks twisted by something dark and sinister. She finds herself pursued by someone or something that looks eerily like her teacher. To survive, Mina must venture beyond the boundaries of her school and into the surrounding district. There, she will encounter strange creatures, mysterious strangers, and uneasy allies.The Coma 2: Vicious Sisters is an atmospheric, story-driven game. Immerse yourself in the warped Sehwa district as you encounter an engaging cast of characters, solve puzzles, discover revealing clues, and fight for survival against a relentless psycho.Heroines, forced to confront their worst fears, rarely emerge unscathed. Over the course of the story, Mina will encounter dangerous scenarios from which she could sustain permanent damage. Craft items to anticipate future dangers to avoid injury.Dark Song is now more fearsome and powerful than ever before. Falling into her grasp could spell instant death. Running and wielding your flashlight makes you an easy target. You must precariously balance the urgency of exploration with your absolute need to survive!… Expand"}, {"name": "Dark Nights with Poe and Munro", "details_link": "https://www.metacritic.com/game/pc/dark-nights-with-poe-and-munro", "publisher": "D'Avekki Studios Limited", "release_date": "May 19 2020", "developers": ["D'Avekki Studios Limited"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 74, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/125ca8760f5fc031ad959846c20c02ec-98.jpg", "descriptions": "Guide local radio hosts Poe and Munro through six TV-like episodes of supernatural strangeness and sizzling on-screen chemistry. From the creators of The Infectious Madness of Doctor Dekker and The Shapeshifting Detective."}, {"name": "Alone With You (2017)", "details_link": "https://www.metacritic.com/game/pc/alone-with-you-2017", "publisher": "Benjamin Rivers", "release_date": "Feb  9 2017", "developers": ["Benjamin Rivers"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 74, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/16f262d133dbbfd6048218bd116c68a6-98.jpg", "descriptions": "Alone With You is a sci-fi game for people who love adventure, exploring and maybe even a little romance. You're the last survivor of a doomed space colony, trying to escape a planet before it implodes around you. Along with your troubled AI companion, you'll scan for clues, solve puzzles,Alone With You is a sci-fi game for people who love adventure, exploring and maybe even a little romance. You're the last survivor of a doomed space colony, trying to escape a planet before it implodes around you. Along with your troubled AI companion, you'll scan for clues, solve puzzles, and discover the fates of over two-dozen colonists and the secrets of their interwoven lives.… Expand"}, {"name": "Neverwinter", "details_link": "https://www.metacritic.com/game/playstation-4/neverwinter", "publisher": "Perfect World Entertainment", "release_date": "Jul 19 2016", "developers": ["Cryptic Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 74, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/ed60e7afff013f53b4cba0d4e0cf94d6-98.jpg", "descriptions": "Once a bustling location, Neverwinter has faced a great many disasters in the past hundred years. Rule of the city remains unclear following the unfortunate demise of the last Lord of Neverwinter and factions still battle for dominance after the all-consuming Spellplague took a high toll onOnce a bustling location, Neverwinter has faced a great many disasters in the past hundred years. Rule of the city remains unclear following the unfortunate demise of the last Lord of Neverwinter and factions still battle for dominance after the all-consuming Spellplague took a high toll on the population. Even Neverwinter's dead are beginning to rise from their graves and march upon the city they once called home.… Expand"}, {"name": "Grim Legends: The Forsaken Bride", "details_link": "https://www.metacritic.com/game/xbox-one/grim-legends-the-forsaken-bride", "publisher": "Artifex Mundi", "release_date": "Jun 10 2016", "developers": ["Artifex Mundi"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Puzzle", "Hidden Object"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/6e54a5063f727d7446e1207bc9a44bdd-98.jpg", "descriptions": "Enter an enchanting world of legends and magic, where your destiny was written in blood and whispers of true love."}, {"name": "Need for Speed Underground Rivals", "details_link": "https://www.metacritic.com/game/psp/need-for-speed-underground-rivals", "publisher": "EA Games", "release_date": "Mar 14 2005", "developers": ["Team Fusion"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 74, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/ee84381fbfd27fb8dc6ef1afca741282-98.jpg", "descriptions": "Customize and take on the pinnacle Japanese & American tuner cars in a pursuit of total ownership of the street racing scene. A uniquely designed racing game based on the legacy of the hugely successful Underground series. All New Tracks & Environments – Compete against your rivals in 10 allCustomize and take on the pinnacle Japanese & American tuner cars in a pursuit of total ownership of the street racing scene. A uniquely designed racing game based on the legacy of the hugely successful Underground series. All New Tracks & Environments – Compete against your rivals in 10 all new & visually distinct tracks. Each one has been specially designed to maximize the experience on the handheld platform. Japanese Customs vs. American Muscle Cars – Customize and compete against a host of high performance tuner cars from Japan and America. Take on these rivals and find out who's best. Head-to-Head Rivalry – Take on friends and foes in a range of new modes specifically designed for use via Wi-Fi. It’s multiplayer gaming in which you earn respect and own the competition. New Ways to Go Underground – Brand new game modes that capitalize on the cutting-edge hardware features of the PSP handheld videogame system and deliver a highly competitive game play experience. [Electronic Arts]… Expand"}, {"name": "Inazuma Eleven 2: Blizzard", "details_link": "https://www.metacritic.com/game/ds/inazuma-eleven-2-blizzard", "publisher": "Nintendo", "release_date": "Mar 16 2012", "developers": ["Level 5"], "platforms": "DS", "genres": ["Sports", "General"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/9d31fa699224028f2cac16e9530c3e88-98.jpg", "descriptions": null}, {"name": "Vietcong (2003)", "details_link": "https://www.metacritic.com/game/pc/vietcong-2003", "publisher": "Gathering", "release_date": "Mar 26 2003", "developers": ["Pterodon"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 74, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/0892bc643cc4321f387ef6b71eaca998-98.jpg", "descriptions": "Set during the Vietnam War, Vietcong is a first person shooter with tactical elements. Vietcong combines thrilling action with strategic thinking. The evolving storyline combined with the game's intense sound system, graphics and animation truly bring powerful jungle combat to life on yourSet during the Vietnam War, Vietcong is a first person shooter with tactical elements. Vietcong combines thrilling action with strategic thinking. The evolving storyline combined with the game's intense sound system, graphics and animation truly bring powerful jungle combat to life on your PC. Acting as an elite soldier, players of Vietcong command the A-team, part of the U.S. Special Forces, in realistically represented Vietnamese environments. Players will lead as many as six expertly trained soldiers through 20 dramatic missions, and follow a storyline that captures the danger, fear and unpredictability of the war itself. [Gathering of Developers]… Expand"}, {"name": "Star Ocean: The Last Hope International", "details_link": "https://www.metacritic.com/game/playstation-3/star-ocean-the-last-hope-international", "publisher": "Square Enix", "release_date": "Feb  8 2010", "developers": ["Square Enix", "Tri-Ace"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/5240c19adad15d58ae71e040754ae646-98.jpg", "descriptions": "The year is A.D. 2087. In the aftermath of World War III, Earth has been ravaged and the population decimated by a deteriorating environment. The countries that survived have joined together to form the Greater Unified Nations and turned their eyes skyward - to space. Edge Maverick and hisThe year is A.D. 2087. In the aftermath of World War III, Earth has been ravaged and the population decimated by a deteriorating environment. The countries that survived have joined together to form the Greater Unified Nations and turned their eyes skyward - to space. Edge Maverick and his childhood friend Reimi Saionji are chosen as pioneer members of the Space Reconnaissance Force, which was created to seek out new worlds beyond the stars. Their ship, the Calnus, takes its place on the lunar launch pad along with four other starships of the first reconnaissance fleet. These ships - humanity’s last hope - blast off one-by-one and sail into the awaiting wormhole that leads to the vast star ocean. And so, Edge and his crew begin their voyage in search of a new haven for humanity...and a second chance. [Square Enix]… Expand"}, {"name": "Bad North", "details_link": "https://www.metacritic.com/game/pc/bad-north", "publisher": "Raw Fury", "release_date": "Aug 28 2018", "developers": ["Plausible Concept"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "General"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/79212a32a516cb5efcc3203766baf8a4-98.jpg", "descriptions": "Bad North is a charming but brutal real-time tactics roguelite. Defend your idyllic island kingdom against a horde of Viking invaders, as you lead the desperate exodus of your people. Command your loyal subjects to take full tactical advantage of the unique shape of each island.EverythingBad North is a charming but brutal real-time tactics roguelite. Defend your idyllic island kingdom against a horde of Viking invaders, as you lead the desperate exodus of your people. Command your loyal subjects to take full tactical advantage of the unique shape of each island.Everything is at stake: fail, and watch the blood of your subjects stain the ground red.… Expand"}, {"name": "Immortal Redneck", "details_link": "https://www.metacritic.com/game/switch/immortal-redneck", "publisher": "Crema Games", "release_date": "May 10 2018", "developers": ["Crema Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/6b460a89bb14fd354e45f1490a3b29fe-98.jpg", "descriptions": "Immortal Redneck mixes old-school first-person shooter action with rogue-lite mechanics. Frantic gameplay, twitch controls and an arcade-style feel meet randomly generated dungeons, a complete skill tree, permanent death and nine classes with different traits."}, {"name": "Marble Saga: Kororinpa", "details_link": "https://www.metacritic.com/game/wii/marble-saga-kororinpa", "publisher": "Konami", "release_date": "Mar 17 2009", "developers": ["Hudson Entertainment"], "platforms": "Wii", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/0d435ba0e7cd4686920008f5238276af-98.jpg", "descriptions": "(Also known as \"Marbles! Balance Challenge\")  Get ready for the next adventure into the world of Kororinpa! Marble Saga: Kororinpa sets you on a journey to help Anthony the Ant on his quest to find the Golden Sunflower. Only by navigating your customized marble through unique and treacherous(Also known as \"Marbles! Balance Challenge\")  Get ready for the next adventure into the world of Kororinpa! Marble Saga: Kororinpa sets you on a journey to help Anthony the Ant on his quest to find the Golden Sunflower. Only by navigating your customized marble through unique and treacherous mazes can you help Anthony reach his goal! It's up to you to balance the world (literally) with fun and intuitive controls available only on Wii. Marble Saga: Kororinpa  is the follow-up to the original Kororinpa: Marble Mania for Wii. Utilizing the same world-turning technique as the first, you'll have to twist and turn the Wii Remote to control the environments around you. As you journey across 7 different worlds, you'll come across different gadgets to help you through your journey. Every one of the 150+ levels features fun challenges to conquer as you help Anthony roll his way to the Golden Sunflower. New features for Marble Saga: Kororinpa include increased customization elements in the game. Design your own marble to navigate more dangerous levels by assigning it certain attributes and techniques. If you really want to get into the game, use your own Mii to put yourself into the marble! Marble Saga: Kororinpa even features a brand-new level editor which lets you create your own unique stages. Through Wii Connect 24, you can share your masterpiece with friends and let them take on your own devious designs. [Hudson Entertainment]… Expand"}, {"name": "Just Cause 3", "details_link": "https://www.metacritic.com/game/pc/just-cause-3", "publisher": "Square Enix", "release_date": "Nov 30 2015", "developers": ["Avalanche Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Action Adventure", "Open-World"], "meta_score": 74, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/d4aaca242343c92db284d7039112f788-98.jpg", "descriptions": "Set in the bucolic Mediterranean island republic of Medici, a land crumbling under the brutal rule of General Di Ravello, you assume control of franchise's hero Rico Rodriguez, a man on a mission to liberate his homeland and the people of Medici...by any means necessary. With over fourSet in the bucolic Mediterranean island republic of Medici, a land crumbling under the brutal rule of General Di Ravello, you assume control of franchise's hero Rico Rodriguez, a man on a mission to liberate his homeland and the people of Medici...by any means necessary. With over four hundred square miles of utter freedom from sky to seabed and a massive arsenal of weaponry, gadgets and vehicles, prepare to unleash chaos in the most creative and explosive ways you can dream up.… Expand"}, {"name": "Dance Central Spotlight", "details_link": "https://www.metacritic.com/game/xbox-one/dance-central-spotlight", "publisher": "Microsoft Game Studios", "release_date": "Sep  2 2014", "developers": ["Harmonix Music Systems"], "platforms": "Xbox One", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/521b9289c56da31c93250e5a5d21020e-98.jpg", "descriptions": "Dance Central Spotlight is a rhythm-and-dance simulation game in which players perform dance steps by following the movements of on-screen characters."}, {"name": "Smash Court Tennis Pro Tournament 2", "details_link": "https://www.metacritic.com/game/playstation-2/smash-court-tennis-pro-tournament-2", "publisher": "Namco", "release_date": "Jun  8 2004", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 74, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/d1489348b3bd30c0f2aa8de1976199bf-98.jpg", "descriptions": "Incorporating six game modes, Smash Court Tennis Pro Tournament 2 offers center court action for novices and experts alike. Players can create their own character in Pro Tour Mode and work their way up through the ranking system by winning major tournament trophies and collecting points. InIncorporating six game modes, Smash Court Tennis Pro Tournament 2 offers center court action for novices and experts alike. Players can create their own character in Pro Tour Mode and work their way up through the ranking system by winning major tournament trophies and collecting points. In Arcade Mode, players advance through three difficulty levels as they compete in the Grand Slam tournaments. Exhibition Mode allows players to select their desired playing conditions (number of games, sets, difficulty level, characters, venues) to play a singles game or team up with up to three other players for a doubles match using a Multitap for PlayStation2. In Challenge Mode, players must complete several mini-games to unlock more challenging stages. Players can alter the camera angles in Spectator Mode to become a spectator and watch CPU players going head-to-head. For newcomers to the Smash Court series, the Tutorial Mode provides a step-by-step tutorial session, while novices can learn to use the variety of shots and serves including topspin backhands, half-volley drop shots, lobs, smashes and pinpoint passing shots. [Namco]… Expand"}, {"name": "Neversong", "details_link": "https://www.metacritic.com/game/pc/neversong", "publisher": "Serenity Forge", "release_date": "May 20 2020", "developers": ["Serenity Forge", "Thomas Brush"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/626b7525167c39b737edd142b471f834-98.jpg", "descriptions": "Once upon a time there was a little boy named Peet who slept peacefully in a coma. When he opened his eyes, he found himself in a nightmare."}, {"name": "Masters of Anima", "details_link": "https://www.metacritic.com/game/playstation-4/masters-of-anima", "publisher": "Focus Home Interactive", "release_date": "Apr 10 2018", "developers": ["Passtech Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 74, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/b29c538890423cea9559e1bf34f68887-98.jpg", "descriptions": "Immerse yourself in an original adventure and defy the forces of evil in strategic, action-packed battles. Summon and assume control of control grand armies of up to a thousand Guardians thanks to intuitive and innovative gameplay and make quick tactical decisions to prevail."}, {"name": "Frobisher Says!", "details_link": "https://www.metacritic.com/game/playstation-vita/frobisher-says!", "publisher": "SCEA", "release_date": "Oct 23 2012", "developers": ["Honeyslug Ltd"], "platforms": "PlayStation Vita", "genres": ["Miscellaneous", "General", "General"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/e5bb3e328f6f43ac3c7cdefe6ce4f93a-98.jpg", "descriptions": "Join the party and discover all that PS Vita has to offer.\r-Enter Frobisher's colourful world and prepare to face one of the weirdest, funniest and most addictive gaming experiences around. \r-Try out the full range of the PS Vita system's features in a series of fast-paced mini-games.Join the party and discover all that PS Vita has to offer.\r-Enter Frobisher's colourful world and prepare to face one of the weirdest, funniest and most addictive gaming experiences around. \r-Try out the full range of the PS Vita system's features in a series of fast-paced mini-games.\r-Poke otters with sticks, deliver puddings, draw on eggs or smile at ladies as you respond to Frobisher's commands.\r-Pass the PS Vita system around up to seven of your friends for hilarious multiplayer sessions.… Expand"}, {"name": "Monster Sanctuary", "details_link": "https://www.metacritic.com/game/switch/monster-sanctuary", "publisher": "Team17", "release_date": "Dec  8 2020", "developers": ["Moi Rai Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/86b6a32091ec60dfa29fcc5e2e23ef25-98.jpg", "descriptions": "Embark on an epic adventure using the powers of the monsters you collect, and the team you build, to unlock an ever-expanding world. On your quest to become the ultimate Monster Keeper you’ll unravel the cause of a mystery that threatens the peace between humans and monsters."}, {"name": "Superliminal", "details_link": "https://www.metacritic.com/game/pc/superliminal", "publisher": "Pillow Castle Games", "release_date": "Nov 12 2019", "developers": ["Pillow Castle Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/271fa4195f855354205e6896b30ca103-98.jpg", "descriptions": "Perception is reality. In this mind-bending first-person puzzler, you explore a surreal dream world and solve impossible puzzles using the ambiguity of depth and perspective."}, {"name": "Super Mutant Alien Assault", "details_link": "https://www.metacritic.com/game/switch/super-mutant-alien-assault", "publisher": "Fellow Traveller", "release_date": "Jul 12 2019", "developers": ["Cybernate"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/5e173b743aa28d8ef2e5f11b9b72fcd1-98.jpg", "descriptions": "Three fleets of spaceships flee a doomed Earth carrying the last humans in cryostasis. Pursued by aliens, its up the lowly security droids to save humanity. Taking up arms solo or with a friend, you must dance with death in a brutal and addictive arcade platformer shooter inspired by SuperThree fleets of spaceships flee a doomed Earth carrying the last humans in cryostasis. Pursued by aliens, its up the lowly security droids to save humanity. Taking up arms solo or with a friend, you must dance with death in a brutal and addictive arcade platformer shooter inspired by Super Crate Box and stuffed to the brim with unlockables.\r Fight through rapid fire single screen levels each with a random combination of platform layout, objective, vending machines and enemies. Dodge and weave amongst the aliens to stay alive but dont leave them standing too long or the ships radiation will mutate them into bigger, nastier versions.\r Only by unlocking and mastering the wild variety of weapons, explosives, special abilities, defense moves and perks can you hope to survive across all three galaxies, rid your ship of the mutant menace and get back to that nice boring life you had before this nightmare.… Expand"}, {"name": "Devil May Cry", "details_link": "https://www.metacritic.com/game/switch/devil-may-cry", "publisher": "Capcom", "release_date": "Jun 24 2019", "developers": ["Capcom"], "platforms": ["PlayStation 2", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/7b2566b89a8d69eaaa55441dc9d08ca3-98.jpg", "descriptions": "Legends tell of a demon swordsman named Sparda, who awoke to justice and rebelled against the devil, waging a one-man support of the human world. Now, 2,000 years later, a dark figure named Dante--private investigator of the supernatural--finds clues that the devil is rallying to rise upLegends tell of a demon swordsman named Sparda, who awoke to justice and rebelled against the devil, waging a one-man support of the human world. Now, 2,000 years later, a dark figure named Dante--private investigator of the supernatural--finds clues that the devil is rallying to rise up again against mankind. By Dante's demon blood, you enter this dark realm of demonic marionettes, unearthly phantoms, grim reapers, and other retched souls. Transform to a demon state to inflict devastating attacks on enemies in this gothic battle of good against evil.… Expand"}, {"name": "Moonlighter", "details_link": "https://www.metacritic.com/game/pc/moonlighter", "publisher": "11 bit studios", "release_date": "May 29 2018", "developers": ["11 bit studios", "Digital Sun"], "platforms": ["iPhone/iPad", "PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/d79cf2e83e6945675b7b6a647d1a0a2d-98.jpg", "descriptions": "Moonlighter is an Action RPG with rogue-lite elements that demonstrates two sides of the coin – revealing everyday routines of Will, an adventurous shopkeeper that secretly dreams of becoming a hero."}, {"name": "Jacob Jones and the Bigfoot Mystery: Episode One - A Bump in the Night", "details_link": "https://www.metacritic.com/game/playstation-vita/jacob-jones-and-the-bigfoot-mystery-episode-one---a-bump-in-the-night", "publisher": "SCEA", "release_date": "May 14 2013", "developers": ["Lucid Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/68fb4b5477835f3bea5be7b660bb8996-98.jpg", "descriptions": "Something strange is going on at Camp Eagle Feather. Campfire stories tell of strange creatures in the woods, and why are the camp counsellors fattening up all of the kids? Only Jacob Jones and his mythical companion can solve the mystery.\r Jacob Jones and the Bigfoot Mystery is aSomething strange is going on at Camp Eagle Feather. Campfire stories tell of strange creatures in the woods, and why are the camp counsellors fattening up all of the kids? Only Jacob Jones and his mythical companion can solve the mystery.\r Jacob Jones and the Bigfoot Mystery is a beautifully realised episodic 3D puzzle adventure game designed specifically for mobile and touchscreen devices.… Expand"}, {"name": "Naruto: Clash of Ninja 2", "details_link": "https://www.metacritic.com/game/gamecube/naruto-clash-of-ninja-2", "publisher": "D3", "release_date": "Sep 26 2006", "developers": ["8ing/Raizing"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 74, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/9830f16262da4175382241b14d98c8a1-98.jpg", "descriptions": "The hit series on Cartoon Network is back for more on Nintendo GameCube! NARUTO: Clash of Ninja 2 delivers non-stop ninja style combat action for 1-4 players where gamers choose to play as one of 23 playable characters. Naruto, Sasuke, Sakura and the other ninja-in training are going beyondThe hit series on Cartoon Network is back for more on Nintendo GameCube! NARUTO: Clash of Ninja 2 delivers non-stop ninja style combat action for 1-4 players where gamers choose to play as one of 23 playable characters. Naruto, Sasuke, Sakura and the other ninja-in training are going beyond the classroom now and must face each other and challenging new opponents in multi-ninja battles. All-new multi-player modes will engage players in frantic simultaneous four player battles and single-player modes will offer more gameplay choices than before with survival and timed attack modes that allow players to showcase their taijutsu and special jutsu abilities. When you're a ninja, you must be prepared for anything! Believe it!… Expand"}, {"name": "MX vs. ATV Reflex", "details_link": "https://www.metacritic.com/game/playstation-3/mx-vs-atv-reflex", "publisher": "THQ", "release_date": "Dec  1 2009", "developers": ["Rainbow Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/264d0c627539b4f27581cafeabb5fc72-98.jpg", "descriptions": "MX vs. ATV Reflex marks the return of the off-road racing franchise and features the all-new Rhythm Racing 2.0 physics engine, Rider Reflex control system and real-time terrain deformation. The Rider Reflex control system provides unparalleled precision and fluidity by separating machineMX vs. ATV Reflex marks the return of the off-road racing franchise and features the all-new Rhythm Racing 2.0 physics engine, Rider Reflex control system and real-time terrain deformation. The Rider Reflex control system provides unparalleled precision and fluidity by separating machine steering from body positioning, which allows the independently controlled rider to shift his weight, perform death-defying stunts and avoid potentially devastating wrecks.  Unprecedented terrain deformation creates ever-changing courses as off-road vehicles carve lines and deep ruts that have a real-time impact on gameplay and remain persistent through the full length of each race. [THQ]… Expand"}, {"name": "Song of Horror", "details_link": "https://www.metacritic.com/game/pc/song-of-horror", "publisher": "Raiser Games", "release_date": "Oct 31 2019", "developers": ["Protocol Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/6846c09c375c3eeb6f23bbffdf641171-98.jpg", "descriptions": "Song of Horror is a survival horror adventure. Face the manifestations of the Presence, an unpredictable, eldritch AI that reacts to your way of playing: you won't experience two exact gameplays."}, {"name": "American Civil War: Take Command - Second Manassas", "details_link": "https://www.metacritic.com/game/pc/american-civil-war-take-command---second-manassas", "publisher": "Paradox Interactive", "release_date": "Apr 26 2006", "developers": ["MadMinute Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Wargame", "Real-Time", "General"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/ae9beb26c6aa477b2ea0ffdbe162eab1-98.jpg", "descriptions": "Take Command: 2nd Manassas is \"the most detailed Civil War game to date,\" according to Paradox Interactive, presenting nearly 50 scenarios with historically accurate maps, leaders and regiments as well as authentic flags that separate the different states. Play any leader on any battlefieldTake Command: 2nd Manassas is \"the most detailed Civil War game to date,\" according to Paradox Interactive, presenting nearly 50 scenarios with historically accurate maps, leaders and regiments as well as authentic flags that separate the different states. Play any leader on any battlefield of the 2nd Manassas campaign. You can play all main battles from both fronts with as much or as little detail as you like. Command combat from a third-person view, with full military control over your troops. Just like those who fought in the American Civil War, you will face difficulties in communication, uncertainty over enemy positions and numerous other factors affecting the outcome of each battle. What’s more, the scenarios are linked, meaning that the outcome of one battle will affect the next. In the end, there can only be one victor; you decide the outcome. [Paradox Interactive]… Expand"}, {"name": "Kingdom", "details_link": "https://www.metacritic.com/game/pc/kingdom", "publisher": "Thomas van den Berg", "release_date": "Oct 21 2015", "developers": ["Thomas van den Berg"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/027bc5c4ca9486ea5c94e2dd8e41e578-98.jpg", "descriptions": "Kingdom is a 2D sidescrolling strategy/resource management hybrid with a minimalist feel wrapped in a beautiful, modern pixel art aesthetic."}, {"name": "Dead Rising 2: Case West", "details_link": "https://www.metacritic.com/game/xbox-360/dead-rising-2-case-west", "publisher": "Capcom", "release_date": "Dec 27 2010", "developers": ["Blue Castle Games"], "platforms": "Xbox 360", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/6c5514a19ef05aa211651e8e75762907-98.jpg", "descriptions": "With all new content, new combo weapons to create, new enemies to test them on and the return of the ability to capture those magic moments on camera, Dead Rising 2: CASE WEST continues the Dead Rising 2 experience in both single and co-op play."}, {"name": "Onimusha: Warlords", "details_link": "https://www.metacritic.com/game/xbox-one/onimusha-warlords", "publisher": "Capcom", "release_date": "Jan 15 2019", "developers": ["Capcom", "NeoBards Entertainment"], "platforms": ["PC", "PlayStation 2", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/5924bfe9cc2051cd2582de6edc5145a5-98.jpg", "descriptions": "As power-hungry warlords battle one another for control of feudal Japan, a young princess is kidnapped. Now, one lone swordsman, Samanosuke, boldly volunteers to rescue and avenge her. An entire legion of demon warriors stands between you and the princess, so you'll need all your weapons andAs power-hungry warlords battle one another for control of feudal Japan, a young princess is kidnapped. Now, one lone swordsman, Samanosuke, boldly volunteers to rescue and avenge her. An entire legion of demon warriors stands between you and the princess, so you'll need all your weapons and magic to break through. The world of Onimusha: Warlords comes alive with waterfalls, wind effects, insects, and weather, but in order to triumph, you must stay focused on your mission.… Expand"}, {"name": "Tom Clancy's Rainbow Six Siege", "details_link": "https://www.metacritic.com/game/xbox-one/tom-clancys-rainbow-six-siege", "publisher": "Ubisoft", "release_date": "Dec  1 2015", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox Series X", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Modern", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/de028b49ef6cc77bd7f7bfa29921002f-98.jpg", "descriptions": "Tom Clancy’s Rainbow Six Siege is inspired by real world counter-terrorist organizations, and inserts players in the middle of lethal close-quarters engagements. For the first time in a Tom Clancy’s Rainbow Six game, players can choose from a variety of unique Counter Terrorist Operators andTom Clancy’s Rainbow Six Siege is inspired by real world counter-terrorist organizations, and inserts players in the middle of lethal close-quarters engagements. For the first time in a Tom Clancy’s Rainbow Six game, players can choose from a variety of unique Counter Terrorist Operators and engage in tangible sieges, a new style of assault in which enemies have the means to transform their environments into modern strongholds while Rainbow Six teams lead the assault to breach the enemy’s position.… Expand"}, {"name": "Super Monkey Ball: Banana Blitz", "details_link": "https://www.metacritic.com/game/wii/super-monkey-ball-banana-blitz", "publisher": "Sega", "release_date": "Nov 14 2006", "developers": ["Sega"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 74, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/230645382bd3e4a2e177085f4829b29a-98.jpg", "descriptions": "The single-player puzzle levels in Super Monkey Ball: Banana Blitz have been designed to challenge gamers' skills like never before. For the first time in the Super Monkey Ball franchise, AiAi and his friends have the ability to jump when players flick the Nintendo Wii controller in anThe single-player puzzle levels in Super Monkey Ball: Banana Blitz have been designed to challenge gamers' skills like never before. For the first time in the Super Monkey Ball franchise, AiAi and his friends have the ability to jump when players flick the Nintendo Wii controller in an upward motion. The ability to jump has given game designers another dimension in which to expand the Super Monkey Ball gameplay experience and allows gamers a whole new way to interact with the franchise; this time in true three-dimensional fashion. The Party Games return with more variety than ever. An abundance of new Party Games have been designed to take advantage of the Wii controller in a multitude of ways. Gamers find themselves competing in a traditional game of ring toss, or even smacking pesky moles in a game of \"Whack-a-Mole.\" [Sega]… Expand"}, {"name": "void tRrLM(); //Void Terrarium", "details_link": "https://www.metacritic.com/game/switch/void-trrlm()-void-terrarium", "publisher": "NIS America", "release_date": "Jul 14 2020", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/f60fce49e1482fe1fd9841b2aaee6c32-98.jpg", "descriptions": "In a world contaminated with toxic fungi, a discarded maintenance robot finds a girl named Toriko on the brink of death among the discarded junk in a scrapyard. To reinforce the terrarium as well as Toriko’s poor health, the lone robot must venture into the wasteland to gather resourcesIn a world contaminated with toxic fungi, a discarded maintenance robot finds a girl named Toriko on the brink of death among the discarded junk in a scrapyard. To reinforce the terrarium as well as Toriko’s poor health, the lone robot must venture into the wasteland to gather resources while battling the vagrant machines and mutated creatures that roam there. From the creator of A Rose in the Twilight and htoL#NiQ: The Firefly Diary, this harrowing roguelike adventure combines cute visuals with a somber yet whimsical post-apocalyptic story. Install various equipment, skills, Knacks, and parts you find on your expeditions to improve your ability to explore the wasteland and fight enemies, while preventing threats to Toriko’s health. Choose your loadout wisely as you fight through procedurally generated levels in turn-based combat. No two adventures are alike when braving the toxic wastes.\r… Expand"}, {"name": "Alder's Blood", "details_link": "https://www.metacritic.com/game/switch/alders-blood", "publisher": "No Gravity Games", "release_date": "Mar 13 2020", "developers": ["Shockwork Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/2cf835d045540d06361c637a0325bfaa-98.jpg", "descriptions": "Alder's Blood is a stealth, tactical turn-based game set in a grim world, where nature stood against humanity and repelled the civilization. Use a wide variety of weapons, stay in shadows and prepare deadly traps to survive in combat."}, {"name": "Age of Booty", "details_link": "https://www.metacritic.com/game/playstation-3/age-of-booty", "publisher": "Capcom", "release_date": "Oct 16 2008", "developers": ["Certain Affinity"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "8  Online", "genres": ["Strategy", "Miscellaneous", "Real-Time", "Party", "Fantasy", "General", "Fantasy"], "meta_score": 74, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/4641a0106bfa7e764c3d11073c1bf7ea-98.jpg", "descriptions": "[Playstation Network]  Set in the swashbuckling era, Age of Booty is a casual real-time multiplayer strategy game that puts players at the helm of their own pirate ship with the goal of sending your enemies to the briny deep, and looting and capturing towns for your pirate faction. In Age of[Playstation Network]  Set in the swashbuckling era, Age of Booty is a casual real-time multiplayer strategy game that puts players at the helm of their own pirate ship with the goal of sending your enemies to the briny deep, and looting and capturing towns for your pirate faction. In Age of Booty, players team up with other online players or AI-controlled pirate ships to raid, pillage, sink, and destroy their way to dominance on the high seas. Spoils of war and booty are used to upgrade and customize pirate ships to make them even more deadly as players take on 25 unique challenges and seven of the most devious Pirate Alliances on the high seas. Gain notoriety and fame by climbing the online leader boards. Create and share custom maps using the intuitive map creation system. Single player and multiplayer real-time action strategy from Certain Affinity, lead by Max Hoberman, designer of Halo 2 and 3's multiplayer game. Raid villages, sink merchants, seize towns, steal gold, upgrade your pirate ship and use your guns and your wits to send your foes to the briny deep. Master twenty-five unique multiplayer maps or create your own and share them with your friends. Up to four players on one console, up to eight players over LAN or the Internet. Tons of customizable options that allow you to tune the game to meet your taste. [Capcom]… Expand"}, {"name": "Blackguards 2", "details_link": "https://www.metacritic.com/game/pc/blackguards-2", "publisher": "Daedalic Entertainment", "release_date": "Jan 20 2015", "developers": ["Daedalic Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Tactics"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/fef449c60c9b300759a5c3190b56fe5c-98.jpg", "descriptions": "Blackguards 2 ia an SRPG focusing on turn-based, strategic battles with a group of scoundrels as anti-heroes."}, {"name": "Insurgency", "details_link": "https://www.metacritic.com/game/pc/insurgency", "publisher": "New World Interactive", "release_date": "Mar  1 2013", "developers": ["New World Interactive"], "platforms": "PC", "genres": ["Shooter", "Modern", "Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 74, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/ecabb4a32648cebc96cc80c30d77012c-98.jpg", "descriptions": "Take to the streets for intense close quarters combat, where a team's survival depends upon securing crucial strongholds and destroying enemy supply in this multiplayer and cooperative Source Engine based experience. The follow-up game to the award-winning Source mod, Insurgency is highlyTake to the streets for intense close quarters combat, where a team's survival depends upon securing crucial strongholds and destroying enemy supply in this multiplayer and cooperative Source Engine based experience. The follow-up game to the award-winning Source mod, Insurgency is highly competitive and unforgivingly lethal, striking a balance between one-life gameplay and prolonged action.… Expand"}, {"name": "Madden NFL 25", "details_link": "https://www.metacritic.com/game/playstation-4/madden-nfl-25", "publisher": "Electronic Arts", "release_date": "Nov 12 2013", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade", "Sim"], "meta_score": 74, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/39657eb1f8c10b6c1e0f8bd2b05d5991-98.jpg", "descriptions": "See every nuance of a player’s face, equipment, and clothing as the line blurs between the players in the game and their real-life counterparts. Up to 4x the texture resolution breathes new life into stadiums, crowds, the field, and even the ball itself. Combined with high-fidelitySee every nuance of a player’s face, equipment, and clothing as the line blurs between the players in the game and their real-life counterparts. Up to 4x the texture resolution breathes new life into stadiums, crowds, the field, and even the ball itself. Combined with high-fidelity animations that deliver smooth, authentic-looking player interactions, Madden NFL 25 promises to deliver Next Definition visuals.\r All-new Player Sense unlocks the human element in Madden NFL. For the first time, players scan the field, anticipate situations before they happen, and maneuver with instincts and awareness. The ability to make up to 50x as many contextual calculations brings intelligent ballcarriers and defenders to life, as they sense obstacles and react on the fly. Ballcarriers leap over fallen players, blitzing linebackers slide past teammates on their way to the QB, and so much more, combining the physical aspects of football with the mental.\r… Expand"}, {"name": "Disgaea D2: A Brighter Darkness", "details_link": "https://www.metacritic.com/game/playstation-3/disgaea-d2-a-brighter-darkness", "publisher": "NIS America", "release_date": "Oct  8 2013", "developers": ["Nippon Ichi Software"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/44a0a3757c7cd88b9f5bbc59f16ed094-98.jpg", "descriptions": "The Netherworld - a place where might makes right and today's friends are tomorrow's enemies. After a long journey with many ups and downs, Laharl finally finds himself as a full-fledged Overlord. However, the other denizens of the Netherworld do not see him as such, so he sets out on aThe Netherworld - a place where might makes right and today's friends are tomorrow's enemies. After a long journey with many ups and downs, Laharl finally finds himself as a full-fledged Overlord. However, the other denizens of the Netherworld do not see him as such, so he sets out on a journey with his loyal(!?) vassals to receive the respect he deserves. Along the way, Laharlwill meet a girl who claims to be his sister, demons with bigger than usual chips on their shoulders, and find out that even his own body holds a few surprises for him...… Expand"}, {"name": "DARQ: Complete Edition", "details_link": "https://www.metacritic.com/game/playstation-5/darq-complete-edition", "publisher": "Bloober Team", "release_date": "Mar 25 2021", "developers": ["Unfold Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Linear"], "meta_score": 74, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/a10e14f911d09b57e1c5721beda54671-98.jpg", "descriptions": "DARQ tells the story of Lloyd, a boy who becomes aware of the fact that he is dreaming. To Lloyd's misfortune, the dream quickly turns into a nightmare and all attempts to wake up end in failure. While exploring the darkest corners of his subconscious, Lloyd learns how to survive theDARQ tells the story of Lloyd, a boy who becomes aware of the fact that he is dreaming. To Lloyd's misfortune, the dream quickly turns into a nightmare and all attempts to wake up end in failure. While exploring the darkest corners of his subconscious, Lloyd learns how to survive the nightmare by bending the laws of physics and manipulating the fluid fabric of the dream world.… Expand"}, {"name": "Monster Energy Supercross - The Official Videogame 3", "details_link": "https://www.metacritic.com/game/xbox-one/monster-energy-supercross---the-official-videogame-3", "publisher": "Milestone S.r.l", "release_date": "Feb  4 2020", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 74, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/c8b3e8f8ca4c2b615370fc046097a0a8-98.jpg", "descriptions": "Monster Energy Supercross 3 is more Multiplayer than ever. Enjoy a new multiplayer experience with the dedicated servers and discover the Race Director mode."}, {"name": "Omensight", "details_link": "https://www.metacritic.com/game/playstation-4/omensight", "publisher": "Spearhead Games", "release_date": "May 15 2018", "developers": ["Spearhead Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/e355b89eb4b0548797da688db47b7d56-98.jpg", "descriptions": "Omensight is an action murder mystery. You are the Harbinger, a powerful mystical warrior. You have witnessed the destruction of the world. In order to prevent annihilation you are destined to repeat that fateful day and solve the murder of the Godless-Priestess, whose death precipitated theOmensight is an action murder mystery. You are the Harbinger, a powerful mystical warrior. You have witnessed the destruction of the world. In order to prevent annihilation you are destined to repeat that fateful day and solve the murder of the Godless-Priestess, whose death precipitated the apocalypse.… Expand"}, {"name": "Paper Monsters Recut", "details_link": "https://www.metacritic.com/game/wii-u/paper-monsters-recut", "publisher": "Mobot Studios LLC", "release_date": "Oct 16 2014", "developers": ["Mobot Studios LLC"], "platforms": ["iPhone/iPad", "PC", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/873844b91d252cad30c7f760835cd7d4-98.jpg", "descriptions": "Welcome to Paperland!\r Dive into the world of Paper Monsters Recut and watch a living world made out of paper, cardboard, and even a few cotton balls unfold right before your eyes.\r\n\r\nPaper Monsters Recut mixes classic 2D platformer gameplay with gorgeous 3D graphics and brings it to lifeWelcome to Paperland!\r Dive into the world of Paper Monsters Recut and watch a living world made out of paper, cardboard, and even a few cotton balls unfold right before your eyes.\r Paper Monsters Recut mixes classic 2D platformer gameplay with gorgeous 3D graphics and brings it to life in a brand new title for Wii U.\r --FEATURES--\r-Classic 2D platformer gameplay with gorgeous 3d environments.\r-An adorable cast of fun, original characters.\r-Tight responsive controls, with super-speed and double jump!\r-Old school-style playable overworld, with plenty levels and secrets to unlock along the way.\r-Tons of awesome power ups including jetpacks, submarines, lasers and more!\r-Collect special treasures to unlock bonus high score mini games.\r-Awesome original soundtrack.\r-Wii U GamePad special features and support, including Off-TV Play!\r-Fun for gamers of any age.… Expand"}, {"name": "Fat Princess: Fistful of Cake", "details_link": "https://www.metacritic.com/game/psp/fat-princess-fistful-of-cake", "publisher": "SCEA", "release_date": "May  4 2010", "developers": ["SuperVillain Studios"], "platforms": ["PlayStation 3", "PSP"], "num_players": "Up to 8 ", "genres": ["Action", "Strategy", "General", "Real-Time", "General"], "meta_score": 74, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/8d1a5c0691884cdd9e9b94b6cb3eb8bd-98.jpg", "descriptions": "Rescue your beloved princess through teamwork in this comic medieval battle royale. There's a catch, though - the other team has been feeding her magical cake, making her harder to escort back to your castle."}, {"name": "Need for Speed Heat", "details_link": "https://www.metacritic.com/game/xbox-one/need-for-speed-heat", "publisher": "Electronic Arts", "release_date": "Nov  8 2019", "developers": ["Ghost Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 74, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/9940ea737dcd6acca3d386251e5df2b6-98.jpg", "descriptions": "Hustle by day and risk it all at night in Need for Speed Heat, a white-knuckle racer that pits you against a city's rogue police force as you battle your way into street racing's elite. By day compete in the Speedhunter Showdown -- a sanctioned competition where you earn bank to customizeHustle by day and risk it all at night in Need for Speed Heat, a white-knuckle racer that pits you against a city's rogue police force as you battle your way into street racing's elite. By day compete in the Speedhunter Showdown -- a sanctioned competition where you earn bank to customize and upgrade your garage of high-performance cars. When your ride's perfectly styled and hyper-tuned, and you're ready to ramp up the intensity, drive out into the night where you and your crew take on the competition in illicit street races that build your reputation and grant you access to bigger races and better parts. But under the cover of darkness patrols a rogue task force looking to bring you down and swipe all you've earned. Take them on and risk it all for underground glory or head back to your safehouse and begin another thrilling day. The roads, the risks, and the rides never end in this street racer where your crew rolls deep, your garage is full of hot cars, and the city's your nonstop playground.… Expand"}, {"name": "Resonance of Fate", "details_link": "https://www.metacritic.com/game/xbox-360/resonance-of-fate", "publisher": "Sega", "release_date": "Mar 16 2010", "developers": ["Tri-Ace"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/ca11566b09ebd7116b3c992a215ac599-98.jpg", "descriptions": "In Resonance of Fate, players control members of a private military contracting firm in a world where most of Earth has been rendered uninhabitable. The only remaining pockets of civilization surround the tower of Basel, an experimental air purifier with a mind of its own. The game carries aIn Resonance of Fate, players control members of a private military contracting firm in a world where most of Earth has been rendered uninhabitable. The only remaining pockets of civilization surround the tower of Basel, an experimental air purifier with a mind of its own. The game carries a steampunk aesthetic, with the ordinary RPG trappings of swords and sorcery traded in for guns and acrobatic attacks.… Expand"}, {"name": "Formula One Championship Edition", "details_link": "https://www.metacritic.com/game/playstation-3/formula-one-championship-edition", "publisher": "SCEA", "release_date": "Feb 27 2007", "developers": ["Studio Liverpool"], "platforms": "PlayStation 3", "num_players": "10  Online", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/c8a47f2215f7db59af87e6a8d4616f8a-98.jpg", "descriptions": "FORMULA ONE Chamionship Edition roars onto PS3 with all the official drivers, cars, circuits, rules and teams, including SCUDERIA TORRO ROSSO, SUPER AGURI F1 TEAM and MIDLAND F1 RACING in their debut year. Next Generation Experience – High definition visuals, full surround sound, extensiveFORMULA ONE Chamionship Edition roars onto PS3 with all the official drivers, cars, circuits, rules and teams, including SCUDERIA TORRO ROSSO, SUPER AGURI F1 TEAM and MIDLAND F1 RACING in their debut year. Next Generation Experience – High definition visuals, full surround sound, extensive circuit details and lighting effects, progressive dirt and car damage make for a realistic racing experience. Feel the buzz of the paddock and the excitement of race day with authentic pre-race car preparations. Warm up your tyres and get ready for the race with the parade lap. Experience the real pressure of a GRAND PRIX race thanks to unexpected collisions and race incidents. Introduction of the Safety Car – Choose the correct race strategy when the safety car is out: will you make an early pit stop to avoid being stuck in the traffic? Interconnectivity with PSP – Widen your playing field with interconnectivity applications with PSP. [Sony]… Expand"}, {"name": "Mighty Goose", "details_link": "https://www.metacritic.com/game/switch/mighty-goose", "publisher": "Playism", "release_date": "Jun  5 2021", "developers": ["Blastmode"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/c7bac799be14fc55e0f730f39f7a6915-98.jpg", "descriptions": "Mighty Goose is a fast paced run & gun shooter starring a bounty hunter Goose. Use epic weapons and devastating war machines to battle against screen filling bosses and hordes of enemies!"}, {"name": "GRIP: Combat Racing", "details_link": "https://www.metacritic.com/game/pc/grip-combat-racing", "publisher": "Caged Element Inc.", "release_date": "Nov  6 2018", "developers": ["Caged Element Inc."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/df79857ca7593b725e0ab744ef13ae83-98.jpg", "descriptions": "GRIP is a futuristic combat racer inspired by the Rollcage games from 1999/2000. Combine furious speed with intense action to create memorable racing moments."}, {"name": "Inazuma Eleven", "details_link": "https://www.metacritic.com/game/ds/inazuma-eleven", "publisher": "Nintendo", "release_date": "Aug 26 2011", "developers": ["Level 5"], "platforms": ["3DS", "DS"], "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/a77831c3f2b807cb770f6db476754383-98.jpg", "descriptions": "Inazuma Eleven is a sports game for the Nintendo DS that combines football, RPG elements, strategy and plenty of action!"}, {"name": "Space Pirates and Zombies", "details_link": "https://www.metacritic.com/game/pc/space-pirates-and-zombies", "publisher": "MinMax Games Ltd.", "release_date": "Jun 19 2011", "developers": ["MinMax Games Ltd."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/2e22a5c3e58a25e54dd93d3c743cd9d4-98.jpg", "descriptions": "Space Pirates and Zombies takes place far enough in the future that Earth has become a toxic backwater planet, so potentially not that far in the future.  The galaxy has been colonized by humans, and the only means to travel to new star systems is through highly restricted and well defendedSpace Pirates and Zombies takes place far enough in the future that Earth has become a toxic backwater planet, so potentially not that far in the future.  The galaxy has been colonized by humans, and the only means to travel to new star systems is through highly restricted and well defended warp gates.  It is well known that systems closer to the galactic core become richer and richer as well as more scientifically advanced.  This has led to theories of a secret system with a cache of treasure or knowledge at the galactic core feeding this growth.  As a pirate, you must assemble a fleet and discover what treasure awaits you there. [Minmax Games]… Expand"}, {"name": "Runaway: A Road Adventure", "details_link": "https://www.metacritic.com/game/pc/runaway-a-road-adventure", "publisher": "Tri Synergy", "release_date": "Aug 28 2003", "developers": ["Pendulo Studios"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/539c7408474c6f489c14220febc4b41f-98.jpg", "descriptions": "New York...Without knowing how or why, Brian, a student on the verge of graduating from college, is attacked by Mafia gangsters. During his desperate getaway, in the company of a mysterious striptease dancer, he ends up meeting a wide range of unusual characters. But which ones are trying toNew York...Without knowing how or why, Brian, a student on the verge of graduating from college, is attacked by Mafia gangsters. During his desperate getaway, in the company of a mysterious striptease dancer, he ends up meeting a wide range of unusual characters. But which ones are trying to help him and which ones are planning to blow his head off? You will have to be very ingenious to figure it out, without forgetting that nobody is who they seem in this explosive mixture of murder, money, ambition, santeria rituals and deception...a whole lot of deception. [Tri Synergy]… Expand"}, {"name": "I Am Setsuna", "details_link": "https://www.metacritic.com/game/playstation-4/i-am-setsuna", "publisher": "Square Enix", "release_date": "Jul 19 2016", "developers": ["Tokyo RPG Factory"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/a64a5f365c5d7f3c9d0c1531973afb35-98.jpg", "descriptions": "Inspired by Chrono Trigger, I am Setsuna is an homage to the JRPG masterpieces of yesteryear. Journey with Setsuna as she prepares to make the ultimate sacrifice and save the people of her land."}, {"name": "Monster Energy Supercross - The Official Videogame 5", "details_link": "https://www.metacritic.com/game/playstation-5/monster-energy-supercross---the-official-videogame-5", "publisher": "Deep Silver", "release_date": "Mar 17 2022", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Arcade", "Automobile"], "meta_score": 74, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/3/fd2c8c5214904a5a271cbe7f41dfb1cf-98.jpg", "descriptions": "Enjoy all new customization possibilities with our enhanced Track Editor, and give a boost to your creativity! Mix and match pre-existing modules with the brand new Rhythm Section Editor, to design complex prefab track sections, ready to be shared with the Community. Creating amazing jumpsEnjoy all new customization possibilities with our enhanced Track Editor, and give a boost to your creativity! Mix and match pre-existing modules with the brand new Rhythm Section Editor, to design complex prefab track sections, ready to be shared with the Community. Creating amazing jumps has never been easier. Bring the challenge to a whole new level of fun with the new Split Screen Mode, for exciting Multiplayer challenges to race shoulder to shoulder with your friends on the couch! And when the couch is not enough, compete in exciting races online against the whole world. … Expand"}, {"name": "Ring of Pain", "details_link": "https://www.metacritic.com/game/pc/ring-of-pain", "publisher": "Twice Different", "release_date": "Oct 15 2020", "developers": ["Twice Different"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/1cb6b1b0ca87df95ab1b70c68d588b71-98.jpg", "descriptions": "Ring of Pain is a roguelike / card game / dungeon crawler mashup. Levels are generated randomly from decks of cards, and arranged in a format (like a ring) which lets you observe the level and strategise. As you interact with cards the dungeon dynamically adjusts based on what you're doing.Ring of Pain is a roguelike / card game / dungeon crawler mashup. Levels are generated randomly from decks of cards, and arranged in a format (like a ring) which lets you observe the level and strategise. As you interact with cards the dungeon dynamically adjusts based on what you're doing. Ring of Pain blends elements of modern roguelike/roguelite dungeon crawlers (Binding of Isaac, Enter the Gungeon etc) with a turn-based card game, set in a world distorted by your mind. A cryptic world of fear and delusion.… Expand"}, {"name": "A Hat in Time", "details_link": "https://www.metacritic.com/game/xbox-one/a-hat-in-time", "publisher": "Gears for Breakfast", "release_date": "Dec  6 2017", "developers": ["Gears for Breakfast"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/a3402f13b31b122a53135ed623105def-98.jpg", "descriptions": "A Hat in Time is a 3D collect-a-thon platformer featuring a little girl with a lot of heart! Travel the universe with Hat Kid as you rival the evil Mustache Girl in order to save the world! Unlock new platforming abilities, more combat moves and spice up your attacks with badges attached toA Hat in Time is a 3D collect-a-thon platformer featuring a little girl with a lot of heart! Travel the universe with Hat Kid as you rival the evil Mustache Girl in order to save the world! Unlock new platforming abilities, more combat moves and spice up your attacks with badges attached to your hat!… Expand"}, {"name": "Midway Arcade Treasures 2", "details_link": "https://www.metacritic.com/game/playstation-2/midway-arcade-treasures-2", "publisher": "Midway", "release_date": "Oct 11 2004", "developers": ["Backbone Entertainment"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/fcaf15b21fe25f0bff521ddd34af02e1-98.jpg", "descriptions": "Midway Arcade Treasures 2 includes more than 20 classic arcade games including: A.P.B., Arch Rivals, Championship Sprint, Cyberball 2072, Gauntlet 2, Hard Drivin', Mortal Kombat, Mortal Kombat II, Mortal Kombat III, NARC, Pit Fighter, Primal Rage, Rampage World Tour, Spy Hunter 2, SteelMidway Arcade Treasures 2 includes more than 20 classic arcade games including: A.P.B., Arch Rivals, Championship Sprint, Cyberball 2072, Gauntlet 2, Hard Drivin', Mortal Kombat, Mortal Kombat II, Mortal Kombat III, NARC, Pit Fighter, Primal Rage, Rampage World Tour, Spy Hunter 2, Steel Talons, STUN Runner, Timber, Total Carnage, Wizard of Wor, Xenophobe, and Xybots. [Midway]… Expand"}, {"name": "Legacy of Kain: Defiance", "details_link": "https://www.metacritic.com/game/xbox/legacy-of-kain-defiance", "publisher": "Eidos Interactive", "release_date": "Nov 11 2003", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/f966f3b75aa8b2ac98e2938f2f0fc87a-98.jpg", "descriptions": "Demons, death, and dark forces cloud the vampire world of Legacy of Kain: Defiance, and you must push through it.  In this episode of the Legacy of Kain series, you play as both Raziel, a demonic angel of death, and Kain, an all-powerful demigod.  Use telekinetic powers, thrilling comboDemons, death, and dark forces cloud the vampire world of Legacy of Kain: Defiance, and you must push through it.  In this episode of the Legacy of Kain series, you play as both Raziel, a demonic angel of death, and Kain, an all-powerful demigod.  Use telekinetic powers, thrilling combo moves, and legendary swords to fight your way through monsters and undead foes.  Replenish your energy by sucking the blood and devouring your enemies' souls.  Stop the forces that seek to condemn the world to eternal damnation.… Expand"}, {"name": "Magic Pengel: The Quest for Color", "details_link": "https://www.metacritic.com/game/playstation-2/magic-pengel-the-quest-for-color", "publisher": "Agetec Inc.", "release_date": "Jun 26 2003", "developers": ["Taito Corporation"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/5ee920aa6005767c7265d4776cec0bc8-98.jpg", "descriptions": "Take the adventure game role of a lifetime as a Doodler -- a special person capable of drawing your own cast of characters and watch them come alive as active 3D cast members in one of the most original games of all time. Your Doodles are granted awesome powers so you can compete in arenasTake the adventure game role of a lifetime as a Doodler -- a special person capable of drawing your own cast of characters and watch them come alive as active 3D cast members in one of the most original games of all time. Your Doodles are granted awesome powers so you can compete in arenas all across the realm. All the characters you draw become automatically animated as 3D interactive Doodles. As you progress in the adventure you'll earn new colors and parts for your Doodles! Your imagination is the only limit to the style or type of Doodle you create. Save up to 200 individual Doodles on one Memory Card (8MB). Battle it out against a friend in 2-Player Matches to see who can make the greatest Doodle of them all! [Agetec]… Expand"}, {"name": "EverQuest Online Adventures", "details_link": "https://www.metacritic.com/game/playstation-2/everquest-online-adventures", "publisher": "Sony Online Entertainment", "release_date": "Feb  9 2003", "developers": ["Sony Online Entertainment"], "platforms": "PlayStation 2", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Fantasy"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/acee0c3bfca2819d3ee5b5f5c11248d4-98.jpg", "descriptions": "EverQuest Online Adventures takes place during the Age of Adventure; a time set approximately five centuries before the original EverQuest for the PC. Return to a time in Norrath's past, when the city of Freeport was a new coalition of merchants and the elves have yet to abandon theirEverQuest Online Adventures takes place during the Age of Adventure; a time set approximately five centuries before the original EverQuest for the PC. Return to a time in Norrath's past, when the city of Freeport was a new coalition of merchants and the elves have yet to abandon their ancient homeland completely. As a console RPG, there is a focus on exciting combat, questing and character development. Combat is fast and tactically rich, with each monster posing a unique challenge for the player. The world is laden with compelling quests and intriguing subplots. Players enhance their characters by discovering items and unlocking secret abilities. [Sony]… Expand"}, {"name": "NCAA March Madness 2003", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-march-madness-2003", "publisher": "EA Sports", "release_date": "Nov 21 2002", "developers": ["NuFX"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/a9618a1b7224cf0a296a4d82ed9e21f2-98.jpg", "descriptions": "Do you dream of cutting down the net in New Orleans? Now you can experience the thrill of being the National Champ with NCAA March Madness 2003 -- the ultimate college basketball experience. From the crazed fans in the stands, to the mascots on the court and the fight songs played in theDo you dream of cutting down the net in New Orleans? Now you can experience the thrill of being the National Champ with NCAA March Madness 2003 -- the ultimate college basketball experience. From the crazed fans in the stands, to the mascots on the court and the fight songs played in the arenas, NCAA March Madness 2003 captures the spirit and excitement and rivalry that is college basketball. [EA Sports]… Expand"}, {"name": "Rocky", "details_link": "https://www.metacritic.com/game/playstation-2/rocky", "publisher": "Ubisoft", "release_date": "Nov 18 2002", "developers": ["Rage Software"], "platforms": ["iPhone/iPad", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/57ffcf001b98f6925e84185bac7da4d7-98.jpg", "descriptions": "Step into the ring as Rocky Balboa, to fight and train your way from unknown fighter to peoples' champion. To become the undisputed Heavyweight Champion of the World you must meet & defeat awesome adversaries including Apollo Creed, Clubber Lang, Ivan Drago and Tommy 'the Machine' Gunn. TheStep into the ring as Rocky Balboa, to fight and train your way from unknown fighter to peoples' champion. To become the undisputed Heavyweight Champion of the World you must meet & defeat awesome adversaries including Apollo Creed, Clubber Lang, Ivan Drago and Tommy 'the Machine' Gunn. The challenge is tough - you'll need inner strength, guts, grit and determination. [Rage Software]… Expand"}, {"name": "NBA Live 2001", "details_link": "https://www.metacritic.com/game/playstation-2/nba-live-2001", "publisher": "EA Sports", "release_date": "Jan 22 2001", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 74, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/ab0345b0e239671d969a39a654d59c1e-98.jpg", "descriptions": "The dominant hoops franchise returns live, delivering high-flyin', fast-paced NBA action plus a whole lot more. With all-new player reactions and bench sequences, redesigned commentary, and crowd animations, NBA Live 2001 comes alive, bringing more emotion and atmosphere to the court thanThe dominant hoops franchise returns live, delivering high-flyin', fast-paced NBA action plus a whole lot more. With all-new player reactions and bench sequences, redesigned commentary, and crowd animations, NBA Live 2001 comes alive, bringing more emotion and atmosphere to the court than ever before.  [EA Sports]… Expand"}, {"name": "Hotline Miami 2: Wrong Number", "details_link": "https://www.metacritic.com/game/pc/hotline-miami-2-wrong-number", "publisher": "Devolver Digital", "release_date": "Mar 10 2015", "developers": ["Dennaton"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Stadia", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/b5e88a3b181cdce7df1dffeeccb379cb-98.jpg", "descriptions": "A brutal conclusion to the gruesome saga, Hotline Miami 2: Wrong Number follows the escalating level of violence through multiple factions born from the events of the original game and driven by uncertain motivations. Step into the murderous mind of several distinct characters - each withA brutal conclusion to the gruesome saga, Hotline Miami 2: Wrong Number follows the escalating level of violence through multiple factions born from the events of the original game and driven by uncertain motivations. Step into the murderous mind of several distinct characters - each with their own motivations and methods of execution -- as storylines intersect and reality slips away into a haze of neon and carnage. Blistering combat, an unmistakable visual style, and a powerfully intense soundtrack will once again push you to the limit and questioning your own thirst for blood.… Expand"}, {"name": "Famicom Detective Club: The Girl Who Stands Behind", "details_link": "https://www.metacritic.com/game/switch/famicom-detective-club-the-girl-who-stands-behind", "publisher": "Nintendo", "release_date": "May 14 2021", "developers": ["Nintendo", "Mages."], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/94acf680666a3c0caec9ee7eb0f6dbe9-98.jpg", "descriptions": "Find the secret behind a grizzly rumor haunting a Japanese high school. Interrogate suspects and hunt for clues to piece together chilling conundrums plaguing a high school in Japan. Suspense (and a little bit of horror) ensues as you try to free students from their nightmare. Play at home,Find the secret behind a grizzly rumor haunting a Japanese high school. Interrogate suspects and hunt for clues to piece together chilling conundrums plaguing a high school in Japan. Suspense (and a little bit of horror) ensues as you try to free students from their nightmare. Play at home, on the go, or in your favorite reading nook—only on the Nintendo Switch system. Can you figure out who the culprit is...before it’s too late?\r Play Famicom Detective Club in English for the first time\r Originally released in Japan only, the Famicom Detective Club™: The Girl Who Stands Behind game has been localized with English text and modernized for the Nintendo Switch™ system. While the graphics, music, and sound effects have been recreated, players can also choose the original 8-bit soundtrack. Discover a piece of Nintendo history with the Famicom Detective Club series of games.\r Buy one Famicom Detective Club game, get the other at a discount\r Famicom Detective Club: The Girl Who Stands Behind is the second game in the series. The first game, Famicom Detective Club: The Missing Heir is also available on Nintendo eShop. If you purchase one of these games on Nintendo eShop, you can get $10 off the other when also purchased on Nintendo eShop*… Expand"}, {"name": "Harvest Moon 3D: A New Beginning", "details_link": "https://www.metacritic.com/game/3ds/harvest-moon-3d-a-new-beginning", "publisher": "Natsume", "release_date": "Nov  6 2012", "developers": ["Marvelous AQL"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Strategy", "Breeding/Constructing", "General", "Management", "Breeding/Constructing", "Business / Tycoon"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/c2d0dbdfd1eca127c66de330d5e85720-98.jpg", "descriptions": "Harvest Moon 3D: A New Beginning gives players a chance to rebuild the town of Echo Village to be the best community in the land."}, {"name": "Killer7", "details_link": "https://www.metacritic.com/game/gamecube/killer7", "publisher": "Capcom", "release_date": "Jul  7 2005", "developers": ["Grasshopper Manufacture"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 74, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/626ddc3432cc60b4511e7ad29721ce8f-98.jpg", "descriptions": "Killer 7 chronicles the connection between two men whose intertwined paths develop into a tale of revenge and altering personas. You play as not only one man but also as his seven other personalities in a mission to stop a wave of indiscriminate violence that's plaguing the world. Each ofKiller 7 chronicles the connection between two men whose intertwined paths develop into a tale of revenge and altering personas. You play as not only one man but also as his seven other personalities in a mission to stop a wave of indiscriminate violence that's plaguing the world. Each of your personalities has unique abilities--including invisibility, extra strength, superhearing, and more--that help you defeat the evil Kun Lan and his crazy soldiers.… Expand"}, {"name": "Warhammer 40,000: Space Marine", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-space-marine", "publisher": "THQ", "release_date": "Sep  5 2011", "developers": ["Relic", "Relic Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Action", "Role-Playing", "Action RPG", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/3436e1b775005b011b6882aa0440a9ef-98.jpg", "descriptions": "Warhammer 40,000: Space Marine is a fast-paced third person action-shooter from Relic Entertainment allowing players to don the armor of one of the emperor's chosen in a battle for the very survival of humanity. Featuring a seamless mix of melee and ranged combat, Space Marine will deliver aWarhammer 40,000: Space Marine is a fast-paced third person action-shooter from Relic Entertainment allowing players to don the armor of one of the emperor's chosen in a battle for the very survival of humanity. Featuring a seamless mix of melee and ranged combat, Space Marine will deliver a true next generation experience when it launches on Xbox 360 and PlayStation 3.… Expand"}, {"name": "Guns, Gore & Cannoli", "details_link": "https://www.metacritic.com/game/pc/guns-gore-cannoli", "publisher": "Crazy Monkey Studios", "release_date": "Apr 30 2015", "developers": ["Claeys Brothers Arts"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Action", "Shooter", "Platformer", "Shooter", "Third-Person", "2D", "Modern", "Modern", "Arcade"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/dee77577afd3d55cf5a7065c9dbb9a8f-98.jpg", "descriptions": "Guns, Gore & Cannoli is a Tarantino-esque homage to the exploitation/grindhouse films from the 70ies, the gangster classics, and the old school 2D arcade shooters."}, {"name": "The Sky Crawlers: Innocent Aces", "details_link": "https://www.metacritic.com/game/wii/the-sky-crawlers-innocent-aces", "publisher": "XSEED Games", "release_date": "Jan 12 2010", "developers": ["Access Games"], "platforms": "Wii", "genres": ["Action", "Simulation", "Flight", "Flight", "Modern Jet", "Combat"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/445e142c80b999d79a33cf82f103c513-98.jpg", "descriptions": "Use the Remote and Nunchuk to steer your plane through the skies as you seek out and gun down enemy jets."}, {"name": "Not a Hero", "details_link": "https://www.metacritic.com/game/playstation-4/not-a-hero", "publisher": "Devolver Digital", "release_date": "Feb  2 2016", "developers": ["roll7"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["General", "Action", "Platformer", "Shooter", "2D", "Shoot-'Em-Up", "Horizontal"], "meta_score": 74, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/8039277f26e14118fc5a53c15cbfc979-98.jpg", "descriptions": "Not A Hero is a 2D, cover-based, side-scrolling shooter about a purple rabbit from the future."}, {"name": "99Bullets", "details_link": "https://www.metacritic.com/game/ds/99bullets", "publisher": "EnjoyUp Games", "release_date": "May 23 2011", "developers": ["Arc System Works", "EnjoyUp Games"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/3b6d1b2063626b2b262ac60af4ade499-98.jpg", "descriptions": "99Bullets, a fun space shooter with retro look, where lose a bullet is lose a live and lose a life is lose a bullet. The galaxy IRATA 2601 is threatened by Black Eye and his minions, V-99 is raedy to stop him with his 99 bullets."}, {"name": "Pendragon", "details_link": "https://www.metacritic.com/game/pc/pendragon", "publisher": "inkle", "release_date": "Sep 22 2020", "developers": ["inkle"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/ca15fdd71eb5c6c239c486a75501d5e1-98.jpg", "descriptions": "AD 673. Camelot has fallen. The Round Table must rally to save King Arthur. Narrative strategy game from the creators of 80 DAYS, with elegant tactics and a unique, dynamic story every time you replay."}, {"name": "PGA Tour 2K21", "details_link": "https://www.metacritic.com/game/pc/pga-tour-2k21", "publisher": "2K Games", "release_date": "Aug 20 2020", "developers": ["HB Studios Multimedia"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Sports", "Individual", "Golf", "Sim"], "meta_score": 74, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/ed2482ac3245b0adaa6e0a6ec9d3e69c-98.jpg", "descriptions": "ALL-NEW PGA TOUR CAREER MODE:Prove you’ve got what it takes to become FedExCup Champion. Take on PGA TOUR Pros during your very own career, earning rewards and gear along the way.\r  PGA TOUR PROS AND NEW COURSES: Play against Justin Thomas and 11 top pros on stunning, real-life coursesALL-NEW PGA TOUR CAREER MODE:Prove you’ve got what it takes to become FedExCup Champion. Take on PGA TOUR Pros during your very own career, earning rewards and gear along the way.\r  PGA TOUR PROS AND NEW COURSES: Play against Justin Thomas and 11 top pros on stunning, real-life courses including TPC Sawgrass, East Lake Golf Club, and more.\r  BUILD YOUR MYPLAYER & DREAM COURSE: Create and personalize your MyPLAYER with equipment and apparel from brands you love. Design your ultimate course with 1,000s of custom options.\r  DOMINATE THE GREEN AT ANY SKILL LEVEL: Rookies can take advantage of real-time tutorials, tips and shot suggestions. Already a pro? Master your game with Pro Vision, Distance Control, Putt Preview, and other innovations.\r  GET THE PARTY STARTED: Hit the links with friends by playing local and online matches, including Alt-Shot, Stroke Play, Skins and 4-Player Scramble.\r  MAKE YOUR OWN RULES: Command your Clubhouse with Online Societies. Run full seasons and tournaments and earn bragging rights on the course. Create entry rules and requirements as well as handicap and event settings.\r  THE MOST REALISTIC COURSES EVER: Real-world scanning brings the fairway, green, bunkers, trees, lakes and ponds to life! True-to-form PGA TOUR broadcast presentation features slick graphics, dynamic cut-scenes and a seamless replay system, all anchored by the play-by-play commentary of Luke Elvy and Rich Beem.… Expand"}, {"name": "Tesla vs Lovecraft", "details_link": "https://www.metacritic.com/game/switch/tesla-vs-lovecraft", "publisher": "10tons", "release_date": "Mar 16 2018", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/54ab5e13a6b799c237963c71f5548199-98.jpg", "descriptions": "Tesla vs Lovecraft is an intense top-down twin stick arena shooter. Play as the enigmatic inventor Nikola Tesla harnessing the static energy to power up Tesla-Mech and give the lovecraftian nightmares a lesson in horror!\r Tesla vs Lovecraft is a top-down twin stick shooter with goal basedTesla vs Lovecraft is an intense top-down twin stick arena shooter. Play as the enigmatic inventor Nikola Tesla harnessing the static energy to power up Tesla-Mech and give the lovecraftian nightmares a lesson in horror!\r Tesla vs Lovecraft is a top-down twin stick shooter with goal based levels. The games highlight features are Quantum Teleportation, which allows the player to warp short distances even through solid objects, and the Tesla-Mech, which provides the player an immense boost to firepower for a limited time.\r Genre hallmarks such as a large arsenal of weapons, a multitude of player empowering perks, monster crushing powerups, and secondary weapon abilities are also included.… Expand"}, {"name": "Binary Domain", "details_link": "https://www.metacritic.com/game/xbox-360/binary-domain", "publisher": "Sega", "release_date": "Feb 28 2012", "developers": ["Sega", "Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Shooter", "Third-Person", "Tactical", "Arcade"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/29804917963b8339160055bc406bfd83-98.jpg", "descriptions": "Binary Domain puts players in the middle of a fast-paced and intense battle for humanity in robot-invaded 2080 Tokyo. Fighting through the derelict lower levels of the city, players control an international peace-keeping squad that soon starts to question their surroundings and the choicesBinary Domain puts players in the middle of a fast-paced and intense battle for humanity in robot-invaded 2080 Tokyo. Fighting through the derelict lower levels of the city, players control an international peace-keeping squad that soon starts to question their surroundings and the choices they are making. Are the robots becoming more human, or are humans becoming more like machines?… Expand"}, {"name": "Dr. Mario / Puzzle League", "details_link": "https://www.metacritic.com/game/game-boy-advance/dr-mario-puzzle-league", "publisher": "Nintendo", "release_date": "Nov 28 2005", "developers": ["Intelligent Systems"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/3bbb67332739d014ecd75b78918863f1-98.jpg", "descriptions": "Dr. Mario requires equal parts strategy and speed to achieve victory. Delete viruses by throwing vitamin capsules into a bottle. Since many viruses are trapped at the bottom of the bottle, you must plan ahead in order to eliminate them.In Puzzle League, you'll form a chain of three or moreDr. Mario requires equal parts strategy and speed to achieve victory. Delete viruses by throwing vitamin capsules into a bottle. Since many viruses are trapped at the bottom of the bottle, you must plan ahead in order to eliminate them.In Puzzle League, you'll form a chain of three or more same-colored blocks. When you match up shapes, the blocks on top will fall onto other matching blocks, but if you can't make a match, the blocks rise to the top of the screen. This game also has unusual depth in terms of options and settings which lets players create a custom game experience.… Expand"}, {"name": "Sega Rally Revo", "details_link": "https://www.metacritic.com/game/pc/sega-rally-revo", "publisher": "Sega", "release_date": "Nov 19 2007", "developers": ["SEGA Racing Studio"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "6  Online", "genres": ["Driving", "Racing", "Arcade", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/c8372b582714194db3965842d97c8e5f-98.jpg", "descriptions": "(Known as \"Sega Rally\" in the UK/EU)  With dynamically deformable terrain, proprietary next-generation graphics, realistic physics, and competitive bumper-to-bumper racing, Sega Rally Revo is a high-tempo driving experience that is every racing fan's driving fantasy. Vehicle selection(Known as \"Sega Rally\" in the UK/EU)  With dynamically deformable terrain, proprietary next-generation graphics, realistic physics, and competitive bumper-to-bumper racing, Sega Rally Revo is a high-tempo driving experience that is every racing fan's driving fantasy. Vehicle selection affects driving strategy in Sega Rally Revo, as race course surfaces dynamically deform upon repeated contact with vehicle tires and changing weather effects. Sega Rally Revo features a variety of fully deformable surfaces, from gravel-littered tracks and smooth tarmac roads, to snow-covered mountain passes. This means no two laps will be the same, and drivers can skillfully lower their lap times as they hurtle their chosen world-renowned rally vehicles down photo-realistic courses only made possible on next-generation hardware. Driving skills are also tested by Sega Rally Revo's advanced AI which allows NPC drivers to dynamically adapt their driving style to the varied racing surfaces. Players can enjoy a comprehensive single-player campaign as they travel the globe racing the best drivers in the world. The game also features online capabilities, with multiplayer splitscreen modes offering an extremely competitive rally experience against drivers around the world. [Sega]… Expand"}, {"name": "Destroy All Humans!", "details_link": "https://www.metacritic.com/game/playstation-2/destroy-all-humans!", "publisher": "THQ", "release_date": "Jun 21 2005", "developers": ["Pandemic Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox 360", "Xbox One", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/4193947daa3d8292d36116f6f7e325a7-98.jpg", "descriptions": "Use destructive weapons and innate mental powers to take on the most feared enemy in the galaxy - Mankind! Play as Crypto, an alien warrior sent to Earth to clear the way for the Furon invasion force.Your mission is to infiltrate humanity, control them, harvest their brain stems andUse destructive weapons and innate mental powers to take on the most feared enemy in the galaxy - Mankind! Play as Crypto, an alien warrior sent to Earth to clear the way for the Furon invasion force.Your mission is to infiltrate humanity, control them, harvest their brain stems and ultimately destroy them. You choose the method - infiltration or disintegration! Arm yourself with a variety of alien weaponry on land or in the air. Use the Ion Detonator, the Zap-O-Matic, the Sonic Boom, or even the Quantum Deconstructor to eradicate feeble humans. Explore and interact with 5 huge environments using an arsenal of alien abilities to manipulate humans into submission: hypnotize, body-snatch, read minds, levitate and more. Take to the skies in your UFO, abduct animals, cars, and humans for research, or cause large-scale destruction. [THQ]… Expand"}, {"name": "Evidence: The Last Ritual", "details_link": "https://www.metacritic.com/game/pc/evidence-the-last-ritual", "publisher": "The Adventure Company", "release_date": "Oct 16 2006", "developers": ["Lexis Numerique"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/cfcb7218326f216876598369e45cd8b5-98.jpg", "descriptions": "The notorious serial killer \"The Phoenix\" is back and the authorities need your help to catch him once and for all. Using an innovative blend of Windows gameplay and the Internet, the player explores key cities in Europe and North America. Players receive live emails from various contactsThe notorious serial killer \"The Phoenix\" is back and the authorities need your help to catch him once and for all. Using an innovative blend of Windows gameplay and the Internet, the player explores key cities in Europe and North America. Players receive live emails from various contacts around the world and can partner up with other players to crack the case. From the creators of \"MISSING: Since January.\"… Expand"}, {"name": "Deponia", "details_link": "https://www.metacritic.com/game/pc/deponia", "publisher": "Daedalic Entertainment", "release_date": "Aug  6 2012", "developers": ["Daedalic Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/178c80f474e9be9ea471080398903943-98.jpg", "descriptions": "Deponia is a fast-paced comedy of errors and one of the most unusual love stories in gaming history. The twist-filled story takes its off-beat characters all over trash planet Deponia, a unique game world in the style of Douglas Adams, Terry Pratchett and Matt Groening. From Kuvaq, anDeponia is a fast-paced comedy of errors and one of the most unusual love stories in gaming history. The twist-filled story takes its off-beat characters all over trash planet Deponia, a unique game world in the style of Douglas Adams, Terry Pratchett and Matt Groening. From Kuvaq, an improvised village built inside a giant trash heap, to the swimming black market and the dark corners of the elevated planetary railways: Deponia is brought to life with detailed hand-painted backgrounds in widescreen format and top-quality cartoon animation… Expand"}, {"name": "Battle Brothers", "details_link": "https://www.metacritic.com/game/switch/battle-brothers", "publisher": "UKIYO PUBLISHING LIMITED", "release_date": "Mar 11 2021", "developers": ["Overhype Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/97bcf681d07873f71c12e88adac48c9a-98.jpg", "descriptions": "Battle Brothers is a turn based tactical RPG which has you leading a mercenary company in a gritty, low-power, medieval fantasy world. You decide where to go, whom to hire or to fight, what contracts to take and how to train and equip your men in a procedurally generated open world campaign."}, {"name": "Biped", "details_link": "https://www.metacritic.com/game/pc/biped", "publisher": "NExT Studios", "release_date": "Mar 26 2020", "developers": ["NExT Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/8f56c6238b7b41ff33f092fda15b1b7e-98.jpg", "descriptions": "Biped is a coop action adventure game with a strong focus on moment-to-moment collaboration between 2 players."}, {"name": "Shadow Bug", "details_link": "https://www.metacritic.com/game/switch/shadow-bug", "publisher": "Muro Studios Ltd.", "release_date": "Mar 30 2018", "developers": ["Muro Studios Ltd."], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/61d6fe8d2f75bfdf8bbbd17d893a0d5e-98.jpg", "descriptions": "You are the overpowered ninja hero Shadow Bug! Save your home forest from the evil factory by slicing monsters to pieces. Adventure through beautiful and twisted landscapes full of action and adventure as the ultimate ninja."}, {"name": "The Escapists", "details_link": "https://www.metacritic.com/game/xbox-one/the-escapists", "publisher": "Team17", "release_date": "Feb 13 2015", "developers": ["Mouldy Toof Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "General"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/1c77a59ed183c5898da9b675641ddf4b-98.jpg", "descriptions": "Plot an intricate prison escape while working within the prison's schedule, creating weapons and tools while not bring suspicion upon yourself from guards."}, {"name": "Dungeon Siege: Throne of Agony", "details_link": "https://www.metacritic.com/game/psp/dungeon-siege-throne-of-agony", "publisher": "Take-Two Interactive", "release_date": "Oct 30 2006", "developers": ["SuperVillain Studios"], "platforms": "PSP", "num_players": "2 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/cd5881a7619278e5b559aa15180aaf31-98.jpg", "descriptions": "Dungeon Siege: Throne of Agony is an all-new adventure, created from the ground up specifically for the PSP handheld system. Dungeon Siege: Throne of Agony features all-new playable characters and a freshly designed, non-linear, single player campaign as well as support for Ad HocDungeon Siege: Throne of Agony is an all-new adventure, created from the ground up specifically for the PSP handheld system. Dungeon Siege: Throne of Agony features all-new playable characters and a freshly designed, non-linear, single player campaign as well as support for Ad Hoc co-operative and competitive multiplayer games. Multiple characters to choose from - Characters can be customized as they level up into different Hero Classes and then even further into Legendary Classes. Player can choose from numerous Pets and Companions to play with. Gameplay will encourage the player to constantly switch between unique Pets and Companions to use their special powers. Face over 100 monsters including well known monsters from the Dungeon Siege world as well as many new creatures. Multiplayer Cooperative Campaign allows you to play with a friend. Each player can bring a Pet or Companion adding up to a four party experience. Multiplayer Battle Arenas allow a concise, fun party experience for players who don't have time for a full campaign. 15 hours of gameplay with 2 different modes Mercenary and Elite. [2K Games]… Expand"}, {"name": "The Raven: Legacy of a Master Thief", "details_link": "https://www.metacritic.com/game/pc/the-raven-legacy-of-a-master-thief", "publisher": "The Adventure Company", "release_date": "Jul 23 2013", "developers": ["KING Art"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/5c68b5939cc41893563263075b6b62d9-98.jpg", "descriptions": "Set across 1960's Europe, The Raven is a stunning fast-paced point-and-click adventure journeying through thrilling and dense atmospheres with the aim of catching the art burglar, The Raven. Players follow The Raven's trademark black feather clues to capture the thief and to protect aSet across 1960's Europe, The Raven is a stunning fast-paced point-and-click adventure journeying through thrilling and dense atmospheres with the aim of catching the art burglar, The Raven. Players follow The Raven's trademark black feather clues to capture the thief and to protect a legendary sapphire, the \"Eye of the Sphinx\" on its journey from Switzerland to Egypt.… Expand"}, {"name": "Far Cry 6", "details_link": "https://www.metacritic.com/game/pc/far-cry-6", "publisher": "Ubisoft", "release_date": "Oct  7 2021", "developers": ["Ubisoft Toronto"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 74, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/5/114febf57509579a2cbd053dd15e979e-98.jpg", "descriptions": "Far Cry 6 reveals a Caribbean island simmering with revolutionary tension. The title features actor Giancarlo Esposito (“Better Call Saul,” “The Boys,” “The Mandalorian”) as President Anton Castillo, the violent leader who grips the island of Yara with an iron fist, promising a return to itsFar Cry 6 reveals a Caribbean island simmering with revolutionary tension. The title features actor Giancarlo Esposito (“Better Call Saul,” “The Boys,” “The Mandalorian”) as President Anton Castillo, the violent leader who grips the island of Yara with an iron fist, promising a return to its former glory. With an arsenal of weapons and allies at your back, you’ll take on Castillo’s regime and fight for the future of Yara. As Dani Rojas (playable as a female or male character), you will help stoke the fires of revolution through guerrilla warfare across the island of Yara, from verdant jungles to the urban streets of the capital city, Esperanza. You’ll use a powerful array of weapons and vehicles, and build a network of allies to fight alongside you, including Fangs for Hire like Chorizo, the dangerously distracting wiener dog. As President Castillo prepares his son Diego, played by Anthony Gonzalez (“Coco”), to succeed him, you will do all you can to ensure his plans don’t come to fruition. [Ubisoft]… Expand"}, {"name": "Marvel's Guardians of the Galaxy - Episode 1: Tangled Up in Blue", "details_link": "https://www.metacritic.com/game/xbox-one/marvels-guardians-of-the-galaxy---episode-1-tangled-up-in-blue", "publisher": "Telltale Games", "release_date": "Apr 18 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 74, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/8e4c0d054ea70e4134daab6bd5d9c063-98.jpg", "descriptions": "Marvel’s Guardians of the Galaxy: The Telltale Series delivers a wholly new story of the universe’s unlikeliest heroes, the rag-tag band of outlaws who go by the names Star-Lord, Gamora, Drax, Rocket, and Groot. In the wake of an epic battle, the Guardians discover an artifact of unspeakableMarvel’s Guardians of the Galaxy: The Telltale Series delivers a wholly new story of the universe’s unlikeliest heroes, the rag-tag band of outlaws who go by the names Star-Lord, Gamora, Drax, Rocket, and Groot. In the wake of an epic battle, the Guardians discover an artifact of unspeakable power.… Expand"}, {"name": "What The Bat?", "details_link": "https://www.metacritic.com/game/playstation-5/what-the-bat", "publisher": "Triband", "release_date": "Feb 22 2023", "developers": ["Triband"], "platforms": ["PC", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/aa98df5da760d958e0a2689969021baa-98.jpg", "descriptions": "A wise man once said: If all you have are bats for hands, everything feels like a baseball. From the creators of WHAT THE GOLF? comes a silly VR game about navigating life with baseball bats for hands. Swing your way through over 100 levels of batting, cooking, shooting, smashing, parking,A wise man once said: If all you have are bats for hands, everything feels like a baseball. From the creators of WHAT THE GOLF? comes a silly VR game about navigating life with baseball bats for hands. Swing your way through over 100 levels of batting, cooking, shooting, smashing, parking, painting, pickling, petting, and WHATnot. Experience fully immersive silliness in a first-person experience like no other!\r Features:\r- 100+ unique levels of physical comedy and craziness!\r- Wholesome original soundtrack!\r- Pet a dog, pickle a tractor, and take selfies with The Selfie Bat!\r- The expected playtime is 4 hours, but remember to take breaks (too much VR can drive you batty)… Expand"}, {"name": "Nobunaga's Ambition: Sphere of Influence - Ascension", "details_link": "https://www.metacritic.com/game/playstation-4/nobunagas-ambition-sphere-of-influence---ascension", "publisher": "Koei Tecmo Games", "release_date": "Oct 25 2016", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/28cfd867e9ec1cb513fce97e098a6dff-98.jpg", "descriptions": "Experience the reality of officer life in the Warring States period, and watch with your own eyes the fighting that brought the end of an era."}, {"name": "Dungeon Runners", "details_link": "https://www.metacritic.com/game/pc/dungeon-runners", "publisher": "NCSOFT", "release_date": "Jul  2 2008", "developers": ["NCSOFT"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 74, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/7349126ea4ae105f33fc997671c8cfd4-98.jpg", "descriptions": "Something stirs in the darkness. A hot earthy smell wafts up from the dank depths. Nails scratch against limestone, dripping water echoes off cavern walls, ancient chains rattle in stagnant air. What lies in the eerie depths below? Dungeon Runners is an online role-playing game that's FREESomething stirs in the darkness. A hot earthy smell wafts up from the dank depths. Nails scratch against limestone, dripping water echoes off cavern walls, ancient chains rattle in stagnant air. What lies in the eerie depths below? Dungeon Runners is an online role-playing game that's FREE to download and FREE to play. As a brave hero, you'll explore dangerous dungeons, battle ferocious monsters and discover incredible weapons, artifacts and loot. Choose to play as Fighter, Mage or Ranger in a realm of terror, magic and adventure. Unlock powerful new skills as you gain experience on your journey into the unknown. Whether fighting evil hordes as a lone warrior or teaming up with online friends to carve a path of destruction through your foe, Dungeon Runners will quench your deepest dungeon-crawling thirst. [NCsoft]… Expand"}, {"name": "Blitzkrieg (2003)", "details_link": "https://www.metacritic.com/game/pc/blitzkrieg-2003", "publisher": "cdv Software", "release_date": "May 12 2003", "developers": ["Nival Interactive"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic", "Tactics"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/fad2fdaafc9f87ca4c5dd1fd8df12bde-98.jpg", "descriptions": "Eisenhower, Rommel, Zhukov; Assume your rightful place among the great generals commanding the Allies, Germans or Soviets as they advance through the decisive battles of WWII. Blitzkrieg is the latest development in WWII real-time strategy gaming combining flexibility, historic accuracy andEisenhower, Rommel, Zhukov; Assume your rightful place among the great generals commanding the Allies, Germans or Soviets as they advance through the decisive battles of WWII. Blitzkrieg is the latest development in WWII real-time strategy gaming combining flexibility, historic accuracy and endless playability into one of the most challenging and enjoyable games yet! Blitzkrieg's unique and completely flexible campaign structure puts you in control of deciding how your forces will fare in each of the major engagements that comprise three central Campaigns. Hardcore vets have the option of engaging the enemy immediately in a desperate struggle for battlefield dominance, or more cautious players can choose from pre-defined or unlimited randomly generated side missions as they gain experience, promotions and weapons upgrades as well as wear down the enemy before the central conflict. [Nival Interactive]… Expand"}, {"name": "Genji: Dawn of the Samurai", "details_link": "https://www.metacritic.com/game/playstation-2/genji-dawn-of-the-samurai", "publisher": "SCEA", "release_date": "Sep 20 2005", "developers": ["Game Republic"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 74, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/0629f83aa1cd4753bc339b8ca4eaf7e5-98.jpg", "descriptions": "Genji: Dawn of the Samurai is an intense 3D action-adventure game. Inspired by the 11th century Japanese literary masterpiece, \"Tale of Genji,\" Genji: Dawn of the Samurai provides a dramatic samurai plot fused with fantastical Japanese mythology. This historic samurai tale is set against theGenji: Dawn of the Samurai is an intense 3D action-adventure game. Inspired by the 11th century Japanese literary masterpiece, \"Tale of Genji,\" Genji: Dawn of the Samurai provides a dramatic samurai plot fused with fantastical Japanese mythology. This historic samurai tale is set against the beautiful and elegant environments of feudal Japan, and delivers a story of two noble warriors engaged in a crusade against mythical forces controlling Japan. In addition, Genji: Dawn of the Samurai features authentic swordplay choreographed by Japan's leading swordsman, and production directed by acclaimed industry veterans. [SCEA]… Expand"}, {"name": "Trackmania", "details_link": "https://www.metacritic.com/game/pc/trackmania", "publisher": "Ubisoft", "release_date": "Jul  1 2020", "developers": ["Ubisoft Nadeo"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 74, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/0/bf7474935885ec24a5be1bf6ad5a71e0-98.jpg", "descriptions": "Free for players to race solo or multiplayer on quarterly renewed official campaigns, including 25 tracks, allowing players to earn medals and record scores in the regional rankings. Players will be able to enjoy other player’s creations on the Arcade Channel, try various editors    Free for players to race solo or multiplayer on quarterly renewed official campaigns, including 25 tracks, allowing players to earn medals and record scores in the regional rankings. Players will be able to enjoy other player’s creations on the Arcade Channel, try various editors (tracks, replays and skins) and map review servers. The weekly Nations League is also available for casual competitions. \r\rStandard Access: In addition to the free content, Standard Access expands the content available with player creations, including the “Track of the Day” selection, and full access to replay, track editors and map review servers. Additionally, players can participate in daily competitions and keep every “Track of the Day” and “Official” campaign track. One year of standard access is available for $9.99.\r Club Access: Including the above, Club Access allows players to join their favorite clubs to access exclusive content and activities such as skin customization, special campaigns, online rooms, training tracks and competitions. They can also create their own club to share their creations and organize events. Players can participate in the Open Grand League, organized by Ubisoft Nadeo, and try to qualify for the Trackmania Grand League. One year of the Club Access is available for $29.99 or three years for $59.99.\r… Expand"}]