[{"name": "NHL 2005", "details_link": "https://www.metacritic.com/game/gamecube/nhl-2005", "publisher": "EA Sports", "release_date": "Sep 20 2004", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 75, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/57bf2a1f3de389e4670127d8944e5c11-98.jpg", "descriptions": "Capture all the speed, finesse, and action of professional hockey with NHL 2005. The game's new EA Sports Open Ice Control lets you execute offensive plays, such as a give-and-go and a breakaway pass, and you can also call for defensive double-teams. Dynasty mode has been enhanced with moreCapture all the speed, finesse, and action of professional hockey with NHL 2005. The game's new EA Sports Open Ice Control lets you execute offensive plays, such as a give-and-go and a breakaway pass, and you can also call for defensive double-teams. Dynasty mode has been enhanced with more interactive GM/owner relationships, including a new e-mail system. NHL 2005 also delivers all the action of the World Cup of Hockey with International Teams and venues from North America and Europe. … Expand"}, {"name": "Patrician III: Rise of the Hanse", "details_link": "https://www.metacritic.com/game/pc/patrician-iii-rise-of-the-hanse", "publisher": "Encore Software, Inc.", "release_date": "Oct 31 2003", "developers": ["Ascaron Entertainment GmbH", "Ascaron Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 75, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/4b9b444e9db3c716c92f575323da92c9-98.jpg", "descriptions": "The best selling olde-worlde real-time city-building simulation is back! Build cities, manage economies and battle pirates in the only game of its kind based in the Middle Ages. Grow your small towne into a major trading center wielding tremendous economic power. [Encore Software]"}, {"name": "Space Colony", "details_link": "https://www.metacritic.com/game/pc/space-colony", "publisher": "Gathering", "release_date": "Oct 14 2003", "developers": ["FireFly Studios"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/64879f5d26fa1e87571c093942e8bf24-98.jpg", "descriptions": "Space the final frontier... not anymore. In Space Colony you will explore and colonize new worlds with the same sense of familiarity of popping in your local coffee shop for a skinny decaf latte. Space Colony is best described as a People Sim meets a City Builder. The player manages andSpace the final frontier... not anymore. In Space Colony you will explore and colonize new worlds with the same sense of familiarity of popping in your local coffee shop for a skinny decaf latte. Space Colony is best described as a People Sim meets a City Builder. The player manages and nurtures a group of dysfunctional space dwellers colonizing the most unearthly corners of the galaxy. Make no mistake, none of the 20 colonists you'll meet were ever on a NASA shortlist. Ahhh, welcome to life beyond the stars. It's everything the brochure said. So what if half the staff are brawling, the Harvester Robot is chain sawing its way through the oxygen supply and small furry aliens have taken over the disco? This is home! Space Colony comes from Firefly Studios, the creative force behind the million selling Stronghold series. Creating the pressure cooker environment with emotions flying around, where else could you find a Norwegian biker who can't live without disco, a gym instructor operating a nuclear reactor and a geriatric in charge of base defence? [Gathering of Developers]… Expand"}, {"name": "Tropico 2: Pirate Cove", "details_link": "https://www.metacritic.com/game/pc/tropico-2-pirate-cove", "publisher": "Gathering", "release_date": "Apr  8 2003", "developers": ["Frog City Software"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Government"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/43ae1a62ac0ad715addd063b756bec2b-98.jpg", "descriptions": "The sequel to the award-winning Fun in the Sun Caribbean simulation, Tropico. As a Pirate King, rule a secret pirate island full of despicable 17th century Sea Dogs. Fuel your economy by plundering wealthy merchants and taking prisoners back to the island as captive workers. Keep your scurvyThe sequel to the award-winning Fun in the Sun Caribbean simulation, Tropico. As a Pirate King, rule a secret pirate island full of despicable 17th century Sea Dogs. Fuel your economy by plundering wealthy merchants and taking prisoners back to the island as captive workers. Keep your scurvy buccaneers satisfied with rowdy gambling, jolly feasting, and barrels of rum! World powers fear you, brigands respect you, captives obey your every command, and don't forget about the wenching! Argh, thar ain't nuttin like bein' a Pirate King! [Gathering of Developers]… Expand"}, {"name": "Serious Sam", "details_link": "https://www.metacritic.com/game/xbox/serious-sam", "publisher": "Gotham Games", "release_date": "Nov 10 2002", "developers": ["Croteam"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 75, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/1e0a76543d09b862449f2ea6a11b92e5-98.jpg", "descriptions": "Monsters spawned from another dimension are trying to make The Milky Way their personal trash can. As attempts to defend the solar system fail, the fate of the Earth, and even the universe, rests with one man--Sam \"Serious\" Stone. Step into Sam's shoes while he hacks, blasts, andMonsters spawned from another dimension are trying to make The Milky Way their personal trash can. As attempts to defend the solar system fail, the fate of the Earth, and even the universe, rests with one man--Sam \"Serious\" Stone. Step into Sam's shoes while he hacks, blasts, and annihilates more than 100 creatures at a time as they attack simultaneously from the air, land, and water. With wild power-ups, such as invulnerability, invisibility, damage, and speed, there's nothing you can't handle.… Expand"}, {"name": "Mat Hoffman's Pro BMX 2", "details_link": "https://www.metacritic.com/game/xbox/mat-hoffmans-pro-bmx-2", "publisher": "Activision", "release_date": "Aug 12 2002", "developers": ["Rainbow Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/23fa1d3b5747c8ab095b6f7fed494431-98.jpg", "descriptions": "Matt Hoffman's Pro BMX 2 takes you for a ride through free-roaming cities, where you can perform a variety of stunts on your bike. Choose from an array of professional riders--including Matt Hoffman, Ruben Alcantara, Cory Nastazio, Mike Escamilla, Nathan Wessel, and Joe Kowalski--and begin aMatt Hoffman's Pro BMX 2 takes you for a ride through free-roaming cities, where you can perform a variety of stunts on your bike. Choose from an array of professional riders--including Matt Hoffman, Ruben Alcantara, Cory Nastazio, Mike Escamilla, Nathan Wessel, and Joe Kowalski--and begin a skating career. You'll travel to eight expansive cities that come to life with helicopters, boats, cars, and pedestrians. Then, challenge your friend in Push mode, where every time you score big, your side of the screen gets bigger while your friend's shrinks. … Expand"}, {"name": "Atari Anniversary Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/atari-anniversary-advance", "publisher": "Infogrames", "release_date": "Mar 25 2002", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/01f5fa241660451f59f8fd9d13e040a7-98.jpg", "descriptions": "Atari® presents 6 of the best arcade games ever made, mega-hits that launched the video game revolution -- Asteroids®, Battlezone®, Centipede®, Missile Command®, Super Breakout® and Tempest™. Each game is reproduced down to the last detail, and each one is justAtari® presents 6 of the best arcade games ever made, mega-hits that launched the video game revolution -- Asteroids®, Battlezone®, Centipede®, Missile Command®, Super Breakout® and Tempest™. Each game is reproduced down to the last detail, and each one is just as easy and fun to play. Whether you're a diehard fan or a competitive newcomer, you've got to play the games that started it all!… Expand"}, {"name": "Alone in the Dark: The New Nightmare", "details_link": "https://www.metacritic.com/game/dreamcast/alone-in-the-dark-the-new-nightmare", "publisher": "Infogrames", "release_date": "Sep 24 2001", "developers": ["Darkworks"], "platforms": ["PC", "Dreamcast"], "genres": ["Action Adventure", "Horror"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/11572063142635a8c605aaa205e5b8c5-98.jpg", "descriptions": "The budget price of this game is sure to please just about any gamer willing to take the plunge into this well-saturated genre."}, {"name": "Armored Core 2: Another Age", "details_link": "https://www.metacritic.com/game/playstation-2/armored-core-2-another-age", "publisher": "Agetec Inc.", "release_date": "Aug 20 2001", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 75, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/0d45d97dea193191bb852f4204a7d4d0-98.jpg", "descriptions": "Another age takes place five years after Leos Klain's coup on Mars. The Earth Government is struggling with the powerful Corporations for control of the planet - and they desperately need the help from the Ravens. Players take the role of these Ravens - mercenaries who fight for the highestAnother age takes place five years after Leos Klain's coup on Mars. The Earth Government is struggling with the powerful Corporations for control of the planet - and they desperately need the help from the Ravens. Players take the role of these Ravens - mercenaries who fight for the highest bidders.  The game features 100 new missions, a split-screen vs. mode, and 10 billion possible parts combinations.… Expand"}, {"name": "Top Spin 2", "details_link": "https://www.metacritic.com/game/xbox-360/top-spin-2", "publisher": "2K Sports", "release_date": "Mar 29 2006", "developers": ["Pam Development"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/29f0e46185a9e82de77e1bec9d85bb88-98.jpg", "descriptions": "Everything you loved about Top Spin is back and made even better. The peerless player-creator is reborn with the powerful Digital Identity that truly puts you in the game. Experience the pro tour in venues that are alive and dynamic with environmental elements that react to your play.Everything you loved about Top Spin is back and made even better. The peerless player-creator is reborn with the powerful Digital Identity that truly puts you in the game. Experience the pro tour in venues that are alive and dynamic with environmental elements that react to your play. Characters are even more stunning with the addition of HD technology and the inclusion of the top players in the world like Maria Sharapova, Venus Williams, Andy Roddick, Lleyton Hewitt and Roger Federer. Create realistic player models and customize them with the highest level of details. Hairstyles, sweatbands, shirts, shorts, shoes, and more allow you to create a player with your look and your style. Silky smooth animations, vibrant colors, and hi-definition technology delivers illustrious depictions of players, stadiums, and crowds bringing tennis to life on the Xbox 360. Take on, play as, or team up with 24 of the world's top ranked professionals, featuring tennis stars: Andy Roddick, Roger Federer, Carlos Moya, Tommy Haas, James Blake, Lleyton Hewitt, Guillermo Coria, Tim Henman, Max Mirnyi, Alex Kuznetsov, Brendan Evans, Venus Williams, Maria Sharapova, Ai Sugiyama, Lindsay Davenport, Anastasia Myskina, Daniela Hantuchova, Svetlana Kuznetsova, Amelie Mauresmo, Alicia Molik, Angela Haynes, Jamea Jackson, and Corina Morariu. [2K Sports]… Expand"}, {"name": "GRID Legends", "details_link": "https://www.metacritic.com/game/pc/grid-legends", "publisher": "Electronic Arts", "release_date": "Feb 25 2022", "developers": ["Codemasters"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 22 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 75, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/40254ba3ce86c35ab01b350d77f24ffb-98.jpg", "descriptions": "GRID Legends is for the racing thrill-seekers, delivering thrilling wheel-to-wheel motorsport and edge of your seat action around the globe. Create your dream motorsport events, hop into live multiplayer races, be part of the drama in an immersive virtual production story, and embrace theGRID Legends is for the racing thrill-seekers, delivering thrilling wheel-to-wheel motorsport and edge of your seat action around the globe. Create your dream motorsport events, hop into live multiplayer races, be part of the drama in an immersive virtual production story, and embrace the sensation of spectacular action racing. Jostle for position. Drive legendary cars to their limits. Feel the rush of incredible speed. Push your Nemesis on the track. Defeat your friends again and again... and don't let them ever forget it!Play together with up to 21 friends in the most social and connected GRID ever, including cross-platform play, and cause havoc on the track. Make racing memories with a stunning variety of cars, new city locations such as London and Moscow, exciting event types, and create on-track enemies. Use the Race Creator to design adrenaline-fueled races to tear up with your friends, with event types like Elimination, electrifying Boost races, and the return of Drift. Want to race hypercars against huge trucks? Go for it! Be part of the spectacle of motorsport with our dramatic virtual production story Driven to Glory, or dive into our largest ever Career, featuring hundreds of exhilarating events.… Expand"}, {"name": "Wolfenstein: The Old Blood", "details_link": "https://www.metacritic.com/game/xbox-one/wolfenstein-the-old-blood", "publisher": "Bethesda Softworks", "release_date": "May  5 2015", "developers": ["MachineGames"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/3fd6ad0608405fb2ecff29b59beb38f5-98.jpg", "descriptions": "It's 1946 and the Nazis are on the verge of winning WWII. In attmepting to turn the tide in the allies’ favor, B.J. Blazkowicz has to embark on an epic, two-part mission deep within Bavaria… Part one of Wolfenstein: The Old Blood - Rudi Jäger and the Den of Wolves - pits BJ BlazkowiczIt's 1946 and the Nazis are on the verge of winning WWII. In attmepting to turn the tide in the allies’ favor, B.J. Blazkowicz has to embark on an epic, two-part mission deep within Bavaria… Part one of Wolfenstein: The Old Blood - Rudi Jäger and the Den of Wolves - pits BJ Blazkowicz against a notorious prison warden as he breaks into Castle Wolfenstein in an attempt to steal the coordinates to General Deathshead’s compound. In the second part – The Dark Secrets of Helga Von Schabbs – our hero's search for the coordinates leads him to the city of Wulfburg where an obsessed Nazi archaeologist is exhuming enigmatic artifacts that threaten to unleash a dark and ancient power.… Expand"}, {"name": "Cursed to Golf", "details_link": "https://www.metacritic.com/game/switch/cursed-to-golf", "publisher": "Thunderful", "release_date": "Aug 18 2022", "developers": ["Chuhai Labs"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/c2660b5e01e5c6070d813776b8c9d885-98.jpg", "descriptions": "Cursed to Golf is a golf-like adventure where every shot counts. Players are tasked with making it out of Golf Purgatory to become a Golfing Legend.\r With insane hazards, otherworldly power-ups and tons of replayability, will you make it back alive or will you forever be... Cursed to Golf!?"}, {"name": "The Awesome Adventures of Captain Spirit", "details_link": "https://www.metacritic.com/game/playstation-4/the-awesome-adventures-of-captain-spirit", "publisher": "Square Enix", "release_date": "Jun 25 2018", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/6df4e92800fc166637ac59f787203407-98.jpg", "descriptions": "Meet Chris, a creative and imaginative 10-year-old boy who escapes reality with fantastical adventures as his alter ego, the Awesome Captain Spirit. Hearken back to your childhood and play a touching narrative experience from the directors and development team behind the BAFTA award-winningMeet Chris, a creative and imaginative 10-year-old boy who escapes reality with fantastical adventures as his alter ego, the Awesome Captain Spirit. Hearken back to your childhood and play a touching narrative experience from the directors and development team behind the BAFTA award-winning game Life is Strange. The Awesome Adventures of Captain Spirit is an original story set in the Life is Strange Universe that contains links to the brand-new story an characters of Life is Strange 2.… Expand"}, {"name": "Resident Evil 7: biohazard - Banned Footage Vol. 1", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-7-biohazard---banned-footage-vol-1", "publisher": "Capcom", "release_date": "Jan 31 2017", "developers": ["Capcom"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 75, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/39aa588084a63c0316313255cf8173f7-98.jpg", "descriptions": "The first pack of DLC for RE7.  See what went on with another poor victim that might look familiar to you, and find out how the Bakers became the twisted family you see in RE7."}, {"name": "Strike Vector EX", "details_link": "https://www.metacritic.com/game/playstation-4/strike-vector-ex", "publisher": "Strike Vector Team", "release_date": "Aug 30 2016", "developers": ["Strike Vector Team", "Ragequit Corporation"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Action", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/81308d13150cdee0b461e3bdd4113723-98.jpg", "descriptions": "Strike Vector is an intense, multiplayer third / first person air combat game. With a distinct old school feel, reminiscent to games such as Crimson Skies, Quake 3 and Unreal Tournament, Strike Vector will let you test your reflexes and skills against your friends."}, {"name": "Space Run Galaxy", "details_link": "https://www.metacritic.com/game/pc/space-run-galaxy", "publisher": "Focus Home Interactive", "release_date": "Jun 17 2016", "developers": ["Passtech Games"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 75, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/515ec239009fd851adf46bda80ff5d78-98.jpg", "descriptions": "Space Run Galaxy is the sequel to Space Run, the game from one-man studio Passtech, which seduced hundreds of thousands of players with its dynamic and original gameplay. By twisting the tower-defense game style, Space Run offered an addictive real-time spaceship construction strategy experience."}, {"name": "Don't Starve: Giant Edition", "details_link": "https://www.metacritic.com/game/wii-u/dont-starve-giant-edition", "publisher": "Klei Entertainment", "release_date": "May 28 2015", "developers": ["Klei Entertainment"], "platforms": ["PlayStation 3", "PlayStation Vita", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/0dbd7b8405fc3512e54da25d53004333-98.jpg", "descriptions": "Dont Starve: Giant Edition is an uncompromising wilderness survival game full of science and magic.\r You play as Wilson, an intrepid Gentleman Scientist who has been trapped by a demon and transported to a mysterious wilderness world. Wilson must learn to exploit his environment and itsDont Starve: Giant Edition is an uncompromising wilderness survival game full of science and magic.\r You play as Wilson, an intrepid Gentleman Scientist who has been trapped by a demon and transported to a mysterious wilderness world. Wilson must learn to exploit his environment and its inhabitants if he ever hopes to escape and find his way back home.\r Enter a strange and unexplored world full of strange creatures, dangers, and surprises. Gather resources to craft items and structures that match your survival style. Play your way as you unravel the mysteries of this strange land.… Expand"}, {"name": "Avadon: The Black Fortress", "details_link": "https://www.metacritic.com/game/pc/avadon-the-black-fortress", "publisher": "Spiderweb Software", "release_date": "May  2 2011", "developers": ["Spiderweb Software"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/4bbecbd9cc5a5d6b9a6f21a5d00c4830-98.jpg", "descriptions": "You are a servant of Avadon. The Black Fortress. Your job is to protect the Pact, five nations that have banded together in a fragile alliance. The purpose of the Pact: To hold back the waves of invaders that seek to destroy you. Outside the lands of the Pact, there are limitless threats.You are a servant of Avadon. The Black Fortress. Your job is to protect the Pact, five nations that have banded together in a fragile alliance. The purpose of the Pact: To hold back the waves of invaders that seek to destroy you. Outside the lands of the Pact, there are limitless threats. Barbarians. Fading, jealous empires. Titans and unspeakable horrors. The warriors and spies of Avadon are charged to keep them at bay, weak and divided. You fight in the shadows, rooting out small threats before they have the chance to grow. Your resources are unlimited, and your word is law. But a dark time is coming. Assassins are killing Avadon's warriors, and a hidden enemy plots to unite all of your homeland's foes. If you cannot discover and destroy this conspiracy, and soon, your people face total destruction. But beware. The defenders of Avadon are being picked off, one by one, and you are the next target.… Expand"}, {"name": "Nanostray 2", "details_link": "https://www.metacritic.com/game/ds/nanostray-2", "publisher": "Majesco Games", "release_date": "Mar 11 2008", "developers": ["Shin'en"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/6a9f0c7f16b58d9ed082129310227003-98.jpg", "descriptions": "Configure your own powerful weapons and master over 30 challenges to unlock more action.  Discover beautiful worlds and frightening bosses in the most intense shooter available on the DS! Adventure: Unravel the story behind the mysterious Nanostray virus while experiencing beautifulConfigure your own powerful weapons and master over 30 challenges to unlock more action.  Discover beautiful worlds and frightening bosses in the most intense shooter available on the DS! Adventure: Unravel the story behind the mysterious Nanostray virus while experiencing beautiful cutscenes, extensive voice acting and new special effects. Arcade: Play through all Adventure Mode levels without the story.  Added combos and extra statistics enable maximum high scores each time you play. Challenge: Master 32 challenges, each located in a unique environment.  Complete a set of 8 challenges to unlock one of the four Simulator games. Simulator: Designed in a unique futuristic style, each of the four games is a completely new experience of arcade-style, high score hunting. Two Player Cooperative play (multi-card). Two Player Duel (single and multi-card). Blast your way through more than 16 gigantic bosses, 100 unique enemies and seemingly impassable obstacles. Unlock and configure your ship’s six different weapons to adapt your armaments to a particular challenge. Choose from three control styles: Classic (no Touch Screen necessary), Left Handed or Right Handed Touch Control. Compete in the N2 Championship. Upload and browse your scores online with the Nintendo Wifi connection to see how you rank against the best. Alternating vertical and horizontal view level styles add to the rich gameplay. All new Nanogauge lets you earn multiplier bonuses for each enemy shot. Fill the gauge as you eliminate swarms of enemies simultaneously. Features more than 30 energetic songs and over 200 unique sound effects. [Majesco Games]… Expand"}, {"name": "NHL 2K6", "details_link": "https://www.metacritic.com/game/xbox-360/nhl-2k6", "publisher": "2K Sports", "release_date": "Nov 16 2005", "developers": ["2K Sports"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 75, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/5704b34f346114bd4fcf7a4585d2ad3b-98.jpg", "descriptions": "ProControl - Play like the pros with our revolutionary icon-based passing system. All-new combo passing and shooting controls let you queue up give-and-go attacks, tic-tac-toe passing, puck cycling, behind the net plays and more. PureMotion Animations - Hundreds of new NHL-caliber animationsProControl - Play like the pros with our revolutionary icon-based passing system. All-new combo passing and shooting controls let you queue up give-and-go attacks, tic-tac-toe passing, puck cycling, behind the net plays and more. PureMotion Animations - Hundreds of new NHL-caliber animations to feast your eyes on including spectacular saves in goal by Marty Turco. On-The-Fly Coaching - Play your style of hockey at both ends of the ice by calling team strategy during the action. Crash the net, screen the goalie and pinch defensemen on offense. Then, counter the attack by clearing the crease, clearing the zone, or setting up a break out for an offensive rush. Enforcer System - Throw opponents off their game by bringing out your checking line. Now, bigger and more aggressive players weigh into the outcome of a game as much as your leading goal scorers, as physical play will lower opponents’ performance ratings. Maximum Goaltending - Take matters into your own hands by utilizing your right analog stick to make quick, intuitive saves when it counts the most. [2K Games]… Expand"}, {"name": "Command & Conquer: Renegade", "details_link": "https://www.metacritic.com/game/pc/command-conquer-renegade", "publisher": "Electronic Arts", "release_date": "Feb 27 2002", "developers": ["Westwood Studios"], "platforms": "PC", "num_players": "1-64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/f25cebff5c0e8bed924aaada3b9875a5-98.jpg", "descriptions": "For the first time, experience the Command and Conquer universe up close and personal as you fight it out on the ground among the structures, vehicles and weapons made famous in the original C&C. You assume the role of Havoc, elite GDI commando who fights and explores from a first orFor the first time, experience the Command and Conquer universe up close and personal as you fight it out on the ground among the structures, vehicles and weapons made famous in the original C&C. You assume the role of Havoc, elite GDI commando who fights and explores from a first or third-person viewpoint. Battling through exotic indoor and outdoor environments, you're free to use both brute force and stealth in your mission objectives against the evil Brotherhood of Nod. [Electronic Arts]… Expand"}, {"name": "After Burner Climax", "details_link": "https://www.metacritic.com/game/playstation-3/after-burner-climax", "publisher": "Sega", "release_date": "Apr 22 2010", "developers": ["Sega AM2"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 75, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/5/4d1500380926384e7df2196dc8fb357a-98.jpg", "descriptions": "[Playstation Network]  The classic arcade game After Burner has now returned for a new generation of gamers. After Burner Climax is fast and frantic action, putting you in the cockpit of the world’s fastest fighter plane. Dodge planes, rockets and bullets while trying to target multiple[Playstation Network]  The classic arcade game After Burner has now returned for a new generation of gamers. After Burner Climax is fast and frantic action, putting you in the cockpit of the world’s fastest fighter plane. Dodge planes, rockets and bullets while trying to target multiple on-screen enemy aircraft. Built for all skill levels, everyone will be able to take to the air and blaze through a branching storyline and over 20 stages. Unlock achievements along the way to unlock exclusive Avatar Awards using your experience and expertise. [Sega]… Expand"}, {"name": "Rick and Morty: Virtual Rick-ality", "details_link": "https://www.metacritic.com/game/pc/rick-and-morty-virtual-rick-ality", "publisher": "Adult Swim", "release_date": "Apr 15 2017", "developers": ["Owlchemy Labs"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "General", "3D", "First-Person"], "meta_score": 75, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/5a430403fe214b28a741e3bd8d40f468-98.jpg", "descriptions": "Rick and Morty have teleported into your living room for a cutting-edge VR adventure from Adult Swim Games and Owlchemy Labs (Job Simulator). Play as a Morty clone as you explore Rick's garage, the Smith household, and alien worlds. Experience life as a clone of Morty and all the trauma thatRick and Morty have teleported into your living room for a cutting-edge VR adventure from Adult Swim Games and Owlchemy Labs (Job Simulator). Play as a Morty clone as you explore Rick's garage, the Smith household, and alien worlds. Experience life as a clone of Morty and all the trauma that comes with it. Step through portals to strange worlds, help Rick with his bizarre experiments, and use your hands in VR to pick up and play in an interaction-filled 3D Rick-ality. Follow Rick's directions (or don't!) to solve puzzles and complete missions in this fully voice acted adventure.… Expand"}, {"name": "Strange Brigade", "details_link": "https://www.metacritic.com/game/xbox-one/strange-brigade", "publisher": "Rebellion", "release_date": "Aug 28 2018", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 75, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/dd1f4447dfc61b7ce75cb5244bf09ceb-98.jpg", "descriptions": "Egypt, the 1930's. Erased from ancient history and buried in a nameless tomb for 4,000 years, Seteki the Witch Queen has risen once again. Only one troop of daring heroes can stand against the fearsome power of Seteki and her army of mummified monstrosities: The Strange Brigade!ExploreEgypt, the 1930's. Erased from ancient history and buried in a nameless tomb for 4,000 years, Seteki the Witch Queen has risen once again. Only one troop of daring heroes can stand against the fearsome power of Seteki and her army of mummified monstrosities: The Strange Brigade!Explore remarkable ruins, solve perilous puzzles and uncover tantalising treasure while blasting your way through an array of undead enemies in thrilling third-person action that's certain to bring out your inner adventurer!… Expand"}, {"name": "SUPERHOT VR", "details_link": "https://www.metacritic.com/game/playstation-4/superhot-vr", "publisher": "SUPERHOT", "release_date": "Jul 21 2017", "developers": ["SUPERHOT"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/288c8f7fb239ce883e88239533213e95-98.jpg", "descriptions": "After years of experiments and iterations, the team behind the critically acclaimed, violently beautiful time-bending shooter SUPERHOT is ready to unveil it’s newest creation. SUPERHOT VR is a title reimagined and redesigned from the ground up for VR and hand tracking controllers."}, {"name": "Panzer General: Allied Assault", "details_link": "https://www.metacritic.com/game/xbox-360/panzer-general-allied-assault", "publisher": "Ubisoft", "release_date": "Oct 21 2009", "developers": ["Petroglyph"], "platforms": "Xbox 360", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "General"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/83c790fbcea2109e7e47e02f958e80e4-98.jpg", "descriptions": "[Xbox Live Arcade]  Panzer General is back with an all-new turn-based strategy game in Panzer General: Allied Assault! For the first time on Xbox LIVE® Arcade, recreate actual battles during the last phase of World War II and experience the dramatic events of D-Day as they unfold in your[Xbox Live Arcade]  Panzer General is back with an all-new turn-based strategy game in Panzer General: Allied Assault! For the first time on Xbox LIVE® Arcade, recreate actual battles during the last phase of World War II and experience the dramatic events of D-Day as they unfold in your hands. Build, customize, and fight with your personalized deck of 60 cards. Play with a friend in multiplayer mode, gain access to special units and cards, and become a Panzer General. [Ubisoft]… Expand"}, {"name": "The Surge 2", "details_link": "https://www.metacritic.com/game/playstation-4/the-surge-2", "publisher": "Focus Home Interactive", "release_date": "Sep 24 2019", "developers": ["Deck 13"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/5128f5d9028e445be4881bc1d5ce4195-98.jpg", "descriptions": "[OVERCOME]On the way to Jericho City, your plane is shot down by a mysterious storm and crash-lands in the outskirts. You wake up weeks later in a derelict detention facility inside the city. Armor-clad soldiers enforce Martial Law, robots are on a rampage, and a dark, expanding nanostorm[OVERCOME]On the way to Jericho City, your plane is shot down by a mysterious storm and crash-lands in the outskirts. You wake up weeks later in a derelict detention facility inside the city. Armor-clad soldiers enforce Martial Law, robots are on a rampage, and a dark, expanding nanostorm looms over the cityscape...[SURVIVE]In a bid to survive, explore the sprawling, devastated city of Jericho. Fight its numerous, ferocious threats in brutal, unforgiving combat, slashing and tearing the limbs off your opponents to steal valuable equipment that will make you stronger - strong enough to face the most fearsome, imposing foes lurking in the city.[UPGRADE]With an expanded arsenal of weapons, armors, abilities, implants, and drones to build your character, and a bigger, more varied and more ambitious world, The Surge 2 challenges you to survive and unravel its hidden secrets.* Hardcore, brutal melee combat* Face deadly foes and colossal bosses* Cut off parts of the enemy you want to loot* Rich character progression and customization… Expand"}, {"name": "PowerWash Simulator", "details_link": "https://www.metacritic.com/game/playstation-5/powerwash-simulator", "publisher": "Square Enix", "release_date": "Jan 31 2023", "developers": ["FuturLab"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 6 ", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 75, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/3/fc7f50b1b4d72338b250298e0694c8e0-98.jpg", "descriptions": "Release the Pressure with PowerWash Simulator! Wash away your worries with the soothing sounds of high-pressure water. Fire up your power washer and blast away every speck of dirt and grime you can find, all with the simple satisfaction of power-washing to a sparkling finish. Build up yourRelease the Pressure with PowerWash Simulator! Wash away your worries with the soothing sounds of high-pressure water. Fire up your power washer and blast away every speck of dirt and grime you can find, all with the simple satisfaction of power-washing to a sparkling finish. Build up your business in Career Mode and complete a variety of dirty jobs across the dusty town of Muckingham. There's no right or wrong; no time pressure or final score, just you and the tools you need to soak away your stress. Want a clean start? Chill out and replay your favourite jobs in Free Play.… Expand"}, {"name": "The Jackbox Party Pack 7", "details_link": "https://www.metacritic.com/game/xbox-one/the-jackbox-party-pack-7", "publisher": "Jackbox Games, Inc.", "release_date": "Oct 15 2020", "developers": ["Jackbox Games", "Inc."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/7d68084b1bac83c8b601395c612e70fa-98.jpg", "descriptions": "Five new games: the hit threequel Quiplash 3, the collaborative chaos of The Devils and the Details, the fierce drawing game Champ’d Up, the speech game Talking Points and the guessing game Blather 'Round. Use phones or tablets as controllers and play with up to 8 players, and an audience ofFive new games: the hit threequel Quiplash 3, the collaborative chaos of The Devils and the Details, the fierce drawing game Champ’d Up, the speech game Talking Points and the guessing game Blather 'Round. Use phones or tablets as controllers and play with up to 8 players, and an audience of 10,000.… Expand"}, {"name": "Vigil: The Longest Night", "details_link": "https://www.metacritic.com/game/pc/vigil-the-longest-night", "publisher": "Glass Heart Games", "release_date": "Oct 14 2020", "developers": ["Glass Heart Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/f3d0e752754660986cffdfa0239f434e-98.jpg", "descriptions": "Battle through the longest night as Leila a member of the Vigilant Order and uncover the truth behind the eternal darkness, Leila's mysterious sister, and the eldritch horrors that stalk her in a world that has forgotten daylight."}, {"name": "Hoard", "details_link": "https://www.metacritic.com/game/playstation-3/hoard", "publisher": "Big Sandwich Games, Inc.", "release_date": "Nov  2 2010", "developers": ["Big Sandwich Games", "Inc."], "platforms": ["PC", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Strategy", "General", "Real-Time", "General"], "meta_score": 75, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/7547817eb32e46abe625ce64a26acb6c-98.jpg", "descriptions": "HOARD™ is an arcade action-strategy score attack game in which you play a dragon intent on ransacking a medieval kingdom to gather a giant hoard of glittering gold.  You must scare towns, kidnap princesses, burn knights, and even topple berserk giants. Let no obstacle prevent you from yourHOARD™ is an arcade action-strategy score attack game in which you play a dragon intent on ransacking a medieval kingdom to gather a giant hoard of glittering gold.  You must scare towns, kidnap princesses, burn knights, and even topple berserk giants. Let no obstacle prevent you from your treasure hoarding!… Expand"}, {"name": "Scribblenauts Unlimited", "details_link": "https://www.metacritic.com/game/pc/scribblenauts-unlimited", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 19 2012", "developers": ["5TH Cell"], "platforms": ["3DS", "iPhone/iPad", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/04a9ab826fa9bcfb5e07f2113f5318c3-98.jpg", "descriptions": "Scribblenauts Unlimited features a huge side-scrolling open world where you can help the game's hero, Maxwell, solve robust puzzles and challenges"}, {"name": "Activision Hits Remixed", "details_link": "https://www.metacritic.com/game/psp/activision-hits-remixed", "publisher": "Activision", "release_date": "Nov  8 2006", "developers": ["Digital Eclipse"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 75, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/5aee5c42887dffe675d3f49248eb7ac7-98.jpg", "descriptions": "Activision Hits Remixed lets PSP system gamers relive the dawn of home console gaming while on the go by delivering over 40 of the biggest Atari 2600 titles, such as Pitfall, Kaboom!, Chopper Command, Stampede, Keystone Kapers, to the PSP.  With the game's multi-player supported classics,Activision Hits Remixed lets PSP system gamers relive the dawn of home console gaming while on the go by delivering over 40 of the biggest Atari 2600 titles, such as Pitfall, Kaboom!, Chopper Command, Stampede, Keystone Kapers, to the PSP.  With the game's multi-player supported classics, players can choose whether they want to game together utilizing a Game Share feature that allows two friends to play together using only one copy of the game or take turns on one PSP system or play via the game’s wireless functionality. Activision Hits Remixed also features a rockin' 80’s themed soundtrack, modernized front-end graphics, classic game manuals which include tips and photographs, and a host of retro unlockables. [Activision]… Expand"}, {"name": "Mega Man X Collection", "details_link": "https://www.metacritic.com/game/gamecube/mega-man-x-collection", "publisher": "Capcom", "release_date": "Jan 10 2006", "developers": ["Capcom"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/1/83572cea7196ea5278fccf6f450c7648-98.jpg", "descriptions": "You can relive the classic Mega Man X series in the seven-game compilation Mega Man X Collection. Mega Man X is the series of 2D platformer Mega Man games featuring the game's namesake and his partner, the sword-wielding Zero. The collection features Mega Man X through X6, as well as theYou can relive the classic Mega Man X series in the seven-game compilation Mega Man X Collection. Mega Man X is the series of 2D platformer Mega Man games featuring the game's namesake and his partner, the sword-wielding Zero. The collection features Mega Man X through X6, as well as the North American debut of Mega Man Battle & Chase, the only Mega Man racing game. In addition to the classic titles, the collection features remixed soundtracks, sketch art, and other Mega Man goodies. … Expand"}, {"name": "The Lord of the Rings, The Third Age", "details_link": "https://www.metacritic.com/game/xbox/the-lord-of-the-rings-the-third-age", "publisher": "EA Games", "release_date": "Nov  2 2004", "developers": ["EA Games"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/22c8dec14c731431bb9cf3f821c52178-98.jpg", "descriptions": "In The Lord of the Rings: The Third Age, you can travel in the wake of the Fellowship while exploring your own path and periodically intersecting the major events of the film trilogy. Through both familiar and new locations, you must fight to save or destroy Middle-earth in an epicIn The Lord of the Rings: The Third Age, you can travel in the wake of the Fellowship while exploring your own path and periodically intersecting the major events of the film trilogy. Through both familiar and new locations, you must fight to save or destroy Middle-earth in an epic adventure. Encounter the demonic Balrog in the Mines of Moria, defend the fallen city of Osgiliath, or try to destroy Helm's Deep. These choices and many more will confront you as you align yourself with the people of Middle-earth or undertake missions on behalf of Sauron.… Expand"}, {"name": "Mario Kart Live: Home Circuit", "details_link": "https://www.metacritic.com/game/switch/mario-kart-live-home-circuit", "publisher": "Nintendo", "release_date": "Oct 16 2020", "developers": ["Nintendo", "Velan Studios"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/1d2b1af3e2cae8e4a24a1c93e2390e3a-98.jpg", "descriptions": "Control a real-life Mario Kart with Nintendo Switch and watch it come to life in the game. Race a real-world Mario Kart™ through your home! Use the Nintendo Switch™ system to control your kart and watch as it reacts to what’s happening in the game as you boost and drift to victory. YourControl a real-life Mario Kart with Nintendo Switch and watch it come to life in the game. Race a real-world Mario Kart™ through your home! Use the Nintendo Switch™ system to control your kart and watch as it reacts to what’s happening in the game as you boost and drift to victory. Your in-home course comes to life on-screen with a view from right behind the driver’s seat.… Expand"}, {"name": "Kenshi", "details_link": "https://www.metacritic.com/game/pc/kenshi", "publisher": "Lo-Fi Games", "release_date": "Dec  6 2018", "developers": ["Lo-Fi Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General"], "meta_score": 75, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/24404861d9a3a85f46667fbdcef4ae09-98.jpg", "descriptions": "A free-roaming squad based RPG. Focusing on open-ended sandbox gameplay features rather than a linear story. Be a trader, a thief, a rebel, a warlord, an adventurer, a farmer, a slave, or just food for the cannibals. Research new equipment and craft new gear."}, {"name": "Tempest 4000", "details_link": "https://www.metacritic.com/game/xbox-one/tempest-4000", "publisher": "Nighthawk Interactive", "release_date": "Jul 17 2018", "developers": ["Llamasoft"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/a5d12f87cbc866a3870710e81a186798-98.jpg", "descriptions": "Tempest 4000 is a visually stunning, action-packed tube shooter based on the classic hit arcade game Tempest."}, {"name": "Watch Dogs 2", "details_link": "https://www.metacritic.com/game/pc/watch-dogs-2", "publisher": "Ubisoft", "release_date": "Nov 28 2016", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "genres": ["Action Adventure", "Open-World"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/5a9d98c607b99f6fb49e25a48fa7e260-98.jpg", "descriptions": "Check out the birthplace of the tech revolution as Marcus Holloway, a brilliant young hacker who has fallen victim to ctOS 2.0's predictive algorithms and accused of a crime he did not commit. In Marcus' mission to shut down ctOS 2.0 for good, hacking is his ultimate weapon.  Players notCheck out the birthplace of the tech revolution as Marcus Holloway, a brilliant young hacker who has fallen victim to ctOS 2.0's predictive algorithms and accused of a crime he did not commit. In Marcus' mission to shut down ctOS 2.0 for good, hacking is his ultimate weapon.  Players not only can hack into the San Francisco Bay Area's infrastructure, but also into every person and any connected device they possess to trigger unpredictable chains of events in this vast open world. … Expand"}, {"name": "Killing Floor 2", "details_link": "https://www.metacritic.com/game/pc/killing-floor-2", "publisher": "Tripwire Interactive", "release_date": "Nov 18 2016", "developers": ["Tripwire Interactive"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Sci-Fi", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/e3e37039b76a5596988c1b5ccc8783bb-98.jpg", "descriptions": "In KILLING FLOOR 2 players descend into continental Europe where the outbreak caused by Horzine Biotechâ€™s failed experiment has quickly spread and gained unstoppable momentum, essentially paralyzing the European Unionâ€” Just one month after the events in the original KILLING FLOOR, theIn KILLING FLOOR 2 players descend into continental Europe where the outbreak caused by Horzine Biotechâ€™s failed experiment has quickly spread and gained unstoppable momentum, essentially paralyzing the European Unionâ€” Just one month after the events in the original KILLING FLOOR, the specimen clones are everywhere and civilization is in disarray; communications have failed, governments have collapsed, and military forces have been systematically eradicated. The people of Europe know survival and self-preservation too well and lucky survivors have gone into hiding.… Expand"}, {"name": "Back to the Future: The Game - Episode I: It's About Time", "details_link": "https://www.metacritic.com/game/playstation-3/back-to-the-future-the-game---episode-i-its-about-time", "publisher": "Telltale Games", "release_date": "Feb 15 2011", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action Adventure", "Adventure", "Sci-Fi", "Sci-Fi", "3D", "Third-Person"], "meta_score": 75, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/10eed8b95572f0bd86b72a0021d881c2-98.jpg", "descriptions": "Telltale Games, the studio behind Tales of Monkey Island and the Sam & Max episodes, turns cult time-travel flick Back to the Future into an episodic adventure."}, {"name": "Star Wars: Empire at War: Forces of Corruption", "details_link": "https://www.metacritic.com/game/pc/star-wars-empire-at-war-forces-of-corruption", "publisher": "LucasArts", "release_date": "Oct 24 2006", "developers": ["Petroglyph"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 75, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/13a1976dd612ba962a871cb49c0bdbb0-98.jpg", "descriptions": "Empire at War let gamers play the light side or the dark side in an epic Galactic Civil War. Now, for the first time ever, Star Wars Empire at War: Forces of Corruption introduces a unique point of view – the corrupt side. The Rebels have just destroyed the Death Star, and the galaxy is inEmpire at War let gamers play the light side or the dark side in an epic Galactic Civil War. Now, for the first time ever, Star Wars Empire at War: Forces of Corruption introduces a unique point of view – the corrupt side. The Rebels have just destroyed the Death Star, and the galaxy is in turmoil. As an aspiring Underworld figure named Tyber Zann, spread corruption throughout the galaxy using new strategic gameplay elements to influence other factions, steal their funds, slow their production, spy on them and more, all en route to becoming the most notorious criminal leader since Jabba the Hutt. New land-tactical options like customizable, upgradeable bases and guerilla warfare allow for innovative battlefield tactics. Take command of and confront new fighting units for all factions (Rebel B-wings, Imperial TIE interceptors, Darth Vader's Executor Super Star Destroyer and more), and take down anyone who stands in your way of ruling the Underworld, be they new battlefield heroes like Luke Skywalker and Yoda or the forces of your most bitter rival – Jabba. Destroy capital ships with the awesome firepower of the second Death Star, and satiate Tyber's drive for the deadliest capital ship in the galaxy, a devastatingly powerful Super Star Destroyer known as the Eclipse. [LucasArts]… Expand"}, {"name": "Battalion Wars 2", "details_link": "https://www.metacritic.com/game/wii/battalion-wars-2", "publisher": "Nintendo", "release_date": "Oct 29 2007", "developers": ["Kuju Entertainment"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Military", "Military", "Tactics"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/4a499443bcbf5b57a66f72eb9049ecce-98.jpg", "descriptions": "Tricked into believing that the Solar Empire is developing a devastating super-weapon, Commander Pierce and Colonel Windsor of the Anglo Isles launch a pre-emptive strike on the Coral Atolls. The world is once again at war. New naval units, new vehicles and loads of missions makes this anTricked into believing that the Solar Empire is developing a devastating super-weapon, Commander Pierce and Colonel Windsor of the Anglo Isles launch a pre-emptive strike on the Coral Atolls. The world is once again at war. New naval units, new vehicles and loads of missions makes this an explosive Wii debut. Giving Gamers Total Control: Players drive tanks, command ships, pilot planes and direct their troops into the heart of the action in the return of the popular tactical action game for Wii. Online Multiplayer: The battle wages online in three modes: Assault, Skirmish and Co-op. Fight with or against others in land, sea and air combat. Precision Fighting: Wii Remote controller provides intuitive, precise control to bring out the action of this tactical thrillfest. The tactical depth, replay value and online game play makes this a must-have game. [Nintendo]… Expand"}, {"name": "Jet Set Radio", "details_link": "https://www.metacritic.com/game/playstation-3/jet-set-radio", "publisher": "Sega", "release_date": "Sep 18 2012", "developers": ["Sega"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/f7118df276c83eb7f01002fbfdd91ef1-98.jpg", "descriptions": "Jet Set Radio lets players join the GGs, an up-and-coming street gang in the futuristic city of Tokyo-to, fighting for the right to self-expression against an overbearing, corporate-controlled police force. Rolling and leaping through crowded urban environments on magnetically driven inlineJet Set Radio lets players join the GGs, an up-and-coming street gang in the futuristic city of Tokyo-to, fighting for the right to self-expression against an overbearing, corporate-controlled police force. Rolling and leaping through crowded urban environments on magnetically driven inline skates, players take control of gang leader Beat and his growing posse of deviant artists as they steal turf from the local gangs by covering the city with colorful graffiti. Guided by Professor K, DJ for the hottest pirate broadcast in town - \"Jet Set Radio\" - the GGs will ultimately uncover the sinister plot hatched by the controlling powers of Tokyo-to.… Expand"}, {"name": "Overlord II", "details_link": "https://www.metacritic.com/game/xbox-360/overlord-ii", "publisher": "Codemasters", "release_date": "Jun 23 2009", "developers": ["Triumph Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/91f48d2fdbb22b24bdd97b78cf5a01eb-98.jpg", "descriptions": "Overlord II is the sequel to the warped fantasy action adventure that had players being delightfully despotic. In Overlord II, a new Overlord and a more powerful army of Minions take on an entire empire in a truly epic adventure, inspired by the rise of the Roman Empire. As the GloriousOverlord II is the sequel to the warped fantasy action adventure that had players being delightfully despotic. In Overlord II, a new Overlord and a more powerful army of Minions take on an entire empire in a truly epic adventure, inspired by the rise of the Roman Empire. As the Glorious Empire conquers kingdoms and destroys any sign of magic it finds, it's time to go Minion Maximus and send in the horde. The Minions return smarter, deadlier (and funnier) and are ready to fight in large scale battles that will see their wild pack mentality squaring up to the organised legions of the Glorious Empire. As ever, they'll do anything and everything the Overlord commands of them, especially now that they can run ravage and wreck buildings and scenery. They've also learned how to ride: In Overlord II Minions mount up and ride wolves and other magical creatures around the landscape and take them into battle, making our band of merry fighters faster and fiercer than ever before. [Codemasters]… Expand"}, {"name": "Plants vs Zombies: Garden Warfare", "details_link": "https://www.metacritic.com/game/playstation-4/plants-vs-zombies-garden-warfare", "publisher": "Electronic Arts", "release_date": "Aug 19 2014", "developers": ["PopCap"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 24 ", "genres": ["Action", "General", "Shooter", "Third-Person", "Tactical"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/1cd61496d70f74a2e8f5bf3594648325-98.jpg", "descriptions": "Plants vs. Zombies is digging into the trenches with an explosive new 3D experience. Blast zombies, plants, and new characters with inventive weapons across a mine-blowing PvZ world. Take on Co-Op and Multiplayer action with your friends and sow the seeds of victory!"}, {"name": "Worms", "details_link": "https://www.metacritic.com/game/xbox-360/worms", "publisher": "Microsoft Game Studios", "release_date": "Mar  7 2007", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "Fantasy", "Artillery"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/a874623b0eb841955d1627a1622e4beb-98.jpg", "descriptions": "[Xbox Live Arcade] Worms is a turn-based strategy game in which teams of heavily armed worms battle across bizarre, randomly generated landscapes for supremacy. Each team takes turns picking off opposing team members using crazy weapons, tools and other utilities along with whatever foul[Xbox Live Arcade] Worms is a turn-based strategy game in which teams of heavily armed worms battle across bizarre, randomly generated landscapes for supremacy. Each team takes turns picking off opposing team members using crazy weapons, tools and other utilities along with whatever foul strategies they can devise. The simple and cute appearance belies the deep strategy of a game that is easy to play but difficult to master. A mix of strategy and arcade action that, although simple to understand, contains real depth and massive re-playability. Turn-based multiplayer action for up to four players locally or over Xbox Live. An assortment of game options: Landscape on which to do battle, Turn and round times, Starting weapon arsenal for each team, Three detailed tutorials to introduce the mechanics to first-time players, Twenty increasingly difficult single-player challenges, Three graphical themes for play, A random landscape generator to ensure that no two landscapes are ever the same, Twenty-two weapons and utilities to deploy against your enemies, Many customisable elements, including what worms and teams are named, what worms say, and which gravestone they have when they die, Twelve achievements, Weekly, monthly and overall leaderboards. [Microsoft]… Expand"}, {"name": "We Are OFK", "details_link": "https://www.metacritic.com/game/pc/we-are-ofk", "publisher": "Team OFK", "release_date": "Aug 18 2022", "developers": ["Team OFK"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/0e9e4ee17cfade8346f1fd5d43ec73a9-98.jpg", "descriptions": "Itsumi Saito just moved Downtown and broke up with her long-term girlfriend, leaning into her dream of making it in music. But juggling practice, friends, a brutal commute to the west side, and a full-time job... Itsu is struggling to establish herself in the cutthroat music scene of LA.Itsumi Saito just moved Downtown and broke up with her long-term girlfriend, leaning into her dream of making it in music. But juggling practice, friends, a brutal commute to the west side, and a full-time job... Itsu is struggling to establish herself in the cutthroat music scene of LA. When she talks her way into a shmoozy Hollywood party and makes friends with a rising music producer, she sees a chance to bring her dreams a little closer.We Are OFK is an interactive narrative series of arguing over lyrics, sending sad texts, and playing Interactive Music Videos, including OFK's debut single \"Follow/Unfollow\" and more!… Expand"}, {"name": "Pokemon Sword / Shield: The Crown Tundra", "details_link": "https://www.metacritic.com/game/switch/pokemon-sword-shield-the-crown-tundra", "publisher": "Nintendo", "release_date": "Oct 22 2020", "developers": ["Game Freak"], "platforms": "Switch", "genres": ["Role-Playing", "Trainer"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/2f46ef57335fc0c483b76fce3d76a0b8-98.jpg", "descriptions": "THE CROWN TUNDRA\r The Crown Tundra expansion is set in the snow-swept realm of The Crown Tundra. See for yourself the beautiful scenery of this shining, silvery landscape! In this frigid area, with its jagged winter mountains, people live in small communities where they support and rely onTHE CROWN TUNDRA\r The Crown Tundra expansion is set in the snow-swept realm of The Crown Tundra. See for yourself the beautiful scenery of this shining, silvery landscape! In this frigid area, with its jagged winter mountains, people live in small communities where they support and rely on one another. A certain person will appoint you as the leader of their exploration team in The Crown Tundra. You'll then be tasked with investigating the reaches of this frozen land. And remember the Pokémon Dens that you've only been able to glimpse during Max Raid Battles? Well, now you'll be able to explore their full depths!… Expand"}, {"name": "Sparklite", "details_link": "https://www.metacritic.com/game/switch/sparklite", "publisher": "Merge Games", "release_date": "Nov 14 2019", "developers": ["Red Blue Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/f532378d5272d19c2ea17fe4ae9d1532-98.jpg", "descriptions": "Sparklite is an action-adventure set in the whimsical and ever-changing land of Geodia. Battle foes in top-down action using an arsenal of gadgets, guns, and gear. Explore dangerous corners of the procedurally generated world, take down titans of the mining industry, and harness the power ofSparklite is an action-adventure set in the whimsical and ever-changing land of Geodia. Battle foes in top-down action using an arsenal of gadgets, guns, and gear. Explore dangerous corners of the procedurally generated world, take down titans of the mining industry, and harness the power of Sparklite. Everything in the world of Geodia is tied together by Sparklite... it's the life force of the planet, and the inhabitants have learned how to channel it safely. The blue, glowing ore can be harnessed providing a low-level, rechargeable power source. Or, for those brave or greedy enough, it can be consumed for a surge of power with grave consequences. Geodia’s self-titled \"Baron\" has devised a plot to mine the world’s Sparklite core to meet his own ends. Mining Sparklite in large quantities, the Baron repurposes the ore to fuel his powerful war machines, but the pollution from the consumed Sparklite is corrupting the world. Animals have turned into violent monsters, and the environment is rotting away.… Expand"}, {"name": "Resident Evil 7: biohazard - End of Zoe", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-7-biohazard---end-of-zoe", "publisher": "Capcom", "release_date": "Dec 12 2017", "developers": ["Capcom"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/3affb9ef96485bdd0bafa36c2b6369f3-98.jpg", "descriptions": "Play as a previously unseen member of the Baker family in a shocking additional installment of their saga. Experience the wilder side of survival horror as you fight hand-to-hand with the horrific creatures dwelling in the swamps outside of the Baker estate. Discover the ultimate fate of ZoePlay as a previously unseen member of the Baker family in a shocking additional installment of their saga. Experience the wilder side of survival horror as you fight hand-to-hand with the horrific creatures dwelling in the swamps outside of the Baker estate. Discover the ultimate fate of Zoe and witness the end of the Baker family's tragic events. … Expand"}, {"name": "NHL 18", "details_link": "https://www.metacritic.com/game/playstation-4/nhl-18", "publisher": "Electronic Arts", "release_date": "Sep 12 2017", "developers": ["EA Sports"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 75, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/2/87a6b72c15d5acc3c3cacb9641f5d503-98.jpg", "descriptions": "NHL 18 is built to deliver the speed, skill, and creativity of today’s young new NHL through Creative Attack controls and the all-new Defensive Skill stick. The new 3-on-3 NHL THREES mode introduces fast-paced, arcade-inspired action and, in Franchise Mode, the Expansion Draft feature letsNHL 18 is built to deliver the speed, skill, and creativity of today’s young new NHL through Creative Attack controls and the all-new Defensive Skill stick. The new 3-on-3 NHL THREES mode introduces fast-paced, arcade-inspired action and, in Franchise Mode, the Expansion Draft feature lets fans be the first to play as the Vegas Golden Knights, or create and draft their very own 32nd NHL team from the ground up. All of these new features are delivered with the most ways to play multiplayer ever in an EA SPORTS NHL game. [Electronic Arts]… Expand"}, {"name": "Minecraft: Story Mode - Episode 3: The Last Place You Look", "details_link": "https://www.metacritic.com/game/xbox-one/minecraft-story-mode---episode-3-the-last-place-you-look", "publisher": "Telltale Games", "release_date": "Nov 24 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "Adventure", "General", "Point-and-Click", "Linear"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/46e551bdb77c6106e18f73276bd3dbac-98.jpg", "descriptions": "Minecraft: Story Mode is like a playable TV show based on the game, where YOU are the star, and your choices and actions decide how the story is told. You are Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your gang stumbles onMinecraft: Story Mode is like a playable TV show based on the game, where YOU are the star, and your choices and actions decide how the story is told. You are Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your gang stumbles on something dreadful. Terror is unleashed, and your only hope is to track down the “Order of the Stone”, a fabled group of adventurers who slew the legendary Ender Dragon. But where are they? In a race against time, you will travel across the over-world, through the Nether, to The End, and beyond. … Expand"}, {"name": "Reus", "details_link": "https://www.metacritic.com/game/pc/reus", "publisher": "Abbey Games", "release_date": "May 16 2013", "developers": ["Abbey Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/9cd3443c46d831d4f14996a22aa41a40-98.jpg", "descriptions": "Reus is a god game by Abbey Games in which you take control of nature through the hands of mighty giants. You possess all imaginable powers over nature! There is only one thing on the planet that you do not control: mankind, with all their virtues and and all their vices. You can shape theirReus is a god game by Abbey Games in which you take control of nature through the hands of mighty giants. You possess all imaginable powers over nature! There is only one thing on the planet that you do not control: mankind, with all their virtues and and all their vices. You can shape their world, but not their will. It’s your responsibility to maintain a balance in which man is not overpowered by nature, and nature does not fall to man’s greed.… Expand"}, {"name": "Black Mirror III: Final Fear", "details_link": "https://www.metacritic.com/game/pc/black-mirror-iii-final-fear", "publisher": "Viva Media", "release_date": "Apr 19 2011", "developers": ["DTP Entertainment", "Cranberry Production"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/b68bf0a7268d70e66655aeb54190385e-98.jpg", "descriptions": "Black Mirror III is the third installment in DTP Entertainment's series."}, {"name": "Sam & Max: Beyond Time and Space", "details_link": "https://www.metacritic.com/game/xbox-360/sam-max-beyond-time-and-space", "publisher": "Microsoft Game Studios", "release_date": "Oct 14 2009", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Adventure", "General", "3D", "Compilation", "Point-and-Click", "Third-Person"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/bd2087ae3615152789f7cda469abecef-98.jpg", "descriptions": "[Xbox Live Arcade]  Join the Freelance Police for a second season of adventure, crime fighting, and chaos. Sam & Max Beyond Time and Space starts with a giant robot attack and never lets up, taking our valiant crime fighters on a gut-wrenching mission from the North Pole to Easter Island,[Xbox Live Arcade]  Join the Freelance Police for a second season of adventure, crime fighting, and chaos. Sam & Max Beyond Time and Space starts with a giant robot attack and never lets up, taking our valiant crime fighters on a gut-wrenching mission from the North Pole to Easter Island, from outer space to Hell and back. Babies will dance. Mariachis will sing. A giant battle robot will trash the streets. And when their friends are caught in the middle, Sam & Max risk their very souls to set things right. Five episodes: In the award-winning second season of the episodic Sam & Max series, five full episodes take Sam & Max to Hell and back on a mission to save their friends -- and their very souls. [Telltale Games]… Expand"}, {"name": "Buzz! The Mega Quiz", "details_link": "https://www.metacritic.com/game/playstation-2/buzz!-the-mega-quiz", "publisher": "SCEA", "release_date": "Oct 30 2007", "developers": ["Relentless Software"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Trivia / Game Show"], "meta_score": 75, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/dc6356f79d454a165011464c981c0dfa-98.jpg", "descriptions": "The ratings just keep rising, so Buzz is back with a new general knowledge show to keep all quiz fiends satisfied. Buzz! The Mega Quiz is bursting with new videos, music and photos, and an all-new database of 5,000 questions. The studio and presentation have been spruced up and Buzz is justThe ratings just keep rising, so Buzz is back with a new general knowledge show to keep all quiz fiends satisfied. Buzz! The Mega Quiz is bursting with new videos, music and photos, and an all-new database of 5,000 questions. The studio and presentation have been spruced up and Buzz is just as stylish as always. New rounds have been added alongside some old favourites, with the finale revamped for an even more exciting conclusion. With all this, plus refined multiplayer features, this title is set to tax even the most hardened quiz fan. Featuring all-new round types, including Point Picker, Winner Stays On and The Final Countdown, Buzz has also worked with producers to develop \"Mystery Games\" - special rounds where he takes to centre stage and challenges the contestants to take him on. These special rounds give Buzz the opportunity to show off his multi-talented nature as a card shark, horse trainer and all-round raconteur. [SCEE]… Expand"}, {"name": "SkyGunner", "details_link": "https://www.metacritic.com/game/playstation-2/skygunner", "publisher": "Atlus Co.", "release_date": "Jun 24 2002", "developers": ["Pixel Arts"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/33f46ee88c4ac512c92527b7e4f3ed83-98.jpg", "descriptions": "Sky Gunner follows the story of 3 ace pilots, Ciel, Copain and Femme, who are hired to protect the \"Eternal Engine,\" an engine capable of perpetual motion. Little do they know, the criminal genius Ventre is planning to use the town's celebration aboard the luxury airship Merveilleux as anSky Gunner follows the story of 3 ace pilots, Ciel, Copain and Femme, who are hired to protect the \"Eternal Engine,\" an engine capable of perpetual motion. Little do they know, the criminal genius Ventre is planning to use the town's celebration aboard the luxury airship Merveilleux as an opportunity to steal the Eternal Engine for his own evil ends. [Atlus]… Expand"}, {"name": "Mario Tennis Aces", "details_link": "https://www.metacritic.com/game/switch/mario-tennis-aces", "publisher": "Nintendo", "release_date": "Jun 22 2018", "developers": ["Camelot Software Planning"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/a75273762a3e31908b7251f29279b1d7-98.jpg", "descriptions": "A new Mario Tennis game is bringing a new level of skill and competition to Nintendo Switch. Mario steps onto the court in classy tennis garb for intense rallies against a variety of characters in full-blown tennis battles. New wrinkles in tennis gameplay will challenge your ability to readA new Mario Tennis game is bringing a new level of skill and competition to Nintendo Switch. Mario steps onto the court in classy tennis garb for intense rallies against a variety of characters in full-blown tennis battles. New wrinkles in tennis gameplay will challenge your ability to read an opponent's position and stroke to determine which shot will give you the advantage. And this time the game adds the first story mode since the Mario Tennis game on Game Boy Advance, offering a new flavor of tennis gameplay, with a variety of missions, boss battles and more.… Expand"}, {"name": "Medal of Honor: Airborne", "details_link": "https://www.metacritic.com/game/playstation-3/medal-of-honor-airborne", "publisher": "Electronic Arts", "release_date": "Nov 19 2007", "developers": ["Electronic Arts"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/1037463347aebfa3f37ecfbad5364858-98.jpg", "descriptions": "Step into the boots of Boyd Travers, Private First Class of the 82nd Airborne Division and engage in battles throughout Europe. From rocky beginnings in Sicily to war-winning triumphs in Germany, each mission begins behind enemy lines, with an intense and fully interactive airdrop. YourStep into the boots of Boyd Travers, Private First Class of the 82nd Airborne Division and engage in battles throughout Europe. From rocky beginnings in Sicily to war-winning triumphs in Germany, each mission begins behind enemy lines, with an intense and fully interactive airdrop. Your ability to determine your own starting point dramatically changes the way each mission plays out. View the entire operation from the air, and then control your parachute to choose your landing spot. On the ground, gather your senses and assess the terrain. A wide variety of authentic, customizable weapons are at your disposal, each with distinct characteristics. Choose your path in this free roaming FPS environment. Medal of Honor Airborne also features exceptionally photo-realistic characters, adding to the intensity of the cinematic, story-driven game. [Electronic Arts]… Expand"}, {"name": "Tales of the Abyss", "details_link": "https://www.metacritic.com/game/3ds/tales-of-the-abyss", "publisher": "Namco Bandai Games", "release_date": "Feb 14 2012", "developers": ["Bandai Namco Games"], "platforms": ["PlayStation 2", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 75, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/1dcd6ab80bded7f952840857e9be5cfb-98.jpg", "descriptions": "Tales of the Abyss takes the PS2 classic and updates it for play on the Nintendo 3DS."}, {"name": "NHL 07", "details_link": "https://www.metacritic.com/game/xbox/nhl-07", "publisher": "EA Sports", "release_date": "Sep 12 2006", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/88547561d12ee6953e8ff557e8ff1b39-98.jpg", "descriptions": "The golden age of console hockey returns with NHL 07, featuring gameplay innovations that make players feel like they are actually on the ice. Featuring an unmatched level of freedom and control, NHL 07 allows hockey purists and casual fans alike to feel like they can play like a pro."}, {"name": "Dragon's Dogma", "details_link": "https://www.metacritic.com/game/xbox-360/dragons-dogma", "publisher": "Capcom", "release_date": "May 22 2012", "developers": ["Capcom"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Action RPG", "Action RPG"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/463203f05b418eab46f43b30162d8fe7-98.jpg", "descriptions": "A legend is born in this open-world adventure. Assume the role of the Arisen, a legendary hero in a land haunted by a feared, omnipotent dragon. As you fight to protect your homeland, you will pick up companions, make enemies, and find yourself embroiled in an even deeper mystery."}, {"name": "Second Sight", "details_link": "https://www.metacritic.com/game/xbox/second-sight", "publisher": "Codemasters", "release_date": "Sep 21 2004", "developers": ["Free Radical Design"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/39cc21eb38ddcf6162851e650a16e243-98.jpg", "descriptions": "Join John Vattic, a man endowed with psychic abilities, as he attempts to escape a US medical facility. As you discover more and more of John's psychic powers, you'll slowly uncover the events that landed him in the hands of the researchers. You'll gain access to a variety of psionicJoin John Vattic, a man endowed with psychic abilities, as he attempts to escape a US medical facility. As you discover more and more of John's psychic powers, you'll slowly uncover the events that landed him in the hands of the researchers. You'll gain access to a variety of psionic abilities (such as Psi-Blast, Telekinesis, Projection, and Charm) and powerful weapons (including handguns, tranquilizers, and machine guns). Complete your objectives using a combination of shooting action and stealth tactics. … Expand"}, {"name": "Red Faction: Armageddon", "details_link": "https://www.metacritic.com/game/pc/red-faction-armageddon", "publisher": "THQ", "release_date": "Jun  6 2011", "developers": ["Volition Inc."], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/5362b5921a0268bb25bb09c99ee0c378-98.jpg", "descriptions": "Half a century after the Red Faction resistance freed Mars, the red planet again becomes a battleground. Colonists struggle for survival in the underground mines after the surface is rendered uninhabitable. When Darius Mason, grandson of revolution heroes Alec Mason and Samanya, unknowinglyHalf a century after the Red Faction resistance freed Mars, the red planet again becomes a battleground. Colonists struggle for survival in the underground mines after the surface is rendered uninhabitable. When Darius Mason, grandson of revolution heroes Alec Mason and Samanya, unknowingly releases a long-dormant evil, Armageddon is unleashed on Mars. As settlements are torn asunder, only Darius and the Red Faction can save mankind. The battle will take them to the core of the storm-blasted planet through ice caves and lava flows until they are face to face against the unspeakable threat. Red Faction: Armageddon expands on the critically acclaimed, best-selling franchise with new, groundbreaking challenges. You are humanity's last hope for survival. … Expand"}, {"name": "Paper Mario: Sticker Star", "details_link": "https://www.metacritic.com/game/3ds/paper-mario-sticker-star", "publisher": "Nintendo", "release_date": "Nov 11 2012", "developers": ["Intelligent Systems"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Fantasy", "Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 75, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/3aa59f8260d4d3a68a8d226332a46067-98.jpg", "descriptions": "Paper Mario: Sticker Star is an epic new adventure, starring the\rMushroom Kingdom's most famous hero in an elaborate papercraft world. With the land packed full of stickers, Mario collect and uses them to fight off bad guys, uncover secrets, and more. Fans of the Paper Mario series willPaper Mario: Sticker Star is an epic new adventure, starring the\rMushroom Kingdom's most famous hero in an elaborate papercraft world. With the land packed full of stickers, Mario collect and uses them to fight off bad guys, uncover secrets, and more. Fans of the Paper Mario series will discover gameplay elements new to the franchise, while newer players will enjoy a craftastic new twist\ron their favorite Nintendo hero - only for Nintendo 3DS.… Expand"}, {"name": "We. The Revolution", "details_link": "https://www.metacritic.com/game/pc/we-the-revolution", "publisher": "Klabater", "release_date": "Mar 21 2019", "developers": ["Polyslash"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/1c7c8802c3878c6079d7e993548d4fce-98.jpg", "descriptions": "As a judge of the Revolutionary Tribunal, preside over complicated cases of ordinary citizens, dangerous criminals, and enemies of the revolution in revolutionary Paris. Make judgments, plot political intrigue, and try to not lose your own head."}, {"name": "Penny Arcade Adventures: Episode Two", "details_link": "https://www.metacritic.com/game/xbox-360/penny-arcade-adventures-episode-two", "publisher": "Hothead Games", "release_date": "Oct 29 2008", "developers": ["Hothead Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/8222b4134d5cdeee4aace590da76da40-98.jpg", "descriptions": "[Xbox Live Arcade]  The madcap Penny Arcade experience continues in Episode Two of the RPG-adventure game series Penny Arcade Adventures: On the Rain-Slick Precipice of Darkness! Jump right in with a fresh character and new customization options or carry over your look and stats from Episode[Xbox Live Arcade]  The madcap Penny Arcade experience continues in Episode Two of the RPG-adventure game series Penny Arcade Adventures: On the Rain-Slick Precipice of Darkness! Jump right in with a fresh character and new customization options or carry over your look and stats from Episode One. Plus, there are more puzzles, areas to explore, levels to gain, and new difficulty settings to make the journey more insane than ever before. Rejoin Gabe and Tycho to go crazy with a whole new episode, moving ever closer to solve the mystery in the heart of New Arcadia. Your hoe awaits! [Microsoft]… Expand"}, {"name": "Blade of Darkness (2001)", "details_link": "https://www.metacritic.com/game/pc/blade-of-darkness-2001", "publisher": "Codemasters", "release_date": "Feb 19 2001", "developers": ["Rebel Act Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 8 ", "genres": ["Role-Playing", "Action Adventure", "Fantasy", "General", "Fantasy", "Action RPG"], "meta_score": 75, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/5caba1a84068b7625d5d059f1b56751c-98.jpg", "descriptions": "Stunning, richly detailed fantasy world. Real-ime lighting casts eerie and terrifying shadows. Unrivaled blood and gore combat. Hack off an enemy's limb, then thrash him with it. Learn devastatingly fluid combo attacks and use them to slice your enemies to pieces.  [Codemasters]"}, {"name": "Unruly Heroes", "details_link": "https://www.metacritic.com/game/playstation-4/unruly-heroes", "publisher": "Magic Design Studios", "release_date": "May 28 2019", "developers": ["Magic Design Studios"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/daf6d5dae33d93cee2ac4084499c73b6-98.jpg", "descriptions": "Unruly Heroes is an action-adventure game inspired by the famous chinese legend ‘A journey to the west’ better known as the Monkey King Legend. Through this epic adventure, the game will make you live a fantastic and unforgettable experience. The game can be played in coop up to 4 players,Unruly Heroes is an action-adventure game inspired by the famous chinese legend ‘A journey to the west’ better known as the Monkey King Legend. Through this epic adventure, the game will make you live a fantastic and unforgettable experience. The game can be played in coop up to 4 players, but you can decide to play online in fierce Player vs Player modes. Who will be your favorite character?… Expand"}, {"name": "Sega Rally Revo", "details_link": "https://www.metacritic.com/game/playstation-3/sega-rally-revo", "publisher": "Sega", "release_date": "Oct  9 2007", "developers": ["SEGA Racing Studio"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Driving", "Racing", "Arcade", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/72abcbc398e398d97472b6348a7d24e8-98.jpg", "descriptions": "(Known as \"Sega Rally\" in the UK/EU)  With dynamically deformable terrain, proprietary next-generation graphics, realistic physics, and competitive bumper-to-bumper racing, Sega Rally Revo is a high-tempo driving experience that is every racing fan's driving fantasy. Vehicle selection(Known as \"Sega Rally\" in the UK/EU)  With dynamically deformable terrain, proprietary next-generation graphics, realistic physics, and competitive bumper-to-bumper racing, Sega Rally Revo is a high-tempo driving experience that is every racing fan's driving fantasy. Vehicle selection affects driving strategy in Sega Rally Revo, as race course surfaces dynamically deform upon repeated contact with vehicle tires and changing weather effects. Sega Rally Revo features a variety of fully deformable surfaces, from gravel-littered tracks and smooth tarmac roads, to snow-covered mountain passes. This means no two laps will be the same, and drivers can skillfully lower their lap times as they hurtle their chosen world-renowned rally vehicles down photo-realistic courses only made possible on next-generation hardware. Driving skills are also tested by Sega Rally Revo's advanced AI which allows NPC drivers to dynamically adapt their driving style to the varied racing surfaces. Players can enjoy a comprehensive single-player campaign as they travel the globe racing the best drivers in the world. The game also features online capabilities, with multiplayer splitscreen modes offering an extremely competitive rally experience against drivers around the world. [Sega]… Expand"}, {"name": "Saints Row IV: Re-Elected", "details_link": "https://www.metacritic.com/game/playstation-4/saints-row-iv-re-elected", "publisher": "Deep Silver", "release_date": "Jan 20 2015", "developers": ["Volition Inc."], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "Modern", "Open-World"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/8ec11d3165f8efd3ab43f13f0b0982e3-98.jpg", "descriptions": "Saints Row IV: Re-Elected + Gat out of Hell finds you leaping over buildings, singing songs, fight in a 2D side-scroller, cure cancer, save Santa Claus... all this and more awaits you when you play Saints Row IV: Re-Elected, a special bundle that includes Saints Row IV and all of its' DLC.Saints Row IV: Re-Elected + Gat out of Hell finds you leaping over buildings, singing songs, fight in a 2D side-scroller, cure cancer, save Santa Claus... all this and more awaits you when you play Saints Row IV: Re-Elected, a special bundle that includes Saints Row IV and all of its' DLC. After saving the world from a terrorist attack the leader of the 3rd Street Saints is elected to become President of the United States. Things go reasonably well for The President until an alien warlord named Zinyak attacks the white house and abducts his entire cabinet. Now stuck inside a reality bending simulation, the President and the Saints fight to save themselves, Earth, and the entire galaxy.… Expand"}, {"name": "Sonic Origins", "details_link": "https://www.metacritic.com/game/xbox-series-x/sonic-origins", "publisher": "Sega", "release_date": "Jun 23 2022", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/05ca2badc29690d00d0dc5137e464fe7-98.jpg", "descriptions": "Relive the classic collected adventures of Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic 3 & Knuckles, and Sonic CD in the newly remastered Sonic Origins! From the iconic Green Hill Zone to the treacherous Death Egg Robot, you'll speed down memory lane to thwart the sinister plans ofRelive the classic collected adventures of Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic 3 & Knuckles, and Sonic CD in the newly remastered Sonic Origins! From the iconic Green Hill Zone to the treacherous Death Egg Robot, you'll speed down memory lane to thwart the sinister plans of Doctor Robotnik in polished high definition! This latest version includes new areas to explore, additional animations, and a brand new Anniversary mode! Explore the classic Sonic titles in high-resolution, with all-new opening and ending animations for each title! New Unlockables: Complete various missions to collect coins to unlock new content, challenges, and Special Stages through the Museum. Classic and Anniversary Mode. Choose to Spin Dash your way through the numerous zones in Classic mode with the game's original resolution and limited lives, or the new Anniversary mode with unlimited lives and revamped fullscreen resolution.… Expand"}, {"name": "Voice of Cards: The Forsaken Maiden", "details_link": "https://www.metacritic.com/game/playstation-4/voice-of-cards-the-forsaken-maiden", "publisher": "Square Enix", "release_date": "Feb 17 2022", "developers": ["Square Enix", "A-lim"], "platforms": ["PC", "Switch", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 75, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/d066c69dd3a0cfae9de6c56456bea32f-98.jpg", "descriptions": "Set sail on a voyage to change destiny itself. Voice of Cards: The Forsaken Maiden is set on a remote chain of islands that have been protected by the maidens for generations, but which now face destruction. The hero of the story vows to save the islanders and sets sail for the high seas,Set sail on a voyage to change destiny itself. Voice of Cards: The Forsaken Maiden is set on a remote chain of islands that have been protected by the maidens for generations, but which now face destruction. The hero of the story vows to save the islanders and sets sail for the high seas, together with Laty, a girl who failed to become a maiden.\r The second game in the unique Voice of Cards series, where all elements are presented entirely through the medium of cards, in the tradition of tabletop RPGs and gamebooks.\r A touching tale set in a world of melancholic beauty, brought to you by YOKO TARO (Creative Director), Keiichi Okabe (Music Director) and Kimihiko Fujisaka (Character Designer).\r *This game is not a direct sequel to Voice of Cards: The Isle Dragon Roars. Both stories can be enjoyed as standalone game experiences.\r*This product is also included in other bundles sold separately. Please take care not to re-purchase the same content.\r* Please be aware that parts of the game which require an internet connection may cease to be supported at any point.… Expand"}, {"name": "Scott Pilgrim vs. the World: The Game - Complete Edition", "details_link": "https://www.metacritic.com/game/pc/scott-pilgrim-vs-the-world-the-game---complete-edition", "publisher": "Ubisoft", "release_date": "Jan 14 2021", "developers": ["Ubisoft", "Engine Software"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 75, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/e12e4510eb3e991df31809abb90fe9b2-98.jpg", "descriptions": "Play as Scott Pilgrim, Ramona Flowers, Stephen Stills, Knives Chau, and more. Level up your characters and unique abilities as you fight your way through waves tough enemies. Team up with 3 of your friends locally or online, combine your skills in battle or compete with them in awesomePlay as Scott Pilgrim, Ramona Flowers, Stephen Stills, Knives Chau, and more. Level up your characters and unique abilities as you fight your way through waves tough enemies. Team up with 3 of your friends locally or online, combine your skills in battle or compete with them in awesome mini-games to see who ends up on top! Can you defeat Ramona's League of Evil Exes as you try to win her heart? Epic battles with Lucas Lee, Gideon Graves, and more await Scott Pilgrim and his friends. Zombie hordes? Dodgeball? Battle Royale? Just a few of the things you'll find playing through this Complete Edition. Compete in sub-space mini-games, experience a killer soundtrack, and much more as you re-live the beloved story of Scott Pilgrim vs. the World.… Expand"}, {"name": "LEGO DC Super-Villains", "details_link": "https://www.metacritic.com/game/switch/lego-dc-super-villains", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 16 2018", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/831c71398581a25c326a8c9ebd9371b3-98.jpg", "descriptions": "It's good to be bad... Embark on an all new DC/LEGO adventure by becoming the best villain the universe has seen in LEGO DC Super-Villains. Players will have the ability to create and play as an all-new super-villain throughout the game, unleashing mischievous antics and wreaking havoc in anIt's good to be bad... Embark on an all new DC/LEGO adventure by becoming the best villain the universe has seen in LEGO DC Super-Villains. Players will have the ability to create and play as an all-new super-villain throughout the game, unleashing mischievous antics and wreaking havoc in an action-packed, hilarious story written in collaboration with DC. Set in an expansive, open world experience within the DC universe, the Justice League has disappeared, leaving Earth's protection to their counterparts from a parallel universe, who have proclaimed themselves as the Justice Syndicate'. It's up to you and a crazy group of misfits to uncover the intentions of Earth's new, strange, wannabe superheroes. Joined by renowned DC Super-Villains: The Joker, Harley Quinn, Lex Luthor, Deathstroke, Killer Frost, Sinestro, and countless others from the Injustice League, players will set out on an epic adventure to ensure their villainy remains unrivaled. … Expand"}, {"name": "Just Dance 2018", "details_link": "https://www.metacritic.com/game/playstation-4/just-dance-2018", "publisher": "Ubisoft", "release_date": "Oct 24 2017", "developers": ["Ubisoft Paris"], "platforms": ["PlayStation 3", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 75, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/ff4762c6b847e777b3ac439df5f22dfd-98.jpg", "descriptions": "No matter where you come from, how old you are, if you are a panda or a carrot: turn up the volume and get ready to unleash your inner dancer, because Just Dance 2018 brings out the dancer in everyone. Whether you are a party starter, a young dancer in the making or a pro dancer looking forNo matter where you come from, how old you are, if you are a panda or a carrot: turn up the volume and get ready to unleash your inner dancer, because Just Dance 2018 brings out the dancer in everyone. Whether you are a party starter, a young dancer in the making or a pro dancer looking for new challenges, it's never been so easy to Just Dance. Dance your heart out to 24K Magic by Bruno Mars, Side to Side by Ariana Grande ft. Nicki Minaj, The Way I Are (Dance With Somebody) by Bebe Rexha ft. Lil Wayne and Chantaje by Shakira ft. Maluma. Relive classics including Daddy Cool by Groove Century, or if K-Pop is your thing get down to Bubble Pop by Hyuna.… Expand"}, {"name": "Prince of Persia: The Forgotten Sands", "details_link": "https://www.metacritic.com/game/pc/prince-of-persia-the-forgotten-sands", "publisher": "Ubisoft", "release_date": "Jun  8 2010", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/dee7ec730c99ced1f091e48d3aed0a40-98.jpg", "descriptions": "Prince of Persia: The Forgotten Sands is the next chapter in the Sands of Time universe. Visiting his brother's kingdom following his adventure in Azad, the Prince finds the royal palace under siege from a mighty army bent on its destruction. When the decision is made to use the ancientPrince of Persia: The Forgotten Sands is the next chapter in the Sands of Time universe. Visiting his brother's kingdom following his adventure in Azad, the Prince finds the royal palace under siege from a mighty army bent on its destruction. When the decision is made to use the ancient power of the Sand in a desperate gamble to save the kingdom from total annihilation, the Prince embarks on an epic adventure in which he learns to bear the mantle of true leadership, and discover that great power often comes with a great cost. [Ubisoft]… Expand"}, {"name": "Kingdom Hearts 3D: Dream Drop Distance", "details_link": "https://www.metacritic.com/game/3ds/kingdom-hearts-3d-dream-drop-distance", "publisher": "Square Enix", "release_date": "Jun  5 2012", "developers": ["Square Enix"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/601073bd68f2d0837ecbd5acad67df18-98.jpg", "descriptions": "With a colorful cast of characters appearing in the Disney worlds in 3D, players can delve into a lifelike story and world in KINGDOM HEARTS 3D (tentative title). Get to better know all the familiar and beloved characters through this title."}, {"name": "Samurai Shodown", "details_link": "https://www.metacritic.com/game/switch/samurai-shodown", "publisher": "SNK", "release_date": "Feb 25 2020", "developers": ["SNK Corporation", "Safari Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 10 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/cb08f7acc37dce610716bdec0e2b8831-98.jpg", "descriptions": "SAMURAI SHODOWN has enjoyed worldwide success as a blade-wielding fighting game series since its first release in 1993. 11 years have passed since the last series installment, and it is now time for SAMURAI SHODOWN to return in a brand-new game featuring high-end visuals and gameplay!SAMURAI SHODOWN has enjoyed worldwide success as a blade-wielding fighting game series since its first release in 1993. 11 years have passed since the last series installment, and it is now time for SAMURAI SHODOWN to return in a brand-new game featuring high-end visuals and gameplay! Faithfully reproducing the game mechanics and atmosphere that contributed to the success of the series, SAMURAI SHODOWN includes a revolutionary feature that learns from players game actions and patterns in order to create CPU-controlled \"ghost\" characters. With a story set one year before the very first installment, a diverse cast of returning and new characters cross paths in order to fulfill their destinies!* SAMURAI SHODOWN is faithful to the series' roots by delivering the same tense and exhilarating battles that it has always been known for. * Using the power of UNREAL® ENGINE 4 the series is able to achieve a level of detail and graphical quality like never before. * Using revolutionary Deep Learning AI, the game will learn from player tactics and create Ghost characters which players around the globe can share and fight against.… Expand"}, {"name": "FIFA Soccer 10", "details_link": "https://www.metacritic.com/game/wii/fifa-soccer-10", "publisher": "Electronic Arts", "release_date": "Oct 20 2009", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 75, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/45e56407280577148c49dcafddc1c031-98.jpg", "descriptions": "FIFA Soccer 10 Wii is an over-the-top, non-stop soccer game that is designed exclusively for the platform. A polished gameplay experience that emphasizes action, approachability and responsiveness has been created that contains various key gameplay improvements and innovations. Shooting hasFIFA Soccer 10 Wii is an over-the-top, non-stop soccer game that is designed exclusively for the platform. A polished gameplay experience that emphasizes action, approachability and responsiveness has been created that contains various key gameplay improvements and innovations. Shooting has been refined for improved shot power, accuracy and the ability to score from a greater range of distances and angles. Passing has been refined for faster and more accurate execution, while improved pass targeting and AI logic will create more open spaces and generate greater scoring opportunities. Goalkeepers will be more responsive when positioning themselves for a save, while still allowing for juicy rebounds adding to the non-stop soccer theme. The defending AI has also been reworked to allow for more urgency in the 18 yard box, meaning more block attempts and better player positioning to provide better team defensive coverage. When packaged together these gameplay improvements will keep the action fast and furious on the pitch. [Electronic Arts]… Expand"}, {"name": "Rock of Ages 2: Bigger & Boulder", "details_link": "https://www.metacritic.com/game/switch/rock-of-ages-2-bigger-boulder", "publisher": "Sega", "release_date": "May 14 2019", "developers": ["ACE Team"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "General"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/48863cf05c66022e18427f1e35b1d9c5-98.jpg", "descriptions": "Bigger and Boulder cranks up the surrealism and gameplay to be, well... BIGGER AND BOULDER. With an emphasis on the chaotic new 2-vs-2 multiplayer, new time periods, and improved graphics, physics, and destructibility powered by Unreal Engine 4, players will need to be ready for some intenseBigger and Boulder cranks up the surrealism and gameplay to be, well... BIGGER AND BOULDER. With an emphasis on the chaotic new 2-vs-2 multiplayer, new time periods, and improved graphics, physics, and destructibility powered by Unreal Engine 4, players will need to be ready for some intense rocking and rolling. … Expand"}, {"name": "Rebel Galaxy", "details_link": "https://www.metacritic.com/game/pc/rebel-galaxy", "publisher": "Double Damage Games, Inc.", "release_date": "Oct 20 2015", "developers": ["Double Damage Games", "Inc.", "Double Damage Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/ea3d99a9ad60adc3279f81f2b1d3f09b-98.jpg", "descriptions": "Rebel Galaxy is a swashbuckling space adventure, with action-packed combat, exploration, discovery, trade, and “negotiation” with outlandish denizens at the edge of the known universe."}, {"name": "Dracula: Undead Awakening", "details_link": "https://www.metacritic.com/game/psp/dracula-undead-awakening", "publisher": "Chillingo Ltd", "release_date": "Jan 28 2010", "developers": ["Chillingo Ltd", "Chillingo Ltd.", "Chillingo"], "platforms": ["iPhone/iPad", "PSP"], "genres": ["Action", "General", "General"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/ba98323a84ee829acf193399ec0590d8-98.jpg", "descriptions": "[PSP Minis]  Dracula - Undead Awakening is a top-down shooter, with players controlling a vampire hunter who must combat hordes of undead enemies like zombies, ghouls."}, {"name": "NHL 2005", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-2005", "publisher": "EA Sports", "release_date": "Sep 20 2004", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/3dd308009c59324dc02f0ee3140b2ec6-98.jpg", "descriptions": "OPEN ICE CONTROL: Seamlessly switch between players with or without the puck -- call for passes, tell a teammate to shoot, set up a vicious one-timer, or call for a defensive double-team on the fly with the push of a button. TOTAL PLAYER AWARENESS: With more player awareness than everOPEN ICE CONTROL: Seamlessly switch between players with or without the puck -- call for passes, tell a teammate to shoot, set up a vicious one-timer, or call for a defensive double-team on the fly with the push of a button. TOTAL PLAYER AWARENESS: With more player awareness than ever before, make saucer passes just before the blueline, call in a second defender to break up a 2-on-1, or fire off wrist shots at the perfect angle on net. FACE-OFF PLAYBOOK: New playcalling system allows you to choose offensive and defensive face-off strategies every time the whistle blows. Plan an attack in your opponent's zone or protect the net right before the puck drops. THE WORLD CUP OF HOCKEY: Take part in the excitement of this year's World Cup of Hockey event featuring teams from USA, Canada, Sweden, Finland, Germany, Russia, Czech Republic, and Slovakia playing in authentic European and North American venues. ALL-NEW SKATING ENGINE: Glide then use explosive speed to get to the open ice -- now you have more puck-handling and turning control. A refined backwards skating system also allows for unprecedented defensive precision and control. THE DRILL: The intensity explodes off the ice with The Drill -- one net, one goalie, and every man for himself. Up to four can play and the one who scores the most goals wins.  ENHANCED EA SPORTS ONLINE: Make a run for the Stanley Cup™: in the world's largest online competition, complete with leaderboards, downloadable rosters, and improved cheating countermeasures. [EA Sports]… Expand"}, {"name": "Port Royale 2", "details_link": "https://www.metacritic.com/game/pc/port-royale-2", "publisher": "Ascaron Entertainment GmbH", "release_date": "Sep 13 2004", "developers": ["Ascaron Entertainment GmbH", "Ascaron Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/14e2f0ad621e47aa782e5f4db1ce22a7-98.jpg", "descriptions": "Trade with over 60 towns and create your own production facilities. Increase your trading empire, and influence development of the New World. Trade is not everything though: pirates and military fleets threaten your trade convoys. Build and command escort ships for the convoys. Turn theTrade with over 60 towns and create your own production facilities. Increase your trading empire, and influence development of the New World. Trade is not everything though: pirates and military fleets threaten your trade convoys. Build and command escort ships for the convoys. Turn the tides and hunt for pirates or capture the military ships. Become famous and expand your own fleet as well as your stocks of goods. If that is not enough, take on missions for merchants, diplomats and other characters. Use a letter of Marquee to gain the most desirable missions of the vice-kings; to attack and conquer enemy towns. As a sign of gratitude you will be awarded land, to be used later for the building and growth of your own towns.… Expand"}, {"name": "Sabre Wulf", "details_link": "https://www.metacritic.com/game/game-boy-advance/sabre-wulf", "publisher": "THQ", "release_date": "Jun  9 2004", "developers": ["Rare Ltd."], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 75, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/37d58065af650c677b9b2ee844489413-98.jpg", "descriptions": "A mysterious stranger has shattered the fabled Sabre Wulf amulet, unleashing the savage Sabre Wulf from years of imprisonment. Once again, it's up to Sabreman, explorer and treasure hunter extraordinaire, to track and recapture his nemesis. As Sabreman, you'll enter a world rife with magicalA mysterious stranger has shattered the fabled Sabre Wulf amulet, unleashing the savage Sabre Wulf from years of imprisonment. Once again, it's up to Sabreman, explorer and treasure hunter extraordinaire, to track and recapture his nemesis. As Sabreman, you'll enter a world rife with magical creatures that you can control. Use each creature's unique powers to survive traps, obstacles, and the dreaded Sabre Wulf. The game's combination of 2D and 3D gameplay spreads across a variety of levels.… Expand"}, {"name": "Dragon Ball Z: The Legacy of Goku II", "details_link": "https://www.metacritic.com/game/game-boy-advance/dragon-ball-z-the-legacy-of-goku-ii", "publisher": "Atari", "release_date": "Jun 17 2003", "developers": ["Webfoot Technologies"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/180d8f6d6e90e5dc25410817e4ee27a5-98.jpg", "descriptions": "Just when the Z Fighters thought the struggle against evil was over, a new evil approaches.  In the next episode in the Z Fighters' quest to rid the universe of evil, you'll take on the role of Trunks, Goku, Gohan, Piccolo, or Vegeta as they journey through the Cell Saga and prepare toJust when the Z Fighters thought the struggle against evil was over, a new evil approaches.  In the next episode in the Z Fighters' quest to rid the universe of evil, you'll take on the role of Trunks, Goku, Gohan, Piccolo, or Vegeta as they journey through the Cell Saga and prepare to battle with the mighty Cell himself.  With five playable characters, hours of gameplay, and massive game maps to explore, it's a DBZ adventure of epic proportions.… Expand"}, {"name": "Ready 2 Rumble Boxing: Round 2", "details_link": "https://www.metacritic.com/game/playstation-2/ready-2-rumble-boxing-round-2", "publisher": "Midway", "release_date": "Oct 23 2000", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/57161c699e233616bc55c53fbad87e48-98.jpg", "descriptions": "Ready 2 Rumble Boxing - Round 2 will include a variety of uniquely different, animated thugs that will punch their way up the ladder of the Ready 2 Rumble boxing world.  The game will also feature two new celebrity boxers: the King of Pop, Michael Jackson and Los Angeles Lakers superstar,Ready 2 Rumble Boxing - Round 2 will include a variety of uniquely different, animated thugs that will punch their way up the ladder of the Ready 2 Rumble boxing world.  The game will also feature two new celebrity boxers: the King of Pop, Michael Jackson and Los Angeles Lakers superstar, Shaquille O'Neal.… Expand"}, {"name": "Forsaken 64", "details_link": "https://www.metacritic.com/game/nintendo-64/forsaken-64", "publisher": "Acclaim", "release_date": "Apr 30 1998", "developers": ["Iguana Entertainment"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/07949d0c3045a5c9d8862deb32fcc6b0-98.jpg", "descriptions": "An experiment gone wrong ripped away the earth's atmosphere. Bathed in the searching radiation of the sun, the planet has been condemned. You are among the FORSAKEN™ few who invade the now abandoned settlements to collect what little fortune was left behind."}, {"name": "S.T.A.L.K.E.R.: Clear Sky", "details_link": "https://www.metacritic.com/game/pc/stalker-clear-sky", "publisher": "Koch Media", "release_date": "Sep 15 2008", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/9200c84d86104a953cfd2b883b778069-98.jpg", "descriptions": "The story of S.T.A.L.K.E.R.: Clear Sky brings the players one year prior to the events of the original S.T.A.L.K.E.R. game in 2011. A group of stalkers has for the first time reached the very heart of the Zone - Chernobyl Nuclear Power Plant, and brings about a cataclysm on the brink of aThe story of S.T.A.L.K.E.R.: Clear Sky brings the players one year prior to the events of the original S.T.A.L.K.E.R. game in 2011. A group of stalkers has for the first time reached the very heart of the Zone - Chernobyl Nuclear Power Plant, and brings about a cataclysm on the brink of a catastrophe. An immense blow-out of anomalous energy changes the Zone. There are no more reliable and relatively safe roads. The entire levels vanish in the outbursts of anomalies. Stalkers and even expeditions die or end up sealed on the lost territories. New areas, which remained unknown since the time of the Zone emergence, appear on the Zone map. The Zone continues to shake with blowouts. The Zone is unstable. The anomalous activity is at its maximum. Changes of the Zone map known to stalkers shake the fragile balance of forces in the Zone. Among the groupings, there flare up hostilities for the new territories, artefact fields and spheres of influence. There are no more old enemies or friends - now everyone is for himself. The Factions War has started between the groupings. [Deep Silver]… Expand"}, {"name": "Beholder", "details_link": "https://www.metacritic.com/game/pc/beholder", "publisher": "Warm Lamp Games", "release_date": "Nov  9 2016", "developers": ["Warm Lamp Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/ac33df96ea49848b99be30b982d15e3a-98.jpg", "descriptions": "You’re a State-installed Landlord in a totalitarian State. You must spy on tenants, peep, eavesdrop and profile! You must report on anyone capable of plotting subversion against the State."}, {"name": "EA Sports UFC 3", "details_link": "https://www.metacritic.com/game/playstation-4/ea-sports-ufc-3", "publisher": "Electronic Arts", "release_date": "Jan 30 2018", "developers": ["EA Sports"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Individual", "Combat", "Boxing / Martial Arts"], "meta_score": 75, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/5/dad2f4923c4a1171243e9927106f66f7-98.jpg", "descriptions": "Real Player Motion - New cutting-edge animation technology makes every move, strike, and combination more realistic, responsive, and rewarding. G.O.A.T. Career Mode - Build hype to gain fans and create rivalries that capture the world’s attention. Then fight to dominate the Octagon.Real Player Motion - New cutting-edge animation technology makes every move, strike, and combination more realistic, responsive, and rewarding. G.O.A.T. Career Mode - Build hype to gain fans and create rivalries that capture the world’s attention. Then fight to dominate the Octagon. Multiplayer Mode - New customizable multiplayer modes let you and your friends face off with highlight-reel knockouts.\r… Expand"}, {"name": "Earth Defense Force: World Brothers", "details_link": "https://www.metacritic.com/game/playstation-4/earth-defense-force-world-brothers", "publisher": "D3Publisher", "release_date": "May 27 2021", "developers": ["Yuke's", "Sandlot"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/81b6d3100ef425e3a4d9776e42e5f4db-98.jpg", "descriptions": "A new battlefield appears in the \"EDF\" series. This time, the world becomes the square Earth. The name of this game is \"EARTH DEFENSE FORCE: WORLD BROTHERS\". \r\rThis game takes place in the 3D voxel world, which everything is made up of square pieces. In this world, the Earth is not roundA new battlefield appears in the \"EDF\" series. This time, the world becomes the square Earth. The name of this game is \"EARTH DEFENSE FORCE: WORLD BROTHERS\". \r\rThis game takes place in the 3D voxel world, which everything is made up of square pieces. In this world, the Earth is not round but square. And now, this voxel Earth is fallen apart into square pieces, breaking its blocky peace. But whether round or square, the Earth must be the Earth. So now, the player and the \"EARTH DEFENSE FORCE\" must rise to the occasion and save the day to restore a shattered Voxel Earth to one peace.… Expand"}, {"name": "The Dark Pictures Anthology: Man of Medan", "details_link": "https://www.metacritic.com/game/pc/the-dark-pictures-anthology-man-of-medan", "publisher": "Bandai Namco Games", "release_date": "Aug 29 2019", "developers": ["Supermassive Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Adventure", "General", "Survival"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/26e1e7451d51302ddfd2f445e3c97e67-98.jpg", "descriptions": "DON'T PLAY ALONE - From the developers of Until Dawn...Enter the world of The Dark Pictures - A series of standalone cinematic horror games. Players will be challenged to explore and uncover each story with the knowledge that all their choices have consequences and all playable charactersDON'T PLAY ALONE - From the developers of Until Dawn...Enter the world of The Dark Pictures - A series of standalone cinematic horror games. Players will be challenged to explore and uncover each story with the knowledge that all their choices have consequences and all playable characters can live, any and all can die... Man of Medan is the first game in The Dark Pictures anthology, bringing supernatural horror to the South Pacific. Five friends set sail on a holiday diving trip with a rumored WWII wreck to find. As the day unfolds and a storm rolls in, their trip soon changes into something much more sinister. Who will live? Who will die? It's down to you. Can you save them all?\r Features:\r A NEW TERRIFYING EXPERIENCE\rSupermassive Games delivers a new, horrific narrative journey where you will have to confront your deepest fears.\r CAN YOU SAVE THEM ALL?\rAll payable characters can live and all can die. The choices you make will decide their fate. Death could be just around the corner...\r WHAT WILL YOU DO TO SURVIVE?\rEach choice you make has a consequence which can mean life or death for your character. Will you keep your head whilst struggling to survive? What decisions will you make?… Expand"}, {"name": "Observer", "details_link": "https://www.metacritic.com/game/switch/observer", "publisher": "Bloober Team", "release_date": "Feb  7 2019", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/cd74eba38ea0510fff3c262a5f795a1b-98.jpg", "descriptions": ">observer_ is a cyberpunk, detective thriller set in the year 2084 in Krakow, Poland. The world lies in ruins with corporations seizing power after the fall of governments. You do their bidding. No lie will remain hidden from you, as you hack into the minds of those you interrogate. When>observer_ is a cyberpunk, detective thriller set in the year 2084 in Krakow, Poland. The world lies in ruins with corporations seizing power after the fall of governments. You do their bidding. No lie will remain hidden from you, as you hack into the minds of those you interrogate. When your past catches-up, you must act on your own and unravel the mystery of your son’s disappearance. Your name is Daniel Lazarski, you’re an Observer. … Expand"}, {"name": "Need for Speed: Rivals", "details_link": "https://www.metacritic.com/game/xbox-one/need-for-speed-rivals", "publisher": "Electronic Arts", "release_date": "Nov 22 2013", "developers": ["Ghost Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 75, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/5dc5c102dbe57d48451cee568c822373-98.jpg", "descriptions": "Need for Speed Rivals inserts gamers behind the wheel of both sides of the thin blue line, daring them to cross that line as either a cop or racer in order to gain any advantage in the street’s ultimate rivalry. Players decide between two distinct career experiences, each with its own set ofNeed for Speed Rivals inserts gamers behind the wheel of both sides of the thin blue line, daring them to cross that line as either a cop or racer in order to gain any advantage in the street’s ultimate rivalry. Players decide between two distinct career experiences, each with its own set of high-stakes challenges, rewards, pursuit tech and cars. The intensity of the action is enhanced as a result of AllDrive, a feature that destroys the line between single player, co-op and multiplayer. Through AllDrive, friends are connected to one racing world where their races and chases can collide at any time.… Expand"}, {"name": "Bit.Trip Saga", "details_link": "https://www.metacritic.com/game/3ds/bittrip-saga", "publisher": "Aksys Games", "release_date": "Sep 13 2011", "developers": ["Gaijin Games"], "platforms": ["PlayStation 4", "PlayStation Vita", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/cc102718cfecd7b49495ba95bb953d1d-98.jpg", "descriptions": "All six BIT.TRIP games are transformed into 3D, morphing into a single entity called /BIT.TRIP SAGA/. Experience the crushing difficulty of the rhythmic galaxies and ride along the long journey with CommanderVideo as he completes his mission and returns...home."}, {"name": "Satellite Reign", "details_link": "https://www.metacritic.com/game/pc/satellite-reign", "publisher": "5 Lives Studios", "release_date": "Aug 28 2015", "developers": ["5 Lives Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Sci-Fi", "Strategy", "Real-Time", "General"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/6fdfc772c4f2e8459e9a4238867fe4c8-98.jpg", "descriptions": "A real-time, class-based strategy game through which you control a team of four agents, each with distinct and unique abilities, collectively battling for control of a simulated, living cyberpunk city."}]