[{"name": "Serious Sam HD: The Second Encounter", "details_link": "https://www.metacritic.com/game/xbox-360/serious-sam-hd-the-second-encounter", "publisher": "Majesco Games", "release_date": "Sep 22 2010", "developers": ["Croteam"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/d7475008938af22ec4d955e92de53731-98.jpg", "descriptions": "The classic arcade FPS Serious Sam: The First Encounter is reborn in glorious high-definition for legions of long-time fans and a whole new generation of gamers around the world. Featuring dazzling visuals and revamped design, gamers take control of the legendary Sam ‘Serious’ Stone as he isThe classic arcade FPS Serious Sam: The First Encounter is reborn in glorious high-definition for legions of long-time fans and a whole new generation of gamers around the world. Featuring dazzling visuals and revamped design, gamers take control of the legendary Sam ‘Serious’ Stone as he is sent back through time to ancient Egypt to battle the overwhelming forces of Notorious Mental and the Sirian army.… Expand"}, {"name": "Salt and Sacrifice", "details_link": "https://www.metacritic.com/game/pc/salt-and-sacrifice", "publisher": "Ska Studios", "release_date": "May 10 2022", "developers": ["Ska Studios", "Devoured Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG", "Action", "Platformer", "", "Metroidvania"], "meta_score": 72, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/3/ca346a19270d8b55f2f15388318e90b3-98.jpg", "descriptions": "Salt and Sacrifice is the follow-up to Souls-like dark fantasy RPG, Salt and Sanctuary. In a land plagued by powerful and twisted Mages, the condemned Marked Inquisitors take up the hunt. A once-peaceful kingdom is plunged into chaos by encroaching tides of Mages: merciless embodiments ofSalt and Sacrifice is the follow-up to Souls-like dark fantasy RPG, Salt and Sanctuary. In a land plagued by powerful and twisted Mages, the condemned Marked Inquisitors take up the hunt. A once-peaceful kingdom is plunged into chaos by encroaching tides of Mages: merciless embodiments of elemental chaos. The Marked Inquisitors, a doomed force of the condemned, once again mobilizes to stand against the existential threat of Magic. A buried secret threatens to bring an ancient empire to utter ruin. As a Marked Inquisitor, you’ll journey through the western frontier: pursuing, hunting, and obliterating the Mages that roam the realm. You may be bound to the Inquisition, but your choices are yours.\r… Expand"}, {"name": "Cities in Motion 2", "details_link": "https://www.metacritic.com/game/pc/cities-in-motion-2", "publisher": "Paradox Interactive", "release_date": "Apr  2 2013", "developers": ["Colossal Order"], "platforms": "PC", "genres": ["Simulation", "General", "General"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/3b918f68447c75c4c8cc8a450d862a46-98.jpg", "descriptions": "Cities in Motion 2 is the sequel to the popular mass transit simulation game Cities in Motion. The Modern Days introduces new features, like multiplayer game modes, day and night cycle, timetables and dynamic cities. The player's actions in building the transportation network will affect howCities in Motion 2 is the sequel to the popular mass transit simulation game Cities in Motion. The Modern Days introduces new features, like multiplayer game modes, day and night cycle, timetables and dynamic cities. The player's actions in building the transportation network will affect how the city grows, with affordable transportation spawning middle class housing and work places, and more expensive and delicate choices bringing in demanding business people. Player has many different types of vehicles to choose from and now can also build roads with bus lanes. Tackling the rush hour by managing transportation timetables and meeting the needs of the citizens are one of the key elements of building a successful and efficient network!… Expand"}, {"name": "Twelve Minutes", "details_link": "https://www.metacritic.com/game/xbox-series-x/twelve-minutes", "publisher": "Annapurna Interactive", "release_date": "Aug 19 2021", "developers": ["Luis Antonio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 72, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/0b1a741d8ecf096d8a7d28da9bbe36b4-98.jpg", "descriptions": "TWELVE MINUTES is a real-time top-down interactive thriller with an accessible click and drag interface.What should be a romantic evening with your wife turns into a nightmare when a police detective breaks into your home, accuses your wife of murder and beats you to death...\n\nOnly for youTWELVE MINUTES is a real-time top-down interactive thriller with an accessible click and drag interface.What should be a romantic evening with your wife turns into a nightmare when a police detective breaks into your home, accuses your wife of murder and beats you to death...Only for you to find yourself immediately returned to the exact moment you opened the front door, stuck in a TWELVE-MINUTE time loop, doomed to relive the same terror again and again...Unless you can find a way to use the knowledge of what's coming to change the outcome and break the loop.TWELVE MINUTES blends the dream-like tension of THE SHINING with the claustrophobia of REAR WINDOW and the fragmented structure of MEMENTO.… Expand"}, {"name": "Borderlands 2 VR", "details_link": "https://www.metacritic.com/game/playstation-4/borderlands-2-vr", "publisher": "2K Games", "release_date": "Dec 14 2018", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/d2dcd238f9f37bc54edc5dc282b4833c-98.jpg", "descriptions": "Virtually immerse yourself in the untamed world of Borderlands. Step into the boots of a treasure-seeking Vault Hunter armed with 87 bazillion guns on a quest to line your pockets with loot."}, {"name": "Gundam Evolution", "details_link": "https://www.metacritic.com/game/pc/gundam-evolution", "publisher": "Bandai Namco Games", "release_date": "Sep 21 2022", "developers": ["Bandai Namco Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 72, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/0/cd3cf51f4745b069caff89a6f604b3fb-98.jpg", "descriptions": "GUNDAM EVOLUTION is an online free-to-play FPS title in which players take control of Mobile Suits from the hit Gundam anime and challenge other players online in six-versus-six objective based battles.Featuring fast-paced action and immersive controls, players can switch between manyGUNDAM EVOLUTION is an online free-to-play FPS title in which players take control of Mobile Suits from the hit Gundam anime and challenge other players online in six-versus-six objective based battles.Featuring fast-paced action and immersive controls, players can switch between many different Mobile Suit Units to suit the ever changing battle conditions. Utilize their unique characteristics and cooperate with teammates to secure the win.… Expand"}, {"name": "Steelrising", "details_link": "https://www.metacritic.com/game/playstation-5/steelrising", "publisher": "Nacon", "release_date": "Sep  8 2022", "developers": ["Spiders"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/e861bf5cbf54ac6a5765b24eec0d9a88-98.jpg", "descriptions": "An action-RPG with a strong emphasis on fast-paced combat. SteelRising is set in an alternate timeline based on the French Revolution of 1789. To tame the flames of revolution igniting Paris, King Louis XVI unleashes a deadly army of clockwork robots on the people. You are Aegis, aAn action-RPG with a strong emphasis on fast-paced combat. SteelRising is set in an alternate timeline based on the French Revolution of 1789. To tame the flames of revolution igniting Paris, King Louis XVI unleashes a deadly army of clockwork robots on the people. You are Aegis, a mysterious automaton, bodyguard to Queen Marie-Antoinette, and the Revolution’s last hope against a king gone mad.… Expand"}, {"name": "Pac-Man Museum+", "details_link": "https://www.metacritic.com/game/playstation-4/pac-man-museum+", "publisher": "Bandai Namco Games", "release_date": "May 27 2022", "developers": ["Bandai Namco Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/a5666f6368cf200bb651087bf63de1f2-98.jpg", "descriptions": "PAC-MAN MUSEUM+ presents a unique curated collection of classic and modern PAC-MAN games from the over 40-year history of the storied iconic videogame character’s library. Fans and enthusiasts will be able to enjoy the iconic original arcade classic alongside more modern frenetic titles,PAC-MAN MUSEUM+ presents a unique curated collection of classic and modern PAC-MAN games from the over 40-year history of the storied iconic videogame character’s library. Fans and enthusiasts will be able to enjoy the iconic original arcade classic alongside more modern frenetic titles, including PAC-MAN BATTLE ROYALE, PAC-MAN 256, and more!\r *Featured Games in PAC-MAN MUSEUM+, include:\r PAC-MAN\rSUPER PAC-MAN\rPAC & PAL\rPAC-LAND\rPAC-MANIA\rPAC-ATTACK\rPAC-IN-TIME\rPAC-MAN ARRANGEMENT Arcade ver.\rPAC-MAN ARRANGEMENT CS ver.\rPAC-MAN CHAMPIONSHIP EDITION\rPAC Motos\rPAC’N ROLL REMIX\rPAC-MAN BATTLE ROYALE\rPAC-MAN 256… Expand"}, {"name": "Conan Chop Chop", "details_link": "https://www.metacritic.com/game/pc/conan-chop-chop", "publisher": "Funcom", "release_date": "Mar  1 2022", "developers": ["Mighty Kingdom"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/0/b150803cc7eda53e64497a790dced042-98.jpg", "descriptions": "The treacherous wizard Thoth-Amon has devised a plan to resurrect the ancient evil that is Xaltotun. If he succeeds, he will condemn the world to an eternity of darkness and enslavement. Only you can stop him, but in order to do so you must use all your cunning. All your guile. You mustThe treacherous wizard Thoth-Amon has devised a plan to resurrect the ancient evil that is Xaltotun. If he succeeds, he will condemn the world to an eternity of darkness and enslavement. Only you can stop him, but in order to do so you must use all your cunning. All your guile. You must summon all your courage and swordsmanship. You must Chop Chop!Conan Chop Chop is the most epic and realistic stick figure game ever to be set in the world of Conan the Barbarian, thus there will be an excessive amount of gore and flying limbs. Be warned that this may in turn lead to uncontrollable outbursts of joy and/or profanities, usually depending on which end of the sword you are on.1-4 playersPlay solo for the ultimate thrill of a roguelike or have your buddies along with you in online or couch co-op mode.Become Conan or someone else!All brawns, no brain? No worries! Choose between a diverse cast of badass warrior gods, and add weapons and items to match your style!Embark on quests of pure epicness!You are about to save the world! The merchants are still going to charge you for their wares, and some townsfolk may even pester you with tasks of their own. But fear not, some of them will make it worth your while.Explore in every direction!Brave the shifting sands of Koth, explore the dark woods in Darkwood, move valiantly through the searing land of Hyperboria and see the icy world of Vanaheim. Conan® Chop Chop lets you explore to the left, right, up and down! A skilled player may even find himself jumping, dashing, or moving diagonally, resulting in the ultimate 3D experience.Loot, loot and more loot!Master the fine art of delicately bashing your enemies' heads in with a broom and turning them into chop suey with a bastard sword. Conan® Chop Chop contains a wide variety of different weapons, trinkets and legendary items, each suited to tailor any kind of violent playstyle you can think of.Master astonishing combos!Perform the breathtaking 360° spin-attack to crack skulls all around you. Dash forward with the speed of light. Swing your sword both longways and sideways in a game that will have you gasping for air as you struggle to grasp the pure awesomeness of your fighting moves.Ruthless bosses!Before facing Thoth-Amon, you must defeat bosses such as The Giant Sand Worm of Koth and The Frost Giant of Vanaheim, neither of which are particularly sympathetic to your cause. Instead they will attempt to destroy you with killer moves like Lava Reflux, Tail Whip and Loogie Glob.Infinite replayability!Completely random maps and tons of weapons and abilities to try out ensure that every new game will be a whole new experience. You are bound to die more than once, but you can unlock new weapons that will be available for your next play-through.… Expand"}, {"name": "Rogue Lords", "details_link": "https://www.metacritic.com/game/pc/rogue-lords", "publisher": "Nacon", "release_date": "Sep 30 2021", "developers": ["Cyanide", "Leikir Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 72, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/7/dd224b012417aa4b3d5181fc6fbf0e77-98.jpg", "descriptions": "A dark fantasy roguelike where you play as the Devil! Lead famous evil geniuses through events and turn-based fights to spread terror and corruption. Create synergies between your disciples, use your evil powers and take revenge on those miserable Demon Hunters."}, {"name": "Immortals Fenyx Rising: A New God", "details_link": "https://www.metacritic.com/game/pc/immortals-fenyx-rising-a-new-god", "publisher": "Ubisoft", "release_date": "Jan 28 2021", "developers": ["Ubisoft Quebec"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action Adventure", "Open-World"], "meta_score": 72, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/7/2eb8a586a4091bfb02ff997b82ea0171-98.jpg", "descriptions": "As Fenyx, overcome the legendary trials and challenges of the gods of Olympos to change the Greek Pantheon and fulfill your destiny."}, {"name": "Fist of the North Star: Lost Paradise", "details_link": "https://www.metacritic.com/game/playstation-4/fist-of-the-north-star-lost-paradise", "publisher": "Sega", "release_date": "Oct  2 2018", "developers": ["Ryu ga Gotoku Studios"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/034f13334959e300f568731c566bafae-98.jpg", "descriptions": "Explore an alternate version of the Fist of the North Star canon; take control of Kenshiro as he searches for his lost love Yuria in a post-apocalyptic wasteland. For anyone unfamiliar with the original story, Lost Paradise can be enjoyed as a completely standalone experience."}, {"name": "IndyCar Series", "details_link": "https://www.metacritic.com/game/pc/indycar-series", "publisher": "Codemasters", "release_date": "Sep 23 2003", "developers": ["Codemasters"], "platforms": ["PlayStation 2", "PC"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/2ea20a2e45579db1468b19792624ddab-98.jpg", "descriptions": "The main game offers immediate high-paced action and player-friendly handling, making the feel both authentic and realistic. It is easy to pick up and play and offers a dynamic difficulty management system to keep the action packed, 200mph maneuvers coming thick and fast. Modes include QuickThe main game offers immediate high-paced action and player-friendly handling, making the feel both authentic and realistic. It is easy to pick up and play and offers a dynamic difficulty management system to keep the action packed, 200mph maneuvers coming thick and fast. Modes include Quick Race, IndyCar Series Season, and The Indy 500. Features realistic AI and team tactics modeled after real IndyCar Series drivers and tems. Learn more about IndyCar Series tactics from the Masterclass, taught by Indianapolis 500 winner Eddie Cheever Jr. Create your own racing drivers and teams with your own personalized car. IndyCar Series TV-style presentation, which enhances the immersive gameplay experience. [Codemasters]… Expand"}, {"name": "Bombastic", "details_link": "https://www.metacritic.com/game/playstation-2/bombastic", "publisher": "Capcom", "release_date": "Aug 27 2003", "developers": ["Shift"], "platforms": "PlayStation 2", "num_players": "1-5 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/c44d209e910d8b7f25160d9d41df47aa-98.jpg", "descriptions": "Bombastic puts you in control of a veritable minefield of explosive, moving dice. Roll the dice around the field to link them in like combinations. Once they connect, the dice are detonated and will explode. Don?t get too close as the explosion will knock you into next week. The object is toBombastic puts you in control of a veritable minefield of explosive, moving dice. Roll the dice around the field to link them in like combinations. Once they connect, the dice are detonated and will explode. Don?t get too close as the explosion will knock you into next week. The object is to clear each Bombastic level. Be careful! The action gets harder and harder as you go along! Over seven modes of play include Standard, Attack, Limited, Quest Mode, Classic, War and more! So many ways to play! So little time! Get ready to go Bombastic! [Capcom]… Expand"}, {"name": "The Gladiators: The Galactic Circus Games", "details_link": "https://www.metacritic.com/game/pc/the-gladiators-the-galactic-circus-games", "publisher": "Tri Synergy", "release_date": "Mar  3 2003", "developers": ["Arxel Tribe"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/f09be2a1b1ccd72a6e414b7971e4045c-98.jpg", "descriptions": "You are Greg Callahan, leader of a top-secret space shuttle mission to investigate a black hole in deep space. Lost during the mission, you end up on a strange planet, forced to fight for your life in the Deathbowl-a galactic deathmatch in an arena full of screaming, bloodthirsty crowds. TheYou are Greg Callahan, leader of a top-secret space shuttle mission to investigate a black hole in deep space. Lost during the mission, you end up on a strange planet, forced to fight for your life in the Deathbowl-a galactic deathmatch in an arena full of screaming, bloodthirsty crowds. The Gladiators: Galactic Circus Games is an action-packed, single- or multi-player RTS (Real Time Slaughter!) game that puts you right in the middle of incredible 3-D landscapes, spectacular explosions, bloody alien brawls and more. Embodying the Gladiators of 3 different races (Humans, Galactic, Magic), gain the tactical advantage and lead your combat units on 18 different missions. Playing The Gladiators is fun and easy. Surviving it is the hard part. [Arxel Guild]… Expand"}, {"name": "The House of the Dead III", "details_link": "https://www.metacritic.com/game/xbox/the-house-of-the-dead-iii", "publisher": "Sega", "release_date": "Oct 24 2002", "developers": ["Wow Entertainment"], "platforms": ["PlayStation 3", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Rail"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/2fac8c222de09e6f7d31745b88e302b6-98.jpg", "descriptions": "From the darkest corners, cadavers and zombies return to haunt your every move. In The House of the Dead III, you'll plow through the undead with shotgun in hand as you explore a postapocalyptic wasteland. The new shotgun can take out multiple enemies in a single blast. Take out wave afterFrom the darkest corners, cadavers and zombies return to haunt your every move. In The House of the Dead III, you'll plow through the undead with shotgun in hand as you explore a postapocalyptic wasteland. The new shotgun can take out multiple enemies in a single blast. Take out wave after wave of horrific zombies as you travel different routes and discover secrets and hidden areas. The House of the Dead III's time-sensitive gameplay forces you to exterminate your foes as quickly as possible.… Expand"}, {"name": "F1 2002", "details_link": "https://www.metacritic.com/game/gamecube/f1-2002", "publisher": "EA Sports", "release_date": "Jun 22 2002", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/db08edfcc3dd8f9184df397e3abb9376-98.jpg", "descriptions": "Kick off a brand-new season of racing with all the speed, glamour, and rivalry of Formula One. Officially licensed from the Formula One Administration Limited, F1 2002 features real drivers, teams, cars, and tracks from the 2002 FIA Formula One World Championship. Join new teams--Toyota andKick off a brand-new season of racing with all the speed, glamour, and rivalry of Formula One. Officially licensed from the Formula One Administration Limited, F1 2002 features real drivers, teams, cars, and tracks from the 2002 FIA Formula One World Championship. Join new teams--Toyota and Renault--and complete all-new challenges that test your driving skills. The higher you place in each race, the more points you receive, and the closer you are to the Constructor's Cup.… Expand"}, {"name": "The Sum of All Fears", "details_link": "https://www.metacritic.com/game/pc/the-sum-of-all-fears", "publisher": "Ubisoft", "release_date": "May 28 2002", "developers": ["Red Storm Entertainment"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Shoot-'Em-Up", "Tactical", "Top-Down", "Modern", "Modern"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/cc1e160f0b6292b1808d21cc987a0984-98.jpg", "descriptions": "Lead a team of domestic counter-terrorism experts through 11 dangerous missions that span the globe. Formed from the elite of the F.B.I.'s HRT, you have been tapped to perform covert ops in the most dangerous circumstances imaginable. As the commander of this team, you'll lead your unit intoLead a team of domestic counter-terrorism experts through 11 dangerous missions that span the globe. Formed from the elite of the F.B.I.'s HRT, you have been tapped to perform covert ops in the most dangerous circumstances imaginable. As the commander of this team, you'll lead your unit into the heat of battle, performing missions ranging from eliminating terrorists to planting bugs, and destroying illegal weapons caches to rescuing hostages. You'll give them orders in the field and take the point in leading them into combat. [Ubi Soft]… Expand"}, {"name": "Lost Kingdoms", "details_link": "https://www.metacritic.com/game/gamecube/lost-kingdoms", "publisher": "Activision", "release_date": "May 27 2002", "developers": ["From Software"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/13c0eae5ee1e778a63ae22b17d29ef7d-98.jpg", "descriptions": "A dark mysterious force has taken over the five Kingdoms of Argwyll, and only one person can solve the mystery and save the world--you, as Princess Katia. Now you must travel through the kingdom and explore over two dozen unique 3D worlds filled with graveyards, forests, mountains, andA dark mysterious force has taken over the five Kingdoms of Argwyll, and only one person can solve the mystery and save the world--you, as Princess Katia. Now you must travel through the kingdom and explore over two dozen unique 3D worlds filled with graveyards, forests, mountains, and fortresses. Interact with characters, uncover secret areas, and unravel the mystery of the evil forces. During your adventures, you can summon over 100 guardian creatures to help battle hordes of monsters. Make it a solo mission or go head-to-head with friends in two-player Versus mode. … Expand"}, {"name": "Black & White: Creature Isle", "details_link": "https://www.metacritic.com/game/pc/black-white-creature-isle", "publisher": "EA Games", "release_date": "Jan 21 2002", "developers": ["Lionhead Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/5b2e29202aea55e8ad5bf5d481230f87-98.jpg", "descriptions": "Travel with your creature to an undiscovered island and encounter the mysterious Brotherhood of Creatures. Undertake their rigorous trials and expand the power of your creature as he learns new skills and abilities. Successfully complete the challenges and earn the group's highest honor --Travel with your creature to an undiscovered island and encounter the mysterious Brotherhood of Creatures. Undertake their rigorous trials and expand the power of your creature as he learns new skills and abilities. Successfully complete the challenges and earn the group's highest honor -- the Mark of the Brotherhood. [Electronic Arts]… Expand"}, {"name": "Nostalgia", "details_link": "https://www.metacritic.com/game/ds/nostalgia", "publisher": "Ignition Entertainment", "release_date": "Oct 23 2009", "developers": ["Matrix Software"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/888811fb8a0d2072b2990045deb3a6ab-98.jpg", "descriptions": "Set in an alternate-reality version of 19th-century Earth, Nostalgia casts you as Eddie, a headstrong Londoner who amasses a group of memorable companions to traverse the world in his steampunk-inspired zeppelin. As you navigate the open skies, you'll explore mysterious foreign locales, slaySet in an alternate-reality version of 19th-century Earth, Nostalgia casts you as Eddie, a headstrong Londoner who amasses a group of memorable companions to traverse the world in his steampunk-inspired zeppelin. As you navigate the open skies, you'll explore mysterious foreign locales, slay all manner of fantastical enemies, complete a variety of thrilling quests, and ultimately, save the world from unfathomable evil. [Ignition Entertainment]… Expand"}, {"name": "Smoke and Sacrifice", "details_link": "https://www.metacritic.com/game/switch/smoke-and-sacrifice", "publisher": "Curve Digital", "release_date": "May 31 2018", "developers": ["Solar Sail Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/7b297ce15a1ef6a56759b6a2908fbb60-98.jpg", "descriptions": "Smoke and Sacrifice is an open-world, narrative-driven RPG, where exploiting living ecosystems is the key to your survival. Craft, fight, survive and explore the huge open world in this beautifully hand-painted, gothic adventure where every character has their tale to tell. Sachi's home isSmoke and Sacrifice is an open-world, narrative-driven RPG, where exploiting living ecosystems is the key to your survival. Craft, fight, survive and explore the huge open world in this beautifully hand-painted, gothic adventure where every character has their tale to tell. Sachi's home is the one tiny patch of fertile land which remains in an icy wasteland of a world. Her farming community thrives thanks to their devotion to the blazing Sun Tree, which replaces the lost light of the failed sun. After sacrificing her firstborn child to the Sun Tree, Sachi discovers a darker secret beneath the aura of priestly benevolence. Will she discover the truth hidden in the secret underworld, or perish in its swirling, deadly smoke? With the odds stacked against her, strange creatures challenging her every step, and the ever-looming smoke waiting to steal life and memory, will Sachi ever discover the truth of what happened to her son?… Expand"}, {"name": "Megaton Rainfall", "details_link": "https://www.metacritic.com/game/playstation-4/megaton-rainfall", "publisher": "Pentadimensional Games", "release_date": "Oct 17 2017", "developers": ["Pentadimensional Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/cea10f4b19ee07f98f8cc30efe360952-98.jpg", "descriptions": "Become an indestructible interdimensional superbeing in this first-person superhero game, and save Earth from an alien invasion."}, {"name": "Aeterna Noctis", "details_link": "https://www.metacritic.com/game/pc/aeterna-noctis", "publisher": "Aeternum Game Studios", "release_date": "Dec 15 2021", "developers": ["Aeternum Game Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Metroidvania"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/12f85856c47caaede10b51086c520524-98.jpg", "descriptions": "Aeterna Noctis is a challenging 2D Metroidvania drawn by hand, with intense combats and skill-based platform sections. Taking the role of the 'King of Darkness' you must help him regain his power across 16 different and connected areas in an epic journey with environmental storytelling."}, {"name": "Axel & Pixel", "details_link": "https://www.metacritic.com/game/xbox-360/axel-pixel", "publisher": "2K Play", "release_date": "Oct 14 2009", "developers": ["Silver Wish Games"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/bafb71c610cc72131f9928b9e83edb88-98.jpg", "descriptions": "[Xbox Live Arcade]  One day Axel, a painter, and his dog Pixel, awaken trapped in a beautiful but perilous dream world of his own creation. Together, they must solve the mysteries of Axel's landscapes to get home. Guide Axel & Pixel through this awe-inspiring world to help Axel fulfill his[Xbox Live Arcade]  One day Axel, a painter, and his dog Pixel, awaken trapped in a beautiful but perilous dream world of his own creation. Together, they must solve the mysteries of Axel's landscapes to get home. Guide Axel & Pixel through this awe-inspiring world to help Axel fulfill his greatest wish - to paint a picture of all four seasons in a single day. [Microsoft]… Expand"}, {"name": "Pokemon Violet", "details_link": "https://www.metacritic.com/game/switch/pokemon-violet", "publisher": "Nintendo", "release_date": "Nov 18 2022", "developers": ["Game Freak"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 72, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/9/304f4650959b570df9f4bc34ffb11822-98.jpg", "descriptions": "The Pokémon Scarlet and Pokémon Violet games, the newest chapters in the Pokémon series, are coming to Nintendo Switch. With these new titles, the Pokémon series takes a new evolutionary step, allowing you to explore freely in a richly expressed open world.  Various towns blend seamlesslyThe Pokémon Scarlet and Pokémon Violet games, the newest chapters in the Pokémon series, are coming to Nintendo Switch. With these new titles, the Pokémon series takes a new evolutionary step, allowing you to explore freely in a richly expressed open world.  Various towns blend seamlessly into the wilderness with no borders. You'll be able to see the Pokémon of this region in the skies, in the seas, in the forests, on the streetsall over! You'll be able to experience the true joy of the Pokémon seriesbattling against wild Pokémon in order to catch themnow in an open-world game that players of any age can enjoy. \r\rMeet the First Partner Pokémon\rThe three Pokémon from which you'll be able to choose your first partner are Sprigatito, Fuecoco, and Quaxly. How will you meet these three, and what sorts of Pokémon are they? \r\rSprigatito \rType: Grass \rCategory: Grass Cat Pokémon \rHeight: 1'4\" \rWeight: 9 lbs. \rAbility: Overgrow \rThe capricious, attention-seeking Grass Cat Pokémon. \r\rFuecoco\rType: Fire\rCategory: Fire Croc Pokémon \rHeight: 1'4\" \rWeight: 21.6 lbs. \rAbility: Blaze \rThe laid-back Fire Croc Pokémon that does things at its own pace. \r\rQuaxly\rType: Water \rCategory: Duckling Pokémon \rHeight: 1'8\" \rWeight: 13.4 lbs. \rAbility: Torrent \rThe earnest and tidy Duckling Pokémon. \r\rIntroducing the Main Characters \rAs one of the main characters, you'll set off on your adventure. Your outfit will vary depending on whether you play Pokémon Scarlet or Pokémon Violet. Who knows what kind of story awaits you?… Expand"}, {"name": "Rogue Aces", "details_link": "https://www.metacritic.com/game/playstation-4/rogue-aces", "publisher": "Curve Digital", "release_date": "Apr 12 2018", "developers": ["Infinite State Games"], "platforms": ["PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 72, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/8/8e5a0ee78db38bb85f1465c86dfdd88c-98.jpg", "descriptions": "Join the Rogue Aces and liberate the islands from The Baron and his dreaded pilots. Will you be able to face the fiercest of foes with only one life and three planes?"}, {"name": "Serial Cleaner", "details_link": "https://www.metacritic.com/game/playstation-4/serial-cleaner", "publisher": "Curve Digital", "release_date": "Jul 11 2017", "developers": ["iFun4all", "Curve Digital"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Action Adventure", "General", "Linear"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/6e7e93b483bf7e755a8a88d5d2bd9af2-98.jpg", "descriptions": "Slip on your flares, grab your shades, and hop in your station wagon — it’s time to go to work… as a professional cleaner for the mob."}, {"name": "Until Dawn: Rush of Blood", "details_link": "https://www.metacritic.com/game/playstation-4/until-dawn-rush-of-blood", "publisher": "SCEA", "release_date": "Oct 13 2016", "developers": ["Supermassive Games"], "platforms": "PlayStation 4", "genres": ["Action", "Shooter", "Rail"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/13054c8ad6eb103ba00a9178537e1cd2-98.jpg", "descriptions": "From the warped minds of the team behind PS4 horror classic Until Dawn, comes Until Dawn: Rush of Blood  a virtual reality experience to strike fear into the hearts of every trigger-happy arcade shooter fan. Arm yourself to the teeth then blast your way through a horde of enemies andFrom the warped minds of the team behind PS4 horror classic Until Dawn, comes Until Dawn: Rush of Blood  a virtual reality experience to strike fear into the hearts of every trigger-happy arcade shooter fan. Arm yourself to the teeth then blast your way through a horde of enemies and monsters coming at you from all angles. Duck and dodge everything thats thrown at you in this fright-filled rollercoaster ride from hell  exclusive to PlayStation VR. Can you survive seven levels of pure terror to top the global leaderboards? With multiple paths to take and nightmarish themes to scare the living daylights out of you, no two rides will ever be the same  and neither will you...… Expand"}, {"name": "LEGO Bricktales", "details_link": "https://www.metacritic.com/game/xbox-series-x/lego-bricktales", "publisher": "Thunderful", "release_date": "Oct 12 2022", "developers": ["ClockStone Studio"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "genres": ["Action Adventure", "Sandbox"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/5272754cd5dc9a64c5214881d26ea03d-98.jpg", "descriptions": "Your grandfather, a genius inventor, has called you for help! His beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren't made to bring it up to code. With the help of your powerful little robot buddy,Your grandfather, a genius inventor, has called you for help! His beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren't made to bring it up to code. With the help of your powerful little robot buddy, you can restore it using a mysterious device based on alien technology.As a source of power, the device needs happiness crystals, which you can harvest by making people happy and solving their problems. With the aid of a portal, travel to different locations all around the world to help people and collect their happiness crystals. Strap in for the ultimate building adventure and save your grandfather's amusement park!In this puzzle-adventure, use an intuitive brick-by-brick building mechanic to solve puzzles and bring your creations to life! Experience a charming story as you explore beautiful LEGO dioramas and help the people inhabiting them.… Expand"}, {"name": "Tormented Souls", "details_link": "https://www.metacritic.com/game/playstation-5/tormented-souls", "publisher": "PQube", "release_date": "Aug 27 2021", "developers": ["Dual Effect"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/d0a4c573c970db5533b4a3dea0ddfa1b-98.jpg", "descriptions": "Tormented souls is a return to classic survival horror. With a fresh twist on the fixed perspective adventure, tormented souls modernises for a new generation - as caroline Walker investigates the mysterious disappearance of twin girls in a terrifying mansion-turned-hospital."}, {"name": "Shaun White Snowboarding: World Stage", "details_link": "https://www.metacritic.com/game/wii/shaun-white-snowboarding-world-stage", "publisher": "Ubisoft", "release_date": "Nov  8 2009", "developers": ["Ubisoft"], "platforms": "Wii", "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 72, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/21ad7cb8c9960e12ddbee7533a2660e2-98.jpg", "descriptions": "Players hit the slopes with Shaun White and his crew, but this time the stakes are higher as you pursue the world's top competitions from a half-pipe in the middle of New York's Time Square to the most prestigious competitions of France, Canada and Japan. Players break out their BalancePlayers hit the slopes with Shaun White and his crew, but this time the stakes are higher as you pursue the world's top competitions from a half-pipe in the middle of New York's Time Square to the most prestigious competitions of France, Canada and Japan. Players break out their Balance Boards once again for Shaun White Snowboarding: World Stage when they flex their board skills either alone or together with family and friends. [Ubisoft]… Expand"}, {"name": "Just Dance 2019", "details_link": "https://www.metacritic.com/game/switch/just-dance-2019", "publisher": "Ubisoft", "release_date": "Oct 23 2018", "developers": ["Ubisoft Paris"], "platforms": ["PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/791fa44d0d2928e9b8aae1ea361b2125-98.jpg", "descriptions": "40 Tracks, including:\rFinesse (Remix) – Bruno Mars Ft. Cardi B\rBum Bum Tam Tam – MC Fioti, Future, J Balvin, Stefflon Don, Juan Magan\r\nBang Bang Bang – BIGBANG\r\nMad Love – Sean Paul, David Guetta Ft. Becky G\r\nShaky Shaky – Daddy Yankee\r\nDame Tu Cosita – El Chombo ft. Cutty Ranks\r\nOMG –40 Tracks, including:\rFinesse (Remix) – Bruno Mars Ft. Cardi B\rBum Bum Tam Tam – MC Fioti, Future, J Balvin, Stefflon Don, Juan Magan\rBang Bang Bang – BIGBANG\rMad Love – Sean Paul, David Guetta Ft. Becky G\rShaky Shaky – Daddy Yankee\rDame Tu Cosita – El Chombo ft. Cutty Ranks\rOMG – Arash Ft. Snoop Dogg\rMi Mi Mi – Hit The Electro Beat\rMama Mia – Mayra Verónica\rNarco – Blasterjaxx & Timmy Trumpet\rFire – LLP Ft. Mike Diamondz … Expand"}, {"name": "Sega SuperStars", "details_link": "https://www.metacritic.com/game/playstation-2/sega-superstars", "publisher": "Sega", "release_date": "Nov  3 2004", "developers": ["Sonic Team"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Miscellaneous", "Party"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/e56033fc3562d3300ac02b4f92ca572b-98.jpg", "descriptions": "SEGA SuperStars for EyeToy, developed by SEGA's Sonic Team studio, leverages the camera control-method featured in EyeToy to bring a new level of interactivity to the company's core brands such as Sonic the Hedgehog, Samba de Amigo, House of the Dead, Virtua Fighter and more."}, {"name": "Narcosis", "details_link": "https://www.metacritic.com/game/pc/narcosis", "publisher": "Narcosis Team", "release_date": "Mar 28 2017", "developers": ["Narcosis Team", "Honor Code", "Inc."], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/483cd3251ec5ca0bbeca5f06c663110e-98.jpg", "descriptions": "Narcosis is a survival story set at the hostile depths of the Pacific Ocean. Stranded after an accident, an industrial diver takes desperate steps to surface before his oxygen - and sanity - give out."}, {"name": "Earth Defense Force 5", "details_link": "https://www.metacritic.com/game/playstation-4/earth-defense-force-5", "publisher": "D3Publisher", "release_date": "Dec 11 2018", "developers": ["Sandlot"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/15c4ac5f9d5b0b15ce6ac7d8b5e8ad33-98.jpg", "descriptions": "Become an EDF Soldier and Save Earth. Become one of the soldiers of EDF and exterminate the invading aliens. Protect peace on Earth. Human-Looking Aliens Appear for the First Time in The Series\rWhat are the unprecedented and intellectual alien beings from another planet called the 'Primer'?Become an EDF Soldier and Save Earth. Become one of the soldiers of EDF and exterminate the invading aliens. Protect peace on Earth. Human-Looking Aliens Appear for the First Time in The Series\rWhat are the unprecedented and intellectual alien beings from another planet called the 'Primer'? A series-first enemy alien finally appears. The battle with this intelligent enemy produces unprecedented deep despair, while leading the player to the most fun yet as EDF must confront them with courage and wisdom.… Expand"}, {"name": "The Cave", "details_link": "https://www.metacritic.com/game/playstation-3/the-cave", "publisher": "Sega", "release_date": "Jan 22 2013", "developers": ["Double Fine Productions"], "platforms": ["iPhone/iPad", "PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/014839a0bdfe46c9fdb6a972274dc96c-98.jpg", "descriptions": "The Cave is an adventure from Ron Gilbert, and Double Fine Productions. Assemble your team of 3 from 7 unlikely adventurers, each with his own unique personalities and stories. Then descend into the mysterious depths to explore a variety of locations including a subterranean amusement parkThe Cave is an adventure from Ron Gilbert, and Double Fine Productions. Assemble your team of 3 from 7 unlikely adventurers, each with his own unique personalities and stories. Then descend into the mysterious depths to explore a variety of locations including a subterranean amusement park and a medieval castle, not to mention a fully armed and ready-to-launch nuclear tipped ICBM. The Cave awaits.… Expand"}, {"name": "Secret Agent Clank", "details_link": "https://www.metacritic.com/game/psp/secret-agent-clank", "publisher": "SCEA", "release_date": "Jun 17 2008", "developers": ["High Impact Games"], "platforms": ["PlayStation 2", "PSP"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/9fe82e46046494c74a64f91550ed0ae7-98.jpg", "descriptions": "Clank's on a mission. His best buddy, Ratchet, has been framed by a ruthless enemy and jailed for a crime he did not commit. Not only that, but Ratchet's maximum security prison is full of the universe's most dangerous criminals most of whom are lining up to personally 'welcome' Ratchet intoClank's on a mission. His best buddy, Ratchet, has been framed by a ruthless enemy and jailed for a crime he did not commit. Not only that, but Ratchet's maximum security prison is full of the universe's most dangerous criminals most of whom are lining up to personally 'welcome' Ratchet into his new cell. Luckily for Ratchet he’s got Clank on the outside, and luckily for Clank he's the kind of brainy little robot who is cool under pressure and knows a thing or two about tracking down a mysterious enemy. That's why, as Secret Agent Clank, he's hot on the trail of clues to unravel the mystery and secure Ratchet’s release from jail. Unleash Clank's cutting edge array of weapons and gadgets, such as Cufflink Bombs, Tie-a-Rangs, Spy Sunglasses and the ever helpful Holo-Disguise Monocle. Launch into a variety of gameplay styles from all-out action to cunning stealth and brain-busting puzzle solving. Drive state-of-the-art super spy vehicles including speedboats, snowboards and sports cars. Play as Clank, Ratchet and even Captain Qwark to gather enough evidence to set Ratchet free and discover who framed the innocent Lombax. [SCEA]… Expand"}, {"name": "Sonic the Hedgehog 4: Episode I", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-the-hedgehog-4-episode-i", "publisher": "Sega", "release_date": "Oct 13 2010", "developers": ["Dimps Corporation"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 72, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/8/adf2594c70488f606dcb0e6c755da2f2-98.jpg", "descriptions": "Sonic is back for his fourth installment in the classic 2D series, revamped from the ground up."}, {"name": "Outriders", "details_link": "https://www.metacritic.com/game/playstation-4/outriders", "publisher": "Square Enix", "release_date": "Apr  1 2021", "developers": ["Square Enix", "People Can Fly"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 3 ", "genres": ["General", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 72, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/1/85663ca9f63c6df733d5d38a1a211571-98.jpg", "descriptions": "Outriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you'll create your own Outrider and embark on a journey across the hostile planet. With rich storytelling spanning a diverse world, you'll leaveOutriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you'll create your own Outrider and embark on a journey across the hostile planet. With rich storytelling spanning a diverse world, you'll leave behind the slums and shanty towns of the First City and traverse forests, mountains and desert in the pursuit of a mysterious signal. Combining intense gunplay with violent powers and an arsenal of increasingly twisted weaponry and gear-sets, Outriders offers countless hours of gameplay from one of the finest shooter developers in the industry People Can Fly.… Expand"}, {"name": "Star Ocean 4: The Last Hope - 4K & Full HD Remaster", "details_link": "https://www.metacritic.com/game/playstation-4/star-ocean-4-the-last-hope---4k-full-hd-remaster", "publisher": "Square Enix", "release_date": "Nov 28 2017", "developers": ["Square Enix", "Tri-Ace"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/27cf5d8f50ab6011355e14b113e08d3f-98.jpg", "descriptions": "Earth has been decimated by World War III, and now, humanity must turn to the stars in search of a newhome. Explore the galaxy on your quest, make allies and enemies among the alien races you encounter, and uncover a danger so great that it threatens all of creation."}, {"name": "Ghost Blade HD", "details_link": "https://www.metacritic.com/game/xbox-one/ghost-blade-hd", "publisher": "HUCAST", "release_date": "Feb 28 2017", "developers": ["HUCAST"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/fe59f4d68b1f002d3dcb7bd81af6418c-98.jpg", "descriptions": "Ghost Blade HD is an intense bullet-hell shoot 'em up game, with satisfying and addictive score-based gameplay, with its tradition going back to the shooting games of the 1990s era. Designed with a modern graphic style and special effects, Ghost Blade also features a 2-player mode. GhostGhost Blade HD is an intense bullet-hell shoot 'em up game, with satisfying and addictive score-based gameplay, with its tradition going back to the shooting games of the 1990s era. Designed with a modern graphic style and special effects, Ghost Blade also features a 2-player mode. Ghost Blade HD Is easy to learn, yet hard to master. … Expand"}, {"name": "Minecraft: Story Mode - Episode 4: A Block and a Hard Place", "details_link": "https://www.metacritic.com/game/playstation-4/minecraft-story-mode---episode-4-a-block-and-a-hard-place", "publisher": "Telltale Games", "release_date": "Dec 22 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Linear", "Adventure", "Point-and-Click"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/4a61acaa40346fdd84455905361903dc-98.jpg", "descriptions": "Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon,Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your crew stumbles on something dreadful. Terror is unleashed, and your only hope is to track down the “Order of the Stone”, a fabled group of adventurers who slew the legendary Ender Dragon. But where are they? In a race against time, you will travel across the over-world, through the Nether, to The End, and beyond. [Telltale Games]… Expand"}, {"name": "Open Me!", "details_link": "https://www.metacritic.com/game/playstation-vita/open-me!", "publisher": "SCEA", "release_date": "Aug 13 2013", "developers": ["SCEI"], "platforms": "PlayStation Vita", "genres": ["Action", "General", "General"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/72e3c6a0d07b21e69a082774d0eba2cf-98.jpg", "descriptions": null}, {"name": "Ninja Gaiden Sigma Plus", "details_link": "https://www.metacritic.com/game/playstation-vita/ninja-gaiden-sigma-plus", "publisher": "Tecmo Koei Games", "release_date": "Feb 21 2012", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/17c58bd42b293a791cd6c3e5e2cac6ad-98.jpg", "descriptions": "Ninja Gaiden Sigma is an upgraded, more complete version of \"Ninja Gaiden Black.\" As a new element in this version, Rachel, the heroine, is playable. The main character Ryu Hayabusa also features new actions, new weapons, and new combinations. Of course, the level of visual detailNinja Gaiden Sigma is an upgraded, more complete version of \"Ninja Gaiden Black.\" As a new element in this version, Rachel, the heroine, is playable. The main character Ryu Hayabusa also features new actions, new weapons, and new combinations. Of course, the level of visual detail is enhanced from previous iterations.… Expand"}, {"name": "Bionicle Heroes", "details_link": "https://www.metacritic.com/game/ds/bionicle-heroes", "publisher": "Eidos Interactive", "release_date": "Nov 14 2006", "developers": ["Amaze Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Sci-Fi", "General", "Shooter", "First-Person", "Third-Person", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/b6711bbcc7e9352c8082ccae51cc1ef1-98.jpg", "descriptions": "Bionicle Heroes brings to life the most powerful and exciting LEGO characters ever seen in one game, in an action-packed world of adventure and discovery. Take control of a young hero as he steps out of the real world and into the strange and dangerous universe of Bionicle. Only by masteringBionicle Heroes brings to life the most powerful and exciting LEGO characters ever seen in one game, in an action-packed world of adventure and discovery. Take control of a young hero as he steps out of the real world and into the strange and dangerous universe of Bionicle. Only by mastering the powers and special abilities of the greatest Bionicle heroes will he be able to overcome the many challenges ahead. [Eidos Interactive]… Expand"}, {"name": "Super Robot Taisen: Original Generation", "details_link": "https://www.metacritic.com/game/game-boy-advance/super-robot-taisen-original-generation", "publisher": "Atlus Co.", "release_date": "Aug  8 2006", "developers": ["Banpresto"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Sci-Fi"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/34fc9bcaa267b7927bd0cafc96c52dc5-98.jpg", "descriptions": "Super Robot Taisen: Original Generation is a strategy RPG featuring detailed combat system, dozens of customizable mecha and 40+ hours of strategy RPG."}, {"name": "GoldenEye 007: Reloaded", "details_link": "https://www.metacritic.com/game/xbox-360/goldeneye-007-reloaded", "publisher": "Activision", "release_date": "Nov  1 2011", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PlayStation 3", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/1eb9af5c2cb4c567fbcb00bb6c9706d3-98.jpg", "descriptions": "GoldenEye 007: Reloaded is an innovative and contemporary take on the legendary James Bond adventure."}, {"name": "Call of Duty: Vanguard", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-vanguard", "publisher": "Activision", "release_date": "Nov  5 2021", "developers": ["Sledgehammer Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 72, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/1/6d6ede50d3d27685246f47da707542a9-98.jpg", "descriptions": "This is WWII combat like never before. Witness the origins of Special Forces as you play a pivotal role and change the face of history, forming Task Force One in a gripping Campaign across four major theaters of war. Become an original Special Forces Operator in an online Multiplayer rich inThis is WWII combat like never before. Witness the origins of Special Forces as you play a pivotal role and change the face of history, forming Task Force One in a gripping Campaign across four major theaters of war. Become an original Special Forces Operator in an online Multiplayer rich in innovation with 20 maps available at launch. Prepare for a franchise-first, universe-expanding Zombies crossover. Immerse yourself in a fully integrated Call of Duty®: Warzone™ experience featuring a new and massive map. This is the most connected Call of Duty ever, all powered by the next generation Call of Duty® engine introduced in Modern Warfare.… Expand"}, {"name": "Call of Juarez: Gunslinger", "details_link": "https://www.metacritic.com/game/switch/call-of-juarez-gunslinger", "publisher": "Techland", "release_date": "Dec 10 2019", "developers": ["Techland"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/57bf4e16e818630319335acddc2c03b2-98.jpg", "descriptions": "From the dust of a gold mine to the dirt of a saloon, Call of Juarez Gunslinger is a real homage to the Wild West tales. Live the epic and violent journey of a ruthless bounty hunter onto the trail of the West's most notorious outlaws. Blurring the lines between man and myth, this adventureFrom the dust of a gold mine to the dirt of a saloon, Call of Juarez Gunslinger is a real homage to the Wild West tales. Live the epic and violent journey of a ruthless bounty hunter onto the trail of the West's most notorious outlaws. Blurring the lines between man and myth, this adventure made of memorable encounters unveils the untold truth behind some of the greatest legends of the Old West.… Expand"}, {"name": "The Mage's Tale", "details_link": "https://www.metacritic.com/game/pc/the-mages-tale", "publisher": "InXile Entertainment", "release_date": "Jun 20 2017", "developers": ["InXile Entertainment"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/8af1c6d0b8ac4f9aa6858bd08b1a205f-98.jpg", "descriptions": "Welcome, apprentice of the mystic arts! The corrupt wizard Gaufroi has kidnapped your master, Mage Alguin, and only you have any hope of saving him. You may be an apprentice now, but to save your master, you will need to explore ten deadly dungeons, decipher mind-bending puzzles, avoidWelcome, apprentice of the mystic arts! The corrupt wizard Gaufroi has kidnapped your master, Mage Alguin, and only you have any hope of saving him. You may be an apprentice now, but to save your master, you will need to explore ten deadly dungeons, decipher mind-bending puzzles, avoid terrifying traps, and vanquish hordes of vicious monsters. Until you are able to wield every elemental power in the palm of your hand, evil remains ascendant. It is your turn now to sling gouts of flame, javelins of ice, arcs of lightning, and swirling tempests. Don your wizard’s robe and begin your Mage’s Tale. [Oculus]… Expand"}, {"name": "Danganronpa Another Episode: Ultra Despair Girls", "details_link": "https://www.metacritic.com/game/playstation-vita/danganronpa-another-episode-ultra-despair-girls", "publisher": "NIS America", "release_date": "Sep  1 2015", "developers": ["Spike Chunsoft"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/c7f9ed55a154b62167448acbba52d3cd-98.jpg", "descriptions": "After the horrors have ended at Hope's Peak Academy, society is on the verge of collapse and violent anarchy has engulfed the whole world in despair. Danganronpa Another Episode: Ultra Despair Girls is the pre-sequel to the mystery adventure game Danganronpa 2: Goodbye Despair. Unlike theAfter the horrors have ended at Hope's Peak Academy, society is on the verge of collapse and violent anarchy has engulfed the whole world in despair. Danganronpa Another Episode: Ultra Despair Girls is the pre-sequel to the mystery adventure game Danganronpa 2: Goodbye Despair. Unlike the first 2 installments, players assume the roles of two heroines, Komaru Naegi and Toko Fukawa, as they are thrust into a despair-ridden Towa City with one goal: to escape.… Expand"}, {"name": "Dead or Alive 6", "details_link": "https://www.metacritic.com/game/playstation-4/dead-or-alive-6", "publisher": "Team Ninja", "release_date": "Mar  1 2019", "developers": ["Team Ninja", "Koei Tecmo Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/cc8ef76777050f0bc12087e2457e0370-98.jpg", "descriptions": "DEAD OR ALIVE 6 is a fast-paced 3D fighting game, produced by Koei Tecmo Games, featuring graphics and multi-tiered stages that create a truly entertaining competitive experience. The story follows the events of DEAD OR ALIVE 5, focusing on 2 separate main narratives; namely, the battleDEAD OR ALIVE 6 is a fast-paced 3D fighting game, produced by Koei Tecmo Games, featuring graphics and multi-tiered stages that create a truly entertaining competitive experience. The story follows the events of DEAD OR ALIVE 5, focusing on 2 separate main narratives; namely, the battle between “Ninja and DOATEC” versus “M.I.S.T. lead by Donovan”, and the events that occur during the 6th DEAD OR ALIVE Tournament. New side story episodes will also be added for returning characters. Following the tradition, fights in DEAD OR ALIVE 6 are based on a triangle system: strikes beat throws, throws beat holds, and holds beat strikes. Landing a well-timed attack of the type that beats your opponent’s attack, like landing a strike when an opponent tries to throw, will result in a Hi Counter attack and do more damage.… Expand"}, {"name": "NASCAR 07", "details_link": "https://www.metacritic.com/game/xbox/nascar-07", "publisher": "EA Sports", "release_date": "Sep  6 2006", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/475765b15fa5ed14a0db7eed7b0a2f78-98.jpg", "descriptions": "Take risks, be rewarded, and become a champion with NASCAR 07. With all-new Adrenaline Moments, use your skill and instinct during the most intense situations and control the outcome by avoiding disastrous wrecks and flying debris. Maintain your focus on dangerous conditions ahead with theTake risks, be rewarded, and become a champion with NASCAR 07. With all-new Adrenaline Moments, use your skill and instinct during the most intense situations and control the outcome by avoiding disastrous wrecks and flying debris. Maintain your focus on dangerous conditions ahead with the new RaceBreaker feature, which guides you through every treacherous moment of the race. With all-new speed blurring, realistic spark and smoke effects, and camera shakes, get your adrenaline pumping and experience the all-out drama and intensity of 190-mph racing with NASCAR 07. Developed by EA Tiburon, NASCAR 07 will be available for the Xbox and the PlayStation 2 console and as NASCAR on the PSP system in September.… Expand"}, {"name": "Hexic 2", "details_link": "https://www.metacritic.com/game/xbox-360/hexic-2", "publisher": "Microsoft Game Studios", "release_date": "Aug 15 2007", "developers": ["Carbonated Games"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 72, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/a2e95e7531da69bc1ccf0e3168a78edb-98.jpg", "descriptions": "[Xbox Live Arcade] Building on the success of Hexic HD, Hexic 2 brings all-new pieces to the board in a very literal way. The basic gameplay is straightforward, familiar, and addictive—just spin a trio of hexes to create a group of three or more matching colors, or build a formation of hexes[Xbox Live Arcade] Building on the success of Hexic HD, Hexic 2 brings all-new pieces to the board in a very literal way. The basic gameplay is straightforward, familiar, and addictive—just spin a trio of hexes to create a group of three or more matching colors, or build a formation of hexes to create more advanced pieces. Whether you want a relaxing puzzle break or a frantic race against the clock, Hexic 2 has you covered. All-new special pieces, different formations, and modes keep Hexic 2 challenging even for the veteran Hexic player. Multiplayer competition: Amp up the gaming excitement playing multiplayer over Xbox Live (up to 2 players) in Battle Mode. The gameplay is straightforward, approachable, and highly addictive. The game is rendered in full 3-D with stunning special effects such as reflections, glow, and spectacular highlights. [Microsoft]… Expand"}, {"name": "Divinity II: Ego Draconis", "details_link": "https://www.metacritic.com/game/pc/divinity-ii-ego-draconis", "publisher": "cdv Software", "release_date": "Jan  5 2010", "developers": ["Larian Studios Games"], "platforms": ["Xbox 360", "PC"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/27bbc0fc13fae95f8548acfcc38cbdac-98.jpg", "descriptions": "Divinity II: Ego Draconis is a story-based role playing game that combines a truly stunning, free roaming world just waiting to be explored, with exhilarating aerial and ground based combat. Get up close and personal in human form - exploring dungeons, grabbing loot and putting the hurt onDivinity II: Ego Draconis is a story-based role playing game that combines a truly stunning, free roaming world just waiting to be explored, with exhilarating aerial and ground based combat. Get up close and personal in human form - exploring dungeons, grabbing loot and putting the hurt on the many evil denizens of Rivellon - or take to the skies by shape-shifting into a mighty Dragon to explore the mountain peaks and deliver fiery death from above! You will build your character from the ground up, and continue customizing as you gain experience. We want you to be able to define a unique Dragon Knight and create your own legend in the world of Divinity II. [DTP Entertainment]… Expand"}, {"name": "The Liar Princess and the Blind Prince", "details_link": "https://www.metacritic.com/game/switch/the-liar-princess-and-the-blind-prince", "publisher": "NIS America", "release_date": "Feb 12 2019", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/678fc015ab2edcd58086b9c48efe40bd-98.jpg", "descriptions": "Seemingly plucked from the pages of an ancient fairy tale, The Liar Princess and the Blind Prince tells the story of a solitary wolf, who sings a beautiful melody in her loneliness, and the young prince who seeks out the voice's origins. Upon finding its source, the prince inadvertentlySeemingly plucked from the pages of an ancient fairy tale, The Liar Princess and the Blind Prince tells the story of a solitary wolf, who sings a beautiful melody in her loneliness, and the young prince who seeks out the voice's origins. Upon finding its source, the prince inadvertently startles the wolf, who blinds him by accident. When the prince is locked away, the wolf seeks to free him and restore his sight. The wolf visits the witch of the forest to receive a human form so that the prince could no longer be harmed. In exchange for her singing voice, the wolf becomes a princess and returns to the blind prince. The two then embark on a dangerous journey to bring the prince to the witch of the forest and heal his eyesight. All will be revealed in this beautiful, haunting fairy tale of love and loss.... … Expand"}, {"name": "The Station", "details_link": "https://www.metacritic.com/game/pc/the-station", "publisher": "The Station", "release_date": "Feb 19 2018", "developers": ["The Station"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/2217a13cb4c5e47cd50bbc12b9248c52-98.jpg", "descriptions": "The Station is a first-person sci-fi mystery set on a space station sent to study a sentient alien civilization. Assuming the role of a recon specialist, players must unravel a mystery which will decide the fate of two civilizations."}, {"name": "Never Alone", "details_link": "https://www.metacritic.com/game/pc/never-alone", "publisher": "E-Line Media", "release_date": "Nov 18 2014", "developers": ["Upper One Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox One", "PC"], "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/a216d8e944be79a596b26cf277ea6328-98.jpg", "descriptions": "Developed in partnership with the Alaska Native community, Never Alone (Kisima Ingitchuna) is an atmospheric puzzle platformer that explores the harsh and dynamic world of Alaska Native stories. Delve deeply into the traditional lore of the Inupiat people of the Arctic."}, {"name": "Wonderbook: Book of Spells", "details_link": "https://www.metacritic.com/game/playstation-3/wonderbook-book-of-spells", "publisher": "SCEA", "release_date": "Nov 13 2012", "developers": ["SCEE London Studio"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "General"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/2fa3f95689fe46ea96d434c74aa9d865-98.jpg", "descriptions": "Book of Spells is a single-player virtual reading/entertainment experience exclusive to the PlayStation 3 and the first title for Wonderbook."}, {"name": "Mevo & the Grooveriders", "details_link": "https://www.metacritic.com/game/pc/mevo-the-grooveriders", "publisher": "Red Rocket Games", "release_date": "Mar 20 2009", "developers": ["Red Rocket Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/7698b25f20cc7f52a79e768fc2de511d-98.jpg", "descriptions": "In MEVO's quest to reunite his band, bring back 'FUNK', and defeat the enemy SILENCE, players must successfully progress through five beautifully crafted worlds (Ocean, Jungle, Desert, Space and Wormhole), finding avatars along the way that will help our reluctant hero unlock other levelsIn MEVO's quest to reunite his band, bring back 'FUNK', and defeat the enemy SILENCE, players must successfully progress through five beautifully crafted worlds (Ocean, Jungle, Desert, Space and Wormhole), finding avatars along the way that will help our reluctant hero unlock other levels and reach certain scores. Using a simple 2-key tap system (space bar and enter), players tap out the beats to re-energize MEVO and push him forward. As the game progresses, the beat sequences become more complex, evolving from basic single beats to rapid beats, combinations, sequences and long-hold sustains with breaks. By successfully completing the levels, players can access new areas and songs, or be rewarded with in-game items, such as avatar pieces that are needed to activate power-ups. Power-ups include slow mo, shield up, \"perfect boost\" scoring, and autopilot. No matter what skill level, players are rewarded with avatars, dance packs and badges to help progress through the game. Even though the game is accessible and easy to play for all levels of players, advanced players will be challenged with the game's multiple layers of game play, including hidden levels, power-ups, badges and dance packs. [Steam]… Expand"}, {"name": "Marvel's Guardians of the Galaxy - Episode 3: More Than A Feeling", "details_link": "https://www.metacritic.com/game/pc/marvels-guardians-of-the-galaxy---episode-3-more-than-a-feeling", "publisher": "Telltale Games", "release_date": "Aug 22 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/ba82cc0ce49f1fe428880046643a9304-98.jpg", "descriptions": "In the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-partIn the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-part episodic series puts you in the rocket-powered boots of Star-Lord in an original Guardians adventure.… Expand"}, {"name": "The Deadly Tower of Monsters", "details_link": "https://www.metacritic.com/game/playstation-4/the-deadly-tower-of-monsters", "publisher": "Atlus", "release_date": "Jan 19 2016", "developers": ["ACE Team"], "platforms": ["PC", "PlayStation 4"], "genres": ["General", "Action Adventure", "Linear"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/1250b3e2fe686bb2d02961598aee0fac-98.jpg", "descriptions": "Fire up your ray guns, crystal swords, and laser whips, and get ready for thrills and chills! With three incredible movie stars playing out decidedly B-level sci-fi exploits, Dick Starspeed, Scarlet Nova, and Robot will have you ready to jump off the side of the tower--right into adventure!"}, {"name": "Cris Tales", "details_link": "https://www.metacritic.com/game/switch/cris-tales", "publisher": "Modus Games", "release_date": "Jul 20 2021", "developers": ["Dreams Uncorporated"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/4e48d84ee11bdf7797ed97b0ffb987af-98.jpg", "descriptions": "Cris Tales is a gorgeous, indie love letter to classic JRPGs with a new perspective. Peer into the past, act in the present, and watch as your choices dynamically change the future -- all on one screen as you play! Join the newly awakened Time Mage Crisbell and her fantastical companions onCris Tales is a gorgeous, indie love letter to classic JRPGs with a new perspective. Peer into the past, act in the present, and watch as your choices dynamically change the future -- all on one screen as you play! Join the newly awakened Time Mage Crisbell and her fantastical companions on their journey across a dark, fairytale world facing a grim future.Crisbell must embark across Crystallis and the four Kingdoms in a bid to stop the powerful Time Empress and rewrite the future of the world and all those living in it. Along the way, she'll meet and recruit powerful allies with their own unique stories and skills like Matias the Frog and Willhelm the Child Mage.As she explores the world and meets her unique companions, Crisbell will have to make choices with far-reaching consequences for the people she meets consequences that will impact the world you'll experience in real-time throughout your journey. Each companion will be invaluable as you face these choices and the myriad enemies who stand in your way. Will you buffet them with attacks, or discover creative ways to use Crisbell's time powers to alter the reality of each fight?… Expand"}, {"name": "Just Dance 2017", "details_link": "https://www.metacritic.com/game/switch/just-dance-2017", "publisher": "Ubisoft", "release_date": "Mar  3 2017", "developers": ["Ubisoft Paris"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 72, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/3370b0a3cbdf5113b8c3265b9938e908-98.jpg", "descriptions": "Grab your friends and family because it's time to dance! The biggest music video game franchise of all time is back, with over 60 million units sold. Just Dance 2017 brings you over 40 new tracks, six game modes, updated content all year long and access to 200+ songs through Just DanceGrab your friends and family because it's time to dance! The biggest music video game franchise of all time is back, with over 60 million units sold. Just Dance 2017 brings you over 40 new tracks, six game modes, updated content all year long and access to 200+ songs through Just Dance Unlimited! \r\rJoin a community of more than 118 million players around the world and bust out your best moves! Dance your heart out to Cheap Thrills by Sia Ft. Sean Paul, Lean On by Major Lazer & DJ Snake Ft. MO, and Sorry by Justin Bieber. Relive classics including Don't Stop Me Now by Queen, or if J-Pop is your thing get down to Po Pi Po by Hatsune Miku!… Expand"}, {"name": "Auto Assault", "details_link": "https://www.metacritic.com/game/pc/auto-assault", "publisher": "NCSOFT", "release_date": "Apr 13 2006", "developers": ["NetDevil"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/c9f1e3cff237b2e3f3e3ad237bf83823-98.jpg", "descriptions": "Combine fast-paced vehicular combat with high-tech, futuristic weaponry and hundreds of intense skills and you get Auto Assault -- a unique departure from traditional Massively Multiplayer Online Role Playing Games (MMORPGs). Hop in your own customized cars, semis, and motorcycles andCombine fast-paced vehicular combat with high-tech, futuristic weaponry and hundreds of intense skills and you get Auto Assault -- a unique departure from traditional Massively Multiplayer Online Role Playing Games (MMORPGs). Hop in your own customized cars, semis, and motorcycles and prepare to fight the mutated creatures and bandits of Auto Assault's post-apocalyptic world. Battle other players both in arenas and in epic race vs. race wars for control of the regions in a devastated Earth. Auto Assault uses the power of the Havok physics engine to let you make insane jumps, send obstacles flying and even blast bridges, buildings, fences and trees with your car-mounted rockets. Anything you can hit, you can destroy. [NCsoft]… Expand"}, {"name": "Dex", "details_link": "https://www.metacritic.com/game/switch/dex", "publisher": "QubicGames", "release_date": "Jul 24 2020", "developers": ["QubicGames"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/558a88b1ae4f815e73a5c680f5e38ef3-98.jpg", "descriptions": "Discover the truth behind an enigmatic AI striving to reach the Singularity, a theoretical event horizon in which artificial intelligence will surpass human intelligence and all bets about the future will be off. How will you play your part in the story?\r Explore the futuristic city ofDiscover the truth behind an enigmatic AI striving to reach the Singularity, a theoretical event horizon in which artificial intelligence will surpass human intelligence and all bets about the future will be off. How will you play your part in the story?\r Explore the futuristic city of Harbor Prime and meet its many inhabitants, answer the challenges the city has to offer, roam the neon-lit streets, and augment your character with skills and implants.\r Designed as a tribute to the classic RPGs from the 90s, updated for a modern audience, Dex invites you to become part of a living, breathing cyberpunk universe as you decide which ultimate path you will embrace.… Expand"}, {"name": "Horizons: Empire of Istaria", "details_link": "https://www.metacritic.com/game/pc/horizons-empire-of-istaria", "publisher": "Atari", "release_date": "Dec  8 2003", "developers": ["Artifact Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/a10b77daf5ac8607453caf1df289dace-98.jpg", "descriptions": "Horizons is an MMORPG set in a world of legend and lore. Filled with humans, elves, dragons and many other creatures and races, Horizons allows players to adventure alone or together in a world of boundless excitement, exploration and if they choose it ? danger. Horizons is filled withHorizons is an MMORPG set in a world of legend and lore. Filled with humans, elves, dragons and many other creatures and races, Horizons allows players to adventure alone or together in a world of boundless excitement, exploration and if they choose it ? danger. Horizons is filled with cities and towns, castles and strongholds, villages and mystical structures, in environments ranging from tropical jungle to arctic tundra to windswept plains and mountainous wilderness. Players may choose their path within the world ? Explorer, Miner, Crafter, Wizard, Warrior or Settler of the new frontier. Live in the civilization of the Empire or venture into the unknown and create an empire of your own. [Atari]… Expand"}, {"name": "XIII", "details_link": "https://www.metacritic.com/game/pc/xiii", "publisher": "Ubisoft", "release_date": "Nov 18 2003", "developers": ["Ubisoft Paris"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/d9a61c567d56b8729706eb84e0050209-98.jpg", "descriptions": "The President of the United States of America has been assassinated. You wake up on a desolate strip of New England beach. The near-fatal impact of a bullet has left your head pounding, and your memory erased. What's more, the number \"XIII\" has been mysteriously tattooed on your chest, whileThe President of the United States of America has been assassinated. You wake up on a desolate strip of New England beach. The near-fatal impact of a bullet has left your head pounding, and your memory erased. What's more, the number \"XIII\" has been mysteriously tattooed on your chest, while your pocket holds a key to a New York City bank box. Head swimming in amnesia, you struggle to your feet only to encounter more assailants intent on finishing the job. To your shock, you handle the hitmen with the killing skills of a professional - before heading to the bank in search of any shred of information about your lost identity and your involvement in the President's murder. What lies ahead is a deadly quest not only into your shadowy past, but America's darkest corridors of power. [Ubi Soft]… Expand"}, {"name": "Arc the Lad: Twilight of the Spirits", "details_link": "https://www.metacritic.com/game/playstation-2/arc-the-lad-twilight-of-the-spirits", "publisher": "SCEA", "release_date": "Jun 25 2003", "developers": ["Cattle Call"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/e564899158df34068680a0094679e23f-98.jpg", "descriptions": "Twilight of the Spirits is the first game in the series to be presented entirely in realtime 3D, and breaks significantly with the connected storyline of Arcs one through three. Set some thousands of years after that story concluded, it tells the story of two brothers -- one demon, one humanTwilight of the Spirits is the first game in the series to be presented entirely in realtime 3D, and breaks significantly with the connected storyline of Arcs one through three. Set some thousands of years after that story concluded, it tells the story of two brothers -- one demon, one human -- whose lives intersect across a 60-hour quest. [Sony]… Expand"}, {"name": "Disney Golf", "details_link": "https://www.metacritic.com/game/playstation-2/disney-golf", "publisher": "EA Games", "release_date": "Oct 16 2002", "developers": ["T&E Soft"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/d81734f5574950425677afc824dfea88-98.jpg", "descriptions": "It's Golf, Disney style! Take a magical trip to the links with your favorite Disney characters. Fun and challenging for all ages with several different modes of play including Match, Stroke, Skins, Best-Ball and a \"simple mode\" to even the odds for younger players. With six unique coursesIt's Golf, Disney style! Take a magical trip to the links with your favorite Disney characters. Fun and challenging for all ages with several different modes of play including Match, Stroke, Skins, Best-Ball and a \"simple mode\" to even the odds for younger players. With six unique courses and over 60 collectable power-ups, Disney Golf is entertaining, colorful, magical, and most of all... fun! [Electronic Arts]… Expand"}, {"name": "Defender of the Crown", "details_link": "https://www.metacritic.com/game/game-boy-advance/defender-of-the-crown", "publisher": "Metro3D", "release_date": "Oct  7 2002", "developers": ["Crawfish Interactive"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 72, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/8/efa418efa731bea6767d159c6f0b7278-98.jpg", "descriptions": "It is a time of lusty wenches and black-hearted villains. King Richard has been slain and all of England is thrown into civil war. Only one person can lead the country to peace. Lay seige to castles and raid enemy strongholds to recover the lost crown. Enlist the aid of Robin Hood and outwitIt is a time of lusty wenches and black-hearted villains. King Richard has been slain and all of England is thrown into civil war. Only one person can lead the country to peace. Lay seige to castles and raid enemy strongholds to recover the lost crown. Enlist the aid of Robin Hood and outwit the vile Normans to restore order to the war-torn land. Face your foes on the battlefield or in grand tournaments of chivalry.… Expand"}, {"name": "Namco Museum", "details_link": "https://www.metacritic.com/game/playstation-2/namco-museum", "publisher": "Namco", "release_date": "Dec  4 2001", "developers": ["Mass Media"], "platforms": ["Switch", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/740572c8265b5cd0aef7f46d7916a582-98.jpg", "descriptions": "Includes classic Namco arcade hits such as Pac-Man, Ms. Pac-Man, Galaga, Galaxian, Dig Dug and Pole Position. But the fun doesn't stop there, since Namco has added all new arrangement modes plus other hidden games. [Namco]"}, {"name": "X-Men: Mutant Academy 2", "details_link": "https://www.metacritic.com/game/playstation/x-men-mutant-academy-2", "publisher": "Activision", "release_date": "Sep 17 2001", "developers": ["Paradox Development"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/7815dbf52d15b769b4107920946aff5c-98.jpg", "descriptions": "Train with Professor X to unleash your super-powers and polish your combat skills. Master all-new, over-the-top moves-including aerial combat-as you fight through the ranks of mutants and prove you have what it takes to earn X-MEN status. Plus, get a behind-the-scenes look at X-MEN the MovieTrain with Professor X to unleash your super-powers and polish your combat skills. Master all-new, over-the-top moves-including aerial combat-as you fight through the ranks of mutants and prove you have what it takes to earn X-MEN status. Plus, get a behind-the-scenes look at X-MEN the Movie concept sketches, costumes and more!… Expand"}, {"name": "Anarchy Online", "details_link": "https://www.metacritic.com/game/pc/anarchy-online", "publisher": "Fun Com", "release_date": "Jun 26 2001", "developers": ["Funcom"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/4196d343d0cf149e37f61314b1e2988e-98.jpg", "descriptions": "Funcom's massively multiplayer science-fiction online role-playing game, referred to as a \"sci-fi Everquest\" & fraught with bugginess and stability issues upon release, caused some critics to lose sleep over whether to review the game out of the box or after the release of routine patches."}, {"name": "Earthworm Jim", "details_link": "https://www.metacritic.com/game/game-boy-advance/earthworm-jim", "publisher": "Majesco Games", "release_date": "Jun 10 2001", "developers": ["Game Titan"], "platforms": ["iPhone/iPad", "PC", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/9302222324b039457b435c2b35a97400-98.jpg", "descriptions": "Left unconscious by a massive cow-induced blow to the head and clad in his indestructible, high-tech super suit, Earthworm Jim continues the battle for truth, justice and well aerated soil. He sure is going to need your to guide him through his 3D fun-house of a brain. But beware, there isLeft unconscious by a massive cow-induced blow to the head and clad in his indestructible, high-tech super suit, Earthworm Jim continues the battle for truth, justice and well aerated soil. He sure is going to need your to guide him through his 3D fun-house of a brain. But beware, there is an evil lurking, a presence in his mind, a dark unseen force at work - Jim's brain is a dangerous place!… Expand"}, {"name": "Riddle of the Sphinx: An Egyptian Adventure", "details_link": "https://www.metacritic.com/game/pc/riddle-of-the-sphinx-an-egyptian-adventure", "publisher": "DreamCatcher Interactive", "release_date": "Dec  5 2000", "developers": ["Omni Creative Group"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/8544a8f8c0de185ac64b4468e1bd2218-98.jpg", "descriptions": "Riddle of the Sphinx makes up for its technical shortcomings with a great location and an impressive amount of detail."}, {"name": "The Last Tinker: City of Colors", "details_link": "https://www.metacritic.com/game/pc/the-last-tinker-city-of-colors", "publisher": "Unity Games", "release_date": "May 12 2014", "developers": ["Mimimi Productions"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Linear", "3D"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/fbc7b195559d1adee6afa31b06d2ea72-98.jpg", "descriptions": "The indie-developed rebirth of platform games.\r A joyous platformer frequently compared to Jak and Daxter, The Last Tinker is a colorful adventure set in Colortown, a world built upon creativity, emotion and collaboration. A dark force named The Bleakness has emerged and seeks to tear theThe indie-developed rebirth of platform games.\r A joyous platformer frequently compared to Jak and Daxter, The Last Tinker is a colorful adventure set in Colortown, a world built upon creativity, emotion and collaboration. A dark force named The Bleakness has emerged and seeks to tear the colors apart, draining all joy and life from the world. Koru, a young boy from the slums of Colortown, is forced to act. He embarks on an epic and one of a kind adventure to combat the Bleakness and to restore joy and color to his home.… Expand"}, {"name": "Zombie Army Trilogy", "details_link": "https://www.metacritic.com/game/pc/zombie-army-trilogy", "publisher": "Rebellion", "release_date": "Mar  6 2015", "developers": ["Rebellion"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Sci-Fi", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/bff9a9a3cfba343dcbd463c95d70fdc6-98.jpg", "descriptions": "The cult horror shooter series comes to an apocalyptic end with an epic new 3rd chapter, a new horde mode, and remastered editions of the best-selling Nazi Zombie Army 1 & 2."}, {"name": "Flotilla", "details_link": "https://www.metacritic.com/game/pc/flotilla", "publisher": "Brendon Chung", "release_date": "Feb 26 2010", "developers": ["Brendon Chung"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "General"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/3b212ba25016af36bac56e5fe801ed4c-98.jpg", "descriptions": "Flotilla is a turn-by-turn space action exploration game."}, {"name": "Republique", "details_link": "https://www.metacritic.com/game/playstation-4/republique", "publisher": "GungHo", "release_date": "Mar 22 2016", "developers": ["Camouflaj", "LLC"], "platforms": ["PC", "Stadia", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 72, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/dded953e468cb1ed3330824de5ace13d-98.jpg", "descriptions": "In République on PS4, players finally take full control of Hope, a young woman held captive inside Metamorphosis, a shadowy totalitarian state ruled by the omnipresent Overseer. By hacking into this secret nation’s elaborate surveillance network, players and Hope begin a treacherous journeyIn République on PS4, players finally take full control of Hope, a young woman held captive inside Metamorphosis, a shadowy totalitarian state ruled by the omnipresent Overseer. By hacking into this secret nation’s elaborate surveillance network, players and Hope begin a treacherous journey to freedom.… Expand"}, {"name": "Vampyr", "details_link": "https://www.metacritic.com/game/pc/vampyr", "publisher": "Focus Home Interactive", "release_date": "Jun  4 2018", "developers": ["DONTNOD Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/a9cefb9ac021ab3793ac774f75a3868d-98.jpg", "descriptions": "Vampyr is set in early 20th century Britain as the country is gripped by the lethal Spanish flu and the streets of London are crippled by disease, violence and fear. In a disorganized and ghostly city, those foolish, desperate, or unlucky enough to walk the streets lay prey to Britain’s mostVampyr is set in early 20th century Britain as the country is gripped by the lethal Spanish flu and the streets of London are crippled by disease, violence and fear. In a disorganized and ghostly city, those foolish, desperate, or unlucky enough to walk the streets lay prey to Britain’s most elusive predators: the vampires. Emerging from the chaos, a tormented figure awakens. You are Jonathan E. Reid, a high-ranking military surgeon transformed into a vampire upon his return home from the frontline.  Explore the darkly atmospheric streets of early 20th century London, and interact with a multitude of characters with their own identities and importance. Accept and fulfill the missions they give you, but don’t forget: sooner or later, you will have to feed, and make a difficult choice... who will be your prey? Absolutely all characters in the game are potential victims of your vampiric lust. Carefully study the habits of your next victim, his or her relationships with other characters, and set up your strategy to feed, unnoticed: seduce them, change their daily habits, or make sure they end up alone in a dark street…  Be careful who you choose to hunt, as they will be gone forever, and their death will impact in a meaningful way the world that surrounds you. Feeding on human blood will not just keep you 'alive;' it will also unlock new vampiric powers to use. [Focus Home]… Expand"}, {"name": "Destroy All Humans! 2 - Reprobed", "details_link": "https://www.metacritic.com/game/xbox-series-x/destroy-all-humans!-2---reprobed", "publisher": "THQ Nordic", "release_date": "Aug 30 2022", "developers": ["Black Forest Games"], "platforms": ["PC", "PlayStation 5", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/559b109a5c5403b669230ec639d4c6fd-98.jpg", "descriptions": "Crypto is back with a license to probe. The alien invader returns, groovier than ever. Experience the swinging '60s in all its chemical-induced glory and take revenge on the KGB for blowing up your mothership. You'll have to form alliances with members of the very species you came to enslave."}, {"name": "Tanuki Justice", "details_link": "https://www.metacritic.com/game/switch/tanuki-justice", "publisher": "No Gravity Games", "release_date": "Dec 10 2020", "developers": ["Wonderboy Bobi"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/6158623a3e3ef896fb3fba337e8586db-98.jpg", "descriptions": "Inconspicuous combination of a platformer bullet hell with cute, pixel graphics. Tanuki Justice will challenge your precision jumping and shuriken throwing skills.\r Features:\r\n• Dynamic gameplay with visuals that fit the atmosphere.\r\n• Dozens of different types of enemies.\r\n• ClassicalInconspicuous combination of a platformer bullet hell with cute, pixel graphics. Tanuki Justice will challenge your precision jumping and shuriken throwing skills.\r Features:\r• Dynamic gameplay with visuals that fit the atmosphere.\r• Dozens of different types of enemies.\r• Classical shurikens over the head and a giant shuriken for difficult moments.\r• Playable in single or two-player mode.\r Description:\rTanuki Justice is a continuous intensive action run’n gun in which you incarnate a tanuki brother and sister. You’ll face hundreds of enemies in feudal Japan. Varied environments with landscapes of all kinds, retro and fast rhythmic music, numerous and difficult situations reminiscent of good old arcade games. A gameplay both simple and rich allowing spectacular actions. Possibility to play with 2 people for even more fun. And challenges that will challenge even the most skilled players. Time will be your worst enemy.\r… Expand"}, {"name": "DIRT 5", "details_link": "https://www.metacritic.com/game/pc/dirt-5", "publisher": "Deep Silver", "release_date": "Nov  6 2020", "developers": ["Codemasters"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 72, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/24c3da19c1740421954fe692254acb0a-98.jpg", "descriptions": "Take a trip around the world to and race on over 70+ unique routes across 10 different global locations in stunning environments complete with dynamic weather and time of day. Get behind the wheel of an eclectic and exciting roster of cars. World-renowned voice talents troy baker and nolanTake a trip around the world to and race on over 70+ unique routes across 10 different global locations in stunning environments complete with dynamic weather and time of day. Get behind the wheel of an eclectic and exciting roster of cars. World-renowned voice talents troy baker and nolan north head up the cast of dirt 5's story-driven Career mode. Local split-screen of up to four players on offline modes, including Career, makes dirt 5 the perfect couch multiplayer racing game as you battle for position with your friends. Capture your biggest jumps and best moves with a detailed photo mode, and show your creative flair with dirt's deepest ever livery editor for all cars.\r… Expand"}, {"name": "imprint-X", "details_link": "https://www.metacritic.com/game/pc/imprint-x", "publisher": "Morgondag", "release_date": "Jan 26 2017", "developers": ["Morgondag"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/737a376db9a5917fd8b205557e83ec00-98.jpg", "descriptions": "A button-based puzzle game containing 100 levels to unlock and 700 buttons to press. You are one of the hacker clones, saving intellects by hacking into infected brains and defeating the mysterious Wardens."}, {"name": "Hasbro Family Game Night: Battleship", "details_link": "https://www.metacritic.com/game/xbox-360/hasbro-family-game-night-battleship", "publisher": "Electronic Arts", "release_date": "Mar 18 2009", "developers": ["Electronic Arts"], "platforms": "Xbox 360", "genres": ["Miscellaneous", "Board Games", "Board / Card Game"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/662928e91f612aa4206e0b79a8ee30fc-98.jpg", "descriptions": "[Xbox Live Arcade]  Join your host Mr. Potato Head as you play your favorite Hasbro games including CONNECT FOUR, BATTLESHIP, YAHTZEE, BOGGLE, SORRY! and SORRY! Sliders, as well as exciting new versions created for Xbox LIVE Arcade in Hasbro Family Game Night. Great family games: Play all[Xbox Live Arcade]  Join your host Mr. Potato Head as you play your favorite Hasbro games including CONNECT FOUR, BATTLESHIP, YAHTZEE, BOGGLE, SORRY! and SORRY! Sliders, as well as exciting new versions created for Xbox LIVE Arcade in Hasbro Family Game Night. Great family games: Play all your favorite Hasbro games that you know and love so well. Exciting new versions: And play those games like never before with exciting new variants including CONNECT 4 Power Chips, BOGGLE Portal Cubes, Reverse YAHTZEE, and BATTLESHIP Barrage! Customized game room: Choose the game room theme that's right for you. Earn new game themed trophies, furniture, and decorations to customize your game room. Party time: Build a custom Party Game by choosing your favorite games, number of players, and time you want to play. [Electronic Arts]… Expand"}, {"name": "Darksiders II: Deathinitive Edition", "details_link": "https://www.metacritic.com/game/playstation-4/darksiders-ii-deathinitive-edition", "publisher": "Nordic Games Publishing", "release_date": "Oct 30 2015", "developers": ["Gunfire Games"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/b13a2c2117049705add39994c43e6b1f-98.jpg", "descriptions": "Darksiders II follows the actions of Death, one of the four horsemen of the Apocalypse, in a tale that runs parallel to the events in the original Darksiders game. This journey propels Death across an expansive game world as he tries to redeem his brother, War, the horseman blamed forDarksiders II follows the actions of Death, one of the four horsemen of the Apocalypse, in a tale that runs parallel to the events in the original Darksiders game. This journey propels Death across an expansive game world as he tries to redeem his brother, War, the horseman blamed for prematurely starting the Apocalypse in Darksiders. … Expand"}, {"name": "Need for Speed: Most Wanted 5-1-0", "details_link": "https://www.metacritic.com/game/psp/need-for-speed-most-wanted-5-1-0", "publisher": "Electronic Arts", "release_date": "Nov 15 2005", "developers": ["EA Canada"], "platforms": ["PC", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/87b0dc975cc61c0881fbf0f368daea7c-98.jpg", "descriptions": "Combining the thrill of illicit street racing and tuner customization with the intensity of strategic police pursuits that rivals any Hollywood-style chase scene, Need for Speed Most Wanted challenges players to become the most notorious and elusive street racer. Players instantly feel theCombining the thrill of illicit street racing and tuner customization with the intensity of strategic police pursuits that rivals any Hollywood-style chase scene, Need for Speed Most Wanted challenges players to become the most notorious and elusive street racer. Players instantly feel the thrill of the ride as they hit the streets in an open world environment where drivers can tune their cars to compete against any class of vehicles or use their wits to out-fox the law to satisfy their need for speed. Need for Speed Most Wanted delivers a unique, fast-paced and gripping ride in the racing genre as players build up their Rap Sheet and street cred to move their way up the Black List to become the most wanted racer on the streets. Players go head-to-head with the top drivers on the scene as well as strategically evade more than half dozen cops at any one time. Also included are a dynamic open world, new gameplay and customization as well as tuners, supercars, muscles and sports cars. [Electronic Arts]… Expand"}, {"name": "Watch Dogs: Legion", "details_link": "https://www.metacritic.com/game/pc/watch-dogs-legion", "publisher": "Ubisoft", "release_date": "Oct 29 2020", "developers": ["Ubisoft"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 72, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/9f802e33c75b5ee096e0df69b761c5e8-98.jpg", "descriptions": "In the near future, London is facing its downfall: the people are being oppressed by an all-seeing surveillance state, a corrupt private military corporation controls the streets, and a powerful crime syndicate is preying on the vulnerable. The fate of London lies with you, and your abilityIn the near future, London is facing its downfall: the people are being oppressed by an all-seeing surveillance state, a corrupt private military corporation controls the streets, and a powerful crime syndicate is preying on the vulnerable. The fate of London lies with you, and your ability to recruit a resistance and fight back.\r Watch Dogs: Legion delivers a never-before-seen gameplay innovation that allows you to recruit and play as anyone you see in the iconic city of London. Every single character in the open world is playable, and everyone has a backstory, personality, and skillset that will help you personalize your own unique team. Bring your characters online and join forces with friends to take back London in four-player co-op missions, end-game challenges, and daily events. Welcome to the Resistance.… Expand"}, {"name": "Shu", "details_link": "https://www.metacritic.com/game/switch/shu", "publisher": "Coatsink Software", "release_date": "Jan 23 2018", "developers": ["Coatsink Software"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/f1061df5281106c5d1802a0f25330198-98.jpg", "descriptions": "When the great and terrible Storm destroys Shu's village, he embarks on a desperate journey to survive. On his travels he'll encounter stranded villagers; survivors of the devastation that need his help. In return for his assistance, these peculiar characters will grant Shu unique specialWhen the great and terrible Storm destroys Shu's village, he embarks on a desperate journey to survive. On his travels he'll encounter stranded villagers; survivors of the devastation that need his help. In return for his assistance, these peculiar characters will grant Shu unique special abilities that he can use to traverse the treacherous path ahead. Their only hope is to work together, in search of sanctuary - and a way to stop the Storm. Can you outrun the end of world? … Expand"}, {"name": "LEGO Batman: The Videogame", "details_link": "https://www.metacritic.com/game/ds/lego-batman-the-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 23 2008", "developers": ["TT Fusion"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/915e1649d8c311fbdb4f973eda4f2514-98.jpg", "descriptions": "A stampede of notorious criminals have busted out of Arkham Asylum, where Gotham City houses only the shadiest of characters. It's up to the famed Caped Crusader to sweep Gotham clean of criminal activity using everything at his disposal, including crime-fighting vehicles as well as severalA stampede of notorious criminals have busted out of Arkham Asylum, where Gotham City houses only the shadiest of characters. It's up to the famed Caped Crusader to sweep Gotham clean of criminal activity using everything at his disposal, including crime-fighting vehicles as well as several baddie-bashing bat gadgets. [Warner Bros.]… Expand"}, {"name": "World Tour Soccer 06", "details_link": "https://www.metacritic.com/game/psp/world-tour-soccer-06", "publisher": "SCEA", "release_date": "Jun 27 2006", "developers": ["SCEE London Studio"], "platforms": "PSP", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/42d1d9715a03f64fc3fa27425c6e7d79-98.jpg", "descriptions": "(Also known as \"World Tour Soccer 2\" in the UK/EU)  The game is a collection of quick (4 minutes) points-based game modes, each offering unique soccer challenges requiring players to utilize different soccer fundamentals. Attempt to dominate the globe in the World Tour Mode as you take on(Also known as \"World Tour Soccer 2\" in the UK/EU)  The game is a collection of quick (4 minutes) points-based game modes, each offering unique soccer challenges requiring players to utilize different soccer fundamentals. Attempt to dominate the globe in the World Tour Mode as you take on the World’s best from Africa, Asia, North America, South America and Europe. Slide into Medal Mode and experience numerous challenging new mini games where points and medals are awarded for solid soccer play. 10 new modes of play including All Rounder, Classic Challenge, Challenge Plus, Time Attack, Checkpoint, Dropout, Outnumbered, Pass Clock, In The Zone and Shot Clock. Each mode features alternate points scoring systems and a reward-based unlock structure. 71 international teams along with more than 1,650 real, world-class players and 8 international stadiums. Game sharing compatibility allows WTS '06 owners to share various levels of the game with other PSP owners.  [Sony]… Expand"}, {"name": "GoldenEye 007: Reloaded", "details_link": "https://www.metacritic.com/game/playstation-3/goldeneye-007-reloaded", "publisher": "Activision", "release_date": "Nov  1 2011", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["Xbox 360", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 72, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/0d56db13df396f4d72eb59a003d0cb23-98.jpg", "descriptions": "GoldenEye 007: Reloaded is an innovative and contemporary take on the legendary James Bond adventure."}, {"name": "Mushroom Men: The Spore Wars", "details_link": "https://www.metacritic.com/game/wii/mushroom-men-the-spore-wars", "publisher": "SouthPeak Games", "release_date": "Dec  2 2008", "developers": ["Red Fly Studio"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 72, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/c5a09cb04c5a98a4176a157fc9c2e956-98.jpg", "descriptions": "Mushroom Men - The Spore Wars shows gamers the mundane world from the surreal perspective of a three-inch-high Mushroom Man. Unnoticed by humans, a war rages between the spore factions. As a brave Bolete Mushroom Man, players are given the opportunity to transform common household trinketsMushroom Men - The Spore Wars shows gamers the mundane world from the surreal perspective of a three-inch-high Mushroom Man. Unnoticed by humans, a war rages between the spore factions. As a brave Bolete Mushroom Man, players are given the opportunity to transform common household trinkets and trash into weapons and tools, and wreak havoc on a miniature scale. As civil war rages amongst the fungi, fierce battles span the diminutive landscapes. Prepare yourself for the Spore War. [Gamecock]… Expand"}, {"name": "LOUD", "details_link": "https://www.metacritic.com/game/switch/loud", "publisher": "QubicGames", "release_date": "Jul 15 2022", "developers": ["QubicGames", "Hyperstrange"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/10ff5015f3ac7ccd73c43ea777cfc3b7-98.jpg", "descriptions": "Slam down on those chords - the guitar riffs start now! Take a deep breath and step into a musical journey to make your dreams come true and become a real artist!\r Immerse yourself in the ultimate arcade guitar experience and get lost in its rhythmic beats and beautiful audiovisualSlam down on those chords - the guitar riffs start now! Take a deep breath and step into a musical journey to make your dreams come true and become a real artist!\r Immerse yourself in the ultimate arcade guitar experience and get lost in its rhythmic beats and beautiful audiovisual effects.\r This is the story about Astrid - a teenage girl who’s not quite fond of this ‘growing up’ thing. We’ve all been there. To help take her mind off the mundane, she occupies her free time with her greatest love: music. Grab your broomstick and play to your heart’s content - your bedroom is your concert! Shred sick tunes as a radical garage band, throw air guitars in the subway or in a local pub, and join Astrid on a wild adventure to sign her first contract with a talent scout.… Expand"}, {"name": "Cotton 100%", "details_link": "https://www.metacritic.com/game/switch/cotton-100", "publisher": "ININ Games", "release_date": "Oct 29 2021", "developers": ["Success"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/d63839cb04c18c000c5fb0579d5d3ebc-98.jpg", "descriptions": "The Cute 'em Up mascot is back in a more vibrant and colorful look. The world has fallen into darkness, and the fairy Silk sets out to look for help. She crosses paths with a young witch called Nata de Cotton, who seems rather uninterested in helping her. That is until Silk tells her thatThe Cute 'em Up mascot is back in a more vibrant and colorful look. The world has fallen into darkness, and the fairy Silk sets out to look for help. She crosses paths with a young witch called Nata de Cotton, who seems rather uninterested in helping her. That is until Silk tells her that along the way, giant Willows, a candy that Cotton has a massive craving for, are waiting for her, so the two set out to find out what's causing the darkness... or look for Willows! Cotton 100% was released in 1994 and is based on the original Cotton: Fantastic Night Dreams. It offers a stunning and fresh new look with the more vibrant color palette of the Super Famicom. Experience the beautiful and authentic Cute 'em Up action from the 90s in all its glory and charm.… Expand"}, {"name": "El Hijo: A Wild West Tale", "details_link": "https://www.metacritic.com/game/playstation-4/el-hijo-a-wild-west-tale", "publisher": "HandyGames", "release_date": "Mar 25 2021", "developers": ["Honig Studios"], "platforms": ["iPhone/iPad", "PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/22ead5ade5b6cc5afd3d0413268c905d-98.jpg", "descriptions": "El Hijo: A Wild West Tale is an exciting spaghetti-western stealth game, in which you guide a 6-year-old boy on his quest to find his mother.As a six-year-old, \"El Hijo\" must always sneak past the dangers of his world. As he overcomes his challenges, he gains self-confidence and cunningEl Hijo: A Wild West Tale is an exciting spaghetti-western stealth game, in which you guide a 6-year-old boy on his quest to find his mother.As a six-year-old, \"El Hijo\" must always sneak past the dangers of his world. As he overcomes his challenges, he gains self-confidence and cunning and with it more schemes to get past his foes. On his journey, he will find himself in a remote monastery, a harsh and unforgiving stretch of desert and a frontier town rife with crime and villainy.The journey begins when a farmer and her son El Hijo are attacked by bandits who raze their farm to the ground. The mother decides to leave \"El Hijo\" at a secluded monastery in order to protect him. However, El Hijo decides that the monastic life is not for him and decides to escape. \"El Hijo - A Wild West Tale\" is a non-violent stealth game. Violence is instead exchanged with the mischievous, playfulness of a young child. Shadowplay is in the core of the game and \"El Hijo\" will often have to hide. Without needlessly adding new mechanics, the gameplay is extended naturally, as variations of existing mechanics are gradually introduced and then combined with each other to increase the challenge. These twists on familiar mechanics are often a product of the varied, increasingly dangerous environments that \"El Hijo\" must traverse to reach his ultimate goal.… Expand"}, {"name": "Carto", "details_link": "https://www.metacritic.com/game/pc/carto", "publisher": "Sunhead Games", "release_date": "Oct 27 2020", "developers": ["Sunhead Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "General"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/ca9e9d2e25c2238417c871e30f7844f6-98.jpg", "descriptions": "Carto is a chill adventure game wrapped around a unique, world-shifting puzzle mechanic. Use this power to explore mysterious lands, help a quirky cast of new friends, and guide Carto on her journey home."}, {"name": "Rise: Race The Future", "details_link": "https://www.metacritic.com/game/switch/rise-race-the-future", "publisher": "VD-DEV", "release_date": "Jul 22 2019", "developers": ["VD-DEV"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 72, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/5f31db984ce27ec5bf23b4573abbc6dd-98.jpg", "descriptions": "RISE: Race The Future is a racing game set in a near future where a new kind of wheel technology will let you drift on all type of terrains and especially on water."}]