[{"name": "Tokyo Xtreme Racer DRIFT", "details_link": "https://www.metacritic.com/game/playstation-2/tokyo-xtreme-racer-drift", "publisher": "Crave", "release_date": "Apr 18 2006", "developers": ["Genki"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 59, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/8a49546a53426cf95159e6a140c66838-98.jpg", "descriptions": "(Also known as \"Drift Racer: Kaido Battle\")   Developed by Genki as the sport's first authentic videogame simulator, Tokyo Xtreme Racer DRIFT fully immerses players in the world of drift racing. The game faithfully recreates the Kaido so players can race the very roads where the sport was(Also known as \"Drift Racer: Kaido Battle\")   Developed by Genki as the sport's first authentic videogame simulator, Tokyo Xtreme Racer DRIFT fully immerses players in the world of drift racing. The game faithfully recreates the Kaido so players can race the very roads where the sport was born, and further enhances the realism with more than 150 licensed cars to unlock in the course of the game. The game also has sponsored race parts for detailed car tuning and modifications to handling physics, along with five play modes that cover underground and sanctioned drift racing and the sport's variety of speed and style-driven competition. Drift Racer: Kaido Battle has more than 150 licensed cars from over a dozen manufacturers like Nissan, Subaru, Mitsubishi, Mazda and Volkswagen, with variable handling physics and detailed car tuning using sponsored race parts. The game offers five modes of play for stylistic precision-driving and racing for 1 or 2 players, including a career mode that pits players against nearly 200 underground racers in official daytime events and underground nighttime races.… Expand"}, {"name": "Dead Effect", "details_link": "https://www.metacritic.com/game/pc/dead-effect", "publisher": "Dykast Lubomir", "release_date": "Apr 15 2014", "developers": ["Dykast Lubomir"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/45091eb1fd895702b01de9d76c4f79a5-98.jpg", "descriptions": "Fight for your life in the INDIE SCI-FI FPS game fit for both casual and hard-core gamers with a passion for hunting down hordes of zombies. Prepare yourselves for the incoming nightmare."}, {"name": "Arkadian Warriors", "details_link": "https://www.metacritic.com/game/xbox-360/arkadian-warriors", "publisher": "Sierra Online", "release_date": "Dec 12 2007", "developers": ["Wanako Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "2  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 59, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/10ecc352d70bda3f7ae548f631d87bcb-98.jpg", "descriptions": "[Xbox Live Arcade]  Define your legacy. Awaken your inner beast. Fight as one of the three powerful warriors of Artemis as you confront Gorgon herself in Arkadian Warriors. Embark on a trek of epic proportions, traverse treacherous dungeons, fight off hordes of hideous enemies, and take on[Xbox Live Arcade]  Define your legacy. Awaken your inner beast. Fight as one of the three powerful warriors of Artemis as you confront Gorgon herself in Arkadian Warriors. Embark on a trek of epic proportions, traverse treacherous dungeons, fight off hordes of hideous enemies, and take on heinously powerful bosses. You must save the goddess Artemis and return the mythical land of Arkadia to the people. Warriors...unite and defend! Three mighty warriors: Choose to play as a Soldier, Archer, or Sorceress To save the land of Arkadia. Unique abilities: Each warrior has unique fighting and shape-shifting abilities. Turn into a Phoenix, Lion, or Dragon to increase your power and crush your foes. Character development: Build up your warrior's skills and inventory along the way with more powerful magic, deadlier weapons, and stronger defensive units. Unique dungeon generator: Never battle enemies in the same dungeon twice. Intense multiplayer co-op action: Play side-by-side with a friend, or take the battle online and conquer Gorgon in co-op multiplayer. [Sierra Online]… Expand"}, {"name": "MLB SlugFest 2006", "details_link": "https://www.metacritic.com/game/xbox/mlb-slugfest-2006", "publisher": "Midway", "release_date": "Jun  5 2006", "developers": ["Blue Shift"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b50005355e9e6658cf13a4a10686c02b-98.jpg", "descriptions": "Midway's newest offering of its over-the-top baseball game, MLB SlugFest 2006 features a new create-a-player mode, updated team rosters and stadiums, along with a new library of signature animations and extreme collisions that have distinguished the franchise since its debut in 2002."}, {"name": "Jagged Alliance: Rage!", "details_link": "https://www.metacritic.com/game/pc/jagged-alliance-rage!", "publisher": "HandyGames", "release_date": "Dec  6 2018", "developers": ["HandyGames"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 59, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/7/1ab92ae82f1a7e3c69a8e4085f4b6efe-98.jpg", "descriptions": "Jagged Alliance is back – With a new take on turn-based tactics, adventure elements and the well-known quirky mercenaries! Set 20 years after the first Jagged Alliance, this spin-off lets you experience a road trip into a jungle hell to test your mind and body to the limits!"}, {"name": "Diablo Immortal", "details_link": "https://www.metacritic.com/game/pc/diablo-immortal", "publisher": "Blizzard Entertainment", "release_date": "Jun  2 2022", "developers": ["Blizzard Entertainment", "NetEase Game"], "platforms": ["iPhone/iPad", "PC"], "num_players": "", "genres": ["Role-Playing", "Action RPG", "Massively Multiplayer"], "meta_score": 59, "users_score": 0.3, "image": "https://static.metacritic.com/images/products/games/4/25dfd993eab8517331f513994e1e2774-98.jpg", "descriptions": "Diablo® Immortal is a mobile Massively Multiplayer Online Action RPG (MMOARPG) developed by Blizzard Entertainment in partnership with NetEase, coming exclusively to Android, iPhone and iPad.Experience the world of Sanctuary in a persistent, always-online adventure anywhere, anytime.Join aDiablo® Immortal is a mobile Massively Multiplayer Online Action RPG (MMOARPG) developed by Blizzard Entertainment in partnership with NetEase, coming exclusively to Android, iPhone and iPad.Experience the world of Sanctuary in a persistent, always-online adventure anywhere, anytime.Join a worldwide community as you battle side by side to vanquish ancient evils, explore perilous dungeons, and of course, get legendary loot.* The Story: An Untold Chapter of the Diablo SagaThe Worldstone lies shattered, yet great power remains within its corrupted fragments. Power that Diablo's minions hope to harness to bring about the return of the Lord of Terror.The Archangel Tyrael is presumed dead, and mankind is left to deal with the aftermath of his actions. Fragments of the corrupted Worldstone taint the land, bringing forth ancient evils who are looking to harvest the stone's power and use it to control humanity.* Unique Zones & DungeonsFrom the peaceful town of Wortham, to the jungle island of Bilefen and the ancient Library of Zoltun Kulle, each zone in Diablo Immortal has new challenges to master and familiar faces to see.Will you choose to help Valla and her teacher in the Shassar Sea, or delve the tomb of Fahir, an ancient disciple of Akarat? Or storm the Countess' Forgotten Tower and stop her dark reign once more? The possibilities are many. The choices are yours.* Massively Multiplayer Action in Your PocketMeet other demon-slayers as you wander Sanctuary, and join them to take on deep, treacherous dungeons. Visit vast social hubs like Westmarch and conduct business with local merchants before setting off on your next adventure.Drop in or out of groups easily and engage in dynamic events all over the world, teaming up with other heroes as you take down Skarn's minionsand reap powerful rewards.* WestmarchExplore the sprawling streets of Westmarch in a time before Malthael's corruption. The city is always bustling with activity as visitors from all over the world come to marvel at its sights, enjoy its landmarks, and more.Westmarch is where you can meet all your adventuring needs. You'll have access to your stash and vendors, but more importantly it's the place to meet fellow travelers, relax and take a breather.* Designed for MobileDiablo Immortal is being designed from the ground-up to give you an authentic Diablo experience on touch-screen devices. Intuitive actions, gestures and touch controls put you in full command of your hero. Slay endless hordes of demons as effortlessly as you would with a controller or keyboard and mouse.* Zero in on Your EnemiesDirectional controls make it easy to move around in the world; demolishing the denizens of hell is as easy as holding down your thumb on a skill from your hotbar to aim it, then releasing it to unleash hell. Quickly access potions for a gradual health refresh, and equip recently looted items with a single tap on your screen.… Expand"}, {"name": "The Dark Crystal: Age of Resistance Tactics", "details_link": "https://www.metacritic.com/game/playstation-4/the-dark-crystal-age-of-resistance-tactics", "publisher": "En Masse Entertainment", "release_date": "Feb  4 2020", "developers": ["BonusXP"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 59, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/6/bf46d78e9fee7fb85979bfe1705d454c-98.jpg", "descriptions": "Netflix's The Dark Crystal: Age of Resistance comes to life as a tactical strategy game. In The Dark Crystal: Age of Resistance Tactics, lead the heroic Gelfling to restore light to the world of Thra! Experience everything the fantasy world has to offer by playing throughand going beyondtheNetflix's The Dark Crystal: Age of Resistance comes to life as a tactical strategy game. In The Dark Crystal: Age of Resistance Tactics, lead the heroic Gelfling to restore light to the world of Thra! Experience everything the fantasy world has to offer by playing throughand going beyondthe events of the Netflix series. Encounter never-seen-before playable characters, stories, and environments.  Over the course of 80 unique turn-based campaign battles taking place across the lands of Thra, recruit new allies and customize their forces by assigning them jobs and outfitting them with new equipment. Continue the Story in an Expanded World of Thra - Delve deeper into the legend of The Dark Crystal to learn more about the Gelfling clans and their histories across more than 5 diverse, modular territories. Choose from over 15 character jobs, play through reimagined and brand-new battles against the malicious Skeksis and help lead the proud Gelfling to victory.\r Gelfling Tactics - Devise unique ways for the outmatched Gelfling to fulfill their prophecy in multi-layered, turn-based tactical combat. Units can be customized for specific fights with gear, upgradable abilities and a job system. Use guile, planning and cunning to overcome superior foes!\r Highly Replayable - Replay finished battles to earn full marks or replay the entire game! Once completed, challenge New Game+ mode, keeping all progress from the first playthrough while facing more difficult versions of battles.\r Rich, Dynamic Environments - The world of Thra is a living, unpredictable environment as dangerous as it is beautiful. Dynamic events on the battlefield may create opportunities or put the Gelflings at a disadvantage, necessitating rapid changes in strategy.… Expand"}, {"name": "SpongeBob Squigglepants", "details_link": "https://www.metacritic.com/game/wii/spongebob-squigglepants", "publisher": "THQ", "release_date": "Apr 12 2011", "developers": ["WayForward"], "platforms": ["3DS", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "General"], "meta_score": 59, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/9dd296c338dae57e32c4b16cb89f888f-98.jpg", "descriptions": "SpongeBob Squigglepants has players tilt, flick, tap, and draw through more than 100 Nanogames set in six zany worlds."}, {"name": "Driver: Parallel Lines", "details_link": "https://www.metacritic.com/game/wii/driver-parallel-lines", "publisher": "Ubisoft", "release_date": "Jun 26 2007", "developers": ["Reflections Interactive"], "platforms": ["PC", "PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Action Adventure", "Racing", "Mission-based", "Arcade", "Mission-based", "Open-World", "Automobile"], "meta_score": 59, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/6f0b83f153d41cea0d9cc77710141c48-98.jpg", "descriptions": "Dual Time Periods – Experience New York’s gritty underworld as the most lethal wheelman for hire in the both the 70’s of the past and the modern times of today. Experience White Knuckle Steering – Features realistic steering and 80 cars and motorcycles including old school classics andDual Time Periods – Experience New York’s gritty underworld as the most lethal wheelman for hire in the both the 70’s of the past and the modern times of today. Experience White Knuckle Steering – Features realistic steering and 80 cars and motorcycles including old school classics and modern day marvels. Replicate Real Gun Movements – Shoot, smash and steal your way through New York City’s underground using an arsenal of short and long range assault weapons. Fully Customizable Vehicles – Build your perfect ride with custom body work, engine upgrades, tunable suspensions, custom paints and accessories like bullet proof glass and tinted windows. Mini-Games and Side Missions – Earn extra cash to upgrade your vehicles by completing side missions and mini-games like Hitman, Street Racing, Motocross and Demolition Survival. High Speed Hollywood Action – The perfect combination for high speed driving - fast cars, open level missions with no loading time, realistic physics and destructible environments. [Ubisoft]… Expand"}, {"name": "Anthem", "details_link": "https://www.metacritic.com/game/pc/anthem", "publisher": "Electronic Arts", "release_date": "Feb 22 2019", "developers": ["BioWare"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/1/c82ce44d5a10c16621543ce704eaffe5-98.jpg", "descriptions": "Anthem is a shared-world action-RPG in which players delve into a vast world teeming with amazing technology and forgotten treasures. The world is also filled with savage beasts and ruthless marauders where Freelancers are called to defeat the forces plotting to conquer humanity. In Anthem,Anthem is a shared-world action-RPG in which players delve into a vast world teeming with amazing technology and forgotten treasures. The world is also filled with savage beasts and ruthless marauders where Freelancers are called to defeat the forces plotting to conquer humanity. In Anthem, up to 4 friends unravel the world’s mysteries and take on its most fearsome challenges together. Shared danger means shared glory, and successful Freelancers are all be richly rewarded for successful exploits. Throughout their adventure, players outfit their Freelancers with powerful Javelin exosuits, each of which are equipped with unique weapons and abilities. Players also customize their Javelin with gear they earn and craft throughout the adventure, and leave a lasting mark on the world. [Electronic Arts]… Expand"}, {"name": "Everblue 2", "details_link": "https://www.metacritic.com/game/playstation-2/everblue-2", "publisher": "Capcom", "release_date": "Feb 24 2003", "developers": ["Arika"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 59, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/d4a25c7eaa2af0b73b44572c6bd07f5c-98.jpg", "descriptions": "Explore the Magic of Deep-Sea Diving. Follow heroes Leo and Zucco as they explore the truth behind tales of the Caribbean's Bermuda Triangle and Coral Reef inthis expansive underwater role-playing adventure. Uncover the sea's mysteries, as you freely explore sunken treasure ships, play withExplore the Magic of Deep-Sea Diving. Follow heroes Leo and Zucco as they explore the truth behind tales of the Caribbean's Bermuda Triangle and Coral Reef inthis expansive underwater role-playing adventure. Uncover the sea's mysteries, as you freely explore sunken treasure ships, play with dolphins and other underwater sea life, wander the great Coral Sea and avoid shark attacks. It's a fun-filled adventure for all ages! [Capcom]… Expand"}, {"name": "Forgotten Fields", "details_link": "https://www.metacritic.com/game/pc/forgotten-fields", "publisher": "Blink Digital", "release_date": "Apr 14 2021", "developers": ["Frostwood Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/53b787fbbaa172c4c1334f998d36599a-98.jpg", "descriptions": "Forgotten Fields is a cozy narrative game about Sid - a struggling writer who travels back to his childhood home one last time before it's sold off. Visit old friends, relive memories, solve puzzles and play through sections of Sid's book in this warm game about nostalgia and the passage of time."}, {"name": "Lost Sea", "details_link": "https://www.metacritic.com/game/xbox-one/lost-sea", "publisher": "EastAsiaSoft", "release_date": "Jun 29 2016", "developers": ["EastAsiaSoft"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Strategy", "Action Adventure", "General", "Survival"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/978d3eaa44937a54e917a25333a4d5f5-98.jpg", "descriptions": "Lost Sea is a 3D strategy-action game that takes place inside a procedurally generated archipelago. It's up to the player to form a ragtag crew of survivors and explore the surrounding islands as they hunt for the necessary resources to upgrade their ship and escape the Bermuda Triangle."}, {"name": "Shooting Stars!", "details_link": "https://www.metacritic.com/game/pc/shooting-stars!", "publisher": "Daedalic Entertainment", "release_date": "Jan 19 2016", "developers": ["Bloodirony"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 59, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/e2570e454b076db7cf5d84e28da45c70-98.jpg", "descriptions": "This game is the answer to one of the most important questions in life: “I can haz lazer kitty?“ Yes you can!"}, {"name": "The Incredible Adventures of Van Helsing", "details_link": "https://www.metacritic.com/game/xbox-one/the-incredible-adventures-of-van-helsing", "publisher": "NeocoreGames", "release_date": "Dec  1 2015", "developers": ["NeocoreGames"], "platforms": ["PC", "Xbox One"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/71c449b5f5c114f96423bd3f5dcc91fa-98.jpg", "descriptions": "Set in a gothic-noir universe resembling a fantastical 19th century Europe filled with monsters, magic, and weird technology, The Incredible Adventures of Van Helsing will follow the son of the famed hunter, known in-game as Van Helsing, in a tale wrought with wry humor and snappy dialogue.Set in a gothic-noir universe resembling a fantastical 19th century Europe filled with monsters, magic, and weird technology, The Incredible Adventures of Van Helsing will follow the son of the famed hunter, known in-game as Van Helsing, in a tale wrought with wry humor and snappy dialogue. Van Helsing, a larger-than-life hero possessing a dark yet romantic charm, will follow his path to the dismal land of Borgovia where former supernatural foes have enlisted his help to defeat a new scourge terrorizing the ravaged Eastern European city. With an assortment of extraordinary characters, an engrossing storyline, and a beautifully dark and gothic art style, The Incredible Adventures of Van Helsing looks to bring RPG enthusiasts an anachronistic adventure like no other.… Expand"}, {"name": "Master Reboot", "details_link": "https://www.metacritic.com/game/pc/master-reboot", "publisher": "Wales Interactive", "release_date": "Oct 29 2013", "developers": ["Wales Interactive"], "platforms": ["PlayStation 3", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/799fb4255bee8d93253e930094d22c90-98.jpg", "descriptions": "Imagine a world where death is no longer final, where precious memories are saved to enjoy forever, where your soul is immortal, welcome to the Soul Cloud.\r Upload your soul to our dedicated servers and relax knowing that a part of you will live on, for eternity. That favourite holiday,Imagine a world where death is no longer final, where precious memories are saved to enjoy forever, where your soul is immortal, welcome to the Soul Cloud.\r Upload your soul to our dedicated servers and relax knowing that a part of you will live on, for eternity. That favourite holiday, happy moments from your childhood, meeting that special someone for the first time. All these memories saved for your digital soul and your family to revisit again and again.… Expand"}, {"name": "Transformers: Dark of the Moon", "details_link": "https://www.metacritic.com/game/xbox-360/transformers-dark-of-the-moon", "publisher": "Activision", "release_date": "Jun 14 2011", "developers": ["High Moon Studios"], "platforms": ["3DS", "PlayStation 3", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/b3670335a4774de422a9084e86d7f03f-98.jpg", "descriptions": "Transformers: Dark of the Moon thrusts players into an original storyline that takes place before the events of the film."}, {"name": "Dance Paradise", "details_link": "https://www.metacritic.com/game/xbox-360/dance-paradise", "publisher": "THQ", "release_date": "Feb 15 2011", "developers": ["Mindscape Inc.", "Smack Down Productions", "Mindscape"], "platforms": "Xbox 360", "num_players": "Up to 10 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/d0a55d56dac37a3f8f8c2fa8a6bf0bbf-98.jpg", "descriptions": "Using Kinect's new tracking detection and control-free technology, Dance Paradise gives players the chance to express themselves, move completely freely and dance without any restrictions."}, {"name": "King Arthur", "details_link": "https://www.metacritic.com/game/playstation-2/king-arthur", "publisher": "Konami", "release_date": "Nov 17 2004", "developers": ["Krome Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 59, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/a62d2aa9b318659b7e38907a047214a5-98.jpg", "descriptions": "The King Arthur video game is inspired by the epic true story that gave rise to the King Arthur legend. The real story of King Arthur will be played out with intense battles, innovative combat and realistic environments. The game will immerse fans into the lush environments and vivid sceneryThe King Arthur video game is inspired by the epic true story that gave rise to the King Arthur legend. The real story of King Arthur will be played out with intense battles, innovative combat and realistic environments. The game will immerse fans into the lush environments and vivid scenery from the feature film. Players take control of the motion picture's heroes – Arthur, Lancelot, Guinevere, Tristren or Bors – and utilize their unique skills as they embark on a perilous mission revealing the historic tale of the real Knights of the Round Table. Featuring single or cooperative play, combat on horseback and multiple mission types with diverse goals, the King Arthur video game will provide a cinematic action adventure experience of epic scale. [Konami]… Expand"}, {"name": "Whacked!", "details_link": "https://www.metacritic.com/game/xbox/whacked!", "publisher": "Microsoft Game Studios", "release_date": "Oct  8 2002", "developers": ["Presto Studios"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/85f406061d08f00e24251d8b10a67bd1-98.jpg", "descriptions": "In Whacked! you are one of seven demented contestants competing on a dangerous game show. Pitted against each other in free-for-all combat, contestants must use power-ups and weapons, such as giant staplers and rubber ducky grenades, to flatten their opponents. The game's various modes haveIn Whacked! you are one of seven demented contestants competing on a dangerous game show. Pitted against each other in free-for-all combat, contestants must use power-ups and weapons, such as giant staplers and rubber ducky grenades, to flatten their opponents. The game's various modes have you fighting to collect resources, fending off a horde of man-eating chickens, or exchanging blows in fierce deathmatches. There are more than a dozen levels--including an arctic pipeline, a Christmas tree, and a kitchen sink--for you to conquer.… Expand"}, {"name": "80 Days (2005)", "details_link": "https://www.metacritic.com/game/pc/80-days-2005", "publisher": "Matrix Games", "release_date": "Dec 12 2005", "developers": ["Frogwares"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 58, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/462bcf72a64cea17baa3383520a4f1f4-98.jpg", "descriptions": "In 1899, Oliver Lavisheart, young adventurous Englishman, accepts to help his uncle Mathew to win a bet: going around the world in 80 days or less to collect proof that the wacky uncle has created 4 major inventions in 4 different cities all around the world. Oliver follows Phileas Fogg'sIn 1899, Oliver Lavisheart, young adventurous Englishman, accepts to help his uncle Mathew to win a bet: going around the world in 80 days or less to collect proof that the wacky uncle has created 4 major inventions in 4 different cities all around the world. Oliver follows Phileas Fogg's tracks through Egypt, India, Japan, and finally to America. He has only 80 days, or his uncle will lose his bet and will be ruined. For this trip you will become Oliver, discover your uncle's fantastic talents, his adventurous life and his secrets. You will also learn a lot about yourself, the truth about your family and the true nature of this incredible bet. As the game progresses you will help a strange German Archeologist, rescue a distressed - not overly bright actress from Bollywood, organize a SM contest, win an elephant race, drive the biggest airship ever, find a way to make the Scottish tartan the coolest street wear worldwide, fool a shogun's samurai, burn your own boat to go faster, avoid the traps of inspector Fix's nasty son, get into disguise, bribe, steal. [Tri Synergy]… Expand"}, {"name": "Hugo: The Evil Mirror", "details_link": "https://www.metacritic.com/game/game-boy-advance/hugo-the-evil-mirror", "publisher": "Namco", "release_date": "Apr 24 2005", "developers": ["ITE Media"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 58, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/44f8163779fe4f2c4612257b4517d500-98.jpg", "descriptions": "The evil witch Scylla has trapped Hugo in a mirror, and now it's up to you to rescue him. In Hugo and the Evil Mirror, you must save Hugo in three different worlds, each guarded by dangerous monsters. Use the freeze gun to turn enemies into ice cubes, and then push them over the edge of theThe evil witch Scylla has trapped Hugo in a mirror, and now it's up to you to rescue him. In Hugo and the Evil Mirror, you must save Hugo in three different worlds, each guarded by dangerous monsters. Use the freeze gun to turn enemies into ice cubes, and then push them over the edge of the levels or combine them with other frozen monsters to gain power-ups.… Expand"}, {"name": "The Starship Damrey", "details_link": "https://www.metacritic.com/game/3ds/the-starship-damrey", "publisher": "Level 5", "release_date": "May 16 2013", "developers": ["Level 5"], "platforms": "3DS", "genres": ["Adventure", "General", "General"], "meta_score": 58, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/4e9c32fd01a83d073789a7b6706f5a9b-98.jpg", "descriptions": "THE STARSHIP DAMREY is an adventure/horror/suspense game designed by Kazuya Asano (Kamaitachi no Yoru (The Night of the Sickle Weasel), TORNEKO: The Last Hope) and written by Takemaru Abiko (Kamaitachi no Yoru (The Night of the Sickle Weasel), TRICK X LOGIC), known as pioneers of text-basedTHE STARSHIP DAMREY is an adventure/horror/suspense game designed by Kazuya Asano (Kamaitachi no Yoru (The Night of the Sickle Weasel), TORNEKO: The Last Hope) and written by Takemaru Abiko (Kamaitachi no Yoru (The Night of the Sickle Weasel), TRICK X LOGIC), known as pioneers of text-based adventure games in Japan.  In the game, players awaken to discover that they are trapped in a Cold Sleep capsule aboard the titular Starship Damrey, with no memory of who they are or how they got there.  With no tutorials, explanations, or hints provided, the game was created with the intent that self-discovery and experimentation be an integral part of the experience. An inconceivable truth awaits those willing to discover it.… Expand"}, {"name": "Disney's Magical Quest 3 Starring Mickey and Donald", "details_link": "https://www.metacritic.com/game/game-boy-advance/disneys-magical-quest-3-starring-mickey-and-donald", "publisher": "Capcom", "release_date": "Jun 14 2005", "developers": ["Klein Computer Entertainment"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/c473a12d30739228064dea8534d0bbf4-98.jpg", "descriptions": "The next game in the Disney's Magical Quest series features more platforming action."}, {"name": "Recompile", "details_link": "https://www.metacritic.com/game/xbox-series-x/recompile", "publisher": "Phigames", "release_date": "Aug 19 2021", "developers": ["Phigames"], "platforms": ["PC", "PlayStation 5", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 58, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/2/345d668813e059a353e3e5e5314f4af1-98.jpg", "descriptions": "Recompile is a 3D Metroidvania-inspired hacking adventure set in the Mainframe."}, {"name": "Dungeons & Dragons: Dark Alliance", "details_link": "https://www.metacritic.com/game/xbox-series-x/dungeons-dragons-dark-alliance", "publisher": "Wizards of the Coast", "release_date": "Jun 22 2021", "developers": ["Tuque Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 5 ", "genres": ["Role-Playing", "General"], "meta_score": 58, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/8154f3938a732af309de2dc5c8db629f-98.jpg", "descriptions": "Band together with friends, near or far, and fight against vicious monsters in the new co-op action RPG from Dungeons & Dragons."}, {"name": "Little Witch Academia: Chamber of Time", "details_link": "https://www.metacritic.com/game/playstation-4/little-witch-academia-chamber-of-time", "publisher": "Bandai Namco Games", "release_date": "May 15 2018", "developers": ["Bandai Namco Games", "Aplus"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 3 ", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/0d60fcb5ff88c355e824c5dc13dc898a-98.jpg", "descriptions": "Uncover the mysteries at Luna Nova Academy and experience the magical world of Studio Trigger style Japanese animation. Join Akko and her friends to work as a team – exploring dungeons, casting magical spells and using witchcraft to ultimately discover the seven wonders and solve theUncover the mysteries at Luna Nova Academy and experience the magical world of Studio Trigger style Japanese animation. Join Akko and her friends to work as a team – exploring dungeons, casting magical spells and using witchcraft to ultimately discover the seven wonders and solve the mysterious shift in time.… Expand"}, {"name": "Pac-Man and the Ghostly Adventures", "details_link": "https://www.metacritic.com/game/wii-u/pac-man-and-the-ghostly-adventures", "publisher": "Namco Bandai Games", "release_date": "Oct 29 2013", "developers": ["Namco Bandai Games", "Monkey Bar Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/4369b53972dd60bacc63fbd7a3d8f24f-98.jpg", "descriptions": "Pac-Man and the Ghostly Adventures has players take the role of Pac and his 2 best friends, Spiral and Cylindria, as they must rise to the challenge of protecting their homeland from the menacing ghosts that have escaped from the Netherworld."}, {"name": "DreamWorks How to Train Your Dragon", "details_link": "https://www.metacritic.com/game/xbox-360/dreamworks-how-to-train-your-dragon", "publisher": "Activision", "release_date": "Mar 23 2010", "developers": ["Etranges Libellules"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 58, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/e686399bfd72c8006d55790e6ab079fa-98.jpg", "descriptions": "How to Train Your Dragon video game launches gamers into a third-person action-adventure as a Viking hero where they must embark upon an epic quest to become the ultimate dragon trainer. Gamers can play as characters “Hiccup” or Astrid” on the vast Island of Berk, which features expandedHow to Train Your Dragon video game launches gamers into a third-person action-adventure as a Viking hero where they must embark upon an epic quest to become the ultimate dragon trainer. Gamers can play as characters “Hiccup” or Astrid” on the vast Island of Berk, which features expanded locales from the film including Vikings’ Village, Wild Zone, Training Zone and Fight Arena. In this truly larger-than-life adventure, players will train dragons, explore environments and battle in prestigious dragon tournaments as they battle for Viking victory. Plus, gamers can become the Dragon hero of their living room as they square-off with friends and family in endless head-to-head multi-player combat. [Activision]… Expand"}, {"name": "Time Crisis: Razing Storm", "details_link": "https://www.metacritic.com/game/playstation-3/time-crisis-razing-storm", "publisher": "Namco Bandai Games", "release_date": "Oct 19 2010", "developers": ["Nex Entertainment"], "platforms": "PlayStation 3", "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "Light Gun"], "meta_score": 58, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/2ffafb4124ae6f3ab10e29f1c1daec82-98.jpg", "descriptions": "Destroy everything in sight, from the environments to the futuristic terrorists aiming to take you down! Get your gun ready for combat and keep the ammo coming. The future of the free world depends on you and your PlayStation Move motion controller, solider. Provide copy and key featuresDestroy everything in sight, from the environments to the futuristic terrorists aiming to take you down! Get your gun ready for combat and keep the ammo coming. The future of the free world depends on you and your PlayStation Move motion controller, solider. Provide copy and key features Destruction! The first Time Crisis game to have fully destructible environments. Now, you can obliterate anything that gets in your way. The intuitive controller allows for highly realistic combat.… Expand"}, {"name": "Steel Diver", "details_link": "https://www.metacritic.com/game/3ds/steel-diver", "publisher": "Nintendo", "release_date": "Mar 27 2011", "developers": ["Nintendo", "Vitei"], "platforms": "3DS", "genres": ["Action", "Simulation", "General", "Submarine", "Submarine", "Marine", "Combat"], "meta_score": 58, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/dfd12c990decb34bdfc9c8fc9b4c479b-98.jpg", "descriptions": "Steel Diver is a submarine game that utilizes the 3-D functions of the 3DS."}, {"name": "Disney Pirates of the Caribbean: At World's End", "details_link": "https://www.metacritic.com/game/xbox-360/disney-pirates-of-the-caribbean-at-worlds-end", "publisher": "Disney Interactive Studios", "release_date": "May 22 2007", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action Adventure", "Historic", "Historic", "Linear"], "meta_score": 58, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/d5642e6ceb93ec1032e8d021eea12128-98.jpg", "descriptions": "At World's End video games from Disney Interactive Studios invite players to \"live and die by the sword\" as they venture to the worlds of the films and beyond while playing as Captain Jack Sparrow, Will Turner and Elizabeth Swann. [Disney Interactive Studios]"}, {"name": "The Weaponographist", "details_link": "https://www.metacritic.com/game/pc/the-weaponographist", "publisher": "Mastertronic", "release_date": "Apr 29 2015", "developers": ["Puuba"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Role-Playing", "Action RPG"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/754a6a0791ec4093df4574231ab15efe-98.jpg", "descriptions": "Play as Doug McGrave, famous demon hunter for hire. Highest level, bestest gear, ruggedly handsome, and unrepentant jerk. For refusing to aid one stinking demon-infested town, you are immediately  and deservedly  cursed. Your powers, your wealth, and your weapons Poof! Gone."}, {"name": "Blacklight: Retribution", "details_link": "https://www.metacritic.com/game/playstation-4/blacklight-retribution", "publisher": "Zombie Studios", "release_date": "Nov 15 2013", "developers": ["Zombie Studios"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 58, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/e07d63b0d86fc7b6ddb542f8acb5b300-98.jpg", "descriptions": "Blacklight: Retribution is a fast paced, adrenaline pumping first person shooter based in a futuristic urban warzone. Building upon Zombie Studios' predecessor, Tango Down, Blacklight: Retribution provides FPS enthusiasts with a massive arsenal of weaponry and gear ranging from bleeding edgeBlacklight: Retribution is a fast paced, adrenaline pumping first person shooter based in a futuristic urban warzone. Building upon Zombie Studios' predecessor, Tango Down, Blacklight: Retribution provides FPS enthusiasts with a massive arsenal of weaponry and gear ranging from bleeding edge side arms to massive mechanized Hardsuits. Customize your weapons and gear for the perfect load out, earn credits in game to change the tide of battle by deploying flame throwers, automatic grenade launchers and even airstrikes.… Expand"}, {"name": "Mega Man Star Force 3: Black Ace", "details_link": "https://www.metacritic.com/game/ds/mega-man-star-force-3-black-ace", "publisher": "Capcom", "release_date": "Jun 30 2009", "developers": ["Capcom"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 58, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/e8fae757a37ce1205fb1dbc56be120e8-98.jpg", "descriptions": "As in the previous games, Mega Man Star Force 3 is a unique blend of an action and role-playing game (RPG), combining the high intensity combat that is the hallmark of Mega Man® games with Star Force’s strategic battle system. By defeating enemies and boss characters, players earn battleAs in the previous games, Mega Man Star Force 3 is a unique blend of an action and role-playing game (RPG), combining the high intensity combat that is the hallmark of Mega Man® games with Star Force’s strategic battle system. By defeating enemies and boss characters, players earn battle cards that enhance and evolve Mega Man’s abilities and attacks. New to Mega Man Star Force 3 are Noise Changes, random enhancements that change Mega Man’s form and unlock new abilities. The two versions of the game, Black Ace and Red Joker, each have over 100 unique Noise Types that can be combined with Mega Man to unlock elemental powers based on earth, air, water and fire. The new Noise feature will add an exciting randomness to battles, encouraging players to explore, collect and battle across the digital world of Mega Man Star Force 3. In Mega Man Star Force 3, players travel between the physical world and the digital world via electromagnetic waves that form wave roads. Geo Stelar, the protagonist of the game, can see these wave roads by using his unique visualizer tool. Once in the digital world, Geo can merge with the electronic life-form known as Omega-Xis to become Mega Man. The wave roads are being overrun by mysterious noise that change the player’s environment and powers in different ways. This noise is being generated by an approaching gigantic meteor that threatens both the physical and digital worlds of Mega Man Star Force 3, forcing Geo Stellar and his crew to fight the oncoming threat to save two worlds. Fortunately, Mega Man discovers that he can control the Noise, using the new Noise Change system to transform into many different forms, including the ultimate Black Ace or Red Joker forms. [Capcom]… Expand"}, {"name": "Black Sigil: Blade of the Exiled", "details_link": "https://www.metacritic.com/game/ds/black-sigil-blade-of-the-exiled", "publisher": "Graffiti Entertainment", "release_date": "Jun  9 2009", "developers": ["Studio Archcraft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 58, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/599245dd5d4781c0973f3d7a11463804-98.jpg", "descriptions": "Bel Lenora is a world where people are born with magic at their command. Years ago, a single man walked the land with no magic in his veins. He brought death and tragedy in his wake and was banished by a brave General at a great cost. It has been fifteen years since his banishment and onceBel Lenora is a world where people are born with magic at their command. Years ago, a single man walked the land with no magic in his veins. He brought death and tragedy in his wake and was banished by a brave General at a great cost. It has been fifteen years since his banishment and once again, a young man with no magic walks the land of Bel Lenora. Join Kairu, a young knight, born with a cursed spirit. [Graffiti Entertainment]… Expand"}, {"name": "Shining Soul", "details_link": "https://www.metacritic.com/game/game-boy-advance/shining-soul", "publisher": "Atlus Co.", "release_date": "Sep 23 2003", "developers": ["Next Entertainment"], "platforms": "Game Boy Advance", "genres": ["Role-Playing", "Action RPG"], "meta_score": 58, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/d65fea18e040d944542a3305e237613c-98.jpg", "descriptions": "Enter a world of magic and mystery, where your closest allies may sometimes turn out to be your worst enemies. Shining Soul puts you in the middle of a desperate struggle between the Dark Dragon and a group of warriors known as the Shining Fleet. In the final stage of the war, you can playEnter a world of magic and mystery, where your closest allies may sometimes turn out to be your worst enemies. Shining Soul puts you in the middle of a desperate struggle between the Dark Dragon and a group of warriors known as the Shining Fleet. In the final stage of the war, you can play one of four character classes: fighter, wizard, archer, or dragonute. Customize your character's color schemes, weapons, and armor, and then explore the world of Shining Soul either alone or with three of your friends.… Expand"}, {"name": "The Castle Doctrine", "details_link": "https://www.metacritic.com/game/pc/the-castle-doctrine", "publisher": "Jason Rohrer", "release_date": "Jan 29 2014", "developers": ["Jason Rohrer"], "platforms": "PC", "genres": ["Modern", "Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Modern"], "meta_score": 58, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/10a64c927ea8ce5a582b9adee9a0a9b1-98.jpg", "descriptions": "The Castle Doctrine is a massively-multiplayer game of burglary and home defense. It's 1991, and things are bad. You're a guy with a house and family. Other players are coming to take what's yours. Build security to stop them. Study their houses, buy tools, and break in to take what'sThe Castle Doctrine is a massively-multiplayer game of burglary and home defense. It's 1991, and things are bad. You're a guy with a house and family. Other players are coming to take what's yours. Build security to stop them. Study their houses, buy tools, and break in to take what's theirs. Everything you do is permanent. … Expand"}, {"name": "Battle of the Bands", "details_link": "https://www.metacritic.com/game/wii/battle-of-the-bands", "publisher": "THQ", "release_date": "Apr 21 2008", "developers": ["Planet Moon Studios"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 58, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/19e5b97d761f67d81a3d37240bd6e73a-98.jpg", "descriptions": "Enter into the world of musical combat where your rhythmic skills and weaponized instruments are your tools for domination. Welcome to the Battle of the Bands. 5 music genres: Rock, Country, Marching Band, Hip Hop and Ranchero. 11 unique style bands. 30 licensed tracks (each in 5 genresEnter into the world of musical combat where your rhythmic skills and weaponized instruments are your tools for domination. Welcome to the Battle of the Bands. 5 music genres: Rock, Country, Marching Band, Hip Hop and Ranchero. 11 unique style bands. 30 licensed tracks (each in 5 genres totaling 150 songs). 70 special weapons and attacks/ In each game, a song will be played in one genre for about 10 to 15 seconds and then another, flipping back and forth. Points are earned by beat-matching, and successive matches will automatically launch weapons such as smoke bombs, land mines and flip outs. The more points earned, the more the music will be played in the player’s genre. Battle of the Bands: Prove your favorite music genre is better than the opponents’. Weaponized Instruments: Battle to the top of the charts with an array of artillery and attack styles. Intense Rhythm Action: Feel the rhythm by swinging the Wii-mote in sync with different music melodies. Innovative Music Switching: Explore chart-toppers mashing up in different genres. Versus mode: Heads-on battles perfect for social and party game setting. Adventure mode: Compete with bands of other genres one by one all the way to the Big Boss battle. Music player: Blast out all 150 songs. [THQ]… Expand"}, {"name": "Tharsis", "details_link": "https://www.metacritic.com/game/switch/tharsis", "publisher": "Choice Provisions", "release_date": "Apr 11 2020", "developers": ["Choice Provisions"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/e5331e464cce836b33c7ed4bfefd403c-98.jpg", "descriptions": "A mysterious signal originating from the Tharsis region of Mars set us on a frantic mission. Who sent it? And why? Impossible questions, but in them lie the key to humanitys survival.\r Now, millions of miles away from home, a micrometeoroid storm has left us with a severely damaged ship,A mysterious signal originating from the Tharsis region of Mars set us on a frantic mission. Who sent it? And why? Impossible questions, but in them lie the key to humanitys survival.\r Now, millions of miles away from home, a micrometeoroid storm has left us with a severely damaged ship, two deceased crew, and the sneaking suspicion this trip was doomed from the start.\r Tharsis is a turn-based space strategy game. With dice. And cannibalism. It puts you in control of humanitys first manned mission to Mars, just as its struck by a micrometeoroid storm. You must guide your crew through disasters, food shortages, and the unforgiving nature of space  all while maintaining your sanity amidst cryptic signals and warnings from Mars.\r Defy the odds, make the difficult decisions, and embark on the most important mission in human history.… Expand"}, {"name": "NBA ShootOut 2004", "details_link": "https://www.metacritic.com/game/playstation-2/nba-shootout-2004", "publisher": "SCEA", "release_date": "Oct 29 2003", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 58, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/587225617a56f2d68a8de10bbd42229d-98.jpg", "descriptions": "Features enhanced Career Mode enabling gamers to create a player and earn a spot on an NBA team, NBA ShootOut 2004 now also enables users to take their skills online, leveraging the new USB Headset to rally teammates and compete against anyone around the country, or use the offline voiceFeatures enhanced Career Mode enabling gamers to create a player and earn a spot on an NBA team, NBA ShootOut 2004 now also enables users to take their skills online, leveraging the new USB Headset to rally teammates and compete against anyone around the country, or use the offline voice recognition capabilities to execute specific plays.… Expand"}, {"name": "Casper: Spirit Dimensions", "details_link": "https://www.metacritic.com/game/playstation-2/casper-spirit-dimensions", "publisher": "TDK Mediactive", "release_date": "Sep 30 2001", "developers": ["Lucky Chicken"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 58, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/4/195a46cb2bc5f6279603fd84cc89d3d3-98.jpg", "descriptions": "In the Spirit world where evil prevails, Casper must use all of his ghostly powers to defeat Kibosh's wicked plot to rule all. Traveling by flight through mysterious portals, Casper will discover phantom dimensions where he must destroy the haunting spirits that are out to stop his mission.In the Spirit world where evil prevails, Casper must use all of his ghostly powers to defeat Kibosh's wicked plot to rule all. Traveling by flight through mysterious portals, Casper will discover phantom dimensions where he must destroy the haunting spirits that are out to stop his mission. [TDK Mediactive]… Expand"}, {"name": "Romance of the Three Kingdoms XIV", "details_link": "https://www.metacritic.com/game/pc/romance-of-the-three-kingdoms-xiv", "publisher": "Koei Tecmo Games", "release_date": "Dec 24 2020", "developers": ["Koei Tecmo Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 58, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/3/ee88691e24240e91dab81e7493ddef70-98.jpg", "descriptions": "Triumph over the land, take charge of the fate of China! Conquer territories and fly your colors!"}, {"name": "Backbreaker", "details_link": "https://www.metacritic.com/game/playstation-3/backbreaker", "publisher": "505 Games", "release_date": "Jun  1 2010", "developers": ["NaturalMotion"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 58, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/94239d7efc7dcfe84d50e2460e385980-98.jpg", "descriptions": "It's tackle football like never before. Backbreaker is taking sports video games to a place where the action is never the same and every hit looks and feels as realistic as a Sunday afternoon. Utilizing NaturalMotion's euphoria motion synthesis engine, the same technology featured in \"GrandIt's tackle football like never before. Backbreaker is taking sports video games to a place where the action is never the same and every hit looks and feels as realistic as a Sunday afternoon. Utilizing NaturalMotion's euphoria motion synthesis engine, the same technology featured in \"Grand Theft Auto IV\" and \"Star Wars: The Force Unleashed,\" you'll never see the same tackle again. For the first time in a sports game, this mix of technology, biology and tenacious attitude is turning the gridiron of past, full of canned animations and repetitious gameplay, into a dangerous form of self expression. Every unique tackle in the world of Backbreaker is an artistic exercise in hard hits and athletic skill. It's time to show your friends just how painful art can be. Through a combination of biology and robotics research, euphoria uses the CPU power of next-generation consoles to simulate the nervous system, muscles, and biomechanics of the football players in real-time. This is the first time this technology is being employed for a sports game. While conventional football games can only load a finite number of animations from a disc, Backbreaker's real-time technology will never allow the gameplay to become stale. Forget about prim and proper, Backbreaker presents a fast-paced, gritty gameplay experience that's more Burnout than Madden. [NaturalMotion]… Expand"}, {"name": "The Dark Crystal: Age of Resistance Tactics", "details_link": "https://www.metacritic.com/game/xbox-one/the-dark-crystal-age-of-resistance-tactics", "publisher": "En Masse Entertainment", "release_date": "Feb  4 2020", "developers": ["BonusXP"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 58, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/1/8622d148693a1d5b3c1c62e275235786-98.jpg", "descriptions": "Netflix's The Dark Crystal: Age of Resistance comes to life as a tactical strategy game. In The Dark Crystal: Age of Resistance Tactics, lead the heroic Gelfling to restore light to the world of Thra! Experience everything the fantasy world has to offer by playing throughand going beyondtheNetflix's The Dark Crystal: Age of Resistance comes to life as a tactical strategy game. In The Dark Crystal: Age of Resistance Tactics, lead the heroic Gelfling to restore light to the world of Thra! Experience everything the fantasy world has to offer by playing throughand going beyondthe events of the Netflix series. Encounter never-seen-before playable characters, stories, and environments.  Over the course of 80 unique turn-based campaign battles taking place across the lands of Thra, recruit new allies and customize their forces by assigning them jobs and outfitting them with new equipment. Continue the Story in an Expanded World of Thra - Delve deeper into the legend of The Dark Crystal to learn more about the Gelfling clans and their histories across more than 5 diverse, modular territories. Choose from over 15 character jobs, play through reimagined and brand-new battles against the malicious Skeksis and help lead the proud Gelfling to victory.\r Gelfling Tactics - Devise unique ways for the outmatched Gelfling to fulfill their prophecy in multi-layered, turn-based tactical combat. Units can be customized for specific fights with gear, upgradable abilities and a job system. Use guile, planning and cunning to overcome superior foes!\r Highly Replayable - Replay finished battles to earn full marks or replay the entire game! Once completed, challenge New Game+ mode, keeping all progress from the first playthrough while facing more difficult versions of battles.\r Rich, Dynamic Environments - The world of Thra is a living, unpredictable environment as dangerous as it is beautiful. Dynamic events on the battlefield may create opportunities or put the Gelflings at a disadvantage, necessitating rapid changes in strategy.… Expand"}, {"name": "SolSeraph", "details_link": "https://www.metacritic.com/game/xbox-one/solseraph", "publisher": "Sega", "release_date": "Jul 10 2019", "developers": ["ACE Team"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/f54081ce4578dec71c1cf27a158947d3-98.jpg", "descriptions": "Build your cities and set up defensive structures to protect them from the constant threat of monsters. Brought to you by ACE Team, SolSeraph combines action and strategy for a rich gameplay experience reminiscent of the 16-bit era."}, {"name": "Truberbrook", "details_link": "https://www.metacritic.com/game/switch/truberbrook", "publisher": "Headup Games", "release_date": "Apr 17 2019", "developers": ["Merge Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 58, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/cbc169b0687550a1050a38242c5db707-98.jpg", "descriptions": "Trüberbrook is a mystery-sci-fi adventure game. Enjoy an adventurous vacation to a 1960's parallel universe. A Sci-Fi-Mystery Adventure Game with handmade scenery. Imagine yourself on a vacation to Europe in the late sixties. Now, picture yourself as a young American scientist; HansTrüberbrook is a mystery-sci-fi adventure game. Enjoy an adventurous vacation to a 1960's parallel universe. A Sci-Fi-Mystery Adventure Game with handmade scenery. Imagine yourself on a vacation to Europe in the late sixties. Now, picture yourself as a young American scientist; Hans Tannhauser. While you're at it, think of Trüberbrook, a remote village in rural Germany. Because, that's where you end up after hitting the continent. But who cares, you won the trip in a lottery! Or at least, that’s how it seems. But don't fear, instead of getting some rest, you could find yourself having to save the world … … Expand"}, {"name": "DualPenSports", "details_link": "https://www.metacritic.com/game/3ds/dualpensports", "publisher": "Namco Bandai Games", "release_date": "Jun 21 2011", "developers": ["indieszero"], "platforms": "3DS", "genres": ["Sports", "General", "General"], "meta_score": 58, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/2/a9a8d14a5cbbb719b9135019a7a033a9-98.jpg", "descriptions": "DualPenSports is the only Nintendo 3DS title with dual-action stylus control, enabling handheld gamers a new way to compete in classic sports games."}, {"name": "Oddworld: Munch's Oddysee HD", "details_link": "https://www.metacritic.com/game/switch/oddworld-munchs-oddysee-hd", "publisher": "Oddworld Inhabitants", "release_date": "May 14 2020", "developers": ["Just Add Water", "Square One Games"], "platforms": ["PlayStation 3", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 58, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/85e4051800f3c1f996b6678e9636a151-98.jpg", "descriptions": "Munch, the Gabbit with \"odditude,\" and his sidekick Abe lead an off-beat revolution to save the world. With their sacred land in jeopardy of being destroyed by the greedy Glukkons, Munch and Abe team up to teach those rascals a lesson by using their chanting prowess to control the enemy,Munch, the Gabbit with \"odditude,\" and his sidekick Abe lead an off-beat revolution to save the world. With their sacred land in jeopardy of being destroyed by the greedy Glukkons, Munch and Abe team up to teach those rascals a lesson by using their chanting prowess to control the enemy, arming themselves with wacky weapons, and acquiring power-ups for extra boosts. You can switch between Munch and Abe at anytime to utilize each character's unique abilities and access certain areas.… Expand"}, {"name": "Dynasty Warriors: Gundam 3", "details_link": "https://www.metacritic.com/game/playstation-3/dynasty-warriors-gundam-3", "publisher": "Namco Bandai Games", "release_date": "Jun 28 2011", "developers": ["Omega Force", "Koei Tecmo Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 58, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/5d81262416767ed7856a16e4169aebac-98.jpg", "descriptions": "First released in December 2008, the DYNASTY WARRIORS GUNDAM series has gained much popularity, and finally the newest entry is going to be released soon. By continuing all of the popular elements and loosing unpopular elements of the previous installments, we hope that this installment isFirst released in December 2008, the DYNASTY WARRIORS GUNDAM series has gained much popularity, and finally the newest entry is going to be released soon. By continuing all of the popular elements and loosing unpopular elements of the previous installments, we hope that this installment is the best of the series. With newly added features to set this installment apart from the rest, it has evolved to increase the player's sense of \"an authentic battlefield experience.\"… Expand"}, {"name": "Commandos Strike Force", "details_link": "https://www.metacritic.com/game/playstation-2/commandos-strike-force", "publisher": "Eidos Interactive", "release_date": "Apr  4 2006", "developers": ["Pyro Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Historic"], "meta_score": 58, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/83fc973e6db9cf1ebab5277272a78a17-98.jpg", "descriptions": "In the most fearsome war ever fought, emerged the most fearless soldiers – the Commandos. Have you got what it takes to join the original elite Special Force in the World War II shooter Commandos Strike Force? In a new direction for the multi-million selling series, Commandos Strike ForceIn the most fearsome war ever fought, emerged the most fearless soldiers – the Commandos. Have you got what it takes to join the original elite Special Force in the World War II shooter Commandos Strike Force? In a new direction for the multi-million selling series, Commandos Strike Force takes you right into the heart of the action from a first person perspective. Take control of the three members of the Strike Force unit, each with their own play style. Switch between the Green Beret, always at the heart of the action with his expertise in combat and the use of heavy weaponry; the Sniper with his nerves of steel and expert marksmanship; and the Spy, stealthily striking at the heart of the enemy. However, it is your choice how you execute plans of attack by using the Commandos' unique skills. Set in war torn Europe amid the backdrop of World War II, you must take your highly trained group on a series of daring missions, deep behind enemy lines in France, Norway and Russia. Taking control of a Nazi-occupied town, freeing French Resistance prisoners and kidnapping a general are a few of the large range of missions. As well as a compelling single player campaign, the game features a variety of online multiplayer modes. [Eidos Interactive]… Expand"}, {"name": "Gunblade NY & L.A. Machineguns Arcade Hits Pack", "details_link": "https://www.metacritic.com/game/wii/gunblade-ny-la-machineguns-arcade-hits-pack", "publisher": "Sega", "release_date": "Aug 30 2010", "developers": ["Sega"], "platforms": "Wii", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "Light Gun"], "meta_score": 58, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/7ab8356cd7f2332c88b1cb65409539ce-98.jpg", "descriptions": "This two-pack of arcade shooters with extra features like unlockable weapon features and a new combo score system."}, {"name": "Enemy Engaged 2", "details_link": "https://www.metacritic.com/game/pc/enemy-engaged-2", "publisher": "G2 Games", "release_date": "Jul 10 2007", "developers": ["Gameyus Interactive"], "platforms": "PC", "num_players": "4  Online", "genres": ["Simulation", "Flight", "Helicopter", "Helicopter", "Civilian"], "meta_score": 58, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/8/68d607f6bd898763ffb07c4a1f8300bc-98.jpg", "descriptions": "Enemy Engaged 2 is the sequel to the best selling chopper classic, \"Enemy Engaged: RAH-66 Comanche Versus Ka-52 Hokum\". Enemy Engaged 2 is set to take the series even further with new dynamic missions and a complete overhaul of graphics and audio that bring the game up to date with theEnemy Engaged 2 is the sequel to the best selling chopper classic, \"Enemy Engaged: RAH-66 Comanche Versus Ka-52 Hokum\". Enemy Engaged 2 is set to take the series even further with new dynamic missions and a complete overhaul of graphics and audio that bring the game up to date with the latest and best flight simulations available. Modern helicopter combat simulation with realistic flight physics. Three exciting theaters of war with two opposing campaigns each. Dynamic real-time battlefields. No linear mission plot or predefined unit behavior. Over 30,000 square kilometers of flying area over Lebanon, Taiwan and Korea. Diverse combat environments executed in lush 3D detail under a wide range of weather conditions. Over 1,200 very detailed and blue-print precise vehicles, chosen from among proven classics in actual use in armed forces around the globe. Use immersive voice control to command your gunner and wingman. [Strategy First Inc.]… Expand"}, {"name": "God Mode", "details_link": "https://www.metacritic.com/game/pc/god-mode", "publisher": "Atlus", "release_date": "Apr 19 2013", "developers": ["Old School Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/bfe08bd34c58e44b2635abf3335d23a6-98.jpg", "descriptions": "God Mode is a humorous co-op third person shooter with non-linear gameplay, fast and frantic shooting, hordes of on-screen enemies, and stunning visuals."}, {"name": "1954: Alcatraz", "details_link": "https://www.metacritic.com/game/pc/1954-alcatraz", "publisher": "Daedalic Entertainment", "release_date": "Mar 11 2014", "developers": ["Daedalic Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Puzzle", "Miscellaneous", "Adventure", "Puzzle", "Point-and-Click", "General"], "meta_score": 58, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/3c9ca66c9353cd6d8f13c715cd44f7c1-98.jpg", "descriptions": "1954: Alcatraz takes place in San Francisco during the 50s and tells the story of Joe, who's serving a sentence of 40 years for armed assault. Of course, he's eager to escape 'The Rock'; but he needs the help of his wife, Christine, to have even the slightest chance.\r She, however, has her1954: Alcatraz takes place in San Francisco during the 50s and tells the story of Joe, who's serving a sentence of 40 years for armed assault. Of course, he's eager to escape 'The Rock'; but he needs the help of his wife, Christine, to have even the slightest chance.\r She, however, has her own heap of problems: The couple's partner in crime, Mickey, threatens to kill her, if she doesn't bring him the heist's hidden loot. But where is the cash? Only Joe knows, while all crooks of North Beach take their chance at the great opportunity. Who will win the race for the dough?\r No convict ever escaped the prison island of Alcatraz; and is it really that much better in the vice-ridden city, where drug deals, blackmailing, suicide and murder are daily business?… Expand"}, {"name": "Star Ocean: Integrity and Faithlessness", "details_link": "https://www.metacritic.com/game/playstation-4/star-ocean-integrity-and-faithlessness", "publisher": "Square Enix", "release_date": "Jun 28 2016", "developers": ["Tri-Ace"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Japanese-Style"], "meta_score": 58, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/ac7258a79d40c508faa0e416630889a6-98.jpg", "descriptions": "Set between the events of STAR OCEAN: The Second Story and STAR OCEAN: Till the End of Time, STAR OCEAN: Integrity and Faithlessness takes place centuries after humans have left Earth for the stars. On a planet in the distant Faykreed star system, the swordsman Fidel Camuze and his childhoodSet between the events of STAR OCEAN: The Second Story and STAR OCEAN: Till the End of Time, STAR OCEAN: Integrity and Faithlessness takes place centuries after humans have left Earth for the stars. On a planet in the distant Faykreed star system, the swordsman Fidel Camuze and his childhood friend Miki Sauvester set out to protect their village from being swallowed in the tides of civil unrest.… Expand"}, {"name": "WWE SmackDown vs. Raw 2009", "details_link": "https://www.metacritic.com/game/ds/wwe-smackdown-vs-raw-2009", "publisher": "THQ", "release_date": "Nov  9 2008", "developers": ["TOSE"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 58, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/a8572416b9ad68252f9c7047bc613146-98.jpg", "descriptions": "WWE SmackDown vs. Raw 2009 for Nintendo DS returns with new gameplay controls that utilize the stylus and D-pad to deliver a compelling handheld fighting game experience. The redesigned Season Mode takes a role-playing approach, allowing players to interact with Superstars, upgrade theirWWE SmackDown vs. Raw 2009 for Nintendo DS returns with new gameplay controls that utilize the stylus and D-pad to deliver a compelling handheld fighting game experience. The redesigned Season Mode takes a role-playing approach, allowing players to interact with Superstars, upgrade their abilities and complete missions on a quest toward legendary goals. In addition, a larger Superstar roster, new match types and the inclusion of Create-A-Superstar provides players with a variety of intriguing options to enhance gameplay. [THQ]… Expand"}, {"name": "Bee Simulator", "details_link": "https://www.metacritic.com/game/pc/bee-simulator", "publisher": "Bigben Interactive", "release_date": "Nov 14 2019", "developers": ["Varsav Game Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Simulation", "Action Adventure", "General", "Open-World"], "meta_score": 58, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/27b19b4048a72aa2625aa67b87444988-98.jpg", "descriptions": "Live the big adventure of a small bee! Explore a world brimming with life in which you collect pollen, defy dangerous wasps and save your hive. Play with others in three game modes, including co-op and PvP on split screen."}, {"name": "Rayman DS", "details_link": "https://www.metacritic.com/game/ds/rayman-ds", "publisher": "Ubisoft", "release_date": "Mar 24 2005", "developers": ["DC Studios"], "platforms": ["3DS", "iPhone/iPad", "PC", "DS"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 58, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/ca86d8b094148c107a6b82ee009c1768-98.jpg", "descriptions": "Although he (or she?) has no arms and no legs, Rayman is one of the most recognizable videogame characters around the world. The fearless and friendly Rayman heroically arrives on the Nintendo DS to defeat the pirate terror that has enslaved his world. Players assume the role of Rayman andAlthough he (or she?) has no arms and no legs, Rayman is one of the most recognizable videogame characters around the world. The fearless and friendly Rayman heroically arrives on the Nintendo DS to defeat the pirate terror that has enslaved his world. Players assume the role of Rayman and travel through magical worlds with surreal landscapes and gorgeous eye-popping 3D graphics. Race and battle through 45 intricately designed areas. Explore waterfalls, deep sea caves, and pirate hideouts rendered in rich 3D. Monitor your progress, track your lums, and keep an eye on Rayman's health on the interactive bottom screen of your DS. Run, jump, ski, swim, and fly with your helicopter hair. Fly rockets, ride whirlwinds, and surf lava flows on the road to victory. [Ubisoft]… Expand"}, {"name": "Cornerstone: The Song of Tyrim", "details_link": "https://www.metacritic.com/game/pc/cornerstone-the-song-of-tyrim", "publisher": "Ascension Studios", "release_date": "Oct 24 2013", "developers": ["Ascension Studios", "Overflow Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Open-World"], "meta_score": 58, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/3c73389ff04a36d76b5fbd445a3451e5-98.jpg", "descriptions": "Cornerstone: The Song of Tyrim is an open world, action/adventure/puzzle game with an emphasis on physics and player-choice, for PC, Mac and Linux."}, {"name": "The Black Mirror", "details_link": "https://www.metacritic.com/game/pc/the-black-mirror", "publisher": "The Adventure Company", "release_date": "Oct 20 2003", "developers": ["Future Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 58, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/8cdd0f80e28a201a4026ab023e7a8133-98.jpg", "descriptions": "British nobleman, Samuel Gordon, has just returned to his homeland after a self-imposed twelve year absence. Reluctantly returning to his magnificent home, Black Mirror Manor, he is desperate to prove that the untimely death of his ancestor, William Gordon, was not just an ?unfortunateBritish nobleman, Samuel Gordon, has just returned to his homeland after a self-imposed twelve year absence. Reluctantly returning to his magnificent home, Black Mirror Manor, he is desperate to prove that the untimely death of his ancestor, William Gordon, was not just an ?unfortunate incident.? Samuel reads William?s private diary and quickly discovers that there have been a number of mysterious deaths, and as he gets closer to these crimes, he realizes that he is very much at the centre of the mystery. Samuel must do all he can to solve the mystery and keep himself alive. [DreamCatcher]… Expand"}, {"name": "Enter the Matrix", "details_link": "https://www.metacritic.com/game/pc/enter-the-matrix", "publisher": "Atari", "release_date": "May 14 2003", "developers": ["Shiny Entertainment"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Sci-Fi", "Linear", "First-Person", "Sci-Fi"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/c18dd54425fddb641f77d06de8fa65e8-98.jpg", "descriptions": "Merciless Agents stalk your every move. You'll dodge their bullets. Defy gravity. Break all the rules. Explore the hidden depths of the massive dreamworld that has enslaved the human race. How far down does the rabbit hole go? Are you ready to find out? Are you ready to Enter the Matrix? TheMerciless Agents stalk your every move. You'll dodge their bullets. Defy gravity. Break all the rules. Explore the hidden depths of the massive dreamworld that has enslaved the human race. How far down does the rabbit hole go? Are you ready to find out? Are you ready to Enter the Matrix? The game stars all of the key characters from The Matrix Reloaded (likeness and voice over), including Neo (Keaanu Reeves), Trinity (Carrie-Anne Moss), Morpheus (Laurence Fishburne), Agent Smith (Hugo Weaving), Niobe (Jada Pinkett Smith), Ghost (Anthony Wong), Sparks (Lachy Hulme) and Persephone (Monica Bellucci.) [Infogrames]… Expand"}, {"name": "Punch King", "details_link": "https://www.metacritic.com/game/game-boy-advance/punch-king", "publisher": "Acclaim", "release_date": "May 15 2002", "developers": ["Full-Fat"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/bb64fdb54f031dcaa4f9e411a9e2f032-98.jpg", "descriptions": "Punch King tries its best to be the next Punch-Out!!, but it falls short of the mark."}, {"name": "Monster Jam Maximum Destruction", "details_link": "https://www.metacritic.com/game/game-boy-advance/monster-jam-maximum-destruction", "publisher": "Ubisoft", "release_date": "Mar 27 2002", "developers": ["UDS"], "platforms": ["PlayStation 2", "Game Boy Advance"], "genres": ["Driving", "Racing", "Truck"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/d1fc4ec2e8cbfc0f6ac7fd1b289c90df-98.jpg", "descriptions": "Monster Jam the puts you in control of a pint-sized representation of a monster truck and throws you into vehicular combat."}, {"name": "Way of the Samurai 4", "details_link": "https://www.metacritic.com/game/playstation-3/way-of-the-samurai-4", "publisher": "XSEED Games", "release_date": "Aug 21 2012", "developers": ["Acquire"], "platforms": ["PC", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 58, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/b0c067087c1585b142691ab8f2ec5986-98.jpg", "descriptions": "Set just after Japan opened its borders to the West in 1853, Way of the Samurai 4 inserts players into a world of opportunity and uncertainty as a masterless samurai looking to make a name for himself and continues the series’ blend of customization, exploration, action gameplay and quirkySet just after Japan opened its borders to the West in 1853, Way of the Samurai 4 inserts players into a world of opportunity and uncertainty as a masterless samurai looking to make a name for himself and continues the series’ blend of customization, exploration, action gameplay and quirky humor. Taking their place in the overall power struggle amongst the region’s powers, players are given the choice to align themselves with one of three factions: the shogunate pro-government forces, the nationalistic isolationists, and the foreign powers who are directed by the British Navy.… Expand"}, {"name": "Drawn to Life: The Next Chapter", "details_link": "https://www.metacritic.com/game/wii/drawn-to-life-the-next-chapter", "publisher": "THQ", "release_date": "Oct 27 2009", "developers": ["Planet Moon Studios"], "platforms": "Wii", "genres": ["Miscellaneous", "Action Adventure", "Puzzle", "Puzzle", "General", "Puzzle", "Sandbox", "General"], "meta_score": 58, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/d97ee89583d64ea01c437321cab951e5-98.jpg", "descriptions": "In Drawn to Life: The Next Chapter for Wii, players draw their own heroes using the Wii Remote to find the Artifacts of Power and rid the Raposa village of an evil, shadowy figure that has taken over the land. Throughout the game, players draw more than 100 unique items from robust drawingIn Drawn to Life: The Next Chapter for Wii, players draw their own heroes using the Wii Remote to find the Artifacts of Power and rid the Raposa village of an evil, shadowy figure that has taken over the land. Throughout the game, players draw more than 100 unique items from robust drawing tools, such as vehicles, weapons and tools, to conquer their enemies. The all-new Action Drawing tool allows for objects to be drawn directly into the game to help navigate through several environments, including a sky world, a jungle and a shadow city. In addition, the game’s multi-player feature allows players to draw their team members and equipment to compete against others in a variety of mini-games, such as soccer, hockey and basketball. [THQ]… Expand"}, {"name": "Gas Guzzlers: Combat Carnage", "details_link": "https://www.metacritic.com/game/pc/gas-guzzlers-combat-carnage", "publisher": "Gamepires", "release_date": "May 18 2012", "developers": ["Gamepires"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 58, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/d159f40fa79d0ee31b4ef1cf43b06109-98.jpg", "descriptions": "Gas Guzzlers is a fast-paced addictive combat racing game for the PC. The game is played from the “behind the car“ camera perspective and features many different vehicles, weapons, upgrades, on-track bonuses as well as distinctive and astonishing environments. Player starts with lowGas Guzzlers is a fast-paced addictive combat racing game for the PC. The game is played from the “behind the car“ camera perspective and features many different vehicles, weapons, upgrades, on-track bonuses as well as distinctive and astonishing environments. Player starts with low performance vehicle and gradually works his way up by earning money in a series of challenging races. Along with developing his driving and fighting skills, player has to invest his hard earned money wisely to grab the chance for driving on the road to glory.… Expand"}, {"name": "Tennis World Tour 2", "details_link": "https://www.metacritic.com/game/playstation-5/tennis-world-tour-2", "publisher": "Maximum Games", "release_date": "Mar 25 2021", "developers": ["Big Ant Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 58, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/5/f8ad20a2bd94bc9a5578cf179d89bc82-98.jpg", "descriptions": "Compete as the world's top players or create your own player to dominate the world rankings. Tennis world tour 2 will give you the opportunity to experience the purest form of tennis, with faster paced gameplay and enhanced animations that create most realistic tennis simulation yet. ChooseCompete as the world's top players or create your own player to dominate the world rankings. Tennis world tour 2 will give you the opportunity to experience the purest form of tennis, with faster paced gameplay and enhanced animations that create most realistic tennis simulation yet. Choose from multiple game modes, in single or doubles games, and challenge your friends locally or online.… Expand"}, {"name": "Override 2: Super Mech League", "details_link": "https://www.metacritic.com/game/xbox-series-x/override-2-super-mech-league", "publisher": "Modus Games", "release_date": "Dec 22 2020", "developers": ["Modus Studios Brazil"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Fighting", "3D"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/382b7448d700ea76750cd3924d9c45b5-98.jpg", "descriptions": "Override is a 3D fighting game with local and online multiplayer modes that is perfect for competitive players, mech fans, or casual brawlers.\rThis newest entry to the series features a fully online Career Mode, improved combat systems, and tons of multiplayer modes."}, {"name": "ZHEROS", "details_link": "https://www.metacritic.com/game/pc/zheros", "publisher": "Rimlight Studios", "release_date": "Feb 15 2016", "developers": ["Rimlight Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 58, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/839439c6d1fb43ae1c49d7e3f1675cc1-98.jpg", "descriptions": "ZHEROS is a 3D beat’em up, set on one goal: pure and fast action. Plenty of fights and an original style will take the player on a fascinating and twisted journey."}, {"name": "Dungeons & Dragons Tactics", "details_link": "https://www.metacritic.com/game/psp/dungeons-dragons-tactics", "publisher": "Atari", "release_date": "Aug 14 2007", "developers": ["Kuju Entertainment"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 58, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/21425971bd1d814159dffd0288007947-98.jpg", "descriptions": "Faithfully utilizing the Dungeons & Dragons 3.5 rule-set, Dungeons & Dragons: Tactics allows players to take a party of six adventurers into a wide variety of dangerous environments to experience deep and exciting turn-based action. All of the core races and classes are available to theFaithfully utilizing the Dungeons & Dragons 3.5 rule-set, Dungeons & Dragons: Tactics allows players to take a party of six adventurers into a wide variety of dangerous environments to experience deep and exciting turn-based action. All of the core races and classes are available to the player, including two Psionic classes, the Psion and the Psychic Warrior. Players can customize their characters and store as many as their memory stick can handle. Battle many different types of monsters from the Dungeons and Dragons universe. Play with your friends wirelessly in both cooperative and adversarial game modes. Extend the gameplay experience with downloadable content. [Atari]… Expand"}, {"name": "Silent Hill: Book of Memories", "details_link": "https://www.metacritic.com/game/playstation-vita/silent-hill-book-of-memories", "publisher": "Konami", "release_date": "Oct 16 2012", "developers": ["WayForward"], "platforms": "PlayStation Vita", "num_players": "Up to 4 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 58, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/84ca441f7edf67d701099243f68a8e2b-98.jpg", "descriptions": "Silent Hill: Book of Memories brings the Silent Hill series onto the Next Generation Portable."}, {"name": "Beijing 2008 - The Official Video Game of the Olympic Games", "details_link": "https://www.metacritic.com/game/playstation-3/beijing-2008---the-official-video-game-of-the-olympic-games", "publisher": "Sega", "release_date": "Jul  8 2008", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 58, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/5daf9c1e8e8212a132ba1b661d721b1d-98.jpg", "descriptions": "The online functionality of all three platforms ensures that for the very first time, fans of the Olympic Games can experience the thrill of competing against other gamers across the globe in the world’s greatest sporting event. Beijing 2008 is a simulation of over 35 events from the BeijingThe online functionality of all three platforms ensures that for the very first time, fans of the Olympic Games can experience the thrill of competing against other gamers across the globe in the world’s greatest sporting event. Beijing 2008 is a simulation of over 35 events from the Beijing 2008 Olympic Games and allows gamers to experience the thrill of competing in many of the official venues ranging from the famous Beijing National Stadium (the \"Bird Nest\") to the National Aquatics Center (the \"Water Cube\"). In addition, Beijing 2008 incorporates innovative control schemes that allow novice gamers to learn how to play the game, while providing experienced gamers the chance to set new records. Through the addition of online gameplay and a variety of game modes never seen in an official video game of the Olympic Games before, Beijing 2008 truly allows gamers to experience the \"Olympic Spirit. [Sega]… Expand"}, {"name": "Worms: Battle Islands", "details_link": "https://www.metacritic.com/game/wii/worms-battle-islands", "publisher": "THQ", "release_date": "Nov 23 2010", "developers": ["Team17"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Artillery"], "meta_score": 58, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/29a3ef03369785265607e1ad9bca5748-98.jpg", "descriptions": "The classic Worms series returns with Worms: Battle Islands."}, {"name": "Mario Tennis: Ultra Smash", "details_link": "https://www.metacritic.com/game/wii-u/mario-tennis-ultra-smash", "publisher": "Nintendo", "release_date": "Nov 20 2015", "developers": ["Nintendo", "Camelot Software Planning"], "platforms": "Wii U", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 58, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/8d5a41b83a6726405699510389a58bcb-98.jpg", "descriptions": "Compete with cohorts in the multiplayer Mario Tennis: Ultra Smash. Surprise your opponents with a new move to the series, the Jumpshot, which sends the ball flying down the court. Change the sport up with new Mega Battles, using the Mega Mushroom to gain an advantage over the competition.Compete with cohorts in the multiplayer Mario Tennis: Ultra Smash. Surprise your opponents with a new move to the series, the Jumpshot, which sends the ball flying down the court. Change the sport up with new Mega Battles, using the Mega Mushroom to gain an advantage over the competition. Claim your spot in Mario Tennis lore in singles (1v1) or doubles (2v2) as you play with and against family, friends or the CPU using returning and new characters to the series.… Expand"}, {"name": "Disney's TRON: Evolution", "details_link": "https://www.metacritic.com/game/playstation-3/disneys-tron-evolution", "publisher": "Disney Interactive Studios", "release_date": "Dec  7 2010", "developers": ["Propaganda Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "General", "Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 58, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/62ee5b7695dd1833a91ab9ef0ab41484-98.jpg", "descriptions": "Set during the era between the two TRON films, TRON: Evolution conveys the story of significant events within the TRON mythology. The game features an epic adventure across a massive digital world filled with high-mobility disc-based combat and advanced light cycles. TRON: Evolution is oneSet during the era between the two TRON films, TRON: Evolution conveys the story of significant events within the TRON mythology. The game features an epic adventure across a massive digital world filled with high-mobility disc-based combat and advanced light cycles. TRON: Evolution is one of the keys to unlocking the TRON mythology. The game's story takes place before the film \"TRON: Legacy\" events and provides insight into the film's past. As an integrated entertainment experience, the film references elements of the game's story. As part of the connection between the game and film, actress Olivia Wilde stars as Quorra in TRON: Evolution. Wilde's voice and likeness as Quorra provide players with another direct link to the film as they discover how earlier events within the world of TRON shape her character’s future. [Disney Interactive Studios]… Expand"}, {"name": "Front Mission Evolved", "details_link": "https://www.metacritic.com/game/xbox-360/front-mission-evolved", "publisher": "Square Enix", "release_date": "Sep 28 2010", "developers": ["Double Helix Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 58, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/16c9b4ff82f29b276affad75505fc407-98.jpg", "descriptions": "The year is 2171 A.D. Humanity has reached for the stars once more. Keen to seize a controlling stake in this as yet unconquered region, the global superpowers have raced to build orbital elevators, swiftly turning the emptiness of space into a tangle of surveillance satellite networks andThe year is 2171 A.D. Humanity has reached for the stars once more. Keen to seize a controlling stake in this as yet unconquered region, the global superpowers have raced to build orbital elevators, swiftly turning the emptiness of space into a tangle of surveillance satellite networks and military way stations. Back on the surface, while nations no longer engage in all-out war, border skirmishes have become the more frequent. On these ever-shifting front lines, armored humanoid battle vehicles - code named \"wanzers\" (from \"wanderpanzer\") - have proven to ber the unrivaled kings. History has taught us that wherever humanity goes, war is sure to follow...and in this technological age, there is nowhere man cannot go.  From the creative minds of Square Enix and Double Helix Games, FRONT MISSION EVOLVED brings the classic FRONT MISSION franchise into an action-packed third-person shooter that gives players full control of a massive humanoid war machine-the wanzer. Players battle through intense combat situations as they explore an immersive world in both the single player campaign and online multiplayer. [Square Enix]… Expand"}, {"name": "One Piece: World Seeker", "details_link": "https://www.metacritic.com/game/playstation-4/one-piece-world-seeker", "publisher": "Bandai Namco Games", "release_date": "Mar 15 2019", "developers": ["Ganbarion", "Bandai Namco Games"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["General", "Action Adventure", "Open-World"], "meta_score": 58, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/041d0d7a4f6048e11442951798113441-98.jpg", "descriptions": "Leave your compass behind and join Luffy as he embarks on a brand new action-packed adventure where you can experience the powers of the legendary Gum-Gum fruit to uncover hidden secrets on an original, never-before-seen island."}, {"name": "Jupiter & Mars", "details_link": "https://www.metacritic.com/game/playstation-4/jupiter-mars", "publisher": "Tigertron", "release_date": "Apr 22 2019", "developers": ["Tigertron"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 58, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/8e99fee5708b63fdbd7c771c5634a75e-98.jpg", "descriptions": "Jupiter & Mars is an undersea adventure set in a future-Earth. Sea levels have risen from melting ice caps and climate change. As a result, the coastal cities are all but completely submerged. Since man’s disappearance, the oceans have begun to reclaim themselves. Will Jupiter and MarsJupiter & Mars is an undersea adventure set in a future-Earth. Sea levels have risen from melting ice caps and climate change. As a result, the coastal cities are all but completely submerged. Since man’s disappearance, the oceans have begun to reclaim themselves. Will Jupiter and Mars succeed in bringing life back to the oceans?… Expand"}, {"name": "Eagle Eye Golf", "details_link": "https://www.metacritic.com/game/playstation-2/eagle-eye-golf", "publisher": "Aksys Games", "release_date": "Oct 10 2006", "developers": ["Telenet Japan"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/638ace28e7fdbadb4584df2fd99779f9-98.jpg", "descriptions": "Eagle Eye Golf is a golf simulator. Play many different game modes to improve every ability necessary to win the tournament. This title is also very customizable: you can create a golfer as you like and even edit couses from scratch. At least three different emnvironments await you: desert,Eagle Eye Golf is a golf simulator. Play many different game modes to improve every ability necessary to win the tournament. This title is also very customizable: you can create a golfer as you like and even edit couses from scratch. At least three different emnvironments await you: desert, grass and reef, use every object to create your dream course. If you want you can re-edit the entire game and save it! Beautifil trees moving by wind and birds flying throuh the sky complete the stage. Play a real simulation in a realistic environment. [505 GameStreet]… Expand"}, {"name": "APB (All Points Bulletin)", "details_link": "https://www.metacritic.com/game/pc/apb-all-points-bulletin", "publisher": "Electronic Arts", "release_date": "Jun 29 2010", "developers": ["Realtime Worlds"], "platforms": ["Xbox 360", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Modern", "Modern"], "meta_score": 58, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/ad554de3d82c2c3cb908d7b0070c72fd-98.jpg", "descriptions": "APB takes the universal theme of Criminals and Enforcers and brings it to a persistent, open-world, online multiplayer setting in the modern, crime-ridden fictional city of San Paro. Some players will achieve notoriety by feeding on the city, its people and its businesses - the Criminals.APB takes the universal theme of Criminals and Enforcers and brings it to a persistent, open-world, online multiplayer setting in the modern, crime-ridden fictional city of San Paro. Some players will achieve notoriety by feeding on the city, its people and its businesses - the Criminals. Some will live by a higher code and instead feed on the criminals and their organizations - the Enforcers. This dynamic where players become the core content for other players is one of the many unique features of APB. APB promises unrivalled customisation options and scope for creativity thanks to its innovative expression suite, gritty, urban conflict in a persistent online world and a leaderboard dynamic allowing players to become in-game celebrities. [Realtime Worlds]… Expand"}, {"name": "Ford Racing 3", "details_link": "https://www.metacritic.com/game/xbox/ford-racing-3", "publisher": "2K Games", "release_date": "Mar 22 2005", "developers": ["Razorworks Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "6  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/e53e8acf54ef1bca8da983e1dd19cc48-98.jpg", "descriptions": "From the Model T to the 2005 Mustang GT, Ford Racing 3 features a variety of vehicles from the Ford manufacturer. Jump behind the wheel of your favorite car, and then test your driving skills on a challenging courses, including raceway, rally, and off-road competitions. You can unlock moreFrom the Model T to the 2005 Mustang GT, Ford Racing 3 features a variety of vehicles from the Ford manufacturer. Jump behind the wheel of your favorite car, and then test your driving skills on a challenging courses, including raceway, rally, and off-road competitions. You can unlock more tracks and vehicles in single-player races, or you can race against your friends online in multiplayer modes.… Expand"}, {"name": "Spider-Man: Edge of Time", "details_link": "https://www.metacritic.com/game/playstation-3/spider-man-edge-of-time", "publisher": "Activision", "release_date": "Oct  4 2011", "developers": ["Beenox"], "platforms": ["3DS", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Adventure", "Fantasy", "Beat-'Em-Up", "Fantasy", "Third-Person", "Fantasy", "3D"], "meta_score": 58, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/7ac65a10affddb1ad0deaafc90bacdbc-98.jpg", "descriptions": "Developed by Activision-owned studio Beenox, Spider-Man: Edge of Time challenges the player to take on the roles of both classic Amazing Spider-Man and Spider-Man 2099 to correct a timestream gone awry and prevent a catastrophic future brought on by the early and untimely death of Peter Parker."}, {"name": "Attractio", "details_link": "https://www.metacritic.com/game/playstation-4/attractio", "publisher": "GameCoder Studios", "release_date": "Jan 19 2016", "developers": ["GameCoder Studios"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "genres": ["Puzzle", "Action", "General"], "meta_score": 58, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/7104bae0134a5fdddbd28fc5a2795425-98.jpg", "descriptions": "Attractio is a first person puzzle game where the player has to solve challenging puzzles manipulating gravity.\r The game is set in a far future where three contestants try to win the prize offered in a reality show competition called Attractio, the prize can be money, advanced technologyAttractio is a first person puzzle game where the player has to solve challenging puzzles manipulating gravity.\r The game is set in a far future where three contestants try to win the prize offered in a reality show competition called Attractio, the prize can be money, advanced technology or freedom, depending on the choosing of the victor. The winner will be the first to solve and survive the many dangerous puzzles in the game.… Expand"}, {"name": "Jackass the Game", "details_link": "https://www.metacritic.com/game/playstation-2/jackass-the-game", "publisher": "Red Mile Entertainment", "release_date": "Sep 24 2007", "developers": ["Sidhe Interactive"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "General"], "meta_score": 58, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/18fe2d3cf2a3695bc2789457e34c40e9-98.jpg", "descriptions": "Johnny knoxville and the jackass crew are knee deep in their latest series of ill-conceived stunts, pranks and acts of indecency, and this time you’re in the director's seat. Take control of your favorite degenerates through a massive range of all-new challenges. An onslaught of absurdJohnny knoxville and the jackass crew are knee deep in their latest series of ill-conceived stunts, pranks and acts of indecency, and this time you’re in the director's seat. Take control of your favorite degenerates through a massive range of all-new challenges. An onslaught of absurd situations lower the bar and up the ante for the self-inflicted injury, degradation and low moral caliber you’ve come to love and expect from this special group of idiots. [Red Mile Entertainment]… Expand"}, {"name": "The Tales of Bearsworth Manor: Puzzling Pages", "details_link": "https://www.metacritic.com/game/wii/the-tales-of-bearsworth-manor-puzzling-pages", "publisher": "Square Enix", "release_date": "Jun 21 2010", "developers": ["Square Enix"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/3fd7ec115c2559735eea14b8c78ec3a9-98.jpg", "descriptions": "[WiiWare]   A crumbling mansion is home to a most peculiar picture book. Gather your courage and open the door to this odd, unsettling and slightly scary tale. Solve innovative puzzles by using the Wii Remote controller to throw animated paper bears into the picture book's unusual pages.[WiiWare]   A crumbling mansion is home to a most peculiar picture book. Gather your courage and open the door to this odd, unsettling and slightly scary tale. Solve innovative puzzles by using the Wii Remote controller to throw animated paper bears into the picture book's unusual pages. Grab all the red candies found inside, carefully place your bears and cleverly manipulate the unique environments. Delve into the unfolding drama of Pina, the mysterious young girl residing in the mansion. Thirty exciting and challenging stages await you.… Expand"}, {"name": "Shelter 2", "details_link": "https://www.metacritic.com/game/pc/shelter-2", "publisher": "Might and Delight", "release_date": "Mar  9 2015", "developers": ["Might and Delight"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "General", "Virtual", "Virtual Life"], "meta_score": 58, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/4c99b9b0587727d63a666705cc29e304-98.jpg", "descriptions": "The beauty of nature goes hand in hand with its unforgiving rawness. That is central in Shelter 2, and one of the reasons we chose to make a game about a Lynx. They are in middle of the food chain, and there are far more vicious things out on the cold tundra...Guide a powerful Lynx throughThe beauty of nature goes hand in hand with its unforgiving rawness. That is central in Shelter 2, and one of the reasons we chose to make a game about a Lynx. They are in middle of the food chain, and there are far more vicious things out on the cold tundra...Guide a powerful Lynx through vast open landscapes. Give birth to your cubs, raise and strengthen them by mastering your skills for hunting prey. Explore the wild beauty of nature and do everything possible to prepare your family for the vicious entities dwelling on the cold tundra.… Expand"}, {"name": "Front Mission Evolved", "details_link": "https://www.metacritic.com/game/playstation-3/front-mission-evolved", "publisher": "Square Enix", "release_date": "Sep 28 2010", "developers": ["Double Helix Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 58, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/619037417fadcda0247b7720220c60f2-98.jpg", "descriptions": "The year is 2171 A.D. Humanity has reached for the stars once more. Keen to seize a controlling stake in this as yet unconquered region, the global superpowers have raced to build orbital elevators, swiftly turning the emptiness of space into a tangle of surveillance satellite networks andThe year is 2171 A.D. Humanity has reached for the stars once more. Keen to seize a controlling stake in this as yet unconquered region, the global superpowers have raced to build orbital elevators, swiftly turning the emptiness of space into a tangle of surveillance satellite networks and military way stations. Back on the surface, while nations no longer engage in all-out war, border skirmishes have become the more frequent. On these ever-shifting front lines, armored humanoid battle vehicles - code named \"wanzers\" (from \"wanderpanzer\") - have proven to ber the unrivaled kings. History has taught us that wherever humanity goes, war is sure to follow...and in this technological age, there is nowhere man cannot go.  From the creative minds of Square Enix and Double Helix Games, FRONT MISSION EVOLVED brings the classic FRONT MISSION franchise into an action-packed third-person shooter that gives players full control of a massive humanoid war machine-the wanzer. Players battle through intense combat situations as they explore an immersive world in both the single player campaign and online multiplayer. [Square Enix]… Expand"}, {"name": "Tomb Raider: Legend", "details_link": "https://www.metacritic.com/game/ds/tomb-raider-legend", "publisher": "Eidos Interactive", "release_date": "Nov 14 2006", "developers": ["Human Soft"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "DS"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "Modern", "Linear"], "meta_score": 58, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/9ad0806c1cf1120c55c386cd098675c2-98.jpg", "descriptions": "Tomb Raider: Legend revives the athletic, intelligent and entertaining adventurer who won the hearts and minds of gamers worldwide. New character animations and controls allow Laura to move through stunning environments with grace and precision, while an understanding of the game's originalTomb Raider: Legend revives the athletic, intelligent and entertaining adventurer who won the hearts and minds of gamers worldwide. New character animations and controls allow Laura to move through stunning environments with grace and precision, while an understanding of the game's original appeal reinvigorates the fundamental explore-and-solve adventure experience.… Expand"}, {"name": "L.A. Rush", "details_link": "https://www.metacritic.com/game/playstation-2/la-rush", "publisher": "Midway", "release_date": "Oct 11 2005", "developers": ["Midway"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 58, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/f1e60a736d7a2c9cfb47c83b4f178a1f-98.jpg", "descriptions": "An innovative racing videogame based on the sport of competitive street racing and the fanatical, ruthless lifestyles of those involved. Based on entirely new technology that recreates a living, breathing go anywhere Los Angeles with highly destructible environments, players will be able toAn innovative racing videogame based on the sport of competitive street racing and the fanatical, ruthless lifestyles of those involved. Based on entirely new technology that recreates a living, breathing go anywhere Los Angeles with highly destructible environments, players will be able to explore Los Angeles by day or by night from Compton, to LAX, Hollywood, Beverly Hills, and the beaches of Santa Monica. Pure racing skills are on the line as the world's best street racers gather in L.A. and the player's self-respect is up for grabs in a variety of non-racing driving missions. Cop chases, gridlock, cross-traffic, high-flying jumps, and the death-defying shortcuts that the Rush franchise is known for take L.A. Rush beyond the standard tuner-car simulation game. Featuring a number of gameplay modes and unique objectives, L.A. Rush will feature more than 50 licensed and concept cars, classic muscle cars, SUVs and import tuners, customizable part manufacturers and designs (including several exclusive West Coast Customs vehicle concepts), celebrity talent, music and much more. [Midway]… Expand"}, {"name": "Rhem", "details_link": "https://www.metacritic.com/game/pc/rhem", "publisher": "Got Game Entertainment", "release_date": "Jun 28 2003", "developers": ["Knut Mueller"], "platforms": "PC", "genres": ["Adventure", "3D", "First-Person", "Fantasy", "Fantasy"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/593d90ffbfa9ca783b40be2701842e21-98.jpg", "descriptions": "RHEM is a first person puzzle-based adventure for PC and Mac. You arrive in the world of Rhem by stolen rail car. For a moment, you must simply sit tight -- unable to escape. Then, the car begins to roam this world, revealing its mysteries, little by little. You soon learn that the onlyRHEM is a first person puzzle-based adventure for PC and Mac. You arrive in the world of Rhem by stolen rail car. For a moment, you must simply sit tight -- unable to escape. Then, the car begins to roam this world, revealing its mysteries, little by little. You soon learn that the only possibility for your safe return home is a letter  consisting of four hidden fragments, which you must not only find, but also put together. Upon disembarking the rail car, and now in search of the letter, you will explore the land of Rhem... [Got Game]… Expand"}, {"name": "Evil Dead: A Fistful of Boomstick", "details_link": "https://www.metacritic.com/game/xbox/evil-dead-a-fistful-of-boomstick", "publisher": "THQ", "release_date": "Jun 17 2003", "developers": ["VIS Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 58, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/e13e57f82ae7d02b0f25ec1ccc5b4e41-98.jpg", "descriptions": "Fully \"armed\" with his chainsaw, trusty boomstick, and trademark quips, Ash must once again save Dearborn from the unspeakable horrors spawned from The Book of the Dead. After a vortex to the undead is unwittingly opened, deadites swarm through Dearborn, turning humans intoFully \"armed\" with his chainsaw, trusty boomstick, and trademark quips, Ash must once again save Dearborn from the unspeakable horrors spawned from The Book of the Dead. After a vortex to the undead is unwittingly opened, deadites swarm through Dearborn, turning humans into zombies. Now, with Dearborn in chaos and citizens begging for help, Ash must hack and slash his way through the streets and figure out how to close the vortex. Ash soon learns that all is not what it seems--those he trusts may be plotting against him, and the history of Dearborn might be irrevocably changed.… Expand"}, {"name": "Inside Pitch 2003", "details_link": "https://www.metacritic.com/game/xbox/inside-pitch-2003", "publisher": "Microsoft Game Studios", "release_date": "May 20 2003", "developers": ["Microsoft Game Studios"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/206a579cf006486bb9480e287433fbe0-98.jpg", "descriptions": "Inside Pitch 2003 delivers all the hard slides, bare-handed grabs, and grand slams of a Major League Baseball game. Choose your favorite team and go head-to-head against players that reflect the talent, technique, and style of their real-life counterparts. Realistic players, authenticInside Pitch 2003 delivers all the hard slides, bare-handed grabs, and grand slams of a Major League Baseball game. Choose your favorite team and go head-to-head against players that reflect the talent, technique, and style of their real-life counterparts. Realistic players, authentic stadiums, and animated scoreboards immerse you into each ballgame. With Championship Challenges, you can reproduce the most impressive feats of the past season and become the hero. And with a headset, you can talk up your game with Xbox Live's online voice communication.… Expand"}, {"name": "Jane's Attack Squadron", "details_link": "https://www.metacritic.com/game/pc/janes-attack-squadron", "publisher": "Xicat Interactive", "release_date": "Mar 22 2002", "developers": ["Mad Doc Software"], "platforms": "PC", "genres": ["Simulation", "Flight", "WWII", "Modern Jet", "Combat"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/1ce285849cc341f791de4144d326653c-98.jpg", "descriptions": "Features include: fourteen flyable aircraft, with countless other land, sea, and air vehicles. Patrol, Intercept, and Strategic Bombing, plus air strikes on a wide range of targets including warships, subs, trains, tanks, airfields, and factories; real 3D cockpits with fully functional dialsFeatures include: fourteen flyable aircraft, with countless other land, sea, and air vehicles. Patrol, Intercept, and Strategic Bombing, plus air strikes on a wide range of targets including warships, subs, trains, tanks, airfields, and factories; real 3D cockpits with fully functional dials and gauges; one million square miles of satellite accurate, mapped-terrain; fully realized damage model with parts that detach, explode, tear away, and affect flight. [Xicat Interactive]… Expand"}, {"name": "Triple Play Baseball", "details_link": "https://www.metacritic.com/game/pc/triple-play-baseball", "publisher": "EA Sports", "release_date": "Mar  4 2001", "developers": ["Treyarch"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 58, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/4c81744dc2cd88d9298ea7e457c003d5-98.jpg", "descriptions": "The game turns the single most challenging action in sports into child's play."}, {"name": "Odyssey: The Search for Ulysses", "details_link": "https://www.metacritic.com/game/pc/odyssey-the-search-for-ulysses", "publisher": "DreamCatcher Interactive", "release_date": "Jan  2 2001", "developers": ["In Utero"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 58, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/cb86bb64bef89a8d09b1c5ac67b3e93e-98.jpg", "descriptions": "In spite of its shortcomings, Odyssey remains an enjoyable game, because the story and characters are engaging enough to hold your attention until the conclusion."}, {"name": "Disney's TRON: Evolution", "details_link": "https://www.metacritic.com/game/xbox-360/disneys-tron-evolution", "publisher": "Disney Interactive Studios", "release_date": "Dec  7 2010", "developers": ["Propaganda Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 58, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/4147857b1aef3decd4d2afa1cdd0c2b6-98.jpg", "descriptions": "Set during the era between the two TRON films, TRON: Evolution conveys the story of significant events within the TRON mythology. The game features an epic adventure across a massive digital world filled with high-mobility disc-based combat and advanced light cycles. TRON: Evolution is oneSet during the era between the two TRON films, TRON: Evolution conveys the story of significant events within the TRON mythology. The game features an epic adventure across a massive digital world filled with high-mobility disc-based combat and advanced light cycles. TRON: Evolution is one of the keys to unlocking the TRON mythology. The game's story takes place before the film \"TRON: Legacy\" events and provides insight into the film's past. As an integrated entertainment experience, the film references elements of the game's story. As part of the connection between the game and film, actress Olivia Wilde stars as Quorra in TRON: Evolution. Wilde's voice and likeness as Quorra provide players with another direct link to the film as they discover how earlier events within the world of TRON shape her character’s future. [Disney Interactive Studios]… Expand"}, {"name": "Darksiders III", "details_link": "https://www.metacritic.com/game/switch/darksiders-iii", "publisher": "THQ Nordic", "release_date": "Sep 30 2021", "developers": ["Gunfire Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "genres": ["Action Adventure", "Open-World"], "meta_score": 58, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/13751ac334df019ba34519b223907a4f-98.jpg", "descriptions": "Return to an apocalyptic Earth in Darksiders III, a hack-n-slash Action Adventure where players assume the role of FURY in her quest to hunt down and dispose of the Seven Deadly Sins. The most unpredictable and enigmatic of the Four Horsemen, FURY must succeed where many have failed to bringReturn to an apocalyptic Earth in Darksiders III, a hack-n-slash Action Adventure where players assume the role of FURY in her quest to hunt down and dispose of the Seven Deadly Sins. The most unpredictable and enigmatic of the Four Horsemen, FURY must succeed where many have failed to bring balance to the forces that now ravage Earth. Darksiders III is the long-anticipated, third chapter in the critically-acclaimed Darksiders franchise.\r * Play as FURY - a mage who must rely on her whip and magic to restore the balance between good and evil on Earth!\r* Harness FURY's magic to unleash her various forms each granting her access to new weapons, moves and traversal abilities.\r* Explore an open-ended, living, free-form game world in which FURY moves back and forth between environments to uncover secrets while advancing the story.\r* Defeat the Seven Deadly Sins and their servants who range from mystical creatures to degenerated beings.\r* Sit in awe of Darksiders signature art style expansive post-apocalyptic environments that take the player from the heights of heaven to the depths of hell, dilapidated by war and decay and overrun by nature.… Expand"}, {"name": "Matchpoint: Tennis Championships", "details_link": "https://www.metacritic.com/game/playstation-5/matchpoint-tennis-championships", "publisher": "Kalypso", "release_date": "Jul  7 2022", "developers": ["Torus Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 58, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/5988465df8ca036daf916ca6dfc98e24-98.jpg", "descriptions": "The season starts now – grab your racket and become the world’s next tennis champion! Your opponent is on the court and the crowd waits for a promising challenger for the grand finale… Are you ready for Matchpoint?"}, null]