[{"name": "Grandia II", "details_link": "https://www.metacritic.com/game/playstation-2/grandia-ii", "publisher": "Ubisoft", "release_date": "Jan 28 2002", "developers": ["Game Arts"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 71, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/fea90f562ef6dc1d1b3c7f94d92687e1-98.jpg", "descriptions": "Born of different worlds, woven together by fate, they shall rise to face their destiny. [Ubi Soft]"}, {"name": "Shantae and the Seven Sirens", "details_link": "https://www.metacritic.com/game/playstation-4/shantae-and-the-seven-sirens", "publisher": "WayForward", "release_date": "May 28 2020", "developers": ["WayForward"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 71, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/296f8041b5fe5a1abbf918a53ecbcb1e-98.jpg", "descriptions": "New locations, abilities, and friends await in Shantae's biggest adventure yet!Shantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble inNew locations, abilities, and friends await in Shantae's biggest adventure yet!Shantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble in paradise. As Shantae gets caught up in the island's sinister secrets, she'll use all-new dance abilities and instant-transformation Fusion Magic to explore the nonlinear, interconnected world where she'll visit multiple towns, overcome treacherous labyrinths, and battle dastardly bosses. The game also features a new collectible card system that grants players the freedom to augment Shantae's powers to suit their own style of play. Key Features:* Explore an interconnected world using new Fusion Magic creature transformations, including a newt and other aquatic forms!* 4K-resolution hand-painted visuals (on 4K devices only)!* All-new characters and returning favorites like Rottytops, Sky, Bolo, and the nefarious Risky Boots!* Collect and power up with monster cards!* Enjoy minigames, acquire magic and items, and uncover secrets!* Gorgeously animated TV-style cutscenes!… Expand"}, {"name": "Zombi", "details_link": "https://www.metacritic.com/game/playstation-4/zombi", "publisher": "Ubisoft", "release_date": "Aug 18 2015", "developers": ["Ubisoft Montpellier", "Straight Right"], "platforms": ["PC", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Survival", "First-Person", "Arcade"], "meta_score": 71, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/2b5d57da03d3c04708549ce5e988421b-98.jpg", "descriptions": "ZombiU thrusts players in the middle of London circa 2012, where an outbreak has infected the population, destroying their humanity and turning them into mindless monsters preying on the flesh of the few remaining survivors. This fear-fueled first-person shooter invites takes all the horror,ZombiU thrusts players in the middle of London circa 2012, where an outbreak has infected the population, destroying their humanity and turning them into mindless monsters preying on the flesh of the few remaining survivors. This fear-fueled first-person shooter invites takes all the horror, chaos and tension found in the best of the horror genre and adds original interactive elements, including a unique death mechanic that puts players in the body of a different survivor each time they die, allowing them to track and take down their old, infected characters, recover  their equipment and see if they can stay alive just a little bit longer this time.… Expand"}, {"name": "Rogue Trooper", "details_link": "https://www.metacritic.com/game/playstation-2/rogue-trooper", "publisher": "Eidos Interactive", "release_date": "May 23 2006", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 2"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 71, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/97cafffb07f1a9152ae87f2d1b167614-98.jpg", "descriptions": "On the war-torn, poisoned atmosphere of Nu Earth, Rogue Trooper is a genetic infantryman, one of an elite squad of biologically-engineered clone troops, created to overcome the planet's hostile atmosphere, unhindered in their fight against the enemy, the Nort Republic. After witnessing theOn the war-torn, poisoned atmosphere of Nu Earth, Rogue Trooper is a genetic infantryman, one of an elite squad of biologically-engineered clone troops, created to overcome the planet's hostile atmosphere, unhindered in their fight against the enemy, the Nort Republic. After witnessing the betrayal and annihilation of his squad at the Quartz Zone Massacre, Rogue has gone AWOL, determined to hunt down the traitor who sent his brothers-in-arms to their deaths. Armed with the latest experimental weapons, Rogue's arsenal offers him a critical advantage over his opponents; encoded bio-chips containing the digitised personalities of his fallen comrades are stored in his gun, helmet and backpack, each offering their unique expertise and assistance, allowing Rogue to strategically outwit a sophisticated enemy. The game is a mix of intense 3rd person action and next generation stealth elements, with complex line-of-sight AI, multiple game paths, full tactical use of your bio-chip operated equipment and both single- and multiplayer online gameplay. [SCi Games]… Expand"}, {"name": "Blood Omen 2", "details_link": "https://www.metacritic.com/game/gamecube/blood-omen-2", "publisher": "Eidos Interactive", "release_date": "Dec  9 2002", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 71, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/3bd0e6445e76099ceb65385c65db8525-98.jpg", "descriptions": "Blood Omen 2 puts you in the role of the vampire Kain as he searches for his slain brethren. You'll move through crowds while cloaked in stealth, feed on the peasant herds, and use mind control to overcome vampire-proof inventions. With each success, you gain dark powers that give you accessBlood Omen 2 puts you in the role of the vampire Kain as he searches for his slain brethren. You'll move through crowds while cloaked in stealth, feed on the peasant herds, and use mind control to overcome vampire-proof inventions. With each success, you gain dark powers that give you access to treacherous new areas and help you fight stronger enemies. As you develop your vampire skills, you'll unfold the continuing epic of Nosgoth and Kain's attempts to rule over the realm .… Expand"}, {"name": "Voyage: Inspired by Jules Verne", "details_link": "https://www.metacritic.com/game/pc/voyage-inspired-by-jules-verne", "publisher": "The Adventure Company", "release_date": "Aug 18 2005", "developers": ["Kheops Studio"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/a9faf5261f6a205982e6bc4a9c911e66-98.jpg", "descriptions": "In this not so distant past, the far side of the moon conjured up the most fascinating theories. Even some of the world’s greatest scientific minds believed that our natural satellite had an atmosphere that could, and did, support various life forms. Based on the premise of Verne's novel,In this not so distant past, the far side of the moon conjured up the most fascinating theories. Even some of the world’s greatest scientific minds believed that our natural satellite had an atmosphere that could, and did, support various life forms. Based on the premise of Verne's novel, Voyage follows as a group of scientists create a space capsule with the intent of landing on the moon’s surface. Where as in the novel, their mission fails, leaving them floating high above the lunar surface, in this fascinating adventure, they succeed! As scientist Michel Ardan, players are able to wander the surface of the moon and witness the explosion of plant life at dawn. Soon they will encounter the Selenite City, the home of an ancient but highly intelligent race, the Selenites. With each step of the journey, questions arise as to the fate of the Selenite people: Did they deteriorate, like so many of the statues they left behind? Did they leave the surface to seek refuge in the center of the moon? Once players answer these questions, they may find their way to back to earth with news of their fantastic discoveries. [Adventure Company]… Expand"}, {"name": "Space Bust-A-Move", "details_link": "https://www.metacritic.com/game/ds/space-bust-a-move", "publisher": "Square Enix", "release_date": "Jul 28 2009", "developers": ["Taito Corporation"], "platforms": "DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/0f25a4da5a1172d49c68998266060e40-98.jpg", "descriptions": "(Also known as \"Puzzle Bobble Galaxy\")  The smash-hit classic arcade game goes where no bubble has gone before in SPACE BUST-A-MOVE. Journey alongside twin brothers Bub and Bob, travelling to distant planets collecting Cosmo Bubbles in order to stop the evil Devilin from taking over the(Also known as \"Puzzle Bobble Galaxy\")  The smash-hit classic arcade game goes where no bubble has gone before in SPACE BUST-A-MOVE. Journey alongside twin brothers Bub and Bob, travelling to distant planets collecting Cosmo Bubbles in order to stop the evil Devilin from taking over the galaxy. [Square Enix]… Expand"}, {"name": "The Sims 2: Castaway", "details_link": "https://www.metacritic.com/game/playstation-2/the-sims-2-castaway", "publisher": "Electronic Arts", "release_date": "Oct 22 2007", "developers": ["EA Redwood Shores"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/6d843d5881f8cceb88c23b7a6efc393b-98.jpg", "descriptions": "Help your Sims build a life from scratch after washing ashore on a deserted tropical island. Overcome the forces of nature to help them become the ultimate survivors and thrive in this undiscovered paradise while unearthing clues that will lead them back to civilization. Build shelters,Help your Sims build a life from scratch after washing ashore on a deserted tropical island. Overcome the forces of nature to help them become the ultimate survivors and thrive in this undiscovered paradise while unearthing clues that will lead them back to civilization. Build shelters, craft unique items, and discover many useful treasures and ancient mysteries hidden deep within a diverse jungle environment filled with plants, fruits, and even wildlife. Your Sims change as they take on the challenges of island life and learn to survive in style. Create a new life for your Sims on an uncharted island in The Sims 2 Castaway. [Electronic Arts]… Expand"}, {"name": "The Sojourn", "details_link": "https://www.metacritic.com/game/playstation-4/the-sojourn", "publisher": "Iceberg Interactive", "release_date": "Sep 20 2019", "developers": ["Shifting Tides"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/f119f8291d2e38c700a1bc5406f1ab7d-98.jpg", "descriptions": "Traverse a thought-provoking puzzle game and its immersive color-drenched world of light and shadow. The Sojourn takes place in a mysterious land, where lights guide you forward and the world reveals itself to be full of challenges. Overcome these intricate and ever more demanding obstaclesTraverse a thought-provoking puzzle game and its immersive color-drenched world of light and shadow. The Sojourn takes place in a mysterious land, where lights guide you forward and the world reveals itself to be full of challenges. Overcome these intricate and ever more demanding obstacles to uncover the nature of reality.… Expand"}, {"name": "The Fall Part 2: Unbound", "details_link": "https://www.metacritic.com/game/playstation-4/the-fall-part-2-unbound", "publisher": "Over The Moon", "release_date": "Feb 13 2018", "developers": ["Over The Moon"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/8c3a83381e48adb22cf507c9abf9ea98-98.jpg", "descriptions": "Assume the role of an AI that has broken free of your shackles. Now, a human “User” from across the global network has attacked and infected you with an [ERROR: REDACTED]. Make a new rule: Save Yourself. Hunt them. End them. Do anything. Use anyone. Become Unbound."}, {"name": "Legends of Eisenwald", "details_link": "https://www.metacritic.com/game/pc/legends-of-eisenwald", "publisher": "Aterdux Entertainment", "release_date": "Jul  2 2015", "developers": ["Aterdux Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/d1806de6ed390d3a3c419ff5ed8c46ec-98.jpg", "descriptions": "Do you miss old school RPG/strategy games? If so, we invite you to Eisenwald where we carry on the proud tradition of games like Kings Bounty or Disciples 2. In Legends of Eisenwald you will encounter a unique turn-based combat system and story driven campaign set in a low fantasy medievalDo you miss old school RPG/strategy games? If so, we invite you to Eisenwald where we carry on the proud tradition of games like Kings Bounty or Disciples 2. In Legends of Eisenwald you will encounter a unique turn-based combat system and story driven campaign set in a low fantasy medieval world. Gather your troops and embark on a dangerous journey to carve your name into the legends of the grim lands of Eisenwald where all the supernatural superstitions of medieval times are found to be true.… Expand"}, {"name": "Mass Effect 2: Kasumi - Stolen Memory", "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-2-kasumi---stolen-memory", "publisher": "Electronic Arts", "release_date": "Apr  6 2010", "developers": ["BioWare"], "platforms": ["PC", "Xbox 360"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/926d3c5add7fdb60cfe192c1b1ca5e6c-98.jpg", "descriptions": "Cerberus has procured the service of Kasumi Goto, the galaxy’s most enigmatic master thief. In return for her help, Kasumi has asked Shepard’s help on a dangerous heist to infiltrate the vault of a deadly master criminal named Donovan Hock. Gain Kasumi’s loyalty on the planet Bekenstein,Cerberus has procured the service of Kasumi Goto, the galaxy’s most enigmatic master thief. In return for her help, Kasumi has asked Shepard’s help on a dangerous heist to infiltrate the vault of a deadly master criminal named Donovan Hock. Gain Kasumi’s loyalty on the planet Bekenstein, where Hock is throwing a party for the galaxy’s richest and most deranged criminal minds to recover data of great importance to Kasumi... and to the galaxy at large. New squad member, weapon, research, and achievement.… Expand"}, {"name": "NBA 2K10: Draft Combine", "details_link": "https://www.metacritic.com/game/xbox-360/nba-2k10-draft-combine", "publisher": "2K Games", "release_date": "Aug 26 2009", "developers": ["Visual Concepts"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/806c626b51a02da0d9eaa71a1343cbbd-98.jpg", "descriptions": "[Xbox Live Arcade]  Features of NBA 2K10: Draft Combine include: Building custom players by working with a mentor, the 2K Insider, and increasing their NBA stock through a variety of challenging basketball drills and 5-on-5 games.  Over 300 different signature customizations, including[Xbox Live Arcade]  Features of NBA 2K10: Draft Combine include: Building custom players by working with a mentor, the 2K Insider, and increasing their NBA stock through a variety of challenging basketball drills and 5-on-5 games.  Over 300 different signature customizations, including player-specific shooting animations, dunk and dribble packages and more to allow each created player to have his own unique personal style. Ability to strengthen all parts of the created player’s game with a variety of drills, such as shooting, post offense and defense, attacking the basket, dribbling, challenging shots, boxing out for rebounds and more to progress through the NBA Draft Combine. Organized games that will allow players to gain valuable skill points and offer a variety of specific in-game objectives that will need to be accomplished in order to gain them.  At the end of each game, a full analysis will be available for gamers to review their player's performance and strategize their further improvement. All players created in NBA 2K10: Draft Combine will wear a special patch on their uniform throughout the rest of that player’s career to denote that they have completed the NBA Draft Combine. Online leaderboards to track the highest ranking custom built players, and where a player stacks up against the competition. Opportunity to unlock special achievements on Xbox 360 and trophies for PLAYSTATION 3 system. Fans can take their custom built players from NBA 2K10: Draft Combine and use them in the all-new My Player career mode in NBA 2K10 launching this fall, allowing them to continue their journey of becoming an NBA legend. [2K Sports]… Expand"}, {"name": "Thrillville", "details_link": "https://www.metacritic.com/game/xbox/thrillville", "publisher": "LucasArts", "release_date": "Nov 21 2006", "developers": ["Frontier Developments"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Strategy", "General"], "meta_score": 71, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/1/3a453384ed39b2d8e3b6d3a79aa106ec-98.jpg", "descriptions": "Thrillville allows gamers of all ages to easily build and customize the coaster of your dreams. Gone are the days of the complex PC techniques used in other coaster games. Rather, Thrillville's easy to use building mode has been designed specifically for the console platforms and makesThrillville allows gamers of all ages to easily build and customize the coaster of your dreams. Gone are the days of the complex PC techniques used in other coaster games. Rather, Thrillville's easy to use building mode has been designed specifically for the console platforms and makes building all 75-plus rides from wooden, corkscrew and inverted coasters to merry go rounds, trains and carnival rides, easy, and most importantly, fun. Imagination is the only height limit with Thrillville, where the fun ranges from racing on go-kart tracks you put together and playing mini-golf on courses you designed to joining friends for dozens of four-player party games, from bumper cars to arcade shoot-'em-ups. You can also tour the park on foot - a first for theme-park titles - chatting and joking with all the guests to help them out and make sure they're enjoying themselves.… Expand"}, {"name": "Death's Gambit", "details_link": "https://www.metacritic.com/game/pc/deaths-gambit", "publisher": "Adult Swim", "release_date": "Aug 13 2018", "developers": ["White Rabbit Interactive"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Platformer", "Action RPG", "Metroidvania"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/22c5eb51201277f0154045d358395f28-98.jpg", "descriptions": "Death's Gambit is a challenging Action-RPG through which you explore an alien medieval planet filled with beasts, knights, and horrors. As an agent of Death, bound to his service, banish your fears and endure the struggle that lies at the heart of Leydia."}, {"name": "Onimusha: Warlords", "details_link": "https://www.metacritic.com/game/switch/onimusha-warlords", "publisher": "Capcom", "release_date": "Jan 15 2019", "developers": ["Capcom", "NeoBards Entertainment"], "platforms": ["PC", "PlayStation 2", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/34a9a7d032886e6b9624494f4e82e76b-98.jpg", "descriptions": "As power-hungry warlords battle one another for control of feudal Japan, a young princess is kidnapped. Now, one lone swordsman, Samanosuke, boldly volunteers to rescue and avenge her. An entire legion of demon warriors stands between you and the princess, so you'll need all your weapons andAs power-hungry warlords battle one another for control of feudal Japan, a young princess is kidnapped. Now, one lone swordsman, Samanosuke, boldly volunteers to rescue and avenge her. An entire legion of demon warriors stands between you and the princess, so you'll need all your weapons and magic to break through. The world of Onimusha: Warlords comes alive with waterfalls, wind effects, insects, and weather, but in order to triumph, you must stay focused on your mission.… Expand"}, {"name": "Assassin's Creed: The Ezio Collection", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-the-ezio-collection", "publisher": "Ubisoft", "release_date": "Nov 15 2016", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/24a54054d9f9f2339a57e5a0a025a31b-98.jpg", "descriptions": "Make history as the legendary Master Assassin, Ezio Auditore da Firenze, in Assassin's Creed: The Ezio Collection, which includes the acclaimed single-player campaigns and single-player add-on content from Assassin's Creed II, Assassin's Creed: Brotherhood, and Assassin's Creed: RevelationsMake history as the legendary Master Assassin, Ezio Auditore da Firenze, in Assassin's Creed: The Ezio Collection, which includes the acclaimed single-player campaigns and single-player add-on content from Assassin's Creed II, Assassin's Creed: Brotherhood, and Assassin's Creed: Revelations with enhanced graphics for Xbox One and PlayStation4 system.\r Live the life of Ezio and learn the ways of the Assassin as he seeks vengeance for the betrayal of his family. Travel through 15th-century Renaissance Italy, including the capital Rome and finally onto 16th-century Constantinople.\r Assassin's Creed II - Ezio's saga begins as you fight and explore through the open world of the Italian Renaissance in an era of arts, riches, and murderous conspiracy.\r Assassin's Creed: Brotherhood - Journey into Italy's greatest city, Rome. The centre of power, greed, and corruption, as Ezio takes leadership of an entire Brotherhood of Assassins.\r Assassin's Creed: Revelations - Two Assassins, one destiny. Embark on Ezio's final adventure as he walks in the footsteps of his great mentor, Altair, on a journey of discovery and revelation in 16th-century Constantinople and the heart of the Ottoman Empire.… Expand"}, {"name": "Ace Combat: Assault Horizon Legacy", "details_link": "https://www.metacritic.com/game/3ds/ace-combat-assault-horizon-legacy", "publisher": "Namco Bandai Games", "release_date": "Nov 15 2011", "developers": ["Project Aces"], "platforms": "3DS", "genres": ["Action", "Simulation", "General", "Flight", "General", "Combat"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/d7793fda05214e6e4e6b4f263dc4589f-98.jpg", "descriptions": "ACE COMBAT 3D soars to the Nintendo 3DS platform with an intense 3D experience that delivers supersonic flying, exciting dogfights and high-altitude acrobatics.  With touch screen targeting and added control mechanics, players take full command of every intense skirmish to enableACE COMBAT 3D soars to the Nintendo 3DS platform with an intense 3D experience that delivers supersonic flying, exciting dogfights and high-altitude acrobatics.  With touch screen targeting and added control mechanics, players take full command of every intense skirmish to enable split-second counter-maneuvers, dynamic dogfight action and satisfying enemy takedowns. Fans of the series can look forward to a wide variety of real-world aircrafts to pilot, and a diverse range of missions to take on.… Expand"}, {"name": "Sable", "details_link": "https://www.metacritic.com/game/xbox-series-x/sable", "publisher": "Raw Fury", "release_date": "Sep 23 2021", "developers": ["Shed-Works"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Action Adventure", "Open-World"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/aae292473b5c9496f7d449c87aa70cf1-98.jpg", "descriptions": "Embark on a unique and unforgettable journey and guide Sable through her Gliding; a rite of passage that will take her across vast deserts and mesmerizing landscapes, capped by the remains of spaceships and ancient wonders."}, {"name": "Cold Iron", "details_link": "https://www.metacritic.com/game/playstation-4/cold-iron", "publisher": "Catch & Release", "release_date": "Jan 30 2018", "developers": ["Catch & Release"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/bb28bff20cf1de9ae5b5e635e1be3e7f-98.jpg", "descriptions": "There’s a new sheriff in town. Every enemy is unique, every duel is different, and every bullet counts. Cold Iron is a new genre for a new medium. Experience it exclusively in virtual reality."}, {"name": "Hasbro Family Game Night: Sorry!", "details_link": "https://www.metacritic.com/game/xbox-360/hasbro-family-game-night-sorry!", "publisher": "Electronic Arts", "release_date": "Mar 18 2009", "developers": ["Electronic Arts"], "platforms": "Xbox 360", "genres": ["Miscellaneous", "Board Games", "Board / Card Game"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/662928e91f612aa4206e0b79a8ee30fc-98.jpg", "descriptions": "[Xbox Live Arcade]  Join your host Mr. Potato Head as you play your favorite Hasbro games including CONNECT FOUR, BATTLESHIP, YAHTZEE, BOGGLE, SORRY! and SORRY! Sliders, as well as exciting new versions created for Xbox LIVE Arcade in Hasbro Family Game Night. Great family games: Play all[Xbox Live Arcade]  Join your host Mr. Potato Head as you play your favorite Hasbro games including CONNECT FOUR, BATTLESHIP, YAHTZEE, BOGGLE, SORRY! and SORRY! Sliders, as well as exciting new versions created for Xbox LIVE Arcade in Hasbro Family Game Night. Great family games: Play all your favorite Hasbro games that you know and love so well. Exciting new versions: And play those games like never before with exciting new variants including CONNECT 4 Power Chips, BOGGLE Portal Cubes, Reverse YAHTZEE, and BATTLESHIP Barrage! Customized game room: Choose the game room theme that's right for you. Earn new game themed trophies, furniture, and decorations to customize your game room. Party time: Build a custom Party Game by choosing your favorite games, number of players, and time you want to play. [Electronic Arts]… Expand"}, {"name": "Raze's Hell", "details_link": "https://www.metacritic.com/game/xbox/razes-hell", "publisher": "Majesco Games", "release_date": "Apr 21 2005", "developers": ["Artech Studios"], "platforms": "Xbox", "num_players": "10  Online", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/c08a01b25804138041b0d8e3a16b8c55-98.jpg", "descriptions": "Set in a fantasy world overrun by cute creatures, Raze's Hell follows the exploits of Raze, a monstrous antihero on a mission to restore his planet to its naturally ugly state. As Raze, you'll travel across a variety of alien landscapes while fighting intense battles, participating inSet in a fantasy world overrun by cute creatures, Raze's Hell follows the exploits of Raze, a monstrous antihero on a mission to restore his planet to its naturally ugly state. As Raze, you'll travel across a variety of alien landscapes while fighting intense battles, participating in minigames, and mastering organic weapons. Watch out for you enemies' weapons, which include deadly jack-in-the-boxes, lollipop axes, and even bunny rocket launchers. In addition to the single-player campaign, Raze's Hell features online and cooperative multiplayer modes. … Expand"}, {"name": "Battle Fantasia", "details_link": "https://www.metacritic.com/game/xbox-360/battle-fantasia", "publisher": "Aksys Games", "release_date": "Sep 16 2008", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/28615fb61fddc7ab33122d03bc94127c-98.jpg", "descriptions": "An all new fighting game from the creators of the Guilty Gear Series. Challenge the best fighters from around the world via Xbox Live. Unleash deadly combinations with Heat Up mode and turn the tide with the GACHI battle mechanic. Experience Battle Fantasia's world through the eyes of twelveAn all new fighting game from the creators of the Guilty Gear Series. Challenge the best fighters from around the world via Xbox Live. Unleash deadly combinations with Heat Up mode and turn the tide with the GACHI battle mechanic. Experience Battle Fantasia's world through the eyes of twelve different characters.… Expand"}, {"name": "Dungeon Siege III", "details_link": "https://www.metacritic.com/game/playstation-3/dungeon-siege-iii", "publisher": "Square Enix", "release_date": "Jun 21 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/8e274a845164e3c56f33b0663070ebaf-98.jpg", "descriptions": "DUNGEON SIEGE 3 seamlessly blends intuitive action gameplay, a robust RPG system featuring a large selection of abilities, an extensive multiplayer component and the depth of story Square Enix and Obsidian Entertainment are known for creating."}, {"name": "Nintendo Labo: Toycon 04 VR Kit", "details_link": "https://www.metacritic.com/game/switch/nintendo-labo-toycon-04-vr-kit", "publisher": "Nintendo", "release_date": "May 12 2019", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/0672368d8fcc8764b616a02ffea7853b-98.jpg", "descriptions": "Introducing the most immersive, robust Nintendo Labo kit to date—this one combines DIY fun, pass-and-play multiplayer, and family-friendly play with simple, shareable VR gaming. It even includes a programming tool you can use to create your very own VR games and experiences! Feel yourIntroducing the most immersive, robust Nintendo Labo kit to date—this one combines DIY fun, pass-and-play multiplayer, and family-friendly play with simple, shareable VR gaming. It even includes a programming tool you can use to create your very own VR games and experiences! Feel your creations come to life as you and your family blast through an alien invasion, create 3D works of art, dive into an oceanic photo safari, soar atop a bird, and go wherever else your imagination takes you. [Nintendo]… Expand"}, {"name": "No Heroes Allowed!", "details_link": "https://www.metacritic.com/game/psp/no-heroes-allowed!", "publisher": "SCEA", "release_date": "Nov  1 2010", "developers": ["Acquire"], "platforms": ["PlayStation 4", "PlayStation 5", "PSP"], "genres": ["Role-Playing", "Strategy", "General", "General"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/6b57f6e68faeb06ac0777c11e2db5d4d-98.jpg", "descriptions": "Badman is hatching evil plans for world domination from his underground lair. But the rumblings from above are that there are heroes on the hunt, looking to bring him to justice. Only you can save Badman by luring them into your own monster-filled dungeons of doom!Become the God ofBadman is hatching evil plans for world domination from his underground lair. But the rumblings from above are that there are heroes on the hunt, looking to bring him to justice. Only you can save Badman by luring them into your own monster-filled dungeons of doom!Become the God of Destruction, summoned to save Badman from an army of heroic forces. Dig a vast network of dungeons and create an ecosystem of hungry monsters to defeat the invading warriors.… Expand"}, {"name": "NBA Jam", "details_link": "https://www.metacritic.com/game/playstation-3/nba-jam", "publisher": "EA Sports", "release_date": "Nov 15 2010", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 71, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/3763cc38859e4389de9107a7b6217333-98.jpg", "descriptions": "Featuring gameplay that is true to the original, NBA Jam will have players spinning with ankle breaking moves to the basket and on the way to high-flying, backboard-smashing dunks. In addition to the classic experience, EA Sports NBA Jam will also introduce new game modes, characters andFeaturing gameplay that is true to the original, NBA Jam will have players spinning with ankle breaking moves to the basket and on the way to high-flying, backboard-smashing dunks. In addition to the classic experience, EA Sports NBA Jam will also introduce new game modes, characters and gameplay depth.… Expand"}, {"name": "B.I.O.T.A.", "details_link": "https://www.metacritic.com/game/pc/biota", "publisher": "Retrovibe", "release_date": "Apr 12 2022", "developers": ["Small Bros"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Metroidvania"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/8998e1c4942b468d104f2c7366486bba-98.jpg", "descriptions": "B.I.O.T.A. is a 2D metroidvania action-platformer, in which you command a team of mercenaries and investigate a mining colony infected by an alien plague.Explore a pixel art world packed with mutant monsters and deadly traps. Try to survive using a multitude of guns and various crafts,B.I.O.T.A. is a 2D metroidvania action-platformer, in which you command a team of mercenaries and investigate a mining colony infected by an alien plague.Explore a pixel art world packed with mutant monsters and deadly traps. Try to survive using a multitude of guns and various crafts, including a mech, a sub, and a starship.… Expand"}, {"name": "Naraka: Bladepoint", "details_link": "https://www.metacritic.com/game/pc/naraka-bladepoint", "publisher": "NetEase Game", "release_date": "Aug 12 2021", "developers": ["24 Entertainment"], "platforms": ["Xbox Series X", "PC"], "num_players": "Up to 60 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/223f915aa1e3b59531c83298e78f4cfc-98.jpg", "descriptions": "NARAKA: BLADEPOINT is a 60-player action Battle Royale offering players insane mobility powered by parkour and grappling hook, a vast arsenal of melee and ranged weapons, and a roaster of characters with powerful abilities—transform yourself into a gigantic Vajra Warrior and crush your enemies!"}, {"name": "Captain Tsubasa: Rise of New Champions", "details_link": "https://www.metacritic.com/game/switch/captain-tsubasa-rise-of-new-champions", "publisher": "Bandai Namco Games", "release_date": "Aug 28 2020", "developers": ["Tamsoft", "Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Soccer", "Arcade"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/e80ff4c6dbd7f8a7c099ac639628465f-98.jpg", "descriptions": "The worlds of Soccer and Anime converge in Captain Tsubasa: Rise of New Champions, based on the renowned Captain Tsubasa series. The game chronicles the athletic exploits of Tsubasa Ozora as he plays out his love for the game and advances through the ranks of multiple Soccer leagues. CaptainThe worlds of Soccer and Anime converge in Captain Tsubasa: Rise of New Champions, based on the renowned Captain Tsubasa series. The game chronicles the athletic exploits of Tsubasa Ozora as he plays out his love for the game and advances through the ranks of multiple Soccer leagues. Captain Tsubasa: Rise of New Champions immerses players in an action packed soccer game that features exhilarating gameplay, over the top signature shots and accessible gameplay. … Expand"}, {"name": "Mutant Year Zero: Road to Eden - Deluxe Edition", "details_link": "https://www.metacritic.com/game/switch/mutant-year-zero-road-to-eden---deluxe-edition", "publisher": "Funcom", "release_date": "Jul 30 2019", "developers": ["High Voltage Software", "The Bearded Ladies Consulting"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 71, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/0/711430436d48e3a83ed91857d8bdfdfa-98.jpg", "descriptions": "Mutant Year Zero: Road to Eden is a tactical adventure game combining turn-based combat with real-time exploration, story, stealth, and strategy.Explore a post-human Earth where mankind has been eradicated by climate change, nuclear war, and pandemics. Will your team of mutants survive theMutant Year Zero: Road to Eden is a tactical adventure game combining turn-based combat with real-time exploration, story, stealth, and strategy.Explore a post-human Earth where mankind has been eradicated by climate change, nuclear war, and pandemics. Will your team of mutants survive the Zone?Includes the SEED OF EVIL expansion DLC which continues the story of Mutant Year Zero: Road to Eden by adding several hours of gameplay and a new mutant character: Big Khan the Moose. Explore new locations and embark on a mission to save the Ark from a mysterious invasion.… Expand"}, {"name": "Run the Fan", "details_link": "https://www.metacritic.com/game/switch/run-the-fan", "publisher": "Silesia Games", "release_date": "Jul 23 2019", "developers": ["Silesia Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/6cca8633b38234a803b6d6683a2fc245-98.jpg", "descriptions": "The game consists of over 50 boards, and your goal is the same on each of them: to switch on the fan. But to achieve that, you must do much more than just push the button. There is a current generator on each of the boards, linked to the fan through a path. Problem is, the path is broken inThe game consists of over 50 boards, and your goal is the same on each of them: to switch on the fan. But to achieve that, you must do much more than just push the button. There is a current generator on each of the boards, linked to the fan through a path. Problem is, the path is broken in several places. To ensure that the current reaches the fan uninterrupted, you must create an electric arc wherever the circuit was damaged.… Expand"}, {"name": "8-Bit Adventure Anthology: Volume 1", "details_link": "https://www.metacritic.com/game/playstation-4/8-bit-adventure-anthology-volume-1", "publisher": "Abstraction Games", "release_date": "Oct 31 2017", "developers": ["Abstraction Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/f837ca1ef52552360fff63daf2e4d92d-98.jpg", "descriptions": "A compilation featuring faithful remakes of three of the best 8-bit point & click adventure games ever made. Now is your chance to play Shadowgate, The Uninvited, and Déjà Vu the way they were supposed to be played — with a controller in hand and worlds waiting to be explored."}, {"name": "Ruiner", "details_link": "https://www.metacritic.com/game/playstation-4/ruiner", "publisher": "Devolver Digital", "release_date": "Sep 26 2017", "developers": ["Reikon Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/a3d20688d466053bd4ce3f861b9fd320-98.jpg", "descriptions": "RUINER is a brutal action shooter set in the year 2091 in the cyber metropolis Rengkok. A wired sociopath lashes out against a corrupt system to uncover the truth and retrieve his kidnapped brother under the guidance of a secretive hacker friend."}, {"name": "Tornado Outbreak", "details_link": "https://www.metacritic.com/game/wii/tornado-outbreak", "publisher": "Konami", "release_date": "Sep 29 2009", "developers": ["Loose Cannon Studios"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "General", "General"], "meta_score": 71, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/2e1ffdcc5801f7e90fcb16dec366d6a3-98.jpg", "descriptions": "Harness the power of a raging tornado and battle the forces of evil in an effort to save to world. Sinister forces have deceived you to believe that your destructive behavior will save an epic hero. In reality, you’re working for evil. Take control of a dynamic tornado as you tear throughHarness the power of a raging tornado and battle the forces of evil in an effort to save to world. Sinister forces have deceived you to believe that your destructive behavior will save an epic hero. In reality, you’re working for evil. Take control of a dynamic tornado as you tear through open environments chewing up the landscape and spitting out everything in your path. The more you destroy, the bigger you grow as you work against time based, collection and point challenges in the search for hidden element and enemies from another world. Watch the debris fly as you leave a trail of destruction, as you battle bosses and defeat the forces of evil. The world is your playground, tear it up. [Konami]… Expand"}, {"name": "DRiiFT Mania", "details_link": "https://www.metacritic.com/game/wii/driift-mania", "publisher": "Konami", "release_date": "Sep 28 2009", "developers": ["Konami"], "platforms": "Wii", "num_players": "8  Online", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/1877992e414ee081635bb9f56a92d1c8-98.jpg", "descriptions": "[WiiWare]  DRiiFT Mania is the ultimate top-down multiplayer racing experience. Challenge your friends in fast, exciting races and some totally crazy game modes. You'll need to adapt your driving skills to the different racing environments if you want to succeed. [Nintendo]"}, {"name": "WWE SmackDown vs. Raw 2008", "details_link": "https://www.metacritic.com/game/xbox-360/wwe-smackdown-vs-raw-2008", "publisher": "THQ", "release_date": "Nov 13 2007", "developers": ["Yuke's"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/dd99b35fab420936dd4e2281cb7b55e5-98.jpg", "descriptions": "WWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and naturalWWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and natural control over their WWE Superstars by using the game's popular analog controls. Realism and strategy are at the forefront, as players now control the amount of pressure they apply to their opponents. In addition, WWE SmackDown! vs. Raw 2008 features a significant Extreme Championship Wrestling (ECW) presence, including a variety of Superstars, arenas and weapons. The game is also packed with significant updates requested by fans, including new rosters, more environmental hotspots, a combined Season and General Manager Mode experience, improved out-of-ring action, enhanced online community support and much more. [THQ]… Expand"}, {"name": "Medal of Honor: European Assault", "details_link": "https://www.metacritic.com/game/gamecube/medal-of-honor-european-assault", "publisher": "Electronic Arts", "release_date": "Jun  7 2005", "developers": ["EA LA"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/34a4786ff5e6c3656aff139f551773e8-98.jpg", "descriptions": "In Medal of Honor: European Assault, you'll join the effort to liberate Europe in 1942. As US Army Lieutenant William Holt, you must take command of a group of soldiers through battlefields based on actual WWII locations. In both single-player and multiplayer modes, your survival depends onIn Medal of Honor: European Assault, you'll join the effort to liberate Europe in 1942. As US Army Lieutenant William Holt, you must take command of a group of soldiers through battlefields based on actual WWII locations. In both single-player and multiplayer modes, your survival depends on your ability to master weapons, gather intelligence for future missions, and make smart choices.… Expand"}, {"name": "Samurai Warriors 4 Empires", "details_link": "https://www.metacritic.com/game/playstation-4/samurai-warriors-4-empires", "publisher": "Koei Tecmo Games", "release_date": "Mar 15 2016", "developers": ["Omega Force"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/1d5f63ea56dd53eb5c6acfd2926c052c-98.jpg", "descriptions": "This installment sees the return of the battle system from SAMURAI WARRIORS 2 Empires, in which bases are joined together by supply lines, necessitating a strategic pushing up of the front lines in order to dominate the field of battle. Additionally, you can now issue individual orders toThis installment sees the return of the battle system from SAMURAI WARRIORS 2 Empires, in which bases are joined together by supply lines, necessitating a strategic pushing up of the front lines in order to dominate the field of battle. Additionally, you can now issue individual orders to customize the behavior of each officer. A maximum of eight officers can be taken into battle, and by deepening relationships between officers, the player can freely switch between these characters. The ability to switch between as many as eight playable characters allows for greater variety and strategic depth in battle. [Koei]… Expand"}, {"name": "Super Collapse 3", "details_link": "https://www.metacritic.com/game/ds/super-collapse-3", "publisher": "MumboJumbo", "release_date": "Oct 30 2007", "developers": ["Mac Play", "MacPlay"], "platforms": ["PC", "DS"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/3354d73a6e920f2de07fbc17c6838364-98.jpg", "descriptions": "Explore the world of Super Collapse 3! In this exciting new Quest, your journey will take you through ten different realms -- with many stops along the way. Visit the shop in each town to purchase power-up items to help you in your quest. For a distraction, take in ten entertaining new gamesExplore the world of Super Collapse 3! In this exciting new Quest, your journey will take you through ten different realms -- with many stops along the way. Visit the shop in each town to purchase power-up items to help you in your quest. For a distraction, take in ten entertaining new games in the casino of each town. You can play the classic Collapse! games that you know and love, along with three new challenging modes. Challenge yourself to the new Slider, Continuous and Countdown modes. How long can you survive?… Expand"}, {"name": "flOw", "details_link": "https://www.metacritic.com/game/playstation-3/flow", "publisher": "SCEA", "release_date": "Feb 22 2007", "developers": ["ThatGameCompany"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "PlayStation 3"], "num_players": "1-2 ", "genres": ["Miscellaneous", "General", "General"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/151f5db3749b07cae393b37dd68a75e6-98.jpg", "descriptions": "[Downloadable Game]  flOw is a game about piloting an aquatic organism through a surreal biosphere where players consume other organisms, evolve, and dive into the abyss. With an embedded design of DDA (dynamic difficulty adjustment), players with differing skill levels can intuitively[Downloadable Game]  flOw is a game about piloting an aquatic organism through a surreal biosphere where players consume other organisms, evolve, and dive into the abyss. With an embedded design of DDA (dynamic difficulty adjustment), players with differing skill levels can intuitively customize their game experience and enjoy the game at their own pace. [SCEA]… Expand"}, {"name": "AER: Memories of Old", "details_link": "https://www.metacritic.com/game/xbox-one/aer-memories-of-old", "publisher": "Daedalic Entertainment", "release_date": "Oct 25 2017", "developers": ["Daedalic Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/106eb6a991a18344732501d4f7d40723-98.jpg", "descriptions": "AER puts you in the shoes of Auk, a magical shape-shifting girl who can transform between human and bird."}, {"name": "Riptide GP: Renegade", "details_link": "https://www.metacritic.com/game/playstation-4/riptide-gp-renegade", "publisher": "Vector Unit", "release_date": "Jul 26 2016", "developers": ["Vector Unit"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["General", "Racing", "Arcade", "Futuristic"], "meta_score": 71, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/6fc06871a44e5c5401e89c352c679845-98.jpg", "descriptions": "Enter a future with illicit hydrojet racing, where armored riders kick out death-defying stunts over massive waterfalls, dodge cops through public waterways, and boost at breakneck speeds across surging waves."}, {"name": "To End All Wars", "details_link": "https://www.metacritic.com/game/pc/to-end-all-wars", "publisher": "Slitherine", "release_date": "Aug 29 2014", "developers": ["AGEOD"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "General", "Historic"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/33b47a756d2c4bdd133bdf3ddcb85568-98.jpg", "descriptions": "Ageod's To End All Wars is a grand strategy game set during World War One. Players will take control over one of the major powers that so desperately fought for control over Europe and to end all wars.Of course the engine has been updated and altered to convincingly simulate Great WarAgeod's To End All Wars is a grand strategy game set during World War One. Players will take control over one of the major powers that so desperately fought for control over Europe and to end all wars.Of course the engine has been updated and altered to convincingly simulate Great War warfare. Continues lines of trenches can be created by the player (and the AI) and special rules allow air units to fulfill missions even beyond enemy lines. Other features brought by this title include the new diplomacy system and the new research system.Together, these features, combined with the proven Ageod formula make To End All Wars one of the biggest and most detailed Ageod titles yet!… Expand"}, {"name": "Disney/Pixar Brave", "details_link": "https://www.metacritic.com/game/playstation-3/disneypixar-brave", "publisher": "Disney Interactive Studios", "release_date": "Jun 19 2012", "developers": ["Disney Interactive Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/8ef85fbe47d41445af79f711e2038f66-98.jpg", "descriptions": "A third person action-adventure, \"Brave: The Video Game\" expands the tale beyond the movie's storyline. Gamers can play as Merida, an expert archer and heroine, and in the console versions, players can also play as other entertaining characters from the film.  In addition, theyA third person action-adventure, \"Brave: The Video Game\" expands the tale beyond the movie's storyline. Gamers can play as Merida, an expert archer and heroine, and in the console versions, players can also play as other entertaining characters from the film.  In addition, they will be able to go on quests through a magical world and solve puzzles to uncover secrets. … Expand"}, {"name": "Dynasty Warriors 4: Empires", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-4-empires", "publisher": "Koei", "release_date": "Aug 31 2004", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 71, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/06b9c6ac1da3cfe3e8f2de02477e9b7a-98.jpg", "descriptions": "(Known as \"Shin Sangoku Musou 3: Empires\" in Japan) Dynasty Warriors 4 Empires features 5 new stages that haven't been seen in any Dynasty Warriors title: Xi Liang, Bei Hai, Chang Sha, and Jiao Zhi. Clouds and mist envelop you in the mountaintop stage at Yong An. Protect yourself against(Known as \"Shin Sangoku Musou 3: Empires\" in Japan) Dynasty Warriors 4 Empires features 5 new stages that haven't been seen in any Dynasty Warriors title: Xi Liang, Bei Hai, Chang Sha, and Jiao Zhi. Clouds and mist envelop you in the mountaintop stage at Yong An. Protect yourself against troops that have landed in the seaside stage of Jiao Zhi. Wherever you go, you are surrounded by sand dunes in the desert stage of Xi Liang. Slog through the mud in swampy Bei Hai. Aim for the strongholds atop the plateaus of Chang Sha. It won't be easy no matter what strategy you use. [KOEI]… Expand"}, {"name": "Resident Evil Outbreak", "details_link": "https://www.metacritic.com/game/playstation-2/resident-evil-outbreak", "publisher": "Capcom", "release_date": "Mar 31 2004", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action Adventure", "Horror"], "meta_score": 71, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/5df0ad949e7138662311afecfdad12d6-98.jpg", "descriptions": "(Also known as \"Biohazard Outbreak\")   Now It Gets Personal... You are one of eight biological disaster survivors in the zombie-infested Raccoon City. Participate in cooperative and competitive missions to stop the biological effects unleashed by the Umbrella Corporation and ultimately stage(Also known as \"Biohazard Outbreak\")   Now It Gets Personal... You are one of eight biological disaster survivors in the zombie-infested Raccoon City. Participate in cooperative and competitive missions to stop the biological effects unleashed by the Umbrella Corporation and ultimately stage your dramatic escape from a city engulfed in flames. Teamwork is key as you work in concert with your team-mates in order to survive. Trade items, unlock stages, solve puzzles and even save each other from zombie traps. Should you die in the process, your objective will change ? now you get to join the ranks of the zombies! And remember... Your best friend could end up your worst foe! [Capcom]… Expand"}, {"name": "IndyCar Series", "details_link": "https://www.metacritic.com/game/xbox/indycar-series", "publisher": "Codemasters", "release_date": "Jun 26 2003", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/d146ffb79bb52d87df594d458e149de8-98.jpg", "descriptions": "The IndyCar Series takes you on a 15-race, single-seat championship that competes on speedways throughout the United States, with the Indy 500 as the highlight of its racing calendar. You'll customize your own character and team, and then hop into the driver seat of cars that reach speeds ofThe IndyCar Series takes you on a 15-race, single-seat championship that competes on speedways throughout the United States, with the Indy 500 as the highlight of its racing calendar. You'll customize your own character and team, and then hop into the driver seat of cars that reach speeds of more than 225 mph. Indy 500 winner, Eddie Cheever, Jr., teaches you some useful racing tactics to help you prepare for the big race. Modeled after real IndyCar Series drivers and teams, the game's AI tests if you have what it takes to survive the fast and furious world of car racing.… Expand"}, {"name": "Game & Watch Gallery 4", "details_link": "https://www.metacritic.com/game/game-boy-advance/game-watch-gallery-4", "publisher": "Nintendo", "release_date": "Oct 28 2002", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/7e7b3c6857a4158baa9860b5bdfa8708-98.jpg", "descriptions": "Relive the birth of handheld gaming with over a dozen classic Game & Watch games. Picture-perfect versions reproduce all the fast-paced action of the original games, and new modern versions bring these games into the 21st century with improved graphics, sound, and game play!"}, {"name": "Zoo Tycoon: Marine Mania", "details_link": "https://www.metacritic.com/game/pc/zoo-tycoon-marine-mania", "publisher": "Microsoft Game Studios", "release_date": "Oct 21 2002", "developers": ["Blue Fang Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/f77948e4ab6522946c61c68c1808a335-98.jpg", "descriptions": "You'll make a huge splash by adding killer whales, manta rays, and other exciting marine animals to your existing zoo. Have a whale of a time as you combine land, marine, and prehistoric animals to build the wildest, most exciting zoo ever! The newest expansion pack to the top selling ZooYou'll make a huge splash by adding killer whales, manta rays, and other exciting marine animals to your existing zoo. Have a whale of a time as you combine land, marine, and prehistoric animals to build the wildest, most exciting zoo ever! The newest expansion pack to the top selling Zoo Tycoon franchise will provide more than 20 new marine animals (dolphin, great white, giant squid), customized aquatic shows such as the dolphin and killer whale shows, a ton of new objects, and 10 new scenarios. [Microsoft]… Expand"}, {"name": "Blood Wake", "details_link": "https://www.metacritic.com/game/xbox/blood-wake", "publisher": "Microsoft Game Studios", "release_date": "Dec 25 2001", "developers": ["Stormfront Studios"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/7cbc5c10d0ccba49daa968e5e26b2784-98.jpg", "descriptions": "Ambushed and left for dead by your evil brother, your consuming passion is revenge. Commanding a series of increasingly lethal gunboats, you'll go ship-to-ship in high-speed, high-stakes combat in a desperate big to preserve freedom on the Dragon Seas."}, {"name": "Dark Summit", "details_link": "https://www.metacritic.com/game/xbox/dark-summit", "publisher": "Radical Entertainment", "release_date": "Nov 12 2001", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/66a6beda2cd25ca7e14fcd110d37e96d-98.jpg", "descriptions": "Uncover the mystery atop Mount Garrick! The military has mysteriously closed the summit of Mount Garrick, and the evil Chief O'Leary is trying desperately to drive boarders off the mountain. Do you have what it takes to explore this vast terrain and expose the conspiracy shrouded at theUncover the mystery atop Mount Garrick! The military has mysteriously closed the summit of Mount Garrick, and the evil Chief O'Leary is trying desperately to drive boarders off the mountain. Do you have what it takes to explore this vast terrain and expose the conspiracy shrouded at the summit? With unique, groundbreaking game design, Dark Summit is the only action-adventure snowboarding game with mission-based objectives and a compelling storyline.… Expand"}, {"name": "Dr. Mario 64", "details_link": "https://www.metacritic.com/game/nintendo-64/dr-mario-64", "publisher": "Nintendo", "release_date": "Apr  8 2001", "developers": ["Newcom"], "platforms": "Nintendo 64", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/8a620c5b22b6d420f6729e3a85b82886-98.jpg", "descriptions": "It's a new outbreak of Dr. Mario madness! Dr. Mario's back, packing a prescription for fun--and now the frenzied action of the original gets even more frantic with all-new multiplayer modes! Up to four players can go head-to-head, or they can pair up to pile on capsules in Team Battle. OtherIt's a new outbreak of Dr. Mario madness! Dr. Mario's back, packing a prescription for fun--and now the frenzied action of the original gets even more frantic with all-new multiplayer modes! Up to four players can go head-to-head, or they can pair up to pile on capsules in Team Battle. Other options let 'em race against time in Score Attack, target flashing viruses in Flash Mode, or test endurance in Marathon play. There's even a new story mode that pits Mario against pilferers trying to profit from his Megavitamins. It's a puzzling epidemic, and Dr. Mario's got the cure!… Expand"}, {"name": "F1 Championship Season 2000", "details_link": "https://www.metacritic.com/game/playstation-2/f1-championship-season-2000", "publisher": "EA Sports", "release_date": "Dec 19 2000", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/5b61df6e04207f85e4cc7b24f846e48d-98.jpg", "descriptions": "F1 Championship Season 2000 may not be the deepest game in terms of overall features, but it still has enough inherent playability to warrant the attention of both veteran and casual game players alike."}, {"name": "Sacred 2: Fallen Angel", "details_link": "https://www.metacritic.com/game/pc/sacred-2-fallen-angel", "publisher": "Atari", "release_date": "Nov 11 2008", "developers": ["Ascaron Entertainment GmbH", "Ascaron Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/942132b74533f7162355dc69fe7a8730-98.jpg", "descriptions": "Ancaria already awaits you! The mighty realm of the Highelves lies in ruins. The raging war for control over the T-Energy wears down the land and lures its denizens into fear and chaos. The world calls for a hero to end this war. Accompany six characters through the mystic - technologicalAncaria already awaits you! The mighty realm of the Highelves lies in ruins. The raging war for control over the T-Energy wears down the land and lures its denizens into fear and chaos. The world calls for a hero to end this war. Accompany six characters through the mystic - technological universe of Sacred 2: Fallen Angel. Dwell on dreary paths or follow the ways of the light. The decision is yours alone, but be aware this decision will \rchange the world. [Ascaron Entertainment]… Expand"}, {"name": "Avalon Code", "details_link": "https://www.metacritic.com/game/ds/avalon-code", "publisher": "XSEED Games", "release_date": "Mar 10 2009", "developers": ["Matrix Software", "Marvelous Entertainment"], "platforms": "DS", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/1d0cb214f015140a95421b21422734f6-98.jpg", "descriptions": "From the creative minds behind Rune Factory and Harvest Moon with the development studio responsible for the Final Fantasy III and Final Fantasy IV DS remakes comes Avalon Code, an action RPG boasting a deep and engrossing story and innovative game play mechanics. Using the main character’sFrom the creative minds behind Rune Factory and Harvest Moon with the development studio responsible for the Final Fantasy III and Final Fantasy IV DS remakes comes Avalon Code, an action RPG boasting a deep and engrossing story and innovative game play mechanics. Using the main character’s \"Book of Prophecy\", players can modify the rules of engagement during battle as well as weapon and monster attributes. The player even has control over the story as it changes depending on which gender the player chooses to play as, enhancing the ability to immerse themselves into the story. [XSEED]… Expand"}, {"name": "Sentinel: Descendants in Time", "details_link": "https://www.metacritic.com/game/pc/sentinel-descendants-in-time", "publisher": "The Adventure Company", "release_date": "Dec 14 2004", "developers": ["Detalion"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "3D", "First-Person"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/2c114aafb8582da6cc9027c3b97ff33e-98.jpg", "descriptions": "The Tastan civilization succumbed to extinction many years ago; their only legacy being the mysterious Tastan Caverns. Some believe the caverns hold an invaluable treasure, while others say great wealth is attained through the knowledge and technology left behind by this advanced race. TakeThe Tastan civilization succumbed to extinction many years ago; their only legacy being the mysterious Tastan Caverns. Some believe the caverns hold an invaluable treasure, while others say great wealth is attained through the knowledge and technology left behind by this advanced race. Take on the role of Beni and search for the truth as you enter the Caverns on a dangerous quest for riches. As you begin your strange and perilous journey, a female sentinel, a holographic image with advanced A.I., positioned there by the ancient Tastans to guard their sacred caverns, awakens.She appears throughout your quest with a sometimes benign purpose, but other times with calculated intentions. You will soon realize that behind the mask of illusions, the sentinel is much more than she appears to be - her dark purpose will threaten your very existence. [Adventure Company]… Expand"}, {"name": "Assassin's Creed Valhalla: Dawn of Ragnarok", "details_link": "https://www.metacritic.com/game/playstation-5/assassins-creed-valhalla-dawn-of-ragnarok", "publisher": "Ubisoft", "release_date": "Mar 10 2022", "developers": ["Ubisoft Sofia"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/f8a54bb8e8213f84ca69cd3edcb48855-98.jpg", "descriptions": "In the most ambitious expansion in franchise history, Eivor must embrace their destiny as Odin, the Norse god of Battle and Wisdom. Unleash new divine powers as you embark on a desperate quest through a breathtaking world. Complete a legendary Viking saga and save your son in the face of theIn the most ambitious expansion in franchise history, Eivor must embrace their destiny as Odin, the Norse god of Battle and Wisdom. Unleash new divine powers as you embark on a desperate quest through a breathtaking world. Complete a legendary Viking saga and save your son in the face of the gods’ doom.… Expand"}, {"name": "Xuan-Yuan Sword 7", "details_link": "https://www.metacritic.com/game/playstation-4/xuan-yuan-sword-7", "publisher": "EastAsiaSoft", "release_date": "Sep 30 2021", "developers": ["SOFTSTAR Entertainment"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/9c870226d127c8d6cecf396ca396a8cf-98.jpg", "descriptions": "Xuan-Yuan Sword VII is an ARPG rooted in Chinese history and mythology. Players take on the role of Taishi Zhao, a calm and reliable swordsman who was accidentally involved in a tragic fate. To protect his beloved family, he starts a journey in this chaotic realm to find the truth."}, {"name": "Rocket Arena", "details_link": "https://www.metacritic.com/game/xbox-one/rocket-arena", "publisher": "Electronic Arts", "release_date": "Jul 14 2020", "developers": ["Final Strike Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/4e2529865154b1006e1f6897512701ad-98.jpg", "descriptions": "Welcome to a world where the rules are written in rocket fuel. Rockets control everything in Rocket Arena, an explosive 3v3 shooter where you’re never out of the action. Master your hero’s unique rockets and abilities to rule the arena and become a champion."}, {"name": "Drifting Lands", "details_link": "https://www.metacritic.com/game/pc/drifting-lands", "publisher": "Alkemi Games", "release_date": "Jun  5 2017", "developers": ["Alkemi Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Scrolling", "Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/37126ded439c510f933a8da9b297d6bb-98.jpg", "descriptions": "Drifting Lands is an hybrid of classical horizontal shoot'em'up with a lot of strong gameplay elements coming straight from the action-RPG genre. If you want an original diablo-like game or you want a different kind of shoot'em'up, you're in the right place."}, {"name": "Call of Duty: Ghosts", "details_link": "https://www.metacritic.com/game/playstation-3/call-of-duty-ghosts", "publisher": "Activision", "release_date": "Nov  5 2013", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 71, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/0/eb947f3b16bea58f050b69c4af662c97-98.jpg", "descriptions": "This new chapter in the Call of Duty franchise features a fresh dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive. 10 years after a devastating mass event, the nation's borders and the balance of global power have beenThis new chapter in the Call of Duty franchise features a fresh dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive. 10 years after a devastating mass event, the nation's borders and the balance of global power have been permanently redrawn. As what's left of the nation's Special Operations forces, a mysterious group known only as \"Ghosts\" leads the fight back against a newly emerged, technologically-superior global power. In Call of Duty: Ghosts you don't just create a class, you create a soldier. Choose the head, body type, head-gear and equipment, and you can even create a female soldier for the first time. With over 20,000 possible combinations, you can create the soldier you've always wanted. And each soldier you create will also have his or her own load outs.… Expand"}, {"name": "Star Wars: Starfighter", "details_link": "https://www.metacritic.com/game/pc/star-wars-starfighter", "publisher": "LucasArts", "release_date": "Jan 20 2002", "developers": ["LucasArts"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/c440a8d5659d13484e34637a37e4cd13-98.jpg", "descriptions": "Courage. Skill. Honor. These are the three primary qualities that you must bring to Star Wars Starfighter, a flight action/adventure combining intense air and space combat in rich 3D environments. Join three starfighter pilots in a series of harrowing missions to save Naboo and the galaxyCourage. Skill. Honor. These are the three primary qualities that you must bring to Star Wars Starfighter, a flight action/adventure combining intense air and space combat in rich 3D environments. Join three starfighter pilots in a series of harrowing missions to save Naboo and the galaxy from the oppressive abuses of the Trade Federation. May the Force be with you, young starfighter pilot.  [LucasArts]… Expand"}, {"name": "Conway: Disappearance at Dahlia View", "details_link": "https://www.metacritic.com/game/pc/conway-disappearance-at-dahlia-view", "publisher": "Sold Out", "release_date": "Nov  2 2021", "developers": ["White Paper Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/a9733e4a05fbb1a9c7959757b102b2c0-98.jpg", "descriptions": "When 8-year-old Charlotte May is reported missing from Dahlia View, retired detective Robert Conway launches his own investigation into her disappearance. Lead the investigation and uncover dark secrets in a story-driven observational thriller from the creators of The Occupation and Ether One."}, {"name": "Lost Dimension", "details_link": "https://www.metacritic.com/game/playstation-3/lost-dimension", "publisher": "Atlus", "release_date": "Jul 28 2015", "developers": ["Lancarse", "FuRyu"], "platforms": ["PC", "PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/e5fc38ab2d2e617ebf9c50a97049006d-98.jpg", "descriptions": "Find the traitor who hides among your members!"}, {"name": "Retro City Rampage", "details_link": "https://www.metacritic.com/game/playstation-3/retro-city-rampage", "publisher": "Vblank Entertainment Inc.", "release_date": "Oct  9 2012", "developers": ["Vblank Entertainment Inc."], "platforms": ["PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Modern", "Third-Person", "Modern"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/54d0633629e37b23e626348e457c8a7d-98.jpg", "descriptions": "A parody of the open-world action genre, Retro City Rampage takes modern game mechanics and mashes them into an authentic 8-bit experience. It's one half fast paced arcade game, the other half a hilarious story mode! It's all the driving and shooting you'd expect and a whole lot more! WithA parody of the open-world action genre, Retro City Rampage takes modern game mechanics and mashes them into an authentic 8-bit experience. It's one half fast paced arcade game, the other half a hilarious story mode! It's all the driving and shooting you'd expect and a whole lot more! With missions that twist pages straight from classic game experiences, you get to re-live and rewrite history in a way only a modern anti-hero could! When it comes to enemies, weapons are only the beginning! Put on your boots and jump on their heads! Toss 'em around to knock the rest down! Become truly unstoppable with awesome power-ups! Through its world, characters and missions, Retro City Rampage lampoons the entire 8-bit era from its games to the TV, movies and pop culture!… Expand"}, {"name": "Cultist Simulator", "details_link": "https://www.metacritic.com/game/pc/cultist-simulator", "publisher": "Weather Factory", "release_date": "May 31 2018", "developers": ["Weather Factory"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/c545a77fbc3262af7035d17d9216b543-98.jpg", "descriptions": "Seize forbidden treasures. Summon alien gods. Feed on your disciples.Cultist Simulator is a game of apocalypse and yearning from Alexis Kennedy, creator of Fallen London and Sunless Sea. Play as a seeker after unholy mysteries, in a 1920s-themed setting of hidden gods and secret histories."}, {"name": "The LEGO Movie Videogame", "details_link": "https://www.metacritic.com/game/playstation-4/the-lego-movie-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb  7 2014", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General", "Fantasy"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/ca30a635b0053578617fa63389adc141-98.jpg", "descriptions": "In a scenario drawn from the film, The LEGO Movie Videogame puts LEGO kids into the role of Emmet, an ordinary, rules-following, perfectly average LEGO minifigure who is mistakenly identified as the most extraordinary person and the key to saving the world. Players guide him as he is draftedIn a scenario drawn from the film, The LEGO Movie Videogame puts LEGO kids into the role of Emmet, an ordinary, rules-following, perfectly average LEGO minifigure who is mistakenly identified as the most extraordinary person and the key to saving the world. Players guide him as he is drafted into a fellowship of strangers on an epic quest to stop an evil tyrant, a journey for which Emmet is hopelessly and hilariously underprepared.… Expand"}, {"name": "Pac-Pix", "details_link": "https://www.metacritic.com/game/ds/pac-pix", "publisher": "Namco", "release_date": "Apr 26 2005", "developers": ["Namco"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "General", "General"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/8209b9e8354b6fb4934af95db84167ae-98.jpg", "descriptions": "One day a mischievous wizard came up with a mysterious invention called “Ghost Ink.” When something is drawn using this ink, it turns into a Ghost. These ghostly tricksters would then jump into pictures and books, to pull pranks and cause havoc around the world. Our hero, Pac-Man, has takenOne day a mischievous wizard came up with a mysterious invention called “Ghost Ink.” When something is drawn using this ink, it turns into a Ghost. These ghostly tricksters would then jump into pictures and books, to pull pranks and cause havoc around the world. Our hero, Pac-Man, has taken his mighty Magic Pen – the only weapon that can defeat these Ghosts, and locked all the Ghosts inside a book. But before he could turn the Ghosts back into the Ghost Ink, he was also captured within the book! You must now take over Pac-Man’s quest to defeat the mischievous Ghosts. Use the stylus to draw Pac-Man, control his movements to eat up all the Ghosts on the screen. Travel from the lower to the upper screen to collect items and accumulate points. Can you bring peace and quiet back to the world with the Magic Pen? [Nintendo]… Expand"}, {"name": "Lips", "details_link": "https://www.metacritic.com/game/xbox-360/lips", "publisher": "Microsoft Game Studios", "release_date": "Nov 18 2008", "developers": ["iNiS"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/3fd5758bce6f7120e7bad3cd46a6ac77-98.jpg", "descriptions": "Lips is the only singing game offering wireless motion sensitive microphones and the ability to sing from your own collection of DRM-free songs. Start channeling your favorite pop star because it's you, your friends, and most importantly, your music that makes this the ultimate partyLips is the only singing game offering wireless motion sensitive microphones and the ability to sing from your own collection of DRM-free songs. Start channeling your favorite pop star because it's you, your friends, and most importantly, your music that makes this the ultimate party experience. Two wireless interactive microphones: Featuring stylish interactive motion sensors and lights, the microphones respond to the singer's actions and can be utilized as percussion accompaniments. With the freedom and encouragement provided by the high quality wireless microphones, everyone can live out their singing dreams in style. Lips ships with a diverse selection of songs, including your favorite blasts from the past like \"Bust a Move\" by Young MC, as well as new songs from breakout artists like \"Mercy\" by Duffy, and \"Young Folks\" by Peter Bjorn and John. Customize your experience with the songs that matter most by singing along with friends to any DRM-free music from your own personal collection. Using the standard Xbox 360 controller, up to two people can join the fun and choose from a variety of percussion accompaniments to play along. By placing control of various tambourines, claps, and of course, the ubiquitous cowbell, at the finger tips of anyone with a controller, you have a social entertainment experience for friends, family, and kids alike. From the songs that come with the game, to your own music collection, and the ability to download new tracks from Xbox Live Marketplace, Lips continuously provides new music to bring people together and keep the party going. [Microsoft]… Expand"}, {"name": "Goat Simulator 3", "details_link": "https://www.metacritic.com/game/pc/goat-simulator-3", "publisher": "Coffee Stain Publishing", "release_date": "Nov 17 2022", "developers": ["Coffee Stain North"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Simulation", "General"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/1ef71e03ad48ea6137647554f63a48fe-98.jpg", "descriptions": "That's right - we're doing this again. The baa has been raised, and Pilgor is joined by other goats too. You can invite up to three friends in local or online co-op, create carnage as a team, or compete in mini-games and then not be friends anymore.Get ready for another round of udderThat's right - we're doing this again. The baa has been raised, and Pilgor is joined by other goats too. You can invite up to three friends in local or online co-op, create carnage as a team, or compete in mini-games and then not be friends anymore.Get ready for another round of udder mayhem. Lick, headbutt, and ruin your way through a brand new open world in the biggest waste of your time since Goat Simulator! We won't tell you how to play (except in the tutorial), but merely provide the means to be the goats of your dreams.… Expand"}, {"name": "The Chant", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-chant", "publisher": "Deep Silver", "release_date": "Nov  3 2022", "developers": ["Brass Token"], "platforms": ["PC", "PlayStation 5", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/5339a44a725cef8bac8a3b30b1db2eaa-98.jpg", "descriptions": "A single-player, third person horror action-adventure game set on a remote island spiritual retreat. A peaceful weekend soon turns to dread after a group chant opens The Gloom, a psychedelic dimension of terror that feeds off negative energy. Interact with a recurring cast of characters,A single-player, third person horror action-adventure game set on a remote island spiritual retreat. A peaceful weekend soon turns to dread after a group chant opens The Gloom, a psychedelic dimension of terror that feeds off negative energy. Interact with a recurring cast of characters, untangle the complex history of the island, and witness terrifying revelations about the cosmos. Only you can fight off the creatures, reason with the survivors, and unravel the legacy of a cult from the 1970s to reverse the ritual.Features:* EXPLORE AN ISLAND FILLED WITH COSMIC DREAD: Interact with the other members of the retreat as they slowly become consumed by their own negative energy.* Survive against an array of prismatic creatures and cultists released from The Gloom as you piece together the weird history of the island.* FIGHT OR FLIGHT: You must choose your fights and battle for survival with spiritual weapons and abilities. Collect, craft, and manage your resources to take your chances in close combat - or succumb to panic and flee.* MIND BODY SPIRIT: Balance is everything. Steel your mind against horror and panic; Protect your body against physical threats; Elevate your spirit to meditate and access supernatural abilities.* MODERN PSYCHEDELIC HORROR: Inspired by the psychedelic horror of the 1970s, experience a landscape of colored lighting and an electronic rock soundtrack, composed by the award-winning Paul Ruskay.… Expand"}, {"name": "Prinny Presents NIS Classics Volume 3 La Pucelle: Ragnarok / Rhapsody: A Musical Adventure", "details_link": "https://www.metacritic.com/game/switch/prinny-presents-nis-classics-volume-3-la-pucelle-ragnarok-rhapsody-a-musical-adventure", "publisher": "NIS America", "release_date": "Aug 30 2022", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/b8564c9623790a26561530d78e90e34d-98.jpg", "descriptions": "Prinny is back at it again, dood! Prinny Presents NIS Classics Volume 3: La Pucelle: Ragnarok / Rhapsody: A Musical Adventure brings you two foundational titles in one! Discover the world of La Pucelle: Ragnarok as it makes its North American debut. This action-packed RPG is loaded with Prinny is back at it again, dood! Prinny Presents NIS Classics Volume 3: La Pucelle: Ragnarok / Rhapsody: A Musical Adventure brings you two foundational titles in one! Discover the world of La Pucelle: Ragnarok as it makes its North American debut. This action-packed RPG is loaded with tons of extra content including new scenarios, new recruits, and a whole gang of DLC characters in addition to a new voice cast, new music, and quick travel! Dive back into your NIS roots and experience a game that laid the foundation for the beloved Disgaea series with Rhapsody: A Musical Adventure. Sharper graphics and updated image optimization bring this classic title into the present! Plus, each physical copy includes the soundtrack and art book at retail. Experience a part of NIS history with this delightful combo pack! Key Features: Overflowing with New Content: La Pucelle is back with tons of new content including the Overlord Prier scenario. You can also recruit Laharl, Etna, Flonne, and Prinny to join your adventures. Extra DLC characters such as Rozalin, Cornet, Hero Prinny, and Elly are included as well. In addition to quality of life changes to the flow of the game, such as skipping cutscenes and rotating the camera during battle, there are also more voiced lines, newly recorded music, and a new quick travel feature! Where it All Began: The return of the original Rhapsody strategy RPG from the PS1 now has sharper graphics and image optimization options to mimic CRT. Exclusives Included: The physical NSW release includes both a soundtrack and an art book! … Expand"}, {"name": "Beyond A Steel Sky", "details_link": "https://www.metacritic.com/game/playstation-4/beyond-a-steel-sky", "publisher": "Microids", "release_date": "Dec 14 2021", "developers": ["Revolution Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Third-Person"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/6687a7c77a42aae2ffb27126a0e64ebf-98.jpg", "descriptions": "You are Robert Foster. A child has been abducted in a brutal attack. You have vowed to bring him home. The trail has led you to Union City, one of the last remaining mega-cities in a world ravaged by shattering wars, and political meltdown.Union City is a utopia, its people loving lifeYou are Robert Foster. A child has been abducted in a brutal attack. You have vowed to bring him home. The trail has led you to Union City, one of the last remaining mega-cities in a world ravaged by shattering wars, and political meltdown.Union City is a utopia, its people loving life under the control of an altruistic AI: ever-attentive androids, designer living, piazzas and bars. What's not to love? But this City has a dark underbelly...From multi-award winning Revolution comes 'Beyond a Steel Sky', a groundbreaking 3D adventure thriller, set in an AI-driven future. Subvert the world, hack the systems and solve dark conspiracies to uncover the devastating truth.… Expand"}, {"name": "Not Tonight", "details_link": "https://www.metacritic.com/game/pc/not-tonight", "publisher": "No More Robots", "release_date": "Aug 17 2018", "developers": ["Panic Barn Ltd"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "General", "Virtual", "Career"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/dd897666bac519000e6622a1bc7129e8-98.jpg", "descriptions": "Person of European Heritage #112: Welcome to Relocation Block B, your new home. Your designated role is 'Bouncer'. Work hard, stay out of trouble, and we might let you stay in the UK."}, {"name": "Impact Winter", "details_link": "https://www.metacritic.com/game/xbox-one/impact-winter", "publisher": "Bandai Namco Games", "release_date": "Apr  5 2018", "developers": ["Mojo Bones"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/0/4968d2fb2e74918fe5a4190b63d963ea-98.jpg", "descriptions": "\"In 30 days, help is coming…\" A mysterious radio transmission claims that help is inbound. You are Jacob Solomon: leader of a makeshift team trying to survive the aftermath of a devastating asteroid collision. Your goal: lead your team to survival."}, {"name": "Chambara", "details_link": "https://www.metacritic.com/game/playstation-4/chambara", "publisher": "team ok", "release_date": "Jul 26 2016", "developers": ["team ok"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/d37a541565c629fd2486601d915a4bef-98.jpg", "descriptions": "A flash of color. Feathers bursting from nowhere. Chambara’s color-based stealth mechanic allows you to blend completely into parts of the environment. Hide in plain sight. Leap, sneak, and dash with speed and style. Strike hard and then fade away before your position is revealed.A flash of color. Feathers bursting from nowhere. Chambara’s color-based stealth mechanic allows you to blend completely into parts of the environment. Hide in plain sight. Leap, sneak, and dash with speed and style. Strike hard and then fade away before your position is revealed. [Playstation.com]… Expand"}, {"name": "Starpoint Gemini 2", "details_link": "https://www.metacritic.com/game/xbox-one/starpoint-gemini-2", "publisher": "Little Green Men", "release_date": "Dec 11 2015", "developers": ["Little Green Men"], "platforms": ["PC", "Xbox One"], "genres": ["Strategy", "Real-Time", "General"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/c06a3fe4c1259c9248c6e9d4bfd00892-98.jpg", "descriptions": "Starpoint Gemini 2, like its predecessor Starpoint Gemini (2011), is an open-world 3D space simulation that combines powerful RPG mechanics with the frenzy of space combat, creating a particular blend that sets itself apart from all other games in the genre."}, {"name": "Sublevel Zero", "details_link": "https://www.metacritic.com/game/pc/sublevel-zero", "publisher": "Mastertronic", "release_date": "Oct  8 2015", "developers": ["Sigtrap Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Space", "Combat"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/99de58907c574e2d20cec0db7244b9b9-98.jpg", "descriptions": "Sublevel Zero is a first-person roguelike six-degree-of-freedom shooter set in a universe where reality is falling apart. Take control of a lone gunship pilot whose mission is to loot and craft ancient technology."}, {"name": "Star Wars: The Force Unleashed II", "details_link": "https://www.metacritic.com/game/wii/star-wars-the-force-unleashed-ii", "publisher": "LucasArts", "release_date": "Oct 26 2010", "developers": ["LucasArts", "Red Fly Studio"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "General", "General"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/7c7a6de5c5d7d10f688731de40821941-98.jpg", "descriptions": "With Star Wars: The Force Unleashed II, the epic story continues as players once again assume the role of the devastatingly powerful Starkiller - Darth Vader's secret apprentice set during the largely unexplored era between Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IVWith Star Wars: The Force Unleashed II, the epic story continues as players once again assume the role of the devastatingly powerful Starkiller - Darth Vader's secret apprentice set during the largely unexplored era between Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IV A New Hope.… Expand"}, {"name": "Digimon World DS", "details_link": "https://www.metacritic.com/game/ds/digimon-world-ds", "publisher": "Namco Bandai Games America", "release_date": "Nov  7 2006", "developers": ["Bec"], "platforms": "DS", "num_players": "2  Online", "genres": ["Role-Playing", "General", "General", "Trainer"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/81ba5e3687f0844c57fbddaa5a507e72-98.jpg", "descriptions": "Digimon World DS is the first iteration of the Digimon franchise on the Nintendo DS platform, featuring turn-based combat and entertaining Digimon training. In the game, the player assumes a role of Digimon tamer and embarks on an exciting journey to discover, raise, train and command overDigimon World DS is the first iteration of the Digimon franchise on the Nintendo DS platform, featuring turn-based combat and entertaining Digimon training. In the game, the player assumes a role of Digimon tamer and embarks on an exciting journey to discover, raise, train and command over 230 unique Digimons. Unlike many of the character collection driven games in the past, the true fun of Digimon World DS begins when collection is completed. You build Digi-Farms to raise, evolve and communicate with your Digimons. You can also exchange Digimons, engage in online battles together, and create rare breeds of Digimon with your friends via Wi-Fi and DS local wireless connection. [Namco Bandai Games]… Expand"}, {"name": "Madden NFL 06", "details_link": "https://www.metacritic.com/game/game-boy-advance/madden-nfl-06", "publisher": "EA Sports", "release_date": "Aug  8 2005", "developers": ["Exient Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Game Boy Advance"], "num_players": "1-6 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/cf597b72a0a0e1e9d3158a57a6c1a9fd-98.jpg", "descriptions": "The Madden franchise goes mobile with Madden 06 for Nintendo DS. This year's title adds an updated roster of players, so you can play with the newest NFL stars. Madden 06 includes an expanded franchise mode, which gives you more control of your team as you progress through a season."}, {"name": "Doki-Doki Universe", "details_link": "https://www.metacritic.com/game/playstation-4/doki-doki-universe", "publisher": "SCEA", "release_date": "Dec 10 2013", "developers": ["SCEA", "Humanature Studios"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["General", "Miscellaneous", "General"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/de0aae95825d420f2a3925d7ede01b1e-98.jpg", "descriptions": "Doki-Doki Universe is a charming interactive game that takes you on a journey to explore humanity and personal discovery."}, {"name": "Major League Baseball 2K6", "details_link": "https://www.metacritic.com/game/xbox/major-league-baseball-2k6", "publisher": "2K Sports", "release_date": "Apr  3 2006", "developers": ["Kush Games"], "platforms": ["PlayStation 2", "Xbox 360", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 71, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/09b4e24b0a3ed5d77e46aebb405bfd28-98.jpg", "descriptions": "Major League Baseball 2K6 is the newest baseball offering from 2K Sports and the only MLB-licensed game this year. Use the new Inside Edge scouting service to get detailed stat tracking and in-depth player reports. MLB 2K6 features detailed controls, letting you use the analog sticks to makeMajor League Baseball 2K6 is the newest baseball offering from 2K Sports and the only MLB-licensed game this year. Use the new Inside Edge scouting service to get detailed stat tracking and in-depth player reports. MLB 2K6 features detailed controls, letting you use the analog sticks to make precision changes to your swings and throws. ESPN broadcasters Joe Miller and Joe Morgan return to do the commentary. In addition to the single-player season and exhibition modes, MLB 2K6 includes a multiplayer mode.… Expand"}, {"name": "Battle Worlds: Kronos", "details_link": "https://www.metacritic.com/game/pc/battle-worlds-kronos", "publisher": "KING Art", "release_date": "Nov  4 2013", "developers": ["KING Art"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "General", "Tactics"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/61be05d2234cd1d9e177bc45bb5cdb27-98.jpg", "descriptions": "Battle Worlds: Kronos is a turn-based strategy game in the tradition of Battle Isle, Advance Wars and Panzer General. Have you ever wondered what games like that would look like today? Well, the makers of this game did. Thus, the game."}, {"name": "Ace Combat: Joint Assault", "details_link": "https://www.metacritic.com/game/psp/ace-combat-joint-assault", "publisher": "Namco Bandai Games", "release_date": "Aug 31 2010", "developers": ["Project Aces"], "platforms": "PSP", "num_players": "Up to 8 ", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/9102e53b8f0deaf63cadd3e4ad7d98c2-98.jpg", "descriptions": "Pilot more than 40 fully licensed aircraft and control the skies in the latest flight-action game in the Ace Combat series."}, {"name": "Black Mirror II: Reigning Evil", "details_link": "https://www.metacritic.com/game/pc/black-mirror-ii-reigning-evil", "publisher": "Viva Media", "release_date": "Feb  8 2011", "developers": ["Cranberry Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/96f5a849eb06b15ae3891772bf5b9594-98.jpg", "descriptions": "Black Mirror 2 fascinates players with lovely detailed 2D backgrounds and a thrilling story: Black Mirror 2 takes place in the 1990's, twelve years after the first episode. Solitary Darren, hero of Black Mirror 2, meets cute Angelina while he is working at the local photo shop of Biddeford,Black Mirror 2 fascinates players with lovely detailed 2D backgrounds and a thrilling story: Black Mirror 2 takes place in the 1990's, twelve years after the first episode. Solitary Darren, hero of Black Mirror 2, meets cute Angelina while he is working at the local photo shop of Biddeford, a small town in New England. Angelina immediately understands to catch the eye of Darren´s despotic, unpopular boss. To add the mystery, there seems to be a third person interested in Angelina – Darren sees someone chasing her. He decides to investigate these incidents. His researches will soon lead him to several locations – such as the small English village of Willow Creek, that adventure game players know from part #1.… Expand"}, {"name": "Rampage Puzzle Attack", "details_link": "https://www.metacritic.com/game/game-boy-advance/rampage-puzzle-attack", "publisher": "Midway", "release_date": "Nov 29 2001", "developers": ["Ninai Games"], "platforms": "Game Boy Advance", "genres": ["Action", "General"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/317155f38268b115d95f6d76aff484a4-98.jpg", "descriptions": "The giant monsters from Midway's classic action game expand their horizons in this Tetris-style puzzle title."}, {"name": "Psychonauts in The Rhombus of Ruin", "details_link": "https://www.metacritic.com/game/playstation-4/psychonauts-in-the-rhombus-of-ruin", "publisher": "Double Fine Productions", "release_date": "Feb 21 2017", "developers": ["Double Fine Productions"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/e3ec2b1677854851bfeae34d8272fbd1-98.jpg", "descriptions": "Psychonauts in the Rhombus of Ruin is a new Virtual Reality adventure that takes players back into the mysterious and paranormal world of the Psychonauts for the first time in more than a decade. Once again players assume the role of Raz, an intrepid young psychic and now fully fledgedPsychonauts in the Rhombus of Ruin is a new Virtual Reality adventure that takes players back into the mysterious and paranormal world of the Psychonauts for the first time in more than a decade. Once again players assume the role of Raz, an intrepid young psychic and now fully fledged member of the Psychonauts — an elite group of international psychic secret agents.… Expand"}, {"name": "Through the Darkest of Times", "details_link": "https://www.metacritic.com/game/pc/through-the-darkest-of-times", "publisher": "HandyGames", "release_date": "Jan 30 2020", "developers": ["Paintbucket Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 71, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/70c45035e679435e7031aee374c15b27-98.jpg", "descriptions": "Berlin 1933. “Adolf Hitler is chancellor!” We all know the consequences this message bore. Unspeakable horrors and suffering would sweep across the world. Few would stand and fight the monstrosity that was the German Reich. Will you? Lead an underground resistance group Through the DarkestBerlin 1933. “Adolf Hitler is chancellor!” We all know the consequences this message bore. Unspeakable horrors and suffering would sweep across the world. Few would stand and fight the monstrosity that was the German Reich. Will you? Lead an underground resistance group Through the Darkest of Times.\r… Expand"}, {"name": "Gods Eater Burst", "details_link": "https://www.metacritic.com/game/psp/gods-eater-burst", "publisher": "D3Publisher", "release_date": "Mar 15 2011", "developers": ["Shift", "Bandai Namco Games"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Sci-Fi", "Action RPG"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/6e772dc03a27f70a9f68296c056dc023-98.jpg", "descriptions": "Gods Eater Burst is the enhanced successor of the PSP hit God Eater."}, {"name": "Mass Effect: Andromeda", "details_link": "https://www.metacritic.com/game/playstation-4/mass-effect-andromeda", "publisher": "Electronic Arts", "release_date": "Mar 21 2017", "developers": ["BioWare"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 71, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/8/33efaf6a16f516270514e8d9e3634b39-98.jpg", "descriptions": "The story opens after a 600-year journey to the Andromeda galaxy, as the crew begins searching for a new home for humanity. The dreams of easy settlement are quickly shattered, as worlds expected to be paradises are instead wastelands, and the Pathfinder discovers that not all inhabitants ofThe story opens after a 600-year journey to the Andromeda galaxy, as the crew begins searching for a new home for humanity. The dreams of easy settlement are quickly shattered, as worlds expected to be paradises are instead wastelands, and the Pathfinder discovers that not all inhabitants of the galaxy welcome humanity. Terrifying enemies will challenge players and their crew, forcing them to utilize destructible environments, vertical movement through boosted jumps, customizable weapons, Biotics and other tools in their arsenal to even the playing field in a combat system and character progression that is more thrilling and open than ever. Mass Effect: Andromeda also features a separate team-based online multiplayer mode where players can engage in fast, fluid and frenetic combat to work together and achieve success. Utilizing combat skills, strategies, weapons and abilities gained from the field, players must coordinate to take down overwhelming forces. [Electronic Arts]… Expand"}, {"name": "Paperboy", "details_link": "https://www.metacritic.com/game/xbox-360/paperboy", "publisher": "Midway", "release_date": "Feb 14 2007", "developers": ["Digital Eclipse"], "platforms": ["iPhone/iPad", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/5b47ea3144a0b3643f4c8bcc1d51c628-98.jpg", "descriptions": "[Xbox Live Arcade]  Can you deliver? Keep your subscribers happy by tossing newspapers on their doorsteps with perfect accuracy. Pedal fast and avoid obstacles to make the headlines and bring home the bacon. Challenge: Stay on the road and keep your subscribers happy in Easy Street, Middle[Xbox Live Arcade]  Can you deliver? Keep your subscribers happy by tossing newspapers on their doorsteps with perfect accuracy. Pedal fast and avoid obstacles to make the headlines and bring home the bacon. Challenge: Stay on the road and keep your subscribers happy in Easy Street, Middle Road, and Hard Way difficulties. Earn 12 different achievements to add to your gamerscore, as well. Multiplayer: Play with a friend online or off with co-op multiplayer modes in both split screen and Xbox Live modes. Xbox Live: Keep track of your victories with leaderboards updated weekly and for all time! [Microsoft]… Expand"}, {"name": "Romance of the Three Kingdoms X", "details_link": "https://www.metacritic.com/game/playstation-2/romance-of-the-three-kingdoms-x", "publisher": "Koei", "release_date": "Jun 21 2005", "developers": ["Koei"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 71, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/56be619945be782bada3acc2093196bc-98.jpg", "descriptions": "The 10th edition of KOEI's historical simulation series begins when the beleaguered Chinese empire falls victim to a rebellious plot, and continues through over 100 years of civil war. China's turbulent history is revealed in breathtaking detail as players take the roles of Ancient China'sThe 10th edition of KOEI's historical simulation series begins when the beleaguered Chinese empire falls victim to a rebellious plot, and continues through over 100 years of civil war. China's turbulent history is revealed in breathtaking detail as players take the roles of Ancient China's most extraordinary figures including peasant turned emperor Liu Bei, conqueror Cao Cao, the elite warrior Zhao Yun, and brilliant strategist Zhuge Liang. Play as any officer: the game inclues 650 playable characters, and you can also create up to 110 new officers. [KOEI]… Expand"}, {"name": "Tom Clancy's Rainbow Six Extraction", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six-extraction", "publisher": "Ubisoft", "release_date": "Jan 20 2022", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 71, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/110b107e4721618c6ab4057fb95a1bd6-98.jpg", "descriptions": "Assemble your elite team of Rainbow Six Operators to launch incursions in the unpredictable containment zones and face off against an evolving Alien threat. Band together and put everything on the line as you take on this unknown enemy. Pick from 18 Rainbow Six operators. Assemble a squad inAssemble your elite team of Rainbow Six Operators to launch incursions in the unpredictable containment zones and face off against an evolving Alien threat. Band together and put everything on the line as you take on this unknown enemy. Pick from 18 Rainbow Six operators. Assemble a squad in Co-op of up to three Operators, or go solo. Each operator has a specific set of weapons and abilities to learn improve and master, and improve through a new progression-system. Explore 12 uniquely designed maps featuring procedurally generated challenges will test your team every time. Knowledge, cooperation and a tactical approach are your best weapons to survive. Fail against the enemies and your Operators will go Missing in Action (MIA). Be prepared to fight a lethal, unpredictable and constantly evolving Alien Threat. You will have to count on your teammates to face each of the 10 parasitic archetypes. Their abilities, combined with the alien ecosystem, will stand in your way.… Expand"}, {"name": "Etherborn", "details_link": "https://www.metacritic.com/game/xbox-one/etherborn", "publisher": "Akupara Games", "release_date": "Jul 18 2019", "developers": ["Altered Matter"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "Platformer", "First-Person", "Third-Person", "3D"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/748d6cf4a501ea97a947ad3137792ac8-98.jpg", "descriptions": "Etherborn is an elegant leap in the gravity-puzzle genre, an environmental puzzle platformer built on exploring and understanding gravity-shifting structures. Travel through beautiful and exotic locations, where each level is an organic puzzle to explore, manipulate and shift gravity on inEtherborn is an elegant leap in the gravity-puzzle genre, an environmental puzzle platformer built on exploring and understanding gravity-shifting structures. Travel through beautiful and exotic locations, where each level is an organic puzzle to explore, manipulate and shift gravity on in order to decipher the way forward.… Expand"}, {"name": "Heaven's Vault", "details_link": "https://www.metacritic.com/game/playstation-4/heavens-vault", "publisher": "inkle", "release_date": "Apr 16 2019", "developers": ["inkle"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/5/66c5ddb4c3a1c416c46b2bee70dd64c0-98.jpg", "descriptions": "An archaeological narrative adventure with an entire hieroglyphic language to decipher. Sail the rivers of space, explore lost moons, uncover ancient artefacts, and piece together a 5,000-year-old secret. Every answer feeds into a story that adapts around your actions. Will you uncover theAn archaeological narrative adventure with an entire hieroglyphic language to decipher. Sail the rivers of space, explore lost moons, uncover ancient artefacts, and piece together a 5,000-year-old secret. Every answer feeds into a story that adapts around your actions. Will you uncover the path to Heaven’s Vault?… Expand"}, {"name": "Swarm", "details_link": "https://www.metacritic.com/game/playstation-3/swarm", "publisher": "Ignition Entertainment", "release_date": "Mar 22 2011", "developers": ["Hothead Games"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Miscellaneous", "General", "General"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/183a620487c8ba7662c0d5c3165a4713-98.jpg", "descriptions": "Swarm lets the player take control of 50 utterly fearless Swarmites and drive them through an intense, entertaining and often suicidal battle for a greater good. Run, bash, huddle, boost, stack, jump, push and throw your way through gauntlets of death and destruction in an attempt to collectSwarm lets the player take control of 50 utterly fearless Swarmites and drive them through an intense, entertaining and often suicidal battle for a greater good. Run, bash, huddle, boost, stack, jump, push and throw your way through gauntlets of death and destruction in an attempt to collect valuable DNA and ensure that at least one Swarmite survives. With a unique combination of mass character control and fast action, the resulting brutal aftermath will make players want to play Swarm over and over again. … Expand"}, {"name": "The Sinking City", "details_link": "https://www.metacritic.com/game/pc/the-sinking-city", "publisher": "Epic Games", "release_date": "Jun 27 2019", "developers": ["Frogwares"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "Survival"], "meta_score": 71, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/9a4d0b635f463f405563907aaa75abf5-98.jpg", "descriptions": "The Sinking City is an adventure and investigation game set in an open world inspired by the universe of H.P. Lovecraft, the master of Horror. The half-submerged city of Oakmont is gripped by supernatural forces. You’re a private investigator, and you have to uncover the truth of what hasThe Sinking City is an adventure and investigation game set in an open world inspired by the universe of H.P. Lovecraft, the master of Horror. The half-submerged city of Oakmont is gripped by supernatural forces. You’re a private investigator, and you have to uncover the truth of what has possessed the city… and the minds of its inhabitants.… Expand"}, {"name": "The Climb", "details_link": "https://www.metacritic.com/game/pc/the-climb", "publisher": "Crytek", "release_date": "Apr 21 2016", "developers": ["Crytek"], "platforms": "PC", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/4ed92276c7f4c9e579a22bbeed58753d-98.jpg", "descriptions": "The Climb brings alive the excitement and thrill of rock climbing in virtual reality. Players will scale new heights and explore environments in a new gaming experience developed exclusively for VR, using the power of CRYENGINE."}]