[{"name": "The Misadventures of P.B. Winterbottom", "details_link": "https://www.metacritic.com/game/xbox-360/the-misadventures-of-pb-winterbottom", "publisher": "2K Play", "release_date": "Feb 17 2010", "developers": ["The Odd Gentlemen"], "platforms": ["PC", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/a80c795ef9c6d1cbeeea512e5efc8bc1-98.jpg", "descriptions": "[Xbox Live Arcade]  Create your own paradox... for the love of pie. Enter a macabre and comical silent world filled with mischief, time travel and delicious pie in The Misadventures of P. B. Winterbottom. Record yourself and harness your time-bending abilities to cooperate, compete against,[Xbox Live Arcade]  Create your own paradox... for the love of pie. Enter a macabre and comical silent world filled with mischief, time travel and delicious pie in The Misadventures of P. B. Winterbottom. Record yourself and harness your time-bending abilities to cooperate, compete against, and disrupt your past, present, and future selves. Winterbottom's debut misadventures present a whimsical spin on the notions of time, space, and play. Join Winterbottom as he travels through over 75 \"movie\" levels, causing mischief and mayhem in pursuit of the mysterious and elusive Chronoberry Pie on his spectacular journey through space-time. [2K Play]… Expand"}, {"name": "Mega Man Zero / ZX Legacy Collection", "details_link": "https://www.metacritic.com/game/switch/mega-man-zero-zx-legacy-collection", "publisher": "Capcom", "release_date": "Feb 25 2020", "developers": ["Capcom", "Access Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/ccb756098c89c608d272a220b7b46090-98.jpg", "descriptions": "Mega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent. In addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual ScenarioMega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent. In addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual Scenario Mode and a Save-Assist feature are available for those who would like to enjoy the story at their own pace. Players can also try their hand at the new leaderboard-based Z Chaser Mode, an exclusive new mode created just for this set of games.… Expand"}, {"name": "The Swapper", "details_link": "https://www.metacritic.com/game/playstation-4/the-swapper", "publisher": "Curve Studios", "release_date": "Aug  5 2014", "developers": ["Facepalm Games"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/43cc9d71faf6bde0dca1b94416c17382-98.jpg", "descriptions": "The Swapper features a unique art style that uses real-world clay-models and found objects to create an explorable space station realised in unique detail; gameplay sees players swap between different bodies to achieve otherwise impossible tasks. The game has won awards from IndieCade,The Swapper features a unique art style that uses real-world clay-models and found objects to create an explorable space station realised in unique detail; gameplay sees players swap between different bodies to achieve otherwise impossible tasks. The game has won awards from IndieCade, Develop and Freeplay, and been a finalist in many more.… Expand"}, {"name": "Mighty Flip Champs!", "details_link": "https://www.metacritic.com/game/ds/mighty-flip-champs!", "publisher": "WayForward", "release_date": "Jun  1 2009", "developers": ["WayForward"], "platforms": "DS", "num_players": "1 Player", "genres": ["Puzzle", "Action", "General", "General"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/bb663aa8a1ca733a97a7f71d33077008-98.jpg", "descriptions": "[DSiWare]  Are you ready to become a Mighty Flip Champ? Take control of Alta and page-flip through a series of action-packed mazes. The touch screen reflects a preview of the next chamber and shows Alta's projected destination within it. When it's time to flip, use Alta's Magical Warp Wand[DSiWare]  Are you ready to become a Mighty Flip Champ? Take control of Alta and page-flip through a series of action-packed mazes. The touch screen reflects a preview of the next chamber and shows Alta's projected destination within it. When it's time to flip, use Alta's Magical Warp Wand to replace her world with the next one. Will she land safely on solid ground or be crushed under it? By cycling endlessly through room after brain-busting room, you'll match wits with some of the most devious traps in puzzle/platforming history. [Nintendo]… Expand"}, {"name": "Persona 2: Eternal Punishment", "details_link": "https://www.metacritic.com/game/playstation/persona-2-eternal-punishment", "publisher": "Atlus Co.", "release_date": "Dec 22 2000", "developers": ["Atlus Co."], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 83, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/a4a6201a346508f61f34b467838449f7-98.jpg", "descriptions": "Welcome back to the twisted world of Persona, where nightmares become reality and reality becomes a nightmare... Over 50 hours of dark twisted gameplay, plus stunning anime cinematics that absorb you into the intriguing world of Persona! Enlist the help of the nightmarish denizens of PersonaWelcome back to the twisted world of Persona, where nightmares become reality and reality becomes a nightmare... Over 50 hours of dark twisted gameplay, plus stunning anime cinematics that absorb you into the intriguing world of Persona! Enlist the help of the nightmarish denizens of Persona through the use of the unique \"Contact System!\" Unleash total devastation by combining over 80 Persona to defeat the minions of evil. Change the fate of your characters by employing the revolutionary \"Rumor System.\"… Expand"}, {"name": "Prey (2006)", "details_link": "https://www.metacritic.com/game/pc/prey-2006", "publisher": "2K Games", "release_date": "Jul 11 2006", "developers": ["Human Head Studios"], "platforms": ["Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/94b7f87c4aa44f6e8924658d2a1dc05d-98.jpg", "descriptions": "Prey tells the story of Tommy, a Cherokee garage mechanic stuck on a reservation going nowhere. His life changes when an otherworldly crisis forces him to awaken spiritual powers from his long-forgotten birthright. Abducted along with his people to a menacing mothership orbiting Earth, hePrey tells the story of Tommy, a Cherokee garage mechanic stuck on a reservation going nowhere. His life changes when an otherworldly crisis forces him to awaken spiritual powers from his long-forgotten birthright. Abducted along with his people to a menacing mothership orbiting Earth, he sets out to save himself and his girlfriend and eventually his planet. Prey is serious, dark story, based on authentic Cherokee mythology. Themes of sacrifice, love and responsibility are explored and the story dives into emotional territory not yet explored by similar games.… Expand"}, {"name": "Betrayal At Club Low", "details_link": "https://www.metacritic.com/game/pc/betrayal-at-club-low", "publisher": "Cosmo D Studios", "release_date": "Sep  9 2022", "developers": ["Cosmo D Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/10beeca377880822d84d05bad377a2a9-98.jpg", "descriptions": "Tonight you're on a surprise mission at the inimitable Club Low. This former coffin factory-turned-nightclub has, for years, been a beacon of nocturnal energy, a haven for wild-limbed dancing, mind-altering music and shady characters aplenty. It's also a place to prove your skills as anTonight you're on a surprise mission at the inimitable Club Low. This former coffin factory-turned-nightclub has, for years, been a beacon of nocturnal energy, a haven for wild-limbed dancing, mind-altering music and shady characters aplenty. It's also a place to prove your skills as an undercover agent.An old colleague is trapped in the club, caught up in an intel-gathering mission with a notorious business captain. Your mission is to sneak into the club incognito and get him out before he blows his cover. Can you do it?… Expand"}, {"name": "LEGO Marvel Super Heroes", "details_link": "https://www.metacritic.com/game/playstation-4/lego-marvel-super-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 15 2013", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 3", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Open-World"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/0931dc86763a92229da46b2183101a23-98.jpg", "descriptions": "LEGO Marvel Super Heroes features an original story where players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many other Marvel characters as they unite to stop Loki and a myriad of other Marvel villains from assembling a super-weapon capable of destroyingLEGO Marvel Super Heroes features an original story where players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many other Marvel characters as they unite to stop Loki and a myriad of other Marvel villains from assembling a super-weapon capable of destroying the world.… Expand"}, {"name": "Metal Gear Rising: Revengeance", "details_link": "https://www.metacritic.com/game/pc/metal-gear-rising-revengeance", "publisher": "Konami", "release_date": "Jan  9 2014", "developers": ["PlatinumGames"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "General", "Modern", "Third-Person", "Tactical", "Modern"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/faeb8d7221c31fb6ee96f25c2df887cb-98.jpg", "descriptions": "Metal Gear Solid Rising makes its way to the PC and features Raiden as a playable character."}, {"name": "Tony Hawk's Underground 2", "details_link": "https://www.metacritic.com/game/xbox/tony-hawks-underground-2", "publisher": "Activision", "release_date": "Oct  4 2004", "developers": ["Neversoft Entertainment"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/5aade73f78f66a4371c2e0e89a8c877d-98.jpg", "descriptions": "You've been chosen by Tony Hawk to compete against Bam Margera's team in the World Destruction Tour. In an all-new storyline, Tony Hawk's Underground 2 takes you to skateparks around the world, where you can spray your custom tag, slap stickers, and even create new skate lines. Now you canYou've been chosen by Tony Hawk to compete against Bam Margera's team in the World Destruction Tour. In an all-new storyline, Tony Hawk's Underground 2 takes you to skateparks around the world, where you can spray your custom tag, slap stickers, and even create new skate lines. Now you can play as yourself, as your teammates, or as more than 20 special skaters. If you're feeling nostalgic for older Tony Hawk games, you can try Classic mode, which challenges you to accomplish your favorite goals, such as Secret Tape and High Score.… Expand"}, {"name": "Castlevania: Lords of Shadow", "details_link": "https://www.metacritic.com/game/xbox-360/castlevania-lords-of-shadow", "publisher": "Konami", "release_date": "Oct  5 2010", "developers": ["Mercury Steam"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/852617bc5c4b91c21e9ecf72f2d729c9-98.jpg", "descriptions": "Castlevania: Lords of Shadow takes place at the end of days. The Earth's alliance with the Heavens has been threatened by a dark and malevolent force - the mysterious Lords of Shadow - darkness reins the world.  Across this shattered land, the souls of the dead wander unable to find peace,Castlevania: Lords of Shadow takes place at the end of days. The Earth's alliance with the Heavens has been threatened by a dark and malevolent force - the mysterious Lords of Shadow - darkness reins the world.  Across this shattered land, the souls of the dead wander unable to find peace, whilst creatures of evil roam free wreaking chaos and death upon the living.  Gabriel is a member of the Brotherhood of Light, an elite group of holy knights who protect and defend the innocent against the supernatural. His beloved wife was brutally murdered by the evil forces of darkness and her soul trapped for eternity. Neither living nor dead she realizes the horrific truth of what is at stake and guides Gabriel to his destiny - and hopefully salvation for the world... but at what cost? Thus, Gabriel must travel the destroyed world, defeating the evil tyrants in order to use their powers to bring balance back to the world. Armed with the versatile Combat Cross - the world's last hope must encounter the three factions of the Lords of Shadow and end their unholy rule. Mercury Steam has created a rich, open game world that traverses snowy mountain ranges, Gothic castles, and undead-strewn wastelands in a devastated Southern Europe during the Middle Ages. [Konami]… Expand"}, {"name": "A Space For The Unbound", "details_link": "https://www.metacritic.com/game/playstation-5/a-space-for-the-unbound", "publisher": "PQube", "release_date": "Jan 19 2023", "developers": ["Mojiken Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/797e8ccd9d41b43e6050177c5029b122-98.jpg", "descriptions": "A Space For The Unbound is a slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\r Follow two high school sweethearts, AtmaA Space For The Unbound is a slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\r Follow two high school sweethearts, Atma and Raya, on a journey of self-discovery at the end of their high school years. When a mysteriously supernatural power is suddenly unleashed threatening their existence, they must explore and investigate their town to uncover hidden secrets, face the end of the world, and perhaps learn more about each other.… Expand"}, {"name": "The Riftbreaker", "details_link": "https://www.metacritic.com/game/pc/the-riftbreaker", "publisher": "EXOR Studios", "release_date": "Oct 14 2021", "developers": ["EXOR Studios"], "platforms": ["PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/a2efc25ab61d3dcc31665dad334a6904-98.jpg", "descriptions": "The Riftbreaker is a base-building, survival game with Action-RPG elements. You are an elite scientist/commando inside an advanced Mecha-Suit capable of dimensional rift travel. Hack & slash countless enemies. Build up your base, collect samples and research new inventions to survive."}, {"name": "Sine Mora", "details_link": "https://www.metacritic.com/game/playstation-3/sine-mora", "publisher": "Digital Reality", "release_date": "Nov 20 2012", "developers": ["Digital Reality", "Grasshopper Manufacture"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/5c67b4273d0f5442377b385d9ad126b1-98.jpg", "descriptions": "Sine Mora is a side-scrolling shooting game dealing with time manipulation."}, {"name": "Tales of Monkey Island Chapter 5: Rise of the Pirate God", "details_link": "https://www.metacritic.com/game/wii/tales-of-monkey-island-chapter-5-rise-of-the-pirate-god", "publisher": "Telltale Games", "release_date": "Feb  1 2010", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Wii"], "num_players": "1 Player", "genres": ["Adventure", "General", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/4c821dfe1539c36d2e2ee913b1ca3c41-98.jpg", "descriptions": "[WiiWare]  Here's a shocking series finale that's sure to shiver your timbers. With the Monkey Island world in tatters at the conclusion of the fourth Tales of Monkey Island chapter, we were left to wonder: Who can save the Caribbean?! LeChuck is revealing surprising new characteristics yet[WiiWare]  Here's a shocking series finale that's sure to shiver your timbers. With the Monkey Island world in tatters at the conclusion of the fourth Tales of Monkey Island chapter, we were left to wonder: Who can save the Caribbean?! LeChuck is revealing surprising new characteristics yet again, Guybrush has met a shocking fate and Elaine must confront the ultimate evil with everything at stake. This adventure takes you far beyond the stormy isles as you experience the Rise of the Pirate God. [Nintendo]… Expand"}, {"name": "Crisis Core: Final Fantasy VII", "details_link": "https://www.metacritic.com/game/psp/crisis-core-final-fantasy-vii", "publisher": "Square Enix", "release_date": "Mar 24 2008", "developers": ["Square Enix"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/2349acf350335ca370974688a6e1462e-98.jpg", "descriptions": "Square Enix is brings this role-playing game to the PSP the fourth installment in their Compilation of Final Fantasy VII series which includes the movie \"Final Fantasy VII: Advent Children,\" the game \"Dirge of Cerberus: Final Fantasy VII\" for PS2, and \"Before Crisis: Final Fantasy VII\" forSquare Enix is brings this role-playing game to the PSP the fourth installment in their Compilation of Final Fantasy VII series which includes the movie \"Final Fantasy VII: Advent Children,\" the game \"Dirge of Cerberus: Final Fantasy VII\" for PS2, and \"Before Crisis: Final Fantasy VII\" for mobile devices.… Expand"}, {"name": "Starseed Pilgrim", "details_link": "https://www.metacritic.com/game/pc/starseed-pilgrim", "publisher": "Droqen", "release_date": "Apr 16 2013", "developers": ["Droqen"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General"], "meta_score": 83, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/d22aea32fe2167dc388a536455a27d08-98.jpg", "descriptions": "You are a gardener, tending to empty noise and empty space to fill them both with colour. You are a refugee, building your own world away from the spreading darkness. You are an explorer, discovering new places, new rules, and new fascinations. The universe is bigger than you know."}, {"name": "Age of Conan: Rise of the Godslayer", "details_link": "https://www.metacritic.com/game/pc/age-of-conan-rise-of-the-godslayer", "publisher": "Eidos Interactive", "release_date": "May 11 2010", "developers": ["Funcom"], "platforms": "PC", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/f31a1d647e5675dfb9e3b45d8afbea31-98.jpg", "descriptions": "Take on the role of a Demonologist, Barbarian, Bear Shama or any other of the twelve exotic classes, as you face the challenges of Hyboria alone or in groups of other players from all over the world. Fight for survival, socialize with friends, construct equipment or even entire cities withTake on the role of a Demonologist, Barbarian, Bear Shama or any other of the twelve exotic classes, as you face the challenges of Hyboria alone or in groups of other players from all over the world. Fight for survival, socialize with friends, construct equipment or even entire cities with your fellow players, and carve out your destiny in the world of Conan. [Funcom]… Expand"}, {"name": "Trine", "details_link": "https://www.metacritic.com/game/playstation-3/trine", "publisher": "Nobilis", "release_date": "Oct 22 2009", "developers": ["Frozenbyte", "Inc."], "platforms": ["PC", "PlayStation 3"], "num_players": "1-3 ", "genres": ["Action", "Action Adventure", "Fantasy", "General", "Platformer", "Fantasy", "2D"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/f05baac317fcd4657a2f01d683e35e97-98.jpg", "descriptions": "Trine is a physics-based action game where three characters allow clever solutions to challenges created by hazardous puzzles and threatening enemies. The gameplay is based on fully interactive physics - each character's different abilities and tactics can be used to invent new ways toTrine is a physics-based action game where three characters allow clever solutions to challenges created by hazardous puzzles and threatening enemies. The gameplay is based on fully interactive physics - each character's different abilities and tactics can be used to invent new ways to overcome obstacles and save the kingdom! [Frozenbyte]… Expand"}, {"name": "Darksiders", "details_link": "https://www.metacritic.com/game/xbox-360/darksiders", "publisher": "THQ", "release_date": "Jan  5 2010", "developers": ["Vigil Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Modern", "Open-World"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/5aa9be70e237b1e1c3fc3610e0402c14-98.jpg", "descriptions": "Penned by legendary comic book artist Joe Madureira (X-Men, Battle Chasers, The Ultimates), Darksiders is set in a Post-Apocalyptic demon-ravaged world where evil forces have prematurely brought about the end of the time. Originally sent to oversee the destruction of Earth, the Four HorsemenPenned by legendary comic book artist Joe Madureira (X-Men, Battle Chasers, The Ultimates), Darksiders is set in a Post-Apocalyptic demon-ravaged world where evil forces have prematurely brought about the end of the time. Originally sent to oversee the destruction of Earth, the Four Horsemen of the Apocalypse have been betrayed by their master, stripped of their powers and cast down to Earth. Players take on the role of WAR -- the first of the Four Horsemen -- as he embarks on a brutal quest of vengeance and revenge against the forces that betrayed him with the help of his phantom steed RUIN. The first title from new THQ studio Vigil Games, Darksiders: Wrath of War features open-world exploration, a deep combat system and a huge arsenal of modern and mythical weapons. [THQ]… Expand"}, {"name": "MLB 08: The Show", "details_link": "https://www.metacritic.com/game/psp/mlb-08-the-show", "publisher": "SCEA", "release_date": "Mar  4 2008", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 2", "PlayStation 3", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/db3e3b7e05ae7b63deac87589f492625-98.jpg", "descriptions": "MLB 08 The Show promises to provide fans with the most realistic baseball experience to date with innovations such as a more immersive Road to The Show mode, enabling gamers to play both offense and defense from the created player’s perspective. Providing players with some additionalMLB 08 The Show promises to provide fans with the most realistic baseball experience to date with innovations such as a more immersive Road to The Show mode, enabling gamers to play both offense and defense from the created player’s perspective. Providing players with some additional performance incentives, the MLB franchise introduces the new Progressive Batting Performance feature, which both rewards players for superior performance and penalize them for hitting slumps. Specific to each individual batter, players are rewarded with slight contact bonuses, or punished with slight decreases in contact, based on how that batter that performs beyond his \"natural ability\" while under user control. Adding to the online feature set, which includes customizable Online League Play with up to 30 teams, scrolling MLB Score Ticker and more, MLB 08 The Show introduces SCOUT (SportsConnect Online User Tracking), which allows gamers to set and store their game preferences on the MLB server, and enables the system to look for a Quick Match with opponents that fits similar competitive criteria. [SCEA]… Expand"}, {"name": "Alan Wake", "details_link": "https://www.metacritic.com/game/pc/alan-wake", "publisher": "Remedy Entertainment", "release_date": "Feb 16 2012", "developers": ["Remedy Entertainment"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Horror", "Horror", "Survival"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/72fff31cbebc267cc0cf9e97c5f983af-98.jpg", "descriptions": "Alan Wake is a psychological action thriller, a unique new take in the world of gaming. The game is set in an idyllic all-American small town and its surroundings in the state of Washington. Alan Wake, the game's protagonist, is a bestselling horror writer, who writes a novel about hisAlan Wake is a psychological action thriller, a unique new take in the world of gaming. The game is set in an idyllic all-American small town and its surroundings in the state of Washington. Alan Wake, the game's protagonist, is a bestselling horror writer, who writes a novel about his darkest nightmares. In the game, those nightmares come true. As with Remedy's previous games, story and atmosphere are fundamental elements. The game features a massive, open world for the players to explore. The game design is mission based with the player as the driving force behing the action, and as with their previous games, Remedy again focuses completely on delivering the best possible single player experience. The use of light is a significant gameplay element. Remedy has developed proprietary new technology to support the gameplay of the title and to push the high definition visuals to the next level. [Remedy]… Expand"}, {"name": "OlliOlli: Switch Stance", "details_link": "https://www.metacritic.com/game/switch/olliolli-switch-stance", "publisher": "Gambitious", "release_date": "Feb 14 2019", "developers": ["Gambitious"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/51621060b611807bc578416ce9602d7c-98.jpg", "descriptions": "OlliOlli: Switch Stance includes both OlliOlli and OlliOlli2: Welcome to Olliwood - bringing together the defining Skateboarding Series of this generation! Making it’s Nintendo Switch debut, OlliOlli mixes addictive one-life gameplay with over 120 tricks and grinds to pull across 50OlliOlli: Switch Stance includes both OlliOlli and OlliOlli2: Welcome to Olliwood - bringing together the defining Skateboarding Series of this generation! Making it’s Nintendo Switch debut, OlliOlli mixes addictive one-life gameplay with over 120 tricks and grinds to pull across 50 deviously crafted Levels, 250 Challenges, Spots Mode and Daily Grind. Not enough for you? Complete all Challenges to unlock the super skilful RAD Mode. Rack up the biggest and coolest combos along the way then time your landing to perfection to rule the Leaderboards. … Expand"}, {"name": "Titanfall", "details_link": "https://www.metacritic.com/game/xbox-360/titanfall", "publisher": "Electronic Arts", "release_date": "Apr  8 2014", "developers": ["Bluepoint Games"], "platforms": ["PC", "Xbox One", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Shooter", "Sci-Fi", "Miscellaneous", "General", "Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/ea641e55052a8170876105a8ff0a6d0e-98.jpg", "descriptions": "Crafted by one of the co-creators of Call of Duty and other key developers behind the Call of Duty franchise, Titanfall, with its advanced combat techniques, gives you the freedom to fight your way as both elite assault Pilot and fast, heavily armored Titan. The experience combinesCrafted by one of the co-creators of Call of Duty and other key developers behind the Call of Duty franchise, Titanfall, with its advanced combat techniques, gives you the freedom to fight your way as both elite assault Pilot and fast, heavily armored Titan. The experience combines fast-paced multiplayer action with the dramatically charged moments of a cinematic universe.… Expand"}, {"name": "Karaoke Revolution", "details_link": "https://www.metacritic.com/game/playstation-2/karaoke-revolution", "publisher": "Konami", "release_date": "Oct 24 2003", "developers": ["Harmonix Music Systems"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 83, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/bf3b64921c94d255e3fd9fee73fa7972-98.jpg", "descriptions": "Turn your PlayStation 2 into a high-end, interactive karaoke machine with Karaoke Revolution, the latest in Konami's award-winning line of music video games. Featuring an impressive list of tunes from current hits to yesterday's classics, Karaoke Revolution will give gamers of all typesTurn your PlayStation 2 into a high-end, interactive karaoke machine with Karaoke Revolution, the latest in Konami's award-winning line of music video games. Featuring an impressive list of tunes from current hits to yesterday's classics, Karaoke Revolution will give gamers of all types something to sing about. Sing your favorite tunes while Karaoke Revolution judges you. Perform your way to the ultimate concert venue in Showtime Mode. Choose from a list of hits from the 70's, 80's, 90's and today! Utilizes the Sony USB headset microphone for PlayStation 2. [Konami]… Expand"}, {"name": "Hitman 2: Silent Assassin", "details_link": "https://www.metacritic.com/game/gamecube/hitman-2-silent-assassin", "publisher": "Eidos Interactive", "release_date": "Jun 19 2003", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/63cb1b0674ebdc5c3945169ab96497de-98.jpg", "descriptions": "The sequel to Hitman forces a retired assassin back into action by treason.  Visit the dark recesses of the world corrupted by crime, greed, degradation, and dishonor.  Your contracts will take you to exotic locations around the globe including Sicily, St. Petersburg, Japan, Malaysia, andThe sequel to Hitman forces a retired assassin back into action by treason.  Visit the dark recesses of the world corrupted by crime, greed, degradation, and dishonor.  Your contracts will take you to exotic locations around the globe including Sicily, St. Petersburg, Japan, Malaysia, and India.  A diverse arsenal of equipment, from armor-piercing rifles and explosives to chloroform and poison darts, are at your disposal.  Stalk and eliminate your targets up close and personal, in either first- or third-person perspectives.  You must decide whether to use stealth or aggression, but be careful--you'll have to deal with the consequences.… Expand"}, {"name": "NBA Live 2003", "details_link": "https://www.metacritic.com/game/playstation-2/nba-live-2003", "publisher": "Electronic Arts", "release_date": "Oct  8 2002", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/63e990909a2fbe70b1ee7598bbf27899-98.jpg", "descriptions": "Revolutionary Hand Control: Unprecedented control over both hands lets you make lightning-quick steals, monster shot blocks, and crossover dribbles. NBA Speed, NBA Power: Hundreds of new animations, including new signature moves. \"D Up\": Amazing control and new shot blocking animations bringRevolutionary Hand Control: Unprecedented control over both hands lets you make lightning-quick steals, monster shot blocks, and crossover dribbles. NBA Speed, NBA Power: Hundreds of new animations, including new signature moves. \"D Up\": Amazing control and new shot blocking animations bring defense to life. Real NBA Coaches: All the NBA head coaches are courtside in full 3D, reacting to the on-court action. Brand-new Commentary: Over 5,000 new lines keep the commentary fresh throughout the entire LIVE season. [EA Sports]… Expand"}, {"name": "Tiger Woods PGA Tour 2002", "details_link": "https://www.metacritic.com/game/pc/tiger-woods-pga-tour-2002", "publisher": "EA Sports", "release_date": "Feb 24 2002", "developers": ["Headgate"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 83, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/00fb62e4b705d2c273f508327fa14c14-98.jpg", "descriptions": "New TrueSwing/Total Precision Swing lets you drive in true, slice it or add a draw, giving you more control over your shots. Compete as or against 12 PGA TOUR professionals including Tiger, Jesper Parnevik, Vijay Singh, Colin Montgomerie, and Notah Begay. Brand new course lineup includesNew TrueSwing/Total Precision Swing lets you drive in true, slice it or add a draw, giving you more control over your shots. Compete as or against 12 PGA TOUR professionals including Tiger, Jesper Parnevik, Vijay Singh, Colin Montgomerie, and Notah Begay. Brand new course lineup includes such amazing layouts as Pebble Beach Golf Links, TPC at Sawgrass, Royal Birkdale in England, and more! [EA Sports]… Expand"}, {"name": "Monaco: What's Yours Is Mine", "details_link": "https://www.metacritic.com/game/pc/monaco-whats-yours-is-mine", "publisher": "Pocketwatch Games", "release_date": "Apr 24 2013", "developers": ["Pocketwatch Games"], "platforms": ["Switch", "Xbox 360", "PC"], "num_players": "1-4 ", "genres": ["Adventure", "General", "General"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/9eada99362016a3b50628e53eb79b48f-98.jpg", "descriptions": "MONACO is a single player or co-op heist game, in which players assemble a crack team of thieves to infiltrate and loot the ridiculously wealthy denizens of Monaco."}, {"name": "Indigo Prophecy", "details_link": "https://www.metacritic.com/game/playstation-2/indigo-prophecy", "publisher": "Atari", "release_date": "Sep 26 2005", "developers": ["Quantic Dream"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Modern"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/399cc2116d189e07eadb04db9fa1f529-98.jpg", "descriptions": "(Also known as \"Fahrenheit\")  New York, January 2009. For no apparent reason, ordinary people are killing total strangers in public places. Although there is no link between the murderers, they all seem to respect exactly the same ritual and pattern. Lucas Kane becomes another of these(Also known as \"Fahrenheit\")  New York, January 2009. For no apparent reason, ordinary people are killing total strangers in public places. Although there is no link between the murderers, they all seem to respect exactly the same ritual and pattern. Lucas Kane becomes another of these murderers when he kills a stranger in the men's room of a restaurant. Haunted by strange visions, he must keep one step ahead of the police to find out what is happening to him. Inspector Carla Valenti and her teammate agent Tyler Miles are in charge of the investigation. A series of disturbing clues projects them into a world they had never even dreamed of. Meanwhile, the early onset of winter paralyses Manhattan in an unbearable fury of cold and snow. Each day the temperature drops, as a coat of brilliant white snow is drawn over the dark streets of New York. One thing is sure : The final countdown has already begun. Indigo Prophecy creates a new breed of interactive entertainment, merging cinema and interactivity. A spectacular real-time 3D adventure with state-of-the-art camera direction and multi-path scenario. Play different protagonists in this epic quest and make the story progress depending on YOUR decisions. Control different characters in an awe-inspiring paranormal thriller, discern the dark secrets behind mysterious serial killings, understand why the city is brought to a standstill by snow and dropping temperatures, Play the hunter and the fugitive : explore, interact, fight and confront by all means dark forces during your journey. After Indigo Prophecy, the world just can't be the same place again. [Quantic Dream]… Expand"}, {"name": "Deus Ex: Mankind Divided", "details_link": "https://www.metacritic.com/game/xbox-one/deus-ex-mankind-divided", "publisher": "Square Enix", "release_date": "Aug 23 2016", "developers": ["Eidos Montreal"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/923253968b83c09724d6fb7e1f855a0f-98.jpg", "descriptions": "The action of Deus Ex: Mankind Divided takes place in 2029, a couple of years after the events of Human Revolution and the infamous ‘Aug Incident’ in Panchaea that resulted in the deaths of millions at the hands of those who had installed augmentations. This event has caused a massive divideThe action of Deus Ex: Mankind Divided takes place in 2029, a couple of years after the events of Human Revolution and the infamous ‘Aug Incident’ in Panchaea that resulted in the deaths of millions at the hands of those who had installed augmentations. This event has caused a massive divide between those who have augmentations and those who don't. Amidst this emotional turmoil are various factions aiming to manipulate the public by twisting public opinion of augmentation to advance their own agenda and hide the truth of what really occurred.… Expand"}, {"name": "Trials Rising", "details_link": "https://www.metacritic.com/game/pc/trials-rising", "publisher": "Ubisoft", "release_date": "Feb 26 2019", "developers": ["RedLynx"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 83, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/3f6f7dbe0db1c793515aa0ff3f842ea4-98.jpg", "descriptions": "Explore challenging tracks around the world, from Yellowstone Park to the peaks of Mt. Everest and everywhere in between. New Tandem Bike mode allows two riders to control one bike. Hone your racing skills and level up from local backyard competitions to stadium races. Make a statement withExplore challenging tracks around the world, from Yellowstone Park to the peaks of Mt. Everest and everywhere in between. New Tandem Bike mode allows two riders to control one bike. Hone your racing skills and level up from local backyard competitions to stadium races. Make a statement with customizable outfits and bike skins. … Expand"}, {"name": "Castle Crashers Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/castle-crashers-remastered", "publisher": "The Behemoth", "release_date": "Sep  9 2015", "developers": ["The Behemoth"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/dc9b1411756a6371c367c963d473d845-98.jpg", "descriptions": "New multiplayer mini-game called Back Off Barbarian. Five times larger texture sizes than the original."}, {"name": "Transistor", "details_link": "https://www.metacritic.com/game/pc/transistor", "publisher": "Supergiant Games", "release_date": "May 20 2014", "developers": ["Supergiant Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/ff9b9dd39b4b048715041a2cbb9632af-98.jpg", "descriptions": "Transistor is a science-fiction themed action RPG set in a futuristic city where players will take on the role of a young woman who gains control of an extraordinary weapon of unknown origin after a mysterious group of assailants nearly kills her with it."}, {"name": "Pac-Man Championship Edition", "details_link": "https://www.metacritic.com/game/xbox-360/pac-man-championship-edition", "publisher": "Namco Bandai Games", "release_date": "Jun  6 2007", "developers": ["Namco Bandai Games"], "platforms": ["iPhone/iPad", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/a5670e8d039e231ca91f6b2b78f2d27b-98.jpg", "descriptions": "[Xbox Live Arcade]  Pac-Man returns in this enhanced version of the all time classic videogame. Pac-Man Championship Edition has many new and unique gameplay features, but still spotlights the big yellow PAC-MAN we all know and love. The enhanced version now features constantly evolving[Xbox Live Arcade]  Pac-Man returns in this enhanced version of the all time classic videogame. Pac-Man Championship Edition has many new and unique gameplay features, but still spotlights the big yellow PAC-MAN we all know and love. The enhanced version now features constantly evolving mazes, a time limit, and six different game modes. Graphics and sound have been fully enhanced in this new version of the classic game. You'll have to practice hard and play well to conquer the increased gameplay speed! Remember, this is the Championship Edition so you know it will provide a good challenge. [Microsoft]… Expand"}, {"name": "Prince of Persia: Warrior Within", "details_link": "https://www.metacritic.com/game/gamecube/prince-of-persia-warrior-within", "publisher": "Ubisoft", "release_date": "Nov 30 2004", "developers": ["Ubisoft"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/ad9910ced88cd2815095a1226a481eec-98.jpg", "descriptions": "Hunted by Dahaka, an immortal incarnation of Fate seeking divine retribution, the Prince embarks on a new journey on a cursed island. Only with courage and the mastery of new combat arts can the Prince emerge victoriously. As the Prince, you can develop your own fighting style byHunted by Dahaka, an immortal incarnation of Fate seeking divine retribution, the Prince embarks on a new journey on a cursed island. Only with courage and the mastery of new combat arts can the Prince emerge victoriously. As the Prince, you can develop your own fighting style by manipulating the environment and the enemies. You can even use new projectile attacks and Sands of Time powers to rid the lands of deadly monsters.… Expand"}, {"name": "Grounded", "details_link": "https://www.metacritic.com/game/pc/grounded", "publisher": "Xbox Game Studios", "release_date": "Sep 27 2022", "developers": ["Obsidian Entertainment"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival", "Sandbox"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/89d0b5613cf2f29c2a5c5766a3d94436-98.jpg", "descriptions": "The world is a vast, beautiful and dangerous place especially when you have been shrunk to the size of an ant. Explore, build and survive together in this first person, multiplayer, survival-adventure. Can you thrive alongside the hordes of giant insects, fighting to survive the perils ofThe world is a vast, beautiful and dangerous place especially when you have been shrunk to the size of an ant. Explore, build and survive together in this first person, multiplayer, survival-adventure. Can you thrive alongside the hordes of giant insects, fighting to survive the perils of the backyard?… Expand"}, {"name": "Yakuza: Like a Dragon", "details_link": "https://www.metacritic.com/game/pc/yakuza-like-a-dragon", "publisher": "Sega", "release_date": "Nov 10 2020", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/ec38225497ffe43659f6d56d718744a9-98.jpg", "descriptions": "RISE LIKE A DRAGON. Become Ichiban Kasuga, a low-ranking yakuza grunt left on the brink of death by the man he trusted most. Take up your legendary bat and get ready to crack some underworld skulls in dynamic RPG combat set against the backdrop of modern-day Japan."}, {"name": "Moss: Book II", "details_link": "https://www.metacritic.com/game/playstation-4/moss-book-ii", "publisher": "Polyarc", "release_date": "Mar 31 2022", "developers": ["Polyarc"], "platforms": ["PC", "PlayStation 5", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/efe979044a72b2658d5232b1473209e4-98.jpg", "descriptions": "As the next game in the franchise, Book II builds on the story you started with Quill in the original Moss. In this continuation of the journey, the stakes are higher than ever as Quill works to save the world of Moss and end the merciless rule of the Arcane. New allies, old friends, and theAs the next game in the franchise, Book II builds on the story you started with Quill in the original Moss. In this continuation of the journey, the stakes are higher than ever as Quill works to save the world of Moss and end the merciless rule of the Arcane. New allies, old friends, and the very world around you will offer help along the way, but in the end, it is you alone who can lift Quill up to save this world, and together, rise to legend. [Polyarc]… Expand"}, {"name": "Cupid Parasite", "details_link": "https://www.metacritic.com/game/switch/cupid-parasite", "publisher": "Idea Factory", "release_date": "Nov  2 2021", "developers": ["Otomate"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 83, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/ba73bc2b45412d2dcd8b35dbe1052a3a-98.jpg", "descriptions": "A story about a cupid who ran away from her family after a fight to become the most successful bridal adviser in the human world. One day the heroine's boss calls her up for a job to find 5 hopeless guys (aka parasites) in desperate need of fixing their love life (and prolly theirA story about a cupid who ran away from her family after a fight to become the most successful bridal adviser in the human world. One day the heroine's boss calls her up for a job to find 5 hopeless guys (aka parasites) in desperate need of fixing their love life (and prolly their personalities in some cases).… Expand"}, {"name": "Moonlighter", "details_link": "https://www.metacritic.com/game/switch/moonlighter", "publisher": "11 bit studios", "release_date": "Nov  5 2018", "developers": ["11 bit studios", "Digital Sun"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/99398ea1f4798613e01faae9bfbf2d78-98.jpg", "descriptions": "Become Will, a fearless shopkeeper from the town of Rynoka setting off on the greatest adventure of his life.By day, you run the shop. By night, you explore hostile dungeons in search of new merchandise, doing all you can to keep your business afloat. After all, when it is all said andBecome Will, a fearless shopkeeper from the town of Rynoka setting off on the greatest adventure of his life.By day, you run the shop. By night, you explore hostile dungeons in search of new merchandise, doing all you can to keep your business afloat. After all, when it is all said and done... every adventure has to pay off.… Expand"}, {"name": "Mutant Mudds: Super Challenge", "details_link": "https://www.metacritic.com/game/wii-u/mutant-mudds-super-challenge", "publisher": "Renegade Kid", "release_date": "Mar 17 2016", "developers": ["Renegade Kid"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation Vita", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/6e7061c74dec814febd8da1e0bebd81b-98.jpg", "descriptions": "The game features a host of fresh platforming challenges and boss fights for super players. Max doesn’t miss a beat; picking up the action from the moment the original Mutant Mudds game ended. Max receives special intel, revealing the location of the original meteor impact site – showingThe game features a host of fresh platforming challenges and boss fights for super players. Max doesn’t miss a beat; picking up the action from the moment the original Mutant Mudds game ended. Max receives special intel, revealing the location of the original meteor impact site – showing that mutant mudds are still being spawned from it.… Expand"}, {"name": "Child of Light", "details_link": "https://www.metacritic.com/game/playstation-vita/child-of-light", "publisher": "Ubisoft", "release_date": "Jul  1 2014", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Stadia", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation Vita"], "num_players": "2 ", "genres": ["Role-Playing", "General"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/cf615938b3c157f628a22e1b9034ec34-98.jpg", "descriptions": "A 2D side-scrolling role-playing game inspired by the art style of Studio Ghibli. Young Aurora wakes up in a strange land where all light has been stolen from the sky. Before she can return to her home, she must return the Moon, Sun and Stars and free the kingdom of Lemuria from QueenA 2D side-scrolling role-playing game inspired by the art style of Studio Ghibli. Young Aurora wakes up in a strange land where all light has been stolen from the sky. Before she can return to her home, she must return the Moon, Sun and Stars and free the kingdom of Lemuria from Queen Umbra’s influence. Built on the UbiArt Framework and inspired by epic poetry and dark fairytales, Child of Light is a work of art brought to life – and now it’s a work of art you can bring with you wherever you go.… Expand"}, {"name": "Rogue Galaxy", "details_link": "https://www.metacritic.com/game/playstation-2/rogue-galaxy", "publisher": "SCEA", "release_date": "Jan 30 2007", "developers": ["Level 5"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/1671d99faf4e40c04314b07322bdbe8e-98.jpg", "descriptions": "The newest invention of \"Dark Cloud\" series developer Level 5, this role-playing game wraps up a neat real-time battle system in a world of unique and great-looking characters and environments. Jaster is a young man who dreams of exploring the galaxy. In a sudden turn of fate, he is mistakenThe newest invention of \"Dark Cloud\" series developer Level 5, this role-playing game wraps up a neat real-time battle system in a world of unique and great-looking characters and environments. Jaster is a young man who dreams of exploring the galaxy. In a sudden turn of fate, he is mistaken for a renowned bounty hunter and recruited into a band of space pirates in a race to find a legendary planet that holds the key to the greatest treasures and eternal life. Clues to ‘Eden’ are scattered round the Galaxy - Jaster will go onto to explore many different worlds and face countless battles in search for these clues – but some treasures are best left undiscovered. [SCEA]… Expand"}, {"name": "inFamous 2", "details_link": "https://www.metacritic.com/game/playstation-3/infamous-2", "publisher": "SCEA", "release_date": "Jun  7 2011", "developers": ["Sucker Punch"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "Open-World"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/ef5b1fffc66e307aa0e9ecec258272c7-98.jpg", "descriptions": "Blamed for the destruction of Empire City and haunted by the ghosts of his past, reluctant hero Cole MacGrath makes a dramatic journey to the historic Southern city of New Marais in an effort to discover his full super-powered potential -- and face a civilization-ending confrontation with aBlamed for the destruction of Empire City and haunted by the ghosts of his past, reluctant hero Cole MacGrath makes a dramatic journey to the historic Southern city of New Marais in an effort to discover his full super-powered potential -- and face a civilization-ending confrontation with a dark and terrifying enemy from his own future.  Gifted with extraordinary god-like abilities, Cole alone has the power to save humanity, but the question is-- will he choose to do so? … Expand"}, {"name": "Nintendogs: Chihuahua & Friends", "details_link": "https://www.metacritic.com/game/ds/nintendogs-chihuahua-friends", "publisher": "Nintendo", "release_date": "Aug 22 2005", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual Life", "Virtual", "Pet"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/e32e2c58d83f4c07b8e9361c191cdf1c-98.jpg", "descriptions": "Players care for and train their puppy by petting it, walking it and buying it supplies to play with. As a puppy competes in obedience and agility trials, owners can win money to purchase other puppy breeds. The pups will vary in gender, coloration and personality. Players purchase one ofPlayers care for and train their puppy by petting it, walking it and buying it supplies to play with. As a puppy competes in obedience and agility trials, owners can win money to purchase other puppy breeds. The pups will vary in gender, coloration and personality. Players purchase one of several breeds available at the beginning, then start spending time with their pup. They throw flying discs and balls to improve the pup’s agility, bathe it when it gets dirty and use their own personal voice commands to train the dog to do tricks. If players train it well enough, they will excel in obedience and agility trials and disc competitions, which will earn money that they can use to buy other supplies and puppy breeds. When players earn enough cash, they can buy even more puppies to live with their original pup. Players can socialize their pups by walking them around the town, where they will meet neighborhood dogs, and maybe even find new toys. Trips to the park and gym offer valuable training time to prepare for agility trials and disc competitions. Over time, the pup's stamina will increase so players can explore farther and farther. Players also can interact wirelessly with their friends' Nintendogs – they can set their DS to bark whenever another puppy is within wireless range. [Nintendo]… Expand"}, {"name": "Tekken Tag Tournament 2", "details_link": "https://www.metacritic.com/game/xbox-360/tekken-tag-tournament-2", "publisher": "Namco Bandai Games", "release_date": "Sep 11 2012", "developers": ["Namco Bandai Games"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/2930997f3e1b68a40a4322b86a56f212-98.jpg", "descriptions": "The Tekken Tag Tournament returns with fighters from across the Tekken spectrum taking each other on two by two for the second time."}, {"name": "No Man's Sky Beyond", "details_link": "https://www.metacritic.com/game/playstation-4/no-mans-sky-beyond", "publisher": "Hello Games", "release_date": "Aug 14 2019", "developers": ["Hello Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/0559d42b8a01ba91cb8da477ee125acb-98.jpg", "descriptions": "No Man’s Sky is an epic science fiction adventure set across an infinite universe, in which every star is the light of a distant sun, orbited by planets filled with life — each yours to visit. Explore never-before-seen worlds and trade, fight and survive on a galactic scale."}, {"name": "Yakuza 5", "details_link": "https://www.metacritic.com/game/playstation-3/yakuza-5", "publisher": "Sega", "release_date": "Dec  8 2015", "developers": ["Ryu ga Gotoku Studios"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Modern", "Action Adventure", "Open-World"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/d2610434c588164c67b565bbd8b076c7-98.jpg", "descriptions": "The legendary dragon returns to the criminal underworld of Yakuza. Kazuma Kiryu, once known as the Dragon of Dojima, was living a quiet life as a taxi driver in Hakata after severing all his ties with the underworld. However, at the dawn of the bloody war between the Tojo Clan and the OmiThe legendary dragon returns to the criminal underworld of Yakuza. Kazuma Kiryu, once known as the Dragon of Dojima, was living a quiet life as a taxi driver in Hakata after severing all his ties with the underworld. However, at the dawn of the bloody war between the Tojo Clan and the Omi Alliance, Kazuma is forced to accept his inescapable fate and returns to a life filled with crime and violence to protect his loved ones. Yakuza 5 continues the epic story of Kazuma Kiryu and 4 other protagonists, Haruka Sawamura, Taiga Saejima, Tatsuo Shinada and Shun Akiyama. The saga plays out across 5 major Japanese cities - Tokyo, Osaka, Hakata, Nagoya and Sapporo. Yakuza 5 also features “Another Drama” which is a series of extensive sub-plots that focus on each protagonist. The battle system and customization system have been enhanced from Yakuza 4 and various mini-games are available in the well-known locales from the series including infamous night clubs and popular CLUB SEGA locations.… Expand"}, {"name": "DiRT", "details_link": "https://www.metacritic.com/game/playstation-3/dirt", "publisher": "Codemasters", "release_date": "Sep 11 2007", "developers": ["Codemasters"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "8  Online", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/954a0e8b0d59c97f4f25a6a4b820ba38-98.jpg", "descriptions": "(Formerly known as \"Colin McRae Rally 2007\" or \"CMR '07\")  After a two-year break for the series, Codemasters Studios' designers have created a reinvigorated McRae experience. The new Colin McRae title goes beyond the series' point-to-point rallying to deliver the most diverse selection of(Formerly known as \"Colin McRae Rally 2007\" or \"CMR '07\")  After a two-year break for the series, Codemasters Studios' designers have created a reinvigorated McRae experience. The new Colin McRae title goes beyond the series' point-to-point rallying to deliver the most diverse selection of extreme off-road competitions. Sensational gravel, mud and dirt racing events from the world over include perilous Hill Climb and collision-packed Rally Cross events. International rallying competitions are also featured, with official cars on tracks based on real roads and locations around the globe. The title also expands on beat-the-clock racing and includes events with multiple cars on track to satisfy anyone who wants to push their on-the-edge driving just that bit further. [Codemasters]… Expand"}, {"name": "Crisis Core: Final Fantasy VII Reunion", "details_link": "https://www.metacritic.com/game/pc/crisis-core-final-fantasy-vii-reunion", "publisher": "Square Enix", "release_date": "Dec 13 2022", "developers": ["Square Enix", "TOSE"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/a7c89d8870f0bc7f5b2856300644e0a1-98.jpg", "descriptions": "CRISIS CORE -FINAL FANTASY VII- REUNION is a full remaster of the PlayStation Portable exclusive CRISIS CORE -FINAL FANTASY VII-, which originally launched back in 2007. CRISIS CORE -FINAL FANTASY VII- REUNION is a true remaster that follows the original's narrative: Zack Fair's mission toCRISIS CORE -FINAL FANTASY VII- REUNION is a full remaster of the PlayStation Portable exclusive CRISIS CORE -FINAL FANTASY VII-, which originally launched back in 2007. CRISIS CORE -FINAL FANTASY VII- REUNION is a true remaster that follows the original's narrative: Zack Fair's mission to find the missing SOLDIER Genesis Rhapsodos. It features multiple improvements from the original game - for example, the graphics have been converted to HD, with all the 3D models, from the characters to everything else, being fully refreshed. What's more the dialogue is now fully voice-acted, and there's a new arrangement for the soundtrack!… Expand"}, {"name": "FIFA Soccer 08", "details_link": "https://www.metacritic.com/game/playstation-2/fifa-soccer-08", "publisher": "EA Sports", "release_date": "Oct  9 2007", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/ab7c594b62d80f401e253152188cddde-98.jpg", "descriptions": "FIFA Soccer 08  challenges players to master the skills required to play like a pro soccer player. Fans around the world can experience the same highs and lows of real-world players and tackle the challenges they face on a daily basis. FIFA Soccer 08 puts you on the pitch to defy the odds,FIFA Soccer 08  challenges players to master the skills required to play like a pro soccer player. Fans around the world can experience the same highs and lows of real-world players and tackle the challenges they face on a daily basis. FIFA Soccer 08 puts you on the pitch to defy the odds, perfect your skills, elevate your game and rise up to win glory for your club. [Electronic Arts]… Expand"}, {"name": "Sunlight", "details_link": "https://www.metacritic.com/game/pc/sunlight", "publisher": "Krillbite Studio", "release_date": "Jan 14 2021", "developers": ["Krillbite Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 83, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/9/2123c4af455735fc295f223efa7b1dbd-98.jpg", "descriptions": "Traverse a harmonious hand painted forest in this first person hike. The trees guide you with gentle whispers, as you explore a philosophical story."}, {"name": "Creaks", "details_link": "https://www.metacritic.com/game/playstation-4/creaks", "publisher": "Amanita Design", "release_date": "Jul 22 2020", "developers": ["Amanita Design"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/ae6a489e5b1605fb4205256ec71c5d89-98.jpg", "descriptions": "Just a few minutes into Creaks, you will bump into some strange barking creatures in the mansion’s dark corridors. But are they as dangerous as they seem? Try to get them trapped under a beam of light and take a closer look. You may find out that what felt dangerous is a simple night table.Just a few minutes into Creaks, you will bump into some strange barking creatures in the mansion’s dark corridors. But are they as dangerous as they seem? Try to get them trapped under a beam of light and take a closer look. You may find out that what felt dangerous is a simple night table. Turning these creatures into ordinary objects is the key gameplay mechanic, along with pulling levers, stepping on pressure plates, and manipulating the environment to outsmart your enemies. [Radim Jurda]… Expand"}, {"name": "Zero Escape: Zero Time Dilemma", "details_link": "https://www.metacritic.com/game/playstation-vita/zero-escape-zero-time-dilemma", "publisher": "Aksys Games", "release_date": "Jun 28 2016", "developers": ["Spike Chunsoft", "Chime"], "platforms": ["3DS", "PC", "PlayStation 4", "Xbox One", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/8a53bce5ad689bf1c495489a15865261-98.jpg", "descriptions": "Choice is your only method of salvation and your only method of escape. How much of your humanity will you sacrifice to gain your freedom? As a new age of ruin looms large on the horizon, you have to make impossible decisions and weather unimaginable consequences as you straddle the lineChoice is your only method of salvation and your only method of escape. How much of your humanity will you sacrifice to gain your freedom? As a new age of ruin looms large on the horizon, you have to make impossible decisions and weather unimaginable consequences as you straddle the line between absolution and damnation.… Expand"}, {"name": "Outland", "details_link": "https://www.metacritic.com/game/playstation-3/outland", "publisher": "Ubisoft", "release_date": "Jun 14 2011", "developers": ["Housemarque"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "3D", "2D"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/3d4b2514faea147d3a35041d026c50b7-98.jpg", "descriptions": "Outland puts players in the middle of a world of balance and chaos where their efforts allow them to bridge the ancient divide, or doom the world to destruction. Each player’s adventure will take them between light and darkness and force them to adapt to an ever-changing world. This lightOutland puts players in the middle of a world of balance and chaos where their efforts allow them to bridge the ancient divide, or doom the world to destruction. Each player’s adventure will take them between light and darkness and force them to adapt to an ever-changing world. This light versus dark core gameplay is inspired by the arcade classic Ikaruga.… Expand"}, {"name": "Life is Strange: True Colors", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-true-colors", "publisher": "Square Enix", "release_date": "Sep 10 2021", "developers": ["Deck Nine Games"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 83, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/a01b435560a548f12f28d676a154f7d3-98.jpg", "descriptions": "A bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!Alex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees asA bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!Alex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees as blazing, colored auras.When her brother dies in a so-called accident, Alex must embrace her volatile power to find the truth and uncover the dark secrets buried by a small town.… Expand"}, {"name": "Skylanders Swap Force", "details_link": "https://www.metacritic.com/game/playstation-3/skylanders-swap-force", "publisher": "Activision", "release_date": "Oct 13 2013", "developers": ["Vicarious Visions"], "platforms": ["3DS", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 83, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/d3393b38cd78546d57d345e6129a3339-98.jpg", "descriptions": "In Skylanders SWAP Force, Portal Masters embark on an adventure in the mysterious Cloudbreak Islands, where a magical volcano gives the heroes the power to swap halves, turning them into a special team known as the SWAP Force. By reassembling this team, Portal Masters must send back Kaos andIn Skylanders SWAP Force, Portal Masters embark on an adventure in the mysterious Cloudbreak Islands, where a magical volcano gives the heroes the power to swap halves, turning them into a special team known as the SWAP Force. By reassembling this team, Portal Masters must send back Kaos and his evil plan to Cloudbreak in order to save Skylands.… Expand"}, {"name": "GRIS", "details_link": "https://www.metacritic.com/game/switch/gris", "publisher": "Devolver Digital", "release_date": "Dec 13 2018", "developers": ["Nomada Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/e9ad4f7143aa1df712421809bc5ef224-98.jpg", "descriptions": "Gris is a hopeful young girl lost in her own world, dealing with a painful experience in her life. Her journey through sorrow is manifested in her dress, which grants new abilities to better navigate her faded reality."}, {"name": "Call of Duty: Advanced Warfare", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-advanced-warfare", "publisher": "Activision", "release_date": "Nov  3 2014", "developers": ["Sledgehammer Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 83, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/0a400d410fe285a7c9a699bf06f4610b-98.jpg", "descriptions": "Call of Duty: Advanced Warfare predicts the powerful battlegrounds of the future, where both technology and tactics have taken steps to usher in a new era of combat for the franchise. Kevin Spacey is Jonathan Irons -- one of the most notorious men in the world -- shaping this chilling visionCall of Duty: Advanced Warfare predicts the powerful battlegrounds of the future, where both technology and tactics have taken steps to usher in a new era of combat for the franchise. Kevin Spacey is Jonathan Irons -- one of the most notorious men in the world -- shaping this chilling vision of the future of war. The game unfolds in a plausible future in which technological, telesis and today's military practices have converged with real world consequences. In this image of the future, Private Military Corporations have become the dominant armed forces for many countries who must outsource their military needs, redrawing borders and rewriting international law.  Irons, the founder and president of the world's largest PMC, Atlas Corporation, is at the vortex of these tectonic plates.\r Suit up for combat in exoskeletons that advance every facet of a soldier's battle readiness, enabling combatants to deploy with an advanced lethality and eliminating the need for specialization. Players tout enhanced player movement and verticality through boost jumps and grappling, covert cloaking abilities, and biomechanics that provide keen strength, awareness, endurance, and speed. With the advent of the exoskeleton and newly advanced armor and weaponry, every soldier commands tactical freedom in any terrain unlike ever before.… Expand"}, {"name": "UnderMine", "details_link": "https://www.metacritic.com/game/switch/undermine", "publisher": "Fandom", "release_date": "Feb 11 2021", "developers": ["Thorium Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/2d9a0759c452af223bb956b995d7f1e3-98.jpg", "descriptions": "An action-adventure roguelike with a bit of RPG tossed in. Adventure deep into the UnderMine and discover powerful relics, deadly enemies, hidden secrets, and a few friends to help along the way. \r\rDelve deep into the UnderMine and discover its secrets, one peasant at a time! UnderMine isAn action-adventure roguelike with a bit of RPG tossed in. Adventure deep into the UnderMine and discover powerful relics, deadly enemies, hidden secrets, and a few friends to help along the way. \r\rDelve deep into the UnderMine and discover its secrets, one peasant at a time! UnderMine is an action-adventure roguelike that blends combat and dungeon crawling with rpg-like progression. Mine gold, die, upgrade yourself, and try again! Discover hundreds of items including relics, potions, blessings, and curses that all combo and stack for a new experience every run. Challenge dangerous bosses and rescue helpful characters that provide new upgrades for your adventure. Decipher the cryptic messages of the Undermine's residents and unfold the mystery at the heart of the dungeon. \r\rBuild Item Combos\rDiscover relics, potions, prayers, blessings, and even curses to forge that perfect run. Watch as items pop off and combo with one another to make a god peasant of destruction. \r\rRescue Characters\rDiscover friendly (and some unfriendly) characters in need of rescue. After returning them safe to the mine's hub they will offer powerful upgrades that can be used from run to run. \r\rDiscover Secrets\rExplore every nook and cranny to discover hundreds of secrets. New relics, potions, characters, and story bits lay behind the statues, rocks, and walls of each floor. \r\rDeadly Bosses\rEach area of the UnderMine contains one (or more!) deadly boss that will test planning, patience, strategy, and skill. Prepare well, because a test awaits! \r\rWickedly Lighthearted\rUnderMine has a rich world to explore and discover with charming characters and a plot full of intrigue. Experience the plight of the poor Delvemore peasants. Told to brave extreme danger for a boss that doesn't quite care about them or their safety. A pretty funny situation when you think about it and something we can all relate to.… Expand"}, {"name": "Super Mega Baseball 3", "details_link": "https://www.metacritic.com/game/xbox-one/super-mega-baseball-3", "publisher": "Metalhead Software", "release_date": "May 13 2020", "developers": ["Metalhead Software"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Baseball", "Arcade"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/028cdfdd035ff24e83dade952a5ec4f8-98.jpg", "descriptions": "Run up the score in a relaxed slugfest or push the limits of your reflexes in this refined baseball simulator. The third entry in the series features an all-new Franchise mode, major graphical enhancements, and on-field additions including pickoffs and situational player traits."}, {"name": "WarioWare: Smooth Moves", "details_link": "https://www.metacritic.com/game/wii/warioware-smooth-moves", "publisher": "Nintendo", "release_date": "Jan 15 2007", "developers": ["Intelligent Systems"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/5866e54962ddba053ad7547ec8960efd-98.jpg", "descriptions": "Wario and his pals learn fun, wacky moves after discovering a strange book and a mystical device called the Form Baton. Familiar characters from the WarioWare universe will return to this installment and some new ones will appear. Players must clear fast-paced sets of microgames, changingWario and his pals learn fun, wacky moves after discovering a strange book and a mystical device called the Form Baton. Familiar characters from the WarioWare universe will return to this installment and some new ones will appear. Players must clear fast-paced sets of microgames, changing the way they hold the Wii Remote each time. As they do, they'll unlock more microgames and souvenirs. The WarioWare team took an idea so wacky, it could only be made with the latest technology ... the Wii Remote. WarioWare is back with a whole new set of moves. When Wario stumbles upon a strange device called a Form Baton, he and his friends use it to learn new moves that are as fun as they are wacky. With hundreds of microgames, this game is just as wild as you'd expect from the name WarioWare, but the game play has been revolutionized. Under Wario's tutelage, and with the help of the Wii Remote, players will swing, spin and squat their way to victory. With about 200 lightning-quick microgames and controls that range from scribbling to flailing, WarioWare: Smooth Moves takes interactive gaming to a whole new level. All players need is a Wii Remote and their best moves to be the champ. [Nintendo]… Expand"}, {"name": "Tiger Woods PGA Tour 06", "details_link": "https://www.metacritic.com/game/playstation-2/tiger-woods-pga-tour-06", "publisher": "EA Sports", "release_date": "Sep 20 2005", "developers": ["EA Sports"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 83, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/c85114d1adb719485890ba5ed5aa0bd2-98.jpg", "descriptions": "Prove yourself as the greatest golfer of all time by taking on the legends in the prime of their careers -- on their terms. Do you have what it takes to beat Jack Nicklaus in his heyday with a bag full of wooden clubs or Tiger Woods with his modern-day equipment? For the first time, bothProve yourself as the greatest golfer of all time by taking on the legends in the prime of their careers -- on their terms. Do you have what it takes to beat Jack Nicklaus in his heyday with a bag full of wooden clubs or Tiger Woods with his modern-day equipment? For the first time, both analog sticks control each shot from tee to green. The left analog stick controls your swing, and the right analog Shape Stick dictates ball trajectory and putt strength. Back your challenges with wagers before any shot or round. Bigger odds are given to special accomplishments, so reap the largest rewards for nailing the toughest shots. Experience 15 beautifully detailed courses including Pebble Beach Golf Links, St Andrews, Reflection Bay, Doral Golf Resort, and more as you play as or against Tiger Woods and 16 other PGA TOUR players, including the newly added Chris DiMarco, Mike Weir, Ian Poulter, and Luke Donald. New Gamebreaker Meter: Build confidence to trigger Gamebreaker situations, and boost your power and accuracy by making great shots and posting low scores. [Electronic Arts]… Expand"}, {"name": "The Sexy Brutale", "details_link": "https://www.metacritic.com/game/pc/the-sexy-brutale", "publisher": "Tequila Works", "release_date": "Apr 11 2017", "developers": ["Tequila Works", "Cavalier Game Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/6c90b2d94801cf76c1ab96f492c96f85-98.jpg", "descriptions": "The Sexy Brutale — a never-ending masked ball featuring intrigue, murder and the (quite possibly) occult. Relive the same mysterious day where the guests at the casino mansion are being murdered by the staff over and over again."}, {"name": "MLB 14: The Show", "details_link": "https://www.metacritic.com/game/playstation-4/mlb-14-the-show", "publisher": "SCEA", "release_date": "May  6 2014", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/beee4ff277a71c2fb35f2ab7663d0daa-98.jpg", "descriptions": "MLB 14 The Show is a realistic baseball game that allows players to feel the MLB experience with moments such as when you're called up to the majors, a sacrifice fly to left field, or crushing a walk-off homer to win it all."}, {"name": "Helldivers", "details_link": "https://www.metacritic.com/game/pc/helldivers", "publisher": "PlayStation Mobile Inc.", "release_date": "Dec  7 2015", "developers": ["Arrowhead Game Studios"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Shoot-'Em-Up", "Arcade", "Top-Down"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/bb4f5102e021130d1409b07646eb12dd-98.jpg", "descriptions": "Set in a dystopian future, players fight to protect \"Super Earth,\" where a managed democracy has blurred the lines between military and government rule. We are losing the war, and the HELLDIVERS are the last line of defense against three invading enemy species."}, {"name": "Project CARS", "details_link": "https://www.metacritic.com/game/playstation-4/project-cars", "publisher": "Bandai Namco Games", "release_date": "May 12 2015", "developers": ["Slightly Mad Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "General", "Automobile"], "meta_score": 83, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/b27b9bf465032abfe969ff2506e22b52-98.jpg", "descriptions": "Create a driver, pick from a variety of motorsports, and shift into high gear to chase a number of Historic Goals and ultimate recognition in the Hall Of Fame. Then test your skills online either in competitive fully-loaded race weekends, leaderboard-based time challenges, orCreate a driver, pick from a variety of motorsports, and shift into high gear to chase a number of Historic Goals and ultimate recognition in the Hall Of Fame. Then test your skills online either in competitive fully-loaded race weekends, leaderboard-based time challenges, or continually-updated community events.… Expand"}, {"name": "Worldwide Soccer Manager 2009", "details_link": "https://www.metacritic.com/game/pc/worldwide-soccer-manager-2009", "publisher": "Sega", "release_date": "Nov 18 2008", "developers": ["Sports Interactive"], "platforms": "PC", "num_players": "8  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/186e599aeeedce803127dc5d18e0e1b7-98.jpg", "descriptions": "(Also known as \"Worldwide Soccer Manager 2009\")  3D Match Engine - This year's match engine has seen more testing than ever before having been extensively beta tested in Football Manager Live for the past year. The famous Football Manager match engine can now be viewed in full 3D with motion(Also known as \"Worldwide Soccer Manager 2009\")  3D Match Engine - This year's match engine has seen more testing than ever before having been extensively beta tested in Football Manager Live for the past year. The famous Football Manager match engine can now be viewed in full 3D with motion captured animations the players. Sports Interactive has been working on the 3D match engine with the support of SEGA Japan’s football development team who provided the motion capture data and some of the animations. You can now watch your matches in 3D from multiple camera angles and re-watch any part of the match by fast forwarding and rewinding the action using a new match time bar that flags the key moments in the game. The old 2d view of the match engine is still there, especially for those people whose computers aren’t powerful enough to take advantage of the 3d views. TV View: Watch your matches in new full screen TV view and customise your match day screen with widgets to view the information you need as a football manager, be it player performance, match action zones, pitch radar, latest scores and many more. Assistant Manager Feedback:  Pre-match and in-match feedback from your Assistant Manager on how the team is performing and your player’s motivation levels, as well as hints on how your tactics are working and how you could outwit the opposition's tactics. [Sega]… Expand"}, {"name": "Call of Duty: World at War", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-world-at-war", "publisher": "Activision", "release_date": "Nov 10 2008", "developers": ["Treyarch"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/931763d9e2c6c62423a9d789f3d86710-98.jpg", "descriptions": "Utilizing the Call of Duty 4: Modern Warfare engine, Call of Duty: World at War throws out the rulebook of war to transform WWII combat through a new enemy, new tactics and an uncensored experience of the climatic battles that gripped a generation. As U.S. Marines and Russian soldiers,Utilizing the Call of Duty 4: Modern Warfare engine, Call of Duty: World at War throws out the rulebook of war to transform WWII combat through a new enemy, new tactics and an uncensored experience of the climatic battles that gripped a generation. As U.S. Marines and Russian soldiers, players employ new features like cooperative gameplay, and weapons such as the flamethrower in the most chaotic and cinematically intense experience to date. Call of Duty: World at War introduces co-operative play, bringing fresh meaning to the \"No One Fights Alone\" mantra with up to four-players online for Xbox 360, PS3 and PC, or two-player local split-screen on consoles. Nintendo Wii will also support a unique co-op mode for two players. For the first time ever players can experience harrowing single-player missions together for greater camaraderie and tactical execution.  The co-op campaign allows players to rank up and unlock perks in competitive multiplayer by completing challenges and earning experience points, adding continuous re-playability and team-based gameplay. Whether playing competitively or cooperatively – if players are online with Call of Duty: World at War – they always gain experience points. Based on a player’s experience rank and rank of the player's friends, Call of Duty: World at War scales dynamically to provide a deeper level of challenge. [Activision]… Expand"}, {"name": "Torchlight", "details_link": "https://www.metacritic.com/game/pc/torchlight", "publisher": "Encore Software, Inc.", "release_date": "Oct 27 2009", "developers": ["Runic Games"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/f4c976dc65d3d3c3313f6705f0c03676-98.jpg", "descriptions": "Ember is the essence of magic and the keystone of alchemy; it lures the restless with promises of power and riches. Miners burrowed deep beneath the dirt streets of Torchlight, discovering veins of the ore richer than any found in living memory- but they were not the first to covet theseEmber is the essence of magic and the keystone of alchemy; it lures the restless with promises of power and riches. Miners burrowed deep beneath the dirt streets of Torchlight, discovering veins of the ore richer than any found in living memory- but they were not the first to covet these mines. The miners from Torchlight broke through into the buried past, a dangerous labyrinth of caverns and ruined civilizations, twisted creatures and the bones of those who came before. Evil bubbles up from the depths and threatens to overrun Torchlight as it has so many others. The heart of a villain has infused the Ember, and his darkness seeps through the veins. [Runic Games]… Expand"}, {"name": "FIFA 19", "details_link": "https://www.metacritic.com/game/playstation-4/fifa-19", "publisher": "Electronic Arts", "release_date": "Sep 25 2018", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 83, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/0/08d4b7c8220ce0ebab6466adb3bd22e4-98.jpg", "descriptions": "EA Sports FIFA 19 delivers a champion-caliber experience on and off the pitch. Introducing the prestigious UEFA Champions League, offering authentic in-match atmospheres, featuring gameplay updates including elevated on-pitch personality and a striking overhaul, and providing new andEA Sports FIFA 19 delivers a champion-caliber experience on and off the pitch. Introducing the prestigious UEFA Champions League, offering authentic in-match atmospheres, featuring gameplay updates including elevated on-pitch personality and a striking overhaul, and providing new and unrivaled ways to play. Champions Rise in FIFA 19.\r Features:\r * UEFA Champions League coming to FIFA 19 -- There's no higher level in club football than the UEFA Champions League. Dreams are achieved and legends are made in this historic tournament that showcases the best clubs in the world. FIFA 19 for the PlayStation 4, Xbox One, PC and Nintendo Switch is infused with the UEFA Champions League, thanks to official match presentation, a variety of tournament experiences that includes the Europa League and Super Cup, and an all-new commentary team in Derek Rae and Lee Dixon.\r * Brand new modes -- Experience the all-new standalone UEFA Champions League mode to play the famous tournament from the group stage to the final at the The Wanda Metropolitano Stadium in Madrid. Discover deep integration of the massive club competition in both Kick Off and Career Mode. Build your dream squad with live UEFA Champions League and Europa League content updates in FIFA 19 Ultimate Team. No matter where or how you play FIFA 19, you can experience the greatest club football competition in the world.… Expand"}, {"name": "Ape Out", "details_link": "https://www.metacritic.com/game/pc/ape-out", "publisher": "Devolver Digital", "release_date": "Feb 28 2019", "developers": ["Gabe Cuzzillo"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 83, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/b593f51df1bff0d0e2f17fecaa06f7f2-98.jpg", "descriptions": "Ape Out is a wildly intense and colorfully stylized smash ‘em up about primal escape, rhythmic violence, and frenetic jazz."}, {"name": "Mortal Kombat X", "details_link": "https://www.metacritic.com/game/playstation-4/mortal-kombat-x", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 14 2015", "developers": ["Warner Bros. Interactive Entertainment", "NetherRealm Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Action", "Fighting", "2D", "3D"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/1ca9b79b18c9ceb6dd89a8af2181c02d-98.jpg", "descriptions": "Mortal Kombat X combines cinematic presentation with all new gameplay to deliver the most brutal Kombat experience ever, offering a new fully-connected experience that launches players into a persistent online contest where every fight matters in a global battle for supremacy.  For the firstMortal Kombat X combines cinematic presentation with all new gameplay to deliver the most brutal Kombat experience ever, offering a new fully-connected experience that launches players into a persistent online contest where every fight matters in a global battle for supremacy.  For the first time, Mortal Kombat X gives players the ability to choose from multiple variations of each character impacting both strategy and fighting style. Players step into an original story showcasing some of the game’s most prolific characters including Scorpion and Sub-Zero, while introducing new challengers that represent the forces of good and evil and tie the tale together.… Expand"}, {"name": "Valdis Story: Abyssal City", "details_link": "https://www.metacritic.com/game/pc/valdis-story-abyssal-city", "publisher": "Endless Fluff", "release_date": "Sep  8 2013", "developers": ["Endless Fluff"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/5b1d55b9ddf6fc928c19f1f0c3adc047-98.jpg", "descriptions": "Valdis Story A.C. is a side scrolling action adventure for P.C. with an emphasis on intricate and rewarding combat as well as deep play style customization. The player will assume the role of Wyatt as they explore the ruins of a holy city that was lost many years ago. Wyatt must battleValdis Story A.C. is a side scrolling action adventure for P.C. with an emphasis on intricate and rewarding combat as well as deep play style customization. The player will assume the role of Wyatt as they explore the ruins of a holy city that was lost many years ago. Wyatt must battle various types of demons, angels, and a new threat tentatively known as Ferals using swordsmanship, martial arts, and sorcery. There are many customizable skills and equipment that will aid Wyatt on his journey.\r Over 40 years ago the Dark Goddess Myrgato attacked and killed her creator, the All Mother Valdis. Since this event Myrgato has been at war with her twin sister the Goddess of Light Alagath. The war has wreaked havoc on the land and the hope of mankind is dwindling as they are forced to choose a side or perish. Wyatt has been following a trail of clues for the past 5 years left by his father that he believes will lead him to find a way to end the Goddess War.\r Features:\r - Intense combat weaving sword and sorcery together seamlessly.\r- Equipment and Customizable skills to fit your own unique fighting style.\r- Unique magic souls that aid in combat and traversing the ruins of the city.\r- Interconnected zones allow you to explore new areas or backtrack.… Expand"}, {"name": "Art Style: PiCTOBiTS", "details_link": "https://www.metacritic.com/game/ds/art-style-pictobits", "publisher": "Nintendo", "release_date": "May 18 2009", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/765392cc68fa4a96b5fa828d306177ec-98.jpg", "descriptions": "[DSiWare; Also known as \"Art Style: PiCOPiCT\"]  Your goal in Art Style: PiCTOBiTS is simple: clear large blocks that fall from above (\"megabits\") by combining them with \"bits\" (square blocks) of the same color. Add in the ability to pick up bits and place them anywhere on the touch screen,[DSiWare; Also known as \"Art Style: PiCOPiCT\"]  Your goal in Art Style: PiCTOBiTS is simple: clear large blocks that fall from above (\"megabits\") by combining them with \"bits\" (square blocks) of the same color. Add in the ability to pick up bits and place them anywhere on the touch screen, and you'll quickly find that strategy is critical to your success. By clearing the bits, you gradually reveal each stage's hidden game character - look for favorites from classic NES titles - and earn coins that can be spent to unlock DARK stages or to listen to the game's soundtrack in MUSIC mode. This grand mix of familiar elements and new game play leads to the uniquely enjoyable experience that is PiCTOBiTS. [Nintendo]… Expand"}, {"name": "Sonic Advance 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/sonic-advance-2", "publisher": "Sega", "release_date": "Mar  9 2003", "developers": ["Dimps Corporation"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/cbeabb219fdf3b6ce9874a37c169030a-98.jpg", "descriptions": "Dr. Eggman is up to his old tricks again, and the world's fastest hedgehog must put a stop to it.  Your favorite characters are back in Sonic's fastest adventure ever.  A new friend named Cream the Rabbit joins Sonic as they embark on a blazingly fast quest to collect Chaos Emeralds andDr. Eggman is up to his old tricks again, and the world's fastest hedgehog must put a stop to it.  Your favorite characters are back in Sonic's fastest adventure ever.  A new friend named Cream the Rabbit joins Sonic as they embark on a blazingly fast quest to collect Chaos Emeralds and thwart Dr. Eggman's nefarious machines.  Evade the obstacles and enemies, unlock secret areas, and uncover the hidden Chaos Emeralds to transform into Super Sonic for the final battle.  With all-new backgrounds and faster speed than ever before, all of the lightning action of Sonic is back.… Expand"}, {"name": "Rayman 3", "details_link": "https://www.metacritic.com/game/game-boy-advance/rayman-3", "publisher": "Ubisoft", "release_date": "Mar  2 2003", "developers": ["Ubisoft"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Rayman 3 maintains the spirit of the series without fail."}, {"name": "NCAA College Basketball 2K3", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-college-basketball-2k3", "publisher": "Sega", "release_date": "Dec  2 2002", "developers": ["Kush Games"], "platforms": "PlayStation 2", "num_players": "1-10 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/fd22741bdf937e2f076aebb32a59f7aa-98.jpg", "descriptions": "Take the reigns of your favorite Division I program and build a modern-day dynasty in Legacy Mode, as you recruit the best crop of young talent throughout the nation. Train your squad to run team-oriented motion offenses, overpower your opponents with high post plays and antagonize teamsTake the reigns of your favorite Division I program and build a modern-day dynasty in Legacy Mode, as you recruit the best crop of young talent throughout the nation. Train your squad to run team-oriented motion offenses, overpower your opponents with high post plays and antagonize teams with aggressive full court presses. You call all the shots, from who's going to redshirt to what kind of zone press your squad runs. Guide your team through an entire season -- tune-up in tough pre-season match-ups in preparation for heated conference play where every game counts. Weekly Top 25 and Rating Percentage Index (R.P.I.) rankings track your progress over the course of the season, including a bubble watch as tourney time draws near. [Sega]… Expand"}, {"name": "Steel Battalion", "details_link": "https://www.metacritic.com/game/xbox/steel-battalion", "publisher": "Capcom", "release_date": "Nov 21 2002", "developers": ["Capcom"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/7a9549a784d4a5479afee22aadf15df5-98.jpg", "descriptions": "Power up your Vertical Tank, and prepare to dominate the online arena. In the midst of a volatile military coup, you must master the inner workings of your VT using the Steel Battalion controller. Up to 10 players can battle head-to-head in team or solo deathmatch games. Complete operationsPower up your Vertical Tank, and prepare to dominate the online arena. In the midst of a volatile military coup, you must master the inner workings of your VT using the Steel Battalion controller. Up to 10 players can battle head-to-head in team or solo deathmatch games. Complete operations in Campaign mode or play free mission games such as Battle Royale, Conquest, or Capture the Container. The military dynamic of the game constantly changes with Xbox Live, making Steel Battalion Online one intense futuristic combat game.… Expand"}, {"name": "XGIII: Extreme G Racing", "details_link": "https://www.metacritic.com/game/gamecube/xgiii-extreme-g-racing", "publisher": "Acclaim", "release_date": "Nov 27 2001", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/141740fc3bb0351b97591b3263be2a7a-98.jpg", "descriptions": "High-speed motorcycle racing and high-stakes futuristic combat collide in X63--an intoxicating, highly addictive arcade experience. Feel every razor sharp turn and roller-coaster drop in the pit of your stomach as you smash through the sound barrier at speeds over 750 mph."}, {"name": "FIFA 2001", "details_link": "https://www.metacritic.com/game/playstation-2/fifa-2001", "publisher": "Electronic Arts", "release_date": "Nov 24 2000", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/cac17078c6079bdcc305456b96f8abca-98.jpg", "descriptions": "For those Americans who can't play \"ISS Pro Evolution 2,\" or for those who absolutely must play as the San Jose Earthquakes, the L.A. Galaxy, or even Arsenal or Liverpool, we have EA's entry into the world of next generation footy."}, {"name": "Crimson Skies", "details_link": "https://www.metacritic.com/game/pc/crimson-skies", "publisher": "Microsoft Game Studios", "release_date": "Sep 17 2000", "developers": ["Zipper Interactive"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Simulation", "Flight", "Sci-Fi", "Futuristic Jet", "Futuristic Jet", "Combat"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/3abd1ab7c9e188d5a96d65dd7dcd82b0-98.jpg", "descriptions": "It's 1937. Air pirates roam the skies over a shattered America. You are Nathan Zachery -- dashing air pirate. Lead a squadron of privateers in thrilling ground-level missions. And romance a bevy of dangerous femme fatales, but be warned -- they can turn on you faster than a Fairchild in aIt's 1937. Air pirates roam the skies over a shattered America. You are Nathan Zachery -- dashing air pirate. Lead a squadron of privateers in thrilling ground-level missions. And romance a bevy of dangerous femme fatales, but be warned -- they can turn on you faster than a Fairchild in a terminal tail spin.  [Microsoft]… Expand"}, {"name": "Professor Layton and the Last Specter", "details_link": "https://www.metacritic.com/game/ds/professor-layton-and-the-last-specter", "publisher": "Nintendo", "release_date": "Oct 18 2011", "developers": ["Level 5"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/db4c6980ae2a2d5713cccb775c219d0f-98.jpg", "descriptions": "Professor Layton and The Devil Flute is the fourth game in the puzzling series."}, {"name": "NBA 2K15", "details_link": "https://www.metacritic.com/game/playstation-4/nba-2k15", "publisher": "2K Sports", "release_date": "Oct  7 2014", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim"], "meta_score": 83, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/b353f9e977b474ac99ea2c282209a29d-98.jpg", "descriptions": "NBA 2K15 features approximately 5,000 new animations, new defensive AI, shooting systems, new team-specific play sets, and more control over rebounding, steals, and blocks. New game broadcast presentation hosted by Ernie Johnson and Shaq O'Neal delivers commentary and analysis to the action."}, {"name": "Katana ZERO", "details_link": "https://www.metacritic.com/game/pc/katana-zero", "publisher": "Adult Swim", "release_date": "Apr 18 2019", "developers": ["Askiisoft"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/1/6db22a5bdfbb86e85b2deec3b3ee5f93-98.jpg", "descriptions": "Slice through time to take back what's rightfully yours in a neo-noir, instant-death action platformer."}, {"name": "Danganronpa 1-2 Reload", "details_link": "https://www.metacritic.com/game/playstation-4/danganronpa-1-2-reload", "publisher": "NIS America", "release_date": "Mar 14 2017", "developers": ["Spike Chunsoft"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/fd85e6fb4518f784ee74484e0d568cf6-98.jpg", "descriptions": "Hope’s Peak Academy — home to the nation’s best and brightest high school students… and your new prison. You and your classmates have been trapped here, forced into a winner-takes-all killing game. You’ll have to solve the mystery of the school to survive, but be careful what you wish for —Hope’s Peak Academy — home to the nation’s best and brightest high school students… and your new prison. You and your classmates have been trapped here, forced into a winner-takes-all killing game. You’ll have to solve the mystery of the school to survive, but be careful what you wish for — sometimes, there’s nothing more deadly than the truth… [Playstation.com]… Expand"}, {"name": "LIMBO", "details_link": "https://www.metacritic.com/game/switch/limbo", "publisher": "PLAYDEAD", "release_date": "Jun 28 2018", "developers": ["PLAYDEAD"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/927ca6e5c1ae1c767a86f40af9f03423-98.jpg", "descriptions": "LIMBO, a black and white puzzle-platforming adventure, puts players in the role of a young boy traveling through an eerie and treacherous world in an attempt to discover the fate of his sister."}, {"name": "Nintendogs: Lab & Friends", "details_link": "https://www.metacritic.com/game/ds/nintendogs-lab-friends", "publisher": "Nintendo", "release_date": "Aug 22 2005", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual Life", "Virtual", "Pet"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/ed1850909dd2dc4549cde1ebc7b1801e-98.jpg", "descriptions": "Players care for and train their puppy by petting it, walking it and buying it supplies to play with. As a puppy competes in obedience and agility trials, owners can win money to purchase other puppy breeds. The pups will vary in gender, coloration and personality. Players purchase one ofPlayers care for and train their puppy by petting it, walking it and buying it supplies to play with. As a puppy competes in obedience and agility trials, owners can win money to purchase other puppy breeds. The pups will vary in gender, coloration and personality. Players purchase one of several breeds available at the beginning, then start spending time with their pup. They throw flying discs and balls to improve the pup’s agility, bathe it when it gets dirty and use their own personal voice commands to train the dog to do tricks. If players train it well enough, they will excel in obedience and agility trials and disc competitions, which will earn money that they can use to buy other supplies and puppy breeds. When players earn enough cash, they can buy even more puppies to live with their original pup. Players can socialize their pups by walking them around the town, where they will meet neighborhood dogs, and maybe even find new toys. Trips to the park and gym offer valuable training time to prepare for agility trials and disc competitions. Over time, the pup's stamina will increase so players can explore farther and farther. Players also can interact wirelessly with their friends' Nintendogs – they can set their DS to bark whenever another puppy is within wireless range. [Nintendo]… Expand"}, {"name": "Xenoblade Chronicles 2", "details_link": "https://www.metacritic.com/game/switch/xenoblade-chronicles-2", "publisher": "Nintendo", "release_date": "Dec  1 2017", "developers": ["Monolith Soft"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/36fc09b91485ae325426808ba7ee5f5f-98.jpg", "descriptions": "Search for the ultimate paradise, Elysium, with your companion, Pyra.\r Explore an endless ocean of clouds, where the last remnants of civilization live on the backs of colossal beasts called Titans. Experience the story of Rex and his new friend, Pyra, a mysterious being known as a BladeSearch for the ultimate paradise, Elysium, with your companion, Pyra.\r Explore an endless ocean of clouds, where the last remnants of civilization live on the backs of colossal beasts called Titans. Experience the story of Rex and his new friend, Pyra, a mysterious being known as a Blade who grants him tremendous power. Together, search for Pyras long lost home Elysium, the ultimate paradise for all of humanity.\r Features:\r *    Explore colossal beasts called Titans, the homes of different civilizations, offering expansive regions to discover. \r*    Form powerful bonds with Blades, unique beings granting tremendous power to their users, called Drivers. \r*    Features a deep battle system that builds on triumphs of the Xenoblade Chronicles and Xenoblade Chronicles X games.… Expand"}, {"name": "Need for Speed Most Wanted", "details_link": "https://www.metacritic.com/game/xbox/need-for-speed-most-wanted", "publisher": "Electronic Arts", "release_date": "Nov 15 2005", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 83, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/1/73d224c13e7c6b6a6cf5d29821bc7d17-98.jpg", "descriptions": "In Need for Speed Most Wanted, you can try to become the most notorious street racer alive. Outrun both racers and cops to increase your reputation and move up the street racing blacklist. You can choose from a variety of vehicle types and destructible urban maps featuring shortcuts,In Need for Speed Most Wanted, you can try to become the most notorious street racer alive. Outrun both racers and cops to increase your reputation and move up the street racing blacklist. You can choose from a variety of vehicle types and destructible urban maps featuring shortcuts, traffic, and patrolling police. Need for Speed Most Wanted also includes online play for challenging other gamers.… Expand"}, {"name": "World of Warcraft: Shadowlands", "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft-shadowlands", "publisher": "Activision", "release_date": "Nov 23 2020", "developers": ["Blizzard Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "Massively Multiplayer", "Board / Card Game"], "meta_score": 83, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/0/e0c771015a46a087c5b1052cd827f799-98.jpg", "descriptions": "Brave The BeyondThe veil between life and death is no more.\nWith a single act of destruction, Sylvanas Windrunner has ripped open the way to the afterlife. Azeroth's staunchest defenders have been dragged into all-consuming darkness. An ancient force of death threatens to break its bondsBrave The BeyondThe veil between life and death is no more.With a single act of destruction, Sylvanas Windrunner has ripped open the way to the afterlife. Azeroth's staunchest defenders have been dragged into all-consuming darkness. An ancient force of death threatens to break its bonds and unravel reality.Hidden realms of wonder and horror await any who would pass to the other side. The Shadowlands is home to an entire realm of the departed; it is a world between worlds whose delicate balance preserves life and death itself.As one of Azeroth's greatest champions, you have been granted the power to cross over in body and soul. Now you must investigate a conspiracy to unmake the cosmos, and help Warcraft legends journey back... or fulfill their ultimate destiny.New WorldThe ShadowlandsWhat lies beyond the world you know? The Shadowlands, resting place for every mortal soulvirtuous or vilethat has ever lived. Journey through planes of torment and imprisonment to those of rebirth and eternal reward.New Player HubOribos, The Undying CityOribos is the arrival point for all souls who enter the Shadowlands. At this crossroads, the dead are judged by the impassive Arbiter before being sent to their final destinations, and Oribos' denizens swap gossip and animasoulstuff that serves as both power and currency. New FeatureCovenantsAlign yourself with one of four Covenantsmysterious sects, each with their own ambition for the Shadowlandsto restore balance to the hereafter.You'll gain access to your Covenant's Sanctum, where you'll accept unique quests, undertake a sprawling covenant campaign, and call upon your allies to embark on important missions. You'll also earn unique abilities based on your Covenant and class, acquire a unique mount and visual appearance, and forge bonds with powerful souls, drawing on their essence to further customize your skills.New Feature - Infinite DungeonTorghast, Tower of the DamnedOnce, the Jailer kept only the most dangerous souls in the cosmos confined in this eternal prison. Now, some of Azeroth's greatest heroes are trapped here, and you'll need to rescue them from the Jailer's tower before he expends their very souls.Torghast is an endlessly replayable, ever-changing dungeon that you can challenge alone or in a group. Your runs will differ each time, but you'll need to explore cautiously. Death comes at a terrible cost. Defeat enough of Torghast's unpredictable challenges, and you'll be rewarded with unique abilities and items to ensure your present survival or bolster your next run. The further you progress, the greater your likelihood of retrieving materials to craft the legendary weapons and armor that will help you restore balance to the Shadowlands.Other secrets lie within the tower but they're yet to be revealed.Game UpdatesLeveled-Up LevelingWorld of Warcraft: Shadowlands will smooth out the leveling experience and better prepare new adventurers for what's to come. Players will level up to 50 before heading to the Shadowlands (new level cap: 60). We've adjusted the experience curve to make it faster than ever to prepare for the newest challenges, and each level along the way will provide more meaningful increases in progress and power. All expansion zones are getting more flexible, too; they'll be able* to scale to you and your friends while you level to 50, so it's easy to try a zone you've never played.*You can still outlevel dungeons and crush them for transmogs or fulfillment.… Expand"}, {"name": "WRC 9 FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/xbox-one/wrc-9-fia-world-rally-championship", "publisher": "Nacon", "release_date": "Sep  4 2020", "developers": ["KT Racing"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 83, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/5/3de70614f14294faad2a7d0c8826f1c7-98.jpg", "descriptions": "The WRC license is back and even better this year with WRC 9. Take part in the Calendar's 3 new rallies and challenge the community with the customisable league system. Then dive into the skin of a co-driver with the astonishing co-op mode."}, {"name": "Madden NFL 16", "details_link": "https://www.metacritic.com/game/playstation-4/madden-nfl-16", "publisher": "EA Sports", "release_date": "Aug 25 2015", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Football", "Sim", "Team"], "meta_score": 83, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/5baf3ae4029d1c1ad61152efac85761b-98.jpg", "descriptions": "Whether playing alone or online, your mission to build an NFL dynasty begins with Connected Franchise. Interact and build your team with more control with Game Prep. Want to develop your backup QB? Between matchups, spend extra time on him each week to earn training points without having toWhether playing alone or online, your mission to build an NFL dynasty begins with Connected Franchise. Interact and build your team with more control with Game Prep. Want to develop your backup QB? Between matchups, spend extra time on him each week to earn training points without having to force him into the real games before he is ready. Build your teams' confidence through performance and front office transactions. Balance keeping player's confidence up, to increase abilities and build player XP. … Expand"}, {"name": "RACE 07: Official WTCC Game", "details_link": "https://www.metacritic.com/game/pc/race-07-official-wtcc-game", "publisher": "Viva Media", "release_date": "Oct  9 2007", "developers": ["SimBin"], "platforms": "PC", "num_players": "24  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 83, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/674739787c11a870435ad1f429b8f64b-98.jpg", "descriptions": "Real Cars. Real Racing. 300 Cars on 32 Tracks. Thats what it's all about in RACE 07.  Enjoy 9 different racing classes, each with its own distinctive character.  From the prestigious World Touring Car Championship to the insance speed of the F3000 class.  These are just a few of the manyReal Cars. Real Racing. 300 Cars on 32 Tracks. Thats what it's all about in RACE 07.  Enjoy 9 different racing classes, each with its own distinctive character.  From the prestigious World Touring Car Championship to the insance speed of the F3000 class.  These are just a few of the many cars and the classes featured in this ultimate racing curcuits or city tracks and see the track through the unique Helmet Camera or with the immersive Action Camera.  Enjoy RACE 07 and esperience virtural racing like you've never expereinced it before. [Viva Media]… Expand"}, {"name": "Beacon Pines", "details_link": "https://www.metacritic.com/game/pc/beacon-pines", "publisher": "Fellow Traveller", "release_date": "Sep 22 2022", "developers": ["Hiding Spot"], "platforms": ["Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/d3bc80451eb1cc1cbdf06eca8c3e60ff-98.jpg", "descriptions": "Beacon Pines is a cute and creepy adventure set within a mysterious book. You play as both the reader of the book and its main character, Luka.Something strange is happening at the old warehouse, and Luka and his friends seem to be the only ones taking notice. Sneak out late, make newBeacon Pines is a cute and creepy adventure set within a mysterious book. You play as both the reader of the book and its main character, Luka.Something strange is happening at the old warehouse, and Luka and his friends seem to be the only ones taking notice. Sneak out late, make new friends, uncover hidden truths, and collect words that will change the course of fate!As the book's reader, you'll navigate the story's turning points using The Chronicle: an interactive story tree that branches and grows along with your choices. Exploring one set of events can unlock new charms to use on another branch, leading you to jump back and forth between entirely different versions of the story in order to unravel the mysteries at the heart of Beacon Pines.… Expand"}, {"name": "Record of Lodoss War: Deedlit in Wonder Labyrinth", "details_link": "https://www.metacritic.com/game/switch/record-of-lodoss-war-deedlit-in-wonder-labyrinth", "publisher": "Playism", "release_date": "Jan 28 2022", "developers": ["WSS Playground", "Team Ladybug"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/14ced404ae827814fb5328c5a10cf616-98.jpg", "descriptions": "Deedlit awakens suddenly in a mysterious, unknown place.Where am I? Why am I here?\n\nWith nobody around to respond, her questions are met with only silence.\n\nSeeking answers, Deed eventually sets off on foot, alone...\n\nRecord of Lodoss War-Deedlit in Wonder Labyrinth is a 2D actionDeedlit awakens suddenly in a mysterious, unknown place.Where am I? Why am I here?With nobody around to respond, her questions are met with only silence.Seeking answers, Deed eventually sets off on foot, alone...Record of Lodoss War-Deedlit in Wonder Labyrinth is a 2D action adventure game based on Record of Lodoss War. Immerse yourself in the gorgeous pixel animations, use a variety of weapons and the power of elemental spirits on your journey to solve the arcane mysteries of the labyrinth.… Expand"}, {"name": "Shadow Tactics: Blades of the Shogun - Aiko's Choice", "details_link": "https://www.metacritic.com/game/pc/shadow-tactics-blades-of-the-shogun---aikos-choice", "publisher": "Daedalic Entertainment", "release_date": "Dec  6 2021", "developers": ["Mimimi Games"], "platforms": "PC", "num_players": "", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/f8b7c66283e5361df95b7d03c1cdca92-98.jpg", "descriptions": "Set in Japan around the early Edo period, Aiko's Choice is a stealth strategy game that takes place within the story of Shadow Tactics: Blades of the Shogun. The expansion focuses on one of the main game's protagonists: the kunoichi adept Aiko. She is a master of camouflage and distractsSet in Japan around the early Edo period, Aiko's Choice is a stealth strategy game that takes place within the story of Shadow Tactics: Blades of the Shogun. The expansion focuses on one of the main game's protagonists: the kunoichi adept Aiko. She is a master of camouflage and distracts enemies disguised as a Geisha.Although Aiko was certain that she left her old life behind her, Aiko's former sensei, the cunning spymaster Lady Chiyo, reappears from the shadows to challenge her. Together with her deadly companions she sets out to hunt down the ghosts of her past...… Expand"}, {"name": "Spiritfarer", "details_link": "https://www.metacritic.com/game/playstation-4/spiritfarer", "publisher": "Thunder Lotus Games", "release_date": "Aug 18 2020", "developers": ["Thunder Lotus Games"], "platforms": ["iPhone/iPad", "PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/601044094c664dfe2375d877ce56b641-98.jpg", "descriptions": "A cozy management game about dying. \r\rWhat will you leave behind?\rPlay as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. \r\n\rA unique, endlessly varied adventure!A cozy management game about dying. \r\rWhat will you leave behind?\rPlay as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. \r\rA unique, endlessly varied adventure!\rFarm, mine, fish, harvest, cook, and craft your way across mystical seas. Unwind for hours into cozy and relaxing gameplay. Join the adventure as Daffodil the cat, in two-player cooperative play.\r Learn how to say goodbye.\rExperience moving, emotional stories filled with unforgettable moments. Spend relaxing quality time with your spirit passengers, create lasting memories, and, ultimately, learn how to say goodbye to your cherished friends. What will you leave behind?… Expand"}, {"name": "Freedom Planet", "details_link": "https://www.metacritic.com/game/pc/freedom-planet", "publisher": "GalaxyTrail", "release_date": "Jul 21 2014", "developers": ["GalaxyTrail"], "platforms": ["PlayStation 4", "Switch", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/1eb467cfde86feb2747503bdd9d5ad62-98.jpg", "descriptions": "Fight your way across the celestial world of Avalice where cats are green, motorcycles drive up walls and monster girls do most of the buttkicking! Freedom Planet is a cartoony, combat-based platform adventure that pits a spunky dragonoid and her friends against an alien attack force."}]