[{"name": "Weapon Shop de Omasse", "details_link": "https://www.metacritic.com/game/3ds/weapon-shop-de-omasse", "publisher": "Level 5", "release_date": "Feb 20 2014", "developers": ["Nex Entertainment"], "platforms": "3DS", "genres": ["Role-Playing", "General"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/4504322910c345733965b30152ec6436-98.jpg", "descriptions": "Groove along to the beats of the hammer falls, tapping your Nintendo 3DS Touch Screen to the rhythm in order to forge your shop's weapons. The higher your CHAIN, the stronger and sharper the weapon will turn out. Any blacksmith worth his steel also knows that you have to strike while theGroove along to the beats of the hammer falls, tapping your Nintendo 3DS Touch Screen to the rhythm in order to forge your shop's weapons. The higher your CHAIN, the stronger and sharper the weapon will turn out. Any blacksmith worth his steel also knows that you have to strike while the iron is hot. Make sure to watch the weapon's temperature, which will affect its critical hit rate, durability, and special properties. [Level-5]… Expand"}, {"name": "Jagged Alliance: Crossfire", "details_link": "https://www.metacritic.com/game/pc/jagged-alliance-crossfire", "publisher": "Kalypso", "release_date": "Aug 24 2012", "developers": ["Kalypso"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "Modern", "Modern"], "meta_score": 63, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/9a2a2b34b90c97de1216a9a2013f6fa7-98.jpg", "descriptions": "Jagged Alliance: Crossfire is a stand-alone expansion to the hit tactical RPG  Jagged Alliance: Back in Action that adds new mercenaries, new environments, and new weapons."}, {"name": "The Tiny Bang Story", "details_link": "https://www.metacritic.com/game/pc/the-tiny-bang-story", "publisher": "Colibri Games", "release_date": "Apr 22 2011", "developers": ["Colibri Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 63, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/e432f36ff393ee3c4f5c75d5cd5fee2b-98.jpg", "descriptions": "The Tiny Bang Story is set on the fictitious world, Tiny Planet. When an asteroid hits, its fragile world breaks into pieces. You'll have to recover its lost beauty and help the population of Tiny Planet. Through five chapters, you'll solve numerous puzzles and fix imaginative machines in aThe Tiny Bang Story is set on the fictitious world, Tiny Planet. When an asteroid hits, its fragile world breaks into pieces. You'll have to recover its lost beauty and help the population of Tiny Planet. Through five chapters, you'll solve numerous puzzles and fix imaginative machines in a point & click environment.… Expand"}, {"name": "The UnderGarden", "details_link": "https://www.metacritic.com/game/playstation-3/the-undergarden", "publisher": "Atari", "release_date": "Feb  1 2011", "developers": ["Vitamin G Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 63, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/9a3e46651659db2f8fb18b1025b5ff01-98.jpg", "descriptions": "The UnderGarden is a casual zen-like game that challenges players to explore beautiful underground caverns filled with strange life forms; physics based puzzles and plenty of hidden secrets. The world comes alive and music evolves as players get deeper into the world of The UnderGarden. WithThe UnderGarden is a casual zen-like game that challenges players to explore beautiful underground caverns filled with strange life forms; physics based puzzles and plenty of hidden secrets. The world comes alive and music evolves as players get deeper into the world of The UnderGarden. With local co-operative gameplay, players can chill out,work together to solve puzzles and explore the world. The UnderGarden offers 20 different levels of modern exploration filled with brain teasing physics and eco-friendly puzzles that evoke an emotional response to the beauty and calm of this underwater oasis.… Expand"}, {"name": "Drakengard", "details_link": "https://www.metacritic.com/game/playstation-2/drakengard", "publisher": "Square Enix", "release_date": "Mar  2 2004", "developers": ["Cavia Inc."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 63, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/98464461247e50ee4630529c52e91251-98.jpg", "descriptions": "Conflict has erupted between the Empire and the Union. The Empire, once part of the Union itself, has forsaken peace and accumulated awesome power in a surprisingly short time. Caim, a Union warrior and former prince of a small kingdom destroyed by the Empire, has received word that hisConflict has erupted between the Empire and the Union. The Empire, once part of the Union itself, has forsaken peace and accumulated awesome power in a surprisingly short time. Caim, a Union warrior and former prince of a small kingdom destroyed by the Empire, has received word that his castle is under attack. To make matters worse, his sister, Furiae, is still trapped within its walls. In an effort to save her, Caim manages to infiltrate the castle gates, but is mortally wounded in the battle. Slowly dying from his wounds, Caim comes upon a captured red dragon that also lies on the brink of death. Desperate to survive and continue his battle with the hated Empire, Caim decides to enter a pact with thedragon. By nature, the dragon herself is a proud beast that is unwilling to cooperate with humans, but she, too, has no choice but to accept Caims offer in order to live. The pact is a bitter compromise, as it requires the human partner to sacrifice some part of his or her body; the price for Caim is the power of speech. But the instant Caim joins souls with the dragon, the two pactpartners are given new life, and become bound together until death. With his strength restored, Caim rescues Furiae and sends her away to safety with a childhood friend, Inuart. Caim and the dragon then begin their quest to unravel the mystery behind the Empires sudden rise to power.… Expand"}, {"name": "Batman: Rise of Sin Tzu", "details_link": "https://www.metacritic.com/game/playstation-2/batman-rise-of-sin-tzu", "publisher": "Ubisoft", "release_date": "Oct 16 2003", "developers": ["Ubisoft Montreal"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 63, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/f1179df17e4eae3d358a41f13bef4f8a-98.jpg", "descriptions": "Batman faces a new enemy. Unlike any he has ever faced before. The faceless foe plunges Gotham City into chaos on the night of the anniversary of Bruce Wayne's parents' murder. Who is responsible for unleashing havoc on Gotham City? The truth will be revealed. A Brand-new Villain for theBatman faces a new enemy. Unlike any he has ever faced before. The faceless foe plunges Gotham City into chaos on the night of the anniversary of Bruce Wayne's parents' murder. Who is responsible for unleashing havoc on Gotham City? The truth will be revealed. A Brand-new Villain for the Batman Univers: Sin Tzu, cunning master of strategy and martial arts, makes history as the first Batman character to debut in a video game. Battle the evil forces of Gotham City by yourself or with a friend. Two Players can fight the forces of evil as the Dynamic Duo, Batman and Robin; or choose to control Nightwing or Batgirl! Battle Batman's most infamous enemies including Bane, Clayface, Scarecrow and the new formidable foe - Sin Tzu, all appearing for the first time in a videogame. Utilize Batman's arsenal such as the Batarang, Grappling Hook, and Smoke Bombs. Topple Sin Tzu's soldiers of crime with more than 35 martial arts moves and combos. 12 Levels: Defend Gotham City through the Gotham City Docks, Crime Alley, and Arkham Asylum. [Ubi Soft]… Expand"}, {"name": "Rally Championship", "details_link": "https://www.metacritic.com/game/gamecube/rally-championship", "publisher": "Conspiracy Entertainment", "release_date": "Jul 30 2003", "developers": ["SCi"], "platforms": "GameCube", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/094cef8aaff1388d087ffc4445e7f865-98.jpg", "descriptions": "If you've been waiting for a great rally racing game to come to the GameCube, keep waiting. Rally Championship isn't it."}, {"name": "Evolution Worlds", "details_link": "https://www.metacritic.com/game/gamecube/evolution-worlds", "publisher": "Ubisoft", "release_date": "Dec  2 2002", "developers": ["Sting"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 63, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/5672c03b1e976e31661bb95914e50f6e-98.jpg", "descriptions": "Deep within the ruins of Evolutia, an ancient technology waits to be uncovered. Two heroes set out to find this power, only to fall into an epic struggle with the Army of the 8th Empire."}, {"name": "No Escape (2000)", "details_link": "https://www.metacritic.com/game/pc/no-escape-2000", "publisher": "Funcom", "release_date": "Nov 30 2000", "developers": ["Funcom"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Action", "General", "General"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/063a738aac74647ed7f40e1fd10d5541-98.jpg", "descriptions": "No Escape is the biggest, coolest, most popular TV show ever. Transmitted live from a gigantic studio aboard an orbiting space station -- and watched by billions. No Escape features up to eight skilled contestants battling each other on tiny, artificial planets created specifically for theNo Escape is the biggest, coolest, most popular TV show ever. Transmitted live from a gigantic studio aboard an orbiting space station -- and watched by billions. No Escape features up to eight skilled contestants battling each other on tiny, artificial planets created specifically for the show.  [Funcom]… Expand"}, {"name": "Goat Simulator", "details_link": "https://www.metacritic.com/game/pc/goat-simulator", "publisher": "Coffee Stain Studios", "release_date": "Apr  1 2014", "developers": ["Coffee Stain Studios"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Simulation", "General"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/6fc4b8bb4e1fc2af800e6791d632d1d1-98.jpg", "descriptions": "Goat Simulator is the latest in goat simulation technology, bringing next-gen goat simulation to YOU. You no longer have to fantasize about being a goat, your dreams have finally been realized!"}, {"name": "Islands of Wakfu", "details_link": "https://www.metacritic.com/game/xbox-360/islands-of-wakfu", "publisher": "Microsoft Game Studios", "release_date": "Mar 30 2011", "developers": ["Ankama Games"], "platforms": "Xbox 360", "genres": ["Role-Playing", "Action Adventure", "Fantasy", "Massively Multiplayer Online", "General", "Fantasy", "Fantasy"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/4f8c1d0cda349eec70ca0e557b8cd759-98.jpg", "descriptions": "Islands of WAKFU is an adventure, action and fighting game for the 360."}, {"name": "ModNation Racers: Road Trip", "details_link": "https://www.metacritic.com/game/playstation-vita/modnation-racers-road-trip", "publisher": "SCEA", "release_date": "Feb  7 2012", "developers": ["SCEA"], "platforms": "PlayStation Vita", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/eb4dd8b99b2504ad7747000f9c5df45b-98.jpg", "descriptions": "Welcome to the never-ending season of ModNation kart racing, where creativity rules on and off the track. Get on the starting grid of nearly 500,000 tracks available online or just race in our competitive circuit and compete with new dual analog stick racing and three new weapon classes. AndWelcome to the never-ending season of ModNation kart racing, where creativity rules on and off the track. Get on the starting grid of nearly 500,000 tracks available online or just race in our competitive circuit and compete with new dual analog stick racing and three new weapon classes. And with the new touch controls, you can create a new track in seconds and share it with the rest of the world. Get ready to take on the challenge of 20+ new tracks filled with 3 new weapon classes (Fire, Ice, Earth) for your Kart's offensive arsenal. Introducing ModTraveler & ModMiles - Keep connected on the road by photographing your Mod's in exotic locations or earning miles while racing MNR tracks away from home, both of which will unlock rare and unique items to add to your collection. Race track design in under a minute - Access all the new touch-create tools and design, decorate and customize your own tracks for everyone to play in record time. [Sony]… Expand"}, {"name": "Etherborn", "details_link": "https://www.metacritic.com/game/switch/etherborn", "publisher": "Akupara Games", "release_date": "Jul 18 2019", "developers": ["Altered Matter"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "Platformer", "First-Person", "Third-Person", "3D"], "meta_score": 62, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/26f6aca2ce468e5e7ddc017d7bed01c5-98.jpg", "descriptions": "Etherborn is an elegant leap in the gravity-puzzle genre; an environmental puzzle platformer built on exploring and understanding gravity-shifting structures. You are a voiceless being that has just been born into a world where a bodiless voice awaits your arrival. As your first thoughtsEtherborn is an elegant leap in the gravity-puzzle genre; an environmental puzzle platformer built on exploring and understanding gravity-shifting structures. You are a voiceless being that has just been born into a world where a bodiless voice awaits your arrival. As your first thoughts emerge, you realise your journey has just begun. You must reach this ethereal voice to fully understand your own existence. In this world, the laws of physics behave in a way that will bend your imagination. You experience gravity perpendicular to the surface you are standing on, allowing for creative exploration possibilities in environments carefully crafted as navigation-based puzzles. Travel through beautiful and exotic sceneries where each level is an organic puzzle that you need to explore, manipulate and shift your gravity on in order to decipher the way forward.… Expand"}, {"name": "Legend of the Guardians: The Owls of Ga'Hoole", "details_link": "https://www.metacritic.com/game/playstation-3/legend-of-the-guardians-the-owls-of-gahoole", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 14 2010", "developers": ["Krome Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 62, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/63a7242a1e12418b31e61bb3649f6754-98.jpg", "descriptions": "The game invites kids and fans of the film and the popular Guardians of Ga'Hoole book series to join an unlikely band of heroes as they take on the role of a Guardian, a winged warrior and protector of the owl world, in an epic story of good versus evil. Legend of the Guardians: The Owls ofThe game invites kids and fans of the film and the popular Guardians of Ga'Hoole book series to join an unlikely band of heroes as they take on the role of a Guardian, a winged warrior and protector of the owl world, in an epic story of good versus evil. Legend of the Guardians: The Owls of Ga'Hoole - The Videogame allows players to customize and control their owl on a thrilling journey across mythic terrains… Expand"}, {"name": "F1 2014", "details_link": "https://www.metacritic.com/game/playstation-3/f1-2014", "publisher": "Codemasters", "release_date": "Oct 21 2014", "developers": ["Codemasters Birmingham"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Automobile"], "meta_score": 62, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/7/084843220d5d361f3ac268521394839c-98.jpg", "descriptions": "An alternative to the Young Driver Test in-game is a new driver evaluation system. Players are launched right into a one lap race when they load F1 2014 for the first time, and the game then suggests an appropriate difficulty level."}, {"name": "Daymare: 1998", "details_link": "https://www.metacritic.com/game/pc/daymare-1998", "publisher": "Invader Studios", "release_date": "Sep 17 2019", "developers": ["Invader Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/5bff8fd020476da30004398587052aa3-98.jpg", "descriptions": "Daymare: 1998 is a third person survival horror game with over the shoulder camera, developed in Unreal Engine 4 for Windows PC. The game features high-end graphics, original soundtrack, immersive atmosphere, hardcore survival mechanics and many connections with the beloved old schoolDaymare: 1998 is a third person survival horror game with over the shoulder camera, developed in Unreal Engine 4 for Windows PC. The game features high-end graphics, original soundtrack, immersive atmosphere, hardcore survival mechanics and many connections with the beloved old school survival horror games and '90s landmark brands.… Expand"}, {"name": "Take On Mars", "details_link": "https://www.metacritic.com/game/pc/take-on-mars", "publisher": "Bohemia Interactive", "release_date": "Aug  1 2013", "developers": ["Bohemia Interactive"], "platforms": "PC", "genres": ["Sci-Fi", "Small Spaceship", "Simulation", "Space", "Combat"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/22a5c2043044094c5fcde289e7115f8b-98.jpg", "descriptions": "Take On Mars places you in the seat of a Rover Operator, allowing you to control the various, fully simulated mobile Rovers and stationary Landers. With this scientific arsenal at your disposal, you will work your way through the numerous Science Missions in each location, unlocking theTake On Mars places you in the seat of a Rover Operator, allowing you to control the various, fully simulated mobile Rovers and stationary Landers. With this scientific arsenal at your disposal, you will work your way through the numerous Science Missions in each location, unlocking the secrets of Mars' distant past.… Expand"}, {"name": "Astria Ascending", "details_link": "https://www.metacritic.com/game/switch/astria-ascending", "publisher": "Dear Villagers", "release_date": "Sep 30 2021", "developers": ["Artisan Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/fd9b2980b4d2fa3b73bf122785e821ab-98.jpg", "descriptions": "Explore a vast world on the brink of chaos in a mature, emotional JRPG. Experience an epic story with rewarding, turn-based combat and expansive customization rendered in glorious 4K hand-drawn visuals."}, {"name": "HYPERGUN", "details_link": "https://www.metacritic.com/game/pc/hypergun", "publisher": "NVYVE Studios", "release_date": "Aug 23 2018", "developers": ["NVYVE Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 62, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/2/6f5c361f2297b4d8e3b08850e964fd3c-98.jpg", "descriptions": "Fight through waves of alien interlopers and save the world as Dewey Owens in HYPERGUN, a fast-paced roguelite shooter centering around a procedural weapon of questionable effectiveness. Enter the simulation. Build the HYPERGUN!"}, {"name": "River City: Knights of Justice", "details_link": "https://www.metacritic.com/game/3ds/river-city-knights-of-justice", "publisher": "Natsume", "release_date": "Jun 20 2017", "developers": ["Million", "Avit-Niigata"], "platforms": "3DS", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/20fb813acfe576b730e96311f6378c70-98.jpg", "descriptions": "The magical land of Riverandia is in a state of turmoil!Several years have passed since the rainbow-colored Crystal Tower was suddenly enveloped in darkness. With the world plunged into horror and chaos, a legend began to spread amongst the people about a savior who would come to save theThe magical land of Riverandia is in a state of turmoil!Several years have passed since the rainbow-colored Crystal Tower was suddenly enveloped in darkness. With the world plunged into horror and chaos, a legend began to spread amongst the people about a savior who would come to save the world. Then, one day, a lone knight appeared. His name: Alexander Valford.Kunio and his friends go medieval in River City: Knights of Justice! This unique entry to the River City series sees Kunio and his friends and foes transformed into heroes and villains that would be at home in any RPG! Use swords, staves, and even magic to bring peace back to Riverandia!Featuring:- Multiple Allies!- Over 100 Quests!- Multiple Story Paths!… Expand"}, {"name": "BRAWL", "details_link": "https://www.metacritic.com/game/playstation-4/brawl", "publisher": "Bloober Team", "release_date": "Apr 24 2015", "developers": ["Bloober Team"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Arcade"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/7462f328a90984cab361d98220b812d0-98.jpg", "descriptions": "It’s a horror-themed party game for up to four players. The game mixes well-known gameplay (you try to blow up your opponents with strategically placed bombs) with MOBA elements. There are eight characters, each with unique skillset. The easiest way to learn which character is best suited toIt’s a horror-themed party game for up to four players. The game mixes well-known gameplay (you try to blow up your opponents with strategically placed bombs) with MOBA elements. There are eight characters, each with unique skillset. The easiest way to learn which character is best suited to your style is to play through the story mode that serves as a tutorial. BRAWL is mainly a party game and as such it features five local multiplayer modes, two online only, and two modes that can be played by one or two players in cooperation.… Expand"}, {"name": "Buzz Aldrin's Space Program Manager", "details_link": "https://www.metacritic.com/game/pc/buzz-aldrins-space-program-manager", "publisher": "Slitherine", "release_date": "Oct 31 2014", "developers": ["Slitherine", "Slitherine Group", "Polar Motion"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "Turn-Based", "3D", "Sci-Fi", "Third-Person", "General"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/5e98f8ce1f40bdbdcb261e2d3268e93d-98.jpg", "descriptions": "It is the mid 1950s and the race for dominance between the US and the Soviet Union is about to move into a new dimension: space. Take charge of the US or Soviet space agencies - your duty is be the first to the moon. Carefully manage your budget by opening programs, spending R&D funds onIt is the mid 1950s and the race for dominance between the US and the Soviet Union is about to move into a new dimension: space. Take charge of the US or Soviet space agencies - your duty is be the first to the moon. Carefully manage your budget by opening programs, spending R&D funds on improving the hardware, recruiting personnel and launching space missions in this realistic turn based strategy game.In campaign mode, you will be able to play as the Director of either NASA or the Soviet Space Agency in order to beat the other side to be the first on the Moon. You can also lead the Global Space Agency (GSA), a fictional space agency that combines programs from all the major space agencies in the world. Alternatively, all three space agencies feature a Sandbox mode, which provides a more open-ended experience and allows you to try out different approaches without any political pressure.… Expand"}, {"name": "Combat Mission: Shock Force", "details_link": "https://www.metacritic.com/game/pc/combat-mission-shock-force", "publisher": "Paradox Interactive", "release_date": "Aug 22 2007", "developers": ["Big Time Software"], "platforms": "PC", "num_players": "2  Online", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "General"], "meta_score": 62, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/7/611f07c91ccaeed951a0b766c75b2776-98.jpg", "descriptions": "At it's core, Combat Mission: Shock Force is a military simulation depicting a hypothetical near-future conflict in Syria following a fundamentalist coup d’état. As in Afghanistan 2001, the radical new government's refusal to shut down major terrorist organizations and its' regionalAt it's core, Combat Mission: Shock Force is a military simulation depicting a hypothetical near-future conflict in Syria following a fundamentalist coup d’état. As in Afghanistan 2001, the radical new government's refusal to shut down major terrorist organizations and its' regional destabilizing effect, compel NATO Coalition forces into action. The initial release of Combat Mission: Shock Force focuses on the actions of the US Stryker Brigade Combat Teams (SBCT) and Heavy Brigade Combat Teams (HBCT) as they fight against Syrian Army Infantry, Mechanized and Armored units. Combat Mission: Shock Force also features Unconventional Threat forces such as terrorists, spies, suicide bombers, IED's and other deadly tools employed in the asymmetric warfare of the modern day. Along with the standard Red vs. Blue engagements typified in most wargames, Combat Mission: Shock Force will also allow players to fight Red vs. Red (Syria vs. Syria) and Blue vs. Blue (NATO vs. NATO) battles as well. [Battlefront.com]… Expand"}, {"name": "Heroes Over Europe", "details_link": "https://www.metacritic.com/game/playstation-3/heroes-over-europe", "publisher": "Ubisoft", "release_date": "Sep 15 2009", "developers": ["Atari", "Transmission Games", "Atari SA"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 62, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/2c4c75b4cfb2e2b6d4d506edf1424c50-98.jpg", "descriptions": "Developed by Transmission Games in Melbourne, Australia, and powered by an all-new engine, Heroes Over Europe promises to raise the bar for flight combat games with the all new \"Ace Kill\" close combat action, four online modes supporting up to 16 players and fully customizable aircrafts withDeveloped by Transmission Games in Melbourne, Australia, and powered by an all-new engine, Heroes Over Europe promises to raise the bar for flight combat games with the all new \"Ace Kill\" close combat action, four online modes supporting up to 16 players and fully customizable aircrafts with localized damage. Visually, the game takes no prisoners with meticulously rendered environments including faithful recreations of London, Berlin and the French Alps, and ultra-realistic iconic warplanes of the era, all presented in stunning high definition graphics. [Ubisoft]… Expand"}, {"name": "Inferno Pool", "details_link": "https://www.metacritic.com/game/xbox-360/inferno-pool", "publisher": "Dark Energy Digital", "release_date": "Oct 28 2009", "developers": ["Dark Energy Digital"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/49ce466ac592bdb87d953ef785cd03f2-98.jpg", "descriptions": "[Xbox Live Arcade]  Multiplayer mayhem awaits for up to four local or online players, in a race to clear the most balls from your table in Inferno Pool. Pot balls to fire at opponents, or stockpile balls to unleash an onslaught. Master Jump Shots, Combos, Bank Shots, Kick Shots, and build[Xbox Live Arcade]  Multiplayer mayhem awaits for up to four local or online players, in a race to clear the most balls from your table in Inferno Pool. Pot balls to fire at opponents, or stockpile balls to unleash an onslaught. Master Jump Shots, Combos, Bank Shots, Kick Shots, and build your multiplier with an unbroken potting streak to unleash the devastating Inferno Mode. Alliances will be formed, friends will be betrayed, and the battle isn't over until the stat screen appears. Includes the challenging Endurance Mode, an Inferno-fuelled battle to survive against the clock and post a world-beating time. The game also includes classic pool modes for one or two local or online players. [Dark Energy Digital]… Expand"}, {"name": "Conflict: Global Terror", "details_link": "https://www.metacritic.com/game/xbox/conflict-global-terror", "publisher": "2K Games", "release_date": "Oct  4 2005", "developers": ["Pivotal Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 62, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/c0a3b4a4ec22faaab666fca9f6c61e47-98.jpg", "descriptions": "In Conflict: Global Terror, you can try to recover a team member who has gone MIA at the hands of the terrorist organization March 33. You join a five man counter-terrorism team dispatched to stop the terrorists from creating a new world order. You can assume the role of any of the teamIn Conflict: Global Terror, you can try to recover a team member who has gone MIA at the hands of the terrorist organization March 33. You join a five man counter-terrorism team dispatched to stop the terrorists from creating a new world order. You can assume the role of any of the team members during a mission and use their unique abilities and weapons to fight the enemy. Global Terror adds improved physics, better AI, and an improved aiming system.… Expand"}, {"name": "Warface", "details_link": "https://www.metacritic.com/game/pc/warface", "publisher": "Crytek", "release_date": "Oct 21 2013", "developers": ["Crytek"], "platforms": ["PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 62, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/6/311b3a1c9216f16dd7fcc5bbc3afdf94-98.jpg", "descriptions": "Warface gives you extensive and addictive multiplayer options. A vast and constantly updated PVE universe complete with dramatic co-op missions that reward teamwork and individual skill, and a full set of class-based PVP games for unmatched competitive play."}, {"name": "The Sundew", "details_link": "https://www.metacritic.com/game/pc/the-sundew", "publisher": "2054 Games", "release_date": "Oct 14 2021", "developers": ["2054 Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/e140ff2c5ac042eb7d4d350de636b2a4-98.jpg", "descriptions": "Shibukawa, capital of Japan, 2054. Water drips from the cracked ceiling onto the edge of your bed as the incessant rain masks the whine of a refrigerator and the neon hum of the city outside. You don't recognise the heavy breath in your ear nor the warmth of the body lying next to you...Shibukawa, capital of Japan, 2054. Water drips from the cracked ceiling onto the edge of your bed as the incessant rain masks the whine of a refrigerator and the neon hum of the city outside. You don't recognise the heavy breath in your ear nor the warmth of the body lying next to you...The world's gone to hell, and it's taking you down with it.Welcome to Shibukawa. You are Anna Isobe, a cybernetically enhanced cop in a world that's left you behind. Once a shining hope for the future, cyborgs have become taboo, replaced by drones and automata that make even your heightened abilities obsolete. Stuck in a thankless job surrounded by indifferent eyes you still have a duty to protect and serve, and that's just what you're going to do.The Sundew is a dark adventure game set in the aftermath of a devastating future war, where the world as we know it was twisted by flames into a terrifying new dystopia. What begins as a normal day quickly becomes something else, and soon a lonely beat cop will hold the fate of the world in her hands.… Expand"}, {"name": "Groundhog Day: Like Father Like Son", "details_link": "https://www.metacritic.com/game/playstation-4/groundhog-day-like-father-like-son", "publisher": "Sony Pictures Virtual Reality", "release_date": "Sep 17 2019", "developers": ["Tequila Works", "Sony Pictures Virtual Reality"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 62, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/984040a7360ce296be7682270f55a5c0-98.jpg", "descriptions": "You’re stuck in a time loop as Phil Connors, Jr., back in Punxsutawney for Groundhog Day in this virtual reality sequel to the iconic hit movie. Don’t worry, Ned will show you the way. But watch that first step — it’s a doozy! So why don’t you stay here a while?"}, {"name": "NBA 2K Playgrounds 2", "details_link": "https://www.metacritic.com/game/xbox-one/nba-2k-playgrounds-2", "publisher": "2K Games", "release_date": "Oct 16 2018", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Basketball", "Arcade"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/16897fbda8a10ffd9d78bc8904c00453-98.jpg", "descriptions": "NBA arcade action is back with NBA 2K Playgrounds 2. The sequel takes street balling to the next level with an expansive roster of current and retired NBA players, improved online matchmaking with dedicated servers, four-player online matches, three-point contests, new playgrounds, customNBA arcade action is back with NBA 2K Playgrounds 2. The sequel takes street balling to the next level with an expansive roster of current and retired NBA players, improved online matchmaking with dedicated servers, four-player online matches, three-point contests, new playgrounds, custom matches, and more. Pick your team, get ready to jam, and Ball Without Limits.… Expand"}, {"name": "Let's Golf 3D", "details_link": "https://www.metacritic.com/game/3ds/lets-golf-3d", "publisher": "Gameloft", "release_date": "Jul 28 2011", "developers": ["Gameloft"], "platforms": "3DS", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/583794dae3112be4b7522cb87e398746-98.jpg", "descriptions": "A fun-filled golf experience for anyone. Discover Let’s Golf 3D, one of the most fun and colorful golf game for the Nintendo 3DS system. Choose from eight customizable characters with super powers on 108 holes in six locations, including the Mayan jungle or a winter wonderland. The 3DA fun-filled golf experience for anyone. Discover Let’s Golf 3D, one of the most fun and colorful golf game for the Nintendo 3DS system. Choose from eight customizable characters with super powers on 108 holes in six locations, including the Mayan jungle or a winter wonderland. The 3D visuals will let you view your ball’s trajectory like never before.\r… Expand"}, {"name": "Dungeon Siege II: Broken World", "details_link": "https://www.metacritic.com/game/pc/dungeon-siege-ii-broken-world", "publisher": "Take-Two Interactive", "release_date": "Aug  4 2006", "developers": ["Gas Powered Games"], "platforms": "PC", "num_players": "2  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/d86e181209e25d35c5bb7ce9e465cfea-98.jpg", "descriptions": "Dungeon Siege II: Broken World is an action/role-playing game set in a dark, post-apocalyptic fantasy world that concludes the story of Dungeon Siege II. You must hunt down the Dark Wizard in order exact your vengeance and undo the evil brought to the world of Aranna. After the shockingDungeon Siege II: Broken World is an action/role-playing game set in a dark, post-apocalyptic fantasy world that concludes the story of Dungeon Siege II. You must hunt down the Dark Wizard in order exact your vengeance and undo the evil brought to the world of Aranna. After the shocking betrayal at the end of Dungeon Siege II, play through Act IV to conclude this epic adventure. 10 additional hours of primary quest gameplay and an additional 5 hours of optional quests and levels, including two new modes of play, Mercenary and Elite. Over 40 new monsters and beasts with powers that will change the way you play. New items including all new powerful weapons and armor, as well as enchanting magic items. Two brand new character classes that combine the powers of magic and combat. All new spells and powers. New pets have been added to enhance gameplay in addition to new races for the world of Aranna – the Dwarves are now back by popular demand. New reagent recipes that will allow you to create unique and powerful items. [2K Games]… Expand"}, {"name": "Zombie Apocalypse: Never Die Alone", "details_link": "https://www.metacritic.com/game/xbox-360/zombie-apocalypse-never-die-alone", "publisher": "Konami", "release_date": "Oct 26 2011", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 62, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/505b0177a7dd850f28ede58926f02f54-98.jpg", "descriptions": "Backbone Entertainment has created a stunning against-all-odds blaster, where four new heroes must attempt to survive a zombie uprising. The quartet is stranded on a remote island which is under siege from an army of the dead. Using whatever weapons come to hand, the player must scour theBackbone Entertainment has created a stunning against-all-odds blaster, where four new heroes must attempt to survive a zombie uprising. The quartet is stranded on a remote island which is under siege from an army of the dead. Using whatever weapons come to hand, the player must scour the island looking for survivors and eliminating the flesh-eaters in order to create safe zones.\r The action is viewed from an elevated position, with the player central to the action. As the undead attack from all directions, the player uses both control sticks to turn and shoot in all directions, with extra items discarded by fortunate survivors instantly added to an inventory. Zombie Apocalypse: Never Die Alone also introduces a new squad-based mechanism, which allows players to work together. A new class-based system allows users to switch weapons between each other, and also distribute powers and energy to those that need it.… Expand"}, {"name": "Naruto: Uzumaki Chronicles", "details_link": "https://www.metacritic.com/game/playstation-2/naruto-uzumaki-chronicles", "publisher": "Namco Bandai Games America", "release_date": "Nov 14 2006", "developers": ["Cavia Inc."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 62, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/52fa11d17c0d5986691d792f03bcb3c0-98.jpg", "descriptions": "Naruto: Uzumaki Chronicles  introduces a lush,  3D world that will test the players' Ninjutsu skills as Naruto, the feisty orphan who wants to become the most respected and admired ninja of all time. A brand new story drives the missions as players experience the trials and tribulations of aNaruto: Uzumaki Chronicles  introduces a lush,  3D world that will test the players' Ninjutsu skills as Naruto, the feisty orphan who wants to become the most respected and admired ninja of all time. A brand new story drives the missions as players experience the trials and tribulations of a ninja-in-training - fierce competition from fellow students and constant challenges from their teachers. Players can collect status-boosting chips and plates to customize all aspects of Naruto's abilities and face-off against multiple enemies using either close combat moves or long-range weapons like shurikens and explosive cards. With familiar characters like Kakashi, Sasuke and Neji that can swoop in for assistance, Naruto: Uzumaki Chronicles offers mini-games and lethal attacks straight from the popular anime series to satiate any aspiring ninja. [Namco Bandai]… Expand"}, {"name": "Bookbound Brigade", "details_link": "https://www.metacritic.com/game/switch/bookbound-brigade", "publisher": "IntraGames", "release_date": "Jan 30 2020", "developers": ["Digital Tales"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/febd2c567fc85e1ea705f03fb3988227-98.jpg", "descriptions": "Bookbound Brigade is about beating the hell out of historical and literary characters you studied in school by leading a dream team of real and fictional heroes through a 2D side-scrolling platform-adventure."}, {"name": "Fallout: New Vegas - Lonesome Road", "details_link": "https://www.metacritic.com/game/playstation-3/fallout-new-vegas---lonesome-road", "publisher": "Bethesda Softworks", "release_date": "Sep 20 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/a1de535a73e0dc814e3de9be5d91c065-98.jpg", "descriptions": "Lonesome Road, available in July, brings the courier's story full circle when you are contacted by the original Courier Six, a man by the name of Ulysses who refused to deliver the Platinum Chip at the start of New Vegas. In his transmission, Ulysses promises the answer as to why, but onlyLonesome Road, available in July, brings the courier's story full circle when you are contacted by the original Courier Six, a man by the name of Ulysses who refused to deliver the Platinum Chip at the start of New Vegas. In his transmission, Ulysses promises the answer as to why, but only if you take one last job –a job that leads you into the depths of the hurricane-swept canyons of the Divide, a landscape torn apart by earthquakes and violent storms. The road to the Divide is a long and treacherous one, and of the few to ever walk the road, none have ever returned.… Expand"}, {"name": "Hardwood Backgammon", "details_link": "https://www.metacritic.com/game/xbox-360/hardwood-backgammon", "publisher": "Silver Creek Entertainment", "release_date": "Dec  8 2005", "developers": ["Silver Creek Entertainment"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "num_players": "2  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/2afdede77c4c852acaaf078201e96c8b-98.jpg", "descriptions": "[Xbox Live Arcade]  Play a game of Hardwood Backgammon against the computer, against a friend on a single console, or against on online opponent over Xbox Live. Move all of your checkers onto your home board, and then bear off before your opponent does. Roll two of a kind to double your[Xbox Live Arcade]  Play a game of Hardwood Backgammon against the computer, against a friend on a single console, or against on online opponent over Xbox Live. Move all of your checkers onto your home board, and then bear off before your opponent does. Roll two of a kind to double your number of moves. Catch your opponent with a vulnerable checker, and send him to the bar. And once you're sure you're going to win, use the doubling cube to bring you even closer to ultimate victory. Play two players on Xbox Live or on the same console. Computer opponent: Go up against world-class play using Neural Net technology. Customizable items: Change environments (backgrounds, some with sound), dice, doubling cube, checkers, and playing board. Communicate: Fooms, much like emotes, don't affect the game, but they might affect your mood - send Fooms such as a Kiss, Fireball, or Lightning at friends or opponents to let them know how you feel. [Xbox.com]… Expand"}, {"name": "Democracy", "details_link": "https://www.metacritic.com/game/pc/democracy", "publisher": "Tri Synergy", "release_date": "Apr  1 2005", "developers": ["Positech Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 62, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/7d95a968a0643f85ae4a332a376e0d54-98.jpg", "descriptions": "Democracy thrusts you into the hot-seat as the Prime Minister (or President) of the world’s most powerful countries. The country is run as a simple democracy where you need to secure over 50% of the vote in each election in order to remain in power. The object of the game is to stay in powerDemocracy thrusts you into the hot-seat as the Prime Minister (or President) of the world’s most powerful countries. The country is run as a simple democracy where you need to secure over 50% of the vote in each election in order to remain in power. The object of the game is to stay in power as long as possible, as there are no limits to the number of terms you may serve. As the game progresses, you influence the voters and the country by putting the right policies into place at the right time. We all think we can do better....here’s your chance to prove it with Democracy! [Ascaron]… Expand"}, {"name": "Spyro: A Hero's Tail", "details_link": "https://www.metacritic.com/game/gamecube/spyro-a-heros-tail", "publisher": "VU Games", "release_date": "Nov  3 2004", "developers": ["Eurocom Entertainment Software"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 62, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/4cec22596b3df2566b57b040e875970c-98.jpg", "descriptions": "Spyro must save the Dragon Realms from the Evil Red Dragon who has planted light-sapping Dark Gems all over the Dragon Realms in an attempt to control the world. With the help of his allies, Spyro must seek out and destroy all of the Dark Gems to return the land back to normal and to saveSpyro must save the Dragon Realms from the Evil Red Dragon who has planted light-sapping Dark Gems all over the Dragon Realms in an attempt to control the world. With the help of his allies, Spyro must seek out and destroy all of the Dark Gems to return the land back to normal and to save the Dragon Realms from the evil dragon's tyrannical control. Guide Spyro as he uses his new dragon powers, abilities, and gadgets in lush environments rife with new villains.… Expand"}, {"name": "Dead Man's Hand", "details_link": "https://www.metacritic.com/game/xbox/dead-mans-hand", "publisher": "Atari", "release_date": "Mar  3 2004", "developers": ["Human Head Studios"], "platforms": ["PC", "Xbox"], "num_players": "1-8 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/734be722caa9d310e8e2a0b5dc859008-98.jpg", "descriptions": "Now you can experience the best elements of the Western genre, brought straight from the silver screen to the Xbox. Dead Man's Hand is a first-person shooter set in the Wild West.  You assume the role of El Tejon, a master gunslinger who seeks vengeance.  As the story unfolds, you pursueNow you can experience the best elements of the Western genre, brought straight from the silver screen to the Xbox. Dead Man's Hand is a first-person shooter set in the Wild West.  You assume the role of El Tejon, a master gunslinger who seeks vengeance.  As the story unfolds, you pursue members of \"The Nine,\" a gang of ruthless outlaws who betrayed you and left you for dead.    Gunslinging, bar brawls, horseback action sequences, train chases, and epic showdowns are just part of the historic feel to this bona fide Old West adventure.… Expand"}, {"name": "Harry Potter and the Sorcerer's Stone", "details_link": "https://www.metacritic.com/game/gamecube/harry-potter-and-the-sorcerers-stone", "publisher": "EA Games", "release_date": "Dec  9 2003", "developers": ["Warthog"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/31c806394377600609b551172998c31b-98.jpg", "descriptions": "Leave the nonmagical world behind and enroll in Hogwarts School of Witchcraft and Wizardry in Harry Potter and The Sorcerer's Stone.  As Harry Potter, you will hone your magical skills and advance through three terms of study during Harry's first year at Hogwarts.  Each term will challengeLeave the nonmagical world behind and enroll in Hogwarts School of Witchcraft and Wizardry in Harry Potter and The Sorcerer's Stone.  As Harry Potter, you will hone your magical skills and advance through three terms of study during Harry's first year at Hogwarts.  Each term will challenge you to meet a number of objectives, such as collecting and mixing potions with Professor Snape or piloting a flying broom through the Forbidden Forest in search of Neville Longbottom's Remembrall.  In order to pass the first year of study, players must complete over 29 different objectives, while avoiding enemies and obstacles.… Expand"}, {"name": "Alter Echo", "details_link": "https://www.metacritic.com/game/playstation-2/alter-echo", "publisher": "THQ", "release_date": "Aug 19 2003", "developers": ["Outrage Games"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 62, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/7139a3d88d52bad1f5e6c3d92b92cf55-98.jpg", "descriptions": "An innovative action game that lets players morph between three combat modes and alter time with pioneering TimeDilation technology. The game lets players assume the role of Nevin, a reluctant hero with the ability to alter time and morph his PolySuit between three unique combat forms. HeAn innovative action game that lets players morph between three combat modes and alter time with pioneering TimeDilation technology. The game lets players assume the role of Nevin, a reluctant hero with the ability to alter time and morph his PolySuit between three unique combat forms. He must fight for survival against an entire planet that has gone mad-the surface of the planet is alive, and uses its bio-mechanical properties to spawn enemy after enemy, ensuring relentless action. A revolutionary PostFX camera system intensifies the action with spectacular visual effects that heighten the drama of every combo and special attack. [THQ]… Expand"}, {"name": "Finding Nemo", "details_link": "https://www.metacritic.com/game/gamecube/finding-nemo", "publisher": "THQ", "release_date": "May 12 2003", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/fcdf2863d9baa0cb2a3654389a291dc4-98.jpg", "descriptions": "Dive into a thrilling underwater adventure.  Based on the movie from Disney and Pixar, Finding Nemo challenges you to reunite the young clownfish Nemo with his father Marlin.  You have the option to play as Marlin, Dory, or Nemo and, as you live the action of the film's storyline, you'llDive into a thrilling underwater adventure.  Based on the movie from Disney and Pixar, Finding Nemo challenges you to reunite the young clownfish Nemo with his father Marlin.  You have the option to play as Marlin, Dory, or Nemo and, as you live the action of the film's storyline, you'll meet all the other memorable characters.  Also, remember hilarious moments from the film through clips included in the game.   The search for Nemo is on, and it's up to you to find him.… Expand"}, {"name": "NFL GameDay 2002", "details_link": "https://www.metacritic.com/game/playstation/nfl-gameday-2002", "publisher": "SCEA", "release_date": "Aug  6 2001", "developers": ["989 Sports"], "platforms": ["PlayStation 2", "PlayStation"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/05c9804a2423e25191d0e105fb36e12b-98.jpg", "descriptions": "GameDay 2002 does a decent job of delivering a fun and somewhat realistic game of football to the PlayStation."}, {"name": "Star Trek: Voyager Elite Force Expansion Pack", "details_link": "https://www.metacritic.com/game/pc/star-trek-voyager-elite-force-expansion-pack", "publisher": "Activision", "release_date": "May  9 2001", "developers": ["Raven Software"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 62, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/ab2bdd89b7cf2e9d1c4bc637513f24e4-98.jpg", "descriptions": "Activision's simple and straightforward add-on pack for 2000's wildly popular Trek shooter may be a little lean on the single-player experience, though 5 new multi-player modes and the ability to explore all 10 levels of the U.S.S. Voyager could make a Trekkie's day."}, {"name": "Top Gear Dare Devil", "details_link": "https://www.metacritic.com/game/playstation-2/top-gear-dare-devil", "publisher": "Kemco", "release_date": "Dec 11 2000", "developers": ["Kemco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/69be8cbb5b057f652d9da5f966947882-98.jpg", "descriptions": "No secret handshake. No decoder ring. No stupid hat. All you need to be a member of the jet-setting Dare Devils, the most elusive and outlawed driving club in the world, is good reflexes, a gut full of courage and an artistic eye for mayhem. Wreak havoc in Rome, London, Tokyo and SanNo secret handshake. No decoder ring. No stupid hat. All you need to be a member of the jet-setting Dare Devils, the most elusive and outlawed driving club in the world, is good reflexes, a gut full of courage and an artistic eye for mayhem. Wreak havoc in Rome, London, Tokyo and San Francisco, unlock fast cares and hidden courses--but if you're caught, deny everything.… Expand"}, {"name": "Spawn: In the Demon's Hand", "details_link": "https://www.metacritic.com/game/dreamcast/spawn-in-the-demons-hand", "publisher": "Capcom", "release_date": "Oct  1 2000", "developers": ["Capcom"], "platforms": "Dreamcast", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 62, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/cf317f9569cbb10c18b95dc49a599f17-98.jpg", "descriptions": "The legendary hellbound comic anti-hero comes to life. Straight from the blockbuster arcade game, this home version kicks it up a notch with ever more features and modes of play. Up to 4 players can battle in the \"death match-style\" Battle Royal Mode or choose a computer controlledThe legendary hellbound comic anti-hero comes to life. Straight from the blockbuster arcade game, this home version kicks it up a notch with ever more features and modes of play. Up to 4 players can battle in the \"death match-style\" Battle Royal Mode or choose a computer controlled teammate to take on Team Battle Mode. All your favorite characters from the Spawn series are faithfully recreated in the ultimate death match challenge.… Expand"}, {"name": "MotoGP 07", "details_link": "https://www.metacritic.com/game/playstation-2/motogp-07", "publisher": "Capcom", "release_date": "Oct 23 2007", "developers": ["Milestone"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 62, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/349c199df536e469a66b68f19dd4b5a9-98.jpg", "descriptions": "Compete in a full season, create your own customised season, or select a one-off race either on your own or against a friend. Whether gamers are new to the racing genre, fans of four-wheeled racers looking for a new challenge or veterans of motorcycle games, the diverse handling models ofCompete in a full season, create your own customised season, or select a one-off race either on your own or against a friend. Whether gamers are new to the racing genre, fans of four-wheeled racers looking for a new challenge or veterans of motorcycle games, the diverse handling models of MotoGP 07 allows players of varied skill levels to access and enjoy the adrenaline fuelled world of MotoGP. Features such as riding aids provide newcomers to the series with the confidence to push their bikes to the limit. Experienced players have the option to independently control front and rear brakes as well as the rider's position, making them feel at one with their bike as they enter and exit the tightest of hairpins inches from the tarmac, before stepping on the gas to reach speeds of well over 200mph/320kph. Plus players can also adjust the AI of their race opponents, modifying speed and ability to match their own riding level and create a more balanced race. Featuring a comprehensive set of 100 trials, each available at three difficulty levels, MotoGP 07's Challenge Mode tests and hone players' skills. Events include slalom challenges where players handling abilities are put to the test as they navigate a series of gates placed the length of the circuit and time trials which challenge players to beat the lap record for each circuit. [Capcom]… Expand"}, {"name": "Go Vacation", "details_link": "https://www.metacritic.com/game/switch/go-vacation", "publisher": "Nintendo", "release_date": "Jul 27 2018", "developers": ["Bandai Namco Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/a7bfd59fcad02ea5b6b6d60e54623699-98.jpg", "descriptions": "Welcome to Kawawii Island, a paradise resort where friends and family can enjoy 50+ co-op and competitive activities. There are all sorts of exciting ways to explore the island, from horseback to buggies, snow mobiles to inline skates. And to add to the fun, up to 4 players* can enjoyWelcome to Kawawii Island, a paradise resort where friends and family can enjoy 50+ co-op and competitive activities. There are all sorts of exciting ways to explore the island, from horseback to buggies, snow mobiles to inline skates. And to add to the fun, up to 4 players* can enjoy visiting and discovering every corner of the island together. If you're playing multiplayer, each player can use just one Joy-Con™ controller. Experience hours of fun and something new every day. Customize your character, costumes, vehicles and even pets! Daily presents and challenges mean that you will want to keep coming back to the island of Kawawii to explore more terrain and play through activities all over again. Mii or in-game characters of friends and family may show up, and if they do, you can compete against them anytime. Or customize your very own villa by earning over 450 pieces of furniture. … Expand"}, {"name": "Monark", "details_link": "https://www.metacritic.com/game/switch/monark", "publisher": "NIS America", "release_date": "Feb 22 2022", "developers": ["Lancarse"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 62, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/34ebb0b247930f755761d8e90fdacad5-98.jpg", "descriptions": "How far will you go to save the ones you love? Could you face the threats that surround you? Could you face yourself? Your world is plunged into madness when the mysterious and deadly Mist surrounds Shin Mikado Academy. In order to save your friends, you enter the Otherworld, a Daemon-filledHow far will you go to save the ones you love? Could you face the threats that surround you? Could you face yourself? Your world is plunged into madness when the mysterious and deadly Mist surrounds Shin Mikado Academy. In order to save your friends, you enter the Otherworld, a Daemon-filled dimension beyond the real world. Within this enigmatic realm, you must learn to harness your Authority of Vanity and conjure a battalion of Fiends, whose power comes from the Ego of their master. Develop your Ego through various psychological tests to enhance the power of your Fiends, and lead your forces into battle to fight with and against the seven \"Pactbearers\" that are corrupting the academy. Embrace the power of your madness to gain strength, but take care not to delve too far, lest you risk losing yourself. Fellow students and instructors will lend you their aid in your quest to resolve the anomalies throughout the campus.… Expand"}, {"name": "Hero's Saga Laevatein Tactics", "details_link": "https://www.metacritic.com/game/ds/heros-saga-laevatein-tactics", "publisher": "Aksys Games", "release_date": "Oct 20 2009", "developers": ["GungHo"], "platforms": "DS", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/0534923a4a52e2b68d9ba9e607024c67-98.jpg", "descriptions": "The Story So Far: When a strange girl hands Ernesto, the young prince of Valencia, a mysterious sword and tells him to save his friends, he thinks nothing of using the magical blade to fight off an undead attack. Little does he know that such a small choice will spark a war that will rageThe Story So Far: When a strange girl hands Ernesto, the young prince of Valencia, a mysterious sword and tells him to save his friends, he thinks nothing of using the magical blade to fight off an undead attack. Little does he know that such a small choice will spark a war that will rage across the continent of Yulamecca and beyond.  Command your forces into one of several formations, each with its own strengths and weaknesses. Harness The Power of The Einherjar! Collect all the Vaettir Arms (180+ Arms to find!) scattered throughout the game and strike fear into the hearts of your foes with the awesome power of the Valhalla Break! Ad-Hoc Goodness! Using the power of ad-hoc wireless connectivity you can trade items with your friends, rent out your heroes to aid friends in need, or battle them for fame and glory. Create An Unstoppable Army. Equip different weapons to change the class, abilities, and appearance of your soldiers! Choose wisely to unlock the legendary secret class. [Aksys Games]… Expand"}, {"name": "Ghost Blade HD", "details_link": "https://www.metacritic.com/game/playstation-4/ghost-blade-hd", "publisher": "HUCAST", "release_date": "Feb 28 2017", "developers": ["HUCAST"], "platforms": ["PC", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/5fa9d1eb07e92bcb4404c2800cee85f3-98.jpg", "descriptions": "Ghost Blade HD is an intense bullet-hell shoot 'em up game, with satisfying and addictive score-based gameplay, with its tradition going back to the shooting games of the 1990s era. Designed with a modern graphic style and special effects, Ghost Blade also features a 2-player mode. GhostGhost Blade HD is an intense bullet-hell shoot 'em up game, with satisfying and addictive score-based gameplay, with its tradition going back to the shooting games of the 1990s era. Designed with a modern graphic style and special effects, Ghost Blade also features a 2-player mode. Ghost Blade HD Is easy to learn, yet hard to master. … Expand"}, {"name": "Sheltered", "details_link": "https://www.metacritic.com/game/pc/sheltered", "publisher": "Team17", "release_date": "Mar 15 2016", "developers": ["Unicube"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 62, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/f9f530082a9d7156593091987a089b22-98.jpg", "descriptions": "Sheltered is a post-apocalyptic disaster management game that gives a new meaning to the term “nuclear family”. You must gather as many supplies as possible en route to the concrete underground shelter that will soon become your family home for the foreseeable dreary future."}, {"name": "Wanted: Weapons of Fate", "details_link": "https://www.metacritic.com/game/xbox-360/wanted-weapons-of-fate", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar 24 2009", "developers": ["GRIN"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/0eee338a581f14f399b79789b26e193c-98.jpg", "descriptions": "Based on Universal Pictures' action-thriller Wanted, this game promises to deliver the same fantastic visual style, in-your-face attitude and edge-of-your-seat action as the blockbuster motion picture. The game continues the story of hero Wesley Gibson, picking up the action where the filmBased on Universal Pictures' action-thriller Wanted, this game promises to deliver the same fantastic visual style, in-your-face attitude and edge-of-your-seat action as the blockbuster motion picture. The game continues the story of hero Wesley Gibson, picking up the action where the film leaves off and creating an entirely new chapter exploring both Wesley's journey to becoming an unmatched überassassin and the epic fiction of \"The Fraternity.\" Featuring intense third-person action, the Wanted video game will take combat to the next level with iconic moves -- such as \"Curving Bullets\" and \"Assassin Time\" -- drawn directly from the film, as well as an innovative, multi-layered cover mechanic.… Expand"}, {"name": "Hyper Scape", "details_link": "https://www.metacritic.com/game/playstation-4/hyper-scape", "publisher": "Ubisoft", "release_date": "Aug 11 2020", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 62, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/7/eed386787256cd9d5e66ec90f52a9a35-98.jpg", "descriptions": "Futuristic Urban Battle Royale. Loot and fuse powerful Hacks and unique weapons in fast-paced battles, and rise to become a true champion of the Hyper Scape. Welcome to Neo Arcadia. Fight your way through the unique districts of Neo Arcadia, a virtual city featuring imposing landmarks thatFuturistic Urban Battle Royale. Loot and fuse powerful Hacks and unique weapons in fast-paced battles, and rise to become a true champion of the Hyper Scape. Welcome to Neo Arcadia. Fight your way through the unique districts of Neo Arcadia, a virtual city featuring imposing landmarks that bring verticality to the next level. Engage in high-stakes combat as you explore its streets, interiors, and rooftops. Hyper Scape offers two ways to win: Fight to be the last one standing, or capture the Crown that spawns near the end of the match. Keep possession of the Crown for long enough, and you and your squad will claim victory! [Ubisoft]… Expand"}, {"name": "OVERPASS", "details_link": "https://www.metacritic.com/game/pc/overpass", "publisher": "Bigben Interactive", "release_date": "Feb 27 2020", "developers": ["Zordix Racing"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Arcade", "Automobile"], "meta_score": 62, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/6511dc565a201a554c6b76c17b1ac1df-98.jpg", "descriptions": "In Overpass, the player takes control of powerful buggies and quads, scrabbling across extreme tracks and very hazardous terrain. This simulation, unique in its genre, pits the player against craggy slopes and puts their cool-headedness to the test throughout technical obstacle courses alongIn Overpass, the player takes control of powerful buggies and quads, scrabbling across extreme tracks and very hazardous terrain. This simulation, unique in its genre, pits the player against craggy slopes and puts their cool-headedness to the test throughout technical obstacle courses along wilderness tracks.Overpass's realistic physics engine requires you to keep precise and meticulous control of your speed and acceleration or you risk losing your grip and failing your crossing. You'll need to master the technical characteristics of official reproductions of buggies and quads from iconic brands such as Yamaha, Suzuki or Arctic Cat. Differential locking, 2 or 4 drive wheels, transmission type: the player has been given all the tools they need to discover the real vehicle options that will let them adapt their driving to the terrain.The Career mode lets you manage your buggies and quads and choose the one best adapted to each track and terrain type in order to win the competition and attract sponsors. In multi-player mode, you'll need to know and master the slightest detail of each track in order to post the best times and show that you are truly the master of off-roading!… Expand"}, {"name": "Resident Evil Archives: Resident Evil Zero", "details_link": "https://www.metacritic.com/game/wii/resident-evil-archives-resident-evil-zero", "publisher": "Capcom", "release_date": "Dec  1 2009", "developers": ["Capcom"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 62, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/99c56cd269e3e2b892b907393c69034e-98.jpg", "descriptions": "Prequel to the game that started a multi-million dollar franchise, Resident Evil Archives: Resident Evil Zero exposes the back story and internal tyranny of the Umbrella Corporation and lets players discover the origins of the T-Virus in an epic storyline that tells the horrors leading up toPrequel to the game that started a multi-million dollar franchise, Resident Evil Archives: Resident Evil Zero exposes the back story and internal tyranny of the Umbrella Corporation and lets players discover the origins of the T-Virus in an epic storyline that tells the horrors leading up to the infamous mansion incident. Only available on the Nintendo GameCube until now, Resident Evil Zero brings Rebecca Chambers - rookie member of S.T.A.R.S. Bravo Team - to Raccoon City, where she must investigate a series of gruesome murders.  Almost immediately she stumbles upon a military transport truck filled with corpses and her journey of horror begins. Along the way Rebecca meets Billy Coen, an ex-Marine convicted on circumstantial evidence for the murder of 23 people.  Players will get to control both Rebecca and Billy simultaneously using the Partner Zapping system, as they fight their way out of Raccoon City in the last of the main titles to use the original Resident Evil gameplay system prior to Resident Evil 4. [Capcom Entertainment]… Expand"}, {"name": "The Last Remnant Remastered", "details_link": "https://www.metacritic.com/game/switch/the-last-remnant-remastered", "publisher": "Square Enix", "release_date": "Jun 10 2019", "developers": ["Square Enix", "GUILD STUDIO Inc."], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/f59cddb3f030755b4780c32e3fca25cd-98.jpg", "descriptions": "The cult classic RPG featuring team versus team battles finally arrives on Nintendo Switch!Last released in 2008, The Last Remnant captured the hearts and minds of gamers with its enthralling story, countless characters and intricate battle system. Now this cult classic RPG is back with aThe cult classic RPG featuring team versus team battles finally arrives on Nintendo Switch!Last released in 2008, The Last Remnant captured the hearts and minds of gamers with its enthralling story, countless characters and intricate battle system. Now this cult classic RPG is back with a Remastered version and is coming to Nintendo Switch with even more beautiful graphics, enhanced via an updated game engine. There exists a world woven together by four races: Mitra, Yama, Qsiti, and Sovani.In this world, mysterious objects called \"Remnants\" have existed since ancient times. Who created these objects? When? And for what reason? No one knew nor had the means to know, but continued to extract and use their colossal power.However, the Remnants' immense power gradually caused the world to fall out of balance. As further separation tore apart those who rule and those who follow, a war broke outthe beginning of a long and endless strife.A thousand years later, this story begins. Distinct Battle SystemA command-style battle with ever-changing scenariosComing in contact with enemies on the field will trigger battles. Strategize and make full use of the commands that change constantly depending on the positions and state of friendly and enemy forces.Morale of friendly forces greatly affects the outcome of battleIn battle, morale expresses the spirit of individuals and groups of both friendly and enemy forces. Higher morale has advantageous effects such as increasing the attack stat to deal more damage, or decreasing damage dealt by the enemy… Expand"}, {"name": "Transformers: War for Cybertron - Autobots", "details_link": "https://www.metacritic.com/game/ds/transformers-war-for-cybertron---autobots", "publisher": "Activision", "release_date": "Jun 22 2010", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/1700b2e820233a60746ab00d630ab38b-98.jpg", "descriptions": "Players can now take on the role of a Transformers character in the final, epic war that will determine the survival of their entire race."}, {"name": "Transformers: War for Cybertron - Decepticons", "details_link": "https://www.metacritic.com/game/ds/transformers-war-for-cybertron---decepticons", "publisher": "Activision", "release_date": "Jun 22 2010", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/bc9aee4730e239426501608ea717daeb-98.jpg", "descriptions": "Players can now take on the role of a Transformers character in the final, epic war that will determine the survival of their entire race."}, {"name": "The Tower SP", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-tower-sp", "publisher": "Sega", "release_date": "Mar 21 2006", "developers": ["Vivarium"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/395b92c5d8d6bbe233acb4f09882cfde-98.jpg", "descriptions": "The Tower SP is an in-depth sim experience that allows the player to design, build, and manage every aspect of successfully creating a skyscraper. Players decide where to place apartments, hotel rooms, office spaces, restaurants, commercial shops, elevators, and a multitude of otherThe Tower SP is an in-depth sim experience that allows the player to design, build, and manage every aspect of successfully creating a skyscraper. Players decide where to place apartments, hotel rooms, office spaces, restaurants, commercial shops, elevators, and a multitude of other construction items in their building. As the tower grows, players have to deal with a multitude of real life situations such as fires, insect infestations, burglaries, and of course the occasional unhappy tenant. Only with savvy design and wise management skills will the player's tower attract masses of patrons and tenants. The main goal in The Tower SP is to achieve a \"Five Star\" building rating and gain official \"Tower\" status. This can only be achieved by completing specific objectives and creating a building that is a marvel of both efficiency and design. Happy tenants play a large roll in the building's success. A large tenant base insures income to the building, but it is imperative that the building management keep its tenants happy. Unhappy tenants will vacate their offices, apartments, and hotel rooms, thus affecting the player's bottom line and the building's \"Star\" rating.… Expand"}, {"name": "Texas Cheat 'Em", "details_link": "https://www.metacritic.com/game/playstation-3/texas-cheat-em", "publisher": "D3Publisher", "release_date": "May 14 2009", "developers": ["Wideload Games Inc."], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/587ad90d416f45e96b4231fc9ce34395-98.jpg", "descriptions": "[Playstation Network]  It's not whether you win or lose … it's about how far you can bend the rules without getting caught. In Texas Cheat 'Em, that's pretty darn far. Play casino-themed mini-games to activate one of 15 cheating abilities—then make your own luck. Turn a bad hand into a sure[Playstation Network]  It's not whether you win or lose … it's about how far you can bend the rules without getting caught. In Texas Cheat 'Em, that's pretty darn far. Play casino-themed mini-games to activate one of 15 cheating abilities—then make your own luck. Turn a bad hand into a sure thing. Send your opponent's Royal Flush right down the drain. Steal chips, fold for free, or know the community cards in advance. Cheat strangers out of their fortunes over Playstation Network before they do it to you. Remember: glory is forever, but broke is only funny when it happens to someone else. [Wideload Games]… Expand"}, {"name": "The Legend of Spyro: Dawn of the Dragon", "details_link": "https://www.metacritic.com/game/xbox-360/the-legend-of-spyro-dawn-of-the-dragon", "publisher": "Sierra Entertainment", "release_date": "Oct 21 2008", "developers": ["Etranges Libellules"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Friend System Only", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/759d78ada9f79ac1f268f0229e62b015-98.jpg", "descriptions": "In the final chapter of the Legend of Spyro trilogy, players find Sypro teaming up with an unlikely ally - Cynder, his former enemy, to face his most challenging mission to date. As the Dark Master's (voiced by Mark Hamill) evil envelopes the world like a plague, Spyro must fulfill hisIn the final chapter of the Legend of Spyro trilogy, players find Sypro teaming up with an unlikely ally - Cynder, his former enemy, to face his most challenging mission to date. As the Dark Master's (voiced by Mark Hamill) evil envelopes the world like a plague, Spyro must fulfill his destiny and unlock the true power of the purple dragon within him to stop the Dark Master in his tracks. The game introduces two never before seen elements into the Spyro universe: Spyro can now fly at any time and players can drop-in/drop-out with the new cooperative feature. The co-op feature allows players to have the option of completing the game as either Spyro or Cynder, giving them more freedom to explore Spyro's world in completely new ways. [Sierra Entertainment]… Expand"}, {"name": "Armored Core: For Answer", "details_link": "https://www.metacritic.com/game/playstation-3/armored-core-for-answer", "publisher": "Ubisoft", "release_date": "Sep 16 2008", "developers": ["From Software"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/7884c57324cacd0a3a78f417a2034ea5-98.jpg", "descriptions": "In the distant future, massive urban development and pollution have critically damaged the planet. There is widespread fear that the end of the world is approaching. The League corporations, a military superpower, control the planet's infrastructure and have forced most of the world'sIn the distant future, massive urban development and pollution have critically damaged the planet. There is widespread fear that the end of the world is approaching. The League corporations, a military superpower, control the planet's infrastructure and have forced most of the world's population to live in huge aerial communities, called Cradles, to avoid the contamination. The ORCA, a rebel resistance still residing on the surface of the polluted planet, have amassed a formidable arsenal and are mobilizing to attack The League's bases to put an end to their iron grip on the planet. As a mercenary armed with cutting-edge military robot technology, choose your side and defeat the other factions by harnessing the power of the deadliest and most gigantic weapons ever created by mankind. For the first time in the series, cut your way inside colossal mobile battle stations and destroy them from their very core. Identify and exploit the weaknesses of 10 uniquely designed GIANT mobile battle stations to defeat them. Cooperate online with a friend in more than 30 missions or face up to 7 other players online in more than 80 different battlefields. Find the right combination of weapons and armor that will help you take down colossal enemies. With more than 130 new parts and 400 parts total, enhance your mech to take on increasingly deadlier mobile battle stations. Create the perfect mech design to defeat a powerful enemy and share it with your friends online. [Ubisoft]… Expand"}, {"name": "Wooden Sen'SeY", "details_link": "https://www.metacritic.com/game/wii-u/wooden-sensey", "publisher": "Neko Entertainment", "release_date": "Jul 24 2014", "developers": ["Upper Byte"], "platforms": ["PC", "Wii U"], "genres": ["Action", "Platformer", "2D"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/c76a0caa346d6b485bef090799d0c3f2-98.jpg", "descriptions": "You follow Goro, a village chief, as he seeks revenge through a variety of levels (Japanese temples, ocean beds, flying boats, and other inhospitable caverns).\r The game has 9 levels with bosses that Goro has to overcome using his axes.\r\nRun, grab hold, throw yourself forward, chop, throwYou follow Goro, a village chief, as he seeks revenge through a variety of levels (Japanese temples, ocean beds, flying boats, and other inhospitable caverns).\r The game has 9 levels with bosses that Goro has to overcome using his axes.\rRun, grab hold, throw yourself forward, chop, throw shurikens: anything goes in pursuit of your goal!… Expand"}, {"name": "WRC 5", "details_link": "https://www.metacritic.com/game/playstation-4/wrc-5", "publisher": "Bigben Interactive", "release_date": "Oct 13 2015", "developers": ["Kylotonn", "Milestone S.r.l"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 62, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/42cadbbaee21298950453f6ec1f720bb-98.jpg", "descriptions": "In WRC 5, you can start to drive at early morning, in the middle of the day, during the sunset or even during the night. These different moments of the day allow you to experience various atmospheres (morning fog, dazzling sunset) and the headlights’ ramp will be very useful for the night stages."}, {"name": "Puzzle Chronicles", "details_link": "https://www.metacritic.com/game/psp/puzzle-chronicles", "publisher": "Konami", "release_date": "Jan 28 2010", "developers": ["Konami"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/6643be14f679a58a1b8dc7a724b59000-98.jpg", "descriptions": "Enter the dark and savage lands of the Ashurin Empire as you battle to avenge the atrocities the Empire brought upon your tribesmen. On your challenging quest you will fight fierce beasts and battle hardened warriors with a new puzzle combat mechanics that will test your skills. This newEnter the dark and savage lands of the Ashurin Empire as you battle to avenge the atrocities the Empire brought upon your tribesmen. On your challenging quest you will fight fierce beasts and battle hardened warriors with a new puzzle combat mechanics that will test your skills. This new puzzle combat system is based on real time action so players will have to think fast and posses sound strategies to best their opponents. [Konami]… Expand"}, {"name": "Mafia III", "details_link": "https://www.metacritic.com/game/pc/mafia-iii", "publisher": "2K Games", "release_date": "Oct  6 2016", "developers": ["Hangar 13"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 62, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/2/6f0396bc6ec7a3dc01f5a733cff32749-98.jpg", "descriptions": "In 1968, after years in Vietnam, Lincoln Clay knows this truth: Family isn't who you're born with, it's who you are willing to die for. Now back home, in a new New Orleans, Lincoln is dedicated to rebuilding his life, but established ties keep him from exiting the city. It'll take more thanIn 1968, after years in Vietnam, Lincoln Clay knows this truth: Family isn't who you're born with, it's who you are willing to die for. Now back home, in a new New Orleans, Lincoln is dedicated to rebuilding his life, but established ties keep him from exiting the city. It'll take more than a few friends to make it in this new world. Intense gun fights, hand-to-hand combat, white knuckle driving and street smarts will all be required. But with the right crew, tough decisions and some dirty hands, it's possible to ascend to the top of the city's underworld. It's about time to create a new family. … Expand"}, {"name": "Street Racing Syndicate", "details_link": "https://www.metacritic.com/game/playstation-2/street-racing-syndicate", "publisher": "Namco", "release_date": "Aug 31 2004", "developers": ["Eutechnyx"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 62, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/02e6a137116d603ff0caccce89d92a35-98.jpg", "descriptions": "SRS is the first game to deliver authentic street racing action, featuring realistic cars, genuine aftermarket parts, and true-to-life driving physics. Live a life immersed in the underground world of real street racing. Customize and tune realistic vehicles with detailed auto upgradesSRS is the first game to deliver authentic street racing action, featuring realistic cars, genuine aftermarket parts, and true-to-life driving physics. Live a life immersed in the underground world of real street racing. Customize and tune realistic vehicles with detailed auto upgrades including dozens of licensed aftermarket parts that physically appear on cars. Progress through the Philadelphia, Miami and Los Angeles street racing scenes. Outrun and outsmart the cops in high-speed late night chases. BET BIG. Race for money, pink slips or even the girlfriends of rival street racers! Experience real high-speed illegal street racing with true racing physics and authentic damage that affect both looks and performance. Compete in both illegal and official sanctioned racing events. [3DO]… Expand"}, {"name": "Need for Speed Payback", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-payback", "publisher": "Electronic Arts", "release_date": "Nov 10 2017", "developers": ["Electronic Arts"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 62, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/6/4201b7254ab1703bac82d035587eb501-98.jpg", "descriptions": "Set in the underworld of Fortune Valley, players drive as three distinct characters reunited by a quest for vengeance against The House, a nefarious cartel that rules the city’s casinos, criminals and cops. They take on a variety of challenges and events as Tyler, the Racer; Mac, theSet in the underworld of Fortune Valley, players drive as three distinct characters reunited by a quest for vengeance against The House, a nefarious cartel that rules the city’s casinos, criminals and cops. They take on a variety of challenges and events as Tyler, the Racer; Mac, the Showman; and Jess, the Wheelman to earn the respect of the underground. Featuring the deepest customization from the series, players can truly craft a personalized and unique ride, or spend hours finding and tuning an abandoned derelict into a supercar. They can then push their cars to the limit and raise the stakes by betting on their own performance, where they can either multiply their winnings or risk losing it all. [Electronic Arts]… Expand"}, {"name": "Agents of Mayhem", "details_link": "https://www.metacritic.com/game/playstation-4/agents-of-mayhem", "publisher": "Deep Silver", "release_date": "Aug 15 2017", "developers": ["Volition Inc."], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/ae1f2ab463e53cddccf7a92756e9e1d1-98.jpg", "descriptions": "In the wake of a global assault, the world has fallen under the rule of LEGION, a supervillainous cabal of criminal masterminds and costumed megalomaniacs. The only people who are capable of turning the tide are the Agents of MAYHEM. Led by Persephone Brimstone, these uniquely skilled agentsIn the wake of a global assault, the world has fallen under the rule of LEGION, a supervillainous cabal of criminal masterminds and costumed megalomaniacs. The only people who are capable of turning the tide are the Agents of MAYHEM. Led by Persephone Brimstone, these uniquely skilled agents are going to take down this New World Disorder by any means necessary. Take the fight to LEGION in Seoul: The City of Tomorrow, an open world chock full of world-shaking missions, city-spanning doomsday devices, and evil underground lairs. Take your team of three Agents into the field and swap between them on the fly for maximum mayhem. Upgrade and customize your Agents to create your personal dream team of gadget-wielding anti-heroes. Upgrade the ARK–MAYHEM HQ–to unlock even more mayhem-making means. [Deep Silver]\r… Expand"}, {"name": "Watch Dogs", "details_link": "https://www.metacritic.com/game/wii-u/watch-dogs", "publisher": "Ubisoft", "release_date": "Nov 18 2014", "developers": ["Ubisoft Romania"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Wii U"], "num_players": "Up to 4 ", "genres": ["Modern", "Action Adventure", "General", "Modern", "Open-World"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/5ae53c63c7949c4851795b9fe8c8d6e4-98.jpg", "descriptions": "Watch Dogs is an open-world action adventure game in which you must use any means at your disposal to take down a corrupt system. Watch Dogs takes advantage of Wii U with a detailed and interactive map of Chicago to be displayed on the Wii U GamePad. The game also features off-TV play,Watch Dogs is an open-world action adventure game in which you must use any means at your disposal to take down a corrupt system. Watch Dogs takes advantage of Wii U with a detailed and interactive map of Chicago to be displayed on the Wii U GamePad. The game also features off-TV play, letting gamers continue playing Watch Dogs solely on the GamePad.… Expand"}, {"name": "Skydive: Proximity Flight", "details_link": "https://www.metacritic.com/game/playstation-3/skydive-proximity-flight", "publisher": "Gaijin Entertainment", "release_date": "Oct  1 2013", "developers": ["Gaijin Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Sports", "Alternative", "Individual", "Other", "Other"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/28b7426b9d53a94d969d288262d45c77-98.jpg", "descriptions": "Using motion controllers, Skydive players will be able to fly through the air by simply waving their arms and maneuvering their bodies. Realistic graphics, precise sounds, and stunning aerial landscapes will provide an immersive and exhilarating skydiving experience. Skydive players canUsing motion controllers, Skydive players will be able to fly through the air by simply waving their arms and maneuvering their bodies. Realistic graphics, precise sounds, and stunning aerial landscapes will provide an immersive and exhilarating skydiving experience. Skydive players can learn the mid-air tricks of professional skydivers and also make up their own tricks, either solo or with friends. Best of all, Skydive: Proximity Flight will make it possible for wide audience to enjoy the intense adrenaline rush of wingsuit flying… Expand"}, {"name": "Ship Simulator 2008", "details_link": "https://www.metacritic.com/game/pc/ship-simulator-2008", "publisher": "Lighthouse Interactive", "release_date": "Jan 21 2008", "developers": ["VSTEP"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Ship", "Ship", "Marine", "Civilian"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/092368f539891d464981b11f949842cc-98.jpg", "descriptions": "Ship Simulator 2008 includes the following new features: Dynamic ocean waves, with realistic ship motions. Long distance travels , open ocean voyages between ports. Visible damage system. Thirty new complex and challenging missions. Extensive day, night, and weather systems. Three newShip Simulator 2008 includes the following new features: Dynamic ocean waves, with realistic ship motions. Long distance travels , open ocean voyages between ports. Visible damage system. Thirty new complex and challenging missions. Extensive day, night, and weather systems. Three new environments: San Francisco, Southampton/Cowes/Solent, and Marseille. Six new ships, each with walkthrough functionality and interactive bridge controls. Controllable container crane. Advanced vector graphic sea chart based on realistic 3D seabed models, with full-screen display option, transparency setting, and level-of-detail on text & depth readings. Advanced damage system showing dents and holes in the ships after severe collisions. Free-roam mode where players can choose a ship, an environment, set all weather, day & time parameters and get sailing. Realistic bow splash water, with support from an advanced physics simulation model. Extensive mapping options for keys and joystick buttons. Advanced rope system, which allows you to connect and disconnect player ships to other ships or mooring boulders at will (anchoring is now also possible). Addition of icebergs which cause damage when you collide with them. [Lighthouse Interactive]… Expand"}, {"name": "Micro Machines V4", "details_link": "https://www.metacritic.com/game/ds/micro-machines-v4", "publisher": "Codemasters", "release_date": "Feb  6 2007", "developers": ["Supersonic Software"], "platforms": ["PC", "PlayStation 2", "DS"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 62, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/518e57614e878e194bb7dbe9adbf7285-98.jpg", "descriptions": "Mixing miniature mayhem with maximum multiplayer racing, Micro Machines v4 features knockabout, breakneck racing in the fastest scale miniatures, complete with explosive weapon power-ups. Letting you loose with hundreds of vehicles, each with distinctive performance abilities, you'll beMixing miniature mayhem with maximum multiplayer racing, Micro Machines v4 features knockabout, breakneck racing in the fastest scale miniatures, complete with explosive weapon power-ups. Letting you loose with hundreds of vehicles, each with distinctive performance abilities, you'll be racing your inch-long miniature motors on the wildest tracks where everyday household objects appear immense in size and can become lethal hazards. Sport cars, street racers, stock cars, 4x4s, beach buggies, lowriders and muscle cars are just some of the Micro Machines models you'll be taking out on the improvised tracks around the Micro Machines house, garden and - for the first time - beyond. Spin out around the breakfast table littered with cereal spills, tear through the kitchen but avoid literally burning tyre rubber on the blazing hot cooker, turbo boost around the pool table (while avoiding the treacherous pockets), or hit the gas as you drive around the rim of the bath, carefully negotiating the ferocious waters pouring over the edge of the bath (because someone left the tap running). [Codemasters]… Expand"}, {"name": "FIFA 06: Road to FIFA World Cup", "details_link": "https://www.metacritic.com/game/xbox-360/fifa-06-road-to-fifa-world-cup", "publisher": "EA Sports", "release_date": "Nov 16 2005", "developers": ["EA Canada"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 62, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/6df232b39009b9c25fd95035e9ce2f0d-98.jpg", "descriptions": "FIFA Soccer 06 brings the total football experience to your fingertips. It delivers a combination of attacking gameplay, complete customization, pure authenticity and the deepest manager mode ever. Intuitive gameplay enables you to command every move of your player with pinpoint accuracy.FIFA Soccer 06 brings the total football experience to your fingertips. It delivers a combination of attacking gameplay, complete customization, pure authenticity and the deepest manager mode ever. Intuitive gameplay enables you to command every move of your player with pinpoint accuracy. Passing, shooting and tackling is now more responsive than ever and enables you to trap, shield and dribble like a world-class football player. Experience 90 minutes of heart pumping football, feel the Team Chemistry of your side and the sense of momentum shift as you battle for supremacy on the pitch. As the Midfield General you'll control the overarching strategy of the game, dictating the pace and performance of your players as you execute strategic decisions on the fly using the tactical play button configurations. [EA Sports]… Expand"}, {"name": "Crimson Tears", "details_link": "https://www.metacritic.com/game/playstation-2/crimson-tears", "publisher": "Capcom", "release_date": "Jul 21 2004", "developers": ["DreamFactory"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 62, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/382471e508bfdc2f54d4228d83f713f5-98.jpg", "descriptions": "Crimson Tears is a futuristic 3D action game set in Tokyo, year 2049. Players take on the role of one of three inhuman \"biological war weapons\" that must battle hordes of enemies and maneuver through maze like environments as they investigate the cause of a mysterious disaster that has leftCrimson Tears is a futuristic 3D action game set in Tokyo, year 2049. Players take on the role of one of three inhuman \"biological war weapons\" that must battle hordes of enemies and maneuver through maze like environments as they investigate the cause of a mysterious disaster that has left the city incapacitated. Crimson Tears features distinctive cel-shaded 3D characters and fast-paced fighting action intermixed with stylish CG movie sequences that unfold the enigmatic sci-fi story.The three main characters explore the headquarters of \"A.R.M.A.,\" the weapons manufacturer that created them. A mysterious incident has affected areas around the compound and has warped the city and buildings into a persistently shifting labyrinth. Utilizing their martial arts training and weapons they find in the labyrinth, they must battle their way past waves of biological weapon creations and fight their way to the core of A.R.M.A., where the answers to the mysteries lie. [Capcom]… Expand"}, {"name": "Super Bomberman R", "details_link": "https://www.metacritic.com/game/switch/super-bomberman-r", "publisher": "Konami", "release_date": "Mar  3 2017", "developers": ["Konami"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Puzzle", "Action", "Arcade"], "meta_score": 62, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/a692a6a7687ba9675ff7f032d02ca7ad-98.jpg", "descriptions": "Since its release in 1985, Bomberman has been a familiar party-battle game for many years. Now, Bomberman is coming back as \"SUPER BOMBERMAN R\" to Nintendo Switch. In SUPER BOMBERMAN R, the simple rule remains the same: operate the main character (Bomberman), place bombs, and battle withSince its release in 1985, Bomberman has been a familiar party-battle game for many years. Now, Bomberman is coming back as \"SUPER BOMBERMAN R\" to Nintendo Switch. In SUPER BOMBERMAN R, the simple rule remains the same: operate the main character (Bomberman), place bombs, and battle with enemies and rivals, but it's coming back in a modern style with 3D stages and photo-real graphics. You can enjoy battles with rivals from all over the world. There is \"Battle\" mode for maximum of 8 players, and single play \"Story\" mode (cooperative play for 2 players is possible as well) where players clear each stage one by one, with a big volume of 50 stages. Also, there is a new rule where the condition to clear the stage is not just by wiping out all the enemies. This simple but strategic game with new rules and 3D stages is fun for everyone, from children to adults.… Expand"}, {"name": "Warsaw", "details_link": "https://www.metacritic.com/game/pc/warsaw", "publisher": "gaming company", "release_date": "Oct  2 2019", "developers": ["Pixelated Milk"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 62, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/98f61b8b39e750f266bd269336d03b02-98.jpg", "descriptions": "WARSAW is a challenging WWII turn-based tactical rpg taking place in a war torn city and sporting beautiful hand painted graphics. Lead a small, dedicated outfit of civilians and soldiers with their unique skills in their fight to take back the city besieged by occupying forces."}, {"name": "Need for Speed World", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-world", "publisher": "EA Games", "release_date": "Jul 27 2010", "developers": ["EA Black Box", "EA Singapore"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 62, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/0bd39d7f11eef1e18c6d69e760a2123c-98.jpg", "descriptions": "Need for Speed: World Online is a free-to-play street racing game featuring licensed cars and parts."}, {"name": "Devastation", "details_link": "https://www.metacritic.com/game/pc/devastation", "publisher": "Arush Entertainment", "release_date": "Mar 28 2003", "developers": ["Digitalo Studios"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 62, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/e359e8a2807815952991e98a356ba82b-98.jpg", "descriptions": "Devastation is a high-action, teamplay-oriented first-person shooter powered by heavily modified, next-generation Unreal Engine tech. Set on post-apocalyptic Earth, Devastation pits teams of rebelling street fighters, gang leaders, mercenaries, and ex-military operatives against overwhelmingDevastation is a high-action, teamplay-oriented first-person shooter powered by heavily modified, next-generation Unreal Engine tech. Set on post-apocalyptic Earth, Devastation pits teams of rebelling street fighters, gang leaders, mercenaries, and ex-military operatives against overwhelming armies of high-tech corporate troopers. Survival, and ultimate dominance, are all that matter in this devastated world. [ARUSH]… Expand"}, {"name": "Bakugan Battle Brawlers", "details_link": "https://www.metacritic.com/game/wii/bakugan-battle-brawlers", "publisher": "Activision", "release_date": "Oct 20 2009", "developers": ["Now Production"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/023eee10a7042cfd4ad487e5b4a7a9a0-98.jpg", "descriptions": "Bakugan is based on the story of Dan and his friends whose lives were forever changed when mysterious cards fell from the sky.  Creating a game from the cards where powerful creatures known as Bakugan battle, it wasn’t long before they discovered that their hobby was much more than just aBakugan is based on the story of Dan and his friends whose lives were forever changed when mysterious cards fell from the sky.  Creating a game from the cards where powerful creatures known as Bakugan battle, it wasn’t long before they discovered that their hobby was much more than just a simple pastime.  Utilizing special game cards Bakugan battle masters roll spheres onto the cards, which activate and transform into Bakugan “battle brawling” action figures. [Activision]… Expand"}, {"name": "Lone Ruin", "details_link": "https://www.metacritic.com/game/pc/lone-ruin", "publisher": "Super Rare Games", "release_date": "Jan 12 2023", "developers": ["Cuddle Monster Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/3868bda59cd2550a519d6d1fdb4f3ad1-98.jpg", "descriptions": "LONE RUIN is a spell-based roguelike twin-stick shooter with a focus on replayability. Play as an explorer who seeks a mysterious ancient power and venture in a ruined magical city, built atop a source of magic used by olden mages to power and transform themselves.\r \rDive deeper andLONE RUIN is a spell-based roguelike twin-stick shooter with a focus on replayability. Play as an explorer who seeks a mysterious ancient power and venture in a ruined magical city, built atop a source of magic used by olden mages to power and transform themselves.\r \rDive deeper and deeper, battling your way through twisted creatures, utilising your very own magic abilities to ultimately reach the center of the Lone Ruin.… Expand"}, {"name": "Vampire: The Masquerade - Swansong", "details_link": "https://www.metacritic.com/game/xbox-series-x/vampire-the-masquerade---swansong", "publisher": "Nacon", "release_date": "Jun 14 2022", "developers": ["Big Bad Wolf"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 62, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/1/8d48c30dc5e068f2b2ac4e900311893b-98.jpg", "descriptions": "What if vampires were real? What if these bloodthirsty predators lived hidden among us, meticulously and skilfully hatching ancient conspiracies? And what if you became one of them? In Vampire: The Masquerade - Swansong, you play as these alluring monsters in a sophisticated world where theWhat if vampires were real? What if these bloodthirsty predators lived hidden among us, meticulously and skilfully hatching ancient conspiracies? And what if you became one of them? In Vampire: The Masquerade - Swansong, you play as these alluring monsters in a sophisticated world where the lines between the real and supernatural are always blurred.Hazel Iversen, the Swan, is the new Prince of the Boston Camarilla. An iron hand in a velvet glove, she intends to assert her power and respect the Masquerade, the vampiric law designed to ensure humans never learn of the existence of these creatures of the night. But nothing works as planned. With rumours of plots, murders and power struggles, you must work in the shadows to protect your Sect in a frantic investigation that plunges Boston into chaos.Play as 3 vampires who are over a hundred years old. Progress through the game through their intertwined destinies, deal with their different points of view and use their character sheets to try to separate the truth from the lies. Each character has their own abilities and vampiric disciplines that you can upgrade individually to suit your preferred approach.Will you choose intimidation, seduction or stealth? It's your decision, as long as you can sate your Hunger for blood.With its unique approach to gameplay, Swansong puts emphasis on the consequences of your actions in both the investigation and your social interactions with characters. Analyse each situation carefully because your decisions can have huge consequences on your heroes' lives and the fate of the Boston Camarilla.… Expand"}, {"name": "Hood: Outlaws & Legends", "details_link": "https://www.metacritic.com/game/pc/hood-outlaws-legends", "publisher": "Focus Home Interactive", "release_date": "May 10 2021", "developers": ["Sumo Newcastle"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "General"], "meta_score": 62, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/5/fc82760d502288ec307c539cab14e193-98.jpg", "descriptions": "In a violent, medieval world, outplay rival gangs in intense PvPvE multiplayer heists. Moving in stealth to steal treasures unseen or dominating through loud and brutal combat, only the best will escape with hard-earned riches."}, {"name": "Sniper Elite V2 Remastered", "details_link": "https://www.metacritic.com/game/switch/sniper-elite-v2-remastered", "publisher": "Rebellion", "release_date": "May 14 2019", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/b62c4e693ab25edbe1b3940d90608a89-98.jpg", "descriptions": "You are elite sniper Karl Fairburne, parachuted into Berlin amidst the Germans' final stand. Your mission is to prevent Nazi V2 rocket technology falling into the hands of the Red Army. You must aid key scientists keen to defect to the US, and terminate those who stand in your way.StealthYou are elite sniper Karl Fairburne, parachuted into Berlin amidst the Germans' final stand. Your mission is to prevent Nazi V2 rocket technology falling into the hands of the Red Army. You must aid key scientists keen to defect to the US, and terminate those who stand in your way.Stealth is key as you find yourself trapped between two desperate armies in a race against time. Master authentic weaponry, stalk your target, fortify your position, set up the shot, and use your skill, patience and cunning to achieve the mission.All new graphics and rendering technology gives you improved ball busting X-ray kill camera detail. Witness the terrifying power of your bullet as it enters an enemy's body.With all DLC missions included, take the fate of the war into your own hands, and hunt the Fuhrer himself.… Expand"}, {"name": "Velocibox", "details_link": "https://www.metacritic.com/game/playstation-4/velocibox", "publisher": "LOOT Entertainment", "release_date": "Jul 28 2015", "developers": ["Shawn Beck"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "General", "Arcade"], "meta_score": 62, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/6883c39ab357382e371ad5075351f7c4-98.jpg", "descriptions": "Experience lightning-fast twitch gameplay, with mind-bending flips and spins, that is sure to challenge (and maybe frustrate) even the most hardcore of hardcore gamers. Velocibox promises to test your abilities to the brink, and beyond. Advance through 80+ patterns and levels by dodgingExperience lightning-fast twitch gameplay, with mind-bending flips and spins, that is sure to challenge (and maybe frustrate) even the most hardcore of hardcore gamers. Velocibox promises to test your abilities to the brink, and beyond. Advance through 80+ patterns and levels by dodging obstacles at break neck speeds. Rely on split second reactions and instincts as you flip and rotate sideways to navigate through each diabolical level. [Sony]… Expand"}, {"name": "Wings of War", "details_link": "https://www.metacritic.com/game/xbox/wings-of-war", "publisher": "Gathering", "release_date": "Aug 30 2004", "developers": ["Silver Wish Games"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Simulation", "Flight", "WWI"], "meta_score": 62, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/e0238957fc020277de5571eee4ebf6f4-98.jpg", "descriptions": "In Wings of War, you can become one of the high-flying heroes who rule the skies. As a rookie pilot, you must demonstrate your courage against enemy planes by fighting in aerial duels. The dogfights take place in a variety of environments, which feature weather effects, seasonal changes, andIn Wings of War, you can become one of the high-flying heroes who rule the skies. As a rookie pilot, you must demonstrate your courage against enemy planes by fighting in aerial duels. The dogfights take place in a variety of environments, which feature weather effects, seasonal changes, and combat scenarios. In addition to more than 70 missions, the game features side quests that range from delivering black-market goods to assassinating enemy officers. If you are good enough, you'll soon earn medals and ranks, fortune, and glory.… Expand"}, {"name": "Ford Racing 2", "details_link": "https://www.metacritic.com/game/xbox/ford-racing-2", "publisher": "Take-Two Interactive", "release_date": "Nov  3 2003", "developers": ["Razorworks Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/baa083e5f2c9c29ac0fd7d55dcef81b1-98.jpg", "descriptions": "The sequel to Ford Racing has arrived.  Ford Racing 2 has new and improved cars, added tracks and challenges, and more thrills than ever.  With an expanded selection of Ford vehicles--ranging from the '49 Ford to the latest Mustang GT Concept--picking out a car will be a lot harder than youThe sequel to Ford Racing has arrived.  Ford Racing 2 has new and improved cars, added tracks and challenges, and more thrills than ever.  With an expanded selection of Ford vehicles--ranging from the '49 Ford to the latest Mustang GT Concept--picking out a car will be a lot harder than you expect.  Get a feel for each car on a diverse set of tracks including Road Tracks, City Limits, Ovals, Spring Break, and Lost World.  Ford Racing 2 is ready to put you in the driver's seat, but are you daring enough to sit there?… Expand"}, {"name": "Republic: The Revolution", "details_link": "https://www.metacritic.com/game/pc/republic-the-revolution", "publisher": "Eidos Interactive", "release_date": "Aug 27 2003", "developers": ["Elixir Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Modern", "General", "Modern"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/242ab3ede7fe27db4e22386e7ac38e5a-98.jpg", "descriptions": "Novistrana, an ex-Soviet state, ruled by a corrupt and brutal dictator. With a personal vendetta against the President and discontent spreading throughout the nation, now is the moment to seize power. Time to start a revolution - will it be to liberate the masses or to become their newNovistrana, an ex-Soviet state, ruled by a corrupt and brutal dictator. With a personal vendetta against the President and discontent spreading throughout the nation, now is the moment to seize power. Time to start a revolution - will it be to liberate the masses or to become their new oppressor? Starting with a single loyal supporter create a powerful nationwide faction strong enough to oust the President and take control. Using either your Influence, Wealth and Force, gain the allegiance of prominent public figures including members of the Secret Police, Councillors, Celebrities, Priests, and Criminals. Hundreds of diverse actions enable you to order and manipulate the masses from rallies and riots to constructing crime syndicates, holding charity galas, organising secret police 'hits' or broadcasting news propaganda. Threats come from seven other factions, all vying for supreme control. Over-shadowing everything is the President who will do anything to hold onto power. Be as ruthless or as compassionate as you want, but beware, as every action can have untold repercussions and consequences on the future of your Republic. [Eidos Interactive]… Expand"}, {"name": "Enter the Matrix", "details_link": "https://www.metacritic.com/game/playstation-2/enter-the-matrix", "publisher": "Atari", "release_date": "May 14 2003", "developers": ["Shiny Entertainment"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 62, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/bb7a6890aaca2d75e88f0f0bb47c5142-98.jpg", "descriptions": "Merciless Agents stalk your every move. You'll dodge their bullets. Defy gravity. Break all the rules. Explore the hidden depths of the massive dreamworld that has enslaved the human race. How far down does the rabbit hole go? Are you ready to find out? Are you ready to Enter the Matrix?Merciless Agents stalk your every move. You'll dodge their bullets. Defy gravity. Break all the rules. Explore the hidden depths of the massive dreamworld that has enslaved the human race. How far down does the rabbit hole go? Are you ready to find out? Are you ready to Enter the Matrix? Enter the Matrix features awesome gunplay and spectacular martial arts that bend the rules of the Matrix, insane driving and stunts, and the chance to pilot the fastest hovercraft in the fleet. This game isn't just set in the Matrix universe - it's an integral part of the entire Matrix experience, with a story that weaves in and out of The Matrix: Reloaded, the sequel to the Academy Award-winner. Enter the Matrix is the story-behind-the-story. [Infogrames]… Expand"}, {"name": "Conflict: Desert Storm", "details_link": "https://www.metacritic.com/game/gamecube/conflict-desert-storm", "publisher": "Gotham Games", "release_date": "Apr 22 2003", "developers": ["Pivotal Games"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 62, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/55c448d22bb1ae80c7805a4595ad22d4-98.jpg", "descriptions": "Conflict: Desert Storm lets you lead one of the best known and most feared special operations forces in the world: the elite British SAS or the US Delta Force.  Covert missions take you through hostile environments where only your expertise in stealth, tactics, and firepower will ensure theConflict: Desert Storm lets you lead one of the best known and most feared special operations forces in the world: the elite British SAS or the US Delta Force.  Covert missions take you through hostile environments where only your expertise in stealth, tactics, and firepower will ensure the success and safety of your men.  Your missions are as unpredictable as they are dangerous: from vital scud-hunting missions deep within enemy territory to highly secretive rescue and assassination operations in Baghdad itself.  … Expand"}, {"name": "Legends of Wrestling II", "details_link": "https://www.metacritic.com/game/xbox/legends-of-wrestling-ii", "publisher": "Acclaim", "release_date": "Dec  5 2002", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/04185e82b24eb76f4b439a6e485032de-98.jpg", "descriptions": "Legends of Wrestling II takes you through the wrestling hall of fame with the top grapplers that are battling for squared-circle supremacy. Play as your favorite wrestler--including Hulk Hogan, Andre \"The Giant,\" and Bret \"Hitman\" Hart--each with signature entrances,Legends of Wrestling II takes you through the wrestling hall of fame with the top grapplers that are battling for squared-circle supremacy. Play as your favorite wrestler--including Hulk Hogan, Andre \"The Giant,\" and Bret \"Hitman\" Hart--each with signature entrances, taunts, and moves. A new storyline and career mode let you battle for the respect of promoters and fans while fighting for the heavyweight championship crown. The game also features tag-team tournaments, a $15,000 Body Slam Challenge, and a variety of match types.… Expand"}, {"name": "One Piece Mansion", "details_link": "https://www.metacritic.com/game/playstation/one-piece-mansion", "publisher": "Capcom", "release_date": "Sep 30 2001", "developers": ["Capcom"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/2386b46f3580aa5031642122dd72910e-98.jpg", "descriptions": "Offering an unfamiliar style of addictive puzzle gameplay and boasting the personality of a vast assortment of wacky characters, One Piece Mansion is a fine buy for fans of the genre."}, {"name": "Kengo: Master of Bushido", "details_link": "https://www.metacritic.com/game/playstation-2/kengo-master-of-bushido", "publisher": "Crave", "release_date": "Jan  3 2001", "developers": ["Light Weight"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 62, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/9f87f7256cd3c88dfd268b5f088dd7c9-98.jpg", "descriptions": "The mind is a powerful weapon. So is the sword. When combined, they create the ultimate force. To be a Samurai master, you must silence one and make fierce the other. The rhythm of battle awaits you. Now, go young apprentice, and earn your glory."}, {"name": "Dynasty Warriors", "details_link": "https://www.metacritic.com/game/psp/dynasty-warriors", "publisher": "Koei", "release_date": "Mar 16 2005", "developers": ["Koei", "Omega Force"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "Fighting", "3D"], "meta_score": 62, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/607696f907436f332d3ca7cea1041f30-98.jpg", "descriptions": "Based on Luo Guanzhong’s historic novel, Romance of the Three Kingdoms, the Dynasty Warriors series of Tactical Action games takes players back in time when chaos ruled Ancient China. The new Battlefield Area System creates new strategic gameplay and allows for shorter periods of play idealBased on Luo Guanzhong’s historic novel, Romance of the Three Kingdoms, the Dynasty Warriors series of Tactical Action games takes players back in time when chaos ruled Ancient China. The new Battlefield Area System creates new strategic gameplay and allows for shorter periods of play ideal for the mobile environment. The \"Second-in-command\" Officer System gives bodyguards special skills that you control. With hundreds of \"Second-in-command\" officers to discover, you can collect and select which officers you take into battle and exchange them using the Memory Stick Duo. Play as 42 Dynasty Warriors from all Three Kingdoms and Unaligned forces. Includes Musou mode and Free mode. Uncover seven stories from China's turbulent past. Mount stampeding elephants and swift horses then ride into battle! [KOEI]… Expand"}, {"name": "Zombie Army Trilogy", "details_link": "https://www.metacritic.com/game/xbox-one/zombie-army-trilogy", "publisher": "Rebellion", "release_date": "Mar  6 2015", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/dea3ac987210619129e4d864c8f79915-98.jpg", "descriptions": "In the dying embers of World War II, Hitler has unleashed one final, unholy gamble – a legion of undead super soldiers that threatens to swallow up the whole of Europe. Fight alone or team up to save humanity from the zombie menace in this apocalyptic third-person shooter."}, {"name": "Test Drive: Ferrari Racing Legends", "details_link": "https://www.metacritic.com/game/playstation-3/test-drive-ferrari-racing-legends", "publisher": "Evolved Games", "release_date": "Jul  3 2012", "developers": ["Atari", "Slightly Mad Studios", "Atari SA"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "General", "General", "Automobile"], "meta_score": 62, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/8/d520757399fef954e06502b035d295f9-98.jpg", "descriptions": "Test Drive: Ferrari Racing Legends is a driving experience for fans of the Ferrari brand."}, {"name": "The Settlers History Collection", "details_link": "https://www.metacritic.com/game/pc/the-settlers-history-collection", "publisher": "Ubisoft", "release_date": "Nov 15 2018", "developers": ["Ubisoft Blue Byte"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 62, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": null}, {"name": "Total War: Rome II - Empire Divided", "details_link": "https://www.metacritic.com/game/pc/total-war-rome-ii---empire-divided", "publisher": "Sega", "release_date": "Nov 30 2017", "developers": ["Creative Assembly"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 62, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/783326df9f7ad38761595983005cbada-98.jpg", "descriptions": "The year is 270 AD. A string of inept emperors and usurpers vying for power has led the Roman Empire into near-total economic collapse. This is its gravest crisis yet. Eager to capitalise on Rome’s instability, barbarian tribes gather like a storm on the borders, to plunder the riches ofThe year is 270 AD. A string of inept emperors and usurpers vying for power has led the Roman Empire into near-total economic collapse. This is its gravest crisis yet. Eager to capitalise on Rome’s instability, barbarian tribes gather like a storm on the borders, to plunder the riches of civilisation. To the east, the Sassanids set out on a grand conquest that culminates with an assault against Roman lands. They are held back only by a staunch defence led by Palmyra. Queen Zenobia holds fast – but for how long?… Expand"}]