[{"name": "Tom Clancy's The Division - Underground", "details_link": "https://www.metacritic.com/game/xbox-one/tom-clancys-the-division---underground", "publisher": "Ubisoft", "release_date": "Jun 28 2016", "developers": ["Massive Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Arcade"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/67811a34de23c55db7975daa144d7c54-98.jpg", "descriptions": "Dive into the underbelly of New York to save what remains in Underground, the first expansion for Tom Clancy’s The Division. Explore the randomly generated mazes of subways, tunnels and sewers to fight deadly enemies and recover powerful loot. Experience an all-new incursion and find theDive into the underbelly of New York to save what remains in Underground, the first expansion for Tom Clancy’s The Division. Explore the randomly generated mazes of subways, tunnels and sewers to fight deadly enemies and recover powerful loot. Experience an all-new incursion and find the latest weapons, gear and more.… Expand"}, {"name": "The Dark Spire", "details_link": "https://www.metacritic.com/game/ds/the-dark-spire", "publisher": "Atlus", "release_date": "Apr 14 2009", "developers": ["Success"], "platforms": "DS", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/7dfcb00b9d76af7f5973a6040780af8d-98.jpg", "descriptions": "The Dark Spire is an RPG of exploration and character development in the purest sense. Parties will be assembled, stats will be rolled, items, weapons and armor shall be equipped, and monsters will be slain. [Atlus USA]"}, {"name": "Raji: An Ancient Epic", "details_link": "https://www.metacritic.com/game/switch/raji-an-ancient-epic", "publisher": "SUPER.COM", "release_date": "Aug 18 2020", "developers": ["Nodding Heads Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/683e989ec92016f7f5ac289c40a48394-98.jpg", "descriptions": "Raji: An Ancient Epic is an action-adventure game set in ancient India. A young girl named Raji has been chosen by the gods to stand against the demonic invasion of the human realm. Her destiny? To rescue her younger brother and face the demon lord Mahabalasura."}, {"name": "Sea of Thieves", "details_link": "https://www.metacritic.com/game/xbox-one/sea-of-thieves", "publisher": "Microsoft Game Studios", "release_date": "Mar 20 2018", "developers": ["Rare Ltd."], "platforms": ["PC", "Xbox Series X", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action Adventure", "Massively Multiplayer", "Open-World"], "meta_score": 69, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/0/0f9f1b8bdd8b724b345d8e14e80d4d00-98.jpg", "descriptions": "Be The Pirate You Want To Be - With musket loaded and grog in hand, the freedom of the pirate life awaits. What will your legend be? An epic multiplayer adventure. Crew up and set sail on memorable voyages. Make and break your pirates' code on the Sea of Thieves. A treacherous shared world.Be The Pirate You Want To Be - With musket loaded and grog in hand, the freedom of the pirate life awaits. What will your legend be? An epic multiplayer adventure. Crew up and set sail on memorable voyages. Make and break your pirates' code on the Sea of Thieves. A treacherous shared world. Plot your course and set sail for hidden riches. Navigate the perils of a fantastical world and the danger of rival crews.… Expand"}, {"name": "The Spectrum Retreat", "details_link": "https://www.metacritic.com/game/xbox-one/the-spectrum-retreat", "publisher": "Ripstone", "release_date": "Jul 13 2018", "developers": ["Dan Smith Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/7f642cf19705d28464c13247e4b26a91-98.jpg", "descriptions": "A challenging, first-person puzzle game set in the near future when you will explore a striking art-deco hotel that holds a deep-seeded mystery surrounding your current stay. Your desire to unearth the truth is obstructed by an array of color-coded puzzles, mind-bending physics challenges,A challenging, first-person puzzle game set in the near future when you will explore a striking art-deco hotel that holds a deep-seeded mystery surrounding your current stay. Your desire to unearth the truth is obstructed by an array of color-coded puzzles, mind-bending physics challenges, and the growing fear of exposing your true intentions. … Expand"}, {"name": "Okhlos", "details_link": "https://www.metacritic.com/game/pc/okhlos", "publisher": "Devolver Digital", "release_date": "Aug 18 2016", "developers": ["Coffee Powered Machine"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/154e81e708387afcb3500fef69ce3d76-98.jpg", "descriptions": "Squeeze into your toga and slide on your sandals to rally the angry mobs of Okhlos and bring down the oppressive god of mythological Greece."}, {"name": "Lume", "details_link": "https://www.metacritic.com/game/pc/lume", "publisher": "State of Play Games", "release_date": "May  9 2011", "developers": ["State of Play Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 69, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/09a07c24ce4afd5d2fa475bad767f3ab-98.jpg", "descriptions": "Lume: An illuminating puzzle adventure!\r With a set built entirely out of paper and cardboard, and sumptuously filmed, Lume is a game with a style unlike any other.\r\n\r\nPower to your grandads house has failed. Whats more, hes nowhere to be seen. Immerse yourself in Lumes photoreal world,Lume: An illuminating puzzle adventure!\r With a set built entirely out of paper and cardboard, and sumptuously filmed, Lume is a game with a style unlike any other.\r Power to your grandads house has failed. Whats more, hes nowhere to be seen. Immerse yourself in Lumes photoreal world, solve perplexing paper puzzles to help restore the power, and uncover a deeper mystery behind the blackout.\r This game forms Part 1 of a larger, ongoing story.… Expand"}, {"name": "Rust", "details_link": "https://www.metacritic.com/game/pc/rust", "publisher": "Facepunch Studios", "release_date": "Feb  8 2018", "developers": ["Facepunch Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Historic", "Action Adventure", "Survival"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/18d5baa3494a76108c7fd0c588268798-98.jpg", "descriptions": "Rust is a survival game created by Facepunch Studios. Inspired by games like DayZ, Minecraft and Stalker – Rust aims to create a hostile environment in which emergent gameplay can flourish. The aim of the game is to survive. To do this the player should gather resources. Hitting a tree withRust is a survival game created by Facepunch Studios. Inspired by games like DayZ, Minecraft and Stalker – Rust aims to create a hostile environment in which emergent gameplay can flourish. The aim of the game is to survive. To do this the player should gather resources. Hitting a tree with a rock will give you wood, hitting a rock with a rock will give you rock and ore. You can then craft a hatchet from the wood and rock, allowing you to gather faster. You can go out and hunt a variety of wildlife such as boars, chickens, rabbits, bears, wolves and deer. Once you have killed an animal you can butcher it to gather its meat and skin. You can craft a fire using wood and cook the meat inside the fire. Then you can eat. You face two major dangers in game. Rust is a multiplayer game, so there will be other players trying to survive in the same way that you are. Unfortunately for you they can find you, kill you and take your stuff. Fortunately for you – you can kill them and take their stuff. Or maybe you can make friends and help each other survive. Rust’s world is harsh – so you might need to make friends to survive. The environment is not kind. Bears and wolves will chase and kill you. Falling from a height will kill you. Being exposed to radiation for an extended period will kill you. Starving will kill you. Being cold will kill you.… Expand"}, {"name": "The Walking Dead: The Telltale Series - A New Frontier Episode 3: Above the Law", "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-the-telltale-series---a-new-frontier-episode-3-above-the-law", "publisher": "Telltale Games", "release_date": "Mar 28 2017", "developers": ["Telltale Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 69, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/f34dc84fb0783c18060cfd94f27d918a-98.jpg", "descriptions": "After the events of 'Ties That Bind: Part Two', Javier struggles to find a role in his family. Meanwhile, tension within the walls of Richmond grow. Will Clementine and the rest of the group turn against Javier? It may be time to choose between the family you're born into and the family you've made."}, {"name": "SWAT: Global Strike Team", "details_link": "https://www.metacritic.com/game/playstation-2/swat-global-strike-team", "publisher": "Sierra Entertainment", "release_date": "Oct 29 2003", "developers": ["Argonaut Games"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/386b3f942e8f29edfe3c46b84a97a0f9-98.jpg", "descriptions": "It's 2018 and you're in command of the recently formed SWAT: Global Strike Team ? a squad comprised of the three best operators the special forces and law enforcement communities have to offer. Your task is to use all means available, including cutting-edge weaponry and next-generation gear,It's 2018 and you're in command of the recently formed SWAT: Global Strike Team ? a squad comprised of the three best operators the special forces and law enforcement communities have to offer. Your task is to use all means available, including cutting-edge weaponry and next-generation gear, to bring international criminals to justice. To succeed, you'll need to master the skills of close-quarters combat, long-range shooting, and high tech equipment operation. You must also issue essential commands to your teammates via the controller or the optional voice recognition microphone. If you have what it takes to beat the 21 single player missions, grab a friend and battle through 10 unique multiplayer-only missions. Both modes showcase an amazing level of graphical sophistication, including hard-edged shadows and an Iris Effect lighting system that mimics the way the human eye works when moving between light and dark areas. These features and more ensure that the environments in SWAT: GST are the most photorealistic possible. [Sierra]… Expand"}, {"name": "Freaky Flyers", "details_link": "https://www.metacritic.com/game/gamecube/freaky-flyers", "publisher": "Midway", "release_date": "Aug  8 2003", "developers": ["Midway"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/95c984f709e864389ad92968d6064801-98.jpg", "descriptions": "Freaky Flyers takes you into the air for fast-and-furious racing with an interesting cast of animated characters. You'll either play as or encounter more than a dozen characters including an American hero, a female bandit from south of the border, and a mellow ambassador of tropicalFreaky Flyers takes you into the air for fast-and-furious racing with an interesting cast of animated characters. You'll either play as or encounter more than a dozen characters including an American hero, a female bandit from south of the border, and a mellow ambassador of tropical paradise. Explore, adventure, and dogfight in the skies over Danger Island, Haunted Transylvania, and Roaring Chicago. Pirates, haunted castles, and mob bosses all lie ahead of you--are you skilled enough to overcome these dangers?… Expand"}, {"name": "Hulk", "details_link": "https://www.metacritic.com/game/xbox/hulk", "publisher": "Universal Interactive", "release_date": "May 27 2003", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/98f55fda834400d18f52b5b342141291-98.jpg", "descriptions": "The Hulk takes place one year after the events in the film, with troubled scientist Bruce Banner and his enraged alter ego, The Hulk, forced into action once again. A new villain, known as The Leader, plans to use The Hulk's gamma energy to unleash a relentless army of gamma creatures on theThe Hulk takes place one year after the events in the film, with troubled scientist Bruce Banner and his enraged alter ego, The Hulk, forced into action once again. A new villain, known as The Leader, plans to use The Hulk's gamma energy to unleash a relentless army of gamma creatures on the world, and only you can stop him. Employ the powers of stealth and logic as Bruce Banner, or command the incredible strength and fury of The Hulk. Take down your foes in fully destructible environments. The Hulk's 25 attacks can hurt your foes and can also destroy your environment.… Expand"}, {"name": "Combat Flight Simulator 3: Battle for Europe", "details_link": "https://www.metacritic.com/game/pc/combat-flight-simulator-3-battle-for-europe", "publisher": "Microsoft Game Studios", "release_date": "Oct 25 2002", "developers": ["Microsoft Game Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/e0a3f6dde4354055df7b1c26ba5a7372-98.jpg", "descriptions": "Feel the adrenaline rush as you start strafing enemy positions at 350 mph, 600 feet above the European countryside, guns blazing and bombs blasting. In Combat Flight Simulator 3 (CFS3) you can fly for the USAAF, RAF, or the Luftwaffe in some of the most advanced and exotic aircraft of WWII.Feel the adrenaline rush as you start strafing enemy positions at 350 mph, 600 feet above the European countryside, guns blazing and bombs blasting. In Combat Flight Simulator 3 (CFS3) you can fly for the USAAF, RAF, or the Luftwaffe in some of the most advanced and exotic aircraft of WWII. [Microsoft]… Expand"}, {"name": "Eurofighter Typhoon", "details_link": "https://www.metacritic.com/game/pc/eurofighter-typhoon", "publisher": "Take-Two Interactive", "release_date": "Jul 30 2001", "developers": ["Rage Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/a0a64a1a95363c7fe42eb67c63e27e09-98.jpg", "descriptions": "Lead a small squad of highly trained fighter pilots on up to 100 possible missions against a fierce, aggressive force set on world domination. Outnumbered, but superbly equipped, you must destroy enemy tanks, sink supply ships, and out-maneuver supersonic jets!  [Take 2 Interactive]"}, {"name": "Strider 2", "details_link": "https://www.metacritic.com/game/playstation/strider-2", "publisher": "Capcom", "release_date": "Jul 29 2000", "developers": ["Capcom"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/767a2e7e1650d08aa64389f775b4f7da-98.jpg", "descriptions": "Out from the underbelly of a dark and dangerous future, emerges an elusive hero who wages war for peace and justice. Now, one of the world's most legendary heroes, Strider Hiryu, returns on the PlayStation® game console. Armed with his light sword, Cypher, Strider blazes through theOut from the underbelly of a dark and dangerous future, emerges an elusive hero who wages war for peace and justice. Now, one of the world's most legendary heroes, Strider Hiryu, returns on the PlayStation® game console. Armed with his light sword, Cypher, Strider blazes through the darkness to battle the evil dictator, Grandmasters. Featuring 2 discs of gritty action adventure, this highly anticipated sequel also includes an incredible bonus... the original Strider game.… Expand"}, {"name": "Silhouette Mirage", "details_link": "https://www.metacritic.com/game/playstation/silhouette-mirage", "publisher": "Working Designs", "release_date": "Dec 31 1999", "developers": ["Treasure"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/d1ed12710e6b001323dc8894bf9ca4b9-98.jpg", "descriptions": "In an apocalyptic future, the Edo computer has gone beserk, dividing the world's inhabitants into two mutant classes. Silhouette and Mirage. Now, the watchguard computer safety system has sent forth the Messenger of Justice to travel to Edo and repair the damage before the world is lostIn an apocalyptic future, the Edo computer has gone beserk, dividing the world's inhabitants into two mutant classes. Silhouette and Mirage. Now, the watchguard computer safety system has sent forth the Messenger of Justice to travel to Edo and repair the damage before the world is lost forever. As the Messenger, Shyna Nera Shyna, blast, beat, and bash your way through seven wild and bizarre stages using friendly parasite weapons to aid your advance against wacky enemies, huge fully-animated bosses, and devilshly difficult obstacles. Providing the utmost in playability and replayability, the game wizards at Treasure, the brilliant minds behinds such international hits as Gunstar Heroes™, Dynamite Headdy™, Mischief Makers™, and Guardian Heroes™ have come up with another sure-fire classic that pushes the 2-D capabilities of your PlayStation® game console to its limit, and come up with a hit!… Expand"}, {"name": "Fatal Frame: Mask of the Lunar Eclipse", "details_link": "https://www.metacritic.com/game/pc/fatal-frame-mask-of-the-lunar-eclipse", "publisher": "Koei Tecmo Games", "release_date": "Mar  9 2023", "developers": ["Koei Tecmo Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/fc591caff5f9b4cb27c49b0cd20b9cdf-98.jpg", "descriptions": "Fatal Frame (aka Project Zero): Mask of the Lunar Eclipse takes place a decade after five girls mysteriously disappeared at a festival on Rogetsu Isle, an island in southern Japan. While all of the girls were eventually rescued, their memories were lost, with only the faint remembrance of aFatal Frame (aka Project Zero): Mask of the Lunar Eclipse takes place a decade after five girls mysteriously disappeared at a festival on Rogetsu Isle, an island in southern Japan. While all of the girls were eventually rescued, their memories were lost, with only the faint remembrance of a single melody and a seemingly possessed masked woman dancing in the moonlight. \r\rNow, ten years later, with still no memory of the events surrounding their disappearance, two of the five girls have died - discovered with covered faces and found in a tragic, crying pose. The remaining three girls now head off to the eerie island to solve the mystery of their friends' death, while also unlocking the mystery of the memories left behind.\r The remastered game features an all-new Photo Mode, along with new and altered costumes, and enhanced graphics including the improved rendering of shadows and light, delivering a more immersive and frightening experience. In addition, in-game movies and character models have been brushed-up to deliver a story that shines, both narratively and aesthetically as the three remaining girls attempt to rediscover their past before becoming victims once again.… Expand"}, {"name": "Biomutant", "details_link": "https://www.metacritic.com/game/playstation-5/biomutant", "publisher": "THQ Nordic", "release_date": "Sep  6 2022", "developers": ["Experiment 101"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/dfc725800da426156c973ccd54769158-98.jpg", "descriptions": "Biomutant is an open-word, post-apocalyptic Kung-Fu fable RPG, with a unique martial arts styled combat system allowing you to mix melee, shooting and mutant ability action.Your actions play a major part in the unfolding of a story where End is coming to the New World. A plague is ruiningBiomutant is an open-word, post-apocalyptic Kung-Fu fable RPG, with a unique martial arts styled combat system allowing you to mix melee, shooting and mutant ability action.Your actions play a major part in the unfolding of a story where End is coming to the New World. A plague is ruining the land and the Tree-of-Life is bleeding death from its roots. The Tribes stand divided, in need of someone strong enough to unite them or bring them all down...Although you are guided through the world by a Storyteller that narrates every step of your journey, it's your actions and choices that'll decide how your story of survival ends.… Expand"}, {"name": "Assassin's Creed Valhalla: The Siege of Paris", "details_link": "https://www.metacritic.com/game/xbox-series-x/assassins-creed-valhalla-the-siege-of-paris", "publisher": "Ubisoft", "release_date": "Aug 12 2021", "developers": ["Ubisoft Singapore"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "genres": ["Action Adventure", "Open-World"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/0af0d952a2217d91fd906e258a855037-98.jpg", "descriptions": "The Siege of Paris sees Eivor embark upon a new series of quests in Francia, the largest of the post-Roman barbarian kingdoms in Western Europe. New weapons, abilities, gear, and skills are all be up for grabs, and Infiltration Missions returns as well, enabling players to determine exactlyThe Siege of Paris sees Eivor embark upon a new series of quests in Francia, the largest of the post-Roman barbarian kingdoms in Western Europe. New weapons, abilities, gear, and skills are all be up for grabs, and Infiltration Missions returns as well, enabling players to determine exactly how they go about murdering their assigned targets.… Expand"}, {"name": "9 Monkeys of Shaolin", "details_link": "https://www.metacritic.com/game/switch/9-monkeys-of-shaolin", "publisher": "Buka Entertainment", "release_date": "Oct 16 2020", "developers": ["Sobaka"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/5ef16b467cf8a183c1257c22bfffb9c5-98.jpg", "descriptions": "9 Monkeys of Shaolin  marks a rebirth of the iconic beat 'em up genre in vein of old-school video games. If, as a kid you had hours of fun playing SNES or SEGA beat 'em up videogames crushing foes left and right then this new title from the creators of hardcore brawler REDEEMER is definitely9 Monkeys of Shaolin  marks a rebirth of the iconic beat 'em up genre in vein of old-school video games. If, as a kid you had hours of fun playing SNES or SEGA beat 'em up videogames crushing foes left and right then this new title from the creators of hardcore brawler REDEEMER is definitely for you. As a mere Chinese fisherman Wei Cheng you have to avenge the death of your friends and family slaughtered in a pirate raid at your peaceful village. Game protagonist is quite a tough nut to crack as he knows the basics of ancient martial arts only mastered by legendary Shaolin monks. Get your trusty battle staff ready for a challenging adventure in Medieval China and for merciless fights with hordes of various enemies. Action-packed battles, user friendly controls and incredible atmosphere of great kung-fu movies of 70s – all this makes 9 Monkeys of Shaolin a choice for every true fan of really hardcore brawlers.… Expand"}, {"name": "Spinch", "details_link": "https://www.metacritic.com/game/switch/spinch", "publisher": "iam8bit", "release_date": "Sep  3 2020", "developers": ["Queen Bee Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/0d0a8d205a4591d60889e4852c19a25d-98.jpg", "descriptions": "Transcend the material realm and assume your true form as Spinch, a hyper-agile organism consumed by the quest to rescue a litter of its missing offspring. Enter into a world thick with bubbling psychedelia, swelling with an endless population of misshapen and malformed enemies. Disrupt yourTranscend the material realm and assume your true form as Spinch, a hyper-agile organism consumed by the quest to rescue a litter of its missing offspring. Enter into a world thick with bubbling psychedelia, swelling with an endless population of misshapen and malformed enemies. Disrupt your psychic architecture and be absorbed into the world, teeming with multiple pathways, luminous levels, and complex obstacles.\r Our hero Spinch can dash, dodge, jump off walls, and shoot his own children as ammunition. Platform your way through side-scrolling levels collecting items to give you the upperhand while searching for your missing babies. Be on the lookout for your cousin - he's babysitting some of your baby cousins, but he's a little weird. Bringing back old school difficulty, Spinch will have you replaying sections until you master your timing and reflexes. The ramping difficulty will see Spinch swim through experiment water tanks, chased by hordes of weird creatures, and traverse backward and inverted environments. With only a ticking clock and quick restarts - no lives or game overs here - the game is welcoming to players of all experiences, but a formidable challenge to a speedrunner.… Expand"}, {"name": "Psikyo Shooting Stars Alpha", "details_link": "https://www.metacritic.com/game/switch/psikyo-shooting-stars-alpha", "publisher": "NIS America", "release_date": "Jan 21 2020", "developers": ["Psikyo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/8c868fd21595c87f777c357c464bcb02-98.jpg", "descriptions": "Strikers 1945A revolution broke out in shooting games in 1995. The Japanese brand \"Psikyo\" introduced a new enemy's attack, \"Spread bullets\" not seen before then, and the history of a new shooting game began.\nStrikers 1945 II\nIf you went to a video arcade, you might know a certain name.Strikers 1945A revolution broke out in shooting games in 1995. The Japanese brand \"Psikyo\" introduced a new enemy's attack, \"Spread bullets\" not seen before then, and the history of a new shooting game began.Strikers 1945 IIIf you went to a video arcade, you might know a certain name. The name is \"Psikyo.\"The Psikyo made an awful disaster that called \"Psikyo Bullets.\"Many players felt indignation about speedy bullets from enemies and they cried at the end.However, they were attracted to the magical power of \"Psikyo Bullets\" before they know. Psikyo's games were named \"Psikyo Shooting\" by big fans and Psikyo Shooting is divided as a different game genre or not.\"STRIKERS 1945 II\" ... This is also one of the famous works of \"PSIKYO Shooting.\"Psikyo is the best choice when you really want to enjoy shooting game!Strikers 1999Relive the ultra-difficult \"Psikyo\" Shoot 'em up experience! Make use of your fighter's weapons and make your way through a chaotic dogfight!!A shoot 'em up game released by Psikyo in 1999. Make use of Shots, Super Shots, and Support Attacks to make your way through a chaotic dogfight!Historical piston fighters, such as the P-38 Lightning, are ready to rumble!!A state of the art arcade shoot 'em up from the masters of the genre, Psikyo.Players can change various game settings such as game difficulty, and also reproduce the atmosphere of arcade display settings at that time. Players can also compete against each other from all over the world with their high scores.Sol DivideVorg heard a rumor that the army of Satan was searching for treasures called Seirei stones which led him to think that the time for revenge has come. In addition, he also knows that one of the Seirei stones was entrusted secretly to King Silverna from Vorg's homeland, the Kingdom of Miltia.Vorg, who was a holy knight in Miltia, was in the forest town of Neraphai working for a mission when the king of Satan, Ifter, invaded the Kingdom of Miltia with Dhatilos armies.Upon hearing the news, Vorg immediately returned to Miltia, but the kingdom has been destroyed.After 7 years, a dark shadow went into the royal room inside the Silverna castle. That dark shadow was Satan, Ifter.Vorg heads to Silverna castle with his Helos. Satan owns the Sol Divide which is the pair of heilos.The tale of magic, sword, and vengeance starts now!!Dragon BlazeEarth, Water, Fire, Wind, Moon, and Sun. These four magic stones and the gods of the moon and sun brought prosperity in Megalith. Because of that, the people lived a peaceful and prosperous life.However, their peaceful life ended when Nebiros and his armies appeared.A long time ago, during the war of the gods when the world was created, Nebiros was defeated by the gods of the sun and moon. He was locked up by the 4 magic stones but was freed by summoning a country which aims to achieve victory in the war using him.Nebirus, as an act of revenge, controlled the mind of the god of the moon using his dark power. The god of the universe transformed people's form and spirit into hideous ones and made them as his armies. And the entire Megalith fell into the abyss of destruction and chaos.Nebirus' army has started to move towards the god of the sun. The god of the sun, who was threatened by Nebirus' move, entrusted the weapons of the gods to 4 dragon knights and ordered them to overthrow Nebirus.\nZero Gunner 2\nLet's blast off every enemy's planes from various sides of your screen.\n\nFans who have enjoyed Psikyo Shooting will definitely enjoy this Zero Gunner 2.… Expand"}, {"name": "Irony Curtain: From Matryoshka with Love", "details_link": "https://www.metacritic.com/game/switch/irony-curtain-from-matryoshka-with-love", "publisher": "Artifex Mundi", "release_date": "Jun 27 2019", "developers": ["Artifex Mundi"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/44b3a6cbd22ed641de17c6f67cb0113d-98.jpg", "descriptions": "Irony Curtain: From Matryoshka with Love is a satirical point-and-click inspired by the classic adventure games. It smuggles you out of your comfort zone and throws you into the middle of a Cold War spy intrigue — where there’s an even bigger game being played…"}, {"name": "Aftercharge", "details_link": "https://www.metacritic.com/game/xbox-one/aftercharge", "publisher": "Chainsawesome Games", "release_date": "Jan 10 2019", "developers": ["Chainsawesome Games"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 69, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/42fcd8c96fec15e09f6177b66634b8ef-98.jpg", "descriptions": "AFTERCHARGE is a 3 vs 3 competitive game pitting invisible robots against an invincible security squad in high-octane tactical skirmishes. The robots must sneak around to destroy all the energy extractors on the site while the guards are tasked to spot the attackers and stop them."}, {"name": "Disco Dodgeball Remix", "details_link": "https://www.metacritic.com/game/switch/disco-dodgeball-remix", "publisher": "Zen Studios", "release_date": "May 22 2018", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Sports", "Team", "Futuristic"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/92c81bfbdfa79b591300f9e8428275ab-98.jpg", "descriptions": "Disco Dodgeball Remix is a ridiculous physics-based future-sport amalgamation with robots, one-hit-kill projectile combat, and crazy dodgeball action."}, {"name": "Tumble VR", "details_link": "https://www.metacritic.com/game/playstation-4/tumble-vr", "publisher": "SCEA", "release_date": "Oct 10 2016", "developers": ["Supermassive Games"], "platforms": "PlayStation 4", "genres": ["Puzzle", "Stacking"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/65aa5980246e26f277bc79b103d243f7-98.jpg", "descriptions": "With over 70 fiendishly addictive levels of balancing, building and demolishing, Tumble VR – exclusive to PlayStation VR – will test your physical and mental dexterity. Get hands-on with gravity-defying building tasks where the highest tower gets the biggest score, or take on trickyWith over 70 fiendishly addictive levels of balancing, building and demolishing, Tumble VR – exclusive to PlayStation VR – will test your physical and mental dexterity. Get hands-on with gravity-defying building tasks where the highest tower gets the biggest score, or take on tricky balancing acts with blocks of all shapes, sizes, weights and dimensions. Enjoy blowing things up? Lay mines in tactical positions to topple towers and score points for the biggest blast radius. [Playstation.com]… Expand"}, {"name": "Buzz! Junior: Dino Den", "details_link": "https://www.metacritic.com/game/playstation-2/buzz!-junior-dino-den", "release_date": "Sep 25 2008", "developers": ["SCEE"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Trivia / Game Show"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/9bbf5eee0a4284f1329666758e328353-98.jpg", "descriptions": "The next installment in the Buzz series."}, {"name": "FreeStyle Street Basketball", "details_link": "https://www.metacritic.com/game/pc/freestyle-street-basketball", "publisher": "Sierra Online", "release_date": "May 15 2007", "developers": ["JC Entertainment"], "platforms": "PC", "num_players": "6  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/efefdaa4668671aebcdde9c9b716d75b-98.jpg", "descriptions": "FreeStyle is the first foray into building a North American online gaming community that combines sports with RPG elements. Whether a hardcore or casual gamer, enter an immersive world that tests your skills in the ultimate street basketball to hit virtual playgrounds around the country.FreeStyle is the first foray into building a North American online gaming community that combines sports with RPG elements. Whether a hardcore or casual gamer, enter an immersive world that tests your skills in the ultimate street basketball to hit virtual playgrounds around the country. Dress the part, hit up the musical play list, then break some ankles as you team up with and against players just like the pick-up games of Venice Beach to Rucker Park – only this time you have the skills. Dude... don’t just sit there, ball’s in your court. [Vivendi Universal]… Expand"}, {"name": "The Simpsons Game", "details_link": "https://www.metacritic.com/game/ds/the-simpsons-game", "publisher": "EA Games", "release_date": "Oct 30 2007", "developers": ["Griptonite Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/7b2bd73f953f7e14759fc488023ca82c-98.jpg", "descriptions": "The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart,The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart, and Lisa use exciting, all-new powers to save the world from rising chaos. To help the Simpsons, gamers at home must journey through all of Springfield (as well as vast worlds beyond!), vanquish an amazing array of villains, and fight their way through parodies of popular games. [Electronic Arts]… Expand"}, {"name": "The Occupation", "details_link": "https://www.metacritic.com/game/xbox-one/the-occupation", "publisher": "Sold Out", "release_date": "Mar  5 2019", "developers": ["White Paper Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 69, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/c7a13ffc9837b3a672583cd1d588a732-98.jpg", "descriptions": "It's 1987 in North West England; A time of 80's British pop, grand architecture and political unrest. An explosion has triggered a controversial act which threatens to erode civil liberties of the population to be rushed into place. You are tasked with investigating and questioning people onIt's 1987 in North West England; A time of 80's British pop, grand architecture and political unrest. An explosion has triggered a controversial act which threatens to erode civil liberties of the population to be rushed into place. You are tasked with investigating and questioning people on their actions from a tumultuous night which resulted in the loss of many lives. Each person has a different account of the night's event and you must use the tools at your disposal to get the results you need for your investigation.Will you take the most direct route at the risk of getting caught, or plan your approach carefully whilst precious time ticks by? Events happen in real-time and you must make decisions based on the evidence. You are the reporter. You decide the narrative.… Expand"}, {"name": "Tannenberg", "details_link": "https://www.metacritic.com/game/pc/tannenberg", "publisher": "M2H", "release_date": "Feb 13 2019", "developers": ["Blackmill Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 64 ", "genres": ["Action", "Strategy", "Real-Time", "Shooter", "First-Person", "General", "Tactical"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/8ba5de84e6f9e3a1f445eb094e87b972-98.jpg", "descriptions": "Experience authentic First World War action with 64 player battles of maneuver on the Eastern Front. Warfare between the Russian Empire and the Central Powers is a tense battle for dominance – stay close to your squad to survive!"}, {"name": "Earth Defense Force 2025", "details_link": "https://www.metacritic.com/game/playstation-3/earth-defense-force-2025", "publisher": "D3Publisher", "release_date": "Feb 18 2014", "developers": ["Sandlot"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Shooter", "Sci-Fi", "Action", "Shooter", "Third-Person", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/3a1d2bfe938f1519c5a8319f53e382af-98.jpg", "descriptions": "Earth Defense Force 2025 is the long awaited follow-up in the Earth Defense Force (EDF) series from Japanese developer Sandlot. The insects return from dormancy to end humanity with over-the-top action and massive city-leveling explosions that will entrench the EDF and the citizens of EarthEarth Defense Force 2025 is the long awaited follow-up in the Earth Defense Force (EDF) series from Japanese developer Sandlot. The insects return from dormancy to end humanity with over-the-top action and massive city-leveling explosions that will entrench the EDF and the citizens of Earth into a state of emergency.… Expand"}, {"name": "AO Tennis 2", "details_link": "https://www.metacritic.com/game/playstation-4/ao-tennis-2", "publisher": "Bigben Interactive", "release_date": "Feb 11 2020", "developers": ["Big Ant Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 69, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/db56ef35e02b60799bc3484a2d0c8739-98.jpg", "descriptions": "AO Tennis 2 is the only tennis experience designed for and by its community. Create your own players, stadiums and legendary matches. Enter the competition to reach the top of world tennis in Career Mode."}, {"name": "SIMULACRA 2", "details_link": "https://www.metacritic.com/game/pc/simulacra-2", "publisher": "Another Indie", "release_date": "Jan 30 2020", "developers": ["Kaigan Games OU", "Kaigan Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/42e5e7e7960a3cae23e8801a0c4895fb-98.jpg", "descriptions": "A dead influencer. An obsessed detective. Three suspects. Piece the truth together by going through the victim’s phone messages, videos, and social media in the follow up to the critically acclaimed SIMULACRA."}, {"name": "Blacksad: Under the Skin", "details_link": "https://www.metacritic.com/game/xbox-one/blacksad-under-the-skin", "publisher": "Microids", "release_date": "Nov  5 2019", "developers": ["Pendulo Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 69, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/5fb36529e715f6765c5641ad9e21476c-98.jpg", "descriptions": "A dark corruption scandal in the heart of the New York City's underworld for charismatic detective John Blacksad!The 50s, New York City: Joe Dunn, owner of a boxing club, is found dead. Meanwhile, rising star Bobby Yale, due to take to the ring for the most important fight of his career,A dark corruption scandal in the heart of the New York City's underworld for charismatic detective John Blacksad!The 50s, New York City: Joe Dunn, owner of a boxing club, is found dead. Meanwhile, rising star Bobby Yale, due to take to the ring for the most important fight of his career, has mysteriously disappeared. Sonia Dunn, Joe's daughter, takes over the gym and must deal with its financial woes. She hires private detective John Blacksad to investigate Yale's disappearance. This sinister case will take our investigator to the darkest, most dismal depths of New York.With its anthropomorphic characters and its incredible 1950s feel, BLACKSAD: Under the Skin promises all the eerily dark adventure of a detective novel, just like the eponymous comic book series.Conduct the investigation in your own way. Make use of your feline senses as you hunt for new clues. Make decisions on behalf of Blacksad and influence the outcome of the case.… Expand"}, {"name": "Q.U.B.E. 2", "details_link": "https://www.metacritic.com/game/switch/qube-2", "publisher": "Trapped Nerve Games", "release_date": "Feb 21 2019", "developers": ["Toxic Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/559d3c77719fbb7b00c647648a6a126d-98.jpg", "descriptions": "Q.U.B.E. 2 is the sequel to the first-person puzzle game Q.U.B.E. You are Amelia Cross, a stranded archaeologist who has awoken among the ruins of an ancient alien landscape. With the distant help of another survivor you must solve the puzzles of this mysterious world and find a way back home."}, {"name": "Football Manager Handheld 2010", "details_link": "https://www.metacritic.com/game/psp/football-manager-handheld-2010", "publisher": "Sega", "release_date": "Dec 22 2009", "developers": ["Sports Interactive"], "platforms": ["iPhone/iPad", "PC", "PSP"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/5a53c34efbda0347ae5054952b8c0291-98.jpg", "descriptions": "Improved Match Engine - massively update AI making the engine more realistic than ever. A brand new skin - giving the game a fresh and vibrant new look. Improved Board Confidence - a complete overhaul to allow the better visibility on how the board views your performance as well as providingImproved Match Engine - massively update AI making the engine more realistic than ever. A brand new skin - giving the game a fresh and vibrant new look. Improved Board Confidence - a complete overhaul to allow the better visibility on how the board views your performance as well as providing feedback on any decisions made. Improved coach and scout reports - it is now possible to view scout reports for individual players from their profiles. Assistant manager team reports - you can now see what your assistant manager thinks of your team, and any suggested improvements he would make. Unlockable managerial abilities - Acquire new abilities as your reputation improves such as the ability to over-rule requests made by the board. New player comparison screens - compare players within your squad or with future transfer targets. Player testimonial matches - players now receive a testimonial game to reward loyalty and long-service to a club. [Sega]… Expand"}, {"name": "Chaos League: Sudden Death", "details_link": "https://www.metacritic.com/game/pc/chaos-league-sudden-death", "publisher": "Digital Jesters", "release_date": "Dec  8 2005", "developers": ["Cyanide"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/e6f5b31dd2da6623cbeb760752c8ef89-98.jpg", "descriptions": "The chaos is back! Chaos League: Sudden Death takes off where the original game left off, improved and enhanced to take the real-time, role-playing strategy sports title into a whole new world of pain. The first rule of Chaos League is simple: there are no rules. The aim of the game staysThe chaos is back! Chaos League: Sudden Death takes off where the original game left off, improved and enhanced to take the real-time, role-playing strategy sports title into a whole new world of pain. The first rule of Chaos League is simple: there are no rules. The aim of the game stays the same – score as many goals as possible...any way possible. Added to the brutal mix are new races, new grounds, 19 additional hero characters, improved commentary, additional in game options such as auto spell casting... and the ability to beat up the referee! In multiplayer, opponents can goad each other via microphone, and fresh tournament modes can be managed to create almost limitless leagues. [Digital Jesters]… Expand"}, {"name": "Madagascar", "details_link": "https://www.metacritic.com/game/playstation-2/madagascar", "publisher": "Activision", "release_date": "May 23 2005", "developers": ["Toys for Bob"], "platforms": "PlayStation 2", "num_players": "24  Online", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/a9f55c6cfadcb4ee93e7c59e51d5a11f-98.jpg", "descriptions": "Based on the animated feature film from DreamWorks, Madagascar is the only game that lets players enter the world of four hilarious Central Park Zoo animals - a personality-packed crew made up of a lion, zebra, giraffe and hippo. Players must master each animal's natural skills whileBased on the animated feature film from DreamWorks, Madagascar is the only game that lets players enter the world of four hilarious Central Park Zoo animals - a personality-packed crew made up of a lion, zebra, giraffe and hippo. Players must master each animal's natural skills while adventuring through the exciting city of New York and the dangerous island of Madagascar, interacting with other animals and tackling obstacles and enemies in scenarios from the movie and beyond. [Activision]… Expand"}, {"name": "Swarm", "details_link": "https://www.metacritic.com/game/xbox-360/swarm", "publisher": "Ignition Entertainment", "release_date": "Mar 23 2011", "developers": ["Hothead Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "General", "General"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/7e60223c00601ab06b47e4e38afa3ea3-98.jpg", "descriptions": "An action-platformer where you take direct control of 50 pudgy blue morons and drive them through an intense and suicidal gauntlet of destruction. Run, bash, huddle, boost, stack, jump, push and throw your way through a ridiculously dangerous world in your attempt to collect valuable DNA andAn action-platformer where you take direct control of 50 pudgy blue morons and drive them through an intense and suicidal gauntlet of destruction. Run, bash, huddle, boost, stack, jump, push and throw your way through a ridiculously dangerous world in your attempt to collect valuable DNA and ensure at least one swarmite survives. Swarm features fast-paced platformer action and includes death medals, boss fights and a scoring system that encourages heated competition with your friends.… Expand"}, {"name": "Resident Evil 6", "details_link": "https://www.metacritic.com/game/pc/resident-evil-6", "publisher": "Capcom", "release_date": "Mar 22 2013", "developers": ["Capcom", "QLOC"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/9c7ca7042a62ab84ffc80155129f2757-98.jpg", "descriptions": "Resident Evil 6 is the sixth installment in the series. With 4 unique, yet overlapping story threads, each with their own pair of protagonists for either solo or co-op play, both offline and online, not only does Resident Evil 6 deliver different perspectives and play styles but, with theResident Evil 6 is the sixth installment in the series. With 4 unique, yet overlapping story threads, each with their own pair of protagonists for either solo or co-op play, both offline and online, not only does Resident Evil 6 deliver different perspectives and play styles but, with the introduction of the innovative Crossover mechanic players are be able to team up and share the horror with others.… Expand"}, {"name": "Magic: The Gathering - Duels of the Planeswalkers", "details_link": "https://www.metacritic.com/game/pc/magic-the-gathering---duels-of-the-planeswalkers", "publisher": "Wizards of the Coast", "release_date": "Jun 15 2010", "developers": ["Stainless Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 69, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/f19514d57df80afa958f2ca170651c8b-98.jpg", "descriptions": "An extension of the world's premier trading card game, Magic: The Gathering: Duels of the Planeswalkers' brings a pulse-pounding mix of strategic thinking, fantastic artwork, and arcade-style thrills to your PC. Experience an epic game of fantasy and strategy, as never before, when you takeAn extension of the world's premier trading card game, Magic: The Gathering: Duels of the Planeswalkers' brings a pulse-pounding mix of strategic thinking, fantastic artwork, and arcade-style thrills to your PC. Experience an epic game of fantasy and strategy, as never before, when you take on the mantle of a planeswalker - a powerful mage capable of traversing the infinite planes of existence - and forge your destiny! [Wizards of the Coast]… Expand"}, {"name": "Serious Sam HD: The First Encounter", "details_link": "https://www.metacritic.com/game/xbox-360/serious-sam-hd-the-first-encounter", "publisher": "Majesco Games", "release_date": "Jan 13 2010", "developers": ["Croteam"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/0ed6a9060db752ad4b91563a73673b5f-98.jpg", "descriptions": "[Xbox Live Arcade]  The legendary Sam \"Serious\" Stone returns to battle the relentless hordes of Mental's army in glorious high definition on Xbox LIVE Arcade in Serious Sam HD: The First Encounter. Based on the original indie arcade shooter sensation Serious Sam: The First Encounter,[Xbox Live Arcade]  The legendary Sam \"Serious\" Stone returns to battle the relentless hordes of Mental's army in glorious high definition on Xbox LIVE Arcade in Serious Sam HD: The First Encounter. Based on the original indie arcade shooter sensation Serious Sam: The First Encounter, Serious Sam HD features stunningly redesigned visuals, over-the-top action, and intense online co-op for up to four players. [Croteam]… Expand"}, {"name": "Kirby's Blowout Blast", "details_link": "https://www.metacritic.com/game/3ds/kirbys-blowout-blast", "publisher": "Nintendo", "release_date": "Jul  6 2017", "developers": ["Nintendo", "HAL Labs"], "platforms": "3DS", "genres": ["Action", "General"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/04d835f552cfdf25c2745551bc4f123d-98.jpg", "descriptions": "Inhaling foes and blow them away in 3D environments across 25+ stages. Inhale enough enemies and you can launch one huge Blaster Bullet capable of wiping out a troop of Waddle Dees. Now's your chance to battle iconic bosses like Kracko Jr and King Dedede in 3D. Inhaling multiple enemies toInhaling foes and blow them away in 3D environments across 25+ stages. Inhale enough enemies and you can launch one huge Blaster Bullet capable of wiping out a troop of Waddle Dees. Now's your chance to battle iconic bosses like Kracko Jr and King Dedede in 3D. Inhaling multiple enemies to launch Blaster Bullets is a great way to pump up your score and go for a bronze, silver, or gold star. Another way to score big is to rack up a combo by continuously firing at enemies without missing. Or you could always just collect coins as you jump across platforms. As you progress, you'll unlock EX stages, which provide a tougher challenge to master. Celebrate your victories by tapping a Kirby series amiibo figure to build a statue in the plaza that plays new music. [Nintendo]… Expand"}, {"name": "NHL 2K10", "details_link": "https://www.metacritic.com/game/xbox-360/nhl-2k10", "publisher": "Take-Two Interactive", "release_date": "Sep 15 2009", "developers": ["Take-Two Interactive"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/49c7b1980e74e00e119c549fa3633578-98.jpg", "descriptions": "NHL 2K10 redefines the sports gaming experience with a new emphasis on social gaming. Whether you're a die-hard NHL fan or a casual player, NHL 2K10's pick-up-and-play controls, true-to-life authenticity and variety of on- and off-line multiplayer modes promise hours of entertainment for anyNHL 2K10 redefines the sports gaming experience with a new emphasis on social gaming. Whether you're a die-hard NHL fan or a casual player, NHL 2K10's pick-up-and-play controls, true-to-life authenticity and variety of on- and off-line multiplayer modes promise hours of entertainment for any gamer. Among the new features that will make this the must-have hockey game of the season include: New Gameplay Mechanics - Completely rewritten AI, enhanced defensive controls and stick lifts, stumble shots, a new defensive skating model and new incidental contact and small animation systems. Enhanced Presentation - All-new rink intros for each arena, improved goal celebrations, enhanced visuals, and greatly improved, true-to-life character models, with San Jose Sharks commentators Randy Hahn and Drew Remenda returning with new broadcast commentary. Improved Franchise Mode - NHL 2K10 features a new contract/free agency system, improved roster management, an updated financial model, dynamic player progression, and fantasy drafts. New Franchise Co-op Play - Play a franchise season game with or against a friend on- or offline, or play a traditional game against the CPU. Franchise Blog / 2KSports.com Integration - Publish your franchise stats and standings, and upload game highlights and screenshots to your personal page at 2KSports.com. Enhanced Online Modes - New seamless online integration connects players in Team Up games, tracks your progress with My Player Card, and offers full league, leaderboard, tournament and 2K Share support. Create Team Mode - Create a persistent team with friends by designing your uniforms, developing a unique team identity, and then competing against other created teams online, offline and in Franchise mode. [2K Sports]… Expand"}, {"name": "Order of War", "details_link": "https://www.metacritic.com/game/pc/order-of-war", "publisher": "Square Enix", "release_date": "Sep 22 2009", "developers": ["Wargaming.net"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic", "Tactics"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/3ef600b6fbba17038d7474fec14dff58-98.jpg", "descriptions": "ORDER OF WAR features massive-scale battles brought to life with a cinematic intensity never seen before in a WWII strategy game. Players take command of an entire army including ground troops, artillery, tank divisions and aircraft in all-out strategic assaults. The single-player mode canORDER OF WAR features massive-scale battles brought to life with a cinematic intensity never seen before in a WWII strategy game. Players take command of an entire army including ground troops, artillery, tank divisions and aircraft in all-out strategic assaults. The single-player mode can be played out in two campaigns - American versus German forces on the western front and German versus Russian on the eastern front. Missions will be based on key historic events and operations from 1944. In the summer of 1944, the Second World War entered its end-game when the Allies launched two major operations that would drive back German forces on both the Western and Eastern Fronts at once. In the ultimate test of military strategy, ORDER OF WAR challenges you not only to lead America's finest to victory in the west, but also place you in command of German forces charged with repelling the Red Army’s seemingly unstoppable offensive in the east. Even the keenest military minds will find that it's one thing to make history, but quite another to change it. Do you have what it takes to command? Experience WWII warfare on an epic, cinematic stage; that truly captures the intensity and scale of the battlefield. Command of an entire armed force consisting of up to 1,000 soldiers, tanks, armored vehicles, artillery and air planes. Players can choose between two different campaign modes offering completely different storylines, missions, objectives and environments. Experience the unique dynamic camera that allows players to command troops over huge geographical scale whilst maintaining movie-like vistas and detail. In-depth gameplay mode: two different campaign modes, multi-player, Deathmatch and Skirmish. [Square Enix]… Expand"}, {"name": "REKT! High Octane Stunts", "details_link": "https://www.metacritic.com/game/xbox-one/rekt!-high-octane-stunts", "publisher": "No Gravity Games", "release_date": "May 26 2021", "developers": ["No Gravity Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/152620afad0a3ec11382586645f9387e-98.jpg", "descriptions": "Flipping fun stunt simulator for up to four players!Ever wanted to kickflip a car? Get behind the wheel in this high octane stunt driving game and get REKT! With REKT doing tricks is incredibly smooth and easy, and with realistic physics it's easy to learn and hard to master. Get yourFlipping fun stunt simulator for up to four players!Ever wanted to kickflip a car? Get behind the wheel in this high octane stunt driving game and get REKT! With REKT doing tricks is incredibly smooth and easy, and with realistic physics it's easy to learn and hard to master. Get your landing right and power slide into the next trick for an incredible trick combo chain at a smooth 60 frames per second. Get a couch, up to four friends and engage in crazy multiplayer battles to take the crown as the ultimate REKT driver!-Stunts, lots of 'em!-Three main arenas to do stunts in-Unlock over fifty customizable cars-An almost endless amount of challenges-Compete with other players in the global leaderboards-Many zany pop culture references!Local MultiplayerGather a couple of friends and play with up to four players! Play capture the crown and see who keeps the crown the longest! Infect other players in Virus or be the fastest to capture all the checkpoints in Baja or just take three friends and simultaneously fight for the highest score!-Four extra unique multiplayer arena's-Local multiplayer with up to four players-Even more pop culture references!… Expand"}, {"name": "Dead or Alive 5 Last Round", "details_link": "https://www.metacritic.com/game/xbox-one/dead-or-alive-5-last-round", "publisher": "Koei Tecmo Games", "release_date": "Feb 17 2015", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/5c9d5129b13a435e7f66ba5631e06a26-98.jpg", "descriptions": "2 new playable characters join the fray to make 34 fighters - the largest roster in franchise history. Master the signature DOA fighting system through the textured story and tutorial modes, unlock more costumes than ever before in each of the offline training modes, and compete with the2 new playable characters join the fray to make 34 fighters - the largest roster in franchise history. Master the signature DOA fighting system through the textured story and tutorial modes, unlock more costumes than ever before in each of the offline training modes, and compete with the best fighters in the world in the online training modes. Fight as ninjas, assassins, roughnecks & wrestlers as you knock your opponents off an exotic waterfall, into an exploding oil rig and more.… Expand"}, {"name": "Foul Play", "details_link": "https://www.metacritic.com/game/xbox-360/foul-play", "publisher": "Mastertronic", "release_date": "Sep 18 2013", "developers": ["Mediatonic"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox 360"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/7eddea07a93f02426a531de205d6275a-98.jpg", "descriptions": "Play as the daemon hunter Baron Dashforth in a side-scrolling brawler set ENTIRELY on a theater stage. Perform shattering takedowns and reversals. Electrify spectators with linked attacks, have a friend join as sidekick Scampwick and use every stage-trick you know to bring the house down.Play as the daemon hunter Baron Dashforth in a side-scrolling brawler set ENTIRELY on a theater stage. Perform shattering takedowns and reversals. Electrify spectators with linked attacks, have a friend join as sidekick Scampwick and use every stage-trick you know to bring the house down. Play out the most spectacular moments of the Baron’s life; improbable beasts, astonishing villainy and, at the heart of it all, the mysterious Foul Play.… Expand"}, {"name": "Bejeweled 2 Deluxe", "details_link": "https://www.metacritic.com/game/xbox-360/bejeweled-2-deluxe", "publisher": "Oberon Media", "release_date": "Nov 22 2005", "developers": ["PopCap"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/7ca9e671c615cb26141363a32d0edd33-98.jpg", "descriptions": "[Xbox Live Arcade]  Take the classic game of gem-swapping to euphoric new heights. Solve handcrafted brain teasers in Puzzle mode while up against the clock, or kick back, relax, and enjoy Endless mode. With awe-inspiring planetary backdrops, explosive new gems, and dazzling special effects,[Xbox Live Arcade]  Take the classic game of gem-swapping to euphoric new heights. Solve handcrafted brain teasers in Puzzle mode while up against the clock, or kick back, relax, and enjoy Endless mode. With awe-inspiring planetary backdrops, explosive new gems, and dazzling special effects, Bejeweled 2 is more wildly addictive than ever before. Xbox Live Arcade features: Stunning 3-D special effects, hypnotic sound effects, entrancing music, and awe-inspiring planetary backdrops. Explosive new pieces: Power gems, hyper cubes, and time bombs. Four ways to play: Classic, Action, Puzzle, and Endless. Handcrafted puzzles: Explore a veritable galaxy in Puzzle mode, or play for eternity and collect jewelry in Endless mode. [Xbox.com]… Expand"}, {"name": "The Crew 2", "details_link": "https://www.metacritic.com/game/xbox-one/the-crew-2", "publisher": "Ubisoft", "release_date": "Jun 26 2018", "developers": ["Ubisoft Ivory Tower"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 69, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/84f59a53795434d5b0f5c235dc2c52bf-98.jpg", "descriptions": "The newest iteration in the franchise, The Crew 2 captures the thrill of the American motorsports spirit in an open world. Welcome to Motornation, a huge, varied, action-packed playground built for motorsports throughout the entire US of A. Enjoy unrestrained exploration on ground, sea, andThe newest iteration in the franchise, The Crew 2 captures the thrill of the American motorsports spirit in an open world. Welcome to Motornation, a huge, varied, action-packed playground built for motorsports throughout the entire US of A. Enjoy unrestrained exploration on ground, sea, and sky. From coast to coast, street and pro racers, off-road explorers, and freestylers gather and compete in all kinds of disciplines. Join them in high-octane contests and share every glorious moment with the world. The Crew 2 gives you the chance to showcase your skills and rise as a multi-skilled motorsports champion. [Ubisoft]… Expand"}, {"name": "Akimi Village", "details_link": "https://www.metacritic.com/game/playstation-3/akimi-village", "publisher": "Sony Online Entertainment", "release_date": "Jun 15 2011", "developers": ["NinjaBee"], "platforms": "PlayStation 3", "genres": ["Miscellaneous", "General", "General"], "meta_score": 69, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/6/701bdb8bca16bafa950df9f749004c56-98.jpg", "descriptions": "In Akimi Village, players obtain blueprints, gather resources, and construct a village to help rid Akimi Island of lingering gloom in this PlayStation Network exclusive."}, {"name": "Ancients of Ooga", "details_link": "https://www.metacritic.com/game/xbox-360/ancients-of-ooga", "publisher": "NinjaBee", "release_date": "Jun 30 2010", "developers": ["NinjaBee", "Bacon Wrapped Games"], "platforms": ["PC", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "General", "General"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/cdfde8373b7ad0c1d8d3f465197c27cf-98.jpg", "descriptions": "[Xbox Live Arcade]  From the creators of Cloning Clyde comes a new epic adventure Ancients of Ooga! Eat, chant, and even puke your way through the highly comical, primeval land of Ooga. You meet, befriend, and finally acquire seven zany Oogani tribes. Uncover their lost ancient powers, and[Xbox Live Arcade]  From the creators of Cloning Clyde comes a new epic adventure Ancients of Ooga! Eat, chant, and even puke your way through the highly comical, primeval land of Ooga. You meet, befriend, and finally acquire seven zany Oogani tribes. Uncover their lost ancient powers, and exploit their abilities and lead them in a revolt against the tyrannical Boolis. This is classic platforming and puzzle solving with a novel eat/carry/puke inventory management component. Over fifty amazing levels, excellent multiplayer, plus, narcotic slugs that make you loopy. [Xbox.com]… Expand"}, {"name": "Need for Speed: Nitro", "details_link": "https://www.metacritic.com/game/wii/need-for-speed-nitro", "publisher": "EA Games", "release_date": "Nov  2 2009", "developers": ["EA Montreal"], "platforms": "Wii", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/83f015aea78d16e259dcad30b2340d84-98.jpg", "descriptions": "Boasting support for the Wii Remote, Nunchuk, racing wheel, classic controller, GameCube controller and DS stylus, Need for Speed NITRO lets players decide exactly how they want to dominate the competition. For the ultimate bragging rights, gamers can’t just win the race, they must own it.Boasting support for the Wii Remote, Nunchuk, racing wheel, classic controller, GameCube controller and DS stylus, Need for Speed NITRO lets players decide exactly how they want to dominate the competition. For the ultimate bragging rights, gamers can’t just win the race, they must own it. With a nearly limitless visual customization system, gamers can design a unique art style to attach to their ride. As they edge out competitors in driving finesse, their art will overtake the world, vibrantly painting the story of racing supremacy. All this combined with fresh modes, tracks and exotic real world locations make Need for Speed NITRO one of the most exciting, heart-pounding arcade racers for the Wii and Nintendo DS. [Electronic Arts]… Expand"}, {"name": "Cat Cafe Manager", "details_link": "https://www.metacritic.com/game/switch/cat-cafe-manager", "publisher": "Freedom Games", "release_date": "Apr 14 2022", "developers": ["Roost Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/101e60c7376f7a935e89baff853d9953-98.jpg", "descriptions": "Travel to the sleepy village of Caterwaul Way and rebuild your grandmother's cat cafe. Renovate your restaurant, befriend the local cats and townsfolk, forge lasting friendships, unravel catty mysteries, and build a home for dozens of unique felines!"}, {"name": "Earth Defense Force: World Brothers", "details_link": "https://www.metacritic.com/game/switch/earth-defense-force-world-brothers", "publisher": "D3Publisher", "release_date": "May 27 2021", "developers": ["Yuke's", "Sandlot"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/2b2414893a0c5d25a4a17307723a6b01-98.jpg", "descriptions": "A new battlefield appears in the \"EDF\" series. This time, the world becomes the square Earth. The name of this game is \"EARTH DEFENSE FORCE: WORLD BROTHERS\". This game takes place in the 3D voxel world, which everything is made up of square pieces. In this world, the Earth is not round butA new battlefield appears in the \"EDF\" series. This time, the world becomes the square Earth. The name of this game is \"EARTH DEFENSE FORCE: WORLD BROTHERS\". This game takes place in the 3D voxel world, which everything is made up of square pieces. In this world, the Earth is not round but square. And now, this voxel Earth is fallen apart into square pieces, breaking its blocky peace. But whether round or square, the Earth must be the Earth. So now, the player and the \"EARTH DEFENSE FORCE\" must rise to the occasion and save the day to restore a shattered Voxel Earth to one peace.… Expand"}, {"name": "Fire Emblem Warriors", "details_link": "https://www.metacritic.com/game/3ds/fire-emblem-warriors", "publisher": "Nintendo", "release_date": "Oct 20 2017", "developers": ["Omega Force"], "platforms": ["Switch", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/3f8a07618928e55dcef474f07e7dfa5f-98.jpg", "descriptions": "Clash with legions of soldiers and fierce monsters as Marth, Xander, Corrin, and other Fire Emblem heroes unleashing over-the-top-powerful Dynasty Warriors-style moves. Take direct control of known and original Fire Emblem characters, issue them strategic commands in the midst of battle,Clash with legions of soldiers and fierce monsters as Marth, Xander, Corrin, and other Fire Emblem heroes unleashing over-the-top-powerful Dynasty Warriors-style moves. Take direct control of known and original Fire Emblem characters, issue them strategic commands in the midst of battle, pair up heroes to unleash stunning attacks, and more. Unlock new playable heroes, each with their own unique moves, special attacks, weapon types, and voiced dialogue in this large-scale action game from the Hyrule Warriors team.… Expand"}, {"name": "Def Jam: Icon", "details_link": "https://www.metacritic.com/game/xbox-360/def-jam-icon", "publisher": "EA Games", "release_date": "Mar  6 2007", "developers": ["EA Chicago"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/a7f1f8e913a8e3e1b9d38c6611e065f5-98.jpg", "descriptions": "Infusing hip-hop music, culture and lifestyle into the gameplay, EA Chicago and Def Jam Interactive push the boundaries of game development bringing unique and innovative content to the next generation of gaming. Music is the cornerstone of hip-hop culture so EA wanted to incorporate musicInfusing hip-hop music, culture and lifestyle into the gameplay, EA Chicago and Def Jam Interactive push the boundaries of game development bringing unique and innovative content to the next generation of gaming. Music is the cornerstone of hip-hop culture so EA wanted to incorporate music and rhythm into the actual gameplay mechanics. EA Chicago delivers star-stunning action and bone breaking beats as players live out the life of a hip hop mogul, going from rags to riches. Incorporating hip-hop culture into every aspect of the game, DEF JAM: ICON delivers the intensity of a no-holds-barred street fight but with style and rhythm. Music affects how players fight in each venue and environmental interactions and hazards become a key strategy to staying alive. The game's unique fighting gameplay controls introduce a new way for gamers to fight as they assume the role of top celebrity characters such as Ludacris, T.I. and Big Boi. Innovative controls give better feedback to players so they feel like they're actually throwing the combat moves. Gamers can now fight with the style and flash of the superstar personalities. [Electronic Arts]… Expand"}, {"name": "Pariah", "details_link": "https://www.metacritic.com/game/pc/pariah", "publisher": "Groove Games", "release_date": "May  3 2005", "developers": ["Digital Extremes"], "platforms": "PC", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/f09caa3f7e53534a416efaed6924d1bd-98.jpg", "descriptions": "The pathogen is unknown. Dr. Jack Mason en route to assess threat levels. Request cryogenic containment of infected subject \"B\": Karina J. All Prisoner rights are hereby revoked under Section-4 of the Transgenic Containment Act. Evacuate non-essential personnel in preparation got possibleThe pathogen is unknown. Dr. Jack Mason en route to assess threat levels. Request cryogenic containment of infected subject \"B\": Karina J. All Prisoner rights are hereby revoked under Section-4 of the Transgenic Containment Act. Evacuate non-essential personnel in preparation got possible thermonuclear contanment protocol. FROM THE CREATORS OF \"UNREAL\" comes a spiraling plunge into destruction, despair and disease. Jack Mason is a burnt-out doctor and an outcast rejected by society. With no will to live, until he nearly dies in a transport crash, Jack and his infected patient are stranded deep within the most vicious prison sectors of a wasteland called \"Earth.\" [Groove Games]… Expand"}, {"name": "Mad Max", "details_link": "https://www.metacritic.com/game/playstation-4/mad-max", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep  1 2015", "developers": ["Avalanche Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Action Adventure", "General", "Open-World"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/0d33ce211dc67783bf9958cce196a538-98.jpg", "descriptions": "Mad Max places players in the role of a lone warrior who must embark on a journey to reclaim his stolen interceptor from a deadly gang of marauders."}, {"name": "Shenmue III", "details_link": "https://www.metacritic.com/game/pc/shenmue-iii", "publisher": "Deep Silver", "release_date": "Nov 19 2019", "developers": ["Ys Net"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/29bd4577d1c16cb2efb9356dec57c3ac-98.jpg", "descriptions": "The story begins in 1980s Yokosuka, Japan.\r The main character, Ryo Hazuki has his father murdered before him by Lan Di, the boss of the underground organization, Chi You Men. Ryo learns of the existence of a mysterious pair of mirrors, and makes his way to Hong Kong to unravel the mysteryThe story begins in 1980s Yokosuka, Japan.\r The main character, Ryo Hazuki has his father murdered before him by Lan Di, the boss of the underground organization, Chi You Men. Ryo learns of the existence of a mysterious pair of mirrors, and makes his way to Hong Kong to unravel the mystery and avenge his father. A stranger in a new land, Ryo gains the help of Ren Wuying, and together they make contact with Yuanda Zhu, only to see Lan Di make his escape. Continuing to pursue his father's Killer, Ryo travels to Bailu Village in Guilin. Along the way, he meets a new companion, Shenhua Ling who will forever change his destiny. The story of Shenmue was originally scripted for a total of eleven chapters.\r Shenmue II brought the story up to chapter six, with Shenmue III continuing from there at Bailu Village. What secrets are held within the twin mirrors? Will Ryo face his arch nemesis, Lan Di in a final showdown? What does fate hold in store for Ryo and Shenhua?… Expand"}, {"name": "Valhalla Hills", "details_link": "https://www.metacritic.com/game/pc/valhalla-hills", "publisher": "Daedalic Entertainment", "release_date": "Dec  2 2015", "developers": ["Daedalic Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/4fb23e19c1602379decfc5bb2e21bac1-98.jpg", "descriptions": "Valhalla Hills is a humorous new civilization-building strategy game from Daedalic Entertainment."}, {"name": "Scaler", "details_link": "https://www.metacritic.com/game/xbox/scaler", "publisher": "Global Star Software", "release_date": "Oct 20 2004", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/29b95e1a87c074d6f20f66b1a1366e49-98.jpg", "descriptions": "Bobby \"Scaler\" Johnson gets more than he bargained for when he stumbles upon his next-door neighbor's evil plot to take over the world--by stealing all the lizards and training them to become his mutant army. As Bobby, you can take on your enemies by transforming into one of them.Bobby \"Scaler\" Johnson gets more than he bargained for when he stumbles upon his next-door neighbor's evil plot to take over the world--by stealing all the lizards and training them to become his mutant army. As Bobby, you can take on your enemies by transforming into one of them. Work your way through the worlds by shape-shifting, vine-surfing, and using camouflage. In levels filled with exotic plants and creatures, this unexpected hero encounters many strange situations.… Expand"}, {"name": "Capcom Arcade Cabinet", "details_link": "https://www.metacritic.com/game/playstation-3/capcom-arcade-cabinet", "publisher": "Capcom", "release_date": "Feb 19 2013", "developers": ["M2"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 69, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/4beb17bb8c467f6b1121f4a111c05713-98.jpg", "descriptions": "The  Capcom Arcade Cabinet contains all 17 of the classic Capcom 8-bit titles from 1984-1988."}, {"name": "The Eye of Judgment: Legends", "details_link": "https://www.metacritic.com/game/psp/the-eye-of-judgment-legends", "publisher": "SCEA", "release_date": "Mar 10 2010", "developers": ["SCEI"], "platforms": ["PlayStation 3", "PSP"], "num_players": "2  Online", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/a15147ea7c6bc97fae2c2b0443b30195-98.jpg", "descriptions": "THE EYE OF JUDGMENT LEGENDS on the PSP  packs a vast world of magic, mystery and battles into the palm of your hands. At its heart are more than 300 digital trading cards, over 30 of which are brand new to the franchise! What makes it even more portable is that the card collecting experienceTHE EYE OF JUDGMENT LEGENDS on the PSP  packs a vast world of magic, mystery and battles into the palm of your hands. At its heart are more than 300 digital trading cards, over 30 of which are brand new to the franchise! What makes it even more portable is that the card collecting experience from the PS3  hit has been streamlined, no longer requiring the PlayStation Eye peripheral nor physical cards to be carried along with you. The PSP version’s digital cards can be earned by playing through the game, traded wirelessly from one PSP to another, won in battle with friends and enemies, and even bought from the PlayStation Store in future downloadable content releases. Each card features a monster, dragon, mage or mythical warrior with their own special skills ready to do battle against your opponent, and some cards are rare to come across. However, players must carefully choose among the cards they have collected to compile their ultimate deck. The cards are not lifeless images – these creatures come to life on screen springing out of their card and into attack, battling real time as they hack, slash and cast spells on each other. Deploy the right creatures from your deck to defeat your opponent and secure victory. [SCEA]… Expand"}, {"name": "Harry Potter and the Goblet of Fire", "details_link": "https://www.metacritic.com/game/gamecube/harry-potter-and-the-goblet-of-fire", "publisher": "Electronic Arts", "release_date": "Nov  8 2005", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-3 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 69, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/35389606343b79aafabe0fdbbe7a1ef0-98.jpg", "descriptions": "Harry, Ron, and Hermione are back in Harry Potter and the Goblet of Fire, a game based on J.K. Rowling's fourth book. The game follows Harry, the wizard-in-training, as he confronts a fire-breathing dragon, rescues friends from the icy depths of the Black Lake, and navigates the twistingHarry, Ron, and Hermione are back in Harry Potter and the Goblet of Fire, a game based on J.K. Rowling's fourth book. The game follows Harry, the wizard-in-training, as he confronts a fire-breathing dragon, rescues friends from the icy depths of the Black Lake, and navigates the twisting corridors of a maze. As Harry, Ron, or Hermione, you can cast a variety of spells in both single-player and cooperative modes.… Expand"}, {"name": "Hey! Pikmin", "details_link": "https://www.metacritic.com/game/3ds/hey!-pikmin", "publisher": "Nintendo", "release_date": "Jul 28 2017", "developers": ["Nintendo", "Arzest"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/8f802aa71e2c69f78f57b8ae2af51bcd-98.jpg", "descriptions": "Captain Olimar has crashed on an unknown planet inhabited by Pikmin. And his first 2D platformer gives you a new perspective on his adorably fierce partners. Touch the screen to throw Pikmin into action: swim with Blue Pikmin, fly with Winged Pikmin, and more to survive hostile wildlife,Captain Olimar has crashed on an unknown planet inhabited by Pikmin. And his first 2D platformer gives you a new perspective on his adorably fierce partners. Touch the screen to throw Pikmin into action: swim with Blue Pikmin, fly with Winged Pikmin, and more to survive hostile wildlife, solve ecological puzzles, and escape. Help Captain Olimar explore and escape a new world by guiding him and his Pikmin with the stylus. Olimar is a half-pint Hero on a personal mission to save himself. Get a new perspective on the powers and personalities of Pikmin. Tap the touchscreen to choose Pikmin and toss them at objects or enemies. [Nintendo]\r … Expand"}, {"name": "Rayman 3 HD", "details_link": "https://www.metacritic.com/game/xbox-360/rayman-3-hd", "publisher": "Ubisoft", "release_date": "Mar 21 2012", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/c38b18010299ada0accf1509ce0dcf7b-98.jpg", "descriptions": "Rayman's universe has fallen into a chaotic world of wicked powers, bizarre characters, and merciless combat. When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger-happy Hoodlums wreaks total havoc to get their Lord back. Rayman's only chance is to purge theRayman's universe has fallen into a chaotic world of wicked powers, bizarre characters, and merciless combat. When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger-happy Hoodlums wreaks total havoc to get their Lord back. Rayman's only chance is to purge the Dark Lum Lord from the manic Globox, scour the lands for new powers, and battle with hordes of Hoodlum soldiers. Even without arms or legs, Rayman can still unleash an arsenal of special powers and fighting moves.… Expand"}, {"name": "ChromaGun", "details_link": "https://www.metacritic.com/game/switch/chromagun", "publisher": "Pixel Maniacs", "release_date": "Jan 22 2018", "developers": ["Pixel Maniacs"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/87b6b8ea37bef64b77ca37f5c8e9434c-98.jpg", "descriptions": "Welcome to ChromaTec's test lab! You're here to test our newest, state-of-the-art military-grade color-technology: The ChromaGun (patent pending)! Use it to try and solve our meticulously designed test chambers. The basic principle is as easy as applying it is complex: Exit the chambers viaWelcome to ChromaTec's test lab! You're here to test our newest, state-of-the-art military-grade color-technology: The ChromaGun (patent pending)! Use it to try and solve our meticulously designed test chambers. The basic principle is as easy as applying it is complex: Exit the chambers via the exit doors. But be weary of the WorkerDroids in charge of maintaining the chambers. They’re not exactly what you and I would call \"human friendly.\" Use the ChromaGun to colorize walls and WorkerDroids to progress in the chambers. WorkerDroids are attracted to walls of the same color. Using that mechanic, try to reach the exit door of each chamber. Some doors are more complicated to use than others: They can only be opened using door triggers and only stay open as long as the triggers are occupied. [Nintendo]… Expand"}, {"name": "Oblitus", "details_link": "https://www.metacritic.com/game/pc/oblitus", "publisher": "Adult Swim", "release_date": "Feb 27 2015", "developers": ["Connor Ullmann"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/e762014ecf7cae94932de8220b2ec867-98.jpg", "descriptions": "Explore your limits against a brutal and mysterious world as Parvus, a curious warrior with no memory and a heavy burden. Raise your spear and cast ancient spells as you battle hostile creatures and towering bosses in procedurally-generated 2D landscapes that are both beautiful andExplore your limits against a brutal and mysterious world as Parvus, a curious warrior with no memory and a heavy burden. Raise your spear and cast ancient spells as you battle hostile creatures and towering bosses in procedurally-generated 2D landscapes that are both beautiful and dangerous. Answer the call. Break the cycle. … Expand"}, {"name": "Poker Night 2", "details_link": "https://www.metacritic.com/game/xbox-360/poker-night-2", "publisher": "Telltale Games", "release_date": "Apr 24 2013", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/f1954f98892dfce0294f4549334ab1a6-98.jpg", "descriptions": "Poker Night 2 is the sequel to Poker Night where you play poker with a bunch of \"weirdos\" officially licensed, triple 'A' characters such as Claptrap, Brock Samson, Ash Williams, and Sam."}, {"name": "Ghosthunter", "details_link": "https://www.metacritic.com/game/playstation-2/ghosthunter", "publisher": "Namco", "release_date": "Aug 17 2004", "developers": ["SCE Studio Cambridge"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 69, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/43c5530b2bc8a0126cbd43211e6d2953-98.jpg", "descriptions": "Following the adventures of Lazarus Jones on his first day on the Detroit Police Force, Ghosthunter sees the plucky rookie called in to investigate a disturbance in an old abandoned school, the scene of a grisly (and ultimately unsolved) mass-murder. Heading out with his senior partner AnnaFollowing the adventures of Lazarus Jones on his first day on the Detroit Police Force, Ghosthunter sees the plucky rookie called in to investigate a disturbance in an old abandoned school, the scene of a grisly (and ultimately unsolved) mass-murder. Heading out with his senior partner Anna Steele, Lazarus sets off on what he believes is a routine call but, in the true spirit of survival horror, it's not long before the crime-bothering duo are knee-deep in ectoplasm. After much bickering between the pair, Jones somehow inadvertently sets free a horde of ghosts contained in the school's secret paranormal research lab. An errant apparition materialises, grabs Anna, and drags her away with him to a dark, eerie place (the school canteen, perhaps?). One of the wayward spooks (Astral) also manages to 'bond' with Jones, giving him the gift of supernatural sight, allowing him to see dead people. Nice. Picking up the reins as Laz, you'll start out in search of Anna, and attempt to figure out the mysteries buried deep in the school's past along the way... [SCEE]… Expand"}, {"name": "Foul Play", "details_link": "https://www.metacritic.com/game/pc/foul-play", "publisher": "Mediatonic", "release_date": "Sep 18 2013", "developers": ["Mediatonic"], "platforms": ["PlayStation 4", "PlayStation Vita", "Xbox 360", "PC"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 69, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/1d1ade1019d2c4cf8073ead1b2526905-98.jpg", "descriptions": "Prepare for DRAMA as the Baron's tale unfolds, from the harsh deserts of Cairo, to the shady streets of Victorian London... and beyond. The finest actors and actresses of the day have been employed to ensure the ABSOLUTE authenticity of the story. Prepare to play out the most spectacular andPrepare for DRAMA as the Baron's tale unfolds, from the harsh deserts of Cairo, to the shady streets of Victorian London... and beyond. The finest actors and actresses of the day have been employed to ensure the ABSOLUTE authenticity of the story. Prepare to play out the most spectacular and explosive moments of the Baron's life; improbable beasts, astonishing villainy, and at the heart of it all - the mysterious Foul Play.… Expand"}, {"name": "Real Boxing", "details_link": "https://www.metacritic.com/game/playstation-vita/real-boxing", "publisher": "Vivid Games", "release_date": "Sep 17 2013", "developers": ["Vivid Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/b5d576692e1ffd3c8c67b215fd37776c-98.jpg", "descriptions": "Real Boxing is a console-style boxing simulation game where players will take a journey from amateur to pro."}, {"name": "Destiny 2: Lightfall", "details_link": "https://www.metacritic.com/game/playstation-5/destiny-2-lightfall", "publisher": "Bungie", "release_date": "Feb 28 2023", "developers": ["Bungie"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/8/5373345cd1d4a59c475a13f81ac4dc5c-98.jpg", "descriptions": "The last stand against Calus--who became the latest disciple of The Witness at the end of Season of the Haunted--and a \"pivotal\" moment for the Destiny franchise as it heads to the end of the Light and Darkness saga. Lightfall takes place in a new city on Neptune, Neomuna, which has aThe last stand against Calus--who became the latest disciple of The Witness at the end of Season of the Haunted--and a \"pivotal\" moment for the Destiny franchise as it heads to the end of the Light and Darkness saga. Lightfall takes place in a new city on Neptune, Neomuna, which has a pristine and retro-futuristic design. As for the fifth subclass that was briefly seen, this new Darkness power is called Strand and allows for new traversal methods in Neomuna. The city is inhabited by a new race known as Cloudstriders, who managed to escape The Collapse of the solar system and remain hidden from the Darkness. With The Witness having discovered the city, it has come under siege from Calus, the Shadow Legion, and gigantic Pyramid Demons that can use a scythe to attack from a distance and drain your life-force.… Expand"}, {"name": "Final Fantasy IV: The After Years", "details_link": "https://www.metacritic.com/game/wii/final-fantasy-iv-the-after-years", "publisher": "Square Enix", "release_date": "Jun  1 2009", "developers": ["Matrix Software"], "platforms": ["iPhone/iPad", "PC", "Wii"], "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/4a50e2862fb7cb326a785cf69537556a-98.jpg", "descriptions": "[WiiWare]  FINAL FANTASY IV: THE AFTER YEARS is the sequel to the hit RPG FINAL FANTASY IV. The story takes place many years after the original and centers on a young man named Ceodore, son of the paladin Cecil and the white mage Rosa, who, along with their loyal and steadfast friends, once[WiiWare]  FINAL FANTASY IV: THE AFTER YEARS is the sequel to the hit RPG FINAL FANTASY IV. The story takes place many years after the original and centers on a young man named Ceodore, son of the paladin Cecil and the white mage Rosa, who, along with their loyal and steadfast friends, once saved the world from evil born of the second moon. Now, monsters are reappearing in a world that had finally attained peace. The second moon has returned anew. What tidings does this ominous harbinger bring? Familiar faces and new allies join the battle to save the Blue Planet once more. [Nintendo]… Expand"}, {"name": "Gallop Racer 2006", "details_link": "https://www.metacritic.com/game/playstation-2/gallop-racer-2006", "publisher": "Tecmo", "release_date": "May  2 2006", "developers": ["Tecmo"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Horse Racing"], "meta_score": 69, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/4270f85eaf25aa74a34da63a47b61eab-98.jpg", "descriptions": "Gallop Racer 2006 is set in a horse racing theme park called Gallop Racing Square, with five attractions that you can freely select between. Title Collection has you select a horse, either a real life stallion or one that you've created, and follow it from early races until retirement.Gallop Racer 2006 is set in a horse racing theme park called Gallop Racing Square, with five attractions that you can freely select between. Title Collection has you select a horse, either a real life stallion or one that you've created, and follow it from early races until retirement. Gallop Stallion is the game's horse creation mode. Memorial Quest allows players to relive the experience of 100 classic races. Hall of Fame is an expansion of Memorial Quest mode, featuring fifty races. Finally, Field of Legend is an attraction where you race a horse that you created in Gallop Stallion mode against real life horses.… Expand"}, {"name": "Lightning Returns: Final Fantasy XIII", "details_link": "https://www.metacritic.com/game/xbox-360/lightning-returns-final-fantasy-xiii", "publisher": "Square Enix", "release_date": "Feb 11 2014", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["General", "Role-Playing", "General", "Japanese-Style"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/75e473facac47b1c6d33dee4298bbb75-98.jpg", "descriptions": "A direct sequel to the unhelpfully titled Final Fantasy XIII-2, Lightning Returns is another action-RPG, this time with a retooled gameplay system and a story that picks up a mere 500 years later, concluding the FFXIII saga."}, {"name": "Warframe", "details_link": "https://www.metacritic.com/game/pc/warframe", "publisher": "Digital Extremes", "release_date": "Mar 25 2013", "developers": ["Digital Extremes"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "genres": ["General", "Shooter", "Sci-Fi", "General", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 69, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/45144a48b7f0f687224afe30ccff2017-98.jpg", "descriptions": "They were called Tenno. Warriors of blade and gun: masters of the Warframe armor. Those that survived the old war were left drifting among the ruins. Now they are needed once more. The Grineer, with their vast armies, are spreading throughout the solar system. A call echoes across the starsThey were called Tenno. Warriors of blade and gun: masters of the Warframe armor. Those that survived the old war were left drifting among the ruins. Now they are needed once more. The Grineer, with their vast armies, are spreading throughout the solar system. A call echoes across the stars summoning the Tenno to an ancient place. They summon you. Allow the Lotus to guide you. She has rescued you from your cryostasis chamber and given you a chance to survive. The Grineer will find you; you must be prepared. The Lotus will teach you the ways of the Warframes and the secrets to unlocking their powers. Come Tenno, you must join the war.… Expand"}, {"name": "Need for Speed: Shift", "details_link": "https://www.metacritic.com/game/psp/need-for-speed-shift", "publisher": "EA Games", "release_date": "Sep 15 2009", "developers": ["EA Bright Light"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/18016730a94db3dcf81981f7272bc03c-98.jpg", "descriptions": "Need for Speed SHIFT brings a true driver's experience to some of the world's most iconic racing tracks, including the storied Brand's Hatch in the UK. The game also features the largest roster of high-performance cars in Need for Speed history including race cars such as the Pagani Zonda F,Need for Speed SHIFT brings a true driver's experience to some of the world's most iconic racing tracks, including the storied Brand's Hatch in the UK. The game also features the largest roster of high-performance cars in Need for Speed history including race cars such as the Pagani Zonda F, Porsche 911 GT2 and Lotus Elise. Players are thrust into the loud, intense, and athletic experience of racing a car from the driver's perspective through the combination of perception based G-forces, the hyper reality of the cockpit view, and the all-new brutally disorienting crash dynamic. Need for Speed SHIFT features an accurate, accessible physics-based driving model that allows you to feel every impact, every change of track surface and every last bit of grip as you push yourself to the edge. [Electronic Arts]… Expand"}, {"name": "Tron 2.0: Killer App", "details_link": "https://www.metacritic.com/game/xbox/tron-20-killer-app", "publisher": "Buena Vista Interactive", "release_date": "Nov  4 2004", "developers": ["Climax Group"], "platforms": ["PC", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 69, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/f56e54413d589e05b8a460abd4b2583c-98.jpg", "descriptions": "Take on the role of digital warriors Tron and Mercury as you battle against The Corruptor, an evil computer program attempting to create the ultimate virus and take over the system. In more than 30 intense levels featuring multiple types of gameplay, you'll engage in third-person isometricTake on the role of digital warriors Tron and Mercury as you battle against The Corruptor, an evil computer program attempting to create the ultimate virus and take over the system. In more than 30 intense levels featuring multiple types of gameplay, you'll engage in third-person isometric action, first-person vehicle combat, and light cycle racing. You can battle against three of your friends in multiplayer Light Cycle, Tank, and Recognizer modes. Collect and trade 100 upgrade chips that allow you to customize your character, unlock secrets, and more. … Expand"}, {"name": "LEGO Bricktales", "details_link": "https://www.metacritic.com/game/playstation-5/lego-bricktales", "publisher": "Thunderful", "release_date": "Oct 12 2022", "developers": ["ClockStone Studio"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action Adventure", "Sandbox"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/4548e613e22226d7c5f494f5c8a8f70a-98.jpg", "descriptions": "Your grandfather, a genius inventor, has called you for help! His beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren't made to bring it up to code. With the help of your powerful little robot buddy,Your grandfather, a genius inventor, has called you for help! His beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren't made to bring it up to code. With the help of your powerful little robot buddy, you can restore it using a mysterious device based on alien technology.As a source of power, the device needs happiness crystals, which you can harvest by making people happy and solving their problems. With the aid of a portal, travel to different locations all around the world to help people and collect their happiness crystals. Strap in for the ultimate building adventure and save your grandfather's amusement park!In this puzzle-adventure, use an intuitive brick-by-brick building mechanic to solve puzzles and bring your creations to life! Experience a charming story as you explore beautiful LEGO dioramas and help the people inhabiting them.… Expand"}, {"name": "Scarf", "details_link": "https://www.metacritic.com/game/pc/scarf", "publisher": "HandyGames", "release_date": "Dec 23 2021", "developers": ["Uprising Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/6330c43d8980dc52fb2e41508e24d6c5-98.jpg", "descriptions": "What does it mean to be a hero? To fulfil your destiny? Or to rebel against it? Scarf is an exciting adventure that blends the lyricism of a walking simulator with a 3D platform game to offer an allegorical journey through three beautiful worlds. The Meadow, the Desert, and the Mountain areWhat does it mean to be a hero? To fulfil your destiny? Or to rebel against it? Scarf is an exciting adventure that blends the lyricism of a walking simulator with a 3D platform game to offer an allegorical journey through three beautiful worlds. The Meadow, the Desert, and the Mountain are places filled with mystery. Will you discover their secrets? And at what price?… Expand"}, {"name": "Forsaken World", "details_link": "https://www.metacritic.com/game/pc/forsaken-world", "publisher": "Perfect World Entertainment", "release_date": "Mar 22 2011", "developers": ["Perfect World Entertainment"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 69, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/2/ebfb9932f2cdd3e7c1f047d593f8144c-98.jpg", "descriptions": "Forsaken World is an online fantasy MMORPG by Perfect World Entertainment."}, {"name": "Lips: Party Classics", "details_link": "https://www.metacritic.com/game/xbox-360/lips-party-classics", "publisher": "Microsoft Game Studios", "release_date": "Mar  2 2010", "developers": ["iNiS"], "platforms": "Xbox 360", "genres": ["Action", "Miscellaneous", "Rhythm", "Music Maker", "Music Maker", "Music"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/c5eb16443cbda220dc021d6e751998f2-98.jpg", "descriptions": "Keep the party going with Lips™: Party Classics, the third singing game in the Lips franchise exclusively for Xbox 360. Lips: Party Classics offers 40 unforgettably catchy songs that everyone loves to sing, including Gloria Gaynor’s “I Will Survive,” Spice Girls’ “Wannabe,” Right Said Fred’sKeep the party going with Lips™: Party Classics, the third singing game in the Lips franchise exclusively for Xbox 360. Lips: Party Classics offers 40 unforgettably catchy songs that everyone loves to sing, including Gloria Gaynor’s “I Will Survive,” Spice Girls’ “Wannabe,” Right Said Fred’s “I’m Too Sexy,” The Cure’s “Friday I’m in Love,” The Knack’s “My Sharona,” Village People’s “Y.M.C.A.,” and more. With a steady stream of songs releasing on Xbox LIVE every week, building your collection of tunes and performing along to your favorite singer has never been easier.… Expand"}, {"name": "Disney's Chicken Little: Ace in Action", "details_link": "https://www.metacritic.com/game/playstation-2/disneys-chicken-little-ace-in-action", "publisher": "Buena Vista Games", "release_date": "Nov  9 2006", "developers": ["Avalanche Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/bca18b73c10a7c7b212d108e89e64a71-98.jpg", "descriptions": "Inspired by the \"superhero movie within the movie\" finale of Walt Disney Pictures'  film \"Chicken Little,\" Disney\"s Chicken Little: Ace in Action features Ace, the superhero alter ego of Chicken Little, and the Hollywood versions of his misfit band of friends:  Runt, Abby andInspired by the \"superhero movie within the movie\" finale of Walt Disney Pictures'  film \"Chicken Little,\" Disney\"s Chicken Little: Ace in Action features Ace, the superhero alter ego of Chicken Little, and the Hollywood versions of his misfit band of friends:  Runt, Abby and Fish-Out-of-Water. The crew of the intergalactic Battle Barn faces off against Foxy Loxy and her evil Amazonian sidekick, Goosey Loosey, who have an evil plan to take over Earth. Battle evil alien robots through multiple levels across the solar system and combat your foes in one of three distinct game play modes: Ace on foot as a soldier, Runt as the driver of an armored tank, or Abby as the pilot of a spaceship.  The original Chicken Little and his friends Abby, Runt and Fish we know from the film are featured in cut scenes throughout the game. [Buena Vista Games]… Expand"}, {"name": "Mario Party 5", "details_link": "https://www.metacritic.com/game/gamecube/mario-party-5", "publisher": "Nintendo", "release_date": "Nov 10 2003", "developers": ["Hudson"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/47fb93a211b309ec1d8a939e94f5ecce-98.jpg", "descriptions": "Mario Party 5 gives the Mario Party series new game boards, more than 60 new minigames, new playable characters, an expanded single-player mode and, of course, more multiplayer madness than you can handle.  In Mario Party 5, Mario and his friends are trying to restore peace to Dream World byMario Party 5 gives the Mario Party series new game boards, more than 60 new minigames, new playable characters, an expanded single-player mode and, of course, more multiplayer madness than you can handle.  In Mario Party 5, Mario and his friends are trying to restore peace to Dream World by racing around a collection of game boards.  This time around, players can change the location of event spaces by using special capsules found on each board.  The player with the most stars and coins at the end of the game wins.… Expand"}, {"name": "SWAT: Global Strike Team", "details_link": "https://www.metacritic.com/game/xbox/swat-global-strike-team", "publisher": "Sierra Entertainment", "release_date": "Oct 29 2003", "developers": ["Argonaut Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/5c35828ad36202568e066913210272ec-98.jpg", "descriptions": "You are Mathias Kincaid, a former member of the U.S.  Army's elite Delta Force turned SWAT: GST element leader.  In SWAT: Global Strike Team, you must guide Kincaid and his team from basic training through 21 missions linked by a powerful storyline.  Battle through 10 multiplayer only co-opYou are Mathias Kincaid, a former member of the U.S.  Army's elite Delta Force turned SWAT: GST element leader.  In SWAT: Global Strike Team, you must guide Kincaid and his team from basic training through 21 missions linked by a powerful storyline.  Battle through 10 multiplayer only co-op missions.  As a part of a SWAT team, you'll command your teammates by issuing orders using either the intuitive controller interface or the optional voice recognition system.  Get an authentic SWAT experience through multiple modes including Campaign, Co-op, Free-for-all, Team Deathmatch, and Time Attack.  … Expand"}, {"name": "Harry Potter: Quidditch World Cup", "details_link": "https://www.metacritic.com/game/xbox/harry-potter-quidditch-world-cup", "publisher": "Electronic Arts", "release_date": "Oct 28 2003", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Other"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/6c7f6e00af5a98757576f50159751ae8-98.jpg", "descriptions": "Take to the air in a game that allows players to fully experience the magical speed, power, and competition of Quidditch, the favorite sport of witches and wizards.  In Harry Potter: Quidditch World Cup, you'll experience the full complexity and exciting challenge of Quidditch, whichTake to the air in a game that allows players to fully experience the magical speed, power, and competition of Quidditch, the favorite sport of witches and wizards.  In Harry Potter: Quidditch World Cup, you'll experience the full complexity and exciting challenge of Quidditch, which involves two teams of seven players who fly on broomsticks, playing four balls simultaneously.  You control every position on a team, including three Chasers who try to score with the Quaffle, two Beaters who control the dangerous Bludgers, the Keeper who protects the goal, and the Seeker who chases the elusive Golden Snitch that must be caught to end the match.  … Expand"}, {"name": "Scooby-Doo! Night of 100 Frights", "details_link": "https://www.metacritic.com/game/playstation-2/scooby-doo!-night-of-100-frights", "publisher": "THQ", "release_date": "May 20 2002", "developers": ["Heavy Iron Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/2e90c215fd40f3c0728fc2b9eb2c2ad9-98.jpg", "descriptions": "The Mastermind has kidnapped Mystery Inc! It's up to Scooby-Doo to search for his lost friends. Guide Scooby through 12 huge levels that include a creepy mansion, a spooky cave, a ghostly graveyard, and a perilous pier. Help Scooby search for clues, avoid Classic Scooby-Doo monsters, useThe Mastermind has kidnapped Mystery Inc! It's up to Scooby-Doo to search for his lost friends. Guide Scooby through 12 huge levels that include a creepy mansion, a spooky cave, a ghostly graveyard, and a perilous pier. Help Scooby search for clues, avoid Classic Scooby-Doo monsters, use wacky inventions, eat Scooby Snacks, and gather groovy power-ups. Do you have what it takes to foil the Mastermind's plan to rid the world of Mystery Inc? [THQ]… Expand"}, {"name": "1nsane", "details_link": "https://www.metacritic.com/game/pc/1nsane", "publisher": "Codemasters", "release_date": "Feb  5 2001", "developers": ["Invictus"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Automobile"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/a170e5b2fdc5183b7167bfa00f32b7f7-98.jpg", "descriptions": "Forget rules, forget roads, Insane takes you to the world's most extreme locations and lets you drive all over them. Put your foot down and take on Internet players from across the globe. It's not just driving -- it's driving you mad.  [Codemasters]"}, {"name": "Oni", "details_link": "https://www.metacritic.com/game/playstation-2/oni", "publisher": "Rockstar Games", "release_date": "Jan 29 2001", "developers": ["Rockstar Toronto"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/da63666d531778fbb12fdcc03b3e21b4-98.jpg", "descriptions": "An intense anime thriller comes to life in Oni. Konoko, an elite member of the Technology Crimes Task Force, is on a mission to fight the evil Syndicate. Guide her as she kicks, punches, and jumps her way through rooms full of enemies. You'll have access to a variety of weapons ranging fromAn intense anime thriller comes to life in Oni. Konoko, an elite member of the Technology Crimes Task Force, is on a mission to fight the evil Syndicate. Guide her as she kicks, punches, and jumps her way through rooms full of enemies. You'll have access to a variety of weapons ranging from pistols and machine guns to mortar launchers and plasma weapons. As you delve deeper into the crime syndicate, the truth behind Konoko's past becomes clear.… Expand"}, {"name": "Quake III: Team Arena", "details_link": "https://www.metacritic.com/game/pc/quake-iii-team-arena", "publisher": "Activision", "release_date": "Dec 18 2000", "developers": ["id Software"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/5adeede4763cdf91c9ce8fc1a7d96d8c-98.jpg", "descriptions": "The first official expansion pack for \"Quake 3\" includes several new capture-the-flag and deathmatch maps, and now teams can design their own skins and logos as well as choose from different character heads."}, {"name": "Broken Sword: The Smoking Mirror", "details_link": "https://www.metacritic.com/game/pc/broken-sword-the-smoking-mirror", "publisher": "Virgin Interactive", "release_date": "Oct 31 1997", "developers": ["Revolution Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Third-Person", "Point-and-Click", "Modern", "Modern"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/cb1a4f457b543f0eda97ae61bfbd3084-98.jpg", "descriptions": "Plunge into a shadowy conspiracy world where the schemes of a mad drug kingpin and the prophesied return of an ancient Mayan god clash in what could be the end of all mankind. Race around the globe with George as he frantically attempts to free Nico, his investigaative reporter girlfriend,Plunge into a shadowy conspiracy world where the schemes of a mad drug kingpin and the prophesied return of an ancient Mayan god clash in what could be the end of all mankind. Race around the globe with George as he frantically attempts to free Nico, his investigaative reporter girlfriend, from othe clutches of Karzac's crime cartel. Guide Nico and George as they unravel the dark mysteries that lead them closer and closer to an ancient horror best left buried in the steamy jumgles of Central America. Gather clues and make friends, but be aware - a smiling face can hide a deadly obstacle in your quest to sop the return of \"he who devours the sun and consumes the flesh of all mankind,\" the Mayan God Tezcatlipoca. [Virgin Interactive]… Expand"}, {"name": "Runespell: Overture", "details_link": "https://www.metacritic.com/game/pc/runespell-overture", "publisher": "Mystic Box", "release_date": "Jul 20 2011", "developers": ["Mystic Box"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/400b67181d27ba768a44eb48b206912d-98.jpg", "descriptions": "Runespell: Overture is a Poker/Yahtzee type game with power ups and collectible cards."}, {"name": "Ivy the Kiwi?", "details_link": "https://www.metacritic.com/game/ds/ivy-the-kiwi", "publisher": "XSEED Games", "release_date": "Aug 24 2010", "developers": ["Prope"], "platforms": ["iPhone/iPad", "DS"], "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/ab94e90ed6e42c1c308a6ba38a938934-98.jpg", "descriptions": "Ivy the Kiwi? follows the storybook adventures of a lonely baby bird as she traverses beautiful 2-D landscapes and challenging obstacles in search of her mother. Players guide Ivy through her daunting journey utilising a unique control scheme: vines created and controlled by the player whoIvy the Kiwi? follows the storybook adventures of a lonely baby bird as she traverses beautiful 2-D landscapes and challenging obstacles in search of her mother. Players guide Ivy through her daunting journey utilising a unique control scheme: vines created and controlled by the player who aims to collect feathers to boost his score.… Expand"}, {"name": "Blazing Angels: Squadrons of WWII", "details_link": "https://www.metacritic.com/game/xbox/blazing-angels-squadrons-of-wwii", "publisher": "Ubisoft", "release_date": "Mar 23 2006", "developers": ["Ubisoft Romania"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "16  Online", "genres": ["Simulation", "Flight", "WWII"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/0e98c0487c77c9e9853127310fc3d349-98.jpg", "descriptions": "You can take to the skies and reenact some of the greatest air battles of World War II in Blazing Angels: Squadrons of WWII. The game features squadron-based combat, which lets you use the individual characteristics of your wingmen to complete the 18-mission single-player campaign. BlazingYou can take to the skies and reenact some of the greatest air battles of World War II in Blazing Angels: Squadrons of WWII. The game features squadron-based combat, which lets you use the individual characteristics of your wingmen to complete the 18-mission single-player campaign. Blazing Angels: Squadrons of WWII uses the graphical power of the Xbox 360 to accurately model battle sites--such as England, Morocco, and Pearl Harbor--and the 38 aircraft included in the game. Up to 16 players can battle via Xbox Live in both competitive and cooperative game modes.… Expand"}, {"name": "Mario & Sonic at the Olympic Games Tokyo 2020", "details_link": "https://www.metacritic.com/game/switch/mario-sonic-at-the-olympic-games-tokyo-2020", "publisher": "Sega", "release_date": "Nov  5 2019", "developers": ["Sega"], "platforms": "Switch", "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Athletics"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/259b506079feb0562f38d3c5c16b7d00-98.jpg", "descriptions": "Join Mario, Sonic and friends for their greatest adventure yet at the Olympic Games Tokyo 2020, exclusively on Nintendo Switch. Go for gold as you compete in action-packed sports games, including 4 brand new events to Tokyo 2020Skateboarding, Karate, Surfing, and Sport Climbing, as well as aJoin Mario, Sonic and friends for their greatest adventure yet at the Olympic Games Tokyo 2020, exclusively on Nintendo Switch. Go for gold as you compete in action-packed sports games, including 4 brand new events to Tokyo 2020Skateboarding, Karate, Surfing, and Sport Climbing, as well as a large selection of classic events.\r Features:\r * Get the party started on your Nintendo Switch with a variety of ways to play, including button play and motion controls in multiplayer game modes that support up to 4 locally and up to 8 online.\r* Play as Mario, Sonic, Yoshi, Amy Rose, Luigi, Dr. Eggman, and many more of your favorite characters. Stay tuned for more information!… Expand"}, {"name": "Thrillville", "details_link": "https://www.metacritic.com/game/playstation-2/thrillville", "publisher": "LucasArts", "release_date": "Nov 21 2006", "developers": ["Frontier Developments"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Strategy", "General"], "meta_score": 69, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/0/b5bae7362cf3c9032f735067082c416d-98.jpg", "descriptions": "Thrillville allows gamers of all ages to easily build and customize the coaster of your dreams. Gone are the days of the complex PC techniques used in other coaster games. Rather, Thrillville's easy to use building mode has been designed specifically for the console platforms and makesThrillville allows gamers of all ages to easily build and customize the coaster of your dreams. Gone are the days of the complex PC techniques used in other coaster games. Rather, Thrillville's easy to use building mode has been designed specifically for the console platforms and makes building all 75-plus rides from wooden, corkscrew and inverted coasters to merry go rounds, trains and carnival rides, easy, and most importantly, fun. Imagination is the only height limit with Thrillville, where the fun ranges from racing on go-kart tracks you put together and playing mini-golf on courses you designed to joining friends for dozens of four-player party games, from bumper cars to arcade shoot-‘em-ups. You can also tour the park on foot – a first for theme-park titles – chatting and joking with all the guests to help them out and make sure they’re enjoying themselves. [LucasArts]… Expand"}, {"name": "Turok", "details_link": "https://www.metacritic.com/game/xbox-360/turok", "publisher": "Touchstone", "release_date": "Feb  5 2008", "developers": ["Propaganda Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/3f8b1e3b56f73b596f70b11238e2f967-98.jpg", "descriptions": "Turok is an epic, story-driven FPS game set on a dark, mysterious planet in the near future. Players take on the role of Joseph Turok, a former Black Ops commando, now part of an elite Special Forces squad on a mission to take down a war criminal on a genetically-altered planet. After theTurok is an epic, story-driven FPS game set on a dark, mysterious planet in the near future. Players take on the role of Joseph Turok, a former Black Ops commando, now part of an elite Special Forces squad on a mission to take down a war criminal on a genetically-altered planet. After the ship is shot down while approaching the planet, Joseph Turok must use his instincts and elite military training to elude an army of well-trained soldiers, and the ravenous, unpredictable creatures that populate the dangerous environment. Joseph Turok’s mission? Survive at all costs. [Touchstone]… Expand"}]