[{"name": "Demon Skin", "details_link": "https://www.metacritic.com/game/pc/demon-skin", "publisher": "Buka Entertainment", "release_date": "Apr 13 2021", "developers": ["Ludus future"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "Action RPG"], "meta_score": 48, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/cfd54278ff4dd7d15de8107e669d3d7f-98.jpg", "descriptions": "Brutal Hack&Slash game with a challenging combat system in the same vein as Dark Souls plunges you into the harsh dark fantasy world to test your will and your skills. Only those who dare to get into the Demon Skin can survive!"}, {"name": "Carnival Games", "details_link": "https://www.metacritic.com/game/ds/carnival-games", "publisher": "2K Play", "release_date": "Jul  8 2008", "developers": ["Cat Daddy Games"], "platforms": ["iPhone/iPad", "DS"], "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "General", "Party", "Party / Minigame"], "meta_score": 48, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/1/bf0ab7396a97f8573c3eafa8f81234ad-98.jpg", "descriptions": "Carnival Games for DS brings the fun of the original to the DS during the summer vacation and travel season. Each game is designed from the ground up to take full advantage of the DS control mechanism. A frenzied combination of tapping, blowing, speaking and stylus maneuvering brings the nowCarnival Games for DS brings the fun of the original to the DS during the summer vacation and travel season. Each game is designed from the ground up to take full advantage of the DS control mechanism. A frenzied combination of tapping, blowing, speaking and stylus maneuvering brings the now famous midway to life. Favorites such as Alley Ball, Frog Leap and Dunk Tank are complemented with fresh games including RC Raceway and Clown Hammer. [2K Games]… Expand"}, {"name": "Tortuga - Two Treasures", "details_link": "https://www.metacritic.com/game/pc/tortuga---two-treasures", "publisher": "cdv Software", "release_date": "Mar 12 2007", "developers": ["Ascaron Entertainment GmbH", "Ascaron Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General"], "meta_score": 48, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/6/bd501711cd7f17265dea36e66b81d7fc-98.jpg", "descriptions": "Renowned writers Wolfgang Walk, Mark L. Barrett and Bob Bates tell the tale of Thomas \"Hawk\" Blythe and his powerful adversary, Edward Teach, better known as the dreaded Blackbeard. It is as much a pirate tale as ever there was, and this is one to make the blood boil with love and honor,Renowned writers Wolfgang Walk, Mark L. Barrett and Bob Bates tell the tale of Thomas \"Hawk\" Blythe and his powerful adversary, Edward Teach, better known as the dreaded Blackbeard. It is as much a pirate tale as ever there was, and this is one to make the blood boil with love and honor, conspiracy and theft, violence and murder. Features include: Blackbeard! The most feared and notorious pirate to sail the seas; Pirate story of voodoo, treasure, treachery and love; Battles at sea and on land, close combat, sneaking and climbing; 8 ship types, with diverse configurations and ammunition; Traditional collection of close combat weapons with some less conventional bonus weapons; Wide range of sword fight maneuvers, combo attacks and special moves. [CDV Software]… Expand"}, {"name": "Disney Bolt", "details_link": "https://www.metacritic.com/game/ds/disney-bolt", "publisher": "Disney Interactive Studios", "release_date": "Oct 21 2008", "developers": ["Avalanche Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "num_players": "2  Online", "genres": ["Adventure", "General", "General"], "meta_score": 48, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/b4499cf0338ed0d74e3fdcfca2f3f6ad-98.jpg", "descriptions": "Players take on the heroic personas of the TV star dog, Bolt, and his owner, Penny, from the high-action television series featured within the Disney film. As Bolt, players can use his superpowers, including laser vision and his superbark, which sends out a sonic blast to devastatePlayers take on the heroic personas of the TV star dog, Bolt, and his owner, Penny, from the high-action television series featured within the Disney film. As Bolt, players can use his superpowers, including laser vision and his superbark, which sends out a sonic blast to devastate opponents, and as Penny, players utilize stealth, hacking skills and a wheelbar, inspired by her scooter seen in the movie, to outwit enemies. [Disney Interactive Studios]… Expand"}, {"name": "Homefront: The Revolution", "details_link": "https://www.metacritic.com/game/playstation-4/homefront-the-revolution", "publisher": "Deep Silver", "release_date": "May 17 2016", "developers": ["Deep Silver Dambuster Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Modern", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 48, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/0/d9e7ccd85d1cbd948342fa1f08b3df5c-98.jpg", "descriptions": "Coming to Xbox One, the all-in-one games and entertainment system from Microsoft, PlayStation 4, PC, Mac and Linux in 2015, Homefront: The Revolution throws players into a near future dystopia. Catastrophic events have brought the United States to its knees and enabled the Korean People'sComing to Xbox One, the all-in-one games and entertainment system from Microsoft, PlayStation 4, PC, Mac and Linux in 2015, Homefront: The Revolution throws players into a near future dystopia. Catastrophic events have brought the United States to its knees and enabled the Korean People's Army forces to impose a brutal military occupation. Trapped in this American nightmare, Philadelphia has become a police state, where surveillance drones and armored patrols keep her once-proud citizens at heel, crushing any dissent with totalitarian force.… Expand"}, {"name": "Top Gun", "details_link": "https://www.metacritic.com/game/ds/top-gun", "publisher": "Mastiff", "release_date": "May  3 2006", "developers": ["InterActive Vision Games"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/08e934d8338331f6d108d654cc3f1d86-98.jpg", "descriptions": "The game features great multiplayer for 2-4 players (a 'lite' mode where only one player has a cartridge, and a full mode where every player has a cartridge), simulator and arcade modes, a ton of aircraft, air-to-ground, ground-to-air and lots of dog fighting. If you like flying, Top GunThe game features great multiplayer for 2-4 players (a 'lite' mode where only one player has a cartridge, and a full mode where every player has a cartridge), simulator and arcade modes, a ton of aircraft, air-to-ground, ground-to-air and lots of dog fighting. If you like flying, Top Gun and, most importantly, blowing stuff up... then you'll love this game. [Mastiff]… Expand"}, {"name": "Frank Herbert's Dune", "details_link": "https://www.metacritic.com/game/pc/frank-herberts-dune", "publisher": "DreamCatcher Interactive", "release_date": "Dec 14 2001", "developers": ["WideScreen Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 48, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/fee0345d5a9829e37c4984ce5afa687b-98.jpg", "descriptions": "Explore Dune, learn the Weirding Ways to fight the Sardaukars, harass the Harkonnens, sabotage their Spice factories, learn the secrets of the giant sand worms and use the mysterious substance, known as Spice, to gain power and to foresee enemy positions. You must become a master in the artExplore Dune, learn the Weirding Ways to fight the Sardaukars, harass the Harkonnens, sabotage their Spice factories, learn the secrets of the giant sand worms and use the mysterious substance, known as Spice, to gain power and to foresee enemy positions. You must become a master in the art of infiltration and strike the enemy when they least expect it, as you prepare the Fremen for the final assault... their ultimate battle for Independence. [DreamCatcher Interactive]… Expand"}, {"name": "Ephemeral Fantasia", "details_link": "https://www.metacritic.com/game/playstation-2/ephemeral-fantasia", "publisher": "Konami", "release_date": "Jul  9 2001", "developers": ["KCEJ"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 48, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/afe8f09e7bfc58685d625a6f1dee0644-98.jpg", "descriptions": "Originally known in Japan as \"Reiselied,\" this musical RPG focuses on a young musician-thief named Mouse and his lute who are invited to play at an island wedding where they become mired in a time-repeating adventure."}, {"name": "Mighty No. 9", "details_link": "https://www.metacritic.com/game/wii-u/mighty-no-9", "publisher": "Deep Silver", "release_date": "Jun 21 2016", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Wii U"], "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 48, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/9c2a49c60651e09daea3aa2e1540a0da-98.jpg", "descriptions": "Mighty No. 9 is an all-new Japanese side-scrolling action game that takes the best aspects of the 8- and 16-bit era classics you know and love, and transforms them with modern tech, fresh mechanics, and fan input into something fresh. You play as Beck, the 9th in a line of powerful robots,Mighty No. 9 is an all-new Japanese side-scrolling action game that takes the best aspects of the 8- and 16-bit era classics you know and love, and transforms them with modern tech, fresh mechanics, and fan input into something fresh. You play as Beck, the 9th in a line of powerful robots, and the only one not infected by a mysterious computer virus that has caused mechanized creatures the world over to go berserk. Run, jump, blast, and transform your way through six stages (or more, via stretch goals) you can tackle in any order you choose, using weapons and abilities stolen from your enemies to take down your fellow Mighty Number robots and confront the final evil that threatens the planet. Once, you worked together, side-by-side but now, your fellow Mighty No. robots have lashed out, taking over key strategic locations across the globe and infesting them with their minions. You have no choice: the other Mighty Numbers...Must. Be. Destroyed.… Expand"}, {"name": "Dragon Ball Z: Sagas", "details_link": "https://www.metacritic.com/game/gamecube/dragon-ball-z-sagas", "publisher": "Atari", "release_date": "Mar 22 2005", "developers": ["Avalanche Software"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 48, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/e4b871e07cc51322c26f176bb4b8fcca-98.jpg", "descriptions": "Join characters from the Dragon Ball Z animated series as they journey from the Saivan Saga through the Cell Games. You'll face a host of enemies, including Radiz, Nappa, Captain Ginyu, and Cell--each equipped with unique powers that you can inherit. The Dragon Ball Z world features fullyJoin characters from the Dragon Ball Z animated series as they journey from the Saivan Saga through the Cell Games. You'll face a host of enemies, including Radiz, Nappa, Captain Ginyu, and Cell--each equipped with unique powers that you can inherit. The Dragon Ball Z world features fully destructible battlefields, bonus areas, and other hidden surprises. Discover all the secrets in the single-player campaign, or challenge a friend in the two-player mode.… Expand"}, {"name": "Astonishia Story", "details_link": "https://www.metacritic.com/game/psp/astonishia-story", "publisher": "Ubisoft", "release_date": "Jun  6 2006", "developers": ["Sonnori"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 48, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/31e5e7d0bf0f95bda2355c186b21847b-98.jpg", "descriptions": "In Astonishia Story, players embody an honorable royal knight and embark upon an epic journey to recover a stolen sacred relic that symbolizes prosperity and fortune. Players must seek the help of wizards and many other mysterious allies to succeed. [Ubisoft]"}, {"name": "Popeye: Rush for Spinach", "details_link": "https://www.metacritic.com/game/game-boy-advance/popeye-rush-for-spinach", "publisher": "Namco", "release_date": "Apr 24 2005", "developers": ["Magic Pockets"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 48, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/dd092f24b3a936bddeb8ab36f8df9d29-98.jpg", "descriptions": "It's a race toward the finish line as your favorite characters from Popeye, the animated series, do everything they can to reach the spinach. Now you can play as Popeye, Olive Oyl, Bluto, or Wimpy, as well as compete in either single- or multiplayer races. How soon you arrive at the finishIt's a race toward the finish line as your favorite characters from Popeye, the animated series, do everything they can to reach the spinach. Now you can play as Popeye, Olive Oyl, Bluto, or Wimpy, as well as compete in either single- or multiplayer races. How soon you arrive at the finish line depends on how fast you can drive a car, grind rails on a skateboard, swing from a vine, fly with a jetpack, and more.… Expand"}, {"name": "Terminator Salvation", "details_link": "https://www.metacritic.com/game/xbox-360/terminator-salvation", "publisher": "Evolved Games", "release_date": "May 19 2009", "developers": ["GRIN"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 48, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/6989fda76578aef09f95248995a91104-98.jpg", "descriptions": "Assume the role of John Connor and battle for survival against the far superior forces of Skynet."}, {"name": "Paranautical Activity", "details_link": "https://www.metacritic.com/game/xbox-one/paranautical-activity", "publisher": "Digerati Distribution", "release_date": "Apr 29 2016", "developers": ["Code Avarice"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One"], "genres": ["Action", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 48, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/8/19cdf499bb467d3aaf21e6b32b00346e-98.jpg", "descriptions": "Paranautical Activity combines the classic FPS action of games like Doom and Quake, with the randomness and difficulty of modern roguelikes like Binding of Isaac and Spelunky."}, {"name": "Malice", "details_link": "https://www.metacritic.com/game/xbox/malice", "publisher": "Mud Duck Productions", "release_date": "Jun  2 2004", "developers": ["Argonaut Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 48, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/f316bdcd9590f3f6d84e6e1f5b5e571b-98.jpg", "descriptions": "Fallen demigoddess Malice has to regain her skills and powers and save the universe, all while exacting her revenge on the head-eating Dog God. It won't be easy--the Dog God's Crow Armies constantly try to beat you back to see Death. Plus, you'll have to get past the Dog God's sevenFallen demigoddess Malice has to regain her skills and powers and save the universe, all while exacting her revenge on the head-eating Dog God. It won't be easy--the Dog God's Crow Armies constantly try to beat you back to see Death. Plus, you'll have to get past the Dog God's seven lieutenants before you get to confront the terrible monster himself. Your journey takes you through 29 levels filled with dangerous opponents, bizarre challenges, and powerful weapons and magic.… Expand"}, {"name": "Murakumo: Renegade Mech Pursuit", "details_link": "https://www.metacritic.com/game/xbox/murakumo-renegade-mech-pursuit", "publisher": "Ubisoft", "release_date": "Mar  5 2003", "developers": ["From Software"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Shooter", "Rail"], "meta_score": 48, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/6ac269ae1a6de3acd95692be2bcf029e-98.jpg", "descriptions": "Launch into aerial mayhem as an elite Murakumo unit sent to suppress a rampage of renegade mechs. Blaze through cityscapes at supersonic speeds, lock on, and destroy targets with experimental Murakumo weaponry before all is lost."}, {"name": "Lux-Pain", "details_link": "https://www.metacritic.com/game/ds/lux-pain", "publisher": "Ignition Entertainment", "release_date": "Mar 27 2009", "developers": ["Killaware"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Visual Novel"], "meta_score": 48, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/b3f0f0f905c00558d8b54d2e25130238-98.jpg", "descriptions": "Lux-Pain is set in historical Kisaragi City, a town plagued by mysteries from small mishaps to murders - with no logical explanation as to why these events occur. It seems \"Silent\", a worm born through hate and sadness, has infected humans and forced them to commit atrocious crimes. TheLux-Pain is set in historical Kisaragi City, a town plagued by mysteries from small mishaps to murders - with no logical explanation as to why these events occur. It seems \"Silent\", a worm born through hate and sadness, has infected humans and forced them to commit atrocious crimes. The hero's parents, Atsuki, are victims of such crimes. To avenge his parents, Atsuki goes through a dangerous operation to acquire Lux-Pain in his left arm, a power so strong that his left eye turns golden when using it to seek and destroy Silent for good. [Ignition]… Expand"}, {"name": "CSI: Crime Scene Investigation: Hard Evidence", "details_link": "https://www.metacritic.com/game/xbox-360/csi-crime-scene-investigation-hard-evidence", "publisher": "Ubisoft", "release_date": "Sep 26 2007", "developers": ["Telltale Games"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 48, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/59e2d7493ad8dd8cdf728a61e6e1efd0-98.jpg", "descriptions": "CSI: Hard Evidence continues the crime-solving experience of Ubisoft's CSI video game series. Players join Gil Grissom, Catherine Willows and the rest of the Las Vegas cast to help solve crimes using realistic techniques and lab equipment. CSI: Hard Evidence features forensic reconstructionsCSI: Hard Evidence continues the crime-solving experience of Ubisoft's CSI video game series. Players join Gil Grissom, Catherine Willows and the rest of the Las Vegas cast to help solve crimes using realistic techniques and lab equipment. CSI: Hard Evidence features forensic reconstructions and atmospheric crime scenes taken directly from the television show, including an all-new garage lab for analyzing large evidence such as cars and boats, improved evidence gathering, review and lab mini-games, and more areas to explore, resulting in longer play experiences. [Ubisoft]… Expand"}, {"name": "Ford Bold Moves Street Racing", "details_link": "https://www.metacritic.com/game/pc/ford-bold-moves-street-racing", "publisher": "Eidos Interactive", "release_date": "Sep 25 2006", "developers": ["Razorworks"], "platforms": "PC", "num_players": "2  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 48, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/1/e8989212bdf0b8bd39013929b0d40323-98.jpg", "descriptions": "(Known as \"Ford Street Racing\" in the UK/EU)  Ford Bold Moves Street Racing delivers players a chance to race 18 officially licensed high performance Ford vehicles from the classic 1968 Mustang GT to the new scorching hot 2007 Shelby GT500. With plans to make the title affordable enough for(Known as \"Ford Street Racing\" in the UK/EU)  Ford Bold Moves Street Racing delivers players a chance to race 18 officially licensed high performance Ford vehicles from the classic 1968 Mustang GT to the new scorching hot 2007 Shelby GT500. With plans to make the title affordable enough for every gamer to own, Ford Street Racing is still pushing boundaries by delivering unique features such as the trademarked Maximum Team Control that allows players to switch on-the-fly between a team of three vehicles to dominate a race.  A progressive damage system also adds a new element of realism to the game, allowing every hit your vehicle takes to affect the appearance, performance and drivability of the vehicle. [Eidos Interactive]… Expand"}, {"name": "Blood Alloy: Reborn", "details_link": "https://www.metacritic.com/game/pc/blood-alloy-reborn", "publisher": "Nkidu Games Inc.", "release_date": "Mar  2 2016", "developers": ["Suppressive Fire Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/a991064bf395b29ceab560a6e228655d-98.jpg", "descriptions": "Become a hyper-agile, cybernetic machine of robot death in an ultra-fast 2D acrobatic shooter/slasher. Boost, slice and shoot your way to the top of the score rankings in Blood Alloy: Reborn, rendered in glorious cyberpunk pixels upon a pulsing synthwave soundtrack."}, {"name": "Fire Pro Wrestling", "details_link": "https://www.metacritic.com/game/xbox-360/fire-pro-wrestling", "publisher": "Microsoft Game Studios", "release_date": "Sep 21 2012", "developers": ["Spike", "Spike Chunsoft"], "platforms": "Xbox 360", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 48, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/4/6f1f66865e014223f4b6ded22a18251d-98.jpg", "descriptions": "Your Avatar, in a game of pro-wrestling. Fire Pro Wrestling is a dream come true game that lets your Xbox 360 Avatar fight like a real wrestler. Grow your Avatar, collect moves, costume, fight your friends offline and online, you'll have plenty to do before rising to your wrestling stardom."}, {"name": "Lucius II", "details_link": "https://www.metacritic.com/game/pc/lucius-ii", "publisher": "Shiver Games", "release_date": "Feb 13 2015", "developers": ["Shiver Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 48, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/6/78476f909ab2a880ac2ab6bbdea37047-98.jpg", "descriptions": "Lucius is taken to the psychiatric ward of St. Benedict’s Hospital by unsuspecting caretakers. The Book of Revelation predicts the birth of a child that would end up ruling the world with an iron rod. The first part of this prophecy has been fulfilled. It is time to take care of the rest."}, {"name": "LocoCycle", "details_link": "https://www.metacritic.com/game/xbox-one/lococycle", "publisher": "Microsoft Game Studios", "release_date": "Nov 22 2013", "developers": ["Twisted Pixel Games"], "platforms": ["PC", "Xbox 360", "Xbox One"], "genres": ["Driving", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 48, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/7/53b0b8f5a6517b40be46f17172fa587c-98.jpg", "descriptions": "Presenting I.R.I.S. 2-time Valedictorian of the illustrious Big Arms Academy's School of Assassination. Proficient in over forty forms of unarmed combat, earning Sensei status in Jiu-jitsu, Akido, Krav Maga, and Jeet June Do. Equally deadly with blades, handguns, and the latest nuclear technology."}, {"name": "Morphies Law", "details_link": "https://www.metacritic.com/game/switch/morphies-law", "publisher": "Cosmoscope GmbH", "release_date": "Aug 20 2018", "developers": ["Cosmoscope GmbH"], "platforms": ["PC", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 48, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/012a0f26151f2496429a18d9b4b43423-98.jpg", "descriptions": "Morphies Law is a 3rd person 3D shooter through which you can steal mass from other players making them shrink while you grow, which balances the game. Size affects everything! what you can do, how you can navigate the different maps, how to play each gamemode and more. Customize yourMorphies Law is a 3rd person 3D shooter through which you can steal mass from other players making them shrink while you grow, which balances the game. Size affects everything! what you can do, how you can navigate the different maps, how to play each gamemode and more. Customize your Morphie, choose your weapons and go steal some mass.… Expand"}, {"name": "Battle Assault 3 featuring Gundam Seed", "details_link": "https://www.metacritic.com/game/playstation-2/battle-assault-3-featuring-gundam-seed", "publisher": "Bandai", "release_date": "Dec  7 2004", "developers": ["Natsume"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 48, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/9ada671bd9127f39e0b20223869c4736-98.jpg", "descriptions": "Battle Assault 3 is Bandai?s first Gundam fighting game for the PlayStation 2, and features: 33 playable mobile suits to choose from, including 4 unlockable mobile suits from Gundam Wing and G Gundam. 5 playable modes: Mission, Versus, Tag Team, Survival, and Time Trial featuring 2 vs. 2Battle Assault 3 is Bandai?s first Gundam fighting game for the PlayStation 2, and features: 33 playable mobile suits to choose from, including 4 unlockable mobile suits from Gundam Wing and G Gundam. 5 playable modes: Mission, Versus, Tag Team, Survival, and Time Trial featuring 2 vs. 2 cooperative play. Special abilities, weapons, and moves straight from the TV series. Interactive 3D environments. Destroy buildings and objects then use them to attack your opponent. [Bandai]… Expand"}, {"name": "Zathura", "details_link": "https://www.metacritic.com/game/xbox/zathura", "publisher": "2K Games", "release_date": "Nov  2 2005", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 48, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/6e2c58ba8844d56c0ae1caf2904ea6a9-98.jpg", "descriptions": "The intergalactic journey begins when a mysterious board game thrusts the house of two young brothers, Walter and Danny, into outer space. Battle deadly aliens, menacing robots and other celestial hazards in this space journey filled with action-packed adventure!"}, {"name": "Those Who Remain", "details_link": "https://www.metacritic.com/game/pc/those-who-remain", "publisher": "Camel 101", "release_date": "May 28 2020", "developers": ["Camel 101"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 48, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/df7267ac76f117d498ae2080a0e11cf0-98.jpg", "descriptions": "As the lights go out, the embers of darkness are stoked in the sleepy town of Dormont. Confront uncomfortable horrors, keep your sanity in check and survive the night in this story-driven first-person psychological-thriller."}, {"name": "ChoroQ", "details_link": "https://www.metacritic.com/game/playstation-2/choroq", "publisher": "Atlus Co.", "release_date": "Nov 17 2004", "developers": ["Barnhouse Effect"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Other"], "meta_score": 48, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/68d34683691bdca6c0bec00cb4bd5ab1-98.jpg", "descriptions": "Experience a car racing game unlike any other. Combines the elements of a deep role playing adventure and intense racing action that will ensure hours upon hours of gameplay. Race on tricky, whacky and extreme courses that only Choro Q could present. From earthquake country to zero-gravityExperience a car racing game unlike any other. Combines the elements of a deep role playing adventure and intense racing action that will ensure hours upon hours of gameplay. Race on tricky, whacky and extreme courses that only Choro Q could present. From earthquake country to zero-gravity space, from haunted castles, mid-air highways and even underwater, there are over 160 adventurous races. Participate in over more than 100 events to earn 200 kinds of vehicles. Fully customizable vehicle bodies with tons of interchangeable parts and colors! Race head-to-head against a friend or compete in over 30 mini-games. [Atlus]… Expand"}, {"name": "James Cameron's Dark Angel", "details_link": "https://www.metacritic.com/game/playstation-2/james-camerons-dark-angel", "publisher": "Sierra Entertainment", "release_date": "Nov 18 2002", "developers": ["Radical Entertainment"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 48, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/f5ba0df5fddf1bb44b57ee78f4a28140-98.jpg", "descriptions": "James Cameron's Dark Angel is a 3rd person action adventure game that delivers intense hand-to-hand fighting and high-octane action reflective of the hit TV series. Set against the backdrop of a post-apocalyptic Seattle, players take on the role of Max, a genetically enhanced super-soldierJames Cameron's Dark Angel is a 3rd person action adventure game that delivers intense hand-to-hand fighting and high-octane action reflective of the hit TV series. Set against the backdrop of a post-apocalyptic Seattle, players take on the role of Max, a genetically enhanced super-soldier with attitude to spare, on a quest to reclaim her past by finding her sister and fellow genetically altered escapees. [Sierra]… Expand"}, {"name": "Valhalla Knights 3", "details_link": "https://www.metacritic.com/game/playstation-vita/valhalla-knights-3", "publisher": "XSEED Games", "release_date": "Oct 15 2013", "developers": ["K2"], "platforms": "PlayStation Vita", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 48, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/811d21520d59ee26c924872b0c28dcd8-98.jpg", "descriptions": "Valhalla Knights 3 is an action RPG with intense real-time battle and seven-on-seven party based combat. Players can create a main character and field-worthy party members from one of seven races as well as assign them a job class from the twenty choices available."}, {"name": "Vietcong: Purple Haze", "details_link": "https://www.metacritic.com/game/playstation-2/vietcong-purple-haze", "publisher": "Gathering", "release_date": "Sep 15 2004", "developers": ["Coyote Developments"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 48, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/6fd05ac3f933520a9d2e0e25e86bae14-98.jpg", "descriptions": "Vietcong: Purple Haze is a narrative-based First Person Shooter set during the Vietnam conflict. Players of Vietcong experience the war from the perspective of a soldier assigned to join a squad of U.S. Special Forces running reconnaissance missions deep into the jungles of Northern Vietnam.Vietcong: Purple Haze is a narrative-based First Person Shooter set during the Vietnam conflict. Players of Vietcong experience the war from the perspective of a soldier assigned to join a squad of U.S. Special Forces running reconnaissance missions deep into the jungles of Northern Vietnam.\rUtilizing any means necessary, players of Vietcong patrol various tactical regions – setting traps, gathering intelligence, calling in air strikes or ambushing enemy patrols. Over 18 dramatic missions featured in a cinematic single player campaign. Choose Quick Fight mode to fight as either a US or Vietcong soldier! Fight for honor and freedom in a 19 mission single player campaign, featuring 17 of the best from the PC version and 2 new missions unique to consoles! Start a quick fight and jump straight into the action! Play either as a US or Vietcong soldier, choose a weapon, map, number of enemies and difficulty then battle the clock for the best time. Strike from the shadows choosing from more than 30 unlockable weapons including an M16, M79 grenade launcher, Mosin-Nagent, Sten MKII and the M60. [Gathering]… Expand"}, {"name": "Bush Hockey League", "details_link": "https://www.metacritic.com/game/pc/bush-hockey-league", "publisher": "V7 Entertainment Inc.", "release_date": "Mar 28 2017", "developers": ["V7 Entertainment Inc."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Sports", "Team", "Ice Hockey", "Arcade"], "meta_score": 48, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/7/61e2ae7d7a5797675c835e673b27a5ba-98.jpg", "descriptions": "Aggressive hockey is back! Experience hockey the way it was meant to be played in this old school arcade style hockey game where blood on the ice is just another day at the rink. Big moustaches, no helmets, dirty hits, bench-clearing brawls, goalie fights, and stick fights – that’s Old TimeAggressive hockey is back! Experience hockey the way it was meant to be played in this old school arcade style hockey game where blood on the ice is just another day at the rink. Big moustaches, no helmets, dirty hits, bench-clearing brawls, goalie fights, and stick fights – that’s Old Time Hockey.… Expand"}, {"name": "Le Tour de France 2013 - 100th Edition", "details_link": "https://www.metacritic.com/game/playstation-3/le-tour-de-france-2013---100th-edition", "publisher": "Focus Home Interactive", "release_date": "Jul  2 2013", "developers": ["Cyanide"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Alternative", "Individual", "Biking", "Biking"], "meta_score": 48, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/727a3c060a6d94370675dfb86d983cb1-98.jpg", "descriptions": "An Exceptional 100th Edition!Take control of the greatest champions during a Tour de France 2013 full of new features! With a more dynamic gameplay and a new graphic engine, live 21 official stages more realistic than ever. Build your race strategies, reach your objectives and win theAn Exceptional 100th Edition!Take control of the greatest champions during a Tour de France 2013 full of new features! With a more dynamic gameplay and a new graphic engine, live 21 official stages more realistic than ever. Build your race strategies, reach your objectives and win the yellow jersey to become the new Legend of Le Tour!- Total control of the trajectory- Races more realistic than ever- Multiplayer Modes: Coop and Versus… Expand"}, {"name": "WinBack 2: Project Poseidon", "details_link": "https://www.metacritic.com/game/playstation-2/winback-2-project-poseidon", "publisher": "Koei", "release_date": "Apr 25 2006", "developers": ["Cavia Inc."], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/25f9f68071a250764764a6d3bfa017c1-98.jpg", "descriptions": "In a world where terror takes many forms, a new weapon threatens to shake the balance of power. Freedom's last hope rests in the hands of three new operatives, who must race against time to recover this doomsday device. The fate of the world hangs by a thread, and a few ticks of the clockIn a world where terror takes many forms, a new weapon threatens to shake the balance of power. Freedom's last hope rests in the hands of three new operatives, who must race against time to recover this doomsday device. The fate of the world hangs by a thread, and a few ticks of the clock means the difference between justice and annihilation. WINBACK 2 brings to the series a new \"route\" system that lets players experience each mission from the perspective of different operatives. There are 30 intense missions, multiple difficulty levels, and new weapons including the highly-anticipated sniper rifle. The new Winback assault team is comprised of three young, yet combat-proven operatives led by Craig Contrell. Each team member is qualified in six different weapon types and highly-adept at CQB (Close Quarter Battle). They are masters of target identification, engagement and shot placement. In the hands of the player, all of these techniques will be put to the test. The game's unique shooting action is spread across 30 high-risk operations situated in challenging urban environments and conveyances. [Koei]… Expand"}, {"name": "Sherlock Holmes and the Mystery of Osborne House", "details_link": "https://www.metacritic.com/game/ds/sherlock-holmes-and-the-mystery-of-osborne-house", "publisher": "THQ", "release_date": "Jan  4 2011", "developers": ["Frogwares"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "First-Person", "Modern", "Modern"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/4076f0a17b91d9d24919dfc61c64d241-98.jpg", "descriptions": "In this brand new big adventure, especially designed for Nintendo's handheld system, you play as the famous detective Sherlock Holmes and you will have to shed some light on curious events. When Queen Victoria's genealogical records are stolen, the Royal Family decides to put you in chargeIn this brand new big adventure, especially designed for Nintendo's handheld system, you play as the famous detective Sherlock Holmes and you will have to shed some light on curious events. When Queen Victoria's genealogical records are stolen, the Royal Family decides to put you in charge of the case and asks you to solve this strange mystery. As always, followed by your wise and faithful friend, Doctor Watson, you will have to use your logic and observation senses through dozens of riddles, puzzles and brain teasers of all sorts. You will travel through dozens of beautifully hand-drawn places, looking for clues and new mysteries. You will also meet many charismatic characters who will help you solve this strange case and finally discover the truth!… Expand"}, {"name": "Astro Boy: The Video Game", "details_link": "https://www.metacritic.com/game/wii/astro-boy-the-video-game", "publisher": "D3Publisher", "release_date": "Oct 20 2009", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 48, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/8/b6b9d2d4128802c1634b718dae25a5e7-98.jpg", "descriptions": "In ASTRO BOY: THE VIDEO GAME, players become the iconic hero, Astro Boy, and take to the streets and skies on an epic adventure to save Metro City from the clutches of the evil President Stone and his robot army. Utilizing Astro's entire arsenal of iconic weapons and abilities - SuperIn ASTRO BOY: THE VIDEO GAME, players become the iconic hero, Astro Boy, and take to the streets and skies on an epic adventure to save Metro City from the clutches of the evil President Stone and his robot army. Utilizing Astro's entire arsenal of iconic weapons and abilities - Super Strength, Flight, Arm Cannons, Butt Machine Guns and Drill Attacks - players battle hordes of robot enemies and colossal bosses including some never-before-seen enemies across Metro City and the mysterious Surface. Using an intuitive combat system that adds depth to gameplay, players experience classic platform action and exhilarating combat levels as they use Astro’s unique rocket boosters to hover, avoid enemies and zip out of the way of danger. [D3Publisher]… Expand"}, {"name": "Aliens: Colonial Marines", "details_link": "https://www.metacritic.com/game/xbox-360/aliens-colonial-marines", "publisher": "Sega", "release_date": "Feb 12 2013", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 48, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/4/cef5196f15893f8de66600398c032b56-98.jpg", "descriptions": "In Aliens: Colonial Marines, players are part of a United States Colonial Marine squad and must prepare to face an Aliens assault more intense and horrific than ever before. Driven by an original story penned by renowned writers Bradley Thompson and David Weddle, Aliens: Colonial MarinesIn Aliens: Colonial Marines, players are part of a United States Colonial Marine squad and must prepare to face an Aliens assault more intense and horrific than ever before. Driven by an original story penned by renowned writers Bradley Thompson and David Weddle, Aliens: Colonial Marines retains the atmospheric look and feel of the original films while leveraging next-generation technology to create an entirely new interactive Aliens experience. Packing classic Aliens weaponry ranging from pulse rifles to flamethrowers as well as brand-new equipment and skills all within a squad-based combat system, players become an elite United States Colonial Marine. Featuring claustrophobic environments, a brooding soundtrack, and a multitude of surprises and shocks, players battle against menacing alien hordes in levels that include the stark interiors of the abandoned Sulaco and unique environments created specifically for the game. Aliens: Colonial Marines features a story driven single-player mode and an all-new four player co-op mode allowing players to share the chilling experience with three friends. In co-op mode, each player assumes the persona of a United States Colonial Marine and have a distinct role to play in the completion of every mission. [Sega]… Expand"}, {"name": "FlingSmash", "details_link": "https://www.metacritic.com/game/wii/flingsmash", "publisher": "Nintendo", "release_date": "Nov  7 2010", "developers": ["Artoon"], "platforms": "Wii", "genres": ["Action", "General", "General"], "meta_score": 48, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/fd4d0f49c5b19dce8feb9945f97b3eac-98.jpg", "descriptions": "Span Smasher combines the hands-on fun of tennis with the nonstop action and instant\rgratification of pinball."}, {"name": "DICE: DNA Integrated Cybernetic Enterprises", "details_link": "https://www.metacritic.com/game/playstation-2/dice-dna-integrated-cybernetic-enterprises", "publisher": "Bandai", "release_date": "Sep 22 2005", "developers": ["Natsume"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/50c23418db69365423fadef00e629ea4-98.jpg", "descriptions": "Always on call, always on alert - DICE is ready for action. Choose from 11 different Dino-breakers as seen in the TV series. Complete missions to unlock 2 game original Dinobreakers. Transform from vehicle to dinosaur mode or even fight on foot to defeat the enemy. Select the bestAlways on call, always on alert - DICE is ready for action. Choose from 11 different Dino-breakers as seen in the TV series. Complete missions to unlock 2 game original Dinobreakers. Transform from vehicle to dinosaur mode or even fight on foot to defeat the enemy. Select the best Dinobreaker for the mission; use their different skills and techniques to maximize points. Upgrade your weapons by unlocking or purchasing new features to destroy your enemies. [Bandai]… Expand"}, {"name": "Stormrise", "details_link": "https://www.metacritic.com/game/xbox-360/stormrise", "publisher": "Sega", "release_date": "Mar 24 2009", "developers": ["Creative Assembly"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 48, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/37064e1a82f1b77b9ea1b07aede9d967-98.jpg", "descriptions": "Stormrise offers fans of the classic RTS genre an immersive and dramatic twist while challenging the conscience of the gamer. Experience the heat of the battlefield by leading your troops from the front line, instead of the traditional way of controlling the units from a detached view point.Stormrise offers fans of the classic RTS genre an immersive and dramatic twist while challenging the conscience of the gamer. Experience the heat of the battlefield by leading your troops from the front line, instead of the traditional way of controlling the units from a detached view point. Stormrise also allows units to be commanded in the air, across rooftops, on the earth's surface and even underground, this unique idea of \"verticality\" introduces multiple layers of gameplay that must be mastered for strategic advantage. The experience is heightened by a simple yet effective control system tailored specifically for consoles, which allows easy unit selection, rapid navigation and precise deployment. Set on a bleak and barren earth, devastated by a catastrophic event centuries ago, Stormrise sees the Echelon and the Sai battling to survive in a hostile and uninhabitable wasteland. Remnants of a superior technological people the Echelon survived the event through self-educed hibernation, while the Sai, a more tribal faction, still exist having learned to adapt to their surroundings and the new environment. Having evolved in vastly different ways, the differences between the two factions have spurred much animosity and hatred between the two races and the future of the planet is now hanging by a thread. [Sega]… Expand"}, {"name": "Otomedius Excellent", "details_link": "https://www.metacritic.com/game/xbox-360/otomedius-excellent", "publisher": "Konami", "release_date": "Nov  1 2011", "developers": ["Konami"], "platforms": "Xbox 360", "num_players": "1-3 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 48, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/8e7d30d1ddb61fbaed6c1cf91944334f-98.jpg", "descriptions": "As the sequel to the 2008 Japanese hit Otomedius Gorgeous, Otomedius Excellent boasts a significant visual and gameplay update since its predecessor,\" said Shinji Hirano, President of Konami Digital Entertainment, Inc.  \"Accompanied by brilliant graphics and an excellentAs the sequel to the 2008 Japanese hit Otomedius Gorgeous, Otomedius Excellent boasts a significant visual and gameplay update since its predecessor,\" said Shinji Hirano, President of Konami Digital Entertainment, Inc.  \"Accompanied by brilliant graphics and an excellent soundtrack, Otomedius Excellent will engage fans with the Gradius franchise on a whole new level.… Expand"}, {"name": "Alien Syndrome", "details_link": "https://www.metacritic.com/game/wii/alien-syndrome", "publisher": "Sega", "release_date": "Jul 24 2007", "developers": ["Totally Games"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 48, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/ca268aa0d7e1a9b97e10f5368a6f8a4c-98.jpg", "descriptions": "In Alien Syndrome, players take control of the game's strong and enigmatic heroine – Earth Command Trooper Aileen Harding – and battle a variety of fearsome aliens and colossal bosses. Gamers choose from a wide selection of character specialties and skills as they progress through anIn Alien Syndrome, players take control of the game's strong and enigmatic heroine – Earth Command Trooper Aileen Harding – and battle a variety of fearsome aliens and colossal bosses. Gamers choose from a wide selection of character specialties and skills as they progress through an engrossing campaign, protected by many different types of armor and using a variety of melee and ranged weaponry. Players can improve their heroine's statistics and discover a huge number of powerful new abilities as they fight through infested spaceships and bizarre alien planets. Alien Syndrome features two fast-paced action-RPG modes – the dramatic and engaging single-player campaign, plus an infinitely replayable co-op multiplayer mode for up to four players. Derived from the classic SEGA arcade game, Alien Syndrome's new action-RPG gameplay makes it easy to pick up and play, while its depth and wealth of features and missions keeps it challenging for all gamers. Alien Syndrome features 20 different weapons including flamethrowers, quad-barreled lasers, nanobot swarms that dissolve enemies, and incendiary grenades that shoot fire geysers from the ground. Each weapon offers advantages and disadvantages, dependent upon how it is used and the specializations players have chosen to adopt. Alien Syndrome's fast-paced combat also allows for any number of combat strategies to defeat over 100 different alien enemies at one time. [Sega]… Expand"}, {"name": "Element Space", "details_link": "https://www.metacritic.com/game/playstation-4/element-space", "publisher": "Blowfish Studios", "release_date": "Mar 24 2020", "developers": ["Sixth Vowel"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/f8ab53e93b9f3db6850c985fa85bedd5-98.jpg", "descriptions": "Year 2199. Assemble an elite crew and make allies as factions of the Galactic Congress grapple to determine a future for humanity’s space colonies. In this sci-fi tactical RPG, command Pietham’s squad through turn-based battles, strategize ideal positions to decimate foes in 24 hand-craftedYear 2199. Assemble an elite crew and make allies as factions of the Galactic Congress grapple to determine a future for humanity’s space colonies. In this sci-fi tactical RPG, command Pietham’s squad through turn-based battles, strategize ideal positions to decimate foes in 24 hand-crafted stages.… Expand"}, {"name": "Red Bull BC One", "details_link": "https://www.metacritic.com/game/ds/red-bull-bc-one", "publisher": "Ignition Entertainment", "release_date": "Sep 16 2008", "developers": ["Smack Down Productions"], "platforms": "DS", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 48, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/3c69ccf33956dcd4be504b7ef0cb4238-98.jpg", "descriptions": "The game takes the player to the international Red Bull BC One breakdance tournament that challenges B-boys and B-girls alike. Players control their break dancer by solving puzzles under strict time limits. Puzzles consist of drawing geometrical shapes, which get more complex as the gameThe game takes the player to the international Red Bull BC One breakdance tournament that challenges B-boys and B-girls alike. Players control their break dancer by solving puzzles under strict time limits. Puzzles consist of drawing geometrical shapes, which get more complex as the game progresses. A steady hand and speed are required to set a high score that is worth bragging about. The game features fresh and stylish graphics with urban music as well as tense puzzle rounds alternating with a variety of minigames. [Playlogic]… Expand"}, {"name": "Cabela's Alaskan Adventures", "details_link": "https://www.metacritic.com/game/xbox-360/cabelas-alaskan-adventures", "publisher": "Activision", "release_date": "Sep 19 2006", "developers": ["FUN Labs"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Nature", "Hunting", "Hunting"], "meta_score": 48, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/6ab8aa3b128be019a6381c2c07342247-98.jpg", "descriptions": "Players use a combination of skill and strategy to complete 38 hunting and fishing adventures across 12 vast Alaskan regions from the North Slope to Ketchikan. With more customization than ever before, each adventure begins at an Alaskan outpost where players choose from thousands of gearPlayers use a combination of skill and strategy to complete 38 hunting and fishing adventures across 12 vast Alaskan regions from the North Slope to Ketchikan. With more customization than ever before, each adventure begins at an Alaskan outpost where players choose from thousands of gear options including rifles, shotguns, bows and arrows, fishing tackle, clothing, scents, calls and more. Gamers are also able to go exploring or get to their next hunting spot by choosing to ride a snowmobile, truck or ATV.  With more than 20 species of the most sought after Alaskan Trophy Game including Yukon Moose, Barren Ground Caribou, Grizzly and Kodiak Bears, Roosevelt Elk, Dall Sheep, Sitka Black-Tailed Deer, and 10 different species of Alaskan fish, including Sockeye Salmon, Dolly Varden and Arctic Char, hunters and fisherman alike will be challenged for hours in the virtual Alaskan wild. [Activision]… Expand"}, {"name": "Digimon World 4", "details_link": "https://www.metacritic.com/game/playstation-2/digimon-world-4", "publisher": "Bandai", "release_date": "Jun  2 2005", "developers": ["Bandai"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 48, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/7dc67126cba4aa9e50a35381293a7282-98.jpg", "descriptions": "Brace yourself, the Digimon are back and they’re ready for another adventure! All access to the Real World has been terminated, security has been breached, and in the process of the investigation a new mysterious world has been discovered. It's up to you, the Digital Security Guard toBrace yourself, the Digimon are back and they’re ready for another adventure! All access to the Real World has been terminated, security has been breached, and in the process of the investigation a new mysterious world has been discovered. It's up to you, the Digital Security Guard to investigate and bring peace back to the Digital World. Play as the most popular Digimon from the TV series. Featuring a new enhanced battle system, with real-time battles. Unlock special Digivolved Digimon by mastering skills and techniques.  [Bandai]… Expand"}, {"name": "Spyro: Enter the Dragonfly", "details_link": "https://www.metacritic.com/game/gamecube/spyro-enter-the-dragonfly", "publisher": "VU Games", "release_date": "Nov  8 2002", "developers": ["Equinoxe"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 48, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/9/04a201c3845084bac2a1e09de34bfd46-98.jpg", "descriptions": "Spyro is back to embark on a new magical journey through Dragon Realms.  Gnasty Gnorc and Ripto are back with a plan to steal the Dragonflies of the Dragon Realm.  With help from new and old friends, you must avoid obstacles, jump on platforms, ride vehicles, collect gems, and find a way toSpyro is back to embark on a new magical journey through Dragon Realms.  Gnasty Gnorc and Ripto are back with a plan to steal the Dragonflies of the Dragon Realm.  With help from new and old friends, you must avoid obstacles, jump on platforms, ride vehicles, collect gems, and find a way to return the Dragonflies and restore order to the Dragon Realm.  Spyro: Enter the Dragonfly features vibrant graphics, lively animations, and new multiple breath weapons.  With new powers such as electric and bubble breath, new characters, vehicles including tanks, UFO's, rockets, and surfboards, and over 30 levels of unique environments, Spyro looks to create an unforgettable adventure.… Expand"}, {"name": "Carmageddon 3: TDR 2000", "details_link": "https://www.metacritic.com/game/pc/carmageddon-3-tdr-2000", "publisher": "Xicat Interactive", "release_date": "Dec 14 2000", "developers": ["Torus Games"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 48, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/3267e6c2195edc5760d3acc6279694d4-98.jpg", "descriptions": "Ever been stuck in a traffic jam, dying to get out? Everyone wants to slam into the car in front of them and jet away. Now imagine you can destroy the cars that chase you, and run down pedestrians in the process. Throw in a deathmobile and some wicked powerups and you're on your way toEver been stuck in a traffic jam, dying to get out? Everyone wants to slam into the car in front of them and jet away. Now imagine you can destroy the cars that chase you, and run down pedestrians in the process. Throw in a deathmobile and some wicked powerups and you're on your way to Carmageddonville, baby! [Xicat Interactive]… Expand"}, {"name": "Regular Show: Mordecai and Rigby in 8-Bit Land", "details_link": "https://www.metacritic.com/game/3ds/regular-show-mordecai-and-rigby-in-8-bit-land", "publisher": "D3Publisher", "release_date": "Oct 29 2013", "developers": ["WayForward"], "platforms": "3DS", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 48, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/912f9d3057ddfe0c00ef3bd7e0a4f3e8-98.jpg", "descriptions": "Regular Show: Mordecai and Rigby in 8-Bit Land has players help Mordecai and Rigby use their best skills and unique abilities to traverse the various challenges to escape their favorite video games and get home."}, {"name": "Brave: A Warrior's Tale", "details_link": "https://www.metacritic.com/game/wii/brave-a-warriors-tale", "publisher": "SouthPeak Games", "release_date": "Aug 10 2009", "developers": ["Collision Studios"], "platforms": ["Xbox 360", "Wii"], "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 48, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/2d1a0dd5d2115fb8b52b52016a40f2fd-98.jpg", "descriptions": "Brave: A Warrior’s Tale brings players expansive exploration and in-game interactivity on their quest to protect their tribe from the sources of evil, continuously offering a significant challenge to players as they advance through a world of untamed wilderness. Embracing his inner spirit,Brave: A Warrior’s Tale brings players expansive exploration and in-game interactivity on their quest to protect their tribe from the sources of evil, continuously offering a significant challenge to players as they advance through a world of untamed wilderness. Embracing his inner spirit, Brave is able to communicate as well as embody various animals and battle enemies that stand in his way. [SouthPeak Games]… Expand"}, {"name": "SpongeBob Squarepants: The Yellow Avenger", "details_link": "https://www.metacritic.com/game/psp/spongebob-squarepants-the-yellow-avenger", "publisher": "THQ", "release_date": "Mar  6 2006", "developers": ["Tantalus"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Action", "General", "General", "Platformer", "2D"], "meta_score": 48, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/a4ec2a5a3af160c4991bcea8103ac807-98.jpg", "descriptions": "The Super Villain Twenty Year Reunion is coming to Bikini Bottom and the evil Dirty Bubble has kidnapped Mermaidman and Barnacleboy for the festivities. It's up to Mermaidman's #1 fan, SpongeBob, to save the day. Help SpongeBob use his new super powers to fight the Dirty Bubble and hisThe Super Villain Twenty Year Reunion is coming to Bikini Bottom and the evil Dirty Bubble has kidnapped Mermaidman and Barnacleboy for the festivities. It's up to Mermaidman's #1 fan, SpongeBob, to save the day. Help SpongeBob use his new super powers to fight the Dirty Bubble and his legions of evildoers. Utilize all the special powers of Mermaidman's belt: Water Ball, Raging Whirlwind, Summon Sea Creatures, Super Speed and Super Strength. Explore the massive world of SpongeBob SquarePants in a dense and richly-detailed 3D environment. Non-linear gameplay allows players multiple paths in order to complete main objectives. [THQ]… Expand"}, {"name": "MX Vs ATV: Supercross", "details_link": "https://www.metacritic.com/game/xbox-360/mx-vs-atv-supercross", "publisher": "Nordic Games Publishing", "release_date": "Oct 28 2014", "developers": ["Rainbow Studios", "Nordic Games Publishing"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Arcade", "Motorcycle", "Other", "Motocross"], "meta_score": 48, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/2cdad87dcf5330fc21799b8f6644af99-98.jpg", "descriptions": "Rip, jump and scrub your way around 17 tracks and try to cross the finishing line first against more than 40 official riders and harvest all that motocross glory. Choose between bikes or ATVs, multiple game modes including Career, Single races and various local and online multiplayer eventsRip, jump and scrub your way around 17 tracks and try to cross the finishing line first against more than 40 official riders and harvest all that motocross glory. Choose between bikes or ATVs, multiple game modes including Career, Single races and various local and online multiplayer events with up to\r12 players. Perform amazing tricks to impress your fans or just 'whip' over jumps to finish the race first. Customize your rider with items from more than 80 licensed motocross companies and whirl up dirt and dust on your way to victory.\r 17 Supercross Tracks for both MX and ATV riding\rCareer mode with 3 series\rMore than 80 licensed motocross companies\rOver 40 professional riders licensed to race against\rNew improved physics and control system including reinterpreting the fan favorite pre-load\rMultiplayer with up to 12 players\rSplitscreen Mode for 2 local players\rMotoclub Depot with regular content updates… Expand"}, {"name": "Dogz", "details_link": "https://www.metacritic.com/game/game-boy-advance/dogz", "publisher": "Ubisoft", "release_date": "Nov 17 2005", "developers": ["MTO"], "platforms": ["PC", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 48, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/7dc16ca5f6afb2dc977bfe57eb2234c9-98.jpg", "descriptions": "Dogz is a pet simulation game that lets owners name, train and play with a realistic puppy. Players create and control a main character and choose one of 49 different dogs from 18 different breeds. As characters in the game, owners can take their puppies everywhere within the virtualDogz is a pet simulation game that lets owners name, train and play with a realistic puppy. Players create and control a main character and choose one of 49 different dogs from 18 different breeds. As characters in the game, owners can take their puppies everywhere within the virtual environment, from through the house to around the neighborhood to visit friends. Gamers will earn their puppy's love and loyalty by remembering to feed and groom it and reward it when it does things correctly. Owners can train the puppy to lie down, shake, fetch and perform many other tricks.… Expand"}, {"name": "Freestyle Street Soccer", "details_link": "https://www.metacritic.com/game/gamecube/freestyle-street-soccer", "publisher": "Acclaim", "release_date": "Mar 25 2004", "developers": ["Gusto Games"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 48, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/18be2972d11ff48fea83a79cc59f87c8-98.jpg", "descriptions": "Freestyle Street Soccer focuses on 10 individual gangs--all based on the different styles, fashions, and cultures found in the concrete jungle. These teams fiercely compete for each other's turf with the ultimate goal to gain control of the whole city. You'll join the battle as one of 40Freestyle Street Soccer focuses on 10 individual gangs--all based on the different styles, fashions, and cultures found in the concrete jungle. These teams fiercely compete for each other's turf with the ultimate goal to gain control of the whole city. You'll join the battle as one of 40 players with individual catchphrases, plus trick, combo, and special moves. As you conquer the challenges in five game modes, remember--on the streets, it's just as important to look cool as it is to score goals.… Expand"}, {"name": "Paradise Cracked", "details_link": "https://www.metacritic.com/game/pc/paradise-cracked", "publisher": "Tri Synergy", "release_date": "Sep 30 2003", "developers": ["Mist Land"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 48, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/312495b2df107a6e918055327a51a4d2-98.jpg", "descriptions": "For many years the world had suffered from overpopulation and ecological destruction, until the leading scientists created CyberBrain - a supercomputer that solved all the global problems and turned the overpopulated and polluted Earth into Paradise. You are a young hacker. Once, while inFor many years the world had suffered from overpopulation and ecological destruction, until the leading scientists created CyberBrain - a supercomputer that solved all the global problems and turned the overpopulated and polluted Earth into Paradise. You are a young hacker. Once, while in cyberspace you managed to break into a secured area and came across a series of strange data packets. You hurriedly copied these to disk, not even having the time to read their contents. Only a few minutes later you hear a police siren, followed by banging on the door and demands to open up... [Buka Entertainment]… Expand"}, {"name": "Dragon Ball Z: Infinite World", "details_link": "https://www.metacritic.com/game/playstation-2/dragon-ball-z-infinite-world", "publisher": "Atari", "release_date": "Dec  4 2008", "developers": ["Dimps Corporation"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 48, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/74544f9fac8eb9117fc33869c903e1be-98.jpg", "descriptions": "Dragon Ball Z: Infinite World combines all the best elements of previous Dragon Ball Z games, while boasting new features such as “Dragon Missions”, new battle types and drama scenes for fans to delve deeper than ever before into the Dragon Ball Z® universe. The new “Dragon Missions” inDragon Ball Z: Infinite World combines all the best elements of previous Dragon Ball Z games, while boasting new features such as “Dragon Missions”, new battle types and drama scenes for fans to delve deeper than ever before into the Dragon Ball Z® universe. The new “Dragon Missions” in Dragon Ball Z: Infinite World include many famous scenes from the Dragon Ball Z series never before seen in a video game. A range of missions from time attack in the “Snake Road Mission” alongside other action and racing-style missions puts players’ strategy and quick-thinking skills to the test beyond simply showing off their deadly fighting skills. But no Dragon Ball Z game would be complete without its fair share of spectacular battles. Dragon Ball Z: Infinite World uses a simplified battle system taken from the recently released next-gen Dragon Ball Z: Burst Limit for thrilling hand-to-hand fighting on the ground, or flying leaps and aerial combat in the skies. Defeat your opponent by blasting damaging Ki attacks from the sky or by diving into him and launching an explosive smash attack. The game features over 40 unique characters, not counting the various character transformations which multiply the playing potential. On top of characters, fighting techniques and battle stages, Dragon Ball Z: Infinite World also includes selected drama scenes from the previous games all presented using beautifully refined effects and shading techniques. [Atari]… Expand"}, {"name": "Delta Force - Black Hawk Down: Team Sabre", "details_link": "https://www.metacritic.com/game/playstation-2/delta-force---black-hawk-down-team-sabre", "publisher": "NovaLogic", "release_date": "Nov 21 2006", "developers": ["Rebellion"], "platforms": "PlayStation 2", "num_players": "32  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 48, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/77a834d275092c456c11e0565fa80fd5-98.jpg", "descriptions": "Two all new single-player campaigns – Embark on 11 challenging missions through treacherous South American jungles and across the high deserts of Iran. Insert by Black Hawk into enemy territory, fight your way through a mountain stronghold and pursue the enemy through hostile oil fields. NewTwo all new single-player campaigns – Embark on 11 challenging missions through treacherous South American jungles and across the high deserts of Iran. Insert by Black Hawk into enemy territory, fight your way through a mountain stronghold and pursue the enemy through hostile oil fields. New weapons, squad commands and characters - Select from 24 weapons to maximize your effectiveness in battle, including two never before seen weapons in the Black Hawk Down series; the MK-23 SOCOM and the L115A sniper rifle. Take command of the world’s most elite Special Forces teams – Delta Force and the British SAS – and order your squad mates to lay down suppressive fire or execute a flanking maneuver on the enemy. New multiplayer warfare: Join in the action in intense fire fights with up to 32 players online and seven unique game types including new variants and old classics. Persistent statistic tracking allows you to follow your progress as you rise through the ranks. Battle it out with up to four of your friends in split-screen or work together against a common foe in cooperative play. With 24 multiplayer maps to choose from and voice-over-net for immediate battlefield intel, prepare for battles that are even more intense than the original Black Hawk Down. [Sierra Entertainment]… Expand"}, {"name": "Eragon", "details_link": "https://www.metacritic.com/game/xbox-360/eragon", "publisher": "Sierra Entertainment", "release_date": "Nov 14 2006", "developers": ["Stormfront Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Action Adventure", "Fantasy", "General", "Fantasy", "Beat-'Em-Up", "Japanese-Style", "3D"], "meta_score": 48, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/99e7a6209f9913d6d1d98e9998dd6c3b-98.jpg", "descriptions": "Play as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features aPlay as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features a variety of blistering attacks and defences, including a unique degradable block system. Extensive Dragon Combat – Ride Saphira and blast your enemies with bursts of fire, and call in devastating dragon attacks during melee battles. Eragon features multiplayer co-op with team attack bonuses and dragon fight/flight combo gameplay. Full cooperation from the film production team provides faithful implementation of the movie's look-and-feel. As Eragon discovers the powers hidden within him he learns to unleash magical attacks to decimate his foes. [Vivendi Games]… Expand"}, {"name": "The Dark Eye : Book of Heroes", "details_link": "https://www.metacritic.com/game/pc/the-dark-eye-book-of-heroes", "publisher": "Wild River Games", "release_date": "Jun  9 2020", "developers": ["Random Potion Oy"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Role-Playing", "General"], "meta_score": 48, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/5/860c410e9fd85efbc515a1746e039bec-98.jpg", "descriptions": "Experience classical role-playing together with your friends in a co-op multiplayer RPG based on THE DARK EYE license that lets you engage in party-based adventures in the fantasy world of Aventuria."}, {"name": "A Bastard's Tale", "details_link": "https://www.metacritic.com/game/playstation-4/a-bastards-tale", "publisher": "No Pest Productions", "release_date": "Oct  4 2016", "developers": ["No Pest Productions"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Beat-'Em-Up", "Fighting", "2D"], "meta_score": 48, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/2ffaccc6b974e315f5e26e416ce454c6-98.jpg", "descriptions": "Adapt to how the enemy attacks and defends with a vast array in enemy types."}, {"name": "IRONFALL Invasion", "details_link": "https://www.metacritic.com/game/3ds/ironfall-invasion", "publisher": "VD-DEV", "release_date": "Feb 26 2015", "developers": ["VD-DEV"], "platforms": "3DS", "genres": ["Sci-Fi", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 48, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/bc7f68e759d5305b451ae47b0ca20923-98.jpg", "descriptions": "IronFall is a Third Person Shooter which takes place in 2017, following a massive invasion of Earth. The player must confront a horde of robots from the Omega nebula. They have only one goal, destroy humans to exploit the land mineral resources."}, {"name": "Harry Potter and the Half-Blood Prince", "details_link": "https://www.metacritic.com/game/ds/harry-potter-and-the-half-blood-prince", "publisher": "EA Games", "release_date": "Jun 30 2009", "developers": ["EA Bright Light"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 48, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/3073068041d2084523a8a878cf9d65e6-98.jpg", "descriptions": "In Harry Potter and the Half-Blood Prince, Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the finalIn Harry Potter and the Half-Blood Prince, Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle that he knows is fast approaching. Together they work to find the key to unlock Voldemort's defenses and, to this end, Dumbledore recruits his old friend and colleague, the well-connected and unsuspecting bon vivant Professor Horace Slughorn, whom he believes holds crucial information. Meanwhile, the students are under attack from a very different adversary as teenage hormones rage across the ramparts. Harry finds himself more and more drawn to Ginny, but so is Dean Thomas. And Lavender Brown has decided that Ron is the one for her, only she hadn't counted on Romilda Vane's chocolates! And then there's Hermione, simmering with jealously but determined not to show her feelings. As romance blossoms, one student remains aloof. He is determined to make his mark, albeit a dark one. Love is in the air, but tragedy lies ahead and Hogwarts may never be the same again. In the game, players return to Hogwarts to help Harry survive a fraught sixth year. They also have a chance to engage in exciting wizard duels, mix and brew magical ingredients in Potions class and take to the air to lead the Gryffindor Quidditch team to victory. Players may even get sidetracked by Ron's romantic entanglements as they journey towards a dramatic climax and discover the identity of the Half-Blood Prince. [Electronic Arts]… Expand"}, {"name": "Daylight", "details_link": "https://www.metacritic.com/game/playstation-4/daylight", "publisher": "Atlus", "release_date": "Apr 29 2014", "developers": ["Zombie Studios"], "platforms": ["PC", "PlayStation 4"], "genres": ["Horror", "Action Adventure", "Horror", "Survival"], "meta_score": 48, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/8/a9e0e6d25cd46a20743cea658a80e008-98.jpg", "descriptions": "Explore the ever-changing world of this procedurally generated horror game. Waking up in an abandoned hospital with only your mobile phone for illumination, you explore the institution's dark criminal past as you attempt to escape. In Daylight no two experiences are the same, and it is bestExplore the ever-changing world of this procedurally generated horror game. Waking up in an abandoned hospital with only your mobile phone for illumination, you explore the institution's dark criminal past as you attempt to escape. In Daylight no two experiences are the same, and it is best played alone in the dark. Daylight introduces you to a procedurally generated world that will change each and every time you play. Each time you begin a new game, you experience a new world with new content and encounters; from the layout of the building and the things you seek to the events you encounter, it is never the same experience twice.… Expand"}, {"name": "Past Cure", "details_link": "https://www.metacritic.com/game/pc/past-cure", "publisher": "Phantom 8", "release_date": "Feb  2 2018", "developers": ["Phantom 8"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Survival"], "meta_score": 48, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/21a4924c8f5345c1b451505730a7a631-98.jpg", "descriptions": "Past Cure is a dark psychological thriller that blurs the lines between dreams and reality. An intense, cinematic, story driven experience, blending stealth and combat gameplay. Players are challenged to use an array of skills varying from powerful time bending mental abilities to brutalPast Cure is a dark psychological thriller that blurs the lines between dreams and reality. An intense, cinematic, story driven experience, blending stealth and combat gameplay. Players are challenged to use an array of skills varying from powerful time bending mental abilities to brutal melee combat and stealth kills.After his years of torture, ex elite soldier Ian lives in the safehouse of his brother, struggling with the consequences of the military experiments he was put through. They twisted his mind, imbued him with preternatural mental abilities such as time control and telekinesis. Driven by hallucinations and his thirst for revenge, Ian enlists his brother's help as he sets out on a thrilling hunt for the perpetrators of the conspiracy against him, and for the truth underlying his torment. On his missions Ian experiments with his new powers, quickly coming to realize their inherent danger: with each use, his sanity frays a little more, inviting the nightmarish attention of something beyond reality.… Expand"}, {"name": "The Fight: Lights Out", "details_link": "https://www.metacritic.com/game/playstation-3/the-fight-lights-out", "publisher": "SCEA", "release_date": "Nov  9 2010", "developers": ["Coldwood Interactive"], "platforms": "PlayStation 3", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 48, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/a310a2f7d3a6ba875bf7b3b8c15f80c5-98.jpg", "descriptions": "Grab your PlayStation Move motion controllers and step into the dark and gritty underground of bare knuckle brawling in The Fight: Lights Out. The power to climb to the top of the underground scene is in your hands. The only rule is that there are no rules - you decide how to take down yourGrab your PlayStation Move motion controllers and step into the dark and gritty underground of bare knuckle brawling in The Fight: Lights Out. The power to climb to the top of the underground scene is in your hands. The only rule is that there are no rules - you decide how to take down your next challenger. Get them in a headlock and throw elbows to the skull, or go ballistic by swinging with all-out haymakers. Use the PlayStation Move motion controllers to dominate opponents with accurately tracked strikes. Do you have what it takes to rule the underground?… Expand"}, {"name": "Arkham Horror: Mother's Embrace", "details_link": "https://www.metacritic.com/game/pc/arkham-horror-mothers-embrace", "publisher": "Asmodee", "release_date": "Mar 23 2021", "developers": ["LuckyHammers"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Board / Card Game", "Tactics"], "meta_score": 48, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/9/444d0eda066c730f8683822c4d8e5373-98.jpg", "descriptions": "The year is 1926: a professor of astronomy is found dead in her mansion and everything indicates that she has been the victim of a heinous murder. Choose from 12 intrepid investigators from the Arkham Horror games, each with a unique set of skills, and assemble your team to shed the lightThe year is 1926: a professor of astronomy is found dead in her mansion and everything indicates that she has been the victim of a heinous murder. Choose from 12 intrepid investigators from the Arkham Horror games, each with a unique set of skills, and assemble your team to shed the light over this mysterious death.Find clues, perform interrogations and progress through nine chapters as the story unfolds. Your investigation will take you to visit shadowed institutions and mysterious locales, ranging from Miskatonic University, the Arkham Asylum, and the bayous of Louisiana. As you face off against Lovecraftian horrors, your investigators will descend deeper into the depths of madness, affecting their level of sanity and causing traumas that will impact the course of your investigation. Care about your sanity and make the right choices the Ancient Ones are preparing their return.… Expand"}, {"name": "Monster 4x4: Masters of Metal", "details_link": "https://www.metacritic.com/game/playstation-2/monster-4x4-masters-of-metal", "publisher": "Ubisoft", "release_date": "Nov 25 2003", "developers": ["Ubisoft"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Truck"], "meta_score": 48, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/2e0294cd38fe7ebdbdb1006d0595305d-98.jpg", "descriptions": "Whether you're grinding through mud pits in Louisiana, crunching up cliffs in California, or smashing up trees to make the ride a little bumpier for the guy behind you, keep your eyes on the prize: the cash you earn on the circuit goes to buy new trucks and build up your ultimate MonsterWhether you're grinding through mud pits in Louisiana, crunching up cliffs in California, or smashing up trees to make the ride a little bumpier for the guy behind you, keep your eyes on the prize: the cash you earn on the circuit goes to buy new trucks and build up your ultimate Monster machine. Tear through 30 Monster events, including brutal stadium circuits, merciless exhibition arenas, and the hairiest off-road circuits your tires have ever seen. Soup up your truck with speed, traction, and other power-ups to give your opponents a run for their money. Smoke the competition as you blaze through well-known U.S. locations, such as Alcatraz Island, Central Park, Louisiana swamps, Cape Canaveral, and the Arizona desert. Master your tricks in Training mode as you taste all of the thrills, spills, twists, and rolls of Monster Truck racing. Then show them what you?re made of in Single Race or Championship mode. Get behind the wheel of over 20unstoppable Monster trucks, including Grave Digger, Hulk, Spiderman, Wolverine, El Toro Loco, and Bulldozer. [Ubi Soft]… Expand"}, {"name": "Crouching Tiger, Hidden Dragon", "details_link": "https://www.metacritic.com/game/playstation-2/crouching-tiger-hidden-dragon", "publisher": "Ubisoft", "release_date": "Oct  9 2003", "developers": ["Light Weight"], "platforms": "PlayStation 2", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 48, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/77ecde08e5cfa1a54ca1d1b139c980f2-98.jpg", "descriptions": "Relive the epic story of Crouching Tiger, Hidden Dragon and recreate the kung-fu fury from the famed martial-arts masterpiece for the very first time! Unleash a variety of fighting techniques, weapons, stunts, and superhuman moves against brutally gifted enemies to master the art ofRelive the epic story of Crouching Tiger, Hidden Dragon and recreate the kung-fu fury from the famed martial-arts masterpiece for the very first time! Unleash a variety of fighting techniques, weapons, stunts, and superhuman moves against brutally gifted enemies to master the art of Wudan-style fighting, inspired by renowned choreographer Yuen Wo-Ping. Green Destiny beckons you. Rediscover the legend. [Ubi Soft]… Expand"}, {"name": "Crazy Taxi: Catch a Ride", "details_link": "https://www.metacritic.com/game/game-boy-advance/crazy-taxi-catch-a-ride", "publisher": "THQ", "release_date": "Apr  9 2003", "developers": ["Graphic State"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 48, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/772f39d99332c18478c1c7f3acc3e046-98.jpg", "descriptions": "Race against the clock as you pick up passengers and white-knuckle it through busy streets and back alleys. And time is money! So get a grip on the wheel and put the pedal to the metal."}, {"name": "Legend of the North: Konung", "details_link": "https://www.metacritic.com/game/pc/legend-of-the-north-konung", "publisher": "Strategy First", "release_date": "Dec 31 2000", "developers": ["1C", "1C Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 48, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/095a5910edf572471a5c4b6481ae28bd-98.jpg", "descriptions": "Epic fantasy role-playing. Your quest is to find the Dragon's Amulet and the eternal Bracelet Of Friendship, bringing order to the world. More than 60 non-linear quests, NPCs, and even monsters may join the party. Plus 50 magical artifacts, including teleportation and resurrection.  [Strategy First]"}, {"name": "Army Men: Sarge's Heroes 2", "details_link": "https://www.metacritic.com/game/playstation/army-men-sarges-heroes-2", "publisher": "3DO", "release_date": "Nov 21 2000", "developers": ["3DO"], "platforms": ["PlayStation 2", "PlayStation"], "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 48, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/98b259488e987fa867000cddd60cb4b5-98.jpg", "descriptions": "If you look up the definition of the word \"poor\" in a dictionary, there's a good chance you'll see Army Men: Sarge's Heroes 2 staring back at you."}, {"name": "Gravity Badgers", "details_link": "https://www.metacritic.com/game/wii-u/gravity-badgers", "publisher": "Wales Interactive", "release_date": "May 29 2014", "developers": ["Wales Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/c31adea61bc5c95434b0df0ccd9fd26d-98.jpg", "descriptions": "Step into the space suit of a valiant space badger as he ventures into the deadly depths of deep space to save his friends, family and the universe itself from the threat of the deadly Evil Honey Badgers aka the Hellsett. For the first time EVER a game unites the thrilling elements ofStep into the space suit of a valiant space badger as he ventures into the deadly depths of deep space to save his friends, family and the universe itself from the threat of the deadly Evil Honey Badgers aka the Hellsett. For the first time EVER a game unites the thrilling elements of Badgers and Gravity to create a stunningly presented physics based puzzle game that will take you beyond the realms of possibility, imagination and logic to the star dusted realm of the GRAVITY BADGERS!Throw yourself into the unfeeling grasp of planets, dodge asteroids and fight unyielding and deadly bosses in over a hundred levels of vacuum filled adventure and danger, all united under a stunning art style reminiscent of all your favourite 80's cartoons complete with a thumping mullet rock sound track!… Expand"}, {"name": "The Muppets: Movie Adventures", "details_link": "https://www.metacritic.com/game/playstation-vita/the-muppets-movie-adventures", "publisher": "SCEE", "release_date": "Sep  1 2015", "developers": ["Virtual Toys"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 48, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/6cd8d1dedf8da96e2feddf497ebd6662-98.jpg", "descriptions": "The Muppets Movie Adventures takes place across five blockbuster movie genres, ranging from the Wild West in a level called \"The Good, the Bad and the Animal\" staring Animal himself - to the far reaches of space, in a sci-fi adventure starring Kermit the Frog known as the \"The Koozebane Menace\"."}, {"name": "Stolen (2005)", "details_link": "https://www.metacritic.com/game/pc/stolen-2005", "publisher": "Hip Games", "release_date": "Apr 22 2005", "developers": ["Blue 52"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 48, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/5e1349f0eb18fce4271262146fea3e7e-98.jpg", "descriptions": "Stolen is an ultra realistic, third person, stealth-based, action game based around a high-tech female thief. Along with innovative high-tech stealth/robbery game actions and events, Stolen also boasts some truly amazing technical and presentational features to give it a spectacular lookStolen is an ultra realistic, third person, stealth-based, action game based around a high-tech female thief. Along with innovative high-tech stealth/robbery game actions and events, Stolen also boasts some truly amazing technical and presentational features to give it a spectacular look that will captivate gamers. Play the role of a Hollywood-style thief with a host of athletic and martial abilities. Break into and out of movie-like locations and steal priceless items. Use atmospheric real time volumetric shadow technology to hide from your enemies. [Hip Games]… Expand"}, {"name": "Resident Evil: Operation Raccoon City", "details_link": "https://www.metacritic.com/game/pc/resident-evil-operation-raccoon-city", "publisher": "Capcom", "release_date": "May 18 2012", "developers": ["Slant Six"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1-8 ", "genres": ["Action", "Action Adventure", "Horror", "Horror", "Shooter", "Third-Person", "Arcade"], "meta_score": 48, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/2/29d693ebae31146475783c2a93f5e5a5-98.jpg", "descriptions": "Resident Evil: Operation Raccoon City is the next game in the Resident Evil series brought to you by the former developers of SOCOM, Slant Six."}, {"name": "The Secrets of Atlantis", "details_link": "https://www.metacritic.com/game/pc/the-secrets-of-atlantis", "publisher": "The Adventure Company", "release_date": "May 29 2007", "developers": ["Atlantis Interactive Entertainment\t", "Atlantis Interactive Entertainment"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1 Player", "genres": ["Adventure", "3D", "First-Person", "Fantasy"], "meta_score": 48, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/8/6165aeb5aabe1dff002b7f5a814b6c73-98.jpg", "descriptions": "It's 1937 and Howard Brooks, a young aeronautical engineer, returns from a conference in Germany. On board the Hindenburg Zeppelin taking him to New York, Howard is attacked by members of an occult sect. He soon learns that these evil-doers covet the mysterious secret of a forgottenIt's 1937 and Howard Brooks, a young aeronautical engineer, returns from a conference in Germany. On board the Hindenburg Zeppelin taking him to New York, Howard is attacked by members of an occult sect. He soon learns that these evil-doers covet the mysterious secret of a forgotten civilization of which, it seems, he is an heir. Convinced that Howard possesses a key element of their research, they decide to set a trap for him. Caught up by his past, Howard sets out on an adventure that leads him to fascinating locations around the world: Macao, an Indian Palace, a temple in Mesopotamia and the Empire State Building in New-York. Each location has its own unique culture, landscape and secrets. Features more than 30 characters to keep you company on your travels. Watch out – not everyone is totally trustworthy. Filled with mystery and set in a unique film-noir style, The Secrets of Atlantis is a unique adventure game that gives you the feeling that you are really aboard the Hindenburg Zeppelin racing off to the world’s most exotic locations in search of answers to a forgotten civilization. [The Adventure Company]… Expand"}, {"name": "SNK vs. Capcom Card Fighters DS", "details_link": "https://www.metacritic.com/game/ds/snk-vs-capcom-card-fighters-ds", "publisher": "SNK Playmore", "release_date": "Apr 24 2007", "developers": ["SNK Playmore"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 48, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/1be445fab396f9b6b1701b5f7864fec8-98.jpg", "descriptions": "A unique strategy card fighting game with RPG elements and baseball card trade-ability. All-New Card Fighters game for the Nintendo DS. Use strategic card arrangements to win. Over 300 different cards to use, collect, and trade, Know your character and their special abilities and combineA unique strategy card fighting game with RPG elements and baseball card trade-ability. All-New Card Fighters game for the Nintendo DS. Use strategic card arrangements to win. Over 300 different cards to use, collect, and trade, Know your character and their special abilities and combine them for added value and strength. [SNK Playmore]… Expand"}, {"name": "MLB 2K13", "details_link": "https://www.metacritic.com/game/xbox-360/mlb-2k13", "publisher": "2K Games", "release_date": "Mar  5 2013", "developers": ["Visual Concepts"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 48, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/4/62f891eb86c6fcbd16839849c1f38129-98.jpg", "descriptions": "Major League Baseball 2K13 promises hours of baseball action for sports fans or gamers where players can master the signature right analog pitching controls to achieve the perfect delivery from the mound, enjoy the authentic baseball environment of MLB Today, and develop winning players andMajor League Baseball 2K13 promises hours of baseball action for sports fans or gamers where players can master the signature right analog pitching controls to achieve the perfect delivery from the mound, enjoy the authentic baseball environment of MLB Today, and develop winning players and teams in My Player, Franchise & Postseason modes.… Expand"}, {"name": "Pro Cycling Manager Season 2008: Le Tour de France", "details_link": "https://www.metacritic.com/game/pc/pro-cycling-manager-season-2008-le-tour-de-france", "publisher": "Focus Home Interactive", "release_date": "Jun 27 2008", "developers": ["Cyanide"], "platforms": "PC", "genres": ["Sports", "Alternative", "Individual", "Biking", "Biking"], "meta_score": 48, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/88de9308063a771be67520dd7b23b605-98.jpg", "descriptions": "The 2008 edition features improved racing graphics, a new lighting system, more detailed backgrounds and incredibly realistic rider models and animations. The management aspect also offers more depth and realism due to the new tools and systems available. Plus, for the first time, you canThe 2008 edition features improved racing graphics, a new lighting system, more detailed backgrounds and incredibly realistic rider models and animations. The management aspect also offers more depth and realism due to the new tools and systems available. Plus, for the first time, you can now compete in professional track cycling. [Focus Home Interactive]… Expand"}, {"name": "The Guy Game", "details_link": "https://www.metacritic.com/game/playstation-2/the-guy-game", "publisher": "Gathering", "release_date": "Aug 31 2004", "developers": ["Top Heavy Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Trivia / Game Show"], "meta_score": 48, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/c2155107f2c8bd69b66997cf4edddf32-98.jpg", "descriptions": "The Guy Game, a new video game based around the insanity that is Spring Break, was shot live on location on South Padre Island during Break, and challenges players to match wits with over 60 attractive co-eds, all of whom are set on showing off their best \"assets.\" The game features theThe Guy Game, a new video game based around the insanity that is Spring Break, was shot live on location on South Padre Island during Break, and challenges players to match wits with over 60 attractive co-eds, all of whom are set on showing off their best \"assets.\" The game features the following:  20 outrageous episodes featuring interviews, stunts and challenges with over 60 attractive college babes; funnyman host Matt Sadler, as seen on MTV and winner of HBO's National Talent Search; Smackdown with up to four players. Top scorer becomes \"President\" and makes the rules; low scorer loses influence and respect; Over 1000 popular trivia questions from the worlds of sports, movies, TV and more; Choose one of eight sexy babes to be a personal cheerleader; Find out who has the biggest Ballz in high-speed action mini-games such as Ballz Out, Ballz In and Ballz Shotz; Features the world famous Hottie Challenge. [Top Heavy / Gathering]… Expand"}, {"name": "SeaBlade", "details_link": "https://www.metacritic.com/game/xbox/seablade", "publisher": "Simon & Schuster", "release_date": "Nov 20 2002", "developers": ["Simon & Schuster"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/94f43d1ec824783df87e06ba3b93d74c-98.jpg", "descriptions": "SeaBlade is just too light on action, production quality, and overall gameplay to make it a worthwhile purchase."}, {"name": "Freestyle Motocross: McGrath Vs. Pastrana", "details_link": "https://www.metacritic.com/game/playstation/freestyle-motocross-mcgrath-vs-pastrana", "publisher": "Acclaim", "release_date": "Nov  5 2000", "developers": ["Z-Axis", "Ltd."], "platforms": "PlayStation", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/a1b28c2d904372df8e26cbee286f877c-98.jpg", "descriptions": "McGrath vs. Pastrana Freestyle Motocross is the primary candidate for an award no video game wants to win, the uninspired game of the year award."}, {"name": "Rock of the Dead", "details_link": "https://www.metacritic.com/game/xbox-360/rock-of-the-dead", "publisher": "Conspiracy Entertainment", "release_date": "Oct 19 2010", "developers": ["Epicenter Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 48, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/4/bd58888e8a08cf16755692477a44e54f-98.jpg", "descriptions": "With the guitar as your weapon of choice you'll journey through terrifying graveyards and sewers, battle the undead to protect your trailer park home, and even rock in front of the camera as you do battle at the television station. Use the power of rock to unleash a sonic blast on a group ofWith the guitar as your weapon of choice you'll journey through terrifying graveyards and sewers, battle the undead to protect your trailer park home, and even rock in front of the camera as you do battle at the television station. Use the power of rock to unleash a sonic blast on a group of flesh eaters, raise the guitar to the heavens to power a protective shield, or just strum the hard and heavy tunes as you riff your way through the infected masses to the sound of a rocking soundtrack. The fate of the world, as well as rock and roll itself, is in your hands.… Expand"}, {"name": "Alex Rider: Stormbreaker", "details_link": "https://www.metacritic.com/game/ds/alex-rider-stormbreaker", "publisher": "THQ", "release_date": "Oct  2 2006", "developers": ["Altron"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General", "Open-World"], "meta_score": 48, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/43a93cb054518a5d7a791c3a3d987772-98.jpg", "descriptions": "Embrace the role of Alex Rider to out-spy, outwit and out-cool evil.  Based on the teen spy movie, Alex Rider: Stormbreaker starring Mickey Rourke, Alicia Silverstone and Ewan McGregor, the video game captures all the excitement and suspense of Anthony Horowitz’s best-selling novel aboutEmbrace the role of Alex Rider to out-spy, outwit and out-cool evil.  Based on the teen spy movie, Alex Rider: Stormbreaker starring Mickey Rourke, Alicia Silverstone and Ewan McGregor, the video game captures all the excitement and suspense of Anthony Horowitz’s best-selling novel about teenage superspy Alex Rider. Game play includes combat, stealth missions, vehicles and the use of gadgets to achieve mission objectives. Explore Ian Rider's house, the breaker's yard, MI6's secret Liverpool Street headquarters, M16's training facilities and Darius Sayle's complex. Players obtain mission briefings from Mrs. Jones and Alan Blunt before they go undercover, improve their problem-solving skills at M16's top training camp and receive spy gadgets from Smithers to aid them in combat, navigation and unlocking special mini games. [THQ]… Expand"}, {"name": "Sonic Adventure", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-adventure", "publisher": "Sega", "release_date": "Sep 15 2010", "developers": ["Sonic Team"], "platforms": ["PC", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 48, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/cce8e13167ae4ab74f5bd82ceafdf534-98.jpg", "descriptions": "The Dreamcast classic now makes its way onto Xbox Live Arcade."}, {"name": "Summer Athletics: The Ultimate Challenge", "details_link": "https://www.metacritic.com/game/xbox-360/summer-athletics-the-ultimate-challenge", "publisher": "Crave", "release_date": "Jul 29 2008", "developers": ["49Games"], "platforms": ["PC", "Xbox 360"], "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/fbc82215e78fd7980c911ccdcb67d422-98.jpg", "descriptions": "Summer Athletics brings more than 25 action-packed sports right into your home. Featuring controls custom-tailored the each platform, the game is accessible to all types of gamers. A character editor, career mode, 3D animations and realistic environments round out the game's offerings,Summer Athletics brings more than 25 action-packed sports right into your home. Featuring controls custom-tailored the each platform, the game is accessible to all types of gamers. A character editor, career mode, 3D animations and realistic environments round out the game's offerings, ensuring fun for the whole family and sports fans alike.… Expand"}, {"name": "Out of Ammo", "details_link": "https://www.metacritic.com/game/playstation-4/out-of-ammo", "publisher": "Zen Studios", "release_date": "Jan 30 2018", "developers": ["RocketWerkz"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 48, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/bd95773f8629fc5673439bdbff75d35a-98.jpg", "descriptions": "Out of Ammo is an intense virtual reality strategy game for PlayStation VR that puts you in the commander's seat against wave after wave of soldiers. Construct defenses, call in artillery, issue orders, and take control of your soldiers directly in order to survive for as long as you can."}, {"name": "Syberia 3", "details_link": "https://www.metacritic.com/game/playstation-4/syberia-3", "publisher": "Microids", "release_date": "Apr 25 2017", "developers": ["Microids"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 48, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/14627d67a92bbfb3769c3088e7a9fc66-98.jpg", "descriptions": "Join Kate Walker, a heroine beyond compare, in the unique world of Syberia. Dive into the story, puzzles, and mysteries of this fabulous adventure, conceived and drawn by Benoit Sokal, with music by Inon Zur. [Playstation.com]"}, {"name": "Star Wars The Clone Wars: Republic Heroes", "details_link": "https://www.metacritic.com/game/wii/star-wars-the-clone-wars-republic-heroes", "publisher": "LucasArts", "release_date": "Oct  6 2009", "developers": ["Krome Studios"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 48, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/bd23ce665c5cd9da0d74d1eec42bfbe0-98.jpg", "descriptions": "Star Wars The Clone Wars: Republic Heroes lets Star Wars fans young and old live out the sweeping galactic adventures of the Clone Wars. For the first time ever, players can fight as their favorite Jedi and clone troopers from the preeminent animated television series - from familiar facesStar Wars The Clone Wars: Republic Heroes lets Star Wars fans young and old live out the sweeping galactic adventures of the Clone Wars. For the first time ever, players can fight as their favorite Jedi and clone troopers from the preeminent animated television series - from familiar faces like Anakin Skywalker to new heroes like Clone Captain Rex. A brand-new storyline, which bridges the gap between season one and two, takes the player on a multi-faceted adventure to stop a mysterious techno assassin's destructive plot. Built around two-player cooperative action, the accessible controls and family-friendly gameplay bring Star Wars fans across generations together like never before to fight the evil Separatists and restore peace to the galaxy. Play as your favorite Jedi heroes including Anakin Skywalker, Obi-Wan Kenobi, Ahsoka Tano, Mace Windu, and Kit Fisto. Slice and dice your way through Separatist droids with your lightsaber and Force powers and use your agility to perform amazing leaps and navigate levels filled with interactivity. Turn your enemies into weapons as you commandeer droids and use their unique abilities to blast enemies and solve puzzles as a Jedi. Be part of an elite clone trooper squad with unique gameplay that puts firepower at your fingertips. Blast droids and unleash devastation with heavy weapons like rocket launchers and thermal detonators as Commander Cody, Captain Rex and all of your favorite clone troopers. Compete against a friend with in-level challenges for rewards and points to be spent to upgrade your character and unlock bonus items. [LucasArts]… Expand"}, {"name": "Michael Phelps: Push the Limit", "details_link": "https://www.metacritic.com/game/xbox-360/michael-phelps-push-the-limit", "publisher": "505 Games", "release_date": "Oct 11 2011", "developers": ["Blitz Games"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 48, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/6/b982123ec44cdb5bb4883f121cd9fa5a-98.jpg", "descriptions": "Michael Phelps - Push the Limits is a swimming simulation game for the 360."}, {"name": "Disney's Hide and Sneak", "details_link": "https://www.metacritic.com/game/gamecube/disneys-hide-and-sneak", "publisher": "Capcom", "release_date": "Nov 30 2003", "developers": ["Capcom"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/2d24e1428544e760fca82d8ad865fe42-98.jpg", "descriptions": "Minnie Mouse has been kidnapped by mysterious flying creatures, and it's up to Mickey to rescue her. Now, as either Mickey or Minnie, you must fight your way through three different stages, including a warehouse, museum, and ruins, and master special tricks and combinations. In each area,Minnie Mouse has been kidnapped by mysterious flying creatures, and it's up to Mickey to rescue her. Now, as either Mickey or Minnie, you must fight your way through three different stages, including a warehouse, museum, and ruins, and master special tricks and combinations. In each area, you'll solve puzzles, run, jump, and hide from enemies. Mickey can also hang onto ropes, climb onto containers, and use stealth maneuvers to evade foes. Disney's Hide and Sneak features more than 30 animated sequences for both playable characters.… Expand"}, {"name": "Midway's Greatest Arcade Hits", "details_link": "https://www.metacritic.com/game/game-boy-advance/midways-greatest-arcade-hits", "publisher": "Midway", "release_date": "Nov 22 2001", "developers": ["Midway"], "platforms": "Game Boy Advance", "genres": ["Miscellaneous", "Compilation"], "meta_score": 48, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/1352267b35776b5142ac17f76fc651af-98.jpg", "descriptions": "Four Great Games in One! DEFENDER Defend the planet from ravenous space aliens intent on kidnapping all of the humans under your protection in Defender. SINISTAR Prevent evil from being unleashed and destroying everything in its path in Sinistar. ROBOTRON: 2084 Save the last human family onFour Great Games in One! DEFENDER Defend the planet from ravenous space aliens intent on kidnapping all of the humans under your protection in Defender. SINISTAR Prevent evil from being unleashed and destroying everything in its path in Sinistar. ROBOTRON: 2084 Save the last human family on earth by destroying hordes of marauding mutant robots in Robotron:2084 JOUST Take to the air on your winged bird of prey and dismount your opponents in Joust.… Expand"}, {"name": "Real War", "details_link": "https://www.metacritic.com/game/pc/real-war", "publisher": "Simon & Schuster", "release_date": "Sep 24 2001", "developers": ["Rival Interactive"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 48, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/0b583b3dc4a33e31fd7330132ffb68c8-98.jpg", "descriptions": "Engage in 24 RTS missions, 12 as the U.S. Military and 12 as the terrorist Independent Liberation Army; control over 60 military units, all of which become tougher and faster with experience; and fight against up to 3 other commanders online."}, {"name": "Amazons & Aliens", "details_link": "https://www.metacritic.com/game/pc/amazons-aliens", "publisher": "Simon & Schuster", "release_date": "Sep 30 2000", "developers": ["JoWooD Entertainment AG"], "platforms": "PC", "num_players": "1-3 ", "genres": ["Strategy", "General", "General"], "meta_score": 48, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/81c4789db05644f086c3229125bbaffd-98.jpg", "descriptions": "Amazons & Aliens has no lasting appeal if you're experienced with other empire-building real-time strategy games."}, {"name": "World Series Baseball 2K1", "details_link": "https://www.metacritic.com/game/dreamcast/world-series-baseball-2k1", "publisher": "Sega", "release_date": "Jul 17 2000", "developers": ["Wow Entertainment"], "platforms": "Dreamcast", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 48, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/9c8727c22370e60b7bcb3510556dfbc8-98.jpg", "descriptions": "One can't use high expectations to explain away all of WSB 2K1's flaws."}, {"name": "Deadliest Catch: Sea of Chaos", "details_link": "https://www.metacritic.com/game/playstation-3/deadliest-catch-sea-of-chaos", "publisher": "Crave", "release_date": "Nov 29 2010", "developers": ["Crave"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Sports", "Driving", "General", "Individual", "Nature", "Fishing", "Fishing"], "meta_score": 48, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/26bcd163ff00f4d7fcb9df872abddaca-98.jpg", "descriptions": "Deadliest Catch: Sea of Chaos puts you in the role of captain as you you try to make profits from your catches."}, {"name": "Sprung", "details_link": "https://www.metacritic.com/game/ds/sprung", "publisher": "Ubisoft", "release_date": "Dec  8 2004", "developers": ["Ubisoft"], "platforms": "DS", "num_players": "1 Player", "genres": ["Simulation", "Adventure", "First-Person", "Virtual", "Modern", "Modern", "Virtual Life"], "meta_score": 48, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/0ff1ee8c863464caca4e69284ede8ec2-98.jpg", "descriptions": "Sprung creates an entirely new genre for portable gaming by putting players in the middle of an engaging, risqué and daring adventure with sexy singles at a hip ski resort. The dating simulation, or \"stimulation,\" title features gender-specific adventures, entertaining dating missions and aSprung creates an entirely new genre for portable gaming by putting players in the middle of an engaging, risqué and daring adventure with sexy singles at a hip ski resort. The dating simulation, or \"stimulation,\" title features gender-specific adventures, entertaining dating missions and a hilarious script written by \"North Shore\" (FOX) writer Colleen McGuiness. [Ubisoft]… Expand"}, {"name": "Mass Effect: Pinnacle Station", "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-pinnacle-station", "publisher": "Electronic Arts", "release_date": "Aug 20 2009", "developers": ["Demiurge Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Console-style RPG", "Japanese-Style", "Western-Style"], "meta_score": 48, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/3/5fd8f42a1cc7749a7feab448333f2faa-98.jpg", "descriptions": "(Downloadable Content)  Test the limits of your combat prowess aboard a remote, top-secret Alliance space station. Do you have what it takes to hold the top spot amongst the best of the best? This module includes a new land-able space station, 13 exciting combat scenarios, and approximately(Downloadable Content)  Test the limits of your combat prowess aboard a remote, top-secret Alliance space station. Do you have what it takes to hold the top spot amongst the best of the best? This module includes a new land-able space station, 13 exciting combat scenarios, and approximately 2-3 hours of game play. Required: you must achieve Spectre status before embarking on this mission. [Microsoft]… Expand"}, {"name": "Driver: Renegade", "details_link": "https://www.metacritic.com/game/3ds/driver-renegade", "publisher": "Ubisoft", "release_date": "Sep  6 2011", "developers": ["Ubisoft"], "platforms": "3DS", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 48, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/87e4c7ff94e4e95e6b38770323b66248-98.jpg", "descriptions": "The first and exclusive action driving game on Nintendo 3DS that lets you experience the intensity of urban car chases. As former cop John Tanner, you work outside the law to fight crime in the gritty streets of New York and defeat the 5 crime lords who own the city."}, {"name": "Beat Down: Fists of Vengeance", "details_link": "https://www.metacritic.com/game/playstation-2/beat-down-fists-of-vengeance", "publisher": "Capcom", "release_date": "Aug 23 2005", "developers": ["Cavia Inc."], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 48, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/c4249eaa029851e4799f27e69a2e28db-98.jpg", "descriptions": "In an area brimming with cartels battling for power and influence, no one comes close to Zanetti’s group, the strongest force in Las Sombras. When Zanetti learns of a rival clan's drug deal, he dispatches five of his top mercenaries from his inner circle to intervene. When they arrive on theIn an area brimming with cartels battling for power and influence, no one comes close to Zanetti’s group, the strongest force in Las Sombras. When Zanetti learns of a rival clan's drug deal, he dispatches five of his top mercenaries from his inner circle to intervene. When they arrive on the scene, they find their targets have already been executed and to their surprise, they are ambushed by members of their own cartel. They were set up to appearas traitors who were out to nab the drugs and money for themselves. They had been double crossed, but by who? Was this some scheme by the cartel to exploit them as scapegoats? Did one of the five betray the others? Outnumbered and pursued by both their previous cartel and law enforcement officials, the five are forced to split up and disappear into the shadows of Las Sombras. Beat Down: Fists of Vengeance puts gamers in the role of one of the five fugitives as they seek revenge against their foes. Betrayal comes at a high price and to survive in Las Sombras, you need power. With enemies everywhere, the only hope is to find the other four and build enough power to strike back. Using a low-key downtown bar as a hideout base, players will wanderthe town in search of information and add allies to their growing opposition. Taking different jobs around town will add much needed funds to fuel the growth of the posse. By proving themselves in street battles, effectively utilizing negotiation skills and using clever disguises, they will be able to build their influence on the mean streets. Soon no one will stand in the way of cold hard vengeance! [Capcom]… Expand"}]