[{"name": "Death Jr.: Root of Evil", "details_link": "https://www.metacritic.com/game/wii/death-jr-root-of-evil", "publisher": "Eidos Interactive", "release_date": "May 27 2008", "developers": ["Backbone Entertainment"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/5312ab07c40a52b5cf7c15f220304420-98.jpg", "descriptions": "Experience life after death as the Grim Reaper’s teenage son Death Jr. (aka DJ), and his school sweetheart Pandora, as they embark on a journey to free DJ’s captured father and complete their school science project at the same time! Rebuilt exclusive for the Wii, Death Jr.: Root of Evil usesExperience life after death as the Grim Reaper’s teenage son Death Jr. (aka DJ), and his school sweetheart Pandora, as they embark on a journey to free DJ’s captured father and complete their school science project at the same time! Rebuilt exclusive for the Wii, Death Jr.: Root of Evil uses new simple gameplay control methods based on ranged and melee combat, and a full 3D camera that makes for a fast and fun experience. [Eidos Interactive]… Expand"}, {"name": "From Russia With Love", "details_link": "https://www.metacritic.com/game/xbox/from-russia-with-love", "publisher": "Electronic Arts", "release_date": "Nov  1 2005", "developers": ["Electronic Arts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action Adventure", "Modern"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/05addd50ca32c8f5efd095920b7b4dde-98.jpg", "descriptions": "Inspired by the 1963 movie of the same name, From Russia with Love lets you play as the classic James Bond as portrayed by Sean Connery. You can drive in classic cars and use upgradeable weapons and gadgetry to complete the game's nonlinear missions. From Russia with Love also lets youInspired by the 1963 movie of the same name, From Russia with Love lets you play as the classic James Bond as portrayed by Sean Connery. You can drive in classic cars and use upgradeable weapons and gadgetry to complete the game's nonlinear missions. From Russia with Love also lets you invest in and upgrade your character to customize his performance.… Expand"}, {"name": "Fashion Police Squad", "details_link": "https://www.metacritic.com/game/pc/fashion-police-squad", "publisher": "No More Robots", "release_date": "Aug 15 2022", "developers": ["Mopeful Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/a1886b03fb48aca67a97fba36593dbf2-98.jpg", "descriptions": "Calling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!Fashion Police Squad is a humorous Retro FPS where you fight againstCalling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!Fashion Police Squad is a humorous Retro FPS where you fight against fashion crime using attire enhancing weaponry. Clean the streets of socks in sandals as Sergeant Des, and experience a single-player story full of fabulous characters, dazzling encounters, and fierce runway shows!… Expand"}, {"name": "Deliver Us The Moon", "details_link": "https://www.metacritic.com/game/playstation-5/deliver-us-the-moon", "publisher": "Wired Productions", "release_date": "Jun 23 2022", "developers": ["KeokeN Interactive"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/d25ce7fb5c0d8aca03554cd7c666914b-98.jpg", "descriptions": "Deliver Us The Moon is a Sci-Fi thriller set in an apocalyptic near future, where Earth's natural resources are depleted. \r\rA lunar colony providing a vital supply of energy has gone silent. A lone astronaut is sent to the moon on a critical mission to save humanity from extinction.Deliver Us The Moon is a Sci-Fi thriller set in an apocalyptic near future, where Earth's natural resources are depleted. \r\rA lunar colony providing a vital supply of energy has gone silent. A lone astronaut is sent to the moon on a critical mission to save humanity from extinction. \r\rWill you save mankind or be forgotten in the dark abyss of Space?… Expand"}, {"name": "Metal Max Xeno Reborn", "details_link": "https://www.metacritic.com/game/switch/metal-max-xeno-reborn", "publisher": "PQube", "release_date": "Jun 10 2022", "developers": ["Kadokawa"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/a1ae9c03127b3c63a51368618a46b8a1-98.jpg", "descriptions": "Humanity is on the brink of extinction and the last remaining survivors look to push back against the machines.Half a century ago of war against the mother computer NOA has reduced even Asia's largest metropolis, TOKIO, to rubble.\n\nExplore this desolate wasteland and battle your wayHumanity is on the brink of extinction and the last remaining survivors look to push back against the machines.Half a century ago of war against the mother computer NOA has reduced even Asia's largest metropolis, TOKIO, to rubble.Explore this desolate wasteland and battle your way through onslaughts of enemies. Salvage, modify and hit back using tanks, weaponry and faithful battle dog, Pochi, to reclaim a future for the human race!Set in a devastated world called Dystokio, Metal Max Xeno: Reborn is a nonlinear, open world, JRPG with real-time battle and vehicle combat elements. Take control of Talis and search for other survivors who wish to fight back against the machines of NOA. There are no limits to where you can go, no matter your progression in the game.… Expand"}, {"name": "The Inner Friend", "details_link": "https://www.metacritic.com/game/xbox-one/the-inner-friend", "publisher": "Playmind", "release_date": "Apr 28 2020", "developers": ["Playmind"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/a004e38520673b0aba2c7817317e93ad-98.jpg", "descriptions": "Descend into an eerie world made of scattered memories and unresolved traumas and explore a nightmarish landscape where you will come face to face with childhood fears and nightmares."}, {"name": "Space Hulk: Tactics", "details_link": "https://www.metacritic.com/game/xbox-one/space-hulk-tactics", "publisher": "Focus Home Interactive", "release_date": "Oct  9 2018", "developers": ["Cyanide", "Cyanide Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/774f7f0d01bcaf2e2dd1b773ac532f37-98.jpg", "descriptions": "Space Hulk: Tactics is a faithful adaptation of the board game Space Hulk, bringing a unique twist to the cult classic formula. Battle as either a squad of Terminator Space Marines or the deadly alien Genestealers."}, {"name": "The Walking Dead: The Telltale Series - The Final Season Episode 2: Suffer the Children", "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-the-telltale-series---the-final-season-episode-2-suffer-the-children", "publisher": "Telltale Games", "release_date": "Sep 25 2018", "developers": ["Telltale Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/e52d3a2c7d491dcd2d1807a014d096e8-98.jpg", "descriptions": null}, {"name": "FOX n FORESTS", "details_link": "https://www.metacritic.com/game/xbox-one/fox-n-forests", "publisher": "EuroVideo Medien", "release_date": "May 30 2018", "developers": ["Bonus Level Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/681ebaa4b0a234ae45cdf0c65c8ffe36-98.jpg", "descriptions": "Fox n Forests is a 2D action platformer with RPG and puzzle elements inspired by the glorious days of 16-bit! Switch between various seasons on the fly, shoot and slash with your magic melee crossbow and snatch loot to unveil the mystery of the 5th seasons."}, {"name": "Membrane", "details_link": "https://www.metacritic.com/game/switch/membrane", "publisher": "Perfect Hat", "release_date": "Feb 22 2018", "developers": ["Perfect Hat"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/acfc657f210ceadb4787a42ecdb4b04c-98.jpg", "descriptions": "Membrane is a creative-action puzzle game in which you build, bend and break the world around you while experimenting to create your own solutions. Bendy bridges, wobbly ladders and shaky structures are just the beginning of what you'll make to test the limits of this weird, day-glo world.Membrane is a creative-action puzzle game in which you build, bend and break the world around you while experimenting to create your own solutions. Bendy bridges, wobbly ladders and shaky structures are just the beginning of what you'll make to test the limits of this weird, day-glo world. Membrane was designed to allow creative space for the player to interact and build their own unique solutions. The puzzles are NOT designed to rely on deception or a single solution, lock & key approach to test players. Instead the game was built to reward creativity and experimentation from the player. Get your thinking cap on friends!… Expand"}, {"name": "Pro Cycling Manager 2017", "details_link": "https://www.metacritic.com/game/pc/pro-cycling-manager-2017", "publisher": "Focus Home Interactive", "release_date": "Jun 15 2017", "developers": ["Cyanide"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Sports", "Individual", "Biking"], "meta_score": 71, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/85fe54276957324e46475cec34886f8f-98.jpg", "descriptions": "Become the manager of a professional cycling team and compete against today's best riders in over 200 races (500+ stages) across the world, including iconic races such as La Vuelta and the iconic Tour de France."}, {"name": "Transport Fever", "details_link": "https://www.metacritic.com/game/pc/transport-fever", "publisher": "Gambitious", "release_date": "Nov  8 2016", "developers": ["Urban Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/93f64c3d40cb0118ec0e06a767362b3d-98.jpg", "descriptions": "Transport Fever is a railroad-focused tycoon game. Players start in 1850 and build up a thriving transport company. As an emerging transport tycoon, the player constructs stations, airports, harbors and makes money by connecting areas requiring transport services.\r Construct complexTransport Fever is a railroad-focused tycoon game. Players start in 1850 and build up a thriving transport company. As an emerging transport tycoon, the player constructs stations, airports, harbors and makes money by connecting areas requiring transport services.\r Construct complex road-rail-water-air networks in the endless game and experience more than 150 year of transportation history. Fulfill the peoples needs and watch cities evolve dynamically. Supply industries with freight, develop complete cargo chains and enable economic growth. Build up a transport empire!\r Master challenges and get entertained in the campaign game mode. Two campaigns each consisting of ten missions with increasing difficulty can be tackled. Missions of the American and the European campaign tell the historical context of the 19th and 20th century and offer a wide range of real-world transportation challenges.… Expand"}, {"name": "Rogue Trooper", "details_link": "https://www.metacritic.com/game/xbox/rogue-trooper", "publisher": "Eidos Interactive", "release_date": "May 23 2006", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 71, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/fc809d57be45bbd39d815c0331ea5d59-98.jpg", "descriptions": "On the war-torn, poisoned atmosphere of Nu Earth, Rogue Trooper is a genetic infantryman, one of an elite squad of biologically-engineered clone troops, created to overcome the planet's hostile atmosphere, unhindered in their fight against the enemy, the Nort Republic. After witnessing theOn the war-torn, poisoned atmosphere of Nu Earth, Rogue Trooper is a genetic infantryman, one of an elite squad of biologically-engineered clone troops, created to overcome the planet's hostile atmosphere, unhindered in their fight against the enemy, the Nort Republic. After witnessing the betrayal and annihilation of his squad at the Quartz Zone Massacre, Rogue has gone AWOL, determined to hunt down the traitor who sent his brothers-in-arms to their deaths. Armed with the latest experimental weapons, Rogue's arsenal offers him a critical advantage over his opponents; encoded bio-chips containing the digitised personalities of his fallen comrades are stored in his gun, helmet and backpack, each offering their unique expertise and assistance, allowing Rogue to strategically outwit a sophisticated enemy. The game is a mix of intense 3rd person action and next generation stealth elements, with complex line-of-sight AI, multiple game paths, full tactical use of your bio-chip operated equipment and both single- and multiplayer online gameplay.… Expand"}, {"name": "Sonic Frontiers", "details_link": "https://www.metacritic.com/game/playstation-5/sonic-frontiers", "publisher": "Sega", "release_date": "Nov  8 2022", "developers": ["Sega", "Sonic Team"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World", "Action", "Platformer", "3D"], "meta_score": 71, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/5941a1cdb72ee3a6a080b81b4fba1c38-98.jpg", "descriptions": "Worlds collide in Sonic the Hedgehog's newest adventure. Accelerate to new heights and experience the thrill of high velocity open-zone freedom. Battle powerful enemies as you speed through the Starfall Islands - landscapes brimming with dense forests, overflowing waterfalls, sizzlingWorlds collide in Sonic the Hedgehog's newest adventure. Accelerate to new heights and experience the thrill of high velocity open-zone freedom. Battle powerful enemies as you speed through the Starfall Islands - landscapes brimming with dense forests, overflowing waterfalls, sizzling deserts and more.… Expand"}, {"name": "Edge of Nowhere", "details_link": "https://www.metacritic.com/game/pc/edge-of-nowhere", "publisher": "Oculus Studios", "release_date": "Jun  6 2016", "developers": ["Insomniac Games"], "platforms": "PC", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/35a4573ecb945926156c3ca2949046cc-98.jpg", "descriptions": "Edge of Nowhereis a VR third-person action-adventure from acclaimed independent developer Insomniac Games.Follow the trail ofa missing expedition that leads across the treacherous mountainsof Antarctica. Scale massive ice walls and travel deep into alien caves in thisunsettling psychologicalEdge of Nowhereis a VR third-person action-adventure from acclaimed independent developer Insomniac Games.Follow the trail ofa missing expedition that leads across the treacherous mountainsof Antarctica. Scale massive ice walls and travel deep into alien caves in thisunsettling psychological thriller. In Edge of Nowhere, nothing is what it seems and the unexpected lurks from all sides… Expand"}, {"name": "Pictionary", "details_link": "https://www.metacritic.com/game/wii/pictionary", "publisher": "THQ", "release_date": "Nov 14 2010", "developers": ["Page 44 Studios"], "platforms": "Wii", "genres": ["Miscellaneous", "Party", "Board Games", "Board / Card Game"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/dd31d7cee98eb6ac7a1e0322c7f5aab2-98.jpg", "descriptions": "Pictionary, the game of quick sketches and crazy guesses, has innovative new functionality and game modes for the whole family! In addition to great classic Pictionary play, new features include rotating canvases, one-line challenges and other fun gameplay modes in a lively game show setting."}, {"name": "Gotham City Impostors", "details_link": "https://www.metacritic.com/game/xbox-360/gotham-city-impostors", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb  8 2012", "developers": ["Monolith Productions"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Adventure", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Fantasy", "Arcade"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/f2ac4ec42a6ba919f36c48c70de5eb31-98.jpg", "descriptions": "Gotham City Impostors is a multiplayer game unlike any other, giving players the opportunity to rebel against conformity as they customize their own characters.  Posing as amateur vigilantes or villains, gamers will create their very own Bats and Jokerz characters using unprecedentedGotham City Impostors is a multiplayer game unlike any other, giving players the opportunity to rebel against conformity as they customize their own characters.  Posing as amateur vigilantes or villains, gamers will create their very own Bats and Jokerz characters using unprecedented customization options including insane costumes, homebrewed gadgets and a wide range of traditional and imagined weapons.… Expand"}, {"name": "Minecraft: Story Mode - Episode 1: The Order of the Stone", "details_link": "https://www.metacritic.com/game/pc/minecraft-story-mode---episode-1-the-order-of-the-stone", "publisher": "Telltale Games", "release_date": "Oct 13 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "Adventure", "General", "Point-and-Click", "Linear"], "meta_score": 71, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/0/853114e93052870d93073030f5a8a915-98.jpg", "descriptions": "Minecraft: Story Mode is an adventure game set in a Minecraft world. It is a 5-part episodic series that will take you to the Nether, the Farlands, the End, and beyond. You will determine how the story flows through the decisions you make: what you say to people (and how you say it), andMinecraft: Story Mode is an adventure game set in a Minecraft world. It is a 5-part episodic series that will take you to the Nether, the Farlands, the End, and beyond. You will determine how the story flows through the decisions you make: what you say to people (and how you say it), and what you choose to do in moments of action.… Expand"}, {"name": "The Simpsons Game", "details_link": "https://www.metacritic.com/game/xbox-360/the-simpsons-game", "publisher": "EA Games", "release_date": "Oct 30 2007", "developers": ["Electronic Arts", "EA Redwood Shores"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/649e6856d996d832088c2163d488c4eb-98.jpg", "descriptions": "The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart,The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart, and Lisa use exciting, all-new powers to save the world from rising chaos. To help the Simpsons, gamers at home must journey through all of Springfield (as well as vast worlds beyond!), vanquish an amazing array of villains, and fight their way through parodies of popular games. [Electronic Arts]… Expand"}, {"name": "Pilotwings Resort", "details_link": "https://www.metacritic.com/game/3ds/pilotwings-resort", "publisher": "Nintendo", "release_date": "Mar 27 2011", "developers": ["Monster Games Inc."], "platforms": "3DS", "genres": ["Simulation", "Flight", "Civilian Plane", "Civilian Plane", "Civilian"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/e5bb19286dccbf78d644bca881380476-98.jpg", "descriptions": "Pilotwings Resort is a flying simulation that lets players soar above Wuhu Island."}, {"name": "Fruit Ninja Kinect", "details_link": "https://www.metacritic.com/game/xbox-360/fruit-ninja-kinect", "publisher": "Microsoft Game Studios", "release_date": "Aug 10 2011", "developers": ["Halfbrick Studios"], "platforms": "Xbox 360", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/f8e285d3bb78404d4e2ed25eed267326-98.jpg", "descriptions": "YOU are the ninja! The worldwide gaming phenomenon Fruit Ninja has now arrived for Kinect! Your arms are now blades, and the epic battle against the world’s most delicious produce is just beginning. Fruit Ninja Kinect is an amazing\revolution of the slice-em-up genre created by Halfbrick,YOU are the ninja! The worldwide gaming phenomenon Fruit Ninja has now arrived for Kinect! Your arms are now blades, and the epic battle against the world’s most delicious produce is just beginning. Fruit Ninja Kinect is an amazing\revolution of the slice-em-up genre created by Halfbrick, utlising next-gen power for the juiciest combat ever! With Classic, Zen and the frenetic Arcade Mode, Fruit Ninja Kinect includes all the action you know and love with precision\rcontrol - along with special features exclusive to Kinect! With Party Mode, multiple players can turn a normal night into a fierce tournament - and the new Challenge system will reveal the true masters among your friends!… Expand"}, {"name": "Resident Evil Village: Winters' Expansion", "details_link": "https://www.metacritic.com/game/pc/resident-evil-village-winters-expansion", "publisher": "Capcom", "release_date": "Oct 28 2022", "developers": ["Capcom"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 71, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/4/392b07367d995364fb66183708beecca-98.jpg", "descriptions": "New Content in the Winters' Expansion:- Third Person Mode - Allows you to enjoy the main game from a third-person perspective.\n- The Mercenaries Additional Orders - Adds new playable characters and stages.\n- Shadows of Rose - Introduces a new story with Ethan's daughter Rose as theNew Content in the Winters' Expansion:- Third Person Mode - Allows you to enjoy the main game from a third-person perspective.- The Mercenaries Additional Orders - Adds new playable characters and stages.- Shadows of Rose - Introduces a new story with Ethan's daughter Rose as the protagonist.16 years have passed since that incident... Ethan's beloved daughter, Rosemary Winters, is living a healthy life. But struggling to come to terms with her innate special powers, she decides to dive into the world of the Megamycete's consciousness, or the \"realm of consciousness,\" to seal them.What she discovers is an extraordinary world far from the reality of the past. A collection of memories of \"that village\" absorbed by the Megamycete.… Expand"}, {"name": "Sniper Ghost Warrior Contracts", "details_link": "https://www.metacritic.com/game/pc/sniper-ghost-warrior-contracts", "publisher": "CI Games", "release_date": "Nov 22 2019", "developers": ["CI Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/0b10d041fad9c08190b56e545f68ae16-98.jpg", "descriptions": "Fulfill contracts that offer clear objectives with a fixed monetary reward and options to complete bonus challenges for payouts. With hundreds of ways to take down a wide range of targets, Contracts offers precise, strategic sniping gameplay at its absolute best. Play as a paid assassin; aFulfill contracts that offer clear objectives with a fixed monetary reward and options to complete bonus challenges for payouts. With hundreds of ways to take down a wide range of targets, Contracts offers precise, strategic sniping gameplay at its absolute best. Play as a paid assassin; a hit man for hire, and beware of rival snipers who won’t hesitate to disrupt your best-laid plans. Open-ended contracts, bounties and challenges deliver strong replayability options to eliminate targets and collect cash to redeem for upgrades. An all-new Dynamic Reticle System offers the most realistic and intense sniping experience. Upgradeable AR Mask with the ability to scan the environment and highlight weakness or objects of interest. An arsenal of new gadgets to play with including drones, remote sniper turrets and gas grenades. Show off your stealth skills, execute silent takedowns and be rewarded for a strategic play style. Battle the brutal wilderness of Siberia and fight to survive the intensity of snow-covered mountains, lush forests and secret bases hidden deep in the mountainside.… Expand"}, {"name": "A Robot Named Fight!", "details_link": "https://www.metacritic.com/game/switch/a-robot-named-fight!", "publisher": "Hitcents", "release_date": "Apr 26 2018", "developers": ["Matt Bitner"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/b47b23c672fed5aaf299de1509dee77c-98.jpg", "descriptions": "- Gameplay -A Robot Named Fight is a Metroidvania roguelike focused on exploration and item collection. Take on the role of a lone robot tasked with stopping a the entity known as Megabeast. Explore procedurally-generated labyrinths, uncover randomized power-ups and artifacts, find secrets,- Gameplay -A Robot Named Fight is a Metroidvania roguelike focused on exploration and item collection. Take on the role of a lone robot tasked with stopping a the entity known as Megabeast. Explore procedurally-generated labyrinths, uncover randomized power-ups and artifacts, find secrets, and blast meaty creatures in this deliciously gory Metroidvania.- Story -Millennia of peace have passed since the mechanical gods ascended and left the lower order robots to cultivate the world. Unfortunately for those left behind, something forgotten and terrible stirs amidst the stars: the Megabeast, a pulsating moon-sized orb of flesh, eyes, mouths and reproductive organs unleashing its children onto the world like an unstoppable plague.- Key Features -- Explore a procedurally-generated labyrinth with more than 4 billion unique runs.- Prove your worth with true permadeath.- Take on over 60 menacing enemies solo or with a friend via local co-op.- Adapt to a different item set every run with more than 80 unique items- Complete achievements to unlock new content.- Play using your favorite controller.- Enjoy an unreasonable amount of meat!… Expand"}, {"name": "Knight Squad", "details_link": "https://www.metacritic.com/game/xbox-one/knight-squad", "publisher": "Chainsawesome Games", "release_date": "Nov 16 2015", "developers": ["Chainsawesome Games"], "platforms": ["PC", "Switch", "Xbox One"], "genres": ["Action", "General"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/bd34143a61ce67d6bbf5b02e40bee50c-98.jpg", "descriptions": "Knight Squad is an 8 players top-down Bomberman meets Gauntlet game.Engage into crazy sword fights with your friends where one hit is enough to take anyone down."}, {"name": "flOw", "details_link": "https://www.metacritic.com/game/playstation-4/flow", "publisher": "SCEA", "release_date": "Dec 17 2013", "developers": ["SuperVillain Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "1-2 ", "genres": ["Miscellaneous", "General", "General"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/097517799a73b10e5c6e5b137a0fad6a-98.jpg", "descriptions": "flOw is a game about piloting an aquatic organism through a surreal biosphere where players consume other organisms, evolve, and dive into the abyss. With an embedded design of DDA (dynamic difficulty adjustment), players with differing skill levels can intuitively customize their gameflOw is a game about piloting an aquatic organism through a surreal biosphere where players consume other organisms, evolve, and dive into the abyss. With an embedded design of DDA (dynamic difficulty adjustment), players with differing skill levels can intuitively customize their game experience and enjoy the game at their own pace.\r… Expand"}, {"name": "Save the Turtles", "details_link": "https://www.metacritic.com/game/ds/save-the-turtles", "publisher": "Sabarasa Entertainment", "release_date": "Mar 29 2010", "developers": ["Sabarasa Entertainment"], "platforms": ["iPhone/iPad", "DS"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/b4c3c5ab3fb39711e4f2dcc51a29da15-98.jpg", "descriptions": "[DSiWare]  Save the Turtles takes players to more than 32 of the world's most exotic beaches in a quest to help tiny turtles find their new home. Players must use the stylus to rub and tap the touch screen of the Nintendo DSi system, digging eggs from the sand and lining up cute reptiles[DSiWare]  Save the Turtles takes players to more than 32 of the world's most exotic beaches in a quest to help tiny turtles find their new home. Players must use the stylus to rub and tap the touch screen of the Nintendo DSi system, digging eggs from the sand and lining up cute reptiles while avoiding crabs, seagulls and litter on their way to the safety of the sea. The game features four modes, including a never-ending survival mode called Turtles Forever, plus several unlockable trophies. Give Mother Nature a hand and help save the turtles.… Expand"}, {"name": "Post Mortem", "details_link": "https://www.metacritic.com/game/pc/post-mortem", "publisher": "The Adventure Company", "release_date": "Feb 27 2003", "developers": ["Microids"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "First-Person", "Point-and-Click", "Modern", "Modern"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/d6b7c5bed886a56261ed05bbc2503bf7-98.jpg", "descriptions": "After retiring to the quiet streets of Paris to pursue a life of painting, Gus Macpherson could not escape his true art... The former New York detective finds himself walking the beat once again, when hired by a sensuous woman to investigate the gruesome beheadings of her sister andAfter retiring to the quiet streets of Paris to pursue a life of painting, Gus Macpherson could not escape his true art... The former New York detective finds himself walking the beat once again, when hired by a sensuous woman to investigate the gruesome beheadings of her sister and brother-in-law. In the dark and mysterious streets of Paris, and plagued by his clairvoyant sixth sense: Gus will uncover a conspiracy written in blood, with rituals and artifacts as old as time itself! [DreamCatcher]… Expand"}, {"name": "Harry Potter and the Chamber of Secrets", "details_link": "https://www.metacritic.com/game/playstation-2/harry-potter-and-the-chamber-of-secrets", "publisher": "EA Games", "release_date": "Nov 14 2002", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/385e9a7e6c88dcff8d6d43c92bda7910-98.jpg", "descriptions": "Players enter fantastical free-roaming 3D environments from Harry's world. Players become Harry Potter and delve not only into Harry's world, but also into his personality, via an internal \"voice.\" Conversing with unique characters like Moaning Myrtle, shopping in Diagon Alley, and exploringPlayers enter fantastical free-roaming 3D environments from Harry's world. Players become Harry Potter and delve not only into Harry's world, but also into his personality, via an internal \"voice.\" Conversing with unique characters like Moaning Myrtle, shopping in Diagon Alley, and exploring the convoluted corridors of Hogwarts, players make crucial and independent decisions within Harry's world. Additionally, Harry can, of course, cast spells against foes - but these spells must be perfectly executed, or they could be miscast with humorous or critical consequences! Mini-games within levels can be revisited, so players can help Mrs. Weasley with \"de-gnoming\" her garden, challenge other students in Professor Lockhart?s Dueling Club, or complete other mini-games again and again. [EA Games]… Expand"}, {"name": "Blinx: The Time Sweeper", "details_link": "https://www.metacritic.com/game/xbox/blinx-the-time-sweeper", "publisher": "Microsoft Game Studios", "release_date": "Oct  7 2002", "developers": ["Artoon"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/96b961faa3b1bb7ddbe7a407d302a168-98.jpg", "descriptions": "Blinx is a cat on a mission to fix glitches in time. With the aid of his trusty and powerful Time Sweeper, Blinx must recover lost time crystals, fight Time Monsters, and ultimately rescue a kidnapped princess. Visit nearly 40 levels in warped-reality worlds inspired by Venice, canyons,Blinx is a cat on a mission to fix glitches in time. With the aid of his trusty and powerful Time Sweeper, Blinx must recover lost time crystals, fight Time Monsters, and ultimately rescue a kidnapped princess. Visit nearly 40 levels in warped-reality worlds inspired by Venice, canyons, caves, ancient ruins, and even the works of artist MC Escher. You can also buy gear and power-ups, which enhance gameplay performance, or you can purchase enhanced versions of the Time Sweeper.… Expand"}, {"name": "Test Drive", "details_link": "https://www.metacritic.com/game/xbox/test-drive", "publisher": "Atari", "release_date": "May 27 2002", "developers": ["Pitbull Syndicate"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 71, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/7f6b7938257f452a79331c42f8264a39-98.jpg", "descriptions": "Raw power versus legendary performance in high-impact street racing mayhem.  Test Drive is reborn with more racing action and thrills than anything before.  Get behind the wheels of over 20 of the hottest exotic sports cars and all-American muscle cars.  Rocket through crowded cities,Raw power versus legendary performance in high-impact street racing mayhem.  Test Drive is reborn with more racing action and thrills than anything before.  Get behind the wheels of over 20 of the hottest exotic sports cars and all-American muscle cars.  Rocket through crowded cities, opponents and the law on your tail, in a fast paced test of man and machine.  Race against the AI or your friend in two-player mode.  You can take the wheel but can you take the challenge? … Expand"}, {"name": "Spy Hunter", "details_link": "https://www.metacritic.com/game/xbox/spy-hunter", "publisher": "Midway", "release_date": "Mar 10 2002", "developers": ["Point of View"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/ef05df7b7403c30bf8f7563d043e0153-98.jpg", "descriptions": "The evil NOSTRA Corporation prepares to unleash havoc on the world, and only the SpyHunter is equipped to stop them. Get behind the wheel of the powerful G-6155 Interceptor, a vehicle that can transform into a boat, Jet Ski, or motorcycle. With an arsenal of both offensive and defensiveThe evil NOSTRA Corporation prepares to unleash havoc on the world, and only the SpyHunter is equipped to stop them. Get behind the wheel of the powerful G-6155 Interceptor, a vehicle that can transform into a boat, Jet Ski, or motorcycle. With an arsenal of both offensive and defensive weapons, you must elude NOSTRA spies, henchmen, and assassins at any cost. Hordes of air, ground, and water enemies pursue you as you try to save the world from the mind of a madman.… Expand"}, {"name": "Fate of the Dragon", "details_link": "https://www.metacritic.com/game/pc/fate-of-the-dragon", "publisher": "Eidos Interactive", "release_date": "Mar 14 2001", "developers": ["Object"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/4b9ea5fb79e32e00a2325f8ed555a84f-98.jpg", "descriptions": "Reminiscent of \"Age of Empires II\", this historical real-time strategy is based on the Three Kingdoms period of 2nd century China, just after the Han Dynasty fell into ruin, a turbulent time during which dozens of warlords sought the throne and eventually settled into three conflicting kingdoms."}, {"name": "Sea Dogs", "details_link": "https://www.metacritic.com/game/pc/sea-dogs", "publisher": "Bethesda Softworks", "release_date": "Nov 24 2000", "developers": ["Akella"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Ship", "Ship", "Marine", "Combat", "Civilian"], "meta_score": 71, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/db7c4a163b49ca5be712eada122303b0-98.jpg", "descriptions": "Sea Dogs is reminiscent of Bethesda's classic RPG, \"Daggerfall,\" in which players were free to choose any course of action they wished in a limitless and unbounded game. You can give your allegiance to one of three countries or choose to serve only yourself as a swashbuckling pirate.Sea Dogs is reminiscent of Bethesda's classic RPG, \"Daggerfall,\" in which players were free to choose any course of action they wished in a limitless and unbounded game. You can give your allegiance to one of three countries or choose to serve only yourself as a swashbuckling pirate.  [Bethesda Softworks]… Expand"}, {"name": "Looney Tunes Racing", "details_link": "https://www.metacritic.com/game/playstation/looney-tunes-racing", "publisher": "Infogrames", "release_date": "Nov 13 2000", "developers": ["Circus Freak"], "platforms": "PlayStation", "genres": ["Driving", "Racing", "Kart"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/4c8dfe9edcd49951540a4200f9d20df4-98.jpg", "descriptions": "Rev your engines - It's time to burn some Looney Tunes rubber! ACME Corporation, the corporate juggernaut behind such successful products as the Acme Disintegrator Gun and the Acme Portable Hole, is sponsoring a number of racing contests all over the universe for the Looney Tunes charactersRev your engines - It's time to burn some Looney Tunes rubber! ACME Corporation, the corporate juggernaut behind such successful products as the Acme Disintegrator Gun and the Acme Portable Hole, is sponsoring a number of racing contests all over the universe for the Looney Tunes characters to compete for the looniest racing champion title.… Expand"}, {"name": "NHL 23", "details_link": "https://www.metacritic.com/game/playstation-5/nhl-23", "publisher": "Electronic Arts", "release_date": "Oct 11 2022", "developers": ["Electronic Arts", "EA Vancouver"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 12 ", "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 71, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/6/40b1c1ff57c8429782d330dbfa2f6ea9-98.jpg", "descriptions": "EA SPORTS NHL 23 is greater together with the introduction of mixed women's and men's teams in HUT, and planned for November 2022, the arrival of cross-play for players on the same platform generation in WOC. So grab your friends and gear up for the most connected version of Chel yet."}, {"name": "The 3rd Birthday", "details_link": "https://www.metacritic.com/game/psp/the-3rd-birthday", "publisher": "Square Enix", "release_date": "Mar 29 2011", "developers": ["HexaDrive"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 71, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/20f73b3e8606a4e5bf5944e88b18caca-98.jpg", "descriptions": "(Also known as \"Parasite Eve: The 3rd Birthday\")  Hideous creatures descend on Manhattan. Ground reports from the squad tasked with containing the pandemonium refer to these life forms as the Twisted. An investigatory team known as the CTI is formed within the year. The Overdive system(Also known as \"Parasite Eve: The 3rd Birthday\")  Hideous creatures descend on Manhattan. Ground reports from the squad tasked with containing the pandemonium refer to these life forms as the Twisted. An investigatory team known as the CTI is formed within the year. The Overdive system emerges as a means of opposition, but only one viable candidate exists –Aya Brea. A gift as she awakens from a lost past on this, the occasion of her third birth.… Expand"}, {"name": "Resident Evil: Deadly Silence", "details_link": "https://www.metacritic.com/game/ds/resident-evil-deadly-silence", "publisher": "Capcom", "release_date": "Feb  7 2006", "developers": ["Capcom"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 71, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/d654f0d27404875dbff72ba56a4ae76a-98.jpg", "descriptions": "(Also known as \"BioHazard: Deadly Silence\" in Japan)  Experience the terror of Raccoon City as heroes Chris Redfield and Jill Valentine try to survive a mansion filled with flesh hungry zombies, giant spiders, horrific amphibious creatures, mutant dogs and worse.  Now the Survival Horror(Also known as \"BioHazard: Deadly Silence\" in Japan)  Experience the terror of Raccoon City as heroes Chris Redfield and Jill Valentine try to survive a mansion filled with flesh hungry zombies, giant spiders, horrific amphibious creatures, mutant dogs and worse.  Now the Survival Horror Classic Resident Evil debuts with features exclusive to the Nintendo DS. Classic Mode – The original, high tension Resident Evil that features 80% exploration/puzzle solving and 20% intense battle elements. Rebirth Mode – Features a high octane game style that is 80% intense battle and 20% exploration/puzzle solving. Microphone Function – Solve puzzles and even resuscitate your injured teammate by blowing into the microphone. Bonus Mini-Game – Ward off hordes of the undead in the Master of Knifing mini-game. [Capcom]… Expand"}, {"name": "No Man's Sky", "details_link": "https://www.metacritic.com/game/playstation-4/no-mans-sky", "publisher": "SCEA", "release_date": "Aug  9 2016", "developers": ["Hello Games"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Action Adventure", "Open-World"], "meta_score": 71, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/186b8e89a3d55ac9f1d50ed1835943a4-98.jpg", "descriptions": "No Man’s Sky is an exploration and survival game set in an infinite procedurally generated universe. Whether a distant mountain or a planet hanging low on the horizon, you can go forth there. You can fly seamlessly from the surface of a planet to another, and every star in the sky is a sunNo Man’s Sky is an exploration and survival game set in an infinite procedurally generated universe. Whether a distant mountain or a planet hanging low on the horizon, you can go forth there. You can fly seamlessly from the surface of a planet to another, and every star in the sky is a sun that you can visit. Where you’ll go and how fast you’ll make you way through this universe is your decision. Explore uncharted solar systems and catalog unique new forms of life. Every planet’s landscape is different from the next and populated by species never before encountered. Acquire ancient artifacts that may reveal the secrets behind the universe. Choose whether to share your discoveries with other players. You won’t see them, but they’re exploring the same universe in parallel; perhaps you’ll make your mark on their worlds as well as your own. Every solar system, planet, ocean and cave is filled with danger, and - make no mistake - you are vulnerable. Your ship and suit are fragile, and every encounter may test your skills to the limit. From dog-fighting in space to first-person combat on a planet’s surface, you will face foes ready to overwhelm you. One mistake could see you lose it all. In No Man’s Sky, every victory and every defeat is permanent. The voyage that stands before you cannot be taken lightly. You must prepare. Collect precious resources on the surfaces of planets and trade them for the ships, suits and equipment that will take you to your destiny in the stars.… Expand"}, {"name": "Megadimension Neptunia VIIR", "details_link": "https://www.metacritic.com/game/playstation-4/megadimension-neptunia-viir", "publisher": "Idea Factory", "release_date": "May  8 2018", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/cf9af487e42cc61675189e510d0dc3b2-98.jpg", "descriptions": "Megadimension Neptunia VIIR (pronounced \"V-two-R\") is an enhanced version of 2016's Megadimension Neptunia VII featuring smoother graphics courtesy of a new engine, a revamped battle system, and a whole new VR experience. Now, their dimensions and yours are connected. Hang out one-on-oneMegadimension Neptunia VIIR (pronounced \"V-two-R\") is an enhanced version of 2016's Megadimension Neptunia VII featuring smoother graphics courtesy of a new engine, a revamped battle system, and a whole new VR experience. Now, their dimensions and yours are connected. Hang out one-on-one with each of the Gamindustri Goddesses, listen to their conversations, and watch as the Goddesses react to you.… Expand"}, {"name": "Spy Chameleon", "details_link": "https://www.metacritic.com/game/xbox-one/spy-chameleon", "publisher": "Unfinished Pixel", "release_date": "May 22 2015", "developers": ["Unfinished Pixel"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One"], "genres": ["Puzzle", "Action", "General"], "meta_score": 71, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/1b3bcf618ba4f00ccbc947335eb8108d-98.jpg", "descriptions": "Don't let the comic look fool you. Being a good RGB agent requires a lot of talent.\r Spy Chameleon is an arcade-puzzle game where the player must avoid being seen thanks to the chameleon's ability to change colors and camouflage.\r\n\r\nThrough 5 missions and 75 levels, the player willDon't let the comic look fool you. Being a good RGB agent requires a lot of talent.\r Spy Chameleon is an arcade-puzzle game where the player must avoid being seen thanks to the chameleon's ability to change colors and camouflage.\r Through 5 missions and 75 levels, the player will discover different enemies and abilities to complete these super-secret missions: taking photos of a celebrity with her lover and stealing the secret formula of a successful soft drink are just two examples.\r Watch your enemies, choose the best path and run to the next safe point. The duration of each level can mean finishing a game in just minutes or spending hours trying to complete the missions and all the challenges, getting the best time among your friends or completing all the achievements.\r Game features:\r-change colors to camouflage yourself with your surroundings\r-playability that combines reflexes, synchronization and strategy (at 60 FPS in 1080p)\r-compare your best times with those of your friends or the whole world… Expand"}, {"name": "Ar tonelico: Melody of Elemia", "details_link": "https://www.metacritic.com/game/playstation-2/ar-tonelico-melody-of-elemia", "publisher": "NIS America", "release_date": "Feb  6 2007", "developers": ["Gust"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/cf4c98370d60da19965e6a9355b19ac7-98.jpg", "descriptions": "Journey throughout the world of Ar tonelico to find the key to destroying the viruses once and for all. Partner up with a Reyvateil, a girl who can create magic through songs, and fight your way back up the tower to save your home. Explore a Reyvateil's inner world with the revolutionary newJourney throughout the world of Ar tonelico to find the key to destroying the viruses once and for all. Partner up with a Reyvateil, a girl who can create magic through songs, and fight your way back up the tower to save your home. Explore a Reyvateil's inner world with the revolutionary new Dive System, which allows you to go on \"Virtual Dates\" to increase their magical power. [NIS America]… Expand"}, {"name": "Men of Valor", "details_link": "https://www.metacritic.com/game/pc/men-of-valor", "publisher": "VU Games", "release_date": "Oct 29 2004", "developers": ["2015"], "platforms": "PC", "num_players": "1-24 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 71, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/255bb00edf36e970c5cd771fb36e1d89-98.jpg", "descriptions": "From the creators of the award-winning \"Medal of Honor: Allied Assault\" comes Men of Valor: Vietnam, 2015?s historical first-person shooter that portrays infantry combat during the Vietnam War. Combining the latest Unreal technology with the gameplay expertise of 2015, Men of Valor immersesFrom the creators of the award-winning \"Medal of Honor: Allied Assault\" comes Men of Valor: Vietnam, 2015?s historical first-person shooter that portrays infantry combat during the Vietnam War. Combining the latest Unreal technology with the gameplay expertise of 2015, Men of Valor immerses you in the humid jungles of Southeast Asia in the most controversial conflict of the modern era. Experience the intensity of the historical battlefield recreated with cunning AI, detailed graphics, and interactive scripted sequences that put you in the middle of scenes like those in the finest war films. Battle your way through the major actions in the conflict, from search and destroy missions around Danang airbase to the Tet offensive and the counterattack on Hue. Or experience the entire thrilling tour of duty with friends via various multiplayer modes, which allow you to view the war from the perspective of the Viet Cong guerillas as well as U.S. forces. [Vivendi Universal]… Expand"}, {"name": "Tennis Manager 2022", "details_link": "https://www.metacritic.com/game/pc/tennis-manager-2022", "publisher": "Rebound Capital Games", "release_date": "May 17 2022", "developers": ["Rebound Capital Games"], "platforms": "PC", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/ae31afc2254cb8c7953abb5123be8920-98.jpg", "descriptions": "Become a tennis manager. Manage your tennis academy and train the next tennis super stars. Even more realistic, with new players and updated potentials. Take the reins in 2022."}, {"name": "Fracked", "details_link": "https://www.metacritic.com/game/playstation-4/fracked", "publisher": "nDreams", "release_date": "Aug 20 2021", "developers": ["nDreams"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/7a7c93bd0bdb07ecd429efd557717a90-98.jpg", "descriptions": "Fracked is a PlayStation VR shooter that seamlessly combines relentless 'run-and-cover' gunfights with free and fluid skiing and climbing.\r Stranded in a remote mountain facility, you play as a reluctant hero forced into a final stand between the planet and a legion of interdimensionalFracked is a PlayStation VR shooter that seamlessly combines relentless 'run-and-cover' gunfights with free and fluid skiing and climbing.\r Stranded in a remote mountain facility, you play as a reluctant hero forced into a final stand between the planet and a legion of interdimensional enemies. \r\rCreated by nDreams (Phantom: Covert Ops) for PS VR and PlayStation Move controllers, an innovative cover system will have you peeking out from behind environmental objects and outflanking enemies to gain the advantage.… Expand"}, {"name": "Chronos: Before the Ashes", "details_link": "https://www.metacritic.com/game/xbox-one/chronos-before-the-ashes", "publisher": "Gunfire Games", "release_date": "Dec  1 2020", "developers": ["Gunfire Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/d55cdddd88bc22e0743ddfd7f21fc907-98.jpg", "descriptions": "An Adventure RPG with a refreshing combination of adventure game elements and RPG mechanics. Deep combat - a variety of weapons, abilities and powers are available to the player in the pursuit of their quest. Unique aging mechanic - Every time the player dies they age One year. Players mustAn Adventure RPG with a refreshing combination of adventure game elements and RPG mechanics. Deep combat - a variety of weapons, abilities and powers are available to the player in the pursuit of their quest. Unique aging mechanic - Every time the player dies they age One year. Players must adapt to their advancing age as they progress their character; starting the game young, nimble and quick, and ending wise and more attuned to magic.… Expand"}, {"name": "Masters of Anima", "details_link": "https://www.metacritic.com/game/pc/masters-of-anima", "publisher": "Focus Home Interactive", "release_date": "Apr 10 2018", "developers": ["Passtech Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 71, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/b29c538890423cea9559e1bf34f68887-98.jpg", "descriptions": "Delve into an original adventure and defy the forces of evil in strategic, action-packed battles. Summon and control large armies of up to 100 Guardians thanks to intuitive and innovative gameplay and make quick tactical decisions to prevail."}, {"name": "Fearful Symmetry & The Cursed Prince", "details_link": "https://www.metacritic.com/game/xbox-one/fearful-symmetry-the-cursed-prince", "publisher": "Soedesco", "release_date": "Dec 12 2017", "developers": ["Gamera Interactive", "Gamera Game"], "platforms": ["PC", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/15ed72dde63f8f3589458936979c00b5-98.jpg", "descriptions": "Fearful Symmetry is a puzzle game with a unique brain-teasing twist. Control multiple characters at the same time; both in different dimensions. It is up to you to move the characters simultaneously in opposite directions to guide them through treacherous puzzles filled with traps."}, {"name": "Beat Cop", "details_link": "https://www.metacritic.com/game/pc/beat-cop", "publisher": "11 bit studios", "release_date": "Mar 30 2017", "developers": ["Pixel Crow"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/5ce984fd4039de07ac93c544ed4272ee-98.jpg", "descriptions": "A retro, pixel art style adventure in New York, inspired by 80’s cop shows. You are Jack Kelly and you’ve been framed for murder. Now as a regular beat cop you have to find out, who did that. Expect thick crime story, a lot of black humour and all the other things you can find on the streetsA retro, pixel art style adventure in New York, inspired by 80’s cop shows. You are Jack Kelly and you’ve been framed for murder. Now as a regular beat cop you have to find out, who did that. Expect thick crime story, a lot of black humour and all the other things you can find on the streets of Brooklyn.… Expand"}, {"name": "Amazing Discoveries In Outer Space", "details_link": "https://www.metacritic.com/game/playstation-4/amazing-discoveries-in-outer-space", "publisher": "Cosmic Picnic", "release_date": "Feb  2 2016", "developers": ["Cosmic Picnic"], "platforms": "PlayStation 4", "genres": ["Action", "General", "Action Adventure", "Open-World"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/0220b2065268b7002e74830c3d796921-98.jpg", "descriptions": "An odyssey through the galaxy where physics-based space-flight and platforming action blend seamlessly together. Explore a colorful universe filled with amazing discoveries, alien races, and fashionable hats. Unfortunately, your only company is ZING, a navigation computer with no memory ofAn odyssey through the galaxy where physics-based space-flight and platforming action blend seamlessly together. Explore a colorful universe filled with amazing discoveries, alien races, and fashionable hats. Unfortunately, your only company is ZING, a navigation computer with no memory of your whereabouts and a slightly faulty social circuit.… Expand"}, {"name": "RollerCoaster Tycoon 3: Wild!", "details_link": "https://www.metacritic.com/game/pc/rollercoaster-tycoon-3-wild!", "publisher": "Atari", "release_date": "Oct 27 2005", "developers": ["Frontier Developments"], "platforms": "PC", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 71, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/5/550bf7dbcf73f89c0ab8a41195ee2ffe-98.jpg", "descriptions": "Two more richly detailed themes for players' RCT3 amusement parks - Jungle and Prehistoric - including giant insects and animatronic dinosaurs. Even more thrill rides; eight more coasters, eighteen 'flat' rides, brand new animal houses and four additional transport rides. Choreograph fun andTwo more richly detailed themes for players' RCT3 amusement parks - Jungle and Prehistoric - including giant insects and animatronic dinosaurs. Even more thrill rides; eight more coasters, eighteen 'flat' rides, brand new animal houses and four additional transport rides. Choreograph fun and entertaining performing animal programs, like the Lion Tamer Show, using the RCT3 MixMaster. Includes the biggest ever RCT3 transport ride: the Paddle Steamer, plus Elephant Rides, Safari SUVs and everglades speedboats. An occasional escaping animal causes chaos, and gives players a chance to use their tranquilizer dart shooting skills (but mind those park guests...) Make even more cash from your park using new shops and ad billboards, which for the first time allow players to put their own original content in the game. Say 'hello' to more new characters - a new VIP, a new Animal Keeper staff member, and the RCT favorite 'Tiger' mascot. [Atari]… Expand"}, {"name": "Sniper Elite III", "details_link": "https://www.metacritic.com/game/pc/sniper-elite-iii", "publisher": "Rebellion", "release_date": "Jun 27 2014", "developers": ["Rebellion"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Shooter", "Historic", "Action", "Shooter", "Third-Person", "Tactical", "Historic"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/4777f711f665e9a0a04d28ecd96a4ca3-98.jpg", "descriptions": "Sniper Elite 3 continues  the story of elite OSS sniper Karl Fairburne during World War II. The title takes players to the unforgiving yet exotic terrain of WWII’s North Africa conflict in a battle against a deadly new foe."}, {"name": "EyeToy: AntiGrav", "details_link": "https://www.metacritic.com/game/playstation-2/eyetoy-antigrav", "publisher": "SCEA", "release_date": "Nov  9 2004", "developers": ["Harmonix Music Systems"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Other"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/a5f7799cdc1be0df2902abff5d7d04ca-98.jpg", "descriptions": "EyeToy: AntiGrav is a game that implements the EyeToy technology in a completely new way through hoverboard gameplay. EyeToy: AntiGrav represents the first step in incorporating EyeToy into character control gameplay through the use of color and body recognition technology. Unique armbandsEyeToy: AntiGrav is a game that implements the EyeToy technology in a completely new way through hoverboard gameplay. EyeToy: AntiGrav represents the first step in incorporating EyeToy into character control gameplay through the use of color and body recognition technology. Unique armbands enable players to activate the color tracking capabilities of the EyeToy USB Camera. Together with facial and body recognition, racers will shred over diverse terrain through eight different levels, grinding on rails and taking flight to perform sick tricks, while interacting with the environment in exciting new ways. Gamers can pick the best racing line and discover hidden areas and unlockable sections along the fast-paced courses. Choose between different game modes to compete against other AI-controlled hoverboard racers, or challenge a friend as you race alongside the \"ghost\" image of your friend's best performance. Taking the skate and snowboarding countercultures to new heights, EyeToy: AntiGrav features eight original characters with their own style and equipment, all part of the hoverboard scene. Each is equipped with the latest gear and technology that best suits their racing style, with the opportunity to earn gear upgrades in competitions throughout the game. [SCEA]… Expand"}, {"name": "Back to the Future: The Game - Episode IV: Double Visions", "details_link": "https://www.metacritic.com/game/pc/back-to-the-future-the-game---episode-iv-double-visions", "publisher": "Telltale Games", "release_date": "Apr 29 2011", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PC"], "genres": ["Action Adventure", "Adventure", "Sci-Fi", "Sci-Fi", "3D", "Third-Person"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/666ee3cc9e7cf8813dca1beda2e8daf9-98.jpg", "descriptions": "In \"Double Visions\", the 4th episode of this 5 game series, the Hill Valley Expo has arrived! Back in 1986, Marty and First Citizen Brown must join forces to create an epic invention so that he can prevent the young Emmett Brown from making the worst mistake of his life."}, {"name": "Grim Guardians: Demon Purge", "details_link": "https://www.metacritic.com/game/playstation-5/grim-guardians-demon-purge", "publisher": "PQube", "release_date": "Feb 23 2023", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Metroidvania"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/84a76e2811bc97b086921c8775e976a2-98.jpg", "descriptions": "Grim Guardians: Demon Purge centers around two demon hunters who return to their school after a mission only to find a demonic castle where it once stood.Players control both of the demon hunting sisters in this 2D side-scrolling action game. Players must master each of the sisters' uniqueGrim Guardians: Demon Purge centers around two demon hunters who return to their school after a mission only to find a demonic castle where it once stood.Players control both of the demon hunting sisters in this 2D side-scrolling action game. Players must master each of the sisters' unique abilities and attributes to overcome the challenging stages with bosses awaiting their arrival. They'll also be able to find new routes through each stage using the two characters' abilities, keeping play throughs fresh.Other features include two-player co-op with special actions, extensive difficulty options with the \"Style System,\" unique changes on repeat plays, and most importantly the quality and challenge players have come to expect from Inti Creates titles, this time with a new gothic horror aesthetic.… Expand"}, {"name": "White Shadows", "details_link": "https://www.metacritic.com/game/pc/white-shadows", "publisher": "Headup Games", "release_date": "Dec  7 2021", "developers": ["Monokel"], "platforms": ["PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/94d1ed5d5dc52190a1dc4fb7a98d545f-98.jpg", "descriptions": "White Shadows is a cinematic puzzle-platformer where you play as a little Ravengirl trying to escape a brutal dystopia founded on oppression and violence that puts her at the bottom of its hierarchical social ladder.Composed of a vast network of towers rising from the void ofWhite Shadows is a cinematic puzzle-platformer where you play as a little Ravengirl trying to escape a brutal dystopia founded on oppression and violence that puts her at the bottom of its hierarchical social ladder.Composed of a vast network of towers rising from the void of post-catastrophe darkness into the sky above, the city our young adventurer seeks to escape is a dangerous place to be. She will have to find ways to avoid the teeth of machinery primed to grind her into dust, leap across rickety infrastructure that bridges the cavernous darkness all around and avoid the watchful eyes of guards ready to gun her down. She will travel to the city's brightest highs and delve to its darkest depths on her journey, discovering her destiny among the last free people alive.White Shadows' striking architectural forms and stunning monochrome art style combine to create a place steeped in atmosphere. It's a world where the lies of the elite are plastered across its walls, where twisted forms of entertainment are used to keep everyone in their place, and where hope seems in short supply.… Expand"}, {"name": "Golf With Your Friends", "details_link": "https://www.metacritic.com/game/switch/golf-with-your-friends", "publisher": "Team17", "release_date": "May 19 2020", "developers": ["Blacklight Interactive"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 12 ", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 71, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/7/b964cff4a159e4ddd64879dddfe20414-98.jpg", "descriptions": "Golf With Your Friends is an entertaining, challenging, multiplayer mini golf game for up to 12 players. The game currently has 3 levels containing 18 holes each. The controls are simple and the game is designed for the user to be able to host or join a game within a few seconds."}, {"name": "3000th Duel", "details_link": "https://www.metacritic.com/game/switch/3000th-duel", "publisher": "NEOPOPCORN Corp", "release_date": "Feb 19 2020", "developers": ["NEOPOPCORN Corp"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "2D"], "meta_score": 71, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/c8d203a4c5e8290a5781ed955f9a9b3a-98.jpg", "descriptions": "A hero with no memory, and with a mysterious mask covering his face, is thrown out into this land of unknown. Reaching to an end of his journey, he discovers a truth that is hard to swallow - something terrifying about his true identity..."}, {"name": "Summon Night 6: Lost Borders", "details_link": "https://www.metacritic.com/game/playstation-4/summon-night-6-lost-borders", "publisher": "GAIJINWORKS", "release_date": "Oct 31 2017", "developers": ["Media.Vision"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "Japanese-Style", "Tactics"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/f5a6e0b857b98b3d97ec9987dc22353f-98.jpg", "descriptions": "Summon Night 6: Lost Borders weaves an emotional tale of friendship and discovery that begins in the sparsely populated “cocoon world” of Fillujah, where the three main characters (Raj, Amu and Ist) live in virtual isolation."}, {"name": "Easy Golf: Course Architect", "details_link": "https://www.metacritic.com/game/xbox-360/easy-golf-course-architect", "publisher": "Microsoft Game Studios", "release_date": "Nov 20 2008", "developers": ["BarkersCrest Studios"], "platforms": "Xbox 360", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0//images/products/games/0/64757e7-98.jpg", "descriptions": "[Xbox Live Community Game]  Create golf courses and share them with friends online through XBox Live. The course editor allows you to easily create fun and playable golf course holes in minutes. Play against your friends online and watch their golf balls fly around on your created course in[Xbox Live Community Game]  Create golf courses and share them with friends online through XBox Live. The course editor allows you to easily create fun and playable golf course holes in minutes. Play against your friends online and watch their golf balls fly around on your created course in real time. Download your friends courses and play them over and over. Easy Golf is for people of all ages. [Microsoft]… Expand"}, {"name": "Chromehounds", "details_link": "https://www.metacritic.com/game/xbox-360/chromehounds", "publisher": "Sega", "release_date": "Jul 11 2006", "developers": ["From Software"], "platforms": "Xbox 360", "num_players": "12  Online", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/1dad13d02cd8f39780a7703f18f7a5d4-98.jpg", "descriptions": "This squad-based action title puts gamers in control of giant mechanized military weapons of war. Chromehounds offers an intense, photorealistic look at war from the cockpits of colossal metal vehicles. These heavily-armed weapons of war, called HOUNDSs, dominate ground battles duringThis squad-based action title puts gamers in control of giant mechanized military weapons of war. Chromehounds offers an intense, photorealistic look at war from the cockpits of colossal metal vehicles. These heavily-armed weapons of war, called HOUNDSs, dominate ground battles during warfare in the near-future. Squads of HOUNDs take to the field in international factions, cooperating with and complementing each other in terms of firepower, range of movement, and abilities. Domination of the world is the prize for the mightiest army on the field. Strategic planning, snap reflexes and communication are key to winning the day in this battle-hardened action title. Players take the role of either a Squad Member or a Tactics Commander, who is responsible for strategically guiding the team to victory with verbal commands on Xbox Live. In addition to supporting both cooperative and competitive online modes, the game offers thousands of upgrade options, which effect both the look and performance of player mechs. Strategic gameplay puts the player in the role of 'tactics commander'; manage your squad while testing your reflexes on the battlefield. Xbox LIVE support offers cooperative and competitive campaigns for up to 12 players at once. [Sega]… Expand"}, {"name": "Ecco the Dolphin: Defender of the Future", "details_link": "https://www.metacritic.com/game/playstation-2/ecco-the-dolphin-defender-of-the-future", "publisher": "Acclaim", "release_date": "Mar  3 2002", "developers": ["Appaloosa Interactive"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 71, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/b07c32cda6924ba0ea30d45df14ce36d-98.jpg", "descriptions": "Peace and harmony have reigned on Earth for a millennia, when the arrival of a mysterious foe threatens to destroy everything by altering time itself. Only a friendly dolphin called Ecco can prevent the evil force from twisting the very fabric of reality and enslaving the Earth forever.Peace and harmony have reigned on Earth for a millennia, when the arrival of a mysterious foe threatens to destroy everything by altering time itself. Only a friendly dolphin called Ecco can prevent the evil force from twisting the very fabric of reality and enslaving the Earth forever. Taking the role of Ecco, you must use all your brains and skills to navigate a series of alternate realities and restore the timeline to its rightful place. There are four parts to the game (Paradise Island, Man's Nightmare, Dolphin's Nightmare, the Foe's Lair) and you must solve puzzles in each before the Earth can be saved! [SCEE]… Expand"}, {"name": "Twelve Minutes", "details_link": "https://www.metacritic.com/game/xbox-one/twelve-minutes", "publisher": "Annapurna Interactive", "release_date": "Aug 19 2021", "developers": ["Luis Antonio", "Annapurna Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 71, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/0b1a741d8ecf096d8a7d28da9bbe36b4-98.jpg", "descriptions": "You are doomed to live the same TWELVE MINUTES inside your apartment, unless you use your knowledge of what is going to happen, to change the outcome, and break the loop."}, {"name": "Squishies", "details_link": "https://www.metacritic.com/game/playstation-4/squishies", "publisher": "Brainseed Factory", "release_date": "Nov 20 2018", "developers": ["Brainseed Factory"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/4b1d39a7da0c678481c106b46343086d-98.jpg", "descriptions": "Get lost in a cheerful world full of adventures. Squishies is a single player, puzzle platform experience, built exclusively for PlayStation VR. Solve puzzles and save Squishies or be creative and build your own levels then share them with the community."}, {"name": "Gauntlet: Slayer Edition", "details_link": "https://www.metacritic.com/game/playstation-4/gauntlet-slayer-edition", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Aug 11 2015", "developers": ["Arrowhead Game Studios"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Western-Style"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/3a66a0d252f8ea04e231dc42cc74f765-98.jpg", "descriptions": "The traditional Gauntlet 4-player co-op gameplay returns in a new experience. Assume the role of one of 4 unique heroes in a monster-filled dungeon brawler. Battle the interminable hordes of enemies as you and your cohorts fight for treasure and glory via both local and online co-op multiplayer."}, {"name": "Detective Pikachu", "details_link": "https://www.metacritic.com/game/3ds/detective-pikachu", "publisher": "Nintendo", "release_date": "Mar 23 2018", "developers": ["Creatures Inc."], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/087aadab105ed5bdfddee963d4933808-98.jpg", "descriptions": "As Tim Goodman, you will partner with a self-proclaimed \"great detective\" Pikachu to solve strange occurrences all over Ryme City. Together you must investigate, take notes, and meet up with other Pokémon to unravel the city's greatest mysteries. Tim is searching for his missing father inAs Tim Goodman, you will partner with a self-proclaimed \"great detective\" Pikachu to solve strange occurrences all over Ryme City. Together you must investigate, take notes, and meet up with other Pokémon to unravel the city's greatest mysteries. Tim is searching for his missing father in Ryme City, but instead encounters a witty, tough-talking Pikachu! Along the way, experience over 150 fun-filled animated cutscenes starring this unique Pikachu, providing helpful hints or talking up a storm. You can also tap the extra-large Detective Pikachu amiibo™ figure to access all cutscenes up until the current chapter played. As you investigate crime scenes, gather testimonies, uncover information, and interact with Pokémon to solve cases. You’ll have to put your detective skills to the test to foil the mastermind behind the disturbances in Ryme City. All in a day's work for detective Pikachu. [Nintendo] … Expand"}, {"name": "Everything", "details_link": "https://www.metacritic.com/game/switch/everything", "publisher": "David OReilly", "release_date": "Jan 10 2019", "developers": ["David OReilly"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/9197e9eb87c06f43e052687769737955-98.jpg", "descriptions": "Discover what it's like to be the Universe in this beautiful interactive nature simulation.\r Everything is an interactive experience where everything you see is a thing you can be, from animals to planets to galaxies and beyond. Travel between outer and inner space, and explore a vast,Discover what it's like to be the Universe in this beautiful interactive nature simulation.\r Everything is an interactive experience where everything you see is a thing you can be, from animals to planets to galaxies and beyond. Travel between outer and inner space, and explore a vast, interconnected universe of things without enforced goals, scores, or tasks to complete. Everything is a procedural, AI-driven simulation of the systems of nature, seen from the points of view of everything in the Universe.\r Learn to change what you are to create worlds within worlds within worlds, or let go any time to allow Everything to take over and produce a never ending documentary about the world you live in.\r Narrated by the inspiring philosophy of Alan Watts, and featuring a rich score from composer Ben Lukas Boysen, Everything will give you a new perspective on life.… Expand"}, {"name": "The Walking Dead: Michonne - Episode 3: What We Deserve", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-michonne---episode-3-what-we-deserve", "publisher": "Telltale Games", "release_date": "Apr 26 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/5e801cca3c589a39883eab2e0011974a-98.jpg", "descriptions": "The season finale."}, {"name": "JoJo's Bizarre Adventure: All-Star Battle", "details_link": "https://www.metacritic.com/game/playstation-3/jojos-bizarre-adventure-all-star-battle", "publisher": "Namco Bandai Games America", "release_date": "Apr 29 2014", "developers": ["CyberConnect2"], "platforms": "PlayStation 3", "num_players": "2 ", "genres": ["Fighting", "3D", "Action", "Fighting", "3D"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/8d4526e195a3fbd0609e91125e37c760-98.jpg", "descriptions": "JoJo's Bizarre Adventure: All-Star Battle gives players the feeling that they are participating in vivid and colorful battles straight from the pages of the manga."}, {"name": "Halcyon 6: Starbase Commander", "details_link": "https://www.metacritic.com/game/pc/halcyon-6-starbase-commander", "publisher": "Massive Damage, Inc.", "release_date": "Sep  8 2016", "developers": ["Massive Damage", "Inc."], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/c0a7a14688a28d2355091c0d95b32bcd-98.jpg", "descriptions": "Halcyon 6: Starbase Commander is a retro space strategy RPG with base building, deep tactical combat, crew management and emergent storytelling."}, {"name": "Stuntman Ignition", "details_link": "https://www.metacritic.com/game/playstation-2/stuntman-ignition", "publisher": "THQ", "release_date": "Aug 28 2007", "developers": ["Paradigm Entertainment"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Driving", "Mission-based"], "meta_score": 71, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/118c01fd1fa7c5096e73c3810a8d078f-98.jpg", "descriptions": "Stuntman: Ignition is the next installment in the Stuntman franchise. The game plunges gamers into the adrenaline-fueled role of a Hollywood stunt driver, challenging them to pull off the most breathtaking, death-defying stunts ever filmed. Players showcase their skills in a wide variety ofStuntman: Ignition is the next installment in the Stuntman franchise. The game plunges gamers into the adrenaline-fueled role of a Hollywood stunt driver, challenging them to pull off the most breathtaking, death-defying stunts ever filmed. Players showcase their skills in a wide variety of big-budget action films, commercial shoots and tournaments while commanding more than 25 unique vehicles, including exotic sports cars, motorcycles and hovercraft. Online multiplayer allows rival stuntmen to battle it out on the film sets and custom built back-lot arenas, or players can devise their own insane stunt runs and challenge other stuntmen at their own game. [THQ]… Expand"}, {"name": "Birth of America", "details_link": "https://www.metacritic.com/game/pc/birth-of-america", "publisher": "Strategy First", "release_date": "Jul 26 2006", "developers": ["AGEOD"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 71, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/61f40a52bf5fcdbd670eae469e200e77-98.jpg", "descriptions": "The year 2005 marks the 250th anniversary of the start of the French & Indian Wars. Twenty years later, the War of the American Independance began. These two events marked the real start of a new era, the end of an empire, the birth of a nation. In Birth of America, the player controls oneThe year 2005 marks the 250th anniversary of the start of the French & Indian Wars. Twenty years later, the War of the American Independance began. These two events marked the real start of a new era, the end of an empire, the birth of a nation. In Birth of America, the player controls one of the major contenders of these 2 conflicts, trying to achieve military and political victory. It is a rather complete and detailed simulation of the two most important wars in Colonial America - from 1755 to 1783 - but with a simple and elegant new simultaneous turn-based engine. [Strategy First]… Expand"}, {"name": "The Munchables", "details_link": "https://www.metacritic.com/game/wii/the-munchables", "publisher": "Namco Bandai Games", "release_date": "May 26 2009", "developers": ["Now Production"], "platforms": "Wii", "genres": ["Action", "General", "General"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/440f59b95de24d8ed63792d367631247-98.jpg", "descriptions": "In The Munchables, players are called upon to eat and defeat over 150 insidious enemies who have taken over the planet including Eggplanter, Space Shroom and Rice Baller. With each fallen foe, the daring omnivorous Munchables grow in size and power in their brave struggle. In thisIn The Munchables, players are called upon to eat and defeat over 150 insidious enemies who have taken over the planet including Eggplanter, Space Shroom and Rice Baller. With each fallen foe, the daring omnivorous Munchables grow in size and power in their brave struggle. In this tantalizingly addictive game, players can also enjoy Mirror Mode, where stages are in reverse order and they must beat the clock in order to save the world. Eating your way to take on Don Onion and his delicious minions, The Munchables will leave you hungry for more. [Namco Bandai Games]… Expand"}, {"name": "Minecraft: Story Mode - Episode 1: The Order of the Stone", "details_link": "https://www.metacritic.com/game/playstation-4/minecraft-story-mode---episode-1-the-order-of-the-stone", "publisher": "Telltale Games", "release_date": "Oct 13 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Adventure", "General", "Point-and-Click", "Linear"], "meta_score": 71, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/8/4b315aae0ab4e1b0ae8b0e88dafdf480-98.jpg", "descriptions": "Minecraft: Story Mode is an adventure game set in a Minecraft world. It is a 5-part episodic series that will take you to the Nether, the Farlands, the End, and beyond. You will determine how the story flows through the decisions you make: what you say to people (and how you say it), andMinecraft: Story Mode is an adventure game set in a Minecraft world. It is a 5-part episodic series that will take you to the Nether, the Farlands, the End, and beyond. You will determine how the story flows through the decisions you make: what you say to people (and how you say it), and what you choose to do in moments of action.… Expand"}, {"name": "King's Quest Chapter 2: Rubble Without a Cause", "details_link": "https://www.metacritic.com/game/xbox-one/kings-quest-chapter-2-rubble-without-a-cause", "publisher": "Sierra Games", "release_date": "Dec 15 2015", "developers": ["The Odd Gentlemen"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/4c18301aea1b1302fc64706f73f1a1a2-98.jpg", "descriptions": "Kings Quest - Chapter 1: A Knight to Remember is required to play this content and is sold separately.\r Kings Quest - Rubble Without A Cause is the second of five chapters in the new, critically acclaimed reimagining of the classic Kings Quest game series. In this latest adventure, KingKings Quest - Chapter 1: A Knight to Remember is required to play this content and is sold separately.\r Kings Quest - Rubble Without A Cause is the second of five chapters in the new, critically acclaimed reimagining of the classic Kings Quest game series. In this latest adventure, King Graham takes players back to his first test as ruler of Daventry. When a mischievous horde of goblins takes his kingdom hostage, a newly crowned and woefully unprepared Graham must rise up to free his people and prove himself the leader he was destined to become.\r Will Graham and his friends unearth a way to escape their rock-brained captors? Will he take for granite everything he learned as an adventurer? Does he have the stones to reclaim his mantle & lead his kingdom to safety? Will the hat make it out ok?… Expand"}, {"name": "DreamWorks Kung Fu Panda", "details_link": "https://www.metacritic.com/game/pc/dreamworks-kung-fu-panda", "publisher": "Activision", "release_date": "Jun  3 2008", "developers": ["Beenox"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/767a49e3837df591356891241e31ec87-98.jpg", "descriptions": "In Kung Fu Panda, players embark on an epic, action-packed adventure as they master the specialized Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13In Kung Fu Panda, players embark on an epic, action-packed adventure as they master the specialized Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13 legendary levels from the movie and beyond, and spanning land, water and air, players must work their way to become the Dragon Warrior and defeat the ultimate enemy, Tai Lung, as they battle a variety of foes, overcome dangerous obstacles, navigate multi-tiered environments and solve challenging puzzles. Featuring a deep variety of gameplay, unique co-op and competitive multiplayer modes, collectibles, and a host of character upgrades, the Kung Fu Panda video game provides an experience gamers of all ages will enjoy. [Activision]… Expand"}, {"name": "Tiger Woods PGA Tour 06", "details_link": "https://www.metacritic.com/game/xbox-360/tiger-woods-pga-tour-06", "publisher": "EA Sports", "release_date": "Nov 16 2005", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/239428d2b6d85d3453f3e7143f3d8214-98.jpg", "descriptions": "The next generation of Tiger Woods PGA TOUR delivers higher-fidelity physics models that allow the ball when struck to interact more realistically with the clubface and terrain, resulting in more realistic ball flight and bounces. Advanced lighting techniques provide a much better sense ofThe next generation of Tiger Woods PGA TOUR delivers higher-fidelity physics models that allow the ball when struck to interact more realistically with the clubface and terrain, resulting in more realistic ball flight and bounces. Advanced lighting techniques provide a much better sense of terrain undulation and the contours make giving players the ability to realistically interpret approach shots or a crucial putt on a rolling green.  [Electronic Arts]… Expand"}, {"name": "Asura's Wrath", "details_link": "https://www.metacritic.com/game/xbox-360/asuras-wrath", "publisher": "Capcom", "release_date": "Feb 21 2012", "developers": ["CyberConnect2"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/b0e94ca54cdfacde6559492ae6507129-98.jpg", "descriptions": "Once a revered deity, Asura was betrayed by his fellow gods and stripped of all his powers. Consumed by anger at the injustice he has suffered and swearing vengeance, Asura discovers he can use this fury to his advantage and turn it against his enemies. By channelling his inner rage, AsuraOnce a revered deity, Asura was betrayed by his fellow gods and stripped of all his powers. Consumed by anger at the injustice he has suffered and swearing vengeance, Asura discovers he can use this fury to his advantage and turn it against his enemies. By channelling his inner rage, Asura is now able to unleash devastating attacks and wreak havoc as he battles against the deities who have wronged him and their earthly forces. Inspired by episodic dramas, Asura's Wrath will be split into distinct sections with gameplay and narrative unfolding as one and building to a final climatic conclusion.… Expand"}, {"name": "ScreamRide", "details_link": "https://www.metacritic.com/game/xbox-one/screamride", "publisher": "Microsoft Game Studios", "release_date": "Mar  3 2015", "developers": ["Frontier Developments"], "platforms": ["Xbox 360", "Xbox One"], "genres": ["Simulation", "General"], "meta_score": 71, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/8/1a19683cd4a0b494d32357975b0b5ab4-98.jpg", "descriptions": "Screamride is a physics-based coaster game where creativity and destruction are equally welcomed. This game features hundreds of customizable building components, physics-based destruction, cinematic collisions, unlockable levels, in-game leaderboards, global rankings and more."}, {"name": "Star Wars: The Force Unleashed", "details_link": "https://www.metacritic.com/game/playstation-3/star-wars-the-force-unleashed", "publisher": "LucasArts", "release_date": "Sep 16 2008", "developers": ["LucasArts"], "platforms": ["iPhone/iPad", "PlayStation 2", "Switch", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Shooter", "Linear", "Third-Person", "Arcade"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/aa2822fbce5d1bd141b786432bd02842-98.jpg", "descriptions": "Star Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode IIIStar Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode III Revenge of the Sith\" and \"Star Wars: Episode IV A New Hope.\" In it, players assist the iconic villain in his quest to rid the universe of Jedi - and face decisions that could change the course of their destiny. Unleash and upgrade the Secret Apprentice's four core Force powers - Force push, grip, repulse and lightning - throughout the course of the game, and combine them for ultra-destructive, never-before-seen combos. The Secret Apprentice doesn't just Force push enemies into walls - he Force pushes enemies through walls. The Secret Apprentice doesn't just Force grip foes to throw them aside - he Force grips them in midair, zapping them with lightning, then dropping them to the ground to explode like a bomb. In addition to new adversaries created just for the game, such as fugitive Jedi and Force-sensitive Felucians, players also confront and associate with familiar faces from the Star Wars films, including Darth Vader. Visit locations such as Episode III's Wookiee homeworld Kashyyyk and the floral Felucia, the junk planet Raxus Prime, plus an Imperial TIE fighter construction facility. Decisions made by players throughout the game determine the path of the story, including multiple endings that will rock Star Wars continuity as they know it. [LucasArts]… Expand"}, {"name": "Fairy Fencer F: Advent Dark Force", "details_link": "https://www.metacritic.com/game/playstation-4/fairy-fencer-f-advent-dark-force", "publisher": "Idea Factory", "release_date": "Jul 26 2016", "developers": ["Compile Heart"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/fe450935b7939dbd23420c5bc6be3967-98.jpg", "descriptions": "Fairy Fencer F is reborn as Fairy Fencer F: Advent Dark Force for the PlayStation®4 system! Continue your adventure through three new story paths: The Goddess story, the Vile Goddess story, and the Evil Goddess story."}, {"name": "ParaWorld", "details_link": "https://www.metacritic.com/game/pc/paraworld", "publisher": "Aspyr", "release_date": "Sep 27 2006", "developers": ["SEK Ost"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/8fa6b52ff32915644b6c1d274c961397-98.jpg", "descriptions": "ParaWorld is a real-time strategy game in which warring tribes team with vicious prehistoric beasts wage brutal combat for control of a world that is parallel to our own. Armed with devastating weapons, commanding powerful fighting dinosaurs and controlling up to 50 units, players go intoParaWorld is a real-time strategy game in which warring tribes team with vicious prehistoric beasts wage brutal combat for control of a world that is parallel to our own. Armed with devastating weapons, commanding powerful fighting dinosaurs and controlling up to 50 units, players go into battle in gripping single-player and multiplayer action. Up to eight players can battle each other via a LAN or the Internet on one of more than 15 multiplayer maps and three multiplayer modes– Team Deathmatch, Defender (one player has to defend his base against all the other players), and Domination (capture the flag). ParaWorld utilizes an unprecedented unit management user interface called the Army Controller, which truly evolves the genre and goes beyond the typical RTS interface. The Army Controller interface appears unobtrusively on the screen. Players can view all of their units at a glance and have general awareness of each unit's health, danger, activity and level-up capabilities.  Using the Army Controller, players can select several units consecutively, even if they are spread across the map, in just seconds by simply marking the unit icons in the Army Controller. In ParaWorld's robust single-player campaign players get to know and play three different tribes  -- the Norsemen, Dustriders and Dragon Clan. Each tribe is based on a different ancient culture and each sports its own unique play style, units, architecture, skills, and controllable beasts. Utilizing their tribe's skills, and with the help of nine controllable hero characters, players explore 16 equally atmospheric and dangerous prehistoric scenarios located in five climatic zones.  Each level contains main quests and side quests. [Aspyr Media]… Expand"}, {"name": "Knowledge is Power", "details_link": "https://www.metacritic.com/game/playstation-4/knowledge-is-power", "publisher": "Sony Interactive Entertainment", "release_date": "Oct 24 2017", "developers": ["Sony Interactive Entertainment", "Wish Studios"], "platforms": "PlayStation 4", "num_players": "Up to 6 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/b957f8e9ade52485ff4764522c635e11-98.jpg", "descriptions": "Answer a massive variety of trivia questions to outsmart your opponents, with tactile challenges thrown in to keep you on your toes. This is all about speed and accuracy — are you up to the task?"}, {"name": "Flock!", "details_link": "https://www.metacritic.com/game/playstation-3/flock!", "publisher": "Capcom", "release_date": "Apr  9 2009", "developers": ["Proper Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/a56e4358c09d8ab8a1b11afb2e2e5e4b-98.jpg", "descriptions": "FLOCK! uses a sophisticated physics engine that drives the challenging puzzle elements of the game. Whether it's using the Tractor beam to move obstacles out of the way, or the Depressor beam to stamp out crop circles to guide your herds, being an extraterrestrial has never been thisFLOCK! uses a sophisticated physics engine that drives the challenging puzzle elements of the game. Whether it's using the Tractor beam to move obstacles out of the way, or the Depressor beam to stamp out crop circles to guide your herds, being an extraterrestrial has never been this addictive. Friends can also join in through co-op play. And when all the levels have been completed, users can make their own with the level editor that comes with the game. Flock comes packed with so much content, the potential fun is out of this world! Over 50 levels of pastoral puzzle challenges. Explore levels to find secret collectables and upgrades. Level Editor allows players to make their own \"plushie\" and puzzle-filled levels and share them with their friends online. Two-player local co-op mode makes the \"flocking\" exponentially fun. Compelling environments complemented by a whimsical art style, beautiful lighting and distinctive textures make this one of the most graphically-advanced downloadable titles to date. Real-world physics engine creates all new types of puzzles: pick up wooden planks to form bridges, move items to create obstructions, crush wheat into pathways. [Capcom]… Expand"}, {"name": "The DioField Chronicle", "details_link": "https://www.metacritic.com/game/playstation-5/the-diofield-chronicle", "publisher": "Square Enix", "release_date": "Sep 22 2022", "developers": ["Square Enix", "Lancarse"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Turn-Based", "General", "Strategy", "Real-Time", "Tactics"], "meta_score": 71, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/0/6bfa2591e56cf9833f0e1f0fe559e86f-98.jpg", "descriptions": "A gritty and immersive story brought to life with the latest technology.\rIntroducing \"Real Time Tactical Battle\" (RTTB), a new, deeply strategic, real-time battle system.\rThe beginnings of a new Strategy RPG, crafted by a skilled and experienced development team.\r\n\r\n■An all-new StrategyA gritty and immersive story brought to life with the latest technology.\rIntroducing \"Real Time Tactical Battle\" (RTTB), a new, deeply strategic, real-time battle system.\rThe beginnings of a new Strategy RPG, crafted by a skilled and experienced development team.\r ■An all-new Strategy RPG that chronicles an epic tale of war and honour. Featuring a unique and beautiful world that blends fantasy, medieval and modern-day influences, and a deep yet innovative real-time battle system.\r■Deep, strategic, real-time tactical battles\rThe battles in this game are defined by real-time assessment of battlefield conditions and issuing decisive orders that take advantage of your troops strengths and weaknesses to gain advantage over your foe. Make clever use of a variety of skills, classes and equipment to complete your mission.\r■Realistic \"diorama\" style battle scenes\rRichly detailed depictions of the environments of the island of DioField combined with unique \"diorama\" style visuals as you command your forces like a general.… Expand"}, {"name": "Miitopia", "details_link": "https://www.metacritic.com/game/switch/miitopia", "publisher": "Nintendo", "release_date": "May 21 2021", "developers": ["Nintendo", "GREZZO"], "platforms": ["3DS", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/9be013fac328284e1c1fca8d289c3276-98.jpg", "descriptions": "Your friends. Your adventure. Your rules.\r Since the dawn of ever, warriors have banded together to fight evil. Now Mii characters based on your favorite people must unite to do turn-based battle and save Miitopia! Cast them in roles across the kingdom, manage friendships, and give themYour friends. Your adventure. Your rules.\r Since the dawn of ever, warriors have banded together to fight evil. Now Mii characters based on your favorite people must unite to do turn-based battle and save Miitopia! Cast them in roles across the kingdom, manage friendships, and give them jobs with distinct stats, abilities, gear, and a custom look. Then behold as awesomeness unfolds! Guide your team of Mii characters on a quest to defeat the Dark Lord and restore the stolen faces of the citizens of Miitopia. As you watch with bated breath, Mii characters will mingle over food, camping, exercise, sleeping arrangements, and yes, combat! In these wild, yet traditional RPG battles, your partys relationships affect the outcome. Enemies attack while you explore the world map, which is littered with hidden paths and treasures. Talk about a win-win!… Expand"}, {"name": "Sherlock Holmes: The Devil's Daughter", "details_link": "https://www.metacritic.com/game/playstation-4/sherlock-holmes-the-devils-daughter", "publisher": "Bigben Interactive", "release_date": "Oct 25 2016", "developers": ["Frogwares"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "General", "3D", "Third-Person"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/21214df42b8cb7f52048596be65b0c75-98.jpg", "descriptions": "Sherlock Holmes: The Devil’s Daughter, the eighth game in the series, is an incredible adventure game with unique gameplay blending investigation, action and exploration for an extraordinary experience that will test the limits of players' nerves and intelligence. Playing as the greatSherlock Holmes: The Devil’s Daughter, the eighth game in the series, is an incredible adventure game with unique gameplay blending investigation, action and exploration for an extraordinary experience that will test the limits of players' nerves and intelligence. Playing as the great detective, they will have to track down evil in the darkest corners of London and the human spirit, freely exploring several neighbourhoods in the city in search of clues and suspects while they untangle a web of intrigue leading to the final stunning revelation.… Expand"}, {"name": "Nickelodeon All-Star Brawl", "details_link": "https://www.metacritic.com/game/xbox-series-x/nickelodeon-all-star-brawl", "publisher": "GameMill Entertainment", "release_date": "Oct  5 2021", "developers": ["Ludosity Interactive", "Fair Play Labs"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Fighting", "Party / Minigame", "2D"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/ed5687e9a436a91b2372c27901b37918-98.jpg", "descriptions": "THE ALL-STAR BRAWL BEGINS!Nickelodeon All-Star Brawl brings together all your Nickelodeon favorites for one bombastic battle. Face off with a power-packed cast of heroes from the top shows within the Nickelodeon universe, including SpongeBob SquarePants, Teenage Mutant Ninja Turtles,THE ALL-STAR BRAWL BEGINS!Nickelodeon All-Star Brawl brings together all your Nickelodeon favorites for one bombastic battle. Face off with a power-packed cast of heroes from the top shows within the Nickelodeon universe, including SpongeBob SquarePants, Teenage Mutant Ninja Turtles, Invader Zim, and many more, to determine the ultimate champion. With unique moves and attacks drawn directly from their identifiable personalities, each brawler has its own style of play for endless action.… Expand"}, {"name": "ActRaiser Renaissance", "details_link": "https://www.metacritic.com/game/playstation-4/actraiser-renaissance", "publisher": "Square Enix", "release_date": "Sep 23 2021", "developers": ["Square Enix", "Sonic Powered"], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/c55d1b61dfe7cff3c9694930de8ebe30-98.jpg", "descriptions": "Heaven, earth and mankind - Create and destroy everything according to your will! Experience the revival of the 90's classic hit \"Actraiser\". \nABOUT \nActraiser Renaissance combines 2D platforming action (Realm Acts) with a City-building simulation (Realm Management) in the ultimate battleHeaven, earth and mankind - Create and destroy everything according to your will! Experience the revival of the 90's classic hit \"Actraiser\". ABOUT Actraiser Renaissance combines 2D platforming action (Realm Acts) with a City-building simulation (Realm Management) in the ultimate battle between good and evil!Featuring the soundtrack that sent shockwaves through the gaming world when it was first released, composed by the legendary Yuzo Koshiro - now remastered!Help humanity flourish by playing as the Lord of Light and their loyal angel in a world beset by evil. NEW FEATURES:* Remastered 2D graphics present the game in beautiful HD* 15 new music tracks, as well as re-arranged original tracks by Actraiser composer Yuzo Koshiro!* New stories, expanded action and realm management gameplay, additional action stages, an all-new realm, and new more powerful bosses!* Auto-save and difficulty levelsGAME SYSTEM Realm Acts: Strategically cast powerful fire, ice, and other magic in these 2D action stages. Humans return to reclaim the realm after you conquer these stages, allowing you to begin cultivating your settlements.New magic that was not available in the original game has been added along with the ability to dodge. Players can also attack with upward and downward motions for a more dynamic action experience. You will need every new trick in your arsenal to defeat stronger bosses at the end of the new action stages. Realm Management: Help humanity flourish by cultivating your settlements and offering guidance. Use your miraculous powers to summon lightning and trigger earthquakes to remove obstacles such as trees and boulders that impede the growth of your chosen. Play as the Lord of Light's angel and use your mighty bow and arrows to drive back the evil monsters that prey on your people.Protect your settlements from enemy raids in real-time strategic battles. The placement of your forts and timing of your miracles is key to achieving victory in these engagements.Experience all-new tales of humanity's struggles to overcome their flaws and failings as they learn to love one another and together grow stronger. Altogether, these new scenarios amount to more than twice the story present in the original. Explore the vast new realm and enjoy building your settlements for longer than ever before!MUSICThe original Actraiser composer, Yuzo Koshiro, has re-arranged all of the iconic original tracks and added 15 new tracks as well. Players can listen to the original music or switch to the re-arranged versions while playing the game. Tired from protecting and raising your villagers? Then just sit back, relax, and enjoy the tunes.… Expand"}, {"name": "Destiny 2: Beyond Light", "details_link": "https://www.metacritic.com/game/xbox-series-x/destiny-2-beyond-light", "publisher": "Bungie Software", "release_date": "Nov 10 2020", "developers": ["Bungie Software", "Bungie"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/ed9562d089fc1238d5ee0c5c8da969b3-98.jpg", "descriptions": "The frontier of Europa holds many lost secrets from the past, including the dark power of Stasis. You must work with the mysterious Exo Stranger to harness this new power before Eramis, the Kell of Darkness, bestows it on her Fallen forces. Grow your arsenal, master Stasis, and go beyond the light."}, {"name": "Dragon Quest III: The Seeds of Salvation", "details_link": "https://www.metacritic.com/game/switch/dragon-quest-iii-the-seeds-of-salvation", "publisher": "Square Enix", "release_date": "Sep 27 2019", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/499cb7a57307875c05e5d9acc50a1c35-98.jpg", "descriptions": "An epic RPG with staggering depth, Dragon Warrior III immerses you in a deep adventure that you won't soon forget. Known as Dragon Quest in Japan, the Dragon Warrior series has produced some of the most popular RPGs of all time, and for good reason. Enix caters to their fans with anAn epic RPG with staggering depth, Dragon Warrior III immerses you in a deep adventure that you won't soon forget. Known as Dragon Quest in Japan, the Dragon Warrior series has produced some of the most popular RPGs of all time, and for good reason. Enix caters to their fans with an obsessive attention to detail, creating a universe which is both whimsical and realistic at the same time.You get to control a young hero (male or female) in the land of Aliahan who is called upon by the king to defeat the Demon Lord Baramos. Your quest will take you through more than 50 caves, dungeons and towns, each filled with monsters to defeat and puzzles to solve. You can stock your traveling party with three companions from nine character classes, each with unique strengths and weaknesses.U.S. gamers got their first taste of Dragon Warrior III in 1992, when the game was released for the original Nintendo Entertainment System. The game was massive even for a home console system, and Enix has upped the ante even more with the Game Boy Color version. Revamped graphics make the game look better than ever, new twists to the storyline keep things fresh, and plenty of other changes help to give the adventure a rejuvenated feel.One of the most intriguing changes is the addition of a personality system. You're asked a series of questions when the game begins, and you are assigned a unique personality depending on your responses. There are over two dozen possible personality traits, and the game changes depending on your character's personality and gender. If you don't like the way you've been labeled, you can always read a book or two to alter your personality.Monster Medals are another new feature in the Game Boy Color version. Monster Medals are sometimes left behind after you defeat an enemy, and come in three varieties: Bronze, Silver and Gold. Using a Game Boy Game Link Cable, you can trade Monster Medals with your friends to try to complete your collection.There are over 150 different monsters to strike down throughout the game, including some new monsters like SeaSlime. The bad guys look great, because they were all designed by Akira Toriyama, creator of Dragon Ball Z.Dragon Warrior III is an RPG fan's dream come true -- and it's portable. All hail the Slimes, and have fun overthrowing Lord Baramos.… Expand"}, {"name": "FIFA 19", "details_link": "https://www.metacritic.com/game/switch/fifa-19", "publisher": "Electronic Arts", "release_date": "Sep 25 2018", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 71, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/8/9bf20b1b4f8d382fb1d6218a58f949a0-98.jpg", "descriptions": "Introducing the prestigious UEFA Champions League, offering authentic in match atmospheres, featuring gameplay updates including elevated on-pitch personality and a striking overhaul, and providing new and unrivaled ways to play. Champions Rise in FIFA 19. Play the pinnacle of club footballIntroducing the prestigious UEFA Champions League, offering authentic in match atmospheres, featuring gameplay updates including elevated on-pitch personality and a striking overhaul, and providing new and unrivaled ways to play. Champions Rise in FIFA 19. Play the pinnacle of club football across a variety of modes in FIFA 19 with official match presentation, breadth in tournament experiences, including UEFA Champions League, Europa League and Super Cup, and an all-new commentary team in Derek Rae and Lee Dixon. The UEFA Champions League, Europa League and Super Cup come to life across experiences in EA SPORTS FIFA 19. From live content updates in FIFA 19 Ultimate Team, to authentic Career Mode integration, to an all-new standalone UEFA Champions League Mode, you can experience the greatest club football competition in the world no matter where you play in FIFA 19. In-Match Experience - Immerse yourself in the most authentic football experience ever seen before on Nintendo Switch. Featuring distinctive team and player personalities, introducing official broadcast presentation for the some of the world’s biggest leagues, and elevating your ability to finish with the all-new striking overhaul … Expand"}, {"name": "39 Days to Mars", "details_link": "https://www.metacritic.com/game/pc/39-days-to-mars", "publisher": "It's Anecdotal", "release_date": "Apr 25 2018", "developers": ["It's Anecdotal"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 71, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/0/6b4aea42655ee400d207a178c1bada4f-98.jpg", "descriptions": "Embark on the 19th century's most unreliable spaceship in this 2 player couch co-op adventure. 39 Days to Mars is a unique game designed to be played with a friend, where both players have important roles in the expedition. Solo players are aided by the computer-controlled ship's cat."}, {"name": "Robonauts", "details_link": "https://www.metacritic.com/game/switch/robonauts", "publisher": "QubicGames", "release_date": "Sep 15 2017", "developers": ["QubicGames"], "platforms": ["PC", "PlayStation 4", "Switch"], "genres": ["Action", "Platformer", "2D"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/f9203150602eb555b933785054755d9e-98.jpg", "descriptions": "The action combines familiar arcade shooting gameplay with a unique possibility to switch gravity. Colorful graphics appeal to both younger and adult players while first-class music by Simon Viklund makes the adventure feel even more epic."}, {"name": "Songbringer", "details_link": "https://www.metacritic.com/game/playstation-4/songbringer", "publisher": "Double Eleven", "release_date": "Sep  5 2017", "developers": ["Wizard Fu Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action Adventure", "General", "Action RPG", "Open-World"], "meta_score": 71, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/d862e1b471313a8d15d59a27245553c4-98.jpg", "descriptions": "Darkness sleeps just beneath the cracks on the ever-changing planet. The curious will uncover powerful artifacts and forge them anew. The strong will take the nanosword and crush galactic giants."}, {"name": "BUTCHER", "details_link": "https://www.metacritic.com/game/playstation-4/butcher", "publisher": "Crunching Koalas", "release_date": "May  9 2017", "developers": ["Transhuman Design", "Crunching Koalas"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/cd027be495c3d3e4593bf49a5eb9a6f2-98.jpg", "descriptions": "BUTCHER is a fast-paced 2D shooter and a blood-soaked love letter to the cult classics of the genre."}, {"name": "Batman: Arkham Origins - Cold, Cold Heart", "details_link": "https://www.metacritic.com/game/xbox-360/batman-arkham-origins---cold-cold-heart", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 22 2014", "developers": ["WB Games Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Fantasy", "Open-World"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/c65c42f286116d6b3f2ab28c79885473-98.jpg", "descriptions": "Cold, Cold Heart pits a young caped crusader against Mr. Freeze."}, {"name": "Ridge Racer Unbounded", "details_link": "https://www.metacritic.com/game/xbox-360/ridge-racer-unbounded", "publisher": "Namco Bandai Games", "release_date": "Mar 27 2012", "developers": ["Bugbear"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/a7e3b98cec8110b18463ce4828058ecc-98.jpg", "descriptions": "The RIDGE RACER series takes off in a new direction with RIDGE RACER Unbounded. Join the Unbounded team, a group of lawless badass racers, terrorizing the streets of Shatter Bay and expand your ever growing territory. Drive & Destroy everything in your path to create new areas that were onceThe RIDGE RACER series takes off in a new direction with RIDGE RACER Unbounded. Join the Unbounded team, a group of lawless badass racers, terrorizing the streets of Shatter Bay and expand your ever growing territory. Drive & Destroy everything in your path to create new areas that were once off limits. Go online to Dominate and race an unlimited supply of user created maps. [Namco Bandai]… Expand"}, {"name": "Monster Hunter Freedom", "details_link": "https://www.metacritic.com/game/psp/monster-hunter-freedom", "publisher": "Capcom", "release_date": "May 23 2006", "developers": ["Capcom"], "platforms": "PSP", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 71, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/7fb10e88afbf7b54742b34352f5f9986-98.jpg", "descriptions": "Non-stop adventures await you in the land of ferocious bloodthirsty beasts. Experience breathtaking graphics, immersive gameplay and action packed battles. Master a dynamic, ruthless world and carve out a name for yourself. Multiplayer action allows players to join hunting parties to bringNon-stop adventures await you in the land of ferocious bloodthirsty beasts. Experience breathtaking graphics, immersive gameplay and action packed battles. Master a dynamic, ruthless world and carve out a name for yourself. Multiplayer action allows players to join hunting parties to bring down the beasts. Choose from tons of different and exciting quests to complete. Hunt alone or with up to four players in Ad Hoc mode. Customizable characters give each player unique experiences. Become a \"treasure hunter\" in a two player co-op game – Collect and deliver treasures in this fast paced timed game. New Felyne Kitchen – hire feisty chefs to produce unique meals to help enhance your abilities. [Capcom]… Expand"}, {"name": "Suzuki TT Superbikes", "details_link": "https://www.metacritic.com/game/playstation-2/suzuki-tt-superbikes", "publisher": "Valcon Games", "release_date": "Aug  4 2005", "developers": ["Jester Interactive"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 71, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/5997e8a946b98a1de379bb38dab86e69-98.jpg", "descriptions": "TT Superbikes is an Official License from the Isle of Man Government, with further Official support from the Auto Cycle Union, the motorcycle racing governing organization for the TT Races. The game features licensed motorcycle manufacturer support, such as Honda, Suzuki, Kawasaki, Yamaha,TT Superbikes is an Official License from the Isle of Man Government, with further Official support from the Auto Cycle Union, the motorcycle racing governing organization for the TT Races. The game features licensed motorcycle manufacturer support, such as Honda, Suzuki, Kawasaki, Yamaha, Aprilia and Triumph. Related motorcycle product manufacturers also provide additional licensed support with major brands, Castrol, Dunlap, Avon and Bridgestone Tyres, Alpinestars Leathers, Arai and Shoei Helmets, Dymag and Marchesini Wheels along with Ohlins suspension and Arrow Exhausts to name a few. Containing more than 40 miles of beautifully recreated true to life real road racing circuits with data from the Isle of Man Government and the game's own road surveying crew means every vital bump, wall, tree and house included in the game, just like real life. [Valcon Games]… Expand"}]