[{"name": "Super Seducer: How to Talk to Girls", "details_link": "https://www.metacritic.com/game/pc/super-seducer-how-to-talk-to-girls", "publisher": "RLR Training Inc", "release_date": "Mar  6 2018", "developers": ["RLR Training Inc"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 35, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/8ee1049d98fe29a49f51256b8f6eb1f9-98.jpg", "descriptions": "Learn state-of-the-art seduction secrets from the master himself, Richard La Ruina, in this live action seduction simulator."}, {"name": "Fugitive Hunter: War on Terror", "details_link": "https://www.metacritic.com/game/playstation-2/fugitive-hunter-war-on-terror", "publisher": "Encore Software, Inc.", "release_date": "Nov 18 2003", "developers": ["Black Ops Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 35, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/96ab4b192386f223fb33d03fb20ebdd4-98.jpg", "descriptions": "Pursue the world's most dangerous fugitives across 5 sprawling real world locations. Dole out cruel and unusual punishment as you engage fugitives in fierce hand to hand combat and bring the worlds most wanted to justice! [Atari]"}, {"name": "Star Raiders", "details_link": "https://www.metacritic.com/game/xbox-360/star-raiders", "publisher": "Atari", "release_date": "May 11 2011", "developers": ["Incinerator Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "General", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 35, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/fe3db0dbb866e90a7c446dfe2c7f20b8-98.jpg", "descriptions": "A remake of the classic Atari 2600 game makes its way to the Xbox 360."}, {"name": "King of Clubs", "details_link": "https://www.metacritic.com/game/wii/king-of-clubs", "publisher": "Crave", "release_date": "Aug  4 2008", "developers": ["Oxygen Interactive"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 35, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/0abafaeacb04b17f8ced9515cc5decd5-98.jpg", "descriptions": "Never the same game twice, this absorbing and addictive, off the wall mini-golf-based puzzler requires players to use their ingenuity to play their way to victory and lucrative rewards, whether strategically, tactically or by being a downright dirty dawg...! Players must collect, unlock, buyNever the same game twice, this absorbing and addictive, off the wall mini-golf-based puzzler requires players to use their ingenuity to play their way to victory and lucrative rewards, whether strategically, tactically or by being a downright dirty dawg...! Players must collect, unlock, buy or hire rewards to enable them to complete a variety of puzzles across five themes, on more than 95 holes to build up their equipment and skills. Not only that but with seemingly endless ways of completing each puzzle, King of Clubs offers enormously long-lasting playability. Set in a dilapidated theme park in the middle of the Nevada desert (rumours abound that it is built on the site of an old nuclear waste site…but we can ignore that), King of Clubs looks like a cross between an amateur theatrical production and a kitsch vintage Americana playground paradise for jerky-lovin’ trailer trash! Complete with pteranodons on poles, spaceships on string and wobbly waves (plus so much more!), each themed world comes complete with its own quirky resident pro/boss, whom players must beat in order to advance to the next level before ending up in a showdown with the top guy himself, Big Bubba King. [Oxygen Interactive]… Expand"}, {"name": "Langrisser Re:Incarnation -TENSEI-", "details_link": "https://www.metacritic.com/game/3ds/langrisser-reincarnation--tensei-", "publisher": "Aksys Games", "release_date": "Apr 19 2016", "developers": ["NCS", "extreme Co.,Ltd."], "platforms": "3DS", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 35, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/9/5fe6b945183c8f84734de7d1d9725752-98.jpg", "descriptions": "Langrisser Re:Incarnation -TENSEI- is a strategic simulation RPG experience for the Nintendo 3DS"}, {"name": "ShellShock 2: Blood Trails", "details_link": "https://www.metacritic.com/game/playstation-3/shellshock-2-blood-trails", "publisher": "Eidos Interactive", "release_date": "Feb 24 2009", "developers": ["Rebellion"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Historic", "Historic", "Historic", "Arcade"], "meta_score": 35, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/5/c56cd65a7b743e3b9fad8f8a08c9fbcb-98.jpg", "descriptions": "ShellShock 2: Blood Trails is a violent, first-person, survival horror game set against the backdrop of the Vietnam War. Gameplay centers on the use of psychological horror and fear, relying on the power of suggestion, mood, tension and foreshadowing - implying the notion of danger,ShellShock 2: Blood Trails is a violent, first-person, survival horror game set against the backdrop of the Vietnam War. Gameplay centers on the use of psychological horror and fear, relying on the power of suggestion, mood, tension and foreshadowing - implying the notion of danger, potential danger, imminent danger, and horrifying acts that have or are implied to have occurred or will come to pass. On course for war torn Vietnam, a plane carrying a top-secret cargo known only as Whiteknight is lost over the uncharted jungles of Cambodia. The special ops squad sent in to retrieve it disappear wtihout trace. Until, a month later, one of them walks out. Something in the darkness has driven him insane... Something from the darkness has followed him out. [Eidos Interactive]… Expand"}, {"name": "Fireburst", "details_link": "https://www.metacritic.com/game/xbox-360/fireburst", "publisher": "Bigben Interactive", "release_date": "Jun 14 2013", "developers": ["exDream"], "platforms": ["PC", "Xbox 360"], "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 35, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/2/a5a2a0ec8b60b4dc14df1c3fbf62936c-98.jpg", "descriptions": "Fireburst sends players into a fiery, four-wheeled adrenalin frenzy. Behind the wheel of numerous different racers, drivers get to speed along paved race courses or wicked off-road tracks, showing no respect for their rivals. Thanks to a novel boost system, opponents are kept at a distanceFireburst sends players into a fiery, four-wheeled adrenalin frenzy. Behind the wheel of numerous different racers, drivers get to speed along paved race courses or wicked off-road tracks, showing no respect for their rivals. Thanks to a novel boost system, opponents are kept at a distance in spectacular ways in various single and multiplayer modes. The element of fire prominently features in all special maneuvers. It is possible, for example, to coat your own vehicle in protective flames, or make a rival's car explode with a burst of fire.… Expand"}, {"name": "Rambo: The Video Game", "details_link": "https://www.metacritic.com/game/pc/rambo-the-video-game", "publisher": "Reef Entertainment", "release_date": "Feb 21 2014", "developers": ["Teyon"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 34, "users_score": 1.6, "image": "https://static.metacritic.com/images/products/games/4/c37da3a176624db3e45168ccb7ca9f42-98.jpg", "descriptions": "RAMBO The Vidoegame puts players in Rambo’s combat boots and takes them on an action-packed adventure through the iconic action- sequences and story-arcs of FIRST BLOOD, RAMBO: FIRST BLOOD PART II  & RAMBO III. The game features the original movie voice-tracks of John Rambo and Col. SamuelRAMBO The Vidoegame puts players in Rambo’s combat boots and takes them on an action-packed adventure through the iconic action- sequences and story-arcs of FIRST BLOOD, RAMBO: FIRST BLOOD PART II  & RAMBO III. The game features the original movie voice-tracks of John Rambo and Col. Samuel Trautman as well as selected music from the original Rambo Trilogy. … Expand"}, {"name": "Jekyll & Hyde (2001)", "details_link": "https://www.metacritic.com/game/pc/jekyll-hyde-2001", "publisher": "DreamCatcher Interactive", "release_date": "Oct  9 2001", "developers": ["In Utero"], "platforms": "PC", "genres": ["Action", "General", "General"], "meta_score": 34, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/e6662381b1c6345891079abd30252258-98.jpg", "descriptions": "Assume the role of either Dr. Jekyll or the evil Mr. Hyde in this real time action/adventure game as Jekyll seeks to save his daughter Laurie from her kidnappers."}, {"name": "The Expendables 2 Videogame", "details_link": "https://www.metacritic.com/game/playstation-3/the-expendables-2-videogame", "publisher": "Ubisoft", "release_date": "Jul 31 2012", "developers": ["ZootFly"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Shooter", "Third-Person", "Shoot-'Em-Up", "Modern", "Top-Down"], "meta_score": 34, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/1/308955d86e91ef52f77fe179182f9c57-98.jpg", "descriptions": "Building on the universe created in the high-octane, star-studded movies, The Expendables 2 Videogame invites gamers on an adventure to rescue an extremely valuable, kidnapped billionaire. It's all business, until all hell breaks loose and the explosive mix of testosterone and keroseneBuilding on the universe created in the high-octane, star-studded movies, The Expendables 2 Videogame invites gamers on an adventure to rescue an extremely valuable, kidnapped billionaire. It's all business, until all hell breaks loose and the explosive mix of testosterone and kerosene detonates in a massive fireball that never lets up. The adventure concludes right where the new movie begins, creating a continuous story experience for fans of the Expendables' hard-boiled brand of action.… Expand"}, {"name": "David Beckham Soccer", "details_link": "https://www.metacritic.com/game/game-boy-advance/david-beckham-soccer", "publisher": "Majesco Games", "release_date": "Oct  7 2002", "developers": ["Yoyo Entertainment"], "platforms": "Game Boy Advance", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 34, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/0/fffd4d6e4d0a763260fa592301ee343e-98.jpg", "descriptions": "Developed under the watchful eye of international soccer superstar David Beckham, David Beckham Soccer offers the complete soccer experience.  The game features over 200 top international and club teams in which players compete throughout a vast array of competitions and game modes,Developed under the watchful eye of international soccer superstar David Beckham, David Beckham Soccer offers the complete soccer experience.  The game features over 200 top international and club teams in which players compete throughout a vast array of competitions and game modes, including the exclusive \"Train with Beckham\" mode.  In Training Mode, players hone their skills with a series of tests devised by David Beckham, including corner shots, shooting, passing, and free kicks.… Expand"}, {"name": "Shadow Harvest: Phantom Ops", "details_link": "https://www.metacritic.com/game/pc/shadow-harvest-phantom-ops", "publisher": "Viva Media", "release_date": "Apr  5 2011", "developers": ["Black Lion Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 34, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/0/8503970d1ede2f77bbcd5b3b603f4276-98.jpg", "descriptions": "Shadow Harvest is a highly immersive 3rd-person tactical action game set in the year 2025 on various current and future points of conflict around the globe. Featuring dual character control, amazingly realistic graphics and a refreshingly different storyline, Shadow Harvest is a completelyShadow Harvest is a highly immersive 3rd-person tactical action game set in the year 2025 on various current and future points of conflict around the globe. Featuring dual character control, amazingly realistic graphics and a refreshingly different storyline, Shadow Harvest is a completely new interpretation of the tactical-action genre. Being an ISA agent, the first character, Myra Lee, has a background in espionage and stealth operations, while the other character, Aron Alvarez, is a hard-boiled close combat specialist of US Army's Delta Force.… Expand"}, {"name": "Takedown: Red Sabre", "details_link": "https://www.metacritic.com/game/pc/takedown-red-sabre", "publisher": "505 Games", "release_date": "Sep 20 2013", "developers": ["Serellan LLC"], "platforms": ["Xbox 360", "PC"], "genres": ["Action", "Shooter", "General", "Shooter", "First-Person", "Modern", "Tactical"], "meta_score": 34, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/1/0204a3b3b6ff9eb5e5d87d102b11e3d7-98.jpg", "descriptions": "In recent years, shooters have become homogenized. There used to be a wide range of different games to choose, from run-and-gun action titles to slow-paced tactical shooters focusing on strategy and tactics, but now most shooters follow the same model of big set pieces, regenerating health,In recent years, shooters have become homogenized. There used to be a wide range of different games to choose, from run-and-gun action titles to slow-paced tactical shooters focusing on strategy and tactics, but now most shooters follow the same model of big set pieces, regenerating health, linear levels, and cinematic experiences. The realistic tactical shooters with in-depth planning have almost entirely disappeared in recent years.\r This project, working title TAKEDOWN, aims to change that. This game, the spiritual successor to games like the original Rainbow Six and SWAT series, will focus on realistic weapons modeling, squad based play, in a close-quarters battle setting. To succeed in this game you need to take things slow, study your plans, and execute flawlessly. If you get shot, there are consequences. You wont be hiding behind a wall waiting for your health to regenerate. If a team member goes down, you will have to assess the situation and reallocate team members if necessary to complete the mission. Don't expect all of the tools and plans to be forced fed to you - it is up to the player to ensure their team is equipped and ready for the tasks at hand.\r AKEDOWN is a thinking-persons shooter. The player that takes things slow, aims carefully, and plans their moves right will overcome the player who runs in with guns blazing. Close-quarters battle brings the fight inside, as you would see SWAT teams or SOF units taking down small numbers of dangerous adversaries. Non-linear environments allow for multiple routes and tactics and add replayability. The operation to clear pirates from a hijacked oil tanker by Russian special forces in May of 2010 is a perfect example of the types of missions in TAKEDOWN.\r You will plan your insertions and routes before going into the scenario, outfitting your teammates with weapons and equipment of your choosing, and then execute the mission. If one of your team members is killed, they are gone, and you have lost their valuable experience, so you have to be careful!  Gameplay modes include single player, co-op, and competitive multiplayer.\r If you are a fan of old school shooters where thinking meant more than running and gunning or perks, or if you are just looking for something different in your shooter games experience, this is the project for you.… Expand"}, {"name": "Destroy All Humans! Path of the Furon", "details_link": "https://www.metacritic.com/game/xbox-360/destroy-all-humans!-path-of-the-furon", "publisher": "THQ", "release_date": "Dec  1 2008", "developers": ["Sandblast"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 34, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/7401d49605dc0863c5a86233a138f2de-98.jpg", "descriptions": "In Destroy All Humans! Path of the Furon, players pick up where prequel \"Destroy All Humans! Big Willy Unleashed\" leaves off, controlling Crypto in the Funked out 1970's when mysterious new enemy attacks Earth, sweeping Crypto up in a conspiracy that unravels his groovy new way of life andIn Destroy All Humans! Path of the Furon, players pick up where prequel \"Destroy All Humans! Big Willy Unleashed\" leaves off, controlling Crypto in the Funked out 1970's when mysterious new enemy attacks Earth, sweeping Crypto up in a conspiracy that unravels his groovy new way of life and threatens the very survival of the Furon race. Players take Crypto on a journey of Enlightenment and Destruction as he gains new powers from an alien Kung Fu Master in order to take on his most difficult enemy yet—his own kind. Path of the Furon redefines the series for next-gen—increasing the size, scale and scope of Crypto's arsenal of alien weaponry, mental abilities and destruction. Manipulate or destroy anything in the world, creating disaster movie inspired level of destruction and mayhem. Go anywhere at anytime via an open world mission structure—Explore 5 open world environments without ever leaving the game world, or take on a variety of side missions and mini-games. Next-gen graphics, detailed destruction, new weapons, new mental abilities, expanded UFO capabilities, customized upgrades and co-op and competitive multiplayer gameplay. [THQ]… Expand"}, {"name": "The Walking Dead: Survival Instinct", "details_link": "https://www.metacritic.com/game/playstation-3/the-walking-dead-survival-instinct", "publisher": "Activision", "release_date": "Mar 19 2013", "developers": ["Terminal Reality"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Action Adventure", "Shooter", "Shooter", "Survival", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 34, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/3/854995010b2413380c99fea6548ddbc9-98.jpg", "descriptions": "Terminal Reality’s The Walking Dead video game takes the undead and brings them out of the TV show and into console gaming systems in a new, terrifying way.  The iconic walkers will relentlessly hunt down players like their television counterparts, using a combination of sight, sound andTerminal Reality’s The Walking Dead video game takes the undead and brings them out of the TV show and into console gaming systems in a new, terrifying way.  The iconic walkers will relentlessly hunt down players like their television counterparts, using a combination of sight, sound and smell.  As Daryl, players will need to tread carefully throughout each new area they explore.  Once discovered, it doesn’t take much to attract an unstoppable horde of undead walkers, so every threat needs to be assessed, and every situation analyzed.  Players will have to choose between whether to stay and fight while risking a gruesome death or using stealth to avoid the undead.  No place is truly safe for Daryl as he makes his way through the Georgia countryside in this new, post-apocalyptic world.… Expand"}, {"name": "Past Cure", "details_link": "https://www.metacritic.com/game/xbox-one/past-cure", "publisher": "Phantom 8", "release_date": "Feb 23 2018", "developers": ["Phantom 8"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Survival"], "meta_score": 34, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/b59bc9e0d704f34eb448ef7e1a7c02a3-98.jpg", "descriptions": "Past Cure is a dark psychological thriller that blurs the lines between dreams and reality. An intense, cinematic, story driven experience, blending stealth and combat gameplay. Players are challenged to use an array of skills varying from powerful time bending mental abilities to brutalPast Cure is a dark psychological thriller that blurs the lines between dreams and reality. An intense, cinematic, story driven experience, blending stealth and combat gameplay. Players are challenged to use an array of skills varying from powerful time bending mental abilities to brutal melee combat and stealth kills.After his years of torture, ex elite soldier Ian lives in the safehouse of his brother, struggling with the consequences of the military experiments he was put through. They twisted his mind, imbuedhim with preternatural mental abilities such as time control and telekinesis. Driven by hallucinations and his thirst for revenge, Ian enlists his brother's help as he sets out on a thrilling hunt for the perpetrators of the conspiracy against him, and for the truth underlying his torment. On his missions Ian experiments with his new powers, quickly coming to realize their inherent danger: with each use, his sanity frays a little more, inviting the nightmarish attention of something beyond reality.… Expand"}, {"name": "March of the Penguins", "details_link": "https://www.metacritic.com/game/ds/march-of-the-penguins", "publisher": "DSI Games", "release_date": "Nov 27 2006", "developers": ["Skyworks Technologies", "SkyRiver Studios"], "platforms": "DS", "num_players": "1 Player", "genres": ["Puzzle", "Action", "General", "General"], "meta_score": 34, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/0da774b124de6556cc011b09d05df2fc-98.jpg", "descriptions": "The critically acclaimed story of love and survival in the world's harshest environment becomes an engaging handheld game. In the video game adaptation of the Oscar-winning film \"March of the Penguins\" you'll guide loveable Emperor Penguins on their incredible journey for survival, defyingThe critically acclaimed story of love and survival in the world's harshest environment becomes an engaging handheld game. In the video game adaptation of the Oscar-winning film \"March of the Penguins\" you'll guide loveable Emperor Penguins on their incredible journey for survival, defying the elements, in the name of life and family. This \"edutainment\" quest is a learning experience starring some of the most beloved animals on Earth...and featuring some of the most dangerous predators and environments ever encountered! Over 50 levels to enjoy. Expedition log allows for re-play of levels. Classic addictive-style game play. Three additional mini-game sequences. Twelve Chapters follow the story. Realistic Antarctica settings. [DSI Games]… Expand"}, {"name": "Agony", "details_link": "https://www.metacritic.com/game/xbox-one/agony", "publisher": "PlayWay", "release_date": "May 29 2018", "developers": ["Madmind Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 34, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/6/60abcc9b85ca5fcf09a803fa16bbe620-98.jpg", "descriptions": "Agony is a first-person, survival horror set in hell. You will begin your journey as a tormented soul within the depths of hell without any memories about your past. The special ability to control people on your path, and possess demons, gives you the measures to survive."}, {"name": "Transformers: Dark of the Moon - Stealth Force Edition", "details_link": "https://www.metacritic.com/game/wii/transformers-dark-of-the-moon---stealth-force-edition", "publisher": "Activision", "release_date": "Jun 14 2011", "developers": ["Behaviour Interactive"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 34, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/9/245e23f8ad5075530a96f64b104511d5-98.jpg", "descriptions": "Transformers: Dark of the Moon thrusts players into an original storyline that takes place before the events of the film."}, {"name": "You Are Empty", "details_link": "https://www.metacritic.com/game/pc/you-are-empty", "publisher": "Atari", "release_date": "Jun  1 2007", "developers": ["Digital Spray Studios", "Mandel ArtPlains"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Arcade"], "meta_score": 34, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/23d9feb4e90f01c6db5138c0a82add27-98.jpg", "descriptions": "You Are Empty offers players an alternative approach to the history of the late fifties of the XX century. Scene of action is the Soviet Union. Leading Soviet scientists start a big experiment that alter human physiology and mentality in order to create super humans capable of buildingYou Are Empty offers players an alternative approach to the history of the late fifties of the XX century. Scene of action is the Soviet Union. Leading Soviet scientists start a big experiment that alter human physiology and mentality in order to create super humans capable of building bright future and communism all over the world. But something goes wrong... As a result the whole city, where that experiment took place, goes on a rampage. The majority of citizens died, and those who survived turned into hideous mutants - the only inhabitants of deserted streets. You Are Empty immerses you in an exaggerated dark and obscure atmosphere of Soviet totalitarianism. Fighting against mutants, that obtained super power after the experiment was carried out, the main hero tries to gain an understanding of what's happening around and save the day. [1C Company]… Expand"}, {"name": "eFootball 2022", "details_link": "https://www.metacritic.com/game/playstation-5/efootball-2022", "publisher": "Konami", "release_date": "Sep 30 2021", "developers": ["Konami"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 34, "users_score": 1.2, "image": "https://static.metacritic.com/images/products/games/4/ecd0e521515ce6f47dcd90f3c67da731-98.jpg", "descriptions": "From \"PES\" to \"eFootball™ It all began with the implacable determination to create a revolutionary soccer platform. Our ambition was to recreate the perfect soccer environment, from the grass on the field, to the players' movement, all the way to the crowds in the stadium. To this end, weFrom \"PES\" to \"eFootball™ It all began with the implacable determination to create a revolutionary soccer platform. Our ambition was to recreate the perfect soccer environment, from the grass on the field, to the players' movement, all the way to the crowds in the stadium. To this end, we decided to create a new soccer engine with a newly built animation system and revamped game commands.\rThe final result was even more impressive than we had originally conceived.\rWe went beyond the border of PES, into a new realm of virtual soccer.\rTo signal this new era, we have decided to part ways with our beloved PES brand and rename it \"eFootball™\"!\rNow we hope that you can enjoy this brand-new soccer experience that eFootball™ has to offer. [Konami]… Expand"}, {"name": "Astro Boy: The Video Game", "details_link": "https://www.metacritic.com/game/ds/astro-boy-the-video-game", "publisher": "D3Publisher", "release_date": "Oct 20 2009", "developers": ["Art"], "platforms": ["PlayStation 2", "DS"], "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 34, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/2164584cf7bf7af521a9a865d06a3c1c-98.jpg", "descriptions": "In ASTRO BOY: THE VIDEO GAME, players become the iconic hero, Astro Boy, and take to the streets and skies on an epic adventure to save Metro City from the clutches of the evil President Stone and his robot army. Utilizing Astro's entire arsenal of iconic weapons and abilities - SuperIn ASTRO BOY: THE VIDEO GAME, players become the iconic hero, Astro Boy, and take to the streets and skies on an epic adventure to save Metro City from the clutches of the evil President Stone and his robot army. Utilizing Astro's entire arsenal of iconic weapons and abilities - Super Strength, Flight, Arm Cannons, Butt Machine Guns and Drill Attacks - players battle hordes of robot enemies and colossal bosses including some never-before-seen enemies across Metro City and the mysterious Surface. Using an intuitive combat system that adds depth to gameplay, players experience classic platform action and exhilarating combat levels as they use Astro’s unique rocket boosters to hover, avoid enemies and zip out of the way of danger. [D3Publisher]… Expand"}, {"name": "Bomberman: Act Zero", "details_link": "https://www.metacritic.com/game/xbox-360/bomberman-act-zero", "publisher": "Konami", "release_date": "Aug 29 2006", "developers": ["Hudson"], "platforms": "Xbox 360", "num_players": "Up to 8 ", "genres": ["Miscellaneous", "Puzzle", "Action", "General", "Puzzle", "Action"], "meta_score": 34, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/4/7c470937067a1ce8483d6c46dcca9a1f-98.jpg", "descriptions": "Deep within an experimental underground facility, humans are imprisoned as test subjects and trained to become soldiers. Equipped with armored battle suits, the subjects must fight for survival and eliminate each other to determine who will become the Ultimate Human Weapon. As Bomberman,Deep within an experimental underground facility, humans are imprisoned as test subjects and trained to become soldiers. Equipped with armored battle suits, the subjects must fight for survival and eliminate each other to determine who will become the Ultimate Human Weapon. As Bomberman, your objective is simple: destroy your opponents before they destroy you. Survive through 99 stages as you try to escape to the surface. Scramble for hidden items including speed, bomb, and armor power ups. Evade looming bomb blasts from a new tension-filled perspective. Choose from the classic one-hit, one-kill gameplay style, or utilize a new life bar and item system for a more aggressive gameplay style. Earn multiple achievements in single and multi-player modes to increase your Gamer Score. Up to 8 players can engage in frantic battles for survival online through Xbox Live and earn points to become the ultimate weapon on the World Rankings. [Konami]… Expand"}, {"name": "Fantasy Hero: Unsigned Legacy", "details_link": "https://www.metacritic.com/game/switch/fantasy-hero-unsigned-legacy", "publisher": "Arc System Works", "release_date": "Jan 25 2018", "developers": ["Arc System Works"], "platforms": ["PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 34, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/3/6a9193c64ff4f95a54958f8e63e2d36b-98.jpg", "descriptions": "Save the world in \"Fantasy Hero -Unsigned Legacy-\", by choosing from one of four heroes, and reclaiming what was lost to the Decoders. Set yourself on fire and charge head in, or pulverize them with powerful throws. Like keeping a safe distance from your opponents? Then, pick them off withSave the world in \"Fantasy Hero -Unsigned Legacy-\", by choosing from one of four heroes, and reclaiming what was lost to the Decoders. Set yourself on fire and charge head in, or pulverize them with powerful throws. Like keeping a safe distance from your opponents? Then, pick them off with projectiles, or send your robot in to do your bidding. The variety of combat styles and skills will let players build heroes to their liking. [Nintendo]\r… Expand"}, {"name": "The Shield: The Game", "details_link": "https://www.metacritic.com/game/pc/the-shield-the-game", "publisher": "Aspyr", "release_date": "Jan 22 2007", "developers": ["Point of View"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 34, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/6/4087e6a3d93e914bfadd12b34f03357a-98.jpg", "descriptions": "Sammy Studios and Point Of View capture the look, feel, and authenticity of \"The Shield\" television series in a 3rd-person action game. Never-before-seen gameplay elements create the first true-to-life police action game, and moments taken directly from the series immerse players in theSammy Studios and Point Of View capture the look, feel, and authenticity of \"The Shield\" television series in a 3rd-person action game. Never-before-seen gameplay elements create the first true-to-life police action game, and moments taken directly from the series immerse players in the disturbing Farmington underworld now recognized by millions as Vic Mackey's universe. Players control Vic in a living, breathing Farmington, engaging in perilous assignments ranging from busting crack dens to thwarting bank robberies. Much like the series, Vic and the Strike Team delve into the grayest areas of the law, fighting a war on crime where the ends justify the means. In addition to the raw action that undergirds the gameplay, players employ tactics used by Vic on the show, including intimidating suspects, employing brute force, accepting and offering bribes and planting incriminating evidence. The game also lets players choose between the right and wrong side of the law, with Vic walking a thin line while trying to accomplish missions, maintain the respect of his men, keep his politically ambitious police captain happy, pad his retirement fund and, above all, avoid Internal Affairs. [Sammy Studios]… Expand"}, {"name": "Girl Fight", "details_link": "https://www.metacritic.com/game/xbox-360/girl-fight", "publisher": "Majesco Games", "release_date": "Sep 25 2013", "developers": ["MicroProse", "Kung Fu Factory"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 34, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/a4d756df5b58eae8e9b3f41e360bd52e-98.jpg", "descriptions": "Published by Majesco Entertainment, Girl Fight allows players to choose from an array of sexy fighters to battle their way out of THE FOUNDATION, a shadowy, scientific organization looking to weaponize the psionic fighting abilities of the cast of gorgeous, all-female fighters. WithPublished by Majesco Entertainment, Girl Fight allows players to choose from an array of sexy fighters to battle their way out of THE FOUNDATION, a shadowy, scientific organization looking to weaponize the psionic fighting abilities of the cast of gorgeous, all-female fighters. With unlimited funding and no moral or ethical compass, THE FOUNDATION collects its test subjects from all around the world, often abducting and plugging women into their virtual construct known as The Mainframe. To make it back to reality, the women must utilize their fighting and psionic abilities in an all-out battle for survival.… Expand"}, {"name": "Fast & Furious Crossroads", "details_link": "https://www.metacritic.com/game/pc/fast-furious-crossroads", "publisher": "Bandai Namco Games", "release_date": "Aug  7 2020", "developers": ["Slightly Mad Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 9 ", "genres": ["Action Adventure", "Racing", "Simulation", "Arcade", "Linear", "Automobile"], "meta_score": 34, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/2/83d3c6d57f353d22407b36118e962945-98.jpg", "descriptions": "Gear up for an epic new chapter in the Fast & Furious saga with high-speed heists, cinematic nonstop action, and adrenaline-fueled stunts in exotic locations."}, {"name": "McFarlane's Evil Prophecy", "details_link": "https://www.metacritic.com/game/playstation-2/mcfarlanes-evil-prophecy", "publisher": "Konami", "release_date": "Jun 15 2004", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "General"], "meta_score": 34, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/3/729e3f27c0a3f329319a69b3dc658a25-98.jpg", "descriptions": "Set in the 19th century, McFarlane's Evil Prophecy allows players to control a party of four unique monster-hunters with different fighting abilities. To fight through hordes of evil creatures, players can use all types of attack methods, including magic attacks and melee weapons. InSet in the 19th century, McFarlane's Evil Prophecy allows players to control a party of four unique monster-hunters with different fighting abilities. To fight through hordes of evil creatures, players can use all types of attack methods, including magic attacks and melee weapons. In addition, players can even combine abilities for even more devastating damage. Hunt down the six great Monsters and their evil minions to save the world! Real time, intense and addictive party-based melee combat. Features McFarlane-designed player-characters and Monsters. 2-4 Player Multiplayer Mode for exciting co-op style gameplay. Exclusive McFarlane artwork and interviews. [Konami]… Expand"}, {"name": "Chicago Enforcer", "details_link": "https://www.metacritic.com/game/xbox/chicago-enforcer", "publisher": "Kemco", "release_date": "Feb 23 2005", "developers": ["Touchdown Entertainment"], "platforms": "Xbox", "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 33, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/1/821e6f4eac4a6ca66df65e44f7e47235-98.jpg", "descriptions": "Take to the streets of Chicago as one of Al Capone's notorious enforcers. Choose from a variety of authentic gangster weapons and make your opposition an offer they can't refuse. You'll need these weapons, along with your character's special moves, to survive intense action scenarios such asTake to the streets of Chicago as one of Al Capone's notorious enforcers. Choose from a variety of authentic gangster weapons and make your opposition an offer they can't refuse. You'll need these weapons, along with your character's special moves, to survive intense action scenarios such as bombing rival breweries or saving Capone himself. In addition to single-player missions, Chicago Enforcer features multiplayer modes that support up to eight players via Xbox Live.… Expand"}, {"name": "Shrek: Super Party", "details_link": "https://www.metacritic.com/game/xbox/shrek-super-party", "publisher": "TDK Mediactive", "release_date": "Nov 29 2002", "developers": ["Mass Media"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 33, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/29ef256b63499541b1af8ac707e0b2f6-98.jpg", "descriptions": "Your favorite characters from the movie Shrek now star in an interactive board game. Shrek: Super Party lets you select characters from the movie--including Shrek, Princess Fiona, Lord Farquaad, Donkey, Monsieur Hood, and Thelonius--to battle three of your friends in 30 action-packedYour favorite characters from the movie Shrek now star in an interactive board game. Shrek: Super Party lets you select characters from the movie--including Shrek, Princess Fiona, Lord Farquaad, Donkey, Monsieur Hood, and Thelonius--to battle three of your friends in 30 action-packed minigames. In each game you can earn bug juice, and the first player who earns 100 drops of bug juice wins. Swap bugs, form alliances, or play dirty--but just do whatever you can to gain the competitive edge. … Expand"}, {"name": "AMY", "details_link": "https://www.metacritic.com/game/playstation-3/amy", "publisher": "Lexis Numerique", "release_date": "Jan 17 2012", "developers": ["Lexis Numerique"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 33, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/3/f2320cba640f7339ea5e9d0635ee1921-98.jpg", "descriptions": "AMY is a survival horror/action adventure game, where players must protect, and escort the eponymous Amy - an enigmatic eight-year-old autistic girl with curious powers - as they try to get her out of a city overrun with wild creatures and dangerous enemies. The story follows Amy and theAMY is a survival horror/action adventure game, where players must protect, and escort the eponymous Amy - an enigmatic eight-year-old autistic girl with curious powers - as they try to get her out of a city overrun with wild creatures and dangerous enemies. The story follows Amy and the player character Lana, a woman who is trying to protect and save her in the disease-ridden town. They must work together to fight or flee from the aberrations, demons, and the military, in the hope of saving not only each other, but also the future of humanity itself.… Expand"}, {"name": "Kick-Ass: The Game", "details_link": "https://www.metacritic.com/game/playstation-3/kick-ass-the-game", "publisher": "WHA Entertainment", "release_date": "Apr 29 2010", "developers": ["Frozen Codebase"], "platforms": ["iPhone/iPad", "PlayStation 3"], "genres": ["Action", "Adventure", "Fighting", "General", "Fighting", "3D", "3D"], "meta_score": 33, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/9/aabeb26be3b5c3ca0417e17d7f18a672-98.jpg", "descriptions": "[Playstation Network]  Kick-Ass is a fully 3D action fighting game set in the third-person perspective, where the player can play and control modern day super heroes based on the storyline of the movie.  Gamers will be able to play as the three primary characters in the film - Kick-Ass, Hit[Playstation Network]  Kick-Ass is a fully 3D action fighting game set in the third-person perspective, where the player can play and control modern day super heroes based on the storyline of the movie.  Gamers will be able to play as the three primary characters in the film - Kick-Ass, Hit Girl, and Big Daddy. The story-driven game draws heavily from the strengths of the intellectual property; an action combat game where the characters finally grow sick of the crime around them, and decide that they will do something about it.… Expand"}, {"name": "Superman Returns", "details_link": "https://www.metacritic.com/game/ds/superman-returns", "publisher": "EA Games", "release_date": "Nov 20 2006", "developers": ["EA Tiburon"], "platforms": ["Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "Beat-'Em-Up", "Open-World", "2D"], "meta_score": 33, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/c1155370fb7530cb8cbfb76469aee4cd-98.jpg", "descriptions": "True to the fiction in every respect, this is the game based on the Superman universe that fans have been anticipating for decades. From excited citizens to the traffic on the streets, every detail of this vibrant city has a mind of its own. These 80 square miles are brought to life for theTrue to the fiction in every respect, this is the game based on the Superman universe that fans have been anticipating for decades. From excited citizens to the traffic on the streets, every detail of this vibrant city has a mind of its own. These 80 square miles are brought to life for the first time in a videogame. Go anywhere and do anything in Metropolis as Superman. Non-linear gameplay allows you to explore and play the game exactly how you want to at your own pace. Where and how you fly – to the top of skyscrapers, dodging elevated trains – is completely up to you, since gameplay is designed as a true open world experience. With notorious villains like Metallo and colossal challenges only Superman can overcome, you must navigate the Man of Steel to monitor and protect Metropolis from destruction. Three distinct types of gameplay — Flying, Rescue, and Combat — will keep the action constant and the challenges relentless. Play both film-inspired missions as well as original content created exclusively for the videogame. Graphics, sound, and gameplay have been taken to the next level to create a Metropolis like you've never seen it, with three dimensional sound, a complete orchestra soundtrack, and Oscar-wining sound designer. [Electronic Arts]… Expand"}, {"name": "The Incredible Hulk", "details_link": "https://www.metacritic.com/game/pc/the-incredible-hulk", "publisher": "Sega", "release_date": "Jun 10 2008", "developers": ["Edge of Reality"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 33, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/9/f44ef80bc3336bd193a3eb6aeba04768-98.jpg", "descriptions": "Fast-paced and action-packed, the blockbuster franchise and comic book saga unfolds for the first time on next-generation platforms, as Banner scours the planet trying to find anything to help him fight his involuntary rage. Take the role of one of Marvel's most powerful Super Heroes in TheFast-paced and action-packed, the blockbuster franchise and comic book saga unfolds for the first time on next-generation platforms, as Banner scours the planet trying to find anything to help him fight his involuntary rage. Take the role of one of Marvel's most powerful Super Heroes in The Incredible Hulk, a third-person action video game. Gamers can demolish anything in their path, including lampposts, passing cars and even buildings. The fury-fueled game also features key moments from the film, as well as additional plotlines and characters from The Incredible Hulk universe. Players crash through New York City, battling gigantic enemies amidst soaring skyscrapers in a massive open world. [Sega]… Expand"}, {"name": "Mike Tyson Heavyweight Boxing", "details_link": "https://www.metacritic.com/game/playstation-2/mike-tyson-heavyweight-boxing", "publisher": "Codemasters", "release_date": "Jun 23 2002", "developers": ["Codemasters"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 33, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/7/d989ac36eb4bf94fbdb5ba68e1afbfc7-98.jpg", "descriptions": "Rain the hurt on your enemy with over 600 brutal power punches, illegal moves, signature blows and combos. Take your opponent apart through 9 separate game modes - Belt Mode, Speed Boxing, Exhibition Mode and more. Fight in 20 international arenas including Carnival City, Caesars Palace &Rain the hurt on your enemy with over 600 brutal power punches, illegal moves, signature blows and combos. Take your opponent apart through 9 separate game modes - Belt Mode, Speed Boxing, Exhibition Mode and more. Fight in 20 international arenas including Carnival City, Caesars Palace & Wembley Arena. Create unique custom fighters then upgrade them with over 185 unlockable improvements. Also features the Polymorphic & Interpolative Node-mapping facial damage engine. [Codemasters]… Expand"}, {"name": "Farming Simulator", "details_link": "https://www.metacritic.com/game/xbox-360/farming-simulator", "publisher": "Focus Home Interactive", "release_date": "Nov 19 2013", "developers": ["Giants Software"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General", "Virtual", "Career"], "meta_score": 33, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/b232945230e9249410e68991ed452acf-98.jpg", "descriptions": "Farming Simulator 2013 keeps all the ingredients that make the staple of virtual farming, while incorporating many new machines, vehicles, crops, animals, and environments. Farming Simulator 2013 features equipment from the top 20 vehicle manufacturers. Dozens of new machines have foundFarming Simulator 2013 keeps all the ingredients that make the staple of virtual farming, while incorporating many new machines, vehicles, crops, animals, and environments. Farming Simulator 2013 features equipment from the top 20 vehicle manufacturers. Dozens of new machines have found their way into the game, such as the notable brand Case IH, as well as some gigantic farming machines, soon to be unveiled at Gamescom Cologne. … Expand"}, {"name": "X Rebirth", "details_link": "https://www.metacritic.com/game/pc/x-rebirth", "publisher": "Deep Silver", "release_date": "Nov 15 2013", "developers": ["Egosoft"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Space", "Large Spaceship", "Large Spaceship", "Civilian"], "meta_score": 33, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/4/66967511243fa5bc45a099d6a1f56bc2-98.jpg", "descriptions": "In the distant future, the X universe faces a period of profound and irrevocable change. While the universe stumbles towards an uncertain future, countless adventures await as new enemies rise in search of power. Enter a young adventurer and his unlikely female ally traveling in an old,In the distant future, the X universe faces a period of profound and irrevocable change. While the universe stumbles towards an uncertain future, countless adventures await as new enemies rise in search of power. Enter a young adventurer and his unlikely female ally traveling in an old, battered ship with a glorious past - two people alone against the galaxy, playing a key part in the events to come. The fate of the universe rests in the hands of the player...… Expand"}, {"name": "Dawn of Fear", "details_link": "https://www.metacritic.com/game/playstation-4/dawn-of-fear", "publisher": "Gammera Nest", "release_date": "Feb  3 2020", "developers": ["Brok3nsite"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 33, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/1/2ed706f19248e781d17feaddb5fdede3-98.jpg", "descriptions": "When Alex returns to his childhood home after a tragedy, what he finds is a world of madness and cruelty from which he does not know if he can escape. Help Alex survive by using logic to solve puzzles, manage your ammo, and avoid being dragged by the horror that permeates the house. Do you dare?"}, {"name": "Van Helsing", "details_link": "https://www.metacritic.com/game/game-boy-advance/van-helsing", "publisher": "VU Games", "release_date": "May  6 2004", "developers": ["Saffire"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 33, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/f9dbe888fe4ca070e61583f6805bc23b-98.jpg", "descriptions": "Deep within the mysterious land of Transylvania, monsters that inhabit man's deepest nightmares take form. One man's destiny--and curse--is to vanquish evil and destroy the lethal and powerful Count Dracula. Descend into the murky depths of the Carpathian Mountains as legendary monsterDeep within the mysterious land of Transylvania, monsters that inhabit man's deepest nightmares take form. One man's destiny--and curse--is to vanquish evil and destroy the lethal and powerful Count Dracula. Descend into the murky depths of the Carpathian Mountains as legendary monster hunter Van Helsing. As Van Helsing, you'll battle Dracula, The Frankenstein Monster, The Wolf Man, and other fiendish creatures with an array of deadly weapons and special abilities.… Expand"}, {"name": "Yu Yu Hakusho: Spirit Detective", "details_link": "https://www.metacritic.com/game/game-boy-advance/yu-yu-hakusho-spirit-detective", "publisher": "Atari", "release_date": "Dec  2 2003", "developers": ["Sensory Sweep"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 33, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/94e5cd003a5cd5df6714498623177366-98.jpg", "descriptions": "Yu Yu Hakusho tells the story of Yusuke Urameshi, a character who battles evil in both the living and spirit worlds. In Spirit Detective, you'll guide Yusuke through various adventures taken from the animated TV series. The game chronicles the first third of the hero's 112-episode journey.Yu Yu Hakusho tells the story of Yusuke Urameshi, a character who battles evil in both the living and spirit worlds. In Spirit Detective, you'll guide Yusuke through various adventures taken from the animated TV series. The game chronicles the first third of the hero's 112-episode journey. As any one of six characters, you'll battle evil enemies with signature attacks and weapons. Journey through the spirit world, conquer Yusuke's enemies, and master each quest to become a true spirit detective.… Expand"}, {"name": "Demonworld: Dark Armies", "details_link": "https://www.metacritic.com/game/pc/demonworld-dark-armies", "publisher": "Xicat Interactive", "release_date": "Jan 13 2002", "developers": ["Ikarion"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 33, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/baaf6471843ea4b0a51077d49764244b-98.jpg", "descriptions": "The hordes of the Underworld are coming to a village near you. Your mission is to stop these evil beings from taking over the world as you know it. You and your friends will need to use every trick in the book to repel these vicious monsters. You will use the most advance weapons of the 11thThe hordes of the Underworld are coming to a village near you. Your mission is to stop these evil beings from taking over the world as you know it. You and your friends will need to use every trick in the book to repel these vicious monsters. You will use the most advance weapons of the 11th century to turn sure defeat into serious victories. [Xicat Interactive]… Expand"}, {"name": "Dragon Booster", "details_link": "https://www.metacritic.com/game/ds/dragon-booster", "publisher": "Konami", "release_date": "Dec  7 2005", "developers": ["Konami Computer Entertainment Hawaii"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Rail", "Rail"], "meta_score": 33, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/0a31e872ff0b8ef7b11858b36157ab6e-98.jpg", "descriptions": "Based on the popular animated series airing on ABC Family and Toon Disney, Dragon Booster is a fast paced 3rd person racing/action game set in a fantastical world where humans and dragons co-exist. When their peaceful way of life is disrupted, Beau, a legendary dragon, chooses Artha Penn, anBased on the popular animated series airing on ABC Family and Toon Disney, Dragon Booster is a fast paced 3rd person racing/action game set in a fantastical world where humans and dragons co-exist. When their peaceful way of life is disrupted, Beau, a legendary dragon, chooses Artha Penn, an ordinary 16-year old, to become a mythical hero known as the Dragon Booster. In this classic tale of good versus evil, Artha must use his new-found abilities to defeat his foes and unite humans and dragons once and for all. [Konami]… Expand"}, {"name": "Call of Duty: Black Ops Declassified", "details_link": "https://www.metacritic.com/game/playstation-vita/call-of-duty-black-ops-declassified", "publisher": "Activision", "release_date": "Nov 13 2012", "developers": ["Nihilistic"], "platforms": "PlayStation Vita", "num_players": "Up to 8 ", "genres": ["Shooter", "Modern", "Action", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 33, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/3c61ba028e9557111f429593184f9e6c-98.jpg", "descriptions": "Call of Duty: Black Ops Declassified explores original fiction in the Call of Duty Black Ops universe with an all-new campaign of Special Ops missions."}, {"name": "Mistmare", "details_link": "https://www.metacritic.com/game/pc/mistmare", "publisher": "Strategy First", "release_date": "Jun 30 2003", "developers": ["Arxel Tribe"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 33, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/902a97f88f7d9c5954d59768503ee9e6-98.jpg", "descriptions": "Isador, the inquisitor monk, is fighting his way across Europe, searching for a murderer the church has deemed the antichrist. But more than just cloudy skies stand in his way and the dense fog that protects the nation has become a Mistmare to be reckoned with. Mistmare is an addictive mixIsador, the inquisitor monk, is fighting his way across Europe, searching for a murderer the church has deemed the antichrist. But more than just cloudy skies stand in his way and the dense fog that protects the nation has become a Mistmare to be reckoned with. Mistmare is an addictive mix of action, adventure and RPG elements, shrouded in a veil of fog and excitement. Isador, a young monk, has been sent on a journey by the Church to find the leader of the Harvesters, a radical sect that is threatening the Church?s attempts at shielding Europe from the spread of the plague. Use an incredible arsenal of weapons and tools to fight off monsters and enemies as you search for the Harvesters and fight to protect Europe. [Strategy First]… Expand"}, {"name": "Mortal Kombat Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/mortal-kombat-advance", "publisher": "Midway", "release_date": "Dec 12 2001", "developers": ["Virtucraft"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 33, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/1/58781e1a9496f853caaf42ca958e8883-98.jpg", "descriptions": "Prepare for the fight of your life as you enter Mortal Kombat Advance™ and discover what awaits you."}, {"name": "Mobile Suit Gundam: Crossfire", "details_link": "https://www.metacritic.com/game/playstation-3/mobile-suit-gundam-crossfire", "publisher": "Namco Bandai Games America", "release_date": "Nov 13 2006", "developers": ["Bec"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 33, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/fdf79a6d55b3a4b25f2c89edd9548b7c-98.jpg", "descriptions": "(Also known as \"Mobile Suit Gundam: Target in Sight\")  Featuring a variety of Mobile Suits from the Gundam franchise, Mobile Suit Gundam sets players in the latter stages of The One Year War. Players will have the opportunity to be a commander of their own Mobile Suit battalion for either(Also known as \"Mobile Suit Gundam: Target in Sight\")  Featuring a variety of Mobile Suits from the Gundam franchise, Mobile Suit Gundam sets players in the latter stages of The One Year War. Players will have the opportunity to be a commander of their own Mobile Suit battalion for either the Federation or Zeon Mobile Suit Assault Force. As players move through the ranks, they will be able to gain access to new Mobile Suits and engage in battles with more capable pilots at their command. With a battalion at their disposal, players face a number of strategic options to choose from. In order to succeed, it will be vital for players to know about specific destructible parts on Mobile Suits, vulnerable enemy facilities and whether or not to engage enemies with either short or long range combat. Teamwork is also be a key component to the survival of every mission.  If players are successful, their chosen allegiance could be the turning point for the war in Mobile Suit Gundam. [Namco Bandai Games]… Expand"}, {"name": "DreamWorks Megamind: Ultimate Showdown", "details_link": "https://www.metacritic.com/game/xbox-360/dreamworks-megamind-ultimate-showdown", "publisher": "THQ", "release_date": "Nov  2 2010", "developers": ["THQ Australia", "THQ Studio Australia"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Adventure", "General", "General", "General", "Platformer", "3D"], "meta_score": 33, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/93eb104a8984e9149e78b395426ae7ea-98.jpg", "descriptions": "Just as Megamind has become our new Mega Hero, a sudden crime wave hits the city. The Doom Syndicate & their Doom Goons have emerged and are looking to take over! Only Megamind and his arsenal of gadgets can stop them!"}, {"name": "Target: Terror", "details_link": "https://www.metacritic.com/game/wii/target-terror", "publisher": "Konami", "release_date": "Apr 22 2008", "developers": ["Leviathan Games"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 33, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/5/737b763392d18b91542682f5db5c6a29-98.jpg", "descriptions": "Originally an arcade game created by legendary designer Eugene Jarvis (Defender, Robotron: 2084, and Cruis’n series), Target: Terror puts you in the place of an elite anti-terrorist agent who is charged with protecting the U.S. from all terrorist activities. With a full scale assaultOriginally an arcade game created by legendary designer Eugene Jarvis (Defender, Robotron: 2084, and Cruis’n series), Target: Terror puts you in the place of an elite anti-terrorist agent who is charged with protecting the U.S. from all terrorist activities. With a full scale assault spanning the entire U.S., this is your chance to show terrorists who is in charge. Eliminate the seemingly endless waves of enemies with an assortment of high-tech weapons you have in your arsenal. Utilizing the motion sensing controls of the Wii Remote, there is a seamless transition of the arcade’s light gun to the Wii. The arcade experience is enhanced when used with the Wii Zapper peripheral to provide total immersion in the game by replicating both the arcade light-gun as well as the elite, tactical weapons used by that anti-terrorist agent. [Konami]… Expand"}, {"name": "Iron Man", "details_link": "https://www.metacritic.com/game/pc/iron-man", "publisher": "Sega", "release_date": "May  6 2008", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 32, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/8/91ab25d3be2363908fd125eb8ce5d677-98.jpg", "descriptions": "Iron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in IronIron Man, an explosive third-person action shooter game that pits one of the world's most renowned Super Heroes against unspeakable odds, draws its story from the upcoming movie while also incorporating story elements from original Iron Man comic books. Using the advanced technology in Iron Man's suits of armour, gamers can take advantage of the wide array of high-impact weapons to strategically annihilate any enemy force standing in their way. Before tackling stunning and immense open battlefields, players can customise their armour suit as they encounter progressively more vicious enemies, and fight in epic battles that could challenge even the toughest Super Heroes. [Sega]… Expand"}, {"name": "Bruce Lee: Quest of the Dragon", "details_link": "https://www.metacritic.com/game/xbox/bruce-lee-quest-of-the-dragon", "publisher": "Universal Interactive", "release_date": "Jul  1 2002", "developers": ["Ronin Entertainment"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 32, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/1/dd017670e6f313fc6bff7a728ee2821a-98.jpg", "descriptions": "You are Bruce Lee, legendary martial arts master. Your father has been kidnapped, your monastery desecrated, and the mystical Golden Relic - keeper of the ancient martial arts secrets - has been stolen. Investigate the mysterious Black Lotus crime organization and the beautiful and deadlyYou are Bruce Lee, legendary martial arts master. Your father has been kidnapped, your monastery desecrated, and the mystical Golden Relic - keeper of the ancient martial arts secrets - has been stolen. Investigate the mysterious Black Lotus crime organization and the beautiful and deadly Dragon Lady. Use your mastery of Jeet Kune Do to punch, kick, block and combo as you fight hordes of thugs and crime bosses. In this compelling blend of epic adventure and intense fighting action you finally get the chance to be Bruce Lee.… Expand"}, {"name": "Rekoil", "details_link": "https://www.metacritic.com/game/pc/rekoil", "publisher": "505 Games", "release_date": "Jan 28 2014", "developers": ["Plastic Piranha"], "platforms": ["Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 32, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/7/02394aa6100465f36e55080204ba3ce2-98.jpg", "descriptions": "Rekoil is a multiplayer first person shooter in which the downtrodden \"Minutemen\" are pitted against their oppressors, Darkwater Inc, in a world where the only goal is to survive the unrelenting pandemic that has swept across the globe."}, {"name": "Zombeer", "details_link": "https://www.metacritic.com/game/pc/zombeer", "publisher": "U&I Entertainment", "release_date": "Jan 30 2015", "developers": ["Moonbite Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 32, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/b4c750c725eeb239f08fbb5b58cfde6d-98.jpg", "descriptions": "In the not-so-distant (and some may say, lucky) future, there will be a pandemic transforming the world’s population into zombies. That is not the lucky part – this is: Once bitten by a zombie, the only way to stave off the infection is drinking beer."}, {"name": "Women's Volleyball Championship", "details_link": "https://www.metacritic.com/game/playstation-2/womens-volleyball-championship", "publisher": "Agetec Inc.", "release_date": "Jul 29 2008", "developers": ["Spike"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Volleyball"], "meta_score": 32, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/edf5ce08f792110f4c3e9344747ec2eb-98.jpg", "descriptions": "Women's Volleyball Championship features six venues from around the world. It's as fast-paced and grueling as the real thing, and perfectly captures the passion and excitement of the sport. Play as one of twelve countries battling their way to the top of the ranks, or create your own team ofWomen's Volleyball Championship features six venues from around the world. It's as fast-paced and grueling as the real thing, and perfectly captures the passion and excitement of the sport. Play as one of twelve countries battling their way to the top of the ranks, or create your own team of pros to take on the rest. A key feature in Women's Volleyball is players get a chance to create and train their own team. If players want their volleyball players to have certain qualities, this game allows them to customize their players to their liking. Another feature of the game is that the volleyball players are affected by real life conditions like exhaustion and dominant hand, adding an unprecedented level of realism to the game. [Agetec, Inc.]… Expand"}, {"name": "MTV's Celebrity Deathmatch", "details_link": "https://www.metacritic.com/game/playstation-2/mtvs-celebrity-deathmatch", "publisher": "Gotham Games", "release_date": "Oct 14 2003", "developers": ["Big Ape Productions"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 32, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/7/784ee48581a8b457c7cba61430492dcb-98.jpg", "descriptions": "Finally take control of MTV's Celebrity Deathmatch and play as any one of over 20 celebrities to rumble in some of the greatest battles in the ring. Announcers Nick Diamond and Johnny Gomez provide color commentary as you rock in this first rate bloodbath coming to consoles this Spring.Finally take control of MTV's Celebrity Deathmatch and play as any one of over 20 celebrities to rumble in some of the greatest battles in the ring. Announcers Nick Diamond and Johnny Gomez provide color commentary as you rock in this first rate bloodbath coming to consoles this Spring. Episode Mode: Choose one of three different character match-ups. Nick and Johnny provide pre, post, and play-by-play commentary. Over 20 celebrities to choose from including, some never before seen in the TV show. Other characters are also available from show specials. Original show hosts Nick Diamond and Johnny Gomez provide color commentary while ref Mills Lane calls the shots. [Gotham Games]… Expand"}, {"name": "Weeping Doll", "details_link": "https://www.metacritic.com/game/playstation-4/weeping-doll", "publisher": "Oasis Games", "release_date": "Oct 27 2016", "developers": ["TianShe Media"], "platforms": "PlayStation 4", "genres": ["Adventure", "General"], "meta_score": 32, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/3/df9c41ef9f0f632dd9c56f66b7d96189-98.jpg", "descriptions": "An ordinary family. A beautiful home. But, who’s crying? Search the home, scour every room and scrutinize over every detail to piece together the story that has been kept locked away… [Playstation.com]"}, {"name": "Land of the Dead: Road to Fiddler's Green", "details_link": "https://www.metacritic.com/game/xbox/land-of-the-dead-road-to-fiddlers-green", "publisher": "Groove Games", "release_date": "Oct 26 2005", "developers": ["Brainbox Games"], "platforms": ["PC", "Xbox"], "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 32, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/0db6ac82ba597a1241159e564cfe4d28-98.jpg", "descriptions": "Prepare for the Horror... A horrific plague breaks out and mobs of zombies are roaming throughout the tri-state area, killing people at random. You play Jack, a simple farmer who must rise beyond fear, and battle your way through hordes of terrifying undead who are bent on spreading thePrepare for the Horror... A horrific plague breaks out and mobs of zombies are roaming throughout the tri-state area, killing people at random. You play Jack, a simple farmer who must rise beyond fear, and battle your way through hordes of terrifying undead who are bent on spreading the zombie plague. You encounter a mysterious man named Mr. Kaufman who has established Fiddler's Green, a fortified city, which holds the last of the living. He has offered you a special job, with an exceptional reward. An offer too good to turn down, but will you live long enough to reap the rewards? Based on the George A. Romero film, \"Land of the Dead.\"… Expand"}, {"name": "Escape Dead Island", "details_link": "https://www.metacritic.com/game/xbox-360/escape-dead-island", "publisher": "Deep Silver", "release_date": "Nov 18 2014", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "Third-Person", "Modern"], "meta_score": 32, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/3/0b75aa5a680f740c9f70ee55e84c4be9-98.jpg", "descriptions": "Assume the role of Cliff Calo, the offspring of a media mogul, who is in search of the truth behind the events of Banoi. Unlike other Dead Island characters you may have taken control of, Cliff is not immune to the virus. You must approach zombies more strategically if you want to navigateAssume the role of Cliff Calo, the offspring of a media mogul, who is in search of the truth behind the events of Banoi. Unlike other Dead Island characters you may have taken control of, Cliff is not immune to the virus. You must approach zombies more strategically if you want to navigate the island of Narapela and uncover the mysteries behind the virus. Or, as they say, get your ass handed to you. If fighting zombies without immunity wasn’t difficult enough, Cliff is also fighting to keep his sanity.… Expand"}, {"name": "Sonic Boom: Rise of Lyric", "details_link": "https://www.metacritic.com/game/wii-u/sonic-boom-rise-of-lyric", "publisher": "Sega", "release_date": "Nov 11 2014", "developers": ["Big Red Button Entertainment"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Platformer", "3D"], "meta_score": 32, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/3/5161657f114122aaf249d587d89d63b2-98.jpg", "descriptions": "In Sonic Boom: Rise of Lyric, Sonic, Tails, Knuckles, and Amy must work together as they face the deadly snake-like ancient villain, Lyric and his army of war mongering robots as they rise from deep within their home island. Sonic and his team will navigate the world like never before;In Sonic Boom: Rise of Lyric, Sonic, Tails, Knuckles, and Amy must work together as they face the deadly snake-like ancient villain, Lyric and his army of war mongering robots as they rise from deep within their home island. Sonic and his team will navigate the world like never before; racing across ancient ruins, through the depths of the ocean and even back in time to save the world from Lyric’s evil plan. With an emphasis on collaboration, the roles of Tails, Knuckles and Amy, will be elevated in gameplay that capitalizes on each character’s unique talents and abilities.… Expand"}, {"name": "Gene Rain", "details_link": "https://www.metacritic.com/game/xbox-one/gene-rain", "publisher": "Deeli network", "release_date": "Jul 31 2018", "developers": ["Deeli network"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 32, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/9/3d53bab9f57b28fc0c136c75236625ef-98.jpg", "descriptions": "Gene Rain is a 3D third-person shooter game that follows the story of New Humans. Employing a linear storytelling narrative and next-gen metal art style, it offers an adventure into a never-before-seen world."}, {"name": "Giana Sisters: Dream Runners", "details_link": "https://www.metacritic.com/game/xbox-one/giana-sisters-dream-runners", "publisher": "EuroVideo Medien", "release_date": "Aug 19 2015", "developers": ["Black Forest Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 32, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/54cd38cf7e12d81d91885747c6b930e0-98.jpg", "descriptions": "In Giana Sisters: Dream Runners, Giana competes with herself. But now she’s not only cute and punk… there’s more. Two more to be exact."}, {"name": "Best of Tests DS", "details_link": "https://www.metacritic.com/game/ds/best-of-tests-ds", "publisher": "Conspiracy Entertainment", "release_date": "Mar  4 2008", "developers": ["Otaboo"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 32, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/3c3a09ffd6956fbbf126476fcceafa6b-98.jpg", "descriptions": "Logic, observation, memory, speed of perception and analysis: these are the qualities that define the famous Intelligence Quotient Test and these same skills will be challenged in Best of Tests for the Nintendo DS. Not only does the game challenge the skills of the player, it also aims toLogic, observation, memory, speed of perception and analysis: these are the qualities that define the famous Intelligence Quotient Test and these same skills will be challenged in Best of Tests for the Nintendo DS. Not only does the game challenge the skills of the player, it also aims to help the player improve them. By taking advantage of the unique features of the DS to challenge players, Best of Tests DS calculates the player's IQ and adapt itself to offer a personalized challenge that promises to always be fresh and fun. [Conspiracy Entertainment]… Expand"}, {"name": "The Walking Dead: Survival Instinct", "details_link": "https://www.metacritic.com/game/xbox-360/the-walking-dead-survival-instinct", "publisher": "Activision", "release_date": "Mar 19 2013", "developers": ["Terminal Reality"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Shooter", "Survival", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 32, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/4/e0ca5c77e4a7e5f2906fc9f33fb8ca52-98.jpg", "descriptions": "Terminal Reality’s The Walking Dead video game takes the undead and brings them out of the TV show and into console gaming systems in a new, terrifying way.  The iconic walkers will relentlessly hunt down players like their television counterparts, using a combination of sight, sound andTerminal Reality’s The Walking Dead video game takes the undead and brings them out of the TV show and into console gaming systems in a new, terrifying way.  The iconic walkers will relentlessly hunt down players like their television counterparts, using a combination of sight, sound and smell.  As Daryl, players will need to tread carefully throughout each new area they explore.  Once discovered, it doesn’t take much to attract an unstoppable horde of undead walkers, so every threat needs to be assessed, and every situation analyzed.  Players will have to choose between whether to stay and fight while risking a gruesome death or using stealth to avoid the undead.  No place is truly safe for Daryl as he makes his way through the Georgia countryside in this new, post-apocalyptic world.… Expand"}, {"name": "New World Order", "details_link": "https://www.metacritic.com/game/pc/new-world-order", "publisher": "Strategy First", "release_date": "Mar 18 2003", "developers": ["Termite Games"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 32, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/4/4fe173da03c4d484c1196a51246853ab-98.jpg", "descriptions": "In the near future, terrorist factions known as \"The Syndicate\" are becoming increasingly successful in creating havoc in the world. They are trained mercenaries, specialized in sabotage, kidnapping, destruction and espionage - and there seems no way to stop them. Now, the worldpowers haveIn the near future, terrorist factions known as \"The Syndicate\" are becoming increasingly successful in creating havoc in the world. They are trained mercenaries, specialized in sabotage, kidnapping, destruction and espionage - and there seems no way to stop them. Now, the worldpowers have reacted by forming anti-terrrorist guerilla squads known as the Global Assault Team, who have a mandate to track down and dispose of terrorists any way they see fit, anywhere in the world. You are a rookie member of the Global Assault Team with only one mission: show terrorists it is time to set a New World Order and restore freedom... Play all missions in the singleplayer mode or battle it out online or on a LAN in this next-generation tactical shooter of epic proportions. [Strategy First]… Expand"}, {"name": "The Expendables 2 Videogame", "details_link": "https://www.metacritic.com/game/xbox-360/the-expendables-2-videogame", "publisher": "Ubisoft", "release_date": "Aug 17 2012", "developers": ["ZootFly"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "Shooter", "Third-Person", "Shoot-'Em-Up", "Modern", "Top-Down"], "meta_score": 32, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/2/22eb9dd4fa9176e34baa89ad9e590402-98.jpg", "descriptions": "Building on the universe created in the high-octane, star-studded movies, The Expendables 2 Videogame invites gamers on an adventure to rescue an extremely valuable, kidnapped billionaire. It's all business, until all hell breaks loose and the explosive mix of testosterone and keroseneBuilding on the universe created in the high-octane, star-studded movies, The Expendables 2 Videogame invites gamers on an adventure to rescue an extremely valuable, kidnapped billionaire. It's all business, until all hell breaks loose and the explosive mix of testosterone and kerosene detonates in a massive fireball that never lets up. The adventure concludes right where the new movie begins, creating a continuous story experience for fans of the Expendables' hard-boiled brand of action.… Expand"}, {"name": "Jenga World Tour", "details_link": "https://www.metacritic.com/game/ds/jenga-world-tour", "publisher": "Atari", "release_date": "Nov 13 2007", "developers": ["Atomic Planet Entertainment"], "platforms": "DS", "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Party", "General"], "meta_score": 32, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/b3ac7c0cd0677d62b6e916cf685ae484-98.jpg", "descriptions": "Jenga is based on the world famous wooden block tower building game. Designed to make the most of the innovative control systems on the Wii and DS, the game offers unpredictable, quick- paced, tactical play that combines suspense and risk-taking, where mounting anticipation comes to aJenga is based on the world famous wooden block tower building game. Designed to make the most of the innovative control systems on the Wii and DS, the game offers unpredictable, quick- paced, tactical play that combines suspense and risk-taking, where mounting anticipation comes to a crashing climax. Players of the Wii version can get physical with the Wii Remote and Nunchuk controllers as they battle to keep the Jenga tower from falling, while on the DS the touch screen provides equally intuitive control of the fast-paced action. Players experience sophisticated physics, and a multitude of game-play options (single and multiplayer). The game contains all the fun, intensity and challenge of the original boxed game with a wealth of exciting new enhancements, power-ups and twists that are possible only in the videogame world. [Atari]… Expand"}, {"name": "Fighters Uncaged", "details_link": "https://www.metacritic.com/game/xbox-360/fighters-uncaged", "publisher": "Ubisoft", "release_date": "Nov  4 2010", "developers": ["Ubisoft"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 32, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/5/94e71eacf7e9193ff32907ecffae89a7-98.jpg", "descriptions": "Leveraging the Microsoft Kinect technology, Fighters Uncaged delivers players an immersive total-body combat experience. Players will be able to create 70 different strikes inspired by martial arts and compete in 21 different fighting environments such as rooftops, dark alleys, gritty cityLeveraging the Microsoft Kinect technology, Fighters Uncaged delivers players an immersive total-body combat experience. Players will be able to create 70 different strikes inspired by martial arts and compete in 21 different fighting environments such as rooftops, dark alleys, gritty city docks and abandoned church. Included are diverse opponents with unique fighting styles, devastating combos with voice-activated super strikes, opportunities to upgrade your character by unlocking new skills and a jump-in multiplayer feature to take your enemies down with your friends.… Expand"}, {"name": "Dave Mirra BMX Challenge", "details_link": "https://www.metacritic.com/game/psp/dave-mirra-bmx-challenge", "publisher": "Crave", "release_date": "Nov  2 2006", "developers": ["Left Field Productions"], "platforms": "PSP", "num_players": "4  Online", "genres": ["Driving", "Racing", "Arcade", "Other", "Other"], "meta_score": 32, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/1/30f803173da061ea10d381d712eed0ea-98.jpg", "descriptions": "Dave Mirra is to BMX what Edison was to electricity. What the Wright Brothers were to flight. Like them, he rewrote the rules of what's possible. On the ground or above it, the Miracle Boy has redefined the boundaries of the sport and then promptly surpassed them. Now, the legend of theDave Mirra is to BMX what Edison was to electricity. What the Wright Brothers were to flight. Like them, he rewrote the rules of what's possible. On the ground or above it, the Miracle Boy has redefined the boundaries of the sport and then promptly surpassed them. Now, the legend of the winningnest X Games competitor of all time is on the PSP system, letting you defy gravity wherever you go. With ad hoc wireless play for 1-4 players, you can challenge your friends to racing and freestyle competition and see who's got what it takes to ride with the greatest. 17 levels across 9 different environments. Customizable player characters, with tricked out clothes and gear. 10 Bikes to choose from and customize as you win. [Crave Entertainment]… Expand"}, {"name": "Coliseum", "details_link": "https://www.metacritic.com/game/pc/coliseum", "publisher": "Shrapnel Games", "release_date": "Jan  6 2004", "developers": ["Stormcloud Creations"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Breeding/Constructing", "General"], "meta_score": 32, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/8/812212589fd1eeb626c88e8ad2e93762-98.jpg", "descriptions": "Once, the lands were ripe with warriors of renowned skill, all lusting for glory and fortune through their mastery of swordplay. The king, a wise ruler with keen insight on keeping his subjects happy, decided that these fighters should do battle not in dingy back alleys and rat infestedOnce, the lands were ripe with warriors of renowned skill, all lusting for glory and fortune through their mastery of swordplay. The king, a wise ruler with keen insight on keeping his subjects happy, decided that these fighters should do battle not in dingy back alleys and rat infested warehouses like they were used to, but rather they should be able to showcase their aptitude in an officially sanctioned environment. And so the great Arena was built, and the official Coliseum League was birthed. The sport soon became massively popular. From thousands of leagues away, from every walk of life, the citizenry of the kingdom came to witness the carnage in the arena and cheer on their favorite gladiators. And as in any organized professional sport, there were those that managed the teams of warriors. In a sport where the loser is carted off to feed the crows being a manager is no easy task. Warriors must be carefully groomed for battle. Training is an always ongoing process, and when training doesn't seem to be providing the edge managers may turn to dark sorceries and alchemy. In the end, all of this may be for naught, as old age is still the ultimate leveler of man... In Stormcloud Creations' Coliseum players will get the chance to become those managers. You'll guide three young warriors and with rigorous training, and a little dose of the Gods own luck, transform them into seasoned veterans of the Coliseum circuit. [Shrapnel Games]… Expand"}, {"name": "Kabuki Warriors", "details_link": "https://www.metacritic.com/game/xbox/kabuki-warriors", "publisher": "Crave", "release_date": "Nov 19 2001", "developers": ["Light Weight"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Fighting", "2D"], "meta_score": 32, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/1/b9b393dd793aca365e398d4517a0b8e2-98.jpg", "descriptions": "As a fight promoter for a troop of Kabuki warriors trying to travel from Edo to Kyoto, your actor/samurai must possess both strength and style. Along the way you will have to fight other Kabuki troops, garner the crowds favor to receive tips, and trade warriors with your defeatedAs a fight promoter for a troop of Kabuki warriors trying to travel from Edo to Kyoto, your actor/samurai must possess both strength and style. Along the way you will have to fight other Kabuki troops, garner the crowds favor to receive tips, and trade warriors with your defeated counterparts. You will need a very accomplished group of samurai when you arrive in Kyoto to defeat the city's star troop.… Expand"}, {"name": "Pool Party", "details_link": "https://www.metacritic.com/game/wii/pool-party", "publisher": "SouthPeak Games", "release_date": "Sep  5 2007", "developers": ["SouthPeak Games", "Hyper-Devbox"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 32, "users_score": 1.6, "image": "https://static.metacritic.com/images/products/games/0/23c49ee9f79235ac29aeacf980ae3aca-98.jpg", "descriptions": "Grab your stick and go head-to-head in Pool Party for the Nintendo Wii system. With 13 different types of pool, including 9-Ball, 8-Ball, Rotation, Black Jack and Snooker, there’s a game of billiards to satisfy any pool shark where you will be hustlin’ pros in dive bars, honky-tonks,Grab your stick and go head-to-head in Pool Party for the Nintendo Wii system. With 13 different types of pool, including 9-Ball, 8-Ball, Rotation, Black Jack and Snooker, there’s a game of billiards to satisfy any pool shark where you will be hustlin’ pros in dive bars, honky-tonks, mansions and even yachts. Pool Party includes competitors with intelligent AI and tables with real-world physics. Rack ‘em up! [SouthPeak Interactive]… Expand"}, {"name": "Magus", "details_link": "https://www.metacritic.com/game/playstation-3/magus", "publisher": "Aksys Games", "release_date": "Feb 25 2014", "developers": ["Aksys Games", "Black Tower Studios"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 32, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/4/b4911292ea37feab1fbdd33645bcbc20-98.jpg", "descriptions": "Dating to the creation of the world and mankind, loyalty to the gods and their whims was the central point of the lives of all who inhabit the lands created by the divine. However, as the gods disappeared from people's daily lives, their power and influence began to wane, and cynicism andDating to the creation of the world and mankind, loyalty to the gods and their whims was the central point of the lives of all who inhabit the lands created by the divine. However, as the gods disappeared from people's daily lives, their power and influence began to wane, and cynicism and secularism replaced piety and belief. Amidst the world's slow abandonment of the gods, a profoundly devotee and servant of the gods named Kinna infiltrated one the many prisons of the Waterfall Realm in hopes of finding one who would become a god. Encountering Magus, a prisoner who has spent his entire life incarcerated, she believes that she has found who she was sent to look for. After claiming the powers that were his birthright and learning his true identity, Magus, with Kinna by his side, takes his first steps towards an unknown future. … Expand"}, {"name": "Ghostbusters", "details_link": "https://www.metacritic.com/game/xbox-one/ghostbusters", "publisher": "Activision", "release_date": "Jul 12 2016", "developers": ["Activision", "FireForge Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 32, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/6/2d89f7be4181d2dcf789f0642d0d8fb3-98.jpg", "descriptions": "Have you and your friends been experiencing paranormal activity? Grab your Proton Pack and join the Ghostbusters as you explore Manhattan, blasting ghosts, and trapping those runaway ghouls."}, {"name": "The Simpsons Wrestling", "details_link": "https://www.metacritic.com/game/playstation/the-simpsons-wrestling", "publisher": "Activision", "release_date": "Apr 12 2001", "developers": ["Big Ape Productions"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 32, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/c29fe31028f978857a0f361f3999d77c-98.jpg", "descriptions": "In the end, wit and charm are the two most redeeming features of The Simpsons Wrestling, as it simply can't survive on its gameplay alone."}, {"name": "Tony Hawk's Pro Skater 5", "details_link": "https://www.metacritic.com/game/playstation-4/tony-hawks-pro-skater-5", "publisher": "Activision", "release_date": "Sep 29 2015", "developers": ["Robomodo"], "platforms": ["PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 20 ", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 32, "users_score": 1.5, "image": "https://static.metacritic.com/images/products/games/5/b9a13e640aa26c918c1bcfd97513992c-98.jpg", "descriptions": "THPS 5 offers a new take on combo-driven skateboarding, the most advanced Pro Skater online multiplayer experience in a Tony Hawk game, and a state-of-the-art skatepark builder. Ride, build, and repeat."}, {"name": "Toy Shop", "details_link": "https://www.metacritic.com/game/ds/toy-shop", "publisher": "Majesco Games", "release_date": "Apr 29 2008", "developers": ["Gameinvest", "Seed Studios", "Lda"], "platforms": "DS", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 31, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/5b059f16fe459637842a223cfd79fea5-98.jpg", "descriptions": "When their grandfather passed away, Mel and Mark were left in charge of his toy shop with the condition that if they couldn’t make it successful within three years, it would be donated to the city. It’s up to you to help the two make toys, satisfy demanding customers, explore the city, andWhen their grandfather passed away, Mel and Mark were left in charge of his toy shop with the condition that if they couldn’t make it successful within three years, it would be donated to the city. It’s up to you to help the two make toys, satisfy demanding customers, explore the city, and ultimately return their grandfather’s toy shop back to the booming business it once was. [Majesco]… Expand"}, {"name": "The Asskickers", "details_link": "https://www.metacritic.com/game/pc/the-asskickers", "publisher": "AGO Games", "release_date": "Jul 21 2011", "developers": ["AGO Games"], "platforms": "PC", "genres": ["Action", "Fighting", "Beat-'Em-Up", "2D", "2D"], "meta_score": 31, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/0/2dd54d094e2a995ebf22b93ebb3d39b1-98.jpg", "descriptions": "The Asskickers is 2D co-op & single player ode to the classic beat’em titles from the 80s like Streets of Rage, Kung-Fu Master and Double Dragon."}, {"name": "DreamWorks Kung Fu Panda 2", "details_link": "https://www.metacritic.com/game/playstation-3/dreamworks-kung-fu-panda-2", "publisher": "THQ", "release_date": "May 24 2011", "developers": ["THQ"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 31, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/3e65c3ef336e492a16c8cae6c2c761cd-98.jpg", "descriptions": "Kung Fu Panda 2 the video game begins where the movie leaves off, as Po and the Furious Five venture out to save kung fu from a new evil threat"}, {"name": "Forever Worlds - Enter the Unknown", "details_link": "https://www.metacritic.com/game/pc/forever-worlds---enter-the-unknown", "publisher": "The Adventure Company", "release_date": "Apr  5 2004", "developers": ["Hexagon Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "First-Person", "Fantasy", "Fantasy"], "meta_score": 31, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/3/227f89d72f3757d881d151e3376ffe71-98.jpg", "descriptions": "When world famous paleontologist, Doc Maitland, finds the powerful, mythic tree he?s been searching for all his life, he has no idea of the enormous extent of its power. When he vanishes, his daughter Nancy and her partner, Doctor Jack Lanser, archaeological detective, pick up the Doc?sWhen world famous paleontologist, Doc Maitland, finds the powerful, mythic tree he?s been searching for all his life, he has no idea of the enormous extent of its power. When he vanishes, his daughter Nancy and her partner, Doctor Jack Lanser, archaeological detective, pick up the Doc?s trail in the deep jungle of the Amazon headwaters. While trying to find his senior mentor, Jack gets caught by a spell of a different nature and must find his own way through a chain of non-parallel dimensions and figure out how to prevent it all from taking place before it even happens. In danger of being lost for an eternity, Jack has to find his way through a strange and amazing universe to save himself and Doc Maitland from the Forever Worlds. [DreamCatcher Interactive]… Expand"}, {"name": "Dino Dini's Kick Off Revival", "details_link": "https://www.metacritic.com/game/playstation-4/dino-dinis-kick-off-revival", "publisher": "The Digital Lounge", "release_date": "Jun 23 2016", "developers": ["The Digital Lounge", "Dino Dini"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Team", "Soccer", "Arcade"], "meta_score": 31, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/5acecc67ee836a7a4af5dae84df9b285-98.jpg", "descriptions": "Three game modes: Practice, Single Game, European Cup; Online gaming: 1 vs 1 with random matchmaking, invites and leaderboards; Offline multiplayer: 1 vs 1; 24 European teams; Radar for full view of the pitch; Tactics (4-4-2, 4-2-4, 5-3-2, etc)"}, {"name": "Dream Chronicles", "details_link": "https://www.metacritic.com/game/playstation-3/dream-chronicles", "publisher": "Hudson Entertainment", "release_date": "Nov 23 2010", "developers": ["PlayFirst"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Hidden Object", "General", "Puzzle", "General"], "meta_score": 31, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/5007ddf7149cf1f9b80d010610a97a3e-98.jpg", "descriptions": "Unlock the secrets of the beautiful and mysterious fairy realm in the third installment of the award-winning Dream Chronicles series. Discover hidden clues and solve challenging puzzles as you join Faye on her quest to save her daughter from the clutches of the Fairy Queen Lilith with theUnlock the secrets of the beautiful and mysterious fairy realm in the third installment of the award-winning Dream Chronicles series. Discover hidden clues and solve challenging puzzles as you join Faye on her quest to save her daughter from the clutches of the Fairy Queen Lilith with the assistance of her husband Fidget. Reveal the secret prophecy of The Chosen Child as you unlock the Nexus to solve puzzles that span across multiple areas and immerse yourself in this all-new hunt-and-seek adventure with unexpected twists that will keep you searching for answers throughout the game.… Expand"}, {"name": "CID The Dummy", "details_link": "https://www.metacritic.com/game/wii/cid-the-dummy", "publisher": "Oxygen Interactive", "release_date": "Jul  7 2009", "developers": ["Twelve Games"], "platforms": ["PC", "PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 31, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/19058094cdab528095e191ba510b4fdb-98.jpg", "descriptions": "In a world obsessed with safety, with potential danger around every corner.  A world where the once lowly Crash Impact Dummy has risen to a position of great importance amongst us, responsible for crashing, smashing, checking and re-checking everything from lemonade to escalators; CID hasIn a world obsessed with safety, with potential danger around every corner.  A world where the once lowly Crash Impact Dummy has risen to a position of great importance amongst us, responsible for crashing, smashing, checking and re-checking everything from lemonade to escalators; CID has been chosen for the mission of a life time. A chance to crash and smash with real purpose, to battle the most fierce robot villain, a chance to rescue the most beautiful girl in the world: a chance to do something amazing. With high speed crashes, turbo-charged weapons, kung-fu fighting, mind-boggling puzzles and level systems and more monsters than you can shake a super-charged fire-blazing bazooka at. Join CID to save the world, the day and the girl in this years most daring adventure. CID The Dummy - Save the world, the day and the girl! [Oxygen Games]… Expand"}, {"name": "Smash 'N' Survive", "details_link": "https://www.metacritic.com/game/playstation-3/smash-n-survive", "publisher": "Version2Games Limited", "release_date": "Feb 22 2012", "developers": ["Version2Games Limited"], "platforms": ["iPhone/iPad", "PlayStation 3"], "genres": ["Driving", "Racing", "General", "General"], "meta_score": 31, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/a763abd423deaa48301e67ddb37d37ff-98.jpg", "descriptions": "The core gameplay of Smash 'N' Survive revolves around vehicle combat and it seems like it's the season of vehicle combat revival. Smash 'N' Survive features several innovations like a physics-based tornado where you can push your enemies or get pushed and \"juiced\" in those destructiveThe core gameplay of Smash 'N' Survive revolves around vehicle combat and it seems like it's the season of vehicle combat revival. Smash 'N' Survive features several innovations like a physics-based tornado where you can push your enemies or get pushed and \"juiced\" in those destructive tornadoes.This tornado is only one such environmental weapon which you can use to your advantage. Various maps have catapults, crushers and other objects which you can use to kick trash and annihilate your opponents.What makes Smash 'N' Survive stand out from the rest is that all the weapons and their behaviours are so unique. Another important point is that it's not a mindless fun jaunt and you can't proceed without planning your attack or without having a strategy in place.The game features 10 maps ranging from small arenas to big huge levels, giving you an opportunity to try different things. The game features 30+ concept cars and here comes another first these cars are equipped with melee weapons, so no run-of-the-mill rocket launchers or machine guns, but brutal plungers, blades, saws and some geeky weapons like a magneto repulsor. Not all the weapons deal damage and some of them will either throw opponents or topple them, allowing you to plan your attack.The game offers a campaign mode that has 19 missions, and each mission has primary and secondary objectives. On successful completion of the primary objective, you earn bounty, unlock new cars, unlock new game modes, and unlock new maps and modes for versus mode.Game modes include territory control, survival, planting a bomb and team deathmatch. Most of the missions revolve around these themes but there are some others like derby, checkpoint race, escorting your mate, killing the convoy, chase, etc. Most of these game modes can be played individually once you unlock them from the campaign.… Expand"}, {"name": "Big Oil: Build an Oil Empire", "details_link": "https://www.metacritic.com/game/pc/big-oil-build-an-oil-empire", "publisher": "Tri Synergy", "release_date": "Jul 31 2006", "developers": ["Tri Synergy"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Breeding/Constructing", "General", "Management", "Breeding/Constructing", "Business / Tycoon"], "meta_score": 31, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/9/bb2d7f1d18de54367c06cb43816ac37c-98.jpg", "descriptions": "Big Oil leads you into times of the oil industry pioneers. Start your career in one of the historical scenarios or face the challenge of modern times. Found your very own company and lead it to the biggest oil imperium on earth. Whether in single player or multiplayer, demonstrate yourBig Oil leads you into times of the oil industry pioneers. Start your career in one of the historical scenarios or face the challenge of modern times. Found your very own company and lead it to the biggest oil imperium on earth. Whether in single player or multiplayer, demonstrate your strategic ability to become the next \"Anaconda\" Rockefeller of the BIG OIL world. Build an oil empire. Turn crude to cash. Seventeen historical and modern scenarios from the beginning of the 20th Century until today. Challenging game modes such as historical scenarios, easy or advanced mode, single-player or multiplayer up to 6 players. Extra class graphics with the 3D-Oxygene-Engine. Over 300 different buildings and vehicles out of 3 centuries. Exact historical events such as earthquakes, wars and other catastrophes with direct influence on your company. Complex simulation of real cities like Los Angeles with job market, infrastructure and schools. [Tri Synergy]… Expand"}, {"name": "ESPN Sports Connection", "details_link": "https://www.metacritic.com/game/wii-u/espn-sports-connection", "publisher": "Ubisoft", "release_date": "Nov 13 2012", "developers": ["Ubisoft"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General", "Individual", "Athletics"], "meta_score": 31, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/4/cdb93886d313ac8ef9c22fce7852f821-98.jpg", "descriptions": "Play on your own, team up in co-op to experience new gameplay possibilities, or compete in multiplayer to take full advantage of Nintendo’s New Controller. Play six of the most popular sports: soccer, football, baseball, tennis, golf, and karting. Use the New Controller to control a blitz inPlay on your own, team up in co-op to experience new gameplay possibilities, or compete in multiplayer to take full advantage of Nintendo’s New Controller. Play six of the most popular sports: soccer, football, baseball, tennis, golf, and karting. Use the New Controller to control a blitz in football to sack the quarterback or score a curled free kick in soccer. Play with Wii MotionPlus using real sports gestures! Swing with precision in golf or hit a home run in baseball. … Expand"}, {"name": "Robocop", "details_link": "https://www.metacritic.com/game/xbox/robocop", "publisher": "Titus Software", "release_date": "Jul 24 2003", "developers": ["Titus Software"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 30, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/5/be9e17eac7c365e9c9237463a356e576-98.jpg", "descriptions": "Step into the shoes of the half-man, half-human hybrid known as Robocop. Your mission is to uncover a sinister plot involving OCP, local gangsters dealing a deadly new synthetic drug and a powerful cyborg known only as MIND. As the police force's last hope, you must capture, destroy, orStep into the shoes of the half-man, half-human hybrid known as Robocop. Your mission is to uncover a sinister plot involving OCP, local gangsters dealing a deadly new synthetic drug and a powerful cyborg known only as MIND. As the police force's last hope, you must capture, destroy, or arrest hostile characters in a desperate search for clues and evidence. Protect the innocent using six different weapons, various power-ups, and Robocop's multitarget locking system. … Expand"}, {"name": "Crime Life: Gang Wars", "details_link": "https://www.metacritic.com/game/xbox/crime-life-gang-wars", "publisher": "Konami", "release_date": "Nov 22 2005", "developers": ["Hothouse Creations"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 30, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/7/ce8696cfc3cf7808e935ef70ba5044fc-98.jpg", "descriptions": "Crime Life: Gang Wars is a free roaming crime-based beat em up. Mixing action and strategy elements within a gritty, detailed storyline to explore modern-day urban gang culture, the player is cast as a small-time homie who must work their way through the ranks to become a gang leader. UrbanCrime Life: Gang Wars is a free roaming crime-based beat em up. Mixing action and strategy elements within a gritty, detailed storyline to explore modern-day urban gang culture, the player is cast as a small-time homie who must work their way through the ranks to become a gang leader. Urban culture and the Hip Hop lifestyle is the focus of Crime Life: Gang Wars. The game boasts a strong narrative that shows the dangers and strains associated with gang membership, and promotes a strong sense of morality via game elements inspired by classic gang movies, such as \"New Jack City,\" \"Boyz 'n the Hood\" and \"Menace to Society.\" The player must protect his own people from exploitation and abuse, and defend his crew from the violence and treachery that permeates the society he lives in. The game is set within Grand Central City, a sprawling metropolis where ruthless gangs are vying for power as the police struggle to contain them. Reputation is everything, and for the player to survive he must establish himself as the toughest fighter against the most menacing gang members out there, all of whom are battling for street supremacy. The player will always feel like his next fight could finish him or make his name forever.… Expand"}, {"name": "Ghostbusters", "details_link": "https://www.metacritic.com/game/playstation-4/ghostbusters", "publisher": "Activision", "release_date": "Jul 12 2016", "developers": ["Activision", "FireForge Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 30, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/5/ee56b802653dd26717b8883f65d102c0-98.jpg", "descriptions": "Have you and your friends been experiencing paranormal activity? Grab your Proton Pack and join the Ghostbusters as you explore Manhattan, blasting ghosts, and trapping those runaway ghouls."}, {"name": "MTV's Celebrity Deathmatch", "details_link": "https://www.metacritic.com/game/pc/mtvs-celebrity-deathmatch", "publisher": "Gotham Games", "release_date": "Oct 14 2003", "developers": ["Big Ape Productions"], "platforms": ["PlayStation 2", "PC"], "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 30, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/75417ff8b8c4faf820c686ec69676d0d-98.jpg", "descriptions": "Finally take control of MTV's Celebrity Deathmatch and play as any one of over 20 celebrities to rumble in some of the greatest battles in the ring. Announcers Nick Diamond and Johnny Gomez provide color commentary as you rock in this first rate bloodbath coming to consoles this Spring.Finally take control of MTV's Celebrity Deathmatch and play as any one of over 20 celebrities to rumble in some of the greatest battles in the ring. Announcers Nick Diamond and Johnny Gomez provide color commentary as you rock in this first rate bloodbath coming to consoles this Spring. Episode Mode: Choose one of three different character match-ups. Nick and Johnny provide pre, post, and play-by-play commentary. Over 20 celebrities to choose from including, some never before seen in the TV show. Other characters are also available from show specials. Original show hosts Nick Diamond and Johnny Gomez provide color commentary while ref Mills Lane calls the shots. [Gotham Games]… Expand"}, {"name": "Vampire Rain: Altered Species", "details_link": "https://www.metacritic.com/game/playstation-3/vampire-rain-altered-species", "publisher": "Ignition Entertainment", "release_date": "Sep  2 2008", "developers": ["Artoon"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 30, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/9/2f4e653abda3dbd74df6d104e8e87dc0-98.jpg", "descriptions": "Vampire Rain: Altered Species is an intense game of stealth, survival and all out skill that takes place during a cold, wet night in a suburban, west coast city in the US. For some time now, mankind has been battling the ferocious and terrifying Nightwalkers, a race of superhuman vampiresVampire Rain: Altered Species is an intense game of stealth, survival and all out skill that takes place during a cold, wet night in a suburban, west coast city in the US. For some time now, mankind has been battling the ferocious and terrifying Nightwalkers, a race of superhuman vampires who crave human blood. People have been disappearing at night; the lucky ones are found dead, but those less fortunate are reborn as Nightwalkers, and are bound by instinct to forcefully recruit unwitting victims into the Nightwalker army. Gamers take the role of John Lloyd, a member of a US special government unit created to defeat the Nightwalkers, and the only human to ever survive a physical encounter with them. [Ignition Entertainment]… Expand"}, {"name": "ShellShock 2: Blood Trails", "details_link": "https://www.metacritic.com/game/xbox-360/shellshock-2-blood-trails", "publisher": "Eidos Interactive", "release_date": "Feb 24 2009", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Historic", "Historic", "Historic", "Arcade"], "meta_score": 30, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/72d0632beca706835b69ed1cb47d67f5-98.jpg", "descriptions": "ShellShock 2: Blood Trails is a violent, first-person, survival horror game set against the backdrop of the Vietnam War. Gameplay centers on the use of psychological horror and fear, relying on the power of suggestion, mood, tension and foreshadowing - implying the notion of danger,ShellShock 2: Blood Trails is a violent, first-person, survival horror game set against the backdrop of the Vietnam War. Gameplay centers on the use of psychological horror and fear, relying on the power of suggestion, mood, tension and foreshadowing - implying the notion of danger, potential danger, imminent danger, and horrifying acts that have or are implied to have occurred or will come to pass. On course for war torn Vietnam, a plane carrying a top-secret cargo known only as Whiteknight is lost over the uncharted jungles of Cambodia. The special ops squad sent in to retrieve it disappear wtihout trace. Until, a month later, one of them walks out. Something in the darkness has driven him insane... Something from the darkness has followed him out. [Eidos Interactive]… Expand"}, {"name": "POSTAL 4: No Regerts", "details_link": "https://www.metacritic.com/game/pc/postal-4-no-regerts", "publisher": "Running With Scissors", "release_date": "Apr 20 2022", "developers": ["Running With Scissors"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Open-World", "First-Person", "Arcade"], "meta_score": 30, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/1792a3898f5f04977a0c17e1cfd780df-98.jpg", "descriptions": "Several years have passed since the events that devastated the once proud town remembered as Paradise. The only two to walk away from the cataclysm unscathed, the hapless everyman known as the POSTAL Dude and his loyal companion Champ, drive aimlessly through the scorching deserts of ArizonaSeveral years have passed since the events that devastated the once proud town remembered as Paradise. The only two to walk away from the cataclysm unscathed, the hapless everyman known as the POSTAL Dude and his loyal companion Champ, drive aimlessly through the scorching deserts of Arizona looking for a new place to call home. After a fortuitous gas station rest stop ends with their car, trailer home, and the rest of their worldly possessions stolen, all the Dude’s seemingly got left to his name is his canine cohort and his bathrobe, and neither of them smells all that great. However, on the horizon, the duo glimpses an unfamiliar and dazzling town that beckons to them. What untold prospects lie within? Fame? Fortune? Maybe a bidet or two? Edensin awaits. POSTAL 4: No Regerts is a satirical and outrageous comedic open world first person shooter and the long-awaited true sequel to what’s been fondly dubbed as \"The Worst Game Ever™\", POSTAL 2! (No third game is known to exist.)… Expand"}, {"name": "Soda Drinker Pro", "details_link": "https://www.metacritic.com/game/xbox-one/soda-drinker-pro", "publisher": "Snowrunner Games", "release_date": "Apr 14 2016", "developers": ["Snowrunner Games"], "platforms": ["PC", "Xbox One"], "genres": ["Miscellaneous", "General"], "meta_score": 30, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/dde3914aa9a85a40f94ea01234af5698-98.jpg", "descriptions": "Soda Drinker Pro mixes the accuracy of Microsoft Flight Simulator with the soda of soda, leaving the player no longer thirsty and trapped in a beautiful world where they can experience every aspect of soda.\r Tightly engineered controls allow the player to decide when to bring the soda cupSoda Drinker Pro mixes the accuracy of Microsoft Flight Simulator with the soda of soda, leaving the player no longer thirsty and trapped in a beautiful world where they can experience every aspect of soda.\r Tightly engineered controls allow the player to decide when to bring the soda cup to mouth, and when to sip.\r Soda Drinker Pro even gives the player the much-anticipated ability to walk to the top of a hill and drink a soda at whatever speed they wish.\rAnything is possible in soda drinker pro, and soda is possible.… Expand"}, {"name": "Fear Factor: Unleashed", "details_link": "https://www.metacritic.com/game/game-boy-advance/fear-factor-unleashed", "publisher": "Hip Games", "release_date": "Nov 17 2004", "developers": ["DC Studios"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 30, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/7/abc1fb2ec224c9748c5dbaa5e73510d4-98.jpg", "descriptions": "Fear Factor: Unleashed puts you inside the action of the hit television show, Fear Factor. Conquer 12 spine-tingling stunts that test your steadiness, nerve, stamina and stomach in this action-packed game. Create your own profile and compete against a colorful cast of characters who areFear Factor: Unleashed puts you inside the action of the hit television show, Fear Factor. Conquer 12 spine-tingling stunts that test your steadiness, nerve, stamina and stomach in this action-packed game. Create your own profile and compete against a colorful cast of characters who are determined to prove that fear is a factor for you!… Expand"}, {"name": "Air Conflicts: Vietnam Ultimate Edition", "details_link": "https://www.metacritic.com/game/playstation-4/air-conflicts-vietnam-ultimate-edition", "publisher": "Majesco Games", "release_date": "Sep 16 2014", "developers": ["bitComposer Entertainment AG", "bitComposer"], "platforms": "PlayStation 4", "num_players": "Up to 8 ", "genres": ["Action", "Simulation", "Flight", "Combat"], "meta_score": 30, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/6/382e9a4941960116b77a7bfe89a0bd3c-98.jpg", "descriptions": "Take to the skies above Vietnam and fly for both sides of this explosive conflict.\r All-out aerial warfare\r\n\r\nExperience the horrors and heroism of the Vietnam War and prove your worth in aerial dogfights, daring helicopter missions and intense multiplayer battles.\r\n\r\nImmerse yourself inTake to the skies above Vietnam and fly for both sides of this explosive conflict.\r All-out aerial warfare\r Experience the horrors and heroism of the Vietnam War and prove your worth in aerial dogfights, daring helicopter missions and intense multiplayer battles.\r Immerse yourself in an emotionally charged storyline as Joe Thompson, a courageous and determined pilot in the US Navy fighting for the ideals of his country - then experience the fight from the other side as Vietnamese pilot Nguyen An Toon in the \"Lost Letters\" campaign.… Expand"}, {"name": "Transformers: Dark of the Moon - Stealth Force Edition", "details_link": "https://www.metacritic.com/game/3ds/transformers-dark-of-the-moon---stealth-force-edition", "publisher": "Activision", "release_date": "Jun 14 2011", "developers": ["Behaviour Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "3DS"], "num_players": "1 Player", "genres": ["Action", "Driving", "Action Adventure", "General", "Car Combat", "General", "Linear"], "meta_score": 30, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/2/85761139f480c32c92ba562c5667dd40-98.jpg", "descriptions": "It has been three years since MEGATRON and the DECEPTICONS last threatened the world. Earth's leaders believe that MEGATRON has fled the planet in defeat-but OPTIMUS PRIME knows better. An alien transmission is intercepted, exposing MEGATRON'S plan to spread chaos and fear among the humans,It has been three years since MEGATRON and the DECEPTICONS last threatened the world. Earth's leaders believe that MEGATRON has fled the planet in defeat-but OPTIMUS PRIME knows better. An alien transmission is intercepted, exposing MEGATRON'S plan to spread chaos and fear among the humans, and unleash the ultimate DECEPTICON assassin: SHOCKWAVE! The AUTOBOTS must hunt MEGATRON, neutralize SHOCKWAVE, and save their new home from total destruction at the hands of the DECEPTICONS.… Expand"}, {"name": "Saban's Power Rangers Megaforce", "details_link": "https://www.metacritic.com/game/3ds/sabans-power-rangers-megaforce", "publisher": "Namco Bandai Games", "release_date": "Nov  5 2013", "developers": ["Digital Works Entertainment"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Beat-'Em-Up", "2D"], "meta_score": 30, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/a0a951ed763de41e4ffae072f5458b0f-98.jpg", "descriptions": "In this new chapter of the popular Power Rangers video game series, fans play as their favorite Megaforce Ranger while the supporting Power Rangers provide their boundless advice and encouragement to players as they battle their way through challenge after challenge. The Rangers' vocal andIn this new chapter of the popular Power Rangers video game series, fans play as their favorite Megaforce Ranger while the supporting Power Rangers provide their boundless advice and encouragement to players as they battle their way through challenge after challenge. The Rangers' vocal and physical support will prove valuable as challenging situations and conditions arise in an attempt to foil players' advancement. Power Rangers MEGAFORCE will plunge players into intense battles against repulsive enemies, but by forming gigantic Megazords, the Rangers will be able to implement powerful combos to help get them on the path to victory.… Expand"}, {"name": "Tunnel Rats: 1968", "details_link": "https://www.metacritic.com/game/pc/tunnel-rats-1968", "publisher": "Boll AG", "release_date": "May 15 2009", "developers": ["Replay Studios", "Team Toro"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Arcade"], "meta_score": 30, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/5/b6e021c59fd297f8e730bd9621e65fe7-98.jpg", "descriptions": "Tunnel Rats is a dark and intense single-player shooter for PC that depicts the horrific realities of the Vietnam War as seen through the eyes of a young US soldier. As member of a \"Tunnel Rats\" squad, the player is trained to clearing out the huge tunnel systems underneath the jungle ofTunnel Rats is a dark and intense single-player shooter for PC that depicts the horrific realities of the Vietnam War as seen through the eyes of a young US soldier. As member of a \"Tunnel Rats\" squad, the player is trained to clearing out the huge tunnel systems underneath the jungle of Vietnam. After all of his mates got killed in an ambush, the young GI finds himself all alone, fighting against the Vietcong, their deadly traps and his growing inner madness. [Steam]… Expand"}, {"name": "Hoodwink", "details_link": "https://www.metacritic.com/game/pc/hoodwink", "publisher": "E-One Studio", "release_date": "Jun 28 2012", "developers": ["E-One Studio"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 29, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/2/504d60561db87313fc82f8968f4b6070-98.jpg", "descriptions": "Hoodwink is a classic point and click adventure, in which you play Michael Bezzle, a smart-mouthed bumbling scoundrel seeking to turn over a new leaf and settle down with his girlfriend. However his luck takes a turn for the worse when his final caper lands him in trouble with the governmentHoodwink is a classic point and click adventure, in which you play Michael Bezzle, a smart-mouthed bumbling scoundrel seeking to turn over a new leaf and settle down with his girlfriend. However his luck takes a turn for the worse when his final caper lands him in trouble with the government and he must rely on his wits as he gets further enmeshed in the machinations of the state.… Expand"}, {"name": "ARK: Survival Evolved", "details_link": "https://www.metacritic.com/game/switch/ark-survival-evolved", "publisher": "Studio Wildcard", "release_date": "Nov 30 2018", "developers": ["Studio Wildcard"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "Survival", "Sandbox"], "meta_score": 29, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/3/123b6c7bcb97ebf1d301cfaa5757d69a-98.jpg", "descriptions": "As a man or woman stranded naked, freezing and starving on the shores of a mysterious island called ARK, you must hunt, harvest resources, craft items, grow crops, research technologies and build shelters to withstand the harsh elements. Use your cunning and resources to kill or tame & breedAs a man or woman stranded naked, freezing and starving on the shores of a mysterious island called ARK, you must hunt, harvest resources, craft items, grow crops, research technologies and build shelters to withstand the harsh elements. Use your cunning and resources to kill or tame & breed the leviathan dinosaurs and other primeval creatures roaming the land, and team up with or prey on hundreds of other players to survive, dominateand escape!\r FEATURES:\r * Use cunning strategy and tactics to tame, train, ride and breed the 100+ dinosaurs and other primeval creatures roaming the dynamic, persistent ecosystems across land, sea, air, and even underground.\r * Build your character's strengths and gain items, skills, and pet creatures using in-depth role-playing systems.\r * Start a tribe with hundreds of other players to survive and dominate competing tribes...and ultimately discover ARK's true purpose.\r * Build a fire or shelter, then craft customizable clothing & armors to help protect against damage and extreme temperatures on your way to unlocking advanced technologies and equipment.\r * Chop down trees and mine metal and other precious resources to build massive multi-leveled structures composed of complex snap-linked parts.… Expand"}, {"name": "XIII (Remake)", "details_link": "https://www.metacritic.com/game/pc/xiii-remake", "publisher": "Microids", "release_date": "Nov 10 2020", "developers": ["PlayMagic Ltd"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 29, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/2/4ff5b398c625082d43ef6efe6b76fbc4-98.jpg", "descriptions": "XIII is a remake of the cult first-person action game that was initially released in 2003. You play as \"XIII\", a man without an identity, in a solo campaign with numerous twists and turns. Inspired by the eponymous graphic novel, the game features a completely reinvented and uniqueXIII is a remake of the cult first-person action game that was initially released in 2003. You play as \"XIII\", a man without an identity, in a solo campaign with numerous twists and turns. Inspired by the eponymous graphic novel, the game features a completely reinvented and unique cel-shading design. In XIII, players can also take part in fierce multi-player fights.The country remains in a state of shock following the assassination of President Sheridan. You wake up, wounded and with amnesia, on a deserted beach on the east coast. The only clues as to your identity are a tattoo of the number XIII near your collarbone and a locker key. Even though your memory is failing, you discover that you have the reflexes of a highly trained professional fighter. You set off in search of your past, discovering that you played a role in the murder of the President of the United States of America, and revealing the most astounding conspiracy ever hatched in the country's history.… Expand"}]